{
    "posts": [
        {
            "category": "HOT",
            "title": "RFK Jr. says Covid-19 shot will no longer be recommended for healthy children and pregnant women",
            "external_url": "https://www.cnn.com/2025/05/27/health/covid-vaccine-pregnant-women-children-recommendation",
            "upvotes": 13529,
            "date": "05/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2210921664.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Also RFK Jr \"No one should take medical advice from me.\"",
                "Ok but will insurance still cover it for kids if a parent wants to?",
                "Coincidentally, living in America is also not recommended for healthy children and pregnant women.",
                "I’m convinced his father’s killer was a time traveler who screwed up and killed the wrong one.\n\nLike someone from the future wanted to prevent the problems he’s caused, but turned the dial too far.",
                "Contact with RFK Jr cannot be safely recommended for healthy children or pregnant women.",
                "I’m going to go ahead and disregard that since he said we shouldn’t take medical advice from him.",
                "It’s wild that politicians and employees of health insurance companies can legally practice medicine without a license.\n\nAmerica is just an average, violent, corrupt shit hole third world country.",
                "Meanwhile, in Scientific American: [Long COVID Is Harming Too Many Kids](https://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/)\n\n>Pediatric long COVID is more common than many thought, and we keep letting kids be reinfected with new variants... \n\n>... The American Medical Association’s top journal, *JAMA,* in August published a key new [study](https://jamanetwork.com/journals/jama/fullarticle/2822770) and [editorial](https://jamanetwork.com/journals/jama/article-abstract/2822771) about pediatric long COVID. The editorial cites several robust analyses and concludes that, while uncertainty remains, long COVID symptoms appear to occur after about 10 percent to 20 percent of pediatric infections.\n\nIt's like we're speedrunning the collapse of America.",
                "Let's see the double blind data from the peer reviewed study.",
                "It's worth noting that getting COVID during pregnancy increases a lot of risks for mother and baby:\n\nhttps://bmjgroup.com/covid-19-infection-at-any-time-during-pregnancy-boosts-mothers-risk-of-death/\n\nhttps://www.nichd.nih.gov/research/supported/COVID/NICHD_Populations/Preg_Post/how-covid-19-affects-pregnancy\n\nhttps://www.nature.com/articles/s41467-023-44549-5\n\nhttps://www.nhlbi.nih.gov/news/2024/study-uncovers-long-covid-risk-during-pregnancy\n\nhttps://www.rcog.org.uk/guidance/coronavirus-covid-19-pregnancy-and-women-s-health/coronavirus-covid-19-infection-in-pregnancy/coronavirus-covid-19-infection-and-pregnancy-faqs/\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC9122838/\n\nNot to mention the risk to children:\n\nhttps://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "NPR sues Trump over executive order cutting federal funding",
            "external_url": "https://www.nbcnews.com/politics/trump-administration/npr-sues-trump-executive-order-cutting-federal-funding-rcna209170",
            "upvotes": 14432,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250502-npr-mb-0756-b5e7de.jpg",
            "top_comments": [
                "So glad my federal tax dollars pay for Golf and nothing else.",
                "And NPR will win like every other group suing Trump for violating the Constitution. Congress controls the purse, not the president. If Trump wants NPR defunded, Congress will need to do it.",
                "Hard to be a shittier American than a Trump supporter these days",
                "Here are some links:\n\nComplaint: [https://storage.courtlistener.com/recap/gov.uscourts.dcd.280953/gov.uscourts.dcd.280953.1.0.pdf](https://storage.courtlistener.com/recap/gov.uscourts.dcd.280953/gov.uscourts.dcd.280953.1.0.pdf)\n\nDocket: [https://www.courtlistener.com/docket/70376503/national-public-radio-inc-v-trump/](https://www.courtlistener.com/docket/70376503/national-public-radio-inc-v-trump/)\n\nExecutive Order: [https://www.whitehouse.gov/presidential-actions/2025/05/ending-taxpayer-subsidization-of-biased-media/](https://www.whitehouse.gov/presidential-actions/2025/05/ending-taxpayer-subsidization-of-biased-media/)",
                "Living in a rural community, NPR gives you broad access to a ton of local information that you are hard to get from other sources. And it's not even biased information at the local level, it's just community building. If you turn on the local TV news, it's crime and murders. Local NPR is culture.",
                "More willing to go to war with his own country than actual enemies abroad like Russia for example. Never thought I'd see the day were we'd be in this position. At least I didnt forsee it being this stupid.",
                "All the $ and time wasted on lawsuits.",
                "Going after NPR and PBS... who was angry at those people again? Just because they're one of the few media outlets today with even a little integrity and propriety? Or is it because along with that, they dare to not fawn over the Cheeto in Charge?\n\nHis executive orders are a joke and not legal or constitutional. May this and other lawsuits quickly show just how little power our little dicktater actually has.",
                "Your regular reminder that Republicans control Congress and could pass a law to enact Trump's executive orders legally any time they wanted to, but instead they're going to do nothing and rile people up against judges when the illegal EOs get struck down.",
                "I don't understand why there's not like a Supreme Court case of the President not having power of the purse by now. He's acting like a one man legislature."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "President Donald Trump pardons former Virginia sheriff Scott Jenkins convicted of fraud and bribery",
            "external_url": "https://www.bbc.com/news/articles/cwynp1lw0l7o",
            "upvotes": 9069,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3106/live/80655280-3ade-11f0-a379-ddaa80eac7b4.jpg",
            "top_comments": [
                "I thought we were deporting criminals 🤔 ",
                ">“Scott Jenkins violated his oath of office and the faith the citizens of Culpeper County placed in him when he engaged in a cash-for-badges scheme,” Acting United States Attorney Zachary T. Lee said today. “We hold our elected law enforcement officials to a higher standard of conduct and this case proves that when those officials use their authority for unjust personal enrichment, the Department of Justice will hold them accountable. I am grateful to the FBI for their tireless work on this investigation.”\n\nDude handed out badges for money. Convicted felon Donald Trump thinks this is OK.",
                "It is truly sad that America elected a felon to the highest office in the land.\n\nWe are seeing this felons corrupt activity on a daily basis.  America has lost it's way.",
                "It's not a joke, it's a good thing Obama took out Bin Ladin because Trump would have buddied up to him by now if he was still alive.\n\n77 million idiots are good with this orange turd.",
                "TIL Virginia does not have state laws against fraud and bribery",
                "so much for fighting against fraud, waste and abuse!!!!",
                "This is the most corrupt presidency in modern history.  Trump is a criminal, scumbag and everyone that supports him.",
                "White collar fraudster pardons blue collar fraudster.",
                "Fat fuck frees fat fuck.",
                "States should prosecute irrespective of what the feds do so that this kind of thing doesn't happen anymore - at least so long as the dual sovereignty doctrine is still a thing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US Supreme Court rejects case about student's 'There are only two genders' T-shirt",
            "external_url": "https://www.reuters.com/world/us/us-supreme-court-rejects-case-about-students-there-are-only-two-genders-t-shirt-2025-05-27/",
            "upvotes": 2538,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh no. His parent's get rich quick scam failed. \n\nSorry about that.",
                "So essentially a 12 year old was told to wear a shirt by his parents, and instead of accepting that the shirt is unreasonable and against policy, they decide to sue and use political discourse as a payday. \n\n  \nAbsolutely pathetic.",
                "That's about right. \n\nYou can't tie schools hands when enforcing dress codes. \n\nIF they had given this one a pass everyone and their brother could wear whatever offensive slogans and words they want in school and teachers would be powerless to enforce *any* sort of standards, or to make it clear that the school environment is not a place for political or civic disputes by immature teenage blowhards looking to pick a fight. \n\nThis shirt is no different then one that says \"African Americans are myth\" or \"there was no holocaust\", you can have those stupid and obviously asinine opinions, but when you are in school, administrators need to have the ability to keep you from inciting conflicts on school grounds... by wearing certain items *meant* to inflame and cause conflict.",
                "This is so bonkers, and manifestly done in bad faith.\n\nConservatives are the ones who WANT schools to be able to exercise greater-than-normal authority over students' speech.\n\n*Tinker v. Des Moines* in 1969 is the key controlling decision; in that case students sued their school after the school told them they could not wear black armbands to protest the Vietnam War. Guess which side the conservatives were on then? It wasn't the side that wants students to be able to wear political messages on their clothes in school!\n\nIn *Bethel School District v Frasier* in 1986, the Supreme Court held that schools have the right to restrict / prohibit student speech (in this case, vulgar innuendo in a commencement address). Again, conservatives would absolutely not want that student right restored / expanded.\n\nExcept but now we're supposed to believe that conservatives legitimately hold the opposite beliefs?\n\nCome on.\n\nOnce again, I resent how dumb and gullible right-wingers assume the rest of us are. The fucking nerve of these asswipes!",
                "Conservatives, just so I understand...\n\nIt's free speech to be on a government operated campus (public school) and denounce gender identity, but NOT free speech to be on a privately owned campus (a private college) and denounce Israel's handling of their war?\n\nThe latter is NOT free speech, but the former is?? Is that how this works?",
                "The \"I should be able to lie and insult anyone, anywhere, anytime\" free speech people.  \nThey create a Venn diagram that looks like a circle with the \"talking shit about Trump should land you in jail\" people. Very odd.",
                ">His lawyers wrote that Morrison \"hoped to start a meaningful conversation on gender ideology\" as well as to protect other students against ideas that he considered \"false and harmful\" and to \"show them compassionate people can believe that sex is binary.\"\n\nLOL oh bullshit, what does a 12 year old know about sex? This idiot isn't on some kind of enlightenment mission from a higher calling, he's a prop being used by his shit heel parents to cynically exploit a right-wing driven culture war issue.",
                "Always Alto and Thomas being shitheads together.",
                ">Student Liam Morrison, along with his father and stepmother, sued officials at John T. Nichols Middle School and the town of Middleborough, seeking monetary damages.\n>While in seventh grade, Morrison wore the T-shirt reading \"There are only two genders\" to school in March 2023. His lawyers said in court papers he did so to \"share his view that gender and sex are identical, and there are only two sexes - male and female.\"\n>His lawyers wrote that Morrison \"hoped to start a meaningful conversation on gender ideology\" as well as to protect other students against ideas that he considered \"false and harmful\" and to \"show them compassionate people can believe that sex is binary.\"\n\nLOL. I'm sure that is why he wore it.  \nEven if you ignore transgender people, his statement is biologically, scientifically false. \n\nBut I'm sure a 7th grader is definitely looking to have a meaningful conversation about sex and gender identity.\n\nI hope he is sufficiently ostracized by the student population.",
                "He could not look more like the person I’d picture doing this kind of thing.\n\nEdit: and why the clipboard? Is he planning to socially engineer his way in somewhere on his way home?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump Pardoned Tax Cheat After Mother Attended $1 Million Dinner",
            "external_url": "https://www.nytimes.com/2025/05/27/us/politics/trump-pardon-paul-walczak-tax-crimes.html?unlocked_article_code=1.KU8.sjc6.NKyPz9HyHmuD&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 1163,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Its not corruption if its out in the open, right?",
                "Trump absolutely believes the maxim that power is there to reward your friends and punish your enemies.",
                "Republicans are for sale. I'm not surprised with these articles any longer and have come to expect this kind of behavior from them.",
                ">Mr. Walczak, a former nursing home executive who had pleaded guilty to tax crimes days after the 2024 election, submitted a pardon application to President Trump around Inauguration Day. The application focused not solely on Mr. Walczak’s offenses but also on the political activity of his mother, Elizabeth Fago.\n\n>Ms. Fago had raised millions of dollars for Mr. Trump’s campaigns and those of other Republicans, the application said. It also highlighted her connections to an effort to sabotage Joseph R. Biden Jr.’s 2020 campaign by publicizing the addiction diary of his daughter Ashley Biden — an episode that drew law enforcement scrutiny.\n\nFucking disgusting. Seems like all you need is for your mother to go around donating to Republicans and you can go ahead and break the law as much as you want.",
                "I know it's just another slimy drop in the bucket of sleaze that is this administration, but Christ this is disgusting. Naked, open corruption.",
                "“It came just in the nick of time for Mr. Walczak, sparing him from having to pay nearly $4.4 million in restitution and from reporting to prison for an 18-month sentence that had been handed down just 12 days earlier. A judge had justified the incarceration by declaring that there “is not a get-out-of-jail-free card” for the rich.”\n\nIn fact, there is such a card for the rich. \n\nMama Mia…",
                "I thought he was doing that dinner “on his own time.”",
                "Before dessert, they all lined up and sat on his lap and told him what they wanted for Christmas",
                "Well, now you know how much a pardon costs.",
                "But don't worry it's not a bribe. /s\n\nIgnore the 1 Million dollar donation everyone had to pay to go\nIgnore how it's a private event with the president of the USA\nIgnore the presidential seal  at this dinner with Trump (who was supposedly off hours, and performing duties not as the president)\n\nI don't understand how a person in that position can ever have \"off\" hours\"  and not be considered the president for all 4 years."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Pornhub and three other adult websites face EU child safety investigation",
            "external_url": "https://www.theguardian.com/technology/2025/may/27/pornhub-three-other-adult-websites-eu-child-safety-investigation",
            "upvotes": 884,
            "date": "05/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/33ff11aebe90794ba326aa05cbd0da82721fd3a2/408_0_4080_3264/master/4080.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8f860db505000cb1a827495d4384cfc9",
            "top_comments": [
                "If teens want to find porn they will find porn. You don't even need to access adult orientated sites to find it. I honestly don't see the point of this. The time and money wasted here is better spent teaching kids how to use the internet safely and responsibly.",
                "Where there's a wank, there's a way",
                ">European Commission alleges the verification systems are ineffective to prevent under-18s from watching\n\nYeah, and??  That's not their job; that's the parents' job.  Car manufacturers aren't responsible for ensuring that toddlers don't play in traffic; they give the cars adequate brakes to try to prevent tragedy when possible but there's only so much they can do.  It's parents who need to make sure their kids don't end up playing somewhere dangerous, why should that be any different when it's online? \n\nBecause the only way to prevent toddlers from playing in the streets without giving any of that responsibility to the parents is to install a toddler fence on the side of every road, which would also impede *adults'* ability to access the road.  *This is exactly the same issue*.",
                "My ex hamster bribed their way out :).",
                "the internet will be interesting when there is no legal porn without proving ID first.    First Texas with many states to follow, now the EU.",
                "If we could find porn in the middle of a deep forest. Teenagers nowadays can definitely find whatever they want with the press of a few buttons.\n\nIt's inevitable.\n\n\nI still remember when I figured out I could type in boobs in Google.\n\nWhat are you gonna do? Ban search engines?",
                "I suspect it isn't completely about minors accessing alone but also because our E.U.  *WANTS ALL YOUR DATA* and would like to know how often you watch stepbro porn tbh. Every time they want a law to gather more data it's either children or terrorists, are you for that? You have nothing to hide, right?\n\nI'm sorry I'm sceptic",
                "Unless you don’t let kids use the internet at all, they will find this. This is a waste of time.",
                "If you want to save the children then investigate the Catholic Church or do something about climate change!",
                "Maybe stupid question, but if there’s standards for video and game content ratings, like the ESRB and such, why can’t there be a standard made for websites as well? Just have the site set its rating in the metadata or something, and have the checks done client side. On phones and TVs you can set limits for adult rated applications, streaming content and the like, that doesn’t require any verification from a third party that looks at a pic of your ID. That way parental controls on the phones could take over."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Man turns himself in after argument turned shooting that injured six in Colorado Springs",
            "external_url": "https://www.kktv.com/2025/05/26/man-arrest-connection-with-colorado-springs-shooting-that-injured-6/",
            "upvotes": 1089,
            "date": "05/27/2025",
            "thumbnail": "https://gray-kktv-prod.gtv-cdn.com/resizer/v2/URUHNSJBHBDFPDEJM3YEHJMHVA.png?auth=9019873634871bb66f8cf183c6677da6f6b57a84998d750ec83b0891e3503b32&width=1200&height=600&smart=true",
            "top_comments": [
                "Average Colorado Springs moment",
                "Why the hell is he out on bond??",
                "I grew up here and miss the small town it used to be. What the hell. The Springs changed so freaking much. I miss home but glad I freaking left.",
                "Awful auto playing video with jump scare sound effects. Scrolling away from the video makes no difference. \n\nWhy would anyone think any of that was a good idea?",
                "“My, my, my.”  — Lt. Joe Kenda",
                "6 injured and dude is out on bond... This system is fucked.",
                "Everyone thinks they're the good guy with a gun... until they aren't.",
                "\"An armed society is a polite society.\"",
                "This dude like the real life Joe dirt.",
                "I thought Colorado Springs was the nice part of Colorado because of the Republicans /s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Victims in French Le Scouarnec child abuse trial shocked at public indifference",
            "external_url": "https://www.bbc.com/news/articles/cvg559zz3d8o",
            "upvotes": 485,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8335/live/e448e4d0-3663-11f0-a2c9-cb3e24c16fff.jpg",
            "top_comments": [
                "Crazy that I haven't heard about this case. Thanks for posting it, it should be the top news story quite honestly. Any time a doctor uses their power and access for evil should be front page news. As a pediatrician it makes me absolutely sick.",
                "The fact that I have never heard of it till this article is why. It's telling I never heard of this but can tell you all about the conspiracy of kids hidden in Ikea furniture.",
                "read through to where the people complicit with this monster explain themselves:\n\n\"I was advised not to talk about such and such a person,\" said one doctor who'd tried to sound the alarm.\n\n\"There is a shortage of surgeons, and those who show up are welcomed like the messiah,\" explained a hospital director.\n\n\"I messed up, I admit it, like the whole hierarchy,\" a different administrator finally conceded.\n\nWow man... if they did and saidin the US they would fall under the \"manditory reporter law.\"  I guess that's not a thing in France?",
                "I am French and there’s a reason France is called pedoland. Weed will get you more jail time than abusing children",
                ">She spoke of a patriarchal society in which men in respected positions like medicine remained almost beyond reproach and pointed to \"the silence of those who knew, those who looked the other way, and those who could have – should have – raised the alarm\".\n\nAlso, pedophilia has been pushed in France for decades--often by some big name French artists, film makers, and intellectuals.",
                "Yes. I've heard about it like, 2 years ago when the affair came out. It was horrific but some details were still hidden. Now that the trial is occurring and we finally know about this madness... \n\nMan can be profoundly corrupted. It's awful. It's this guy now, it was another yesterday and it will be another tomorrow. What else is there to say?? \n\nThe fact that the authorities failed to see and stop it doesn't surprise me. Our administration is tired.",
                "am french\n\nsorry, don't feel i had enough emotional bandwidth left after seeing children puting parts of their siblings in trash bags, in other news\n\nedit for incoming downvotes : do people think we have infinite emotional bandwidth? don't you think it's at least part of it? \n\npeople are not meant to see dead and mangled children on a daily basis, yet we have to, it's our bombs, we give them, fly them there to throw them on those kids... so yeah, if you feel invincible to it, glad for you"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "New York sewage-boat explosion victim identified as veteran city engineer",
            "external_url": "https://www.nbcnews.com/news/us-news/new-york-sewage-boat-explosion-victim-identified-veteran-city-engineer-rcna209087",
            "upvotes": 785,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25524-new-york-sewage-boat-explosion-rc-11p-77f2ec.jpg",
            "top_comments": [
                "Chief Marine Diesel Engineer Raymond Feige, 59, died in the explosion at the North River Wastewater Resource Recovery Facility in West Harlem, the DEP said in a statement Monday. The incident occurred at around 10:30 a.m. Saturday on a boat carrying raw sewage that was docked.",
                "If you saw a band called \"New York Sewage-Boat Explosion\" would you be at least curious about them?",
                "I've never heard of a sewage boat...why on Earth would they ship sewage and not pipe it to a treatment plant?",
                "I’ve heard of explosive diarrhea, but damn…",
                "\"Sewage Boat Explosion\"💥 \n\nwow",
                "I saw sewage boat explosion and thought it might be RFK Jr, no such luck.  I feel bad that it was somebody that was actually worth something to society.",
                "No explanation on how the shit hit the fan?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration halting student visa appointments ahead of \"expanded social media vetting\"",
            "external_url": "https://www.cbsnews.com/news/trump-administration-halting-student-visa-appointments-ahead-of-expanded-social-media-vetting/",
            "upvotes": 140,
            "date": "05/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/27/21f82399-deee-49b7-b354-2be231ac5e98/thumbnail/1200x630/91d3cef2e3a4b3b559f4da8c51fcc82c/ap25141740707253.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                ">\"Congress shall make no law respecting an establishment of religion,\n\n[Oklahoma education head discusses why he’s mandating public schools teach the Bible](https://www.pbs.org/newshour/show/oklahoma-education-head-discusses-why-hes-mandating-public-schools-teach-the-bible)\n\n>or prohibiting the free exercise thereof; \n\n[Proposed Muslim development in Texas brings inquiries by DOJ and state officials](https://www.keranews.org/news/2025-05-23/proposed-muslim-development-in-texas-brings-inquiries-by-doj-and-state-officials)\n\n>or abridging the freedom of speech,\n\n[Trump administration halting student visa appointments ahead of \"expanded social media vetting\"](https://www.cbsnews.com/news/trump-administration-halting-student-visa-appointments-ahead-of-expanded-social-media-vetting/)\n\n>or of the press;\n\n[The Associated Press, banned from White House press pool, renews request to court for reinstatement](https://www.ap.org/media-center/ap-in-the-news/2025/the-associated-press-banned-from-white-house-press-pool-renews-request-to-court-for-reinstatement/)\n\n>or the right of the people peaceably to assemble, \n\n[Peaceful Protesters Tear-Gassed To Clear Way For Trump Church Photo-Op](https://www.npr.org/2020/06/01/867532070/trumps-unannounced-church-visit-angers-church-officials)\n\n>and to petition the Government for a redress of grievances.\" \n\n[Trump has taken steps to make his campaign promise to seek 'retribution' reality, critics say](https://abcnews.go.com/Politics/trump-steps-make-campaign-promise-seek-retribution-reality/story?id=121125087)",
                "AKA the \"free speech absolutists\" will ensure the only people they want to enter the US speak the same and believe the same as themselves, because they don't believe in a \"marketplace of ideas\" but \"do it the way we say or we will punish you\".",
                "Moronic republicans on this site: How can you say that republicans are worst on free speech compared to Democrats.",
                "Putting the (tiny) dick in dictator",
                "The GOP needs to be declared a terrorist organization and have their members be marked as suspected terrorists subject to enhanced interrogation. Time to start stuffing them and their families into unmarked vans and sent off to gulags. Thanks for teaching me how to govern Fuhrer Trump!",
                "... This is normal.... Shame",
                "Trading away our rights and freedoms to legitimize Israel committing genocide. Truly the shining city on a hill."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump administration halting student visa appointments ahead of \"expanded social media vetting\"",
            "external_url": "https://www.cbsnews.com/news/trump-administration-halting-student-visa-appointments-ahead-of-expanded-social-media-vetting/",
            "upvotes": 133,
            "date": "05/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/27/21f82399-deee-49b7-b354-2be231ac5e98/thumbnail/1200x630/91d3cef2e3a4b3b559f4da8c51fcc82c/ap25141740707253.jpg?v=f5922acb8cfbf6d7fe1f82314e5e9885",
            "top_comments": [
                ">\"Congress shall make no law respecting an establishment of religion,\n\n[Oklahoma education head discusses why he’s mandating public schools teach the Bible](https://www.pbs.org/newshour/show/oklahoma-education-head-discusses-why-hes-mandating-public-schools-teach-the-bible)\n\n>or prohibiting the free exercise thereof; \n\n[Proposed Muslim development in Texas brings inquiries by DOJ and state officials](https://www.keranews.org/news/2025-05-23/proposed-muslim-development-in-texas-brings-inquiries-by-doj-and-state-officials)\n\n>or abridging the freedom of speech,\n\n[Trump administration halting student visa appointments ahead of \"expanded social media vetting\"](https://www.cbsnews.com/news/trump-administration-halting-student-visa-appointments-ahead-of-expanded-social-media-vetting/)\n\n>or of the press;\n\n[The Associated Press, banned from White House press pool, renews request to court for reinstatement](https://www.ap.org/media-center/ap-in-the-news/2025/the-associated-press-banned-from-white-house-press-pool-renews-request-to-court-for-reinstatement/)\n\n>or the right of the people peaceably to assemble, \n\n[Peaceful Protesters Tear-Gassed To Clear Way For Trump Church Photo-Op](https://www.npr.org/2020/06/01/867532070/trumps-unannounced-church-visit-angers-church-officials)\n\n>and to petition the Government for a redress of grievances.\" \n\n[Trump has taken steps to make his campaign promise to seek 'retribution' reality, critics say](https://abcnews.go.com/Politics/trump-steps-make-campaign-promise-seek-retribution-reality/story?id=121125087)",
                "AKA the \"free speech absolutists\" will ensure the only people they want to enter the US speak the same and believe the same as themselves, because they don't believe in a \"marketplace of ideas\" but \"do it the way we say or we will punish you\".",
                "Moronic republicans on this site: How can you say that republicans are worst on free speech compared to Democrats.",
                "Putting the (tiny) dick in dictator",
                "The GOP needs to be declared a terrorist organization and have their members be marked as suspected terrorists subject to enhanced interrogation. Time to start stuffing them and their families into unmarked vans and sent off to gulags. Thanks for teaching me how to govern Fuhrer Trump!",
                "... This is normal.... Shame",
                "Trading away our rights and freedoms to legitimize Israel committing genocide. Truly the shining city on a hill."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump Pardoned Tax Cheat After Mother Attended $1 Million Dinner",
            "external_url": "https://www.nytimes.com/2025/05/27/us/politics/trump-pardon-paul-walczak-tax-crimes.html?unlocked_article_code=1.KU8.sjc6.NKyPz9HyHmuD&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 1162,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Its not corruption if its out in the open, right?",
                "Trump absolutely believes the maxim that power is there to reward your friends and punish your enemies.",
                "Republicans are for sale. I'm not surprised with these articles any longer and have come to expect this kind of behavior from them.",
                ">Mr. Walczak, a former nursing home executive who had pleaded guilty to tax crimes days after the 2024 election, submitted a pardon application to President Trump around Inauguration Day. The application focused not solely on Mr. Walczak’s offenses but also on the political activity of his mother, Elizabeth Fago.\n\n>Ms. Fago had raised millions of dollars for Mr. Trump’s campaigns and those of other Republicans, the application said. It also highlighted her connections to an effort to sabotage Joseph R. Biden Jr.’s 2020 campaign by publicizing the addiction diary of his daughter Ashley Biden — an episode that drew law enforcement scrutiny.\n\nFucking disgusting. Seems like all you need is for your mother to go around donating to Republicans and you can go ahead and break the law as much as you want.",
                "I know it's just another slimy drop in the bucket of sleaze that is this administration, but Christ this is disgusting. Naked, open corruption.",
                "“It came just in the nick of time for Mr. Walczak, sparing him from having to pay nearly $4.4 million in restitution and from reporting to prison for an 18-month sentence that had been handed down just 12 days earlier. A judge had justified the incarceration by declaring that there “is not a get-out-of-jail-free card” for the rich.”\n\nIn fact, there is such a card for the rich. \n\nMama Mia…",
                "I thought he was doing that dinner “on his own time.”",
                "Before dessert, they all lined up and sat on his lap and told him what they wanted for Christmas",
                "Well, now you know how much a pardon costs.",
                "But don't worry it's not a bribe. /s\n\nIgnore the 1 Million dollar donation everyone had to pay to go\nIgnore how it's a private event with the president of the USA\nIgnore the presidential seal  at this dinner with Trump (who was supposedly off hours, and performing duties not as the president)\n\nI don't understand how a person in that position can ever have \"off\" hours\"  and not be considered the president for all 4 years."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Victims in French Le Scouarnec child abuse trial shocked at public indifference",
            "external_url": "https://www.bbc.com/news/articles/cvg559zz3d8o",
            "upvotes": 487,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8335/live/e448e4d0-3663-11f0-a2c9-cb3e24c16fff.jpg",
            "top_comments": [
                "Crazy that I haven't heard about this case. Thanks for posting it, it should be the top news story quite honestly. Any time a doctor uses their power and access for evil should be front page news. As a pediatrician it makes me absolutely sick.",
                "The fact that I have never heard of it till this article is why. It's telling I never heard of this but can tell you all about the conspiracy of kids hidden in Ikea furniture.",
                "read through to where the people complicit with this monster explain themselves:\n\n\"I was advised not to talk about such and such a person,\" said one doctor who'd tried to sound the alarm.\n\n\"There is a shortage of surgeons, and those who show up are welcomed like the messiah,\" explained a hospital director.\n\n\"I messed up, I admit it, like the whole hierarchy,\" a different administrator finally conceded.\n\nWow man... if they did and saidin the US they would fall under the \"manditory reporter law.\"  I guess that's not a thing in France?",
                "I am French and there’s a reason France is called pedoland. Weed will get you more jail time than abusing children",
                ">She spoke of a patriarchal society in which men in respected positions like medicine remained almost beyond reproach and pointed to \"the silence of those who knew, those who looked the other way, and those who could have – should have – raised the alarm\".\n\nAlso, pedophilia has been pushed in France for decades--often by some big name French artists, film makers, and intellectuals.",
                "Yes. I've heard about it like, 2 years ago when the affair came out. It was horrific but some details were still hidden. Now that the trial is occurring and we finally know about this madness... \n\nMan can be profoundly corrupted. It's awful. It's this guy now, it was another yesterday and it will be another tomorrow. What else is there to say?? \n\nThe fact that the authorities failed to see and stop it doesn't surprise me. Our administration is tired.",
                "am french\n\nsorry, don't feel i had enough emotional bandwidth left after seeing children puting parts of their siblings in trash bags, in other news\n\nedit for incoming downvotes : do people think we have infinite emotional bandwidth? don't you think it's at least part of it? \n\npeople are not meant to see dead and mangled children on a daily basis, yet we have to, it's our bombs, we give them, fly them there to throw them on those kids... so yeah, if you feel invincible to it, glad for you"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US Supreme Court rejects case about student's 'There are only two genders' T-shirt",
            "external_url": "https://www.reuters.com/world/us/us-supreme-court-rejects-case-about-students-there-are-only-two-genders-t-shirt-2025-05-27/",
            "upvotes": 2537,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh no. His parent's get rich quick scam failed. \n\nSorry about that.",
                "So essentially a 12 year old was told to wear a shirt by his parents, and instead of accepting that the shirt is unreasonable and against policy, they decide to sue and use political discourse as a payday. \n\n  \nAbsolutely pathetic.",
                "That's about right. \n\nYou can't tie schools hands when enforcing dress codes. \n\nIF they had given this one a pass everyone and their brother could wear whatever offensive slogans and words they want in school and teachers would be powerless to enforce *any* sort of standards, or to make it clear that the school environment is not a place for political or civic disputes by immature teenage blowhards looking to pick a fight. \n\nThis shirt is no different then one that says \"African Americans are myth\" or \"there was no holocaust\", you can have those stupid and obviously asinine opinions, but when you are in school, administrators need to have the ability to keep you from inciting conflicts on school grounds... by wearing certain items *meant* to inflame and cause conflict.",
                "This is so bonkers, and manifestly done in bad faith.\n\nConservatives are the ones who WANT schools to be able to exercise greater-than-normal authority over students' speech.\n\n*Tinker v. Des Moines* in 1969 is the key controlling decision; in that case students sued their school after the school told them they could not wear black armbands to protest the Vietnam War. Guess which side the conservatives were on then? It wasn't the side that wants students to be able to wear political messages on their clothes in school!\n\nIn *Bethel School District v Frasier* in 1986, the Supreme Court held that schools have the right to restrict / prohibit student speech (in this case, vulgar innuendo in a commencement address). Again, conservatives would absolutely not want that student right restored / expanded.\n\nExcept but now we're supposed to believe that conservatives legitimately hold the opposite beliefs?\n\nCome on.\n\nOnce again, I resent how dumb and gullible right-wingers assume the rest of us are. The fucking nerve of these asswipes!",
                "Conservatives, just so I understand...\n\nIt's free speech to be on a government operated campus (public school) and denounce gender identity, but NOT free speech to be on a privately owned campus (a private college) and denounce Israel's handling of their war?\n\nThe latter is NOT free speech, but the former is?? Is that how this works?",
                "The \"I should be able to lie and insult anyone, anywhere, anytime\" free speech people.  \nThey create a Venn diagram that looks like a circle with the \"talking shit about Trump should land you in jail\" people. Very odd.",
                ">His lawyers wrote that Morrison \"hoped to start a meaningful conversation on gender ideology\" as well as to protect other students against ideas that he considered \"false and harmful\" and to \"show them compassionate people can believe that sex is binary.\"\n\nLOL oh bullshit, what does a 12 year old know about sex? This idiot isn't on some kind of enlightenment mission from a higher calling, he's a prop being used by his shit heel parents to cynically exploit a right-wing driven culture war issue.",
                "Always Alto and Thomas being shitheads together.",
                ">Student Liam Morrison, along with his father and stepmother, sued officials at John T. Nichols Middle School and the town of Middleborough, seeking monetary damages.\n>While in seventh grade, Morrison wore the T-shirt reading \"There are only two genders\" to school in March 2023. His lawyers said in court papers he did so to \"share his view that gender and sex are identical, and there are only two sexes - male and female.\"\n>His lawyers wrote that Morrison \"hoped to start a meaningful conversation on gender ideology\" as well as to protect other students against ideas that he considered \"false and harmful\" and to \"show them compassionate people can believe that sex is binary.\"\n\nLOL. I'm sure that is why he wore it.  \nEven if you ignore transgender people, his statement is biologically, scientifically false. \n\nBut I'm sure a 7th grader is definitely looking to have a meaningful conversation about sex and gender identity.\n\nI hope he is sufficiently ostracized by the student population.",
                "He could not look more like the person I’d picture doing this kind of thing.\n\nEdit: and why the clipboard? Is he planning to socially engineer his way in somewhere on his way home?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "RFK Jr. says Covid-19 shot will no longer be recommended for healthy children and pregnant women",
            "external_url": "https://www.cnn.com/2025/05/27/health/covid-vaccine-pregnant-women-children-recommendation",
            "upvotes": 13522,
            "date": "05/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2210921664.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Also RFK Jr \"No one should take medical advice from me.\"",
                "Ok but will insurance still cover it for kids if a parent wants to?",
                "Coincidentally, living in America is also not recommended for healthy children and pregnant women.",
                "I’m convinced his father’s killer was a time traveler who screwed up and killed the wrong one.\n\nLike someone from the future wanted to prevent the problems he’s caused, but turned the dial too far.",
                "Contact with RFK Jr cannot be safely recommended for healthy children or pregnant women.",
                "I’m going to go ahead and disregard that since he said we shouldn’t take medical advice from him.",
                "It’s wild that politicians and employees of health insurance companies can legally practice medicine without a license.\n\nAmerica is just an average, violent, corrupt shit hole third world country.",
                "Meanwhile, in Scientific American: [Long COVID Is Harming Too Many Kids](https://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/)\n\n>Pediatric long COVID is more common than many thought, and we keep letting kids be reinfected with new variants... \n\n>... The American Medical Association’s top journal, *JAMA,* in August published a key new [study](https://jamanetwork.com/journals/jama/fullarticle/2822770) and [editorial](https://jamanetwork.com/journals/jama/article-abstract/2822771) about pediatric long COVID. The editorial cites several robust analyses and concludes that, while uncertainty remains, long COVID symptoms appear to occur after about 10 percent to 20 percent of pediatric infections.\n\nIt's like we're speedrunning the collapse of America.",
                "Let's see the double blind data from the peer reviewed study.",
                "It's worth noting that getting COVID during pregnancy increases a lot of risks for mother and baby:\n\nhttps://bmjgroup.com/covid-19-infection-at-any-time-during-pregnancy-boosts-mothers-risk-of-death/\n\nhttps://www.nichd.nih.gov/research/supported/COVID/NICHD_Populations/Preg_Post/how-covid-19-affects-pregnancy\n\nhttps://www.nature.com/articles/s41467-023-44549-5\n\nhttps://www.nhlbi.nih.gov/news/2024/study-uncovers-long-covid-risk-during-pregnancy\n\nhttps://www.rcog.org.uk/guidance/coronavirus-covid-19-pregnancy-and-women-s-health/coronavirus-covid-19-infection-in-pregnancy/coronavirus-covid-19-infection-and-pregnancy-faqs/\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC9122838/\n\nNot to mention the risk to children:\n\nhttps://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Forty-two people killed in central Nigeria in attacks blamed on herders",
            "external_url": "https://www.theguardian.com/world/2025/may/27/nigeria-attacks-benue",
            "upvotes": 160,
            "date": "05/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8e339dd53ee138ccbd4b42968cc7f413576ac300/204_0_2040_1632/master/2040.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=538d35c3039f64d58957a2eb2b154750",
            "top_comments": [
                "tl;dr fight stems from cattle staying onto farmlands. No one is spared, even 2 year old was killed and a priest was shot at.",
                "\\> According to Nextier’s Nigeria Violent Conflicts Database, at least 2,347 casualties were recorded in 359 incidents involving farmers and herders across Nigeria between 2020 and 2024. Some experts and locals say the numbers are conservative, as many of the incidents and fatalities are often undocumented.",
                "Wild. Cant wait till that happens again next week;and again the week after. Give me that western news. Not like this doesn’t happen literally every couple of days."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Pornhub and three other adult websites face EU child safety investigation",
            "external_url": "https://www.theguardian.com/technology/2025/may/27/pornhub-three-other-adult-websites-eu-child-safety-investigation",
            "upvotes": 883,
            "date": "05/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/33ff11aebe90794ba326aa05cbd0da82721fd3a2/408_0_4080_3264/master/4080.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8f860db505000cb1a827495d4384cfc9",
            "top_comments": [
                "If teens want to find porn they will find porn. You don't even need to access adult orientated sites to find it. I honestly don't see the point of this. The time and money wasted here is better spent teaching kids how to use the internet safely and responsibly.",
                "Where there's a wank, there's a way",
                ">European Commission alleges the verification systems are ineffective to prevent under-18s from watching\n\nYeah, and??  That's not their job; that's the parents' job.  Car manufacturers aren't responsible for ensuring that toddlers don't play in traffic; they give the cars adequate brakes to try to prevent tragedy when possible but there's only so much they can do.  It's parents who need to make sure their kids don't end up playing somewhere dangerous, why should that be any different when it's online? \n\nBecause the only way to prevent toddlers from playing in the streets without giving any of that responsibility to the parents is to install a toddler fence on the side of every road, which would also impede *adults'* ability to access the road.  *This is exactly the same issue*.",
                "My ex hamster bribed their way out :).",
                "the internet will be interesting when there is no legal porn without proving ID first.    First Texas with many states to follow, now the EU.",
                "If we could find porn in the middle of a deep forest. Teenagers nowadays can definitely find whatever they want with the press of a few buttons.\n\nIt's inevitable.\n\n\nI still remember when I figured out I could type in boobs in Google.\n\nWhat are you gonna do? Ban search engines?",
                "I suspect it isn't completely about minors accessing alone but also because our E.U.  *WANTS ALL YOUR DATA* and would like to know how often you watch stepbro porn tbh. Every time they want a law to gather more data it's either children or terrorists, are you for that? You have nothing to hide, right?\n\nI'm sorry I'm sceptic",
                "Unless you don’t let kids use the internet at all, they will find this. This is a waste of time.",
                "If you want to save the children then investigate the Catholic Church or do something about climate change!",
                "Maybe stupid question, but if there’s standards for video and game content ratings, like the ESRB and such, why can’t there be a standard made for websites as well? Just have the site set its rating in the metadata or something, and have the checks done client side. On phones and TVs you can set limits for adult rated applications, streaming content and the like, that doesn’t require any verification from a third party that looks at a pic of your ID. That way parental controls on the phones could take over."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "President Donald Trump pardons former Virginia sheriff Scott Jenkins convicted of fraud and bribery",
            "external_url": "https://www.bbc.com/news/articles/cwynp1lw0l7o",
            "upvotes": 9067,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3106/live/80655280-3ade-11f0-a379-ddaa80eac7b4.jpg",
            "top_comments": [
                "I thought we were deporting criminals 🤔 ",
                ">“Scott Jenkins violated his oath of office and the faith the citizens of Culpeper County placed in him when he engaged in a cash-for-badges scheme,” Acting United States Attorney Zachary T. Lee said today. “We hold our elected law enforcement officials to a higher standard of conduct and this case proves that when those officials use their authority for unjust personal enrichment, the Department of Justice will hold them accountable. I am grateful to the FBI for their tireless work on this investigation.”\n\nDude handed out badges for money. Convicted felon Donald Trump thinks this is OK.",
                "It is truly sad that America elected a felon to the highest office in the land.\n\nWe are seeing this felons corrupt activity on a daily basis.  America has lost it's way.",
                "It's not a joke, it's a good thing Obama took out Bin Ladin because Trump would have buddied up to him by now if he was still alive.\n\n77 million idiots are good with this orange turd.",
                "TIL Virginia does not have state laws against fraud and bribery",
                "so much for fighting against fraud, waste and abuse!!!!",
                "This is the most corrupt presidency in modern history.  Trump is a criminal, scumbag and everyone that supports him.",
                "White collar fraudster pardons blue collar fraudster.",
                "Fat fuck frees fat fuck.",
                "States should prosecute irrespective of what the feds do so that this kind of thing doesn't happen anymore - at least so long as the dual sovereignty doctrine is still a thing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Thief of iconic Winston Churchill portrait 'Roaring Lion' sentenced to jail",
            "external_url": "https://www.abc.net.au/news/2025-05-27/thief-behind-iconic-churchill-portrait-theft-sentenced-to-jail/105345104",
            "upvotes": 129,
            "date": "05/27/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/3004cc405193d5500b6a32b3bd7ef9ac?impolicy=wcms_watermark_news&cropH=1310&cropW=2329&xPos=0&yPos=151&width=862&height=485&imformat=generic",
            "top_comments": [
                "Churchill was mad in this photo because the photographer took his cigar away from him.",
                "A painting of that photo was in one of the bathrooms in our house facing you as you sat on the bowl. My cousin put a little sign under it that said \"Winston is watching you poop\".",
                "That’s totally absurd to send this guy to prison for stealing  a photograph. What a stupid sentence - hope he appeals."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "NPR sues Trump over executive order cutting federal funding",
            "external_url": "https://www.nbcnews.com/politics/trump-administration/npr-sues-trump-executive-order-cutting-federal-funding-rcna209170",
            "upvotes": 14425,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250502-npr-mb-0756-b5e7de.jpg",
            "top_comments": [
                "So glad my federal tax dollars pay for Golf and nothing else.",
                "And NPR will win like every other group suing Trump for violating the Constitution. Congress controls the purse, not the president. If Trump wants NPR defunded, Congress will need to do it.",
                "Hard to be a shittier American than a Trump supporter these days",
                "Here are some links:\n\nComplaint: [https://storage.courtlistener.com/recap/gov.uscourts.dcd.280953/gov.uscourts.dcd.280953.1.0.pdf](https://storage.courtlistener.com/recap/gov.uscourts.dcd.280953/gov.uscourts.dcd.280953.1.0.pdf)\n\nDocket: [https://www.courtlistener.com/docket/70376503/national-public-radio-inc-v-trump/](https://www.courtlistener.com/docket/70376503/national-public-radio-inc-v-trump/)\n\nExecutive Order: [https://www.whitehouse.gov/presidential-actions/2025/05/ending-taxpayer-subsidization-of-biased-media/](https://www.whitehouse.gov/presidential-actions/2025/05/ending-taxpayer-subsidization-of-biased-media/)",
                "Living in a rural community, NPR gives you broad access to a ton of local information that you are hard to get from other sources. And it's not even biased information at the local level, it's just community building. If you turn on the local TV news, it's crime and murders. Local NPR is culture.",
                "More willing to go to war with his own country than actual enemies abroad like Russia for example. Never thought I'd see the day were we'd be in this position. At least I didnt forsee it being this stupid.",
                "All the $ and time wasted on lawsuits.",
                "Going after NPR and PBS... who was angry at those people again? Just because they're one of the few media outlets today with even a little integrity and propriety? Or is it because along with that, they dare to not fawn over the Cheeto in Charge?\n\nHis executive orders are a joke and not legal or constitutional. May this and other lawsuits quickly show just how little power our little dicktater actually has.",
                "Your regular reminder that Republicans control Congress and could pass a law to enact Trump's executive orders legally any time they wanted to, but instead they're going to do nothing and rile people up against judges when the illegal EOs get struck down.",
                "I don't understand why there's not like a Supreme Court case of the President not having power of the purse by now. He's acting like a one man legislature."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump Pardoned Tax Cheat After Mother Attended $1 Million Dinner",
            "external_url": "https://www.nytimes.com/2025/05/27/us/politics/trump-pardon-paul-walczak-tax-crimes.html?unlocked_article_code=1.KU8.sjc6.NKyPz9HyHmuD&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 1172,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Its not corruption if its out in the open, right?",
                "Trump absolutely believes the maxim that power is there to reward your friends and punish your enemies.",
                "Republicans are for sale. I'm not surprised with these articles any longer and have come to expect this kind of behavior from them.",
                ">Mr. Walczak, a former nursing home executive who had pleaded guilty to tax crimes days after the 2024 election, submitted a pardon application to President Trump around Inauguration Day. The application focused not solely on Mr. Walczak’s offenses but also on the political activity of his mother, Elizabeth Fago.\n\n>Ms. Fago had raised millions of dollars for Mr. Trump’s campaigns and those of other Republicans, the application said. It also highlighted her connections to an effort to sabotage Joseph R. Biden Jr.’s 2020 campaign by publicizing the addiction diary of his daughter Ashley Biden — an episode that drew law enforcement scrutiny.\n\nFucking disgusting. Seems like all you need is for your mother to go around donating to Republicans and you can go ahead and break the law as much as you want.",
                "I know it's just another slimy drop in the bucket of sleaze that is this administration, but Christ this is disgusting. Naked, open corruption.",
                "“It came just in the nick of time for Mr. Walczak, sparing him from having to pay nearly $4.4 million in restitution and from reporting to prison for an 18-month sentence that had been handed down just 12 days earlier. A judge had justified the incarceration by declaring that there “is not a get-out-of-jail-free card” for the rich.”\n\nIn fact, there is such a card for the rich. \n\nMama Mia…",
                "I thought he was doing that dinner “on his own time.”",
                "Before dessert, they all lined up and sat on his lap and told him what they wanted for Christmas",
                "Well, now you know how much a pardon costs.",
                "But don't worry it's not a bribe. /s\n\nIgnore the 1 Million dollar donation everyone had to pay to go\nIgnore how it's a private event with the president of the USA\nIgnore the presidential seal  at this dinner with Trump (who was supposedly off hours, and performing duties not as the president)\n\nI don't understand how a person in that position can ever have \"off\" hours\"  and not be considered the president for all 4 years."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Victims in French Le Scouarnec child abuse trial shocked at public indifference",
            "external_url": "https://www.bbc.com/news/articles/cvg559zz3d8o",
            "upvotes": 484,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8335/live/e448e4d0-3663-11f0-a2c9-cb3e24c16fff.jpg",
            "top_comments": [
                "Crazy that I haven't heard about this case. Thanks for posting it, it should be the top news story quite honestly. Any time a doctor uses their power and access for evil should be front page news. As a pediatrician it makes me absolutely sick.",
                "The fact that I have never heard of it till this article is why. It's telling I never heard of this but can tell you all about the conspiracy of kids hidden in Ikea furniture.",
                "read through to where the people complicit with this monster explain themselves:\n\n\"I was advised not to talk about such and such a person,\" said one doctor who'd tried to sound the alarm.\n\n\"There is a shortage of surgeons, and those who show up are welcomed like the messiah,\" explained a hospital director.\n\n\"I messed up, I admit it, like the whole hierarchy,\" a different administrator finally conceded.\n\nWow man... if they did and saidin the US they would fall under the \"manditory reporter law.\"  I guess that's not a thing in France?",
                "I am French and there’s a reason France is called pedoland. Weed will get you more jail time than abusing children",
                ">She spoke of a patriarchal society in which men in respected positions like medicine remained almost beyond reproach and pointed to \"the silence of those who knew, those who looked the other way, and those who could have – should have – raised the alarm\".\n\nAlso, pedophilia has been pushed in France for decades--often by some big name French artists, film makers, and intellectuals.",
                "Yes. I've heard about it like, 2 years ago when the affair came out. It was horrific but some details were still hidden. Now that the trial is occurring and we finally know about this madness... \n\nMan can be profoundly corrupted. It's awful. It's this guy now, it was another yesterday and it will be another tomorrow. What else is there to say?? \n\nThe fact that the authorities failed to see and stop it doesn't surprise me. Our administration is tired.",
                "am french\n\nsorry, don't feel i had enough emotional bandwidth left after seeing children puting parts of their siblings in trash bags, in other news\n\nedit for incoming downvotes : do people think we have infinite emotional bandwidth? don't you think it's at least part of it? \n\npeople are not meant to see dead and mangled children on a daily basis, yet we have to, it's our bombs, we give them, fly them there to throw them on those kids... so yeah, if you feel invincible to it, glad for you"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "President Donald Trump pardons former Virginia sheriff Scott Jenkins convicted of fraud and bribery",
            "external_url": "https://www.bbc.com/news/articles/cwynp1lw0l7o",
            "upvotes": 9077,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3106/live/80655280-3ade-11f0-a379-ddaa80eac7b4.jpg",
            "top_comments": [
                "I thought we were deporting criminals 🤔 ",
                ">“Scott Jenkins violated his oath of office and the faith the citizens of Culpeper County placed in him when he engaged in a cash-for-badges scheme,” Acting United States Attorney Zachary T. Lee said today. “We hold our elected law enforcement officials to a higher standard of conduct and this case proves that when those officials use their authority for unjust personal enrichment, the Department of Justice will hold them accountable. I am grateful to the FBI for their tireless work on this investigation.”\n\nDude handed out badges for money. Convicted felon Donald Trump thinks this is OK.",
                "It is truly sad that America elected a felon to the highest office in the land.\n\nWe are seeing this felons corrupt activity on a daily basis.  America has lost it's way.",
                "It's not a joke, it's a good thing Obama took out Bin Ladin because Trump would have buddied up to him by now if he was still alive.\n\n77 million idiots are good with this orange turd.",
                "TIL Virginia does not have state laws against fraud and bribery",
                "so much for fighting against fraud, waste and abuse!!!!",
                "This is the most corrupt presidency in modern history.  Trump is a criminal, scumbag and everyone that supports him.",
                "White collar fraudster pardons blue collar fraudster.",
                "Fat fuck frees fat fuck.",
                "States should prosecute irrespective of what the feds do so that this kind of thing doesn't happen anymore - at least so long as the dual sovereignty doctrine is still a thing."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US Supreme Court rejects case about student's 'There are only two genders' T-shirt",
            "external_url": "https://www.reuters.com/world/us/us-supreme-court-rejects-case-about-students-there-are-only-two-genders-t-shirt-2025-05-27/",
            "upvotes": 2541,
            "date": "05/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh no. His parent's get rich quick scam failed. \n\nSorry about that.",
                "So essentially a 12 year old was told to wear a shirt by his parents, and instead of accepting that the shirt is unreasonable and against policy, they decide to sue and use political discourse as a payday. \n\n  \nAbsolutely pathetic.",
                "That's about right. \n\nYou can't tie schools hands when enforcing dress codes. \n\nIF they had given this one a pass everyone and their brother could wear whatever offensive slogans and words they want in school and teachers would be powerless to enforce *any* sort of standards, or to make it clear that the school environment is not a place for political or civic disputes by immature teenage blowhards looking to pick a fight. \n\nThis shirt is no different then one that says \"African Americans are myth\" or \"there was no holocaust\", you can have those stupid and obviously asinine opinions, but when you are in school, administrators need to have the ability to keep you from inciting conflicts on school grounds... by wearing certain items *meant* to inflame and cause conflict.",
                "This is so bonkers, and manifestly done in bad faith.\n\nConservatives are the ones who WANT schools to be able to exercise greater-than-normal authority over students' speech.\n\n*Tinker v. Des Moines* in 1969 is the key controlling decision; in that case students sued their school after the school told them they could not wear black armbands to protest the Vietnam War. Guess which side the conservatives were on then? It wasn't the side that wants students to be able to wear political messages on their clothes in school!\n\nIn *Bethel School District v Frasier* in 1986, the Supreme Court held that schools have the right to restrict / prohibit student speech (in this case, vulgar innuendo in a commencement address). Again, conservatives would absolutely not want that student right restored / expanded.\n\nExcept but now we're supposed to believe that conservatives legitimately hold the opposite beliefs?\n\nCome on.\n\nOnce again, I resent how dumb and gullible right-wingers assume the rest of us are. The fucking nerve of these asswipes!",
                "Conservatives, just so I understand...\n\nIt's free speech to be on a government operated campus (public school) and denounce gender identity, but NOT free speech to be on a privately owned campus (a private college) and denounce Israel's handling of their war?\n\nThe latter is NOT free speech, but the former is?? Is that how this works?",
                "The \"I should be able to lie and insult anyone, anywhere, anytime\" free speech people.  \nThey create a Venn diagram that looks like a circle with the \"talking shit about Trump should land you in jail\" people. Very odd.",
                ">His lawyers wrote that Morrison \"hoped to start a meaningful conversation on gender ideology\" as well as to protect other students against ideas that he considered \"false and harmful\" and to \"show them compassionate people can believe that sex is binary.\"\n\nLOL oh bullshit, what does a 12 year old know about sex? This idiot isn't on some kind of enlightenment mission from a higher calling, he's a prop being used by his shit heel parents to cynically exploit a right-wing driven culture war issue.",
                "Always Alto and Thomas being shitheads together.",
                ">Student Liam Morrison, along with his father and stepmother, sued officials at John T. Nichols Middle School and the town of Middleborough, seeking monetary damages.\n>While in seventh grade, Morrison wore the T-shirt reading \"There are only two genders\" to school in March 2023. His lawyers said in court papers he did so to \"share his view that gender and sex are identical, and there are only two sexes - male and female.\"\n>His lawyers wrote that Morrison \"hoped to start a meaningful conversation on gender ideology\" as well as to protect other students against ideas that he considered \"false and harmful\" and to \"show them compassionate people can believe that sex is binary.\"\n\nLOL. I'm sure that is why he wore it.  \nEven if you ignore transgender people, his statement is biologically, scientifically false. \n\nBut I'm sure a 7th grader is definitely looking to have a meaningful conversation about sex and gender identity.\n\nI hope he is sufficiently ostracized by the student population.",
                "He could not look more like the person I’d picture doing this kind of thing.\n\nEdit: and why the clipboard? Is he planning to socially engineer his way in somewhere on his way home?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "NPR sues Trump over executive order cutting federal funding",
            "external_url": "https://www.nbcnews.com/politics/trump-administration/npr-sues-trump-executive-order-cutting-federal-funding-rcna209170",
            "upvotes": 14441,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250502-npr-mb-0756-b5e7de.jpg",
            "top_comments": [
                "So glad my federal tax dollars pay for Golf and nothing else.",
                "And NPR will win like every other group suing Trump for violating the Constitution. Congress controls the purse, not the president. If Trump wants NPR defunded, Congress will need to do it.",
                "Hard to be a shittier American than a Trump supporter these days",
                "Here are some links:\n\nComplaint: [https://storage.courtlistener.com/recap/gov.uscourts.dcd.280953/gov.uscourts.dcd.280953.1.0.pdf](https://storage.courtlistener.com/recap/gov.uscourts.dcd.280953/gov.uscourts.dcd.280953.1.0.pdf)\n\nDocket: [https://www.courtlistener.com/docket/70376503/national-public-radio-inc-v-trump/](https://www.courtlistener.com/docket/70376503/national-public-radio-inc-v-trump/)\n\nExecutive Order: [https://www.whitehouse.gov/presidential-actions/2025/05/ending-taxpayer-subsidization-of-biased-media/](https://www.whitehouse.gov/presidential-actions/2025/05/ending-taxpayer-subsidization-of-biased-media/)",
                "Living in a rural community, NPR gives you broad access to a ton of local information that you are hard to get from other sources. And it's not even biased information at the local level, it's just community building. If you turn on the local TV news, it's crime and murders. Local NPR is culture.",
                "More willing to go to war with his own country than actual enemies abroad like Russia for example. Never thought I'd see the day were we'd be in this position. At least I didnt forsee it being this stupid.",
                "All the $ and time wasted on lawsuits.",
                "Going after NPR and PBS... who was angry at those people again? Just because they're one of the few media outlets today with even a little integrity and propriety? Or is it because along with that, they dare to not fawn over the Cheeto in Charge?\n\nHis executive orders are a joke and not legal or constitutional. May this and other lawsuits quickly show just how little power our little dicktater actually has.",
                "Your regular reminder that Republicans control Congress and could pass a law to enact Trump's executive orders legally any time they wanted to, but instead they're going to do nothing and rile people up against judges when the illegal EOs get struck down.",
                "I don't understand why there's not like a Supreme Court case of the President not having power of the purse by now. He's acting like a one man legislature."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "RFK Jr. says Covid-19 shot will no longer be recommended for healthy children and pregnant women",
            "external_url": "https://www.cnn.com/2025/05/27/health/covid-vaccine-pregnant-women-children-recommendation",
            "upvotes": 13522,
            "date": "05/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2210921664.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Also RFK Jr \"No one should take medical advice from me.\"",
                "Ok but will insurance still cover it for kids if a parent wants to?",
                "Coincidentally, living in America is also not recommended for healthy children and pregnant women.",
                "I’m convinced his father’s killer was a time traveler who screwed up and killed the wrong one.\n\nLike someone from the future wanted to prevent the problems he’s caused, but turned the dial too far.",
                "Contact with RFK Jr cannot be safely recommended for healthy children or pregnant women.",
                "I’m going to go ahead and disregard that since he said we shouldn’t take medical advice from him.",
                "It’s wild that politicians and employees of health insurance companies can legally practice medicine without a license.\n\nAmerica is just an average, violent, corrupt shit hole third world country.",
                "Meanwhile, in Scientific American: [Long COVID Is Harming Too Many Kids](https://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/)\n\n>Pediatric long COVID is more common than many thought, and we keep letting kids be reinfected with new variants... \n\n>... The American Medical Association’s top journal, *JAMA,* in August published a key new [study](https://jamanetwork.com/journals/jama/fullarticle/2822770) and [editorial](https://jamanetwork.com/journals/jama/article-abstract/2822771) about pediatric long COVID. The editorial cites several robust analyses and concludes that, while uncertainty remains, long COVID symptoms appear to occur after about 10 percent to 20 percent of pediatric infections.\n\nIt's like we're speedrunning the collapse of America.",
                "Let's see the double blind data from the peer reviewed study.",
                "It's worth noting that getting COVID during pregnancy increases a lot of risks for mother and baby:\n\nhttps://bmjgroup.com/covid-19-infection-at-any-time-during-pregnancy-boosts-mothers-risk-of-death/\n\nhttps://www.nichd.nih.gov/research/supported/COVID/NICHD_Populations/Preg_Post/how-covid-19-affects-pregnancy\n\nhttps://www.nature.com/articles/s41467-023-44549-5\n\nhttps://www.nhlbi.nih.gov/news/2024/study-uncovers-long-covid-risk-during-pregnancy\n\nhttps://www.rcog.org.uk/guidance/coronavirus-covid-19-pregnancy-and-women-s-health/coronavirus-covid-19-infection-in-pregnancy/coronavirus-covid-19-infection-and-pregnancy-faqs/\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC9122838/\n\nNot to mention the risk to children:\n\nhttps://www.scientificamerican.com/article/long-covid-is-harming-too-many-kids/"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Pornhub and three other adult websites face EU child safety investigation",
            "external_url": "https://www.theguardian.com/technology/2025/may/27/pornhub-three-other-adult-websites-eu-child-safety-investigation",
            "upvotes": 882,
            "date": "05/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/33ff11aebe90794ba326aa05cbd0da82721fd3a2/408_0_4080_3264/master/4080.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8f860db505000cb1a827495d4384cfc9",
            "top_comments": [
                "If teens want to find porn they will find porn. You don't even need to access adult orientated sites to find it. I honestly don't see the point of this. The time and money wasted here is better spent teaching kids how to use the internet safely and responsibly.",
                "Where there's a wank, there's a way",
                ">European Commission alleges the verification systems are ineffective to prevent under-18s from watching\n\nYeah, and??  That's not their job; that's the parents' job.  Car manufacturers aren't responsible for ensuring that toddlers don't play in traffic; they give the cars adequate brakes to try to prevent tragedy when possible but there's only so much they can do.  It's parents who need to make sure their kids don't end up playing somewhere dangerous, why should that be any different when it's online? \n\nBecause the only way to prevent toddlers from playing in the streets without giving any of that responsibility to the parents is to install a toddler fence on the side of every road, which would also impede *adults'* ability to access the road.  *This is exactly the same issue*.",
                "My ex hamster bribed their way out :).",
                "the internet will be interesting when there is no legal porn without proving ID first.    First Texas with many states to follow, now the EU.",
                "If we could find porn in the middle of a deep forest. Teenagers nowadays can definitely find whatever they want with the press of a few buttons.\n\nIt's inevitable.\n\n\nI still remember when I figured out I could type in boobs in Google.\n\nWhat are you gonna do? Ban search engines?",
                "I suspect it isn't completely about minors accessing alone but also because our E.U.  *WANTS ALL YOUR DATA* and would like to know how often you watch stepbro porn tbh. Every time they want a law to gather more data it's either children or terrorists, are you for that? You have nothing to hide, right?\n\nI'm sorry I'm sceptic",
                "Unless you don’t let kids use the internet at all, they will find this. This is a waste of time.",
                "If you want to save the children then investigate the Catholic Church or do something about climate change!",
                "Maybe stupid question, but if there’s standards for video and game content ratings, like the ESRB and such, why can’t there be a standard made for websites as well? Just have the site set its rating in the metadata or something, and have the checks done client side. On phones and TVs you can set limits for adult rated applications, streaming content and the like, that doesn’t require any verification from a third party that looks at a pic of your ID. That way parental controls on the phones could take over."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "New York sewage-boat explosion victim identified as veteran city engineer",
            "external_url": "https://www.nbcnews.com/news/us-news/new-york-sewage-boat-explosion-victim-identified-veteran-city-engineer-rcna209087",
            "upvotes": 781,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25524-new-york-sewage-boat-explosion-rc-11p-77f2ec.jpg",
            "top_comments": [
                "Chief Marine Diesel Engineer Raymond Feige, 59, died in the explosion at the North River Wastewater Resource Recovery Facility in West Harlem, the DEP said in a statement Monday. The incident occurred at around 10:30 a.m. Saturday on a boat carrying raw sewage that was docked.",
                "If you saw a band called \"New York Sewage-Boat Explosion\" would you be at least curious about them?",
                "I've never heard of a sewage boat...why on Earth would they ship sewage and not pipe it to a treatment plant?",
                "I’ve heard of explosive diarrhea, but damn…",
                "\"Sewage Boat Explosion\"💥 \n\nwow",
                "I saw sewage boat explosion and thought it might be RFK Jr, no such luck.  I feel bad that it was somebody that was actually worth something to society.",
                "No explanation on how the shit hit the fan?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Man turns himself in after argument turned shooting that injured six in Colorado Springs",
            "external_url": "https://www.kktv.com/2025/05/26/man-arrest-connection-with-colorado-springs-shooting-that-injured-6/",
            "upvotes": 1094,
            "date": "05/27/2025",
            "thumbnail": "https://gray-kktv-prod.gtv-cdn.com/resizer/v2/URUHNSJBHBDFPDEJM3YEHJMHVA.png?auth=9019873634871bb66f8cf183c6677da6f6b57a84998d750ec83b0891e3503b32&width=1200&height=600&smart=true",
            "top_comments": [
                "Average Colorado Springs moment",
                "Why the hell is he out on bond??",
                "I grew up here and miss the small town it used to be. What the hell. The Springs changed so freaking much. I miss home but glad I freaking left.",
                "Awful auto playing video with jump scare sound effects. Scrolling away from the video makes no difference. \n\nWhy would anyone think any of that was a good idea?",
                "“My, my, my.”  — Lt. Joe Kenda",
                "6 injured and dude is out on bond... This system is fucked.",
                "Everyone thinks they're the good guy with a gun... until they aren't.",
                "\"An armed society is a polite society.\"",
                "This dude like the real life Joe dirt.",
                "I thought Colorado Springs was the nice part of Colorado because of the Republicans /s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Deputies fatally shoot Florida man who survived apparent gator attack and tried to steal their gun, sheriff says",
            "external_url": "https://www.nbcnews.com/news/us-news/deputies-fatally-shoot-florida-man-gator-attack-tried-steal-gun-rcna209128",
            "upvotes": 1501,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25526-florida-fatal-police-shooting-gator-attack-rc-925p-b8907f.jpg",
            "top_comments": [
                "It’s like they used a “Florida man” random headline generator",
                "Save you a click: Meth. It was meth.",
                "booked and released for meth charges a week ago (⊙\\_⊙;) might explain his behavior",
                "That is definitely a Florida headline",
                "Two deputies, including a trainee, opened fire on Timothy Schulz, 42, after they deployed a stun gun that appeared to have no effect and after Schulz tried to remove a firearm from their patrol cruiser, Polk County Sheriff Grady Judd told reporters.",
                "Kids this is why you don't do drugs...",
                "That's a rather misleading headline. \"Deputies fatally shot Florida man on meth-induced rampage\" would be more accurate.",
                "Is the alligator okay?",
                "Just normal everyday Polk County stuff.  Epicenter of Floridaman, including nutjob Floridaman sheriff.",
                "Are they still using bath salts in Florida?"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/27/2025 20:10:23 UTC"
}