{
    "posts": [
        {
            "category": "HOT",
            "title": "Democratic Rep. Gerry Connolly of Virginia dies after battling cancer",
            "external_url": "https://www.cnbc.com/2025/05/21/gerry-connolly-dies-cancer.html",
            "upvotes": 15345,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108148616-1747830859751-gettyimages-2202899876-AA_05032025_2114621.jpeg?v=1747830892&w=1920&h=1080",
            "top_comments": [
                "75 years old. He was just a fuckin' kid",
                "You’re kidding. RIP but denying AOC this position for a man with 5 months to live is pure insanity.",
                "Upon hearing the news, Democratic leadership began feverishly drawing up plans to install him into a higher position in leadership.",
                "This is the guy they said was a better candidate than AOC, jeez",
                "Damn, I lost a friend to esophageal cancer. She was only 40. She was diagnosed a couple years ago. One day she quit her job, went into hospice, and died less than a week later.",
                "Six House Democrats have died in office in the past 13 months. Donald Payne Jr., Sheila Jackson Lee, Bill Pascrell, Sylvester Turner, Rayl Grijalva,  and now Gerry Connolly.",
                "The person the dem leaders fought tooth and nail to get the position so AOC wouldn’t be it? Just lol",
                "This just makes me more angry that they made him the ranking Dem on the oversight committee instead of AOC. Dem leadership really needs to pass the torch to the new generation who actually wants to fight, and then get the hell out of their way.",
                "I liked Connolly and thought he was a great guy.\n\nBut Democrats need to get a goddamn clue and start acting in a way that matches their rhetoric that democracy is under threat. THREE House Democrats who had cancer and ran for re election died since January while the GOP holds a razor thin majority. Every vote matters for these huge sweeping policy changes the Republicans want to make.\n\nWe keep being told “democracy is at stake, don’t criticize Democrats! Why aren’t you talking about Trump instead?” Enough. This is anti-democratic behavior to try to stifle the voices of voters and media that are raising these obvious issues of Democrats clinging to power at the price of the people they serve. \n\nIf you believe in democracy, you need to believe in challenging your own side without sputtering “But Trump!” and “both sidesism”",
                "He was actually a pretty decent Congressman, though he probably should've resigned once he got the diagnosis."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Revealed: UnitedHealth secretly paid nursing homes to reduce hospital transfers",
            "external_url": "https://www.theguardian.com/us-news/2025/may/21/unitedhealth-nursing-homes-payments-hospital-transfers?CMP=oth_b-aplnews_d-1",
            "upvotes": 31383,
            "date": "05/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6cfea175f2c210fdf7f1b2e96df3618135210fa1/0_0_3000_2400/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=477cefc705ba471cf3c3e308933a0cbd",
            "top_comments": [
                "Not shocking the UNH is actively trying to reduce quality of care because they are a company whose sole motivation is to optimize for profit.",
                "That CEO killed a lot more than one person.",
                "Prison. This act had to result in deaths.",
                "Every day is one day closer to this shit stain of a company going down in flames. Hopefully.",
                "This is just downright evil:\n\n> Two current and three former UnitedHealth nurse practitioners told the Guardian that UnitedHealth managers pressed nurse practitioners to persuade Medicare Advantage members to change their “code status” to DNR even when patients had clearly expressed a desire that all available treatments be used to keep them alive.\n\nDNR and DNI are great and everyone should be given the opportunity to register that preference. But it is critical that people choose freely and without pressure or bias from medical staff and that their true wishes are what is reflected in their chart. Otherwise it invites murder via withdrawal of lifesaving medical care.",
                "To those united nurse employees who spoke out and brought light to this: thank you. Your bravery could have helped save hundreds of lives.\n\nETA: from the article…\nIf you are a current or former UnitedHealth or nursing home employee and have information you’d like to share securely with the Guardian about nursing home care, please use a non-work device to call or text investigative reporter George Joseph via the Signal messaging app at 929-486-4865.",
                "But he’s a father! They were surprised by the public’s reaction to the CEOs death but this will unlikely get the same coverage despite being way worse than the murder of one man. Torture and suffering orchestrated for share holders is the real crime here.",
                "The fine they are going to pay will surely be a deterrent in the future. Surely.\n\n/s",
                "Is anyone going to do anything about it? Of course not. Punishment is for the poors.",
                "Healthcare for profit should be illegal."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Target sales drop in 1st quarter and retailer warns they will slip for all of 2025",
            "external_url": "https://apnews.com/article/target-first-quarter-earnings-tariffs-ed5765bac92257a0bab3815ece31f5c1",
            "upvotes": 3160,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh shit, better cut 40% of employees to make up the losses and show confidence to your investors while your stores further turn to shit in hopes that stock prices remain stable.\n\nInfinite growth expectation is stupid af.",
                "Kinda wild to see corporations making political decisions in spite of the fact that it hurts their bottom line",
                "Maybe they should not have bent over for one group and their king?",
                "How much of this was due to boycotts due to their reversal on DEI?",
                "When they capitulated, El Target became dead to my household. Cowards.",
                "I haven’t shopped there since they did their reversal on DEI policy.  F. Target, you get what you deserve, hope more people follow suit.",
                "Can only talk about my experience but I turned away from Target completely last year when they decided that it was easier to remove all LGBT merch during Pride Month than to deal with Republicans that were throwing fits at the store bc a shirt had a rainbow on it. I used to be a regular customer and haven’t gone back since. \n\nIt’s wild how they alienated and completely destroyed their base in just over a year.",
                "FIRE. \n\nYOUR. \n\nCEO. \n\nAnd then re-instate your DEI practices. That’s what it will take to get us back in the door.",
                "As a Minnesota native, Target has been my go-to big-box store. Since their policy changes, we have stopped going there. Target was a gold standard for equity and has always had a more liberal policy. Now its just shooting themselves in the foot. And for what?",
                "Side with fascist and loos your assets"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration formally accepts gift jet from Qatar",
            "external_url": "https://www.cnbc.com/2025/05/21/trump-qatar-boeing-jet.html",
            "upvotes": 3476,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108144024-1747053448193-gettyimages-2214055688-AFP_46AR2DF.jpeg?v=1747852260&w=1920&h=1080",
            "top_comments": [
                "Buying off the President and it's not even a *new* jet.\n\nGreat job America.",
                "We asked them for it, too, it wasn't some spontaneous gift from what I've read. Most corrupt shit I have seen from a Presidential administration, right out in the open. No accountability.",
                "The one that Qatar had on ice for years because it costs too much to maintain and is too big to land at most airports? That one?",
                "Impeachable offense. Taking gifts from foreign influencers was the prime fear of the founders - this is a black and white impeachable offense.",
                "Congrats, now taxpayers can pay to have the plane stripped and then rebuilt for AF1 and then pay for it to be stripped and unequipped of all of that when Trump’s term ends!\n\nSaving money!",
                "Obligatory if Obama or Biden had done this……",
                "I fucking hate this timeline",
                "Openly corrupt president.  Get your shit together US.  Time to get him out of office.",
                "Wonder how long it would take to search something this massive for security risks",
                "Of course, because fuck the Constitution, right?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Person with measles attended Shakira concert, N.J. health officials say",
            "external_url": "https://www.cbsnews.com/newyork/news/shakira-concert-measles-exposure-nj/",
            "upvotes": 3974,
            "date": "05/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/20/2131a7fa-c65e-4383-8229-6d32cf8ca9b2/thumbnail/1200x630/13a0032a3d73f74607bb928f0c5791d2/gettyimages-2214700849.jpg?v=f80504b4a2a31dbf7fe3bb9ae688e3d2",
            "top_comments": [
                "This reads like a Plague Inc. notification lol",
                "Someone in the most contagious phase of measles can infect up to 90% of the people they come into contact with. Insert “This is fine” gif here.",
                "And measles sang \"whenever, where ever, we're meant to be together\"",
                "New Jersey health officials are warning people who attended Thursday's Shakira concert at MetLife stadium that a concertgoer had the measles. \n\nThe Health Department says **someone who lives out of state attended the concert while infectious**. \n\nPeople may have been exposed on May 15 starting around 7:30 p.m. to May 16th at 1 a.m. \n\nOfficials are urging everyone to stay up to date on their vaccines, which is the best protection against the disease. \n\nAnyone who believes they may have contracted measles is asked to call their health care provider before going to any medical office or emergency department for treatment, so special measures can be taken to prevent the potential of further spread. The virus spreads easily through the air. ",
                "We learned absolutely nothing. I lost loved ones for nothing. God I'm so fucking angry.",
                "Microbiologist here: OH GOD",
                "What backward country was this in?\n\nOh.",
                "Before the vaccine was available in 1963, nearly every child got measles by age 15. The disease sickened 3 million to 4 million people and led to about 500 deaths and 48,000 hospitalizations every year.",
                "✅ Get vaccinated\n\n✅ Vaccinate your kids\n\n✅ Don't take medical advice from RFK Jr.",
                "These selfish antivax parents are just cowards who can’t deal with their kids crying at the doctor. Now anyone with an infant needs to think twice about taking them in public."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US Army to change transgender soldiers' records to birth sex",
            "external_url": "https://www.reuters.com/world/us/us-army-change-transgender-soldiers-records-birth-sex-2025-05-21/",
            "upvotes": 2883,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Really tackling the important issues.",
                ">There are 4,240 U.S. active-duty and National Guard transgender troops, officials have said. Transgender rights advocates have given higher estimates.\n\n> the Department of Defense (DoD) listed nearly 1.29 million people as active-duty troops, and 767,238 as national guard/reserves.\n\nhttps://usafacts.org/articles/how-many-people-are-in-the-us-military-a-demographic-overview/\n\nroughly 0.25%… all this work to fuck over 0.25%, an already marginalized group.",
                "This is why I'm so cynical about the government. Not because we haven't made progress, we absolutely have, but because every governmental entity jumps lock-step to whatever outlook the current administration has. How could I have any respect for the military when I know where one conservative shift away from them not respecting me?",
                "A trans man recently killed himself at our base after being told he was being kicked out.  He already had transitioned years ago and served honorably for many years.\n\nI can’t imagine what he went through.  Giving your life for this country and then being kicked out for being who you are.  Being told you are getting kicked out of your home, career ended and everything you’ve worked for taken away ended in this result.\n\nThis is not an isolated incident at all.  It’s despicable.  The depression the other sailors, his coworkers etc are all experiencing as a result of the death of one of their own.  Nobody wanted him out or thought he shouldn’t be here.  Except this fascist dictator we are living under.",
                "Of course because \"fuck you for volunteering to die for your country\" is Trumps military slogan",
                "It would cost nothing to do nothing about it. But instead, they pay with the honor of the country.",
                " Why?  I thought discharges were in order?  Why the extra steps?",
                "Transgender people willing to put their lives at stake for a country that treats them like filth, and this is how they are repaid for their service. Funny how men who have never served a day in their life think they know what qualities a good servicemember should have.",
                "Why bother, yall already banned them from the military.",
                "Because: it’s important- nope \n\nBecause it’s cruel - yup"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Justice Department ends police reform agreements and halts investigations into major departments",
            "external_url": "https://www.cnn.com/2025/05/21/politics/justice-department-consent-decree-police-department",
            "upvotes": 2938,
            "date": "05/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-1220495007.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">The Trump administration is dismissing investigations into several major US police departments, as well as consent decrees in Louisville and Minneapolis reached following the fatal shooting of Breonna Taylor and police killing of George Floyd.\n\n>The move, announced by the head of the Justice Department’s Civil Rights Division, reflects the administration’s opposition to agreements that require reforms of police departments where the DOJ found a pattern of misconduct.\n\nTL;DR Convicted felon is allowing police departments to run from the Derek Chauvin playbook.",
                "Trying in broad daylight to expand the ranks of the brownshirts.",
                "When will they learn that piece of shit cops are a drain on society and end up costing the tax payers more?",
                "Firehose of fascist evil. Every fucking day.",
                ">Jim Pasco, the longtime Executive Director of the Fraternal Order of Police, said that consent decrees ... exacerbates the problem because it validates thinking in urban areas that the police are their enemy,” he said.\n\nYeah, well, not to be dramatic, but maybe there is some validity to the thinking.",
                "Hey CNN make sure to promote Jake Tappers breathless book some more instead of shit like this.",
                "Ya'll look up the Goon Squad in Mississippi if you want to see why federal oversight of police districts are necessary. \n\nNow every state, every county, can have a Goon Squad just like that and when the shit hits the fan they will only need to investigate themselves. Justice Dept will turn their heads away and let it all happen. \n\nThat's how MAGA wants police to act. That's Trump's America.",
                "That is entirely on brand for Republicans. Criminal activity and the Republican Party are synonymous at this point.",
                "So we’ll just have to defend ourselves against cops who stop acting within the law. It’s the only alternative. We tried reform, oversight, etc. and it still ended up with us getting our rights violated or ending up dead. Time to force the “good cops” to do more to oust the problems from within. \n\nStart ostracizing cops in society. Your neighbor that wears the badge? Don’t talk to them. Don’t help them. Don’t interact with them. Use the same tactics many of us have been discussing regarding CBP and ICE agents. They want to act like they’re better than the rest of us, then they don’t need to interact with the rest of us. They can stay in their own little bubble of fellow fascists in all aspects of life. Game nights, church, getting groceries, going out to eat, etc.",
                "what is the breaking point for the american people"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "24-year-old man arrested after posing as 16-year-old high school student: Police",
            "external_url": "https://abcnews.go.com/US/24-year-man-arrested-after-posing-16-year/story?id=122004305",
            "upvotes": 1997,
            "date": "05/21/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/73597d59-db44-4d88-b8a1-89d18d9e2aba/labrador-anthony-woodcountysheriff-mf-20250520_1747771876392_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Kind of pathetic that the 24 year old has to play on the jv team. Couldnt even make the varsity roster.",
                ">He also told the school that he was a victim of human trafficking, police said.\n\nHe got setup with a caring family that helps real kids in his exact situation and went to high school like it was no big deal. \n\n>Then on May 14, the Melfreds were contacted by a woman, Evelyn Camacho, who stated that Labrador was \"actually a 24-year-old and he was the father of her child,\" police said. Camacho sent the Melfreds a picture of Labrador's driver's license with a birthdate of March 27, 2001, along with Facebook pictures of her with Labrador and a small child, police said.\n\nThat's despicable. Aside from the fraud, he ran from his baby.",
                "Well that was a wild read.",
                "But Channing Tatum and Jonah hill are allowed to do it?",
                "It's legal when Hollywood does it. Jeez double standards /s",
                "Fun fact, the movie Fast Times At Ridgemont High was based on a book written by an author who did this and then wrote a book based on his experiences.",
                "On the JV soccer team lmao",
                "Did he infiltrate the dealers? Find their supplier?",
                "I used to teach auto mechanics at a tec college years ago. \n\nWe taught highschool, college age and adult-ed all at the same time. Highschool kids didn't have to pay for the class. The way that worked is, the school would send me a list of their students to print out each day, and the kids signed next to their name each day for credit. The school would forget to add students all the time, so we would have the kids pen their name in a extra space and sign next to it. \n\nOne day a young man showed up and said he was a new student at the local highschool. I didn't have anything to do with their enrollment so I assumed he was. Over the course of two months he stripped down and rebuilt this old Cadillac he brought in. \n\nHe was a model student the entire time. \n\nHe was super polite, funny, safe and professional. He would round up other kids to get them to help him, teach them what he was doing, checked out tools the proper way, kept his workplace clean, dressed properly and signed-in every day without fail. \nHe passed every written test the first time and did everything required of him. Until he got that Cadillac running, then he and the car vanished. \n\n\nWhen I asked the school's main office if they knew anything about him, they said they had no idea who he was. Then I asked the other teacher in the program if he knew anything, he thought I signed him up.\n\nThis guy was an absolute phantom, not even the police department knew anything. I still wonder who the hell he was.",
                "How do you do, fellow kids?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "South Carolina death row inmate seeks to volunteer to die after friends are executed",
            "external_url": "https://apnews.com/article/appeals-dropped-execution-james-robertson-south-carolina-2cc0a160af764ef99115d665ea132c22",
            "upvotes": 729,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">After his best friend and four other of his fellow [death row inmates](https://apnews.com/article/south-carolina-firing-squad-eyewitness-account-sigmon-427cccb55be58954af4434e89bcc41d8) have been put to death in less than a year, a South Carolina inmate wants to become his own attorney which would likely mean his own execution in weeks or months.\n\n>A federal judge has ordered a 45-day delay in James Robertson’s request to have a different lawyer talk to him and make sure he really wants to fire his own attorneys and deal with the likely lethal consequences of his decision.\n\n>[Robertson](https://apnews.com/general-news-0046ab50eb834c2fad3b36b55367c45b), 51, has been on death row since 1999 after killing both his parents in their Rock Hill home. He beat his father with the claw end of a hammer and a baseball bat and stabbed his mother. He tried to make it look like a robbery in hopes he would get his part of their $2.2 million estate, prosecutors said.\n\n>Robertson has fired his lawyers before. Not long after he arrived on death row he wanted to drop his appeals after a card playing buddy never appealed his death sentence for setting a van on fire with his daughter inside outside his ex-wife’s house.\n\nThe man murdered his parents and he misses his deceased death-row friends, so maybe the state should just go along with it.",
                "I don't see any real downside to granting his request. He's just speeding up the inevitable and that's his choice.",
                "Generally I am against the death penalty because it is both expensive and more importantly we have executed innocent people (and come close on several others). Once the state wrongly executes someone, we all own that.\n\nIn this instance, if he wants to speed it up and admits to his guilt or at least doesn’t fight to claim he is innocent. Let him.",
                "He needs representation to ensure the state follows the law and he is accorded his full rights. It’s not about him at this point, it’s about ensuring protection to those in state custody.",
                "This happens quite frequently (inmates trying to accelerate their process). Rarely successful.",
                "When I think of death penalty, I think that's wrong and immoral\n\nThen I read what these people have done and I'm suddenly good with it - at least in the moment.\n\nSet your van on fire with your daughter inside, outside of your ex's house.   Holy shit.\n\nThe last time I read about this, it was a woman who cut a ladies baby out of her belly and left her to die",
                "Judges don't like dealing with pro se defendants, and that is half the reason they don't like it when people waive their right to counsel. \n\nIf this guy wants to go ahead and check out, I don't see what the problem is. Are his attorneys ethically barred from pursuing the objective of hastening his execution?\n\nOr is there a material reason to believe he isn't competent to make that call, beyond the fact that our system presumes the decision to be dubious?",
                "The death penalty is barbaric in all cases.",
                "Wonder if he ends up taking the matter into his own hands",
                "He wants to die.\n\nThe best thing to do would be to commute his sentence to life without parole. \n\nThat is not only cheaper, but more intense a punishment."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Family mourns boy killed by Israeli strike as he searched for bread",
            "external_url": "https://www.nbcnews.com/world/israel/israel-gaza-war-hamas-aid-warning-united-nations-starvation-famine-rcna208159",
            "upvotes": 1486,
            "date": "05/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250521-Ashraf-Mahmoud-death-RS-2dab85.jpg",
            "top_comments": [
                "All for bread. Such a shame. Poor little guy. RIP",
                "how soon until the thread is locked?",
                "And yet, some genocide apologist will somehow make this about Hamas. Fucking freaks.",
                "But it's a war!!! Isn't Isreal able to defend itself!!! You believe the hamas propaganda?!?!?!? DO YOU EVEN CONDEMN OCT 7TH!!!!!!!!!! \n \ndid I miss any?",
                "There was a gun in the bread and a Hamas member in the milk jug. It’s justified.",
                "[removed]",
                "I can’t believe people are still defending this by citing October 7th. As if the kidnapping of a few hundred people in any way justifies the systematic slaughter of the entire population of the Gaza Strip. Which Israel has openly stated is the end goal now, regardless of whether the hostages are released or not.\nTo even pretend this is proportionate, or any form of justice whatsoever, is unfathomably evil.",
                "They will be claiming that he was out to scout their innocent diaper force and plant bombs. Sad times we live in.",
                "Israel is killing innocents with impunity and it's sad and heartbreaking to see the same thing happen so often. Western countries are continuing to fund this nation despite seeing all this, and I have no words.",
                "There should be law against this kind of thing…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Former New York state trooper pleads guilty to faking his own shooting",
            "external_url": "https://apnews.com/article/new-york-trooper-shot-guilty-plea-5b822d3e3da0d51978637fff6eb6e2ff",
            "upvotes": 41,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Instead, prosecutors say, he staged the scene of the alleged shooting by scattering shell casings, then shot himself at a park, stashed the .22-caliber rifle, drove back to the highway and called for backup.\n\n>Nassau County District Attorney Anne Donnelly said after Wednesday’s hearing that “one of the most disturbing parts” of the case was that he intentionally set in motion a potentially dangerous search.\n\n>Mascia described the fictitious driver as a “dark-skinned” man wearing a balaclava that exposed only his eyes. He also claimed the suspect fled in a car bearing temporary New Jersey plates heading toward New York City.\n\n\nDisturbing is putting it mildly. He used the familiar “dark-skinned man” trope to shift blame, and risked the lives of anyone in the area fitting the description. The cops would be far more trigger-happy if they thought another cop had been shot.",
                "> “If someone had been stopped that fit the description? Who knows what would have happened?” the district attorney said. “It’s just a frightening thought.”\n\nYeah, maybe if cops were actually held to standards it would be less terrifying.",
                "The best nickname i can come up with is Justice Smollett, but I think we can do better.",
                ">Donnelly said the ruse was an apparent bid to gain sympathy from a former girlfriend\n\nWell she dodged a bullet."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Hundreds of rural hospitals are at risk of closing, threatening critical care",
            "external_url": "https://www.cbsnews.com/news/rural-hospitals-closing-reimbursements/",
            "upvotes": 157,
            "date": "05/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/19/b7876bca-14e8-4562-8a64-913cf72d88e6/thumbnail/1200x630/12e3219795938931a95e64a4953c7bbe/b5-shamlian-rural-hospitals-051925-en-copy-02-frame-163.jpg?v=f80504b4a2a31dbf7fe3bb9ae688e3d2",
            "top_comments": [
                "Rural communities voted for this.",
                "One of the things I also wonder about with these cuts is how many of these rural families have elderly family members in nursing homes that are about to lose coverage that pays for their care?",
                "We the people who voted against this shit storm are stuck fighting to protect the opther people from the people they voted in.  I am pretty sure we are not going to be able to apply any brakes until november 2026",
                "Meh. Elections have consequences. I know that, to them, this is all Biden's fault but let them lose their farms and have no options for health care. They chose it.",
                "Low reimbursement rates while Unitedhealth alone made a $90 billion gross profit last year. Single payer is the only fix.",
                "*The Center for Healthcare Quality and Payment Reform's report* *found that 742 rural hospitals are at risk of closing, with over 300 of those being classified as being at \"immediate risk.*\n\nMedicare and Medicaid payments decrease every year, and with the Medicaid cuts about to hit, this will cut the number of paying patients which will be another heavy load on these hospitals.",
                "I feel terrible for the people who didn't vote for the rapist/pedophile. The ones that did can burn for all I care.",
                "Trump doesn't care, he just got a new airplane.",
                "It saddens me that non-maga people are getting hurt by this. The cynical part of me feels that rural communities brought this on themselves, and that nothing will change until the situation affects them. My only solace is the hope that through all of this, maybe, just maybe, they'll wake the f up. It's an awful part of human nature. My intuition says things will change as a result, but will go right back to \"own the libs\" as soon as it's over.",
                "MAGA voted to close their own hospitals."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Target sales drop in 1st quarter and retailer warns they will slip for all of 2025",
            "external_url": "https://apnews.com/article/target-first-quarter-earnings-tariffs-ed5765bac92257a0bab3815ece31f5c1",
            "upvotes": 3131,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh shit, better cut 40% of employees to make up the losses and show confidence to your investors while your stores further turn to shit in hopes that stock prices remain stable.\n\nInfinite growth expectation is stupid af.",
                "Kinda wild to see corporations making political decisions in spite of the fact that it hurts their bottom line",
                "Maybe they should not have bent over for one group and their king?",
                "How much of this was due to boycotts due to their reversal on DEI?",
                "When they capitulated, El Target became dead to my household. Cowards.",
                "I haven’t shopped there since they did their reversal on DEI policy.  F. Target, you get what you deserve, hope more people follow suit.",
                "Can only talk about my experience but I turned away from Target completely last year when they decided that it was easier to remove all LGBT merch during Pride Month than to deal with Republicans that were throwing fits at the store bc a shirt had a rainbow on it. I used to be a regular customer and haven’t gone back since. \n\nIt’s wild how they alienated and completely destroyed their base in just over a year.",
                "FIRE. \n\nYOUR. \n\nCEO. \n\nAnd then re-instate your DEI practices. That’s what it will take to get us back in the door.",
                "As a Minnesota native, Target has been my go-to big-box store. Since their policy changes, we have stopped going there. Target was a gold standard for equity and has always had a more liberal policy. Now its just shooting themselves in the foot. And for what?",
                "Side with fascist and loos your assets"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Texas Renaissance Festival founder ‘King George’ dies at Todd Mission home",
            "external_url": "https://www.fox26houston.com/news/todd-mission-death-investigation-texas-renaissance-festival-king-george-home",
            "upvotes": 137,
            "date": "05/21/2025",
            "thumbnail": "https://images.foxtv.com/c107833-mcdn.mp.lura.live/expiretime=2082787200/94754bd1f864af7901752ef3644159c091fbd6e825ae9b2e5fe3a0856ff585e4/iupl/BD1/1A6/1280/720/BD11A6ADA02FA9B5EBD0A07B9AED8071.jpg?ve=1&tl=1",
            "top_comments": [
                "Rest in piss, creepy greedy old narcissist",
                "the king is dead? now the lords of the realm will fight for succession.",
                "weird coincidence, I just watched a documentary on this guy on Monday. RIP",
                "He's up in heaven, paying for escort Angels.",
                "“No suspected danger to the public” 😂",
                "Real curious who his will puts in charge.....  \nDude was a legit lunatic, that will could be WILD.",
                "Damn RIP. Just did my first ren fest there last November it was awesome... The after hours shit is crazy 💀",
                "Obligatory King of the Hill: \n\nKing Philip: [in British accent] \"Department of Labor, OSHA\"\n[British accent slowly becoming Texan drawl]\n\nKing Philip: \"Texas Workforce Commission\"?\n[full American accent]\n\nKing Philip: Crap! I'm gonna lose my Faire. I don't want to go back to selling real estate!",
                "The Ren Faire doc was great - I think it’s easy to mistake it as reality tv but it really does a great job displaying the relationships that all these people had with King George. The greed and betrayal that occurs in a ‘small’ family business, and how far passion actually gets some of them (not far) is really captivating. I was mistaken to think that King George was just a crazy old bat, which he was, but when it came to the financials and operations he was very sharp. Many of the people striving to be his successor weren’t really aware of that fact, and thought once they got in they’d be steering the ship, but were in over their heads. \n\nI’d recommend people give the documentary a chance as it really takes some crazy turns."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Roof of historic Ming Dynasty tower collapses in China - BBC News",
            "external_url": "https://www.bbc.com/news/articles/c1w33xnnjdzo.amp",
            "upvotes": 66,
            "date": "05/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2f59/live/2324b8c0-3653-11f0-8947-7d6241f9fce9.jpg",
            "top_comments": [
                "That is really unfortunate. Hopefully it was due to just being an old building and not foul play. Wonder if it was cased by the rebuild in 1995.",
                "*The Drum Tower - reportedly the largest in China - was built in 1375 during the Ming Dynasty but had undergone an extensive rebuild in 1995.*\n\nNot a very \"extensive\" rebuild it seems, esp when you pit it next to original construction in 1375."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump administration formally accepts gift jet from Qatar",
            "external_url": "https://www.cnbc.com/2025/05/21/trump-qatar-boeing-jet.html",
            "upvotes": 3468,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108144024-1747053448193-gettyimages-2214055688-AFP_46AR2DF.jpeg?v=1747852260&w=1920&h=1080",
            "top_comments": [
                "Buying off the President and it's not even a *new* jet.\n\nGreat job America.",
                "We asked them for it, too, it wasn't some spontaneous gift from what I've read. Most corrupt shit I have seen from a Presidential administration, right out in the open. No accountability.",
                "The one that Qatar had on ice for years because it costs too much to maintain and is too big to land at most airports? That one?",
                "Impeachable offense. Taking gifts from foreign influencers was the prime fear of the founders - this is a black and white impeachable offense.",
                "Congrats, now taxpayers can pay to have the plane stripped and then rebuilt for AF1 and then pay for it to be stripped and unequipped of all of that when Trump’s term ends!\n\nSaving money!",
                "Obligatory if Obama or Biden had done this……",
                "I fucking hate this timeline",
                "Openly corrupt president.  Get your shit together US.  Time to get him out of office.",
                "Wonder how long it would take to search something this massive for security risks",
                "Of course, because fuck the Constitution, right?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "South Carolina death row inmate seeks to volunteer to die after friends are executed",
            "external_url": "https://apnews.com/article/appeals-dropped-execution-james-robertson-south-carolina-2cc0a160af764ef99115d665ea132c22",
            "upvotes": 725,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">After his best friend and four other of his fellow [death row inmates](https://apnews.com/article/south-carolina-firing-squad-eyewitness-account-sigmon-427cccb55be58954af4434e89bcc41d8) have been put to death in less than a year, a South Carolina inmate wants to become his own attorney which would likely mean his own execution in weeks or months.\n\n>A federal judge has ordered a 45-day delay in James Robertson’s request to have a different lawyer talk to him and make sure he really wants to fire his own attorneys and deal with the likely lethal consequences of his decision.\n\n>[Robertson](https://apnews.com/general-news-0046ab50eb834c2fad3b36b55367c45b), 51, has been on death row since 1999 after killing both his parents in their Rock Hill home. He beat his father with the claw end of a hammer and a baseball bat and stabbed his mother. He tried to make it look like a robbery in hopes he would get his part of their $2.2 million estate, prosecutors said.\n\n>Robertson has fired his lawyers before. Not long after he arrived on death row he wanted to drop his appeals after a card playing buddy never appealed his death sentence for setting a van on fire with his daughter inside outside his ex-wife’s house.\n\nThe man murdered his parents and he misses his deceased death-row friends, so maybe the state should just go along with it.",
                "I don't see any real downside to granting his request. He's just speeding up the inevitable and that's his choice.",
                "Generally I am against the death penalty because it is both expensive and more importantly we have executed innocent people (and come close on several others). Once the state wrongly executes someone, we all own that.\n\nIn this instance, if he wants to speed it up and admits to his guilt or at least doesn’t fight to claim he is innocent. Let him.",
                "He needs representation to ensure the state follows the law and he is accorded his full rights. It’s not about him at this point, it’s about ensuring protection to those in state custody.",
                "This happens quite frequently (inmates trying to accelerate their process). Rarely successful.",
                "When I think of death penalty, I think that's wrong and immoral\n\nThen I read what these people have done and I'm suddenly good with it - at least in the moment.\n\nSet your van on fire with your daughter inside, outside of your ex's house.   Holy shit.\n\nThe last time I read about this, it was a woman who cut a ladies baby out of her belly and left her to die",
                "Judges don't like dealing with pro se defendants, and that is half the reason they don't like it when people waive their right to counsel. \n\nIf this guy wants to go ahead and check out, I don't see what the problem is. Are his attorneys ethically barred from pursuing the objective of hastening his execution?\n\nOr is there a material reason to believe he isn't competent to make that call, beyond the fact that our system presumes the decision to be dubious?",
                "The death penalty is barbaric in all cases.",
                "Wonder if he ends up taking the matter into his own hands",
                "He wants to die.\n\nThe best thing to do would be to commute his sentence to life without parole. \n\nThat is not only cheaper, but more intense a punishment."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US singer Chris Brown granted bail by UK court ahead of his world tour",
            "external_url": "https://www.abc.net.au/news/2025-05-21/us-singer-chris-brown-granted-bail-by-uk-court/105321194",
            "upvotes": 125,
            "date": "05/21/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/68e979f58b33b0ae3997834e2e45aeb4?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=0&width=862&height=485&imformat=generic",
            "top_comments": [
                ">US singer Chris Brown has been granted bail by a UK court, clearing the way for his world tour to begin next month.\n\n>Brown has been charged with allegedly inflicting grievous bodily harm on music producer Abraham Diaw with a tequila bottle in a London nightclub in 2023.\n\n>The 36-year-old has not yet been asked to enter a plea to the charge.\n\nHe paid £5M ($6.7M) to get out on bail in case anyone was wondering how much the world tour needed to make.",
                "Totally makes sense for a repeat violent offender with the means to flee.",
                "Brown was driving a vehicle with Robyn F. as the front passenger on an unknown street in Los Angeles. Robyn F. picked up Brown's cellular phone and observed a three-page text message from a woman who Brown had a previous sexual relationship with.\n\n\nA verbal argument ensued and Brown pulled the vehicle over on an unknown street, reached over Robyn F. with his right hand, opened the car door and attempted to force her out. Brown was unable to force Robyn F. out of the vehicle because she was wearing a seat belt. When he could not force her to exit, he took his right hand and shoved her head against he passenger window of the vehicle, causing an approximate one-inch raised circular contusion.\n\n\nRobyn F. turned to face Brown and he punched her in the left eye with his right hand. He then drove away in the vehicle and continued to punch her in the face with his right hand while steering the vehicle with his left hand. The assault caused Robyn F.'s mouth to fill with blood and blood to splatter all over her clothing and the interior of the vehicle.\n\n\nBrown looked at Robyn F. and stated, 'I'm going to beat the sh-- out of you when we get home! You wait and see!'\n\n\nThe detective said \"Robyn F.\" then used her cell phone to call her personal assistant Jennifer Rosales, who did not answer.\n\n\nRobyn F. pretended to talk to her and stated, 'I'm on my way home. Make sure the police are there when I get there.'\n\n\nAfter Robyn F. faked the call, Brown looked at her and stated, 'You just did the stupidest thing ever! Now I'm really going to kill you!'\n\n\nBrown resumed punching Robyn F. and she interlocked her fingers behind her head and brought her elbows forward to protect her face. She then bent over at the waist, placing her elbows and face near her lap in [an] attempt to protect her face and head from the barrage of punches being levied upon her by Brown.\n\n\nBrown continued to punch Robyn F. on her left arm and hand, causing her to suffer a contusion on her left triceps (sic) that was approximately two inches in diameter and numerous contusions on her left hand.\n\n\nRobyn F. then attempted to send a text message to her other personal assistant, Melissa Ford. Brown snatched the cellular telephone out of her hand and threw it out of the window onto an unknown street.\n\n\nBrown continued driving and Robyn F. observed his cellular telephone sitting in his lap. She picked up the cellular telephone with her left hand and before she could make a call he placed her in a head lock with his right hand and continued to drive the vehicle with his left hand.\n\n\nBrown pulled Robyn F. close to him and bit her on her left ear. She was able to feel the vehicle swerving from right to left as Brown sped away. He stopped the vehicle in front of 333 North June Street and Robyn F. turned off the car, removed the key from the ignition and sat on it.\n\n\nBrown did not know what she did with the key and began punching her in the face and arms. He then placed her in a head lock positioning the front of her throat between his bicep and forearm. Brown began applying pressure to Robyn F.'s left and right carotid arteries, causing her to be unable to breathe and she began to lose consciousness.\n\n\nShe reached up with her left hand and began attempting to gouge his eyes in an attempt to free herself. Brown bit her left ring and middle fingers and then released her. While Brown continued to punch her, she turned around and placed her back against the passenger door. She brought her knees to her chest, placed her feet against Brown's body and began pushing him away. Brown continued to punch her on the legs and feet, causing several contusions.\n\n\nRobyn F. began screaming for help and Brown exited the vehicle and walked away. A resident in the neighborhood heard Robyn F.'s plea for help and called 911, causing a police response. An investigation was conducted and Robyn F. was issued a Domestic Violence Emergency Protective Order.",
                "Who in the fuck is Chris Browns audience?",
                "When you're a star, they let you do it.",
                "Is Tyler the Creator still someone they won't even let enter the country or did that ban get lifted? Seems... interesting to ban someone over words in songs while being softer than grandfather cocks on someone who's acted violently for years.",
                "This is going to ruin the tour...",
                "5 bucks says he jumps bail and gets tf out of the UK and never returns.",
                "The amount of people cancelled forever for next to nothing and this scumbag getting free rein. Proof that as long as women fancy you, you’ve no worry about consequence.",
                "Anyone going to see him is scum."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US Army to change transgender soldiers' records to birth sex",
            "external_url": "https://www.reuters.com/world/us/us-army-change-transgender-soldiers-records-birth-sex-2025-05-21/",
            "upvotes": 2890,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Really tackling the important issues.",
                ">There are 4,240 U.S. active-duty and National Guard transgender troops, officials have said. Transgender rights advocates have given higher estimates.\n\n> the Department of Defense (DoD) listed nearly 1.29 million people as active-duty troops, and 767,238 as national guard/reserves.\n\nhttps://usafacts.org/articles/how-many-people-are-in-the-us-military-a-demographic-overview/\n\nroughly 0.25%… all this work to fuck over 0.25%, an already marginalized group.",
                "This is why I'm so cynical about the government. Not because we haven't made progress, we absolutely have, but because every governmental entity jumps lock-step to whatever outlook the current administration has. How could I have any respect for the military when I know where one conservative shift away from them not respecting me?",
                "A trans man recently killed himself at our base after being told he was being kicked out.  He already had transitioned years ago and served honorably for many years.\n\nI can’t imagine what he went through.  Giving your life for this country and then being kicked out for being who you are.  Being told you are getting kicked out of your home, career ended and everything you’ve worked for taken away ended in this result.\n\nThis is not an isolated incident at all.  It’s despicable.  The depression the other sailors, his coworkers etc are all experiencing as a result of the death of one of their own.  Nobody wanted him out or thought he shouldn’t be here.  Except this fascist dictator we are living under.",
                "Of course because \"fuck you for volunteering to die for your country\" is Trumps military slogan",
                "It would cost nothing to do nothing about it. But instead, they pay with the honor of the country.",
                " Why?  I thought discharges were in order?  Why the extra steps?",
                "Transgender people willing to put their lives at stake for a country that treats them like filth, and this is how they are repaid for their service. Funny how men who have never served a day in their life think they know what qualities a good servicemember should have.",
                "Why bother, yall already banned them from the military.",
                "Because: it’s important- nope \n\nBecause it’s cruel - yup"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Justice Department ends police reform agreements and halts investigations into major departments",
            "external_url": "https://www.cnn.com/2025/05/21/politics/justice-department-consent-decree-police-department",
            "upvotes": 2935,
            "date": "05/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-1220495007.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">The Trump administration is dismissing investigations into several major US police departments, as well as consent decrees in Louisville and Minneapolis reached following the fatal shooting of Breonna Taylor and police killing of George Floyd.\n\n>The move, announced by the head of the Justice Department’s Civil Rights Division, reflects the administration’s opposition to agreements that require reforms of police departments where the DOJ found a pattern of misconduct.\n\nTL;DR Convicted felon is allowing police departments to run from the Derek Chauvin playbook.",
                "Trying in broad daylight to expand the ranks of the brownshirts.",
                "When will they learn that piece of shit cops are a drain on society and end up costing the tax payers more?",
                "Firehose of fascist evil. Every fucking day.",
                ">Jim Pasco, the longtime Executive Director of the Fraternal Order of Police, said that consent decrees ... exacerbates the problem because it validates thinking in urban areas that the police are their enemy,” he said.\n\nYeah, well, not to be dramatic, but maybe there is some validity to the thinking.",
                "Hey CNN make sure to promote Jake Tappers breathless book some more instead of shit like this.",
                "Ya'll look up the Goon Squad in Mississippi if you want to see why federal oversight of police districts are necessary. \n\nNow every state, every county, can have a Goon Squad just like that and when the shit hits the fan they will only need to investigate themselves. Justice Dept will turn their heads away and let it all happen. \n\nThat's how MAGA wants police to act. That's Trump's America.",
                "That is entirely on brand for Republicans. Criminal activity and the Republican Party are synonymous at this point.",
                "So we’ll just have to defend ourselves against cops who stop acting within the law. It’s the only alternative. We tried reform, oversight, etc. and it still ended up with us getting our rights violated or ending up dead. Time to force the “good cops” to do more to oust the problems from within. \n\nStart ostracizing cops in society. Your neighbor that wears the badge? Don’t talk to them. Don’t help them. Don’t interact with them. Use the same tactics many of us have been discussing regarding CBP and ICE agents. They want to act like they’re better than the rest of us, then they don’t need to interact with the rest of us. They can stay in their own little bubble of fellow fascists in all aspects of life. Game nights, church, getting groceries, going out to eat, etc.",
                "what is the breaking point for the american people"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Target sales drop in 1st quarter and retailer warns they will slip for all of 2025",
            "external_url": "https://apnews.com/article/target-first-quarter-earnings-tariffs-ed5765bac92257a0bab3815ece31f5c1",
            "upvotes": 3148,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh shit, better cut 40% of employees to make up the losses and show confidence to your investors while your stores further turn to shit in hopes that stock prices remain stable.\n\nInfinite growth expectation is stupid af.",
                "Kinda wild to see corporations making political decisions in spite of the fact that it hurts their bottom line",
                "Maybe they should not have bent over for one group and their king?",
                "How much of this was due to boycotts due to their reversal on DEI?",
                "When they capitulated, El Target became dead to my household. Cowards.",
                "I haven’t shopped there since they did their reversal on DEI policy.  F. Target, you get what you deserve, hope more people follow suit.",
                "Can only talk about my experience but I turned away from Target completely last year when they decided that it was easier to remove all LGBT merch during Pride Month than to deal with Republicans that were throwing fits at the store bc a shirt had a rainbow on it. I used to be a regular customer and haven’t gone back since. \n\nIt’s wild how they alienated and completely destroyed their base in just over a year.",
                "FIRE. \n\nYOUR. \n\nCEO. \n\nAnd then re-instate your DEI practices. That’s what it will take to get us back in the door.",
                "As a Minnesota native, Target has been my go-to big-box store. Since their policy changes, we have stopped going there. Target was a gold standard for equity and has always had a more liberal policy. Now its just shooting themselves in the foot. And for what?",
                "Side with fascist and loos your assets"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Justice Department ends police reform agreements and halts investigations into major departments",
            "external_url": "https://www.cnn.com/2025/05/21/politics/justice-department-consent-decree-police-department",
            "upvotes": 2935,
            "date": "05/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-1220495007.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">The Trump administration is dismissing investigations into several major US police departments, as well as consent decrees in Louisville and Minneapolis reached following the fatal shooting of Breonna Taylor and police killing of George Floyd.\n\n>The move, announced by the head of the Justice Department’s Civil Rights Division, reflects the administration’s opposition to agreements that require reforms of police departments where the DOJ found a pattern of misconduct.\n\nTL;DR Convicted felon is allowing police departments to run from the Derek Chauvin playbook.",
                "Trying in broad daylight to expand the ranks of the brownshirts.",
                "When will they learn that piece of shit cops are a drain on society and end up costing the tax payers more?",
                "Firehose of fascist evil. Every fucking day.",
                ">Jim Pasco, the longtime Executive Director of the Fraternal Order of Police, said that consent decrees ... exacerbates the problem because it validates thinking in urban areas that the police are their enemy,” he said.\n\nYeah, well, not to be dramatic, but maybe there is some validity to the thinking.",
                "Hey CNN make sure to promote Jake Tappers breathless book some more instead of shit like this.",
                "Ya'll look up the Goon Squad in Mississippi if you want to see why federal oversight of police districts are necessary. \n\nNow every state, every county, can have a Goon Squad just like that and when the shit hits the fan they will only need to investigate themselves. Justice Dept will turn their heads away and let it all happen. \n\nThat's how MAGA wants police to act. That's Trump's America.",
                "That is entirely on brand for Republicans. Criminal activity and the Republican Party are synonymous at this point.",
                "So we’ll just have to defend ourselves against cops who stop acting within the law. It’s the only alternative. We tried reform, oversight, etc. and it still ended up with us getting our rights violated or ending up dead. Time to force the “good cops” to do more to oust the problems from within. \n\nStart ostracizing cops in society. Your neighbor that wears the badge? Don’t talk to them. Don’t help them. Don’t interact with them. Use the same tactics many of us have been discussing regarding CBP and ICE agents. They want to act like they’re better than the rest of us, then they don’t need to interact with the rest of us. They can stay in their own little bubble of fellow fascists in all aspects of life. Game nights, church, getting groceries, going out to eat, etc.",
                "what is the breaking point for the american people"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump administration formally accepts gift jet from Qatar",
            "external_url": "https://www.cnbc.com/2025/05/21/trump-qatar-boeing-jet.html",
            "upvotes": 3476,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108144024-1747053448193-gettyimages-2214055688-AFP_46AR2DF.jpeg?v=1747852260&w=1920&h=1080",
            "top_comments": [
                "Buying off the President and it's not even a *new* jet.\n\nGreat job America.",
                "We asked them for it, too, it wasn't some spontaneous gift from what I've read. Most corrupt shit I have seen from a Presidential administration, right out in the open. No accountability.",
                "The one that Qatar had on ice for years because it costs too much to maintain and is too big to land at most airports? That one?",
                "Impeachable offense. Taking gifts from foreign influencers was the prime fear of the founders - this is a black and white impeachable offense.",
                "Congrats, now taxpayers can pay to have the plane stripped and then rebuilt for AF1 and then pay for it to be stripped and unequipped of all of that when Trump’s term ends!\n\nSaving money!",
                "Obligatory if Obama or Biden had done this……",
                "I fucking hate this timeline",
                "Openly corrupt president.  Get your shit together US.  Time to get him out of office.",
                "Wonder how long it would take to search something this massive for security risks",
                "Of course, because fuck the Constitution, right?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Person with measles attended Shakira concert, N.J. health officials say",
            "external_url": "https://www.cbsnews.com/newyork/news/shakira-concert-measles-exposure-nj/",
            "upvotes": 3977,
            "date": "05/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/20/2131a7fa-c65e-4383-8229-6d32cf8ca9b2/thumbnail/1200x630/13a0032a3d73f74607bb928f0c5791d2/gettyimages-2214700849.jpg?v=f80504b4a2a31dbf7fe3bb9ae688e3d2",
            "top_comments": [
                "This reads like a Plague Inc. notification lol",
                "Someone in the most contagious phase of measles can infect up to 90% of the people they come into contact with. Insert “This is fine” gif here.",
                "And measles sang \"whenever, where ever, we're meant to be together\"",
                "New Jersey health officials are warning people who attended Thursday's Shakira concert at MetLife stadium that a concertgoer had the measles. \n\nThe Health Department says **someone who lives out of state attended the concert while infectious**. \n\nPeople may have been exposed on May 15 starting around 7:30 p.m. to May 16th at 1 a.m. \n\nOfficials are urging everyone to stay up to date on their vaccines, which is the best protection against the disease. \n\nAnyone who believes they may have contracted measles is asked to call their health care provider before going to any medical office or emergency department for treatment, so special measures can be taken to prevent the potential of further spread. The virus spreads easily through the air. ",
                "We learned absolutely nothing. I lost loved ones for nothing. God I'm so fucking angry.",
                "Microbiologist here: OH GOD",
                "What backward country was this in?\n\nOh.",
                "Before the vaccine was available in 1963, nearly every child got measles by age 15. The disease sickened 3 million to 4 million people and led to about 500 deaths and 48,000 hospitalizations every year.",
                "✅ Get vaccinated\n\n✅ Vaccinate your kids\n\n✅ Don't take medical advice from RFK Jr.",
                "These selfish antivax parents are just cowards who can’t deal with their kids crying at the doctor. Now anyone with an infant needs to think twice about taking them in public."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US Army to change transgender soldiers' records to birth sex",
            "external_url": "https://www.reuters.com/world/us/us-army-change-transgender-soldiers-records-birth-sex-2025-05-21/",
            "upvotes": 2884,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Really tackling the important issues.",
                ">There are 4,240 U.S. active-duty and National Guard transgender troops, officials have said. Transgender rights advocates have given higher estimates.\n\n> the Department of Defense (DoD) listed nearly 1.29 million people as active-duty troops, and 767,238 as national guard/reserves.\n\nhttps://usafacts.org/articles/how-many-people-are-in-the-us-military-a-demographic-overview/\n\nroughly 0.25%… all this work to fuck over 0.25%, an already marginalized group.",
                "This is why I'm so cynical about the government. Not because we haven't made progress, we absolutely have, but because every governmental entity jumps lock-step to whatever outlook the current administration has. How could I have any respect for the military when I know where one conservative shift away from them not respecting me?",
                "A trans man recently killed himself at our base after being told he was being kicked out.  He already had transitioned years ago and served honorably for many years.\n\nI can’t imagine what he went through.  Giving your life for this country and then being kicked out for being who you are.  Being told you are getting kicked out of your home, career ended and everything you’ve worked for taken away ended in this result.\n\nThis is not an isolated incident at all.  It’s despicable.  The depression the other sailors, his coworkers etc are all experiencing as a result of the death of one of their own.  Nobody wanted him out or thought he shouldn’t be here.  Except this fascist dictator we are living under.",
                "Of course because \"fuck you for volunteering to die for your country\" is Trumps military slogan",
                "It would cost nothing to do nothing about it. But instead, they pay with the honor of the country.",
                " Why?  I thought discharges were in order?  Why the extra steps?",
                "Transgender people willing to put their lives at stake for a country that treats them like filth, and this is how they are repaid for their service. Funny how men who have never served a day in their life think they know what qualities a good servicemember should have.",
                "Why bother, yall already banned them from the military.",
                "Because: it’s important- nope \n\nBecause it’s cruel - yup"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US must keep control of migrants sent to South Sudan in case judge orders them back",
            "external_url": "https://apnews.com/live/donald-trump-news-updates-5-21-2025",
            "upvotes": 492,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Spoiler: They did not",
                "Trump will 100% defy this order just like he has with all the others. At this point he's basically untouchable and he knows it.",
                "Best we can do is….NOT - Trump administration",
                "LOL, have the courts not figured out that they have ceded ALL of their power?  The Judicial Branch is dead.  The Legislative Branch is on its last legs.  Republicans are not going to do anything about any of it, and Democrats are spineless pussies who can't even unify behind action.",
                "Who are they trying to fool???? It’s a one way ticket.",
                "Or what? These judges need to start bscking their demands. \n\n\nThey were not suppose to send them out to brgin with. And broke it. Why would they listen now?",
                "Uh huh. Good luck with that.",
                "Or what? What are they gonna do if they don’t?",
                "\"Must\"\n\nUm, or what?\n\nWithout consequences there may as well be no rules.",
                "Yeah, that's not going to happen. They were trafficked."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Family mourns boy killed by Israeli strike as he searched for bread",
            "external_url": "https://www.nbcnews.com/world/israel/israel-gaza-war-hamas-aid-warning-united-nations-starvation-famine-rcna208159",
            "upvotes": 1484,
            "date": "05/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250521-Ashraf-Mahmoud-death-RS-2dab85.jpg",
            "top_comments": [
                "All for bread. Such a shame. Poor little guy. RIP",
                "how soon until the thread is locked?",
                "And yet, some genocide apologist will somehow make this about Hamas. Fucking freaks.",
                "But it's a war!!! Isn't Isreal able to defend itself!!! You believe the hamas propaganda?!?!?!? DO YOU EVEN CONDEMN OCT 7TH!!!!!!!!!! \n \ndid I miss any?",
                "There was a gun in the bread and a Hamas member in the milk jug. It’s justified.",
                "[removed]",
                "I can’t believe people are still defending this by citing October 7th. As if the kidnapping of a few hundred people in any way justifies the systematic slaughter of the entire population of the Gaza Strip. Which Israel has openly stated is the end goal now, regardless of whether the hostages are released or not.\nTo even pretend this is proportionate, or any form of justice whatsoever, is unfathomably evil.",
                "They will be claiming that he was out to scout their innocent diaper force and plant bombs. Sad times we live in.",
                "Israel is killing innocents with impunity and it's sad and heartbreaking to see the same thing happen so often. Western countries are continuing to fund this nation despite seeing all this, and I have no words.",
                "There should be law against this kind of thing…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "South Carolina death row inmate seeks to volunteer to die after friends are executed",
            "external_url": "https://apnews.com/article/appeals-dropped-execution-james-robertson-south-carolina-2cc0a160af764ef99115d665ea132c22",
            "upvotes": 729,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">After his best friend and four other of his fellow [death row inmates](https://apnews.com/article/south-carolina-firing-squad-eyewitness-account-sigmon-427cccb55be58954af4434e89bcc41d8) have been put to death in less than a year, a South Carolina inmate wants to become his own attorney which would likely mean his own execution in weeks or months.\n\n>A federal judge has ordered a 45-day delay in James Robertson’s request to have a different lawyer talk to him and make sure he really wants to fire his own attorneys and deal with the likely lethal consequences of his decision.\n\n>[Robertson](https://apnews.com/general-news-0046ab50eb834c2fad3b36b55367c45b), 51, has been on death row since 1999 after killing both his parents in their Rock Hill home. He beat his father with the claw end of a hammer and a baseball bat and stabbed his mother. He tried to make it look like a robbery in hopes he would get his part of their $2.2 million estate, prosecutors said.\n\n>Robertson has fired his lawyers before. Not long after he arrived on death row he wanted to drop his appeals after a card playing buddy never appealed his death sentence for setting a van on fire with his daughter inside outside his ex-wife’s house.\n\nThe man murdered his parents and he misses his deceased death-row friends, so maybe the state should just go along with it.",
                "I don't see any real downside to granting his request. He's just speeding up the inevitable and that's his choice.",
                "Generally I am against the death penalty because it is both expensive and more importantly we have executed innocent people (and come close on several others). Once the state wrongly executes someone, we all own that.\n\nIn this instance, if he wants to speed it up and admits to his guilt or at least doesn’t fight to claim he is innocent. Let him.",
                "He needs representation to ensure the state follows the law and he is accorded his full rights. It’s not about him at this point, it’s about ensuring protection to those in state custody.",
                "This happens quite frequently (inmates trying to accelerate their process). Rarely successful.",
                "When I think of death penalty, I think that's wrong and immoral\n\nThen I read what these people have done and I'm suddenly good with it - at least in the moment.\n\nSet your van on fire with your daughter inside, outside of your ex's house.   Holy shit.\n\nThe last time I read about this, it was a woman who cut a ladies baby out of her belly and left her to die",
                "Judges don't like dealing with pro se defendants, and that is half the reason they don't like it when people waive their right to counsel. \n\nIf this guy wants to go ahead and check out, I don't see what the problem is. Are his attorneys ethically barred from pursuing the objective of hastening his execution?\n\nOr is there a material reason to believe he isn't competent to make that call, beyond the fact that our system presumes the decision to be dubious?",
                "The death penalty is barbaric in all cases.",
                "Wonder if he ends up taking the matter into his own hands",
                "He wants to die.\n\nThe best thing to do would be to commute his sentence to life without parole. \n\nThat is not only cheaper, but more intense a punishment."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "24-year-old man arrested after posing as 16-year-old high school student: Police",
            "external_url": "https://abcnews.go.com/US/24-year-man-arrested-after-posing-16-year/story?id=122004305",
            "upvotes": 1998,
            "date": "05/21/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/73597d59-db44-4d88-b8a1-89d18d9e2aba/labrador-anthony-woodcountysheriff-mf-20250520_1747771876392_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Kind of pathetic that the 24 year old has to play on the jv team. Couldnt even make the varsity roster.",
                ">He also told the school that he was a victim of human trafficking, police said.\n\nHe got setup with a caring family that helps real kids in his exact situation and went to high school like it was no big deal. \n\n>Then on May 14, the Melfreds were contacted by a woman, Evelyn Camacho, who stated that Labrador was \"actually a 24-year-old and he was the father of her child,\" police said. Camacho sent the Melfreds a picture of Labrador's driver's license with a birthdate of March 27, 2001, along with Facebook pictures of her with Labrador and a small child, police said.\n\nThat's despicable. Aside from the fraud, he ran from his baby.",
                "Well that was a wild read.",
                "But Channing Tatum and Jonah hill are allowed to do it?",
                "It's legal when Hollywood does it. Jeez double standards /s",
                "Fun fact, the movie Fast Times At Ridgemont High was based on a book written by an author who did this and then wrote a book based on his experiences.",
                "On the JV soccer team lmao",
                "Did he infiltrate the dealers? Find their supplier?",
                "I used to teach auto mechanics at a tec college years ago. \n\nWe taught highschool, college age and adult-ed all at the same time. Highschool kids didn't have to pay for the class. The way that worked is, the school would send me a list of their students to print out each day, and the kids signed next to their name each day for credit. The school would forget to add students all the time, so we would have the kids pen their name in a extra space and sign next to it. \n\nOne day a young man showed up and said he was a new student at the local highschool. I didn't have anything to do with their enrollment so I assumed he was. Over the course of two months he stripped down and rebuilt this old Cadillac he brought in. \n\nHe was a model student the entire time. \n\nHe was super polite, funny, safe and professional. He would round up other kids to get them to help him, teach them what he was doing, checked out tools the proper way, kept his workplace clean, dressed properly and signed-in every day without fail. \nHe passed every written test the first time and did everything required of him. Until he got that Cadillac running, then he and the car vanished. \n\n\nWhen I asked the school's main office if they knew anything about him, they said they had no idea who he was. Then I asked the other teacher in the program if he knew anything, he thought I signed him up.\n\nThis guy was an absolute phantom, not even the police department knew anything. I still wonder who the hell he was.",
                "How do you do, fellow kids?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Democratic Rep. Gerry Connolly of Virginia dies after battling cancer",
            "external_url": "https://www.cnbc.com/2025/05/21/gerry-connolly-dies-cancer.html",
            "upvotes": 15339,
            "date": "05/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108148616-1747830859751-gettyimages-2202899876-AA_05032025_2114621.jpeg?v=1747830892&w=1920&h=1080",
            "top_comments": [
                "75 years old. He was just a fuckin' kid",
                "You’re kidding. RIP but denying AOC this position for a man with 5 months to live is pure insanity.",
                "Upon hearing the news, Democratic leadership began feverishly drawing up plans to install him into a higher position in leadership.",
                "This is the guy they said was a better candidate than AOC, jeez",
                "Damn, I lost a friend to esophageal cancer. She was only 40. She was diagnosed a couple years ago. One day she quit her job, went into hospice, and died less than a week later.",
                "Six House Democrats have died in office in the past 13 months. Donald Payne Jr., Sheila Jackson Lee, Bill Pascrell, Sylvester Turner, Rayl Grijalva,  and now Gerry Connolly.",
                "The person the dem leaders fought tooth and nail to get the position so AOC wouldn’t be it? Just lol",
                "This just makes me more angry that they made him the ranking Dem on the oversight committee instead of AOC. Dem leadership really needs to pass the torch to the new generation who actually wants to fight, and then get the hell out of their way.",
                "I liked Connolly and thought he was a great guy.\n\nBut Democrats need to get a goddamn clue and start acting in a way that matches their rhetoric that democracy is under threat. THREE House Democrats who had cancer and ran for re election died since January while the GOP holds a razor thin majority. Every vote matters for these huge sweeping policy changes the Republicans want to make.\n\nWe keep being told “democracy is at stake, don’t criticize Democrats! Why aren’t you talking about Trump instead?” Enough. This is anti-democratic behavior to try to stifle the voices of voters and media that are raising these obvious issues of Democrats clinging to power at the price of the people they serve. \n\nIf you believe in democracy, you need to believe in challenging your own side without sputtering “But Trump!” and “both sidesism”",
                "He was actually a pretty decent Congressman, though he probably should've resigned once he got the diagnosis."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/21/2025 20:10:18 UTC"
}