{
    "posts": [
        {
            "category": "HOT",
            "title": "Pete Hegseth had an unsecured internet line set up in his office to connect to Signal, AP sources say",
            "external_url": "https://www.ctvnews.ca/world/article/pete-hegseth-had-an-unsecured-internet-line-set-up-in-his-office-to-connect-to-signal-ap-sources-say/",
            "upvotes": 27795,
            "date": "04/25/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/4YEWSMJAY45CNMAAARZCB6XHPQ.jpg?smart=true&auth=334b1defe62b2a369ef8b3cd017a963865ba09c3918db0420f3c9cfb5b8aa9d9&width=1200&height=630",
            "top_comments": [
                "“U.S. Defense Secretary Pete Hegseth had an internet connection that bypassed the Pentagon’s security protocols set up in his office to use the Signal messaging app on a personal computer, two people familiar with the line told The Associated Press.\n\nThe existence of the unsecured internet connection is the latest revelation about Hegseth’s use of the unclassified app and raises the possibility that sensitive defense information could have been put at risk of potential hacking or surveillance.”",
                "So he's just trying to hide some illegal shit at this point.",
                "What’s this fuckers obsession with signal?",
                "He has also been having a mental breakdown on television, he needs to be removed from his position as soon as possible. He is a danger to the safety of the United States. ",
                "....which synced to his phone though Bluetooth or WiFi. \n\nThe most powerful military leader -has an open internet computer, inside his office, that synced to his phone app everytime he sat down.",
                "But, Hillary’s emails..",
                "I mean, just out of curiosity, how do you get an insecure line added in the pentagon? Did they call up and have their ISP drill a new line in? I feel like someone somewhere had to say “yah we can’t really approve this”. It’s not like he dragged a cable through the building himself.",
                "Seriously can this dude be arrested or something. This is outright blatant security violations. He should be in GITMO",
                "i miss having a government made of even 50% competent upper management",
                "The Fox news party confirmed this clown, shockingly."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "Trump pardons Nevada politician who paid for her plastic surgery with funds to honor a slain officer",
            "external_url": "https://apnews.com/article/trump-pardon-michele-fiore-nevada-fraud-cf56ef8b302b8111e47cf52d5a606d19",
            "upvotes": 8528,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Fiore, who does not have a law degree, was [appointed as a judge](https://apnews.com/article/politics-las-vegas-nevada-73278936d0baa571db1174aaf275d4c2) in deep-red Nye County in 2022 shortly after she lost her campaign for state treasurer.\n\nShe was elected last June to complete the unexpired term of a judge who died but had been suspended without pay amid her legal troubles. Pahrump is an hour’s drive west of Las Vegas.\n\nIn her statement Thursday, Fiore also said she plans to return to the bench next week.\"\n\n\n\nwhy indeed",
                "At first I was like \"Why would he pardon her\".. but then..\n\n> President Donald Trump has pardoned a Nevada Republican politician who was awaiting sentencing on federal charges that she used money",
                "A scumbag pardoning a scumbag.",
                "Of course he did, he stole funds from a veteran’s charity",
                "The silence from the right speaks for itself",
                "Republicans do their thing",
                "Yup, sounds about right.",
                "We're only 4 months into this.",
                "Crime is legal. Steal from rich people. Literally just take their shit.",
                "She’s had plastic surgery and still looks like that?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Feds accidentally publish secret plan to kill NYC congestion pricing",
            "external_url": "https://gothamist.com/news/feds-accidentally-publish-secret-plan-to-kill-nyc-congestion-pricing",
            "upvotes": 36901,
            "date": "04/24/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350872/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                ">The internal 11-page letter, sent from attorneys in the Southern District of New York to a lawyer for the federal transportation department, was taken down less than an hour after it was erroneously put online.\n\nUh…you can’t put the toothpaste back in the tube.",
                "States' rights, except for those we do not like, amirite?",
                "Anyone know how to be deleted from Signal group chat, I keep getting added",
                "The one good thing about this administration is they are so unbelievably incompetent.    \n\nImagine the damage they were just as sinister AND competent.",
                "I had to double take that it didn't say congressman.",
                "I knew all about this.Someone named Pete texted me about this yesterday! I don’t know how I got on that text chain but I think the poster is pretty tipsy;)",
                "Trump's whole argument is BS.  He only cares about congestion pricing because he wants to hurt a blue state.   If Trump really thinks tolling interstate highways is illegal then what about Florida, New Jersey and Texas collecting a combined $5,000,000,000 annually in \"unfair\" tolls on interstate highways that we paid to build with tax dollars?   The Pennsylvania Turnpike was built and paid for 50 years ago and they still keep collecting those tolls.",
                "Fitting for an administration that destroys everything and accomplishes nothing.",
                "Their administration is so chaotic and unorganized that they can’t keep anything a secret it seems",
                "I'd love to say this is shockingly incompetent, but it's just par for the course at this point. Thankfully their stupidity undercuts the effectiveness of their authoritarianism a bit."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Rwandan genocide leader living in exclusive New York enclave arrested for alleged immigration violations",
            "external_url": "https://abcnews.go.com/US/rwandan-genocide-leader-living-exclusive-new-york-enclave/story?id=121129509",
            "upvotes": 7594,
            "date": "04/24/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/59336e57-c4d5-4d4b-aec4-bd40aaea3d1e/doj-seal-gty-jef-250424_1745512986238_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "That's exactly the sort of visa fraud that we want the government to look into.",
                "NYT did an [article](https://www.nytimes.com/2006/05/14/nyregion/nyregionspecial2/14libee.html) on him in 2006 without knowing who he really was",
                "He’s lived here for over two decades, financed how?",
                "Finally, the Trump admin arrests someone for immigration related fraud that deserves to be arrested and deported.",
                "*“As alleged, Nsabumukunzi repeatedly lied to conceal his involvement in the horrific Rwandan genocide while seeking to become a lawful permanent resident and citizen of the United States,” said United States Attorney John Durham.*\n\nHe's facing a 30 year sentence, which in no way matches his crimes.  He is not, in any normal sense of the word, an immigrant.",
                "Why do I get the feeling this one isn’t going to El Salvador…",
                "Looks like ICE needed some good press.",
                "While I wish his ass would go to a gulag in El Salvador’s, they should deport him back to Rwanda ",
                "Ok. I found someone to send to that mega prison in El Salvador \n\n\n\n\n(Assuming he is found guilty. Due process=good)",
                "A private equity entrepreneur paid for this guy's bond KNOWING that he was a fucking genocide leader? What the fuck?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Detention officers arrested after retired K9 found dead",
            "external_url": "https://www.kait8.com/2025/04/24/detention-officers-arrested-after-retired-k9-found-dead/",
            "upvotes": 2834,
            "date": "04/24/2025",
            "thumbnail": "https://gray-kait-prod.gtv-cdn.com/resizer/v2/GHXBEQPYIRAMBJGXFNXBUG5NF4.jpg?auth=a092eeb0f687d1cdbabc799010f306b2b3a63dac66fb81e1b40cef0f0b00022b&width=1200&height=600&smart=true",
            "top_comments": [
                "I know we shouldn’t judge a book by its cover, but JFC. They look like two guys who would be arrested for killing a dog.",
                "Oh, poor little boy. He died in his little house. Likely the only place he felt safe. Just looking for a tiny bit of love.\n\nIf I have only one wish it's for you Bane. May you live on in the eternal meadow. Where it is always the most beautiful day.",
                "The dog staved to death lovked in a outdoor kennel with no food or water. He was dead at least a week",
                "Can anyone explain how if a suspect harms a K9 while they're on duty, they get charged with all the same crimes as they would if it was a human officer but when they're retired they lose all of that status? I know it wouldn't be murder charges but couldn't they charge the people with negligent homicide of a police officer so they get more harsh sentencing or does that not apply for retirees or off duty police? Just wondering",
                "I always wonder what happens to retired police dogs. And while they are working- are they actually shown love? If they are retired, why not keep them?",
                "It takes a real special kind of awful to mistreat animals.\n\nGonna hug my little dude a little tighter tonight because I'm thankful for every day I have with him.",
                "They should be charged with killing an officer.  That's what any other civi who kills a police dog gets charged with.  Idc if he was retired.  ",
                "Between this and the post (about the scoliosis alligator) where someone mentioned a lion cub with a broken back left behind by its pack and desperately trying to crawl after them, I think I've had just about enough internet for today.",
                "I'm not sure why the k9 handler let his son have the retired k9 officer, but I hope he has some remorse over that. Going to be you being neglected next. Poor dog. Locking up animals in small places and letting them starve to death through complete neglect has got to be some red flag for absolute fucking human garbage. Throw him in the trash.",
                "They should put these two outdoors with no food, shade or water for a week."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "The trade war’s wave of retail shortages will hit U.S. consumers in stages. Here’s when",
            "external_url": "https://www.cnbc.com/2025/04/24/unsustainable-china-trade-war-retail-shortage-warnings.html",
            "upvotes": 745,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136206-1745511156804-gettyimages-1209376607-a46f3078-6d2b-11ea-a156-0048b62cdb51.jpeg?v=1745511179&w=1920&h=1080",
            "top_comments": [
                "The hording will begin soon. Expect some clown hawking whatever is in short supply on Facebook marketplace soon enough. ",
                "I work in a consumer product industry and have been warning people about this for a while, just for them to often act like I'm making it up and being hyperbolic. \n\nLook at the ports.  Pretty low traffic.",
                "Empty shelves—was that your vote? Layoffs are next in stores, ports, and container trucking.",
                "Inventory starts when a production order goes out (and those have all stopped), from there you have what is in production on the process line, then you have the factory's warehouse of orders ready to ship, then you have the inventory that is sitting on the outgoing docks, then you have the inventory that is on the ship, then you have the inventory sitting on the incoming dock, then you have the inventory that is in the regional distribution warehouse, then you have the inventory in the store.\n\nChina has nothing sitting on their outgoing dock for America & what is on the ship is the last of what is going on a ship, while the American incoming docks are already starting to get empty and Truckers are being told that they don't need to drive back to LA after they unload their trucks.\n\nThe shelves will be empty by June and the recession will be undeniable on the 4th of July.",
                "Why won't Congress just impeach him already \n I don't understand why Republicans are terrified of him? Do they have no idea what will happen if voters go hungry or can't purchase clothes due to empty shelves? Are they really that stupid to make their voters that mad? Whatever blackmail Trump has on them cannot be worse than American people rising up in revolt if people starve.",
                "Best part is that no matter what happens retail prices will be going up.",
                "\"... it is to soon to know for sure that shelves will run short of goods.\"\n\nFfs, basic spelling would be helpful,  NBC.",
                "Remember the cost of goods increase during Covid? Remember how those costs never returned to a sane level? Does anyone believe that this crisis is not being created as an excuse to increase costs long term? Even after/if sanity is restored?\n\nGreed and profit are at the center of things. As long as that is the case, this endless hunger for growth will continue. Money will be the end of us. ",
                "“… to soon…” - it is NBC 😂",
                "Well here's your free unlimited trial of the great soviet empire. You may even find out why so many of their neighbours did some wild shit to opt out. I guess you can skip a history lesson but it will not skip you."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Houthi rebels have shot down 7 US Reaper drones worth $200 million in recent weeks",
            "external_url": "https://apnews.com/article/houthis-us-warships-red-sea-e6e97a7131c48640ccf74b1916628234",
            "upvotes": 458,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In related news, Signal has leaped to the front of the smartphone top downlads list in Yemen.",
                "Meanwhile, Hegseth needs a makeup chair.",
                "Aren’t we just feeding them reaper drones at this rate",
                "I have to give up up healthcare for this?",
                "Anyone know who \"Ted Houthi\" is on the text thread? -- Pete Hegseth",
                "Probably cost them $50k or less, too. We're getting embarrassed and frankly I'm here for it since they're doing it to cut off Israel from the Red Sea shipping lanes.",
                "Did someone accidentally add them to the Signal chat?",
                "It’s impressive that they’ve managed to do that.  The Houthis are upholding international law, but their adversary in this case is the largest and most powerful military to have ever existed.  It’s unbelievable they’re having this level of success, frankly",
                "I thought the Houthis were the governing body of Yemen. How can there be Houthi rebels?",
                "What would the cost be of losing an F-35? How about two or possibly more? What would the cost be of having a naval aviator or two captured be? What would the political cost be of having a pilot paraded before the cameras of the world be? What intelligence would such captures be able to reveal? Such costs would be far greater. \n\nDrones like these are designed to take the place of manned flights. Such drones are designed to be expendable. The 200 million spent pales in comparison to what it could have cost the nation. They did their job."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Exclusive: US Justice Dept grant cuts valued at $811 million, people and records say",
            "external_url": "https://www.reuters.com/world/us/us-justice-dept-grant-cuts-valued-811-million-people-familiar-say-2025-04-24/",
            "upvotes": 1571,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So Republicans just defunded police?",
                "reduced funding for police training? yeah... that'll sure end well.",
                "New training manual by trump = shoot first question later. Class dismiss!\n\nFucking stop going to malagua definitely cut spending.",
                "And all that money funneled into Musk and the oligarchs.",
                "For my people out there who don't click links:\n\n  \n*WASHINGTON, April 24 (Reuters) - The U.S. Justice Department is terminating $811 million in grants, including some impacting victim service programs ranging from trauma centers and sign language interpretation and police training, according to internal documents and two sources.The 365 competitive grants being terminated were valued at $811 million when awarded, a total reported exclusively by Reuters. These grants are typically paid out over three years, though it remains unclear how much money was left unspent at the time of the cuts.The cuts affect awards managed by the Office of Justice Programs. As a measure of scope, the office received approval to award roughly $3 billion in total competitive grants in the 2024 fiscal year.The Justice Department declined to comment.President Donald Trump's administration is engaged in a wide-ranging campaign to slash the federal government that is taking particular aim at policies he opposes, including those that promote diversity, equity and inclusion and refugee resettlement. Accounts from federal workers and experts depict the effort as chaotic at times, with agencies in some cases laying off workers that they then need to rehire.The Justice Department told Reuters on Wednesday it was discerning in how it selected which grants to cut, with Attorney General Pam Bondi saying it would \"continue to ensure that services for victims are not impacted.\"Following a Reuters report on funding cuts to a program for pet-friendly domestic violence shelters, the department restored aid for some recipients. These included one of the only Connecticut providers accepting pets across all its shelters, along with a service provider in Maryland.\"Attorney General Bondi personally extends her appreciation to the Maryland Network Against Domestic Violence for its steadfast commitment to domestic violence survivors and the professionals who support them,\" wrote Deputy Assistant Attorney General Maureen Henneberg in an email seen by Reuters that was sent on Wednesday night to the group, rescinding the termination of the grant.A review of the cuts to grant programs from the Office for Victims of Crime shows that many provided a mix of direct and indirect assistance for domestic violence and trafficking victims.*\n\n*Activating Change, a nonprofit that supports domestic violence victims with disabilities, lost five federal grants totaling more than $2 million, said Executive Director Nancy* [*Smith.One*](http://Smith.One) *of those paid for American Sign Language interpretation services for domestic violence victims, while another trains police on how to investigate trafficking crimes against people with disabilities.Another recipient that lost funding is the Central Iowa Trauma Recovery Center, which received support from Republican Senator Charles Grassley.Other canceled grants funded programs from criminal justice research, to efforts to help reduce recidivism and support people after they are finished serving prison terms.Of the $811 million in total cuts, about $71 million comes from grants offered by the Office for Victims of Crime, according to a spreadsheet of the grants seen by Reuters.DOJ cut roughly $535 million to programs from the Bureau of Justice Assistance, which funds programs to support many local police departments and correctional facilities, the data shows.The federal agency cut about $136 million from the Office of Juvenile Justice and Delinquency Prevention, and terminated nearly $59 million in research grants funded by the National Institute of Justice.*",
                "How does this make us great?",
                "Honestly, if it means these gestapo 2.0 bastards breaking down dorm rooms to arrest pro Palestinian protesters without a warrant can do their job less efficiently, than I'm all for it.\n\nSadly it reads like they're cutting the few good things that are done by these departments.",
                "Idiotcracy at its finest",
                "Remember the first 250ish years of the country when Congress controller spending?",
                "Which is a rounding error in americas budget.  Not even a billi"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Texas creates its own DOGE in attempt to make the state more business-friendly",
            "external_url": "https://www.keranews.org/texas-news/2025-04-24/texas-creates-its-own-doge-in-attempt-to-make-the-state-more-business-friendly",
            "upvotes": 7588,
            "date": "04/24/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/055851c/2147483647/strip/true/crop/6000x3150+0+425/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F74%2F12%2F6851575a4c40bf69e5e89538cf43%2F20250219-abbott-10-1.jpg",
            "top_comments": [
                "What is it going to cut?  Republicans in Texas have been in charge of the budgetfor decades.",
                "Isn't Texas one of those states that's been controlled by republicans for decades? ",
                "Gross. Texas proving once again that it's a total shithole",
                "The irony of signing a bill for \"government efficiency\", while using dozens of different pens to hand off as souvenirs for your corporate masters",
                "Texas can't even keep their power grid functioning 🙄 cuts to spending should be the last thing on their mind",
                "So you have a federal level DOGE and a state level DOGE? That sounds like inefficiency to me, one of them will have to go.",
                "Business friendly = human miserable",
                "Is business friendly the impression they got from this? Wow",
                "If Texas gets any more business friendly, they will have slavery.",
                "So let's talk this thru, with beef as an example:\n \nThe state that produces more beef than anywhere else is going to cut regulations on businesses, giving free rein to bad actors.\n\nThey will also eliminate (I'm assuming) any current protections they have for immigrant workers, as they turn said workers over to ICE for deportation driving even legal workers out of the state. \n\nAt the same time, the FDA will no longer be performing quality checks, and will be understaffed to respond to incidents. \n\nAlso, the CDC and other health agencies have been effectively muzzled on what they can share with each other or the public.\n\n**In conclusion**: Texas is inviting cattle ranchers and slaughterhouse operators to build or expand, with little to no regulation. Cattle will be kept and fed less safely. Slaughterhouses and beef packaging plants will be understaffed. There will be no government oversight to ensure meat is not spoiled when packaged or stored unsafely. When inevitable outbreaks occur, recalls will be less likely. Then the FDA and the CDC cannot tell consumers about the danger if there is an outbreak, anyway. Widespread illness and death occur.  BUT, at least business owners and politicians made more money. And I become a vegetarian."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "HOT",
            "title": "After a scathing rebuke, judge grants DOJ an extension in deportation case",
            "external_url": "https://www.npr.org/2025/04/23/nx-s1-5373746/federal-judge-blasts-trump-stonewalling-deportation-case",
            "upvotes": 2483,
            "date": "04/24/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fae%2Fda%2F3d30708646a89f452f8371e3de32%2Fgettyimages-2210399552.jpg",
            "top_comments": [
                "To be clear, the lawyers representing Abrego Garcia *also* signed off on this pause. We don't know *what* the deal is, but the Trump administration floating something that apparently offered the possibility of resolution. We'll see what ultimately happens, but I don't think this is actually *bad* news, per se.",
                "Yeah, sounds about right. Absolutely worthless.",
                ">\"Defendants have failed to respond in good faith, and their refusal to do so can only be viewed as willful and intentional noncompliance,\" Xinis wrote.\n\n>\"That ends now,\" Judge Xinis declared as she rejected the administration's arguments so far as \"specious\" and condemned their \"mischaracterization\" of the Supreme Court's directive to facilitate Abrego Garcia's return to the U.S.\n\nJudge Xinis should have clarified, \"That ends...in another week\". What a joke.",
                "Because people are reading the headline and nothing more, she gave them a week because KILMAR'S ATTORNEYS AGREED TO IT. The government's attorneys filed something under seal, Kilmar's attorney replied to it, and then both sides agreed to push back the deadline a week.",
                "A delay for what? We have Congress people going there. We have the creepy President of El Salvador coming here. We have Trump making many statements about how he refuses to comply with the Supreme Court. Do we just not care that democracy is dying? The man that our government said was mistakenly sent there, paid for by the US to be kidnapped and jailed in that country, could be back here tonight.",
                "Soooo, “That ends now” meant…what, exactly?\n\nFor fuck sake - either just let this man turn into Hitler reincarnate or don’t. But fucking pick a lane. Let me know what I’m dealing with already. These repeated facades of holding these mother fuckers to account is exhausting and deflating. What the fuck else do they need to show you? These fascists have so little regard for the law and the constitution that they would wipe their asses with Xinis’s robe if given the chance. \n\nBut sure - go ahead and give them another week after demanding that “this ends now”.  Jesus Christ…",
                "There’s a special place in hell for Trump and his enablers.",
                "Called it. More strongly worded letters and no action. The courts have zero power anymore.",
                "DT: \"Let's just stall.\"\n\nSC: \"We don't have to make a determination and just let it float in legal limbo.\"",
                "It's not \"deportation\" if there's no due process.\n\nIt's either rendition or kidnapping."
            ],
            "aggregate_sentiment": 23.0
        },
        {
            "category": "NEW",
            "title": "Houthi rebels have shot down 7 US Reaper drones worth $200 million in recent weeks",
            "external_url": "https://apnews.com/article/houthis-us-warships-red-sea-e6e97a7131c48640ccf74b1916628234",
            "upvotes": 454,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In related news, Signal has leaped to the front of the smartphone top downlads list in Yemen.",
                "Meanwhile, Hegseth needs a makeup chair.",
                "Aren’t we just feeding them reaper drones at this rate",
                "I have to give up up healthcare for this?",
                "Anyone know who \"Ted Houthi\" is on the text thread? -- Pete Hegseth",
                "Probably cost them $50k or less, too. We're getting embarrassed and frankly I'm here for it since they're doing it to cut off Israel from the Red Sea shipping lanes.",
                "Did someone accidentally add them to the Signal chat?",
                "It’s impressive that they’ve managed to do that.  The Houthis are upholding international law, but their adversary in this case is the largest and most powerful military to have ever existed.  It’s unbelievable they’re having this level of success, frankly",
                "I thought the Houthis were the governing body of Yemen. How can there be Houthi rebels?",
                "What would the cost be of losing an F-35? How about two or possibly more? What would the cost be of having a naval aviator or two captured be? What would the political cost be of having a pilot paraded before the cameras of the world be? What intelligence would such captures be able to reveal? Such costs would be far greater. \n\nDrones like these are designed to take the place of manned flights. Such drones are designed to be expendable. The 200 million spent pales in comparison to what it could have cost the nation. They did their job."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "The trade war’s wave of retail shortages will hit U.S. consumers in stages. Here’s when",
            "external_url": "https://www.cnbc.com/2025/04/24/unsustainable-china-trade-war-retail-shortage-warnings.html",
            "upvotes": 741,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136206-1745511156804-gettyimages-1209376607-a46f3078-6d2b-11ea-a156-0048b62cdb51.jpeg?v=1745511179&w=1920&h=1080",
            "top_comments": [
                "The hording will begin soon. Expect some clown hawking whatever is in short supply on Facebook marketplace soon enough. ",
                "I work in a consumer product industry and have been warning people about this for a while, just for them to often act like I'm making it up and being hyperbolic. \n\nLook at the ports.  Pretty low traffic.",
                "Empty shelves—was that your vote? Layoffs are next in stores, ports, and container trucking.",
                "Inventory starts when a production order goes out (and those have all stopped), from there you have what is in production on the process line, then you have the factory's warehouse of orders ready to ship, then you have the inventory that is sitting on the outgoing docks, then you have the inventory that is on the ship, then you have the inventory sitting on the incoming dock, then you have the inventory that is in the regional distribution warehouse, then you have the inventory in the store.\n\nChina has nothing sitting on their outgoing dock for America & what is on the ship is the last of what is going on a ship, while the American incoming docks are already starting to get empty and Truckers are being told that they don't need to drive back to LA after they unload their trucks.\n\nThe shelves will be empty by June and the recession will be undeniable on the 4th of July.",
                "Why won't Congress just impeach him already \n I don't understand why Republicans are terrified of him? Do they have no idea what will happen if voters go hungry or can't purchase clothes due to empty shelves? Are they really that stupid to make their voters that mad? Whatever blackmail Trump has on them cannot be worse than American people rising up in revolt if people starve.",
                "Best part is that no matter what happens retail prices will be going up.",
                "\"... it is to soon to know for sure that shelves will run short of goods.\"\n\nFfs, basic spelling would be helpful,  NBC.",
                "Remember the cost of goods increase during Covid? Remember how those costs never returned to a sane level? Does anyone believe that this crisis is not being created as an excuse to increase costs long term? Even after/if sanity is restored?\n\nGreed and profit are at the center of things. As long as that is the case, this endless hunger for growth will continue. Money will be the end of us. ",
                "“… to soon…” - it is NBC 😂",
                "Well here's your free unlimited trial of the great soviet empire. You may even find out why so many of their neighbours did some wild shit to opt out. I guess you can skip a history lesson but it will not skip you."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Man Suspected of Cutting Down Multiple Trees In Los Angeles Charged with Vandalism",
            "external_url": "https://mynewsla.com/crime/2025/04/24/man-suspected-of-cutting-down-multiple-trees-charged-with-vandalism-4/",
            "upvotes": 255,
            "date": "04/25/2025",
            "thumbnail": "https://i0.wp.com/mynewsla.com/wp-content/uploads/2021/10/MNLA-Facebook.jpg?fit=640%2C360&ssl=1",
            "top_comments": [
                "I'm surprised the Harbor Freight chainsaw lasted that long. \n\nAlso, what an asshole!",
                "The tree police will absolutely fuck you, man. That's like pissing off the postal police, or Disney's lawyers",
                "Since the Lorax is probably asleep. Fuck that guy.",
                "How do they know exactly how many trees he cut down? He must have kept a log.",
                "I'm stumped as to why the jerk did this.",
                "Two years ago the major studios cut down several blocks worth of trees where protestors were gathering, and the city didn’t bat an eye.",
                "Use wood from the trees he cut down and fashion a mobile pillory.  Sentence to be on display for a week at the site of every tree he cut down and then serve his jail time."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Tensions escalate between India and Pakistan following attack in disputed Kashmir",
            "external_url": "https://abcnews.go.com/International/wireStory/tensions-escalate-india-pakistan-deadly-attack-disputed-kashmir-121114021",
            "upvotes": 162,
            "date": "04/25/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/715ee881-98ee-453c-9a18-3aa855f979bc/wirestory_242c7a600a51793f5484e4f620402fdd_16x9.jpg?w=1600",
            "top_comments": [
                "Allegedly, it was a nuclear exchange between India & Pakistan that Obama said was one of the issues that worried him the most.",
                "Maybe Trump can bring Peace here too since he’s doing such a good job on Ukraine & the economy.",
                "One way to ensure you lose or at the very least lose lots of steam in the battle for hearts and minds is to start murdering civilians.",
                "Imagine this headline if terrorists ever targeted Muslims based on religion?\n\n“Islamophobia strikes again. Terrorists gun down Muslim civilians”",
                "Before Trump leaves, WWIII will be well under way."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Trump pardons Nevada politician who paid for her plastic surgery with funds to honor a slain officer",
            "external_url": "https://apnews.com/article/trump-pardon-michele-fiore-nevada-fraud-cf56ef8b302b8111e47cf52d5a606d19",
            "upvotes": 8526,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Fiore, who does not have a law degree, was [appointed as a judge](https://apnews.com/article/politics-las-vegas-nevada-73278936d0baa571db1174aaf275d4c2) in deep-red Nye County in 2022 shortly after she lost her campaign for state treasurer.\n\nShe was elected last June to complete the unexpired term of a judge who died but had been suspended without pay amid her legal troubles. Pahrump is an hour’s drive west of Las Vegas.\n\nIn her statement Thursday, Fiore also said she plans to return to the bench next week.\"\n\n\n\nwhy indeed",
                "At first I was like \"Why would he pardon her\".. but then..\n\n> President Donald Trump has pardoned a Nevada Republican politician who was awaiting sentencing on federal charges that she used money",
                "A scumbag pardoning a scumbag.",
                "Of course he did, he stole funds from a veteran’s charity",
                "The silence from the right speaks for itself",
                "Republicans do their thing",
                "Yup, sounds about right.",
                "We're only 4 months into this.",
                "Crime is legal. Steal from rich people. Literally just take their shit.",
                "She’s had plastic surgery and still looks like that?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Pete Hegseth had an unsecured internet line set up in his office to connect to Signal, AP sources say",
            "external_url": "https://www.ctvnews.ca/world/article/pete-hegseth-had-an-unsecured-internet-line-set-up-in-his-office-to-connect-to-signal-ap-sources-say/",
            "upvotes": 27802,
            "date": "04/25/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/4YEWSMJAY45CNMAAARZCB6XHPQ.jpg?smart=true&auth=334b1defe62b2a369ef8b3cd017a963865ba09c3918db0420f3c9cfb5b8aa9d9&width=1200&height=630",
            "top_comments": [
                "“U.S. Defense Secretary Pete Hegseth had an internet connection that bypassed the Pentagon’s security protocols set up in his office to use the Signal messaging app on a personal computer, two people familiar with the line told The Associated Press.\n\nThe existence of the unsecured internet connection is the latest revelation about Hegseth’s use of the unclassified app and raises the possibility that sensitive defense information could have been put at risk of potential hacking or surveillance.”",
                "So he's just trying to hide some illegal shit at this point.",
                "What’s this fuckers obsession with signal?",
                "He has also been having a mental breakdown on television, he needs to be removed from his position as soon as possible. He is a danger to the safety of the United States. ",
                "....which synced to his phone though Bluetooth or WiFi. \n\nThe most powerful military leader -has an open internet computer, inside his office, that synced to his phone app everytime he sat down.",
                "But, Hillary’s emails..",
                "I mean, just out of curiosity, how do you get an insecure line added in the pentagon? Did they call up and have their ISP drill a new line in? I feel like someone somewhere had to say “yah we can’t really approve this”. It’s not like he dragged a cable through the building himself.",
                "Seriously can this dude be arrested or something. This is outright blatant security violations. He should be in GITMO",
                "i miss having a government made of even 50% competent upper management",
                "The Fox news party confirmed this clown, shockingly."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Detention officers arrested after retired K9 found dead",
            "external_url": "https://www.kait8.com/2025/04/24/detention-officers-arrested-after-retired-k9-found-dead/",
            "upvotes": 2832,
            "date": "04/24/2025",
            "thumbnail": "https://gray-kait-prod.gtv-cdn.com/resizer/v2/GHXBEQPYIRAMBJGXFNXBUG5NF4.jpg?auth=a092eeb0f687d1cdbabc799010f306b2b3a63dac66fb81e1b40cef0f0b00022b&width=1200&height=600&smart=true",
            "top_comments": [
                "I know we shouldn’t judge a book by its cover, but JFC. They look like two guys who would be arrested for killing a dog.",
                "Oh, poor little boy. He died in his little house. Likely the only place he felt safe. Just looking for a tiny bit of love.\n\nIf I have only one wish it's for you Bane. May you live on in the eternal meadow. Where it is always the most beautiful day.",
                "The dog staved to death lovked in a outdoor kennel with no food or water. He was dead at least a week",
                "Can anyone explain how if a suspect harms a K9 while they're on duty, they get charged with all the same crimes as they would if it was a human officer but when they're retired they lose all of that status? I know it wouldn't be murder charges but couldn't they charge the people with negligent homicide of a police officer so they get more harsh sentencing or does that not apply for retirees or off duty police? Just wondering",
                "I always wonder what happens to retired police dogs. And while they are working- are they actually shown love? If they are retired, why not keep them?",
                "It takes a real special kind of awful to mistreat animals.\n\nGonna hug my little dude a little tighter tonight because I'm thankful for every day I have with him.",
                "They should be charged with killing an officer.  That's what any other civi who kills a police dog gets charged with.  Idc if he was retired.  ",
                "Between this and the post (about the scoliosis alligator) where someone mentioned a lion cub with a broken back left behind by its pack and desperately trying to crawl after them, I think I've had just about enough internet for today.",
                "I'm not sure why the k9 handler let his son have the retired k9 officer, but I hope he has some remorse over that. Going to be you being neglected next. Poor dog. Locking up animals in small places and letting them starve to death through complete neglect has got to be some red flag for absolute fucking human garbage. Throw him in the trash.",
                "They should put these two outdoors with no food, shade or water for a week."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Exclusive: US Justice Dept grant cuts valued at $811 million, people and records say",
            "external_url": "https://www.reuters.com/world/us/us-justice-dept-grant-cuts-valued-811-million-people-familiar-say-2025-04-24/",
            "upvotes": 1566,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So Republicans just defunded police?",
                "reduced funding for police training? yeah... that'll sure end well.",
                "New training manual by trump = shoot first question later. Class dismiss!\n\nFucking stop going to malagua definitely cut spending.",
                "And all that money funneled into Musk and the oligarchs.",
                "For my people out there who don't click links:\n\n  \n*WASHINGTON, April 24 (Reuters) - The U.S. Justice Department is terminating $811 million in grants, including some impacting victim service programs ranging from trauma centers and sign language interpretation and police training, according to internal documents and two sources.The 365 competitive grants being terminated were valued at $811 million when awarded, a total reported exclusively by Reuters. These grants are typically paid out over three years, though it remains unclear how much money was left unspent at the time of the cuts.The cuts affect awards managed by the Office of Justice Programs. As a measure of scope, the office received approval to award roughly $3 billion in total competitive grants in the 2024 fiscal year.The Justice Department declined to comment.President Donald Trump's administration is engaged in a wide-ranging campaign to slash the federal government that is taking particular aim at policies he opposes, including those that promote diversity, equity and inclusion and refugee resettlement. Accounts from federal workers and experts depict the effort as chaotic at times, with agencies in some cases laying off workers that they then need to rehire.The Justice Department told Reuters on Wednesday it was discerning in how it selected which grants to cut, with Attorney General Pam Bondi saying it would \"continue to ensure that services for victims are not impacted.\"Following a Reuters report on funding cuts to a program for pet-friendly domestic violence shelters, the department restored aid for some recipients. These included one of the only Connecticut providers accepting pets across all its shelters, along with a service provider in Maryland.\"Attorney General Bondi personally extends her appreciation to the Maryland Network Against Domestic Violence for its steadfast commitment to domestic violence survivors and the professionals who support them,\" wrote Deputy Assistant Attorney General Maureen Henneberg in an email seen by Reuters that was sent on Wednesday night to the group, rescinding the termination of the grant.A review of the cuts to grant programs from the Office for Victims of Crime shows that many provided a mix of direct and indirect assistance for domestic violence and trafficking victims.*\n\n*Activating Change, a nonprofit that supports domestic violence victims with disabilities, lost five federal grants totaling more than $2 million, said Executive Director Nancy* [*Smith.One*](http://Smith.One) *of those paid for American Sign Language interpretation services for domestic violence victims, while another trains police on how to investigate trafficking crimes against people with disabilities.Another recipient that lost funding is the Central Iowa Trauma Recovery Center, which received support from Republican Senator Charles Grassley.Other canceled grants funded programs from criminal justice research, to efforts to help reduce recidivism and support people after they are finished serving prison terms.Of the $811 million in total cuts, about $71 million comes from grants offered by the Office for Victims of Crime, according to a spreadsheet of the grants seen by Reuters.DOJ cut roughly $535 million to programs from the Bureau of Justice Assistance, which funds programs to support many local police departments and correctional facilities, the data shows.The federal agency cut about $136 million from the Office of Juvenile Justice and Delinquency Prevention, and terminated nearly $59 million in research grants funded by the National Institute of Justice.*",
                "How does this make us great?",
                "Honestly, if it means these gestapo 2.0 bastards breaking down dorm rooms to arrest pro Palestinian protesters without a warrant can do their job less efficiently, than I'm all for it.\n\nSadly it reads like they're cutting the few good things that are done by these departments.",
                "Idiotcracy at its finest",
                "Remember the first 250ish years of the country when Congress controller spending?",
                "Which is a rounding error in americas budget.  Not even a billi"
            ],
            "aggregate_sentiment": 23.0
        },
        {
            "category": "NEW",
            "title": "Rwandan genocide leader living in exclusive New York enclave arrested for alleged immigration violations",
            "external_url": "https://abcnews.go.com/US/rwandan-genocide-leader-living-exclusive-new-york-enclave/story?id=121129509",
            "upvotes": 7585,
            "date": "04/24/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/59336e57-c4d5-4d4b-aec4-bd40aaea3d1e/doj-seal-gty-jef-250424_1745512986238_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "That's exactly the sort of visa fraud that we want the government to look into.",
                "NYT did an [article](https://www.nytimes.com/2006/05/14/nyregion/nyregionspecial2/14libee.html) on him in 2006 without knowing who he really was",
                "He’s lived here for over two decades, financed how?",
                "Finally, the Trump admin arrests someone for immigration related fraud that deserves to be arrested and deported.",
                "*“As alleged, Nsabumukunzi repeatedly lied to conceal his involvement in the horrific Rwandan genocide while seeking to become a lawful permanent resident and citizen of the United States,” said United States Attorney John Durham.*\n\nHe's facing a 30 year sentence, which in no way matches his crimes.  He is not, in any normal sense of the word, an immigrant.",
                "Why do I get the feeling this one isn’t going to El Salvador…",
                "Looks like ICE needed some good press.",
                "While I wish his ass would go to a gulag in El Salvador’s, they should deport him back to Rwanda ",
                "Ok. I found someone to send to that mega prison in El Salvador \n\n\n\n\n(Assuming he is found guilty. Due process=good)",
                "A private equity entrepreneur paid for this guy's bond KNOWING that he was a fucking genocide leader? What the fuck?"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Feds accidentally publish secret plan to kill NYC congestion pricing",
            "external_url": "https://gothamist.com/news/feds-accidentally-publish-secret-plan-to-kill-nyc-congestion-pricing",
            "upvotes": 36902,
            "date": "04/24/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350872/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                ">The internal 11-page letter, sent from attorneys in the Southern District of New York to a lawyer for the federal transportation department, was taken down less than an hour after it was erroneously put online.\n\nUh…you can’t put the toothpaste back in the tube.",
                "States' rights, except for those we do not like, amirite?",
                "Anyone know how to be deleted from Signal group chat, I keep getting added",
                "The one good thing about this administration is they are so unbelievably incompetent.    \n\nImagine the damage they were just as sinister AND competent.",
                "I had to double take that it didn't say congressman.",
                "I knew all about this.Someone named Pete texted me about this yesterday! I don’t know how I got on that text chain but I think the poster is pretty tipsy;)",
                "Trump's whole argument is BS.  He only cares about congestion pricing because he wants to hurt a blue state.   If Trump really thinks tolling interstate highways is illegal then what about Florida, New Jersey and Texas collecting a combined $5,000,000,000 annually in \"unfair\" tolls on interstate highways that we paid to build with tax dollars?   The Pennsylvania Turnpike was built and paid for 50 years ago and they still keep collecting those tolls.",
                "Fitting for an administration that destroys everything and accomplishes nothing.",
                "Their administration is so chaotic and unorganized that they can’t keep anything a secret it seems",
                "I'd love to say this is shockingly incompetent, but it's just par for the course at this point. Thankfully their stupidity undercuts the effectiveness of their authoritarianism a bit."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Houthi rebels have shot down 7 US Reaper drones worth $200 million in recent weeks",
            "external_url": "https://apnews.com/article/houthis-us-warships-red-sea-e6e97a7131c48640ccf74b1916628234",
            "upvotes": 453,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In related news, Signal has leaped to the front of the smartphone top downlads list in Yemen.",
                "Meanwhile, Hegseth needs a makeup chair.",
                "Aren’t we just feeding them reaper drones at this rate",
                "I have to give up up healthcare for this?",
                "Anyone know who \"Ted Houthi\" is on the text thread? -- Pete Hegseth",
                "Probably cost them $50k or less, too. We're getting embarrassed and frankly I'm here for it since they're doing it to cut off Israel from the Red Sea shipping lanes.",
                "Did someone accidentally add them to the Signal chat?",
                "It’s impressive that they’ve managed to do that.  The Houthis are upholding international law, but their adversary in this case is the largest and most powerful military to have ever existed.  It’s unbelievable they’re having this level of success, frankly",
                "I thought the Houthis were the governing body of Yemen. How can there be Houthi rebels?",
                "What would the cost be of losing an F-35? How about two or possibly more? What would the cost be of having a naval aviator or two captured be? What would the political cost be of having a pilot paraded before the cameras of the world be? What intelligence would such captures be able to reveal? Such costs would be far greater. \n\nDrones like these are designed to take the place of manned flights. Such drones are designed to be expendable. The 200 million spent pales in comparison to what it could have cost the nation. They did their job."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "The trade war’s wave of retail shortages will hit U.S. consumers in stages. Here’s when",
            "external_url": "https://www.cnbc.com/2025/04/24/unsustainable-china-trade-war-retail-shortage-warnings.html",
            "upvotes": 740,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136206-1745511156804-gettyimages-1209376607-a46f3078-6d2b-11ea-a156-0048b62cdb51.jpeg?v=1745511179&w=1920&h=1080",
            "top_comments": [
                "The hording will begin soon. Expect some clown hawking whatever is in short supply on Facebook marketplace soon enough. ",
                "I work in a consumer product industry and have been warning people about this for a while, just for them to often act like I'm making it up and being hyperbolic. \n\nLook at the ports.  Pretty low traffic.",
                "Empty shelves—was that your vote? Layoffs are next in stores, ports, and container trucking.",
                "Inventory starts when a production order goes out (and those have all stopped), from there you have what is in production on the process line, then you have the factory's warehouse of orders ready to ship, then you have the inventory that is sitting on the outgoing docks, then you have the inventory that is on the ship, then you have the inventory sitting on the incoming dock, then you have the inventory that is in the regional distribution warehouse, then you have the inventory in the store.\n\nChina has nothing sitting on their outgoing dock for America & what is on the ship is the last of what is going on a ship, while the American incoming docks are already starting to get empty and Truckers are being told that they don't need to drive back to LA after they unload their trucks.\n\nThe shelves will be empty by June and the recession will be undeniable on the 4th of July.",
                "Why won't Congress just impeach him already \n I don't understand why Republicans are terrified of him? Do they have no idea what will happen if voters go hungry or can't purchase clothes due to empty shelves? Are they really that stupid to make their voters that mad? Whatever blackmail Trump has on them cannot be worse than American people rising up in revolt if people starve.",
                "Best part is that no matter what happens retail prices will be going up.",
                "\"... it is to soon to know for sure that shelves will run short of goods.\"\n\nFfs, basic spelling would be helpful,  NBC.",
                "Remember the cost of goods increase during Covid? Remember how those costs never returned to a sane level? Does anyone believe that this crisis is not being created as an excuse to increase costs long term? Even after/if sanity is restored?\n\nGreed and profit are at the center of things. As long as that is the case, this endless hunger for growth will continue. Money will be the end of us. ",
                "“… to soon…” - it is NBC 😂",
                "Well here's your free unlimited trial of the great soviet empire. You may even find out why so many of their neighbours did some wild shit to opt out. I guess you can skip a history lesson but it will not skip you."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Trump pardons Nevada politician who paid for her plastic surgery with funds to honor a slain officer",
            "external_url": "https://apnews.com/article/trump-pardon-michele-fiore-nevada-fraud-cf56ef8b302b8111e47cf52d5a606d19",
            "upvotes": 8538,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Fiore, who does not have a law degree, was [appointed as a judge](https://apnews.com/article/politics-las-vegas-nevada-73278936d0baa571db1174aaf275d4c2) in deep-red Nye County in 2022 shortly after she lost her campaign for state treasurer.\n\nShe was elected last June to complete the unexpired term of a judge who died but had been suspended without pay amid her legal troubles. Pahrump is an hour’s drive west of Las Vegas.\n\nIn her statement Thursday, Fiore also said she plans to return to the bench next week.\"\n\n\n\nwhy indeed",
                "At first I was like \"Why would he pardon her\".. but then..\n\n> President Donald Trump has pardoned a Nevada Republican politician who was awaiting sentencing on federal charges that she used money",
                "A scumbag pardoning a scumbag.",
                "Of course he did, he stole funds from a veteran’s charity",
                "The silence from the right speaks for itself",
                "Republicans do their thing",
                "Yup, sounds about right.",
                "We're only 4 months into this.",
                "Crime is legal. Steal from rich people. Literally just take their shit.",
                "She’s had plastic surgery and still looks like that?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Man Suspected of Cutting Down Multiple Trees In Los Angeles Charged with Vandalism",
            "external_url": "https://mynewsla.com/crime/2025/04/24/man-suspected-of-cutting-down-multiple-trees-charged-with-vandalism-4/",
            "upvotes": 257,
            "date": "04/25/2025",
            "thumbnail": "https://i0.wp.com/mynewsla.com/wp-content/uploads/2021/10/MNLA-Facebook.jpg?fit=640%2C360&ssl=1",
            "top_comments": [
                "I'm surprised the Harbor Freight chainsaw lasted that long. \n\nAlso, what an asshole!",
                "The tree police will absolutely fuck you, man. That's like pissing off the postal police, or Disney's lawyers",
                "Since the Lorax is probably asleep. Fuck that guy.",
                "How do they know exactly how many trees he cut down? He must have kept a log.",
                "I'm stumped as to why the jerk did this.",
                "Two years ago the major studios cut down several blocks worth of trees where protestors were gathering, and the city didn’t bat an eye.",
                "Use wood from the trees he cut down and fashion a mobile pillory.  Sentence to be on display for a week at the site of every tree he cut down and then serve his jail time."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Pete Hegseth had an unsecured internet line set up in his office to connect to Signal, AP sources say",
            "external_url": "https://www.ctvnews.ca/world/article/pete-hegseth-had-an-unsecured-internet-line-set-up-in-his-office-to-connect-to-signal-ap-sources-say/",
            "upvotes": 27803,
            "date": "04/25/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/4YEWSMJAY45CNMAAARZCB6XHPQ.jpg?smart=true&auth=334b1defe62b2a369ef8b3cd017a963865ba09c3918db0420f3c9cfb5b8aa9d9&width=1200&height=630",
            "top_comments": [
                "“U.S. Defense Secretary Pete Hegseth had an internet connection that bypassed the Pentagon’s security protocols set up in his office to use the Signal messaging app on a personal computer, two people familiar with the line told The Associated Press.\n\nThe existence of the unsecured internet connection is the latest revelation about Hegseth’s use of the unclassified app and raises the possibility that sensitive defense information could have been put at risk of potential hacking or surveillance.”",
                "So he's just trying to hide some illegal shit at this point.",
                "What’s this fuckers obsession with signal?",
                "He has also been having a mental breakdown on television, he needs to be removed from his position as soon as possible. He is a danger to the safety of the United States. ",
                "....which synced to his phone though Bluetooth or WiFi. \n\nThe most powerful military leader -has an open internet computer, inside his office, that synced to his phone app everytime he sat down.",
                "But, Hillary’s emails..",
                "I mean, just out of curiosity, how do you get an insecure line added in the pentagon? Did they call up and have their ISP drill a new line in? I feel like someone somewhere had to say “yah we can’t really approve this”. It’s not like he dragged a cable through the building himself.",
                "Seriously can this dude be arrested or something. This is outright blatant security violations. He should be in GITMO",
                "i miss having a government made of even 50% competent upper management",
                "The Fox news party confirmed this clown, shockingly."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Detention officers arrested after retired K9 found dead",
            "external_url": "https://www.kait8.com/2025/04/24/detention-officers-arrested-after-retired-k9-found-dead/",
            "upvotes": 2839,
            "date": "04/24/2025",
            "thumbnail": "https://gray-kait-prod.gtv-cdn.com/resizer/v2/GHXBEQPYIRAMBJGXFNXBUG5NF4.jpg?auth=a092eeb0f687d1cdbabc799010f306b2b3a63dac66fb81e1b40cef0f0b00022b&width=1200&height=600&smart=true",
            "top_comments": [
                "I know we shouldn’t judge a book by its cover, but JFC. They look like two guys who would be arrested for killing a dog.",
                "Oh, poor little boy. He died in his little house. Likely the only place he felt safe. Just looking for a tiny bit of love.\n\nIf I have only one wish it's for you Bane. May you live on in the eternal meadow. Where it is always the most beautiful day.",
                "The dog staved to death lovked in a outdoor kennel with no food or water. He was dead at least a week",
                "Can anyone explain how if a suspect harms a K9 while they're on duty, they get charged with all the same crimes as they would if it was a human officer but when they're retired they lose all of that status? I know it wouldn't be murder charges but couldn't they charge the people with negligent homicide of a police officer so they get more harsh sentencing or does that not apply for retirees or off duty police? Just wondering",
                "I always wonder what happens to retired police dogs. And while they are working- are they actually shown love? If they are retired, why not keep them?",
                "It takes a real special kind of awful to mistreat animals.\n\nGonna hug my little dude a little tighter tonight because I'm thankful for every day I have with him.",
                "They should be charged with killing an officer.  That's what any other civi who kills a police dog gets charged with.  Idc if he was retired.  ",
                "Between this and the post (about the scoliosis alligator) where someone mentioned a lion cub with a broken back left behind by its pack and desperately trying to crawl after them, I think I've had just about enough internet for today.",
                "I'm not sure why the k9 handler let his son have the retired k9 officer, but I hope he has some remorse over that. Going to be you being neglected next. Poor dog. Locking up animals in small places and letting them starve to death through complete neglect has got to be some red flag for absolute fucking human garbage. Throw him in the trash.",
                "They should put these two outdoors with no food, shade or water for a week."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Exclusive: US Justice Dept grant cuts valued at $811 million, people and records say",
            "external_url": "https://www.reuters.com/world/us/us-justice-dept-grant-cuts-valued-811-million-people-familiar-say-2025-04-24/",
            "upvotes": 1570,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So Republicans just defunded police?",
                "reduced funding for police training? yeah... that'll sure end well.",
                "New training manual by trump = shoot first question later. Class dismiss!\n\nFucking stop going to malagua definitely cut spending.",
                "And all that money funneled into Musk and the oligarchs.",
                "For my people out there who don't click links:\n\n  \n*WASHINGTON, April 24 (Reuters) - The U.S. Justice Department is terminating $811 million in grants, including some impacting victim service programs ranging from trauma centers and sign language interpretation and police training, according to internal documents and two sources.The 365 competitive grants being terminated were valued at $811 million when awarded, a total reported exclusively by Reuters. These grants are typically paid out over three years, though it remains unclear how much money was left unspent at the time of the cuts.The cuts affect awards managed by the Office of Justice Programs. As a measure of scope, the office received approval to award roughly $3 billion in total competitive grants in the 2024 fiscal year.The Justice Department declined to comment.President Donald Trump's administration is engaged in a wide-ranging campaign to slash the federal government that is taking particular aim at policies he opposes, including those that promote diversity, equity and inclusion and refugee resettlement. Accounts from federal workers and experts depict the effort as chaotic at times, with agencies in some cases laying off workers that they then need to rehire.The Justice Department told Reuters on Wednesday it was discerning in how it selected which grants to cut, with Attorney General Pam Bondi saying it would \"continue to ensure that services for victims are not impacted.\"Following a Reuters report on funding cuts to a program for pet-friendly domestic violence shelters, the department restored aid for some recipients. These included one of the only Connecticut providers accepting pets across all its shelters, along with a service provider in Maryland.\"Attorney General Bondi personally extends her appreciation to the Maryland Network Against Domestic Violence for its steadfast commitment to domestic violence survivors and the professionals who support them,\" wrote Deputy Assistant Attorney General Maureen Henneberg in an email seen by Reuters that was sent on Wednesday night to the group, rescinding the termination of the grant.A review of the cuts to grant programs from the Office for Victims of Crime shows that many provided a mix of direct and indirect assistance for domestic violence and trafficking victims.*\n\n*Activating Change, a nonprofit that supports domestic violence victims with disabilities, lost five federal grants totaling more than $2 million, said Executive Director Nancy* [*Smith.One*](http://Smith.One) *of those paid for American Sign Language interpretation services for domestic violence victims, while another trains police on how to investigate trafficking crimes against people with disabilities.Another recipient that lost funding is the Central Iowa Trauma Recovery Center, which received support from Republican Senator Charles Grassley.Other canceled grants funded programs from criminal justice research, to efforts to help reduce recidivism and support people after they are finished serving prison terms.Of the $811 million in total cuts, about $71 million comes from grants offered by the Office for Victims of Crime, according to a spreadsheet of the grants seen by Reuters.DOJ cut roughly $535 million to programs from the Bureau of Justice Assistance, which funds programs to support many local police departments and correctional facilities, the data shows.The federal agency cut about $136 million from the Office of Juvenile Justice and Delinquency Prevention, and terminated nearly $59 million in research grants funded by the National Institute of Justice.*",
                "How does this make us great?",
                "Honestly, if it means these gestapo 2.0 bastards breaking down dorm rooms to arrest pro Palestinian protesters without a warrant can do their job less efficiently, than I'm all for it.\n\nSadly it reads like they're cutting the few good things that are done by these departments.",
                "Idiotcracy at its finest",
                "Remember the first 250ish years of the country when Congress controller spending?",
                "Which is a rounding error in americas budget.  Not even a billi"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Rwandan genocide leader living in exclusive New York enclave arrested for alleged immigration violations",
            "external_url": "https://abcnews.go.com/US/rwandan-genocide-leader-living-exclusive-new-york-enclave/story?id=121129509",
            "upvotes": 7595,
            "date": "04/24/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/59336e57-c4d5-4d4b-aec4-bd40aaea3d1e/doj-seal-gty-jef-250424_1745512986238_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "That's exactly the sort of visa fraud that we want the government to look into.",
                "NYT did an [article](https://www.nytimes.com/2006/05/14/nyregion/nyregionspecial2/14libee.html) on him in 2006 without knowing who he really was",
                "He’s lived here for over two decades, financed how?",
                "Finally, the Trump admin arrests someone for immigration related fraud that deserves to be arrested and deported.",
                "*“As alleged, Nsabumukunzi repeatedly lied to conceal his involvement in the horrific Rwandan genocide while seeking to become a lawful permanent resident and citizen of the United States,” said United States Attorney John Durham.*\n\nHe's facing a 30 year sentence, which in no way matches his crimes.  He is not, in any normal sense of the word, an immigrant.",
                "Why do I get the feeling this one isn’t going to El Salvador…",
                "Looks like ICE needed some good press.",
                "While I wish his ass would go to a gulag in El Salvador’s, they should deport him back to Rwanda ",
                "Ok. I found someone to send to that mega prison in El Salvador \n\n\n\n\n(Assuming he is found guilty. Due process=good)",
                "A private equity entrepreneur paid for this guy's bond KNOWING that he was a fucking genocide leader? What the fuck?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Feds accidentally publish secret plan to kill NYC congestion pricing",
            "external_url": "https://gothamist.com/news/feds-accidentally-publish-secret-plan-to-kill-nyc-congestion-pricing",
            "upvotes": 36897,
            "date": "04/24/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350872/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                ">The internal 11-page letter, sent from attorneys in the Southern District of New York to a lawyer for the federal transportation department, was taken down less than an hour after it was erroneously put online.\n\nUh…you can’t put the toothpaste back in the tube.",
                "States' rights, except for those we do not like, amirite?",
                "Anyone know how to be deleted from Signal group chat, I keep getting added",
                "The one good thing about this administration is they are so unbelievably incompetent.    \n\nImagine the damage they were just as sinister AND competent.",
                "I had to double take that it didn't say congressman.",
                "I knew all about this.Someone named Pete texted me about this yesterday! I don’t know how I got on that text chain but I think the poster is pretty tipsy;)",
                "Trump's whole argument is BS.  He only cares about congestion pricing because he wants to hurt a blue state.   If Trump really thinks tolling interstate highways is illegal then what about Florida, New Jersey and Texas collecting a combined $5,000,000,000 annually in \"unfair\" tolls on interstate highways that we paid to build with tax dollars?   The Pennsylvania Turnpike was built and paid for 50 years ago and they still keep collecting those tolls.",
                "Fitting for an administration that destroys everything and accomplishes nothing.",
                "Their administration is so chaotic and unorganized that they can’t keep anything a secret it seems",
                "I'd love to say this is shockingly incompetent, but it's just par for the course at this point. Thankfully their stupidity undercuts the effectiveness of their authoritarianism a bit."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Texas creates its own DOGE in attempt to make the state more business-friendly",
            "external_url": "https://www.keranews.org/texas-news/2025-04-24/texas-creates-its-own-doge-in-attempt-to-make-the-state-more-business-friendly",
            "upvotes": 7581,
            "date": "04/24/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/055851c/2147483647/strip/true/crop/6000x3150+0+425/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F74%2F12%2F6851575a4c40bf69e5e89538cf43%2F20250219-abbott-10-1.jpg",
            "top_comments": [
                "What is it going to cut?  Republicans in Texas have been in charge of the budgetfor decades.",
                "Isn't Texas one of those states that's been controlled by republicans for decades? ",
                "Gross. Texas proving once again that it's a total shithole",
                "The irony of signing a bill for \"government efficiency\", while using dozens of different pens to hand off as souvenirs for your corporate masters",
                "Texas can't even keep their power grid functioning 🙄 cuts to spending should be the last thing on their mind",
                "So you have a federal level DOGE and a state level DOGE? That sounds like inefficiency to me, one of them will have to go.",
                "Business friendly = human miserable",
                "Is business friendly the impression they got from this? Wow",
                "If Texas gets any more business friendly, they will have slavery.",
                "So let's talk this thru, with beef as an example:\n \nThe state that produces more beef than anywhere else is going to cut regulations on businesses, giving free rein to bad actors.\n\nThey will also eliminate (I'm assuming) any current protections they have for immigrant workers, as they turn said workers over to ICE for deportation driving even legal workers out of the state. \n\nAt the same time, the FDA will no longer be performing quality checks, and will be understaffed to respond to incidents. \n\nAlso, the CDC and other health agencies have been effectively muzzled on what they can share with each other or the public.\n\n**In conclusion**: Texas is inviting cattle ranchers and slaughterhouse operators to build or expand, with little to no regulation. Cattle will be kept and fed less safely. Slaughterhouses and beef packaging plants will be understaffed. There will be no government oversight to ensure meat is not spoiled when packaged or stored unsafely. When inevitable outbreaks occur, recalls will be less likely. Then the FDA and the CDC cannot tell consumers about the danger if there is an outbreak, anyway. Widespread illness and death occur.  BUT, at least business owners and politicians made more money. And I become a vegetarian."
            ],
            "aggregate_sentiment": 38.0
        }
    ],
    "last_updated": "04/25/2025 08:12:59 UTC"
}