{
    "posts": [
        {
            "category": "HOT",
            "title": "Elon Musk sued by Wisconsin attorney general ahead of state election - CBS Minnesota",
            "external_url": "https://www.cbsnews.com/minnesota/video/elon-musk-sued-by-wisconsin-attorney-general-ahead-of-state-election/",
            "upvotes": 37092,
            "date": "03/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/28/01229e65-5150-49fb-8057-a3d617b2fb1f/thumbnail/1200x630/91d35c20019f4f05ab89122be4e65360/637e56ce8c7202049f60fb0500b8f966.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "In another article\n\n> Wisconsin Attorney General Josh Kaul sued Musk in state court, seeking to temporarily restrain Musk from further promoting his promise to give away two $1 million checks or making any further payments to Wisconsin voters. Wisconsin law prohibits offering anything of value to an elector in order to induce their voting behavior, Kaul said in the Dane County Circuit Court lawsuit.\n“The Wisconsin Department of Justice is committed to ensuring that elections in Wisconsin are safe, secure, free, and fair,” Kaul said in a statement on X.\n\nLike holy cow can someone please charge this man with election interference.",
                "Cool. Now, convict and JAIL THIS MOTHERFUCKER.",
                "This is exactly why billionaires shouldn't exist. There is nothing respectable or admirable about this, there is no advanced strategy or genius-level 4D Chess, absolutely no hard work is going into any of these victories, they are simply throwing money at the problem like always and it always works for them cause they keep us destitute.",
                "Remember what life was like before this piece of shit was front and center in the news every fucking day? That was nice.",
                "Unfortunately we’ve already seen the ultra wealthy can’t be held accountable because they can just delay delay delay forever.\n\nGood luck to them either way.",
                "I don't understand why we're \"suing\" people for committing felonies. What happened to arresting them?",
                "Just like the lawsuit in Pennsylvania that went nowhere? When are people going to realize our institutions are being assaulted by Musk and MAGA. The US is in a state of constitutional and national security crisis.",
                "Billionaires are a global security issue.",
                "Sued, but not arrested for oh I don’t know….breaking a 💩 load of laws 🤔",
                "Why ask a court to block it preemptively? He’s just gonna say he was never going to do it, which is just admitting to fraud again but that forces you to file another separate lawsuit. \n\nShow up, watch him hand out the checks, then immediately arrest him for election fraud. It’s that fucking simple, and governments arrest people for election fraud all the time."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Elon Musk must face Twitter shareholders’ lawsuit over alleged securities fraud",
            "external_url": "https://www.cnbc.com/2025/03/28/elon-musk-must-face-twitter-shareholders-lawsuit-over-alleged-securities-fraud.html",
            "upvotes": 8715,
            "date": "03/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107044713-1649676192257-107044713-1649676075485-gettyimages-1239883418-porzycki-economic220409_npT8D.jpg?v=1650040148&w=1920&h=1080",
            "top_comments": [
                "\"Musk’s attorneys have argued that while his disclosure was filed after an SEC-mandated deadline, this was merely an error and that the tech magnate did not commit nor intend securities fraud.\"\n\nLook your honor, I may be a simple a simple country hyper-chicken, but my client did not intend to commit securities fraud, just did.",
                "I like how Musk portrays himself as the most detail-oriented guy when trying to pretend like he knows what the fuck is going on with SpaceX rockets but then he commits an \"oopsie\" like this. As if he doesn't have somebody on his staff who's job is to deal with this.",
                "Never knew this detail:\n\n\n\n\n\"In his 43-page opinion, the judge also noted that Musk had posted a tweet on March 26, 2022 indicating he was thinking about buying a different social network, not Twitter, although he had already amassed millions of shares in Twitter as of March 25, 2022.\n\nHe wrote, it was “reasonable” to read Musk’s tweet “as a statement meant to misdirect the public to think that buying Twitter was just a fantasy.” The judge also wrote that, “it is more likely than not that Musk issued a material misleading representation,” with those tweets.\n\nMusk ultimately bid on and led a leveraged buyout of Twitter in 2022 in a deal worth about $44 billion. He made sweeping changes to the business, the social platform and later renamed it X.\"",
                "I get the feeling that lawsuits against Musk won't amount to much. Buying the last election is really paying out for him.",
                "\"In the wallet\" is his weak point.",
                "It was announced today DOGE was going through onboarding with the SEC. So this will be dismissed at some point",
                "Not if he destroys the justice system first.",
                "This has to be why 🍑🍑 pardoned that other guy today… lying to investors to get money is just what these amoral people do, and they have no qualms about using the “if you’re stupid enough to believe me then it’s your own fault” mentality.  They have no business whatsoever being in the Oval Office, too bad their voters cannot seem to see past their aggrieved mentality to see that.",
                "That turd needs to face all the people he’s screwing over.",
                "I wonder how this will go, now that Musk has committed 30bn to the fire by 'buying it' with xAI donor money."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Elon Musk's xAI buys social media platform X for $45 billion",
            "external_url": "https://www.reuters.com/markets/deals/musks-xai-buys-social-media-platform-x-45-billion-2025-03-28/",
            "upvotes": 22694,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "An all stock transaction... From one private company to another private company, both fundamentally controlled by the same person. This is really just economic sophistry isn't it?",
                "[deleted]",
                "\"$45 billion\" of xAI stock... so you have to accept xAI's totally specious $75B valuation in order to believe this transaction is actually worth $45 billion.  What a joke.  \n\nxAI has raised around $20 billion from investors and sells nothing but vaporware.",
                "Wait... so he raised money from investors for xAI, used that money to buy himself out of the $40B Twitter hole that he dug himself?? This seems very questionable at best...",
                "Okay... what?\n\nThis must be some tax/loan reshuffling thing I'm too plebeian to understand",
                "This is like when a no name influencer “sells” their shitty NFT to themselves for $10million",
                "So he Bought it for 45 billion Tanked it into the Ground to get Trump Elected. Then somehow Magically with no Innovation/ increase in revenue/ Advertisers didn't come back/ Multiple boycotts and Still the value went back up magically to what he bought it for? \n\nHe then Sells it from himself to a company owned by him in order to pay back the 45 billion dollar loan on the saudi's before they make a call on his Tesla Stock which he was tanking. and Somehow in all of this i'm pretty sure he paid Zero taxes somehow. \n\nThis Feels like all smoke and mirrors and there's got to be some Legality involved. Where's the SEC and the FTC oh right their being defanged and Gutted by Musk as we speak. \n\n  \n/sigh",
                "Moving the trash from one garbage bin to the other.",
                "This is exactly why he put his DOGE team within the SEC. Definitely committing fraud, but no one will be able to investigate him for it. We're so fucked in this country.",
                "So that recent surprise valuation of Twitter (x) now becomes clear. If only we had a functional FTC. This is just straight up fraud is what it is."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Trump signs order ending union bargaining rights for wide swaths of federal employees",
            "external_url": "https://www.npr.org/2025/03/28/nx-s1-5343474/trump-collective-bargaining-unions-federal-employees",
            "upvotes": 9187,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5313x2989+0+216/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F15%2Fb4%2Fb1a0c5b24f54b1e0156c71e26852%2Fgettyimages-2202711755.jpg",
            "top_comments": [
                "Friend is a federal prison guard and he’s boiling over this. However, he did volunteer that “We all voted for him and now he does this to us….•",
                "Is anyone really surprised, this was explicitly called out in project 2025",
                "I'm sure this will come as quite the surprise to all the union members who voted for him.  \n I mean who could expect a guy who attacked unions over and over again, including federal unions in his last term, and who praised Musk for firing people who attempted to unionize would possibly do this?!",
                "I suspect the administration will begin to treat attempts at unionizing to be domestic terrorism soon.",
                "How can these people that voted for him not have seen this?  You idiots who voted for him willingly invited this as everyone else screamed at you that you're being conned in the most graceless,  obvious manner.",
                "And how many of those Maga employees voted for Trump. Poetic.",
                "Gotta think that’s not legal.\nSupreme Court better act quick ",
                "So the billionaire who is well known to hate unions and work against them has signed and order messing with unions? You don't say?",
                "Since when did executive orders replace laws in this country? I’m pretty sure that’s not how it is supposed to work.",
                "Trumpers had a lot of time to read over P2025 and realize he'd screw them over.\n\n\nI feel no sympathy for them."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Woman Arrested After Miscarriage In Georgia Under Abortion Law",
            "external_url": "https://thegeorgiasun.com/news/woman-arrested-after-miscarriage-in-georgia-under-abortion-law/",
            "upvotes": 22417,
            "date": "03/28/2025",
            "thumbnail": "https://thegeorgiasun.com/wp-content/uploads/2022/06/shutterstock_2171223741-1170x694.jpg",
            "top_comments": [
                "You know what will help that person deal with the trauma of a miscarriage? The trauma of an arrest. That will surely improve her life /s",
                "\"*What Should Women Who Miscarry Do?: We asked several Tifton Police Department and Tift County officials what women who miscarry should do with the remains of the fetus. So far, only Tift District Attorney Patrick Warren has answered and said typically miscarriages are not handled in this manner.*\"\n\nSo they asked what she was supposed to do with the fetus and nobody had an answer.  If you can't tell her what she did wrong, why was she arrested?  Just because she probably didn't have a healthcare plan that would pay for it?",
                "\"The coroner’s office ruled it to be a occurring miscarriage\"\n\nI don't know if there's an official procedure of what to do with remains of a child when you have a miscarriage, but to jail and punish a mother for having one?   I mean... it's a miscarriage.  Did they want her to keep it in the fridge until the damn coroner can pick it up or something? Geeze! It's already traumatizing enough.",
                "People wonder why from the 1950s-70s why women hid miscarriages? This right here.",
                "What was she supposed to do with a dead fetus? At 19 weeks it was not close to viable. Women have been arrested for burying their stillborn children. Women miscarrying get turned away from hospitals because doctors are afraid to be accused of performing abortions. Maybe she didn’t even have the money to afford the ER visit (a whole other issue about how shitty the US is about healthcare).\n\nLook, I’ll be real with you. I used to work with animal control. Laws are different in different places, but when we had dead animals the law was two trash bags, into the dumpster. Trash bag/dumpster seems better to me than flushing it down the toilet. Burying it in the yard like a dead pet? If there are no laws regarding this, Tifton needs to leave this woman alone.",
                "Hey, remember when all the hippies were like \"these laws are going to be used to criminalize miscarriages!\" and the republicans were all \"nah, not us!\" and the hippies were right, just like we always are?",
                "I have suffered from 2 miscarriages and I can say with absolute certainty that if, while healing physically and emotionally from a miscarriage, I had also been arrested for said miscarriage I would be ready to burn everything down.  I can also say with absolute  certainty that I still have not emotionally healed from my miscarriages, and neither has my husband.  It's one of those things where you never actually get over it, but time makes it easier to go about your day.  This is heartbreaking and chilling and I wish this woman infinite strength.",
                "Oh, look. That thing that women were told not to worry about happening has happened.\n\n  \nThey want to criminalize women for not being perfect broodmares.",
                "Another article on the same topic. This is not an isolated case\n\n\nhttps://www.jezebel.com/georgia-police-jailed-woman-for-miscarriage-performed-autopsy-on-miscarried-fetus",
                "Nothing says family values and traditionalism like arresting a mother for a miscarriage she had no control over whatsoever /s"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Andrew Tate sued by ex-girlfriend for alleged sexual assault",
            "external_url": "https://www.bbc.com/news/articles/c62z2e5166eo",
            "upvotes": 2301,
            "date": "03/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b881/live/81c00fe0-0c20-11f0-ad28-1164c064d080.jpg",
            "top_comments": [
                "Me when the \"dating guru\" who claims to know everything about women is just a wife beater.",
                "That this piece of garbage, Andrew Tate, isn't rotting in prison, is proof that justice isn't fair.",
                "Am I missing something?  The girlfriend sounds like a new one, not like a 2020 girlfriend right?\n\nLike a 2024 or 2025 girlfriend?",
                "It’s always the ones you ~~least suspect~~ ~~most suspect~~ already knew about.",
                "Hope she wins the lawsuit",
                "Emory Andrew Tate III (born December 1, 1986), also known as Cobra Tate is an American-British kickboxer. When he's not beating men (or women, which he actually prefers now), he's a professional douche on social media.",
                "i hate that this guy is still alive tbh",
                "Imagine that, you fly a rapist into the country who’s being investigated for rape, and he continues to rape women here. Who could have seen that coming?",
                "Even if you didn't know who he was, what in the world would possess someone to look at THAT and want to smash?",
                "I hope he’s bottom bunk in prison. "
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Dow sinks more than 600 points. Stocks are on track for their worst quarter since 2023",
            "external_url": "https://www.cnn.com/2025/03/28/investing/us-stocks-tariff-uncertainty-volatility",
            "upvotes": 22759,
            "date": "03/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2206185432.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Are we having fun yet?",
                "Trump's economy in action.",
                "They must be updating the headline. When I first saw it the headline said 500 points. OP posted 600. Clicking the link now at 1311 hours its 700 points.\n\nEDIT: Lol. On the top right under 'latest market news' there's a headline for 600 points and clicking on it takes you to the headline for 700 points. Silly website.",
                "Ever since January 20  the economy has tanked and being on downward spiral because of poor policies .",
                "Just wait until the unemployment figures come in.",
                "Sec Treasury Bennet just included me in a chat about the declining stock market.  Will keep you all posted.",
                "Right now down 735. \n\nIt would need to fall another 700 points or so to hit the dip it was at a couple weeks ago. Another drop of that magnitude would take it to summer last year.",
                "Somebody's winning.  It's just not us.",
                "Note to America - don’t elect idiots & crooks.",
                "I mean is anyone surprised? I literally can't think of any positive economic indicators or good news on the horizon. We haven't even started feeling the effects of the tariffs and the feds yanking billions of dollars of spending out of the economy, unemployment is going to spike with all the layoffs over the last couple of months, and inflation is taking off again.\n\nI've moved mostly into cash. I keep hearing people repeat a dumb slogan: \"Time in the market > timing the market!!!\" Maybe that's true sometimes, but not times like now where there is literally zero reason for the market to go up, and a zillion reasons it will continue going down."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "HOT",
            "title": "U.S. turns to Europe for eggs to ease prices at home, but so far comes up empty-handed",
            "external_url": "https://www.cbsnews.com/news/egg-prices-us-europe-exports/",
            "upvotes": 4530,
            "date": "03/28/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/10/8b67d433-c1ec-4709-a5ad-5ffe86a0ab15/thumbnail/1200x630/5de92f083aafd8ea42c48e0bcf7711a7/gettyimages-2154882660.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "I often shit in my neighbors yard before I ask for sugar.",
                "Why would anyone want to help the US, at this point?",
                "Nobody is going to help. The word help is gone. My assumption is they don't outright say no, but are calling in demands for providing supplies. Trump works that way and he won't ever remember you \"helping\" him cause he feels he is entitled to that and deserves it. So, no... You want eggs well I want tariffs gone. No? Then go elsewhere for eggs.",
                "\"Greetings, former allies!\"",
                "Good. Don’t give us anything; we don’t deserve it.",
                "Europeans: let them eat cake!",
                "Why would any sovereign nation help the USA now? The government has abandoned all allies, is threatening their neighbors with invasion, and has begun an unnecessary trade war.\n\n\nI'm a citizen of the USA, and I say fuck our egg prices. The rest of the world will move on without us.",
                "Turns out the Carrot and Stick doesn't work if you have no carrot and the stick is flaccid.",
                "America is truly untrustworthy. Changing sides in a war. Threatening to invade allies. Imposing economic harm on allies.. America must now be treated, regarded as an enemy. \n\nA woman has a miscarriage, is bleeding, an ambulance is called. The woman is arrested and put in jail. America has become a pile of shit.",
                "The US is just going to have to scrape the egg off their own faces.  There's plenty of it."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Collision warning sounds in cockpit of Delta plane due to close call with Air Force jet near Reagan National Airport",
            "external_url": "https://www.cnn.com/2025/03/28/us/delta-military-jet-close-call-dca/index.html",
            "upvotes": 1672,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/150325082132-social-gfx-breaking-news.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You know what . . . I think I'm shifting to Dulles as my main DC airport from now on.",
                "This happened near the spot of the fatal plane collision 2 months ago.",
                "so are they just not gonna do anything about the horrifically congested airspace in DC",
                "They should introduce some kind of incentive to avoid these kinds of mishaps.",
                "Normal rules in the US limit aircraft that are flying below 10,000 ft to an airspeed of 250knots (roughly 304 MPH). The t-38 is a training jet (hence the T for training).\n\nWhy was the military trainer jet flying so fast in busy airspace? We have plenty of other military designated training ranges to learn to fly fast in.",
                "I'm sure Pete Hegseth will see to this very quick-- ah nevermind. Good fucking luck, America.",
                "Why are they using commercial jets for training obstacles? Unconscionable. ",
                "Jebus! I flew in and out of DCA two hours ago. WTF",
                "'...a review of tracking data from FlightRadar24 shows an Air Force T-38 jet flying past the Delta plane and DCA airport going more than *350 miles per hour at 800 feet*. The military jet took off and landed at Langley Air Force Base, in Hampton, Virginia.'\n\n*(emphasis* mine)",
                "Cool.  So my anxiety I had just this evening flying into DCA wasn’t totally unfounded.  I’m glad I didn’t read this before we left."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Top vaccine official forced out of FDA",
            "external_url": "https://www.cnn.com/2025/03/28/health/fda-vaccine-peter-marks-resigns/index.html",
            "upvotes": 1229,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1232822687.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "These bozos are really trying to sabotage every aspect of living in post pandemic America.",
                "These decisions are going to kill thousands of people.",
                "Prepare for some serious epidemics (e.g., measles, MMR, influenza, COVID, etc.).",
                "‘Restoring science’??? It won’t be long until the HHS starts promoting leeches, bloodletting and prayer as primary treatment.",
                "It's sad that I have to say this, but the US Government cannot be relied on for medical information.  Use sources from the EU or organizations like WHO, the US Government is anti-science.",
                "The US is really speed-running its own version of the [Great Leap Forward](https://en.wikipedia.org/wiki/Great_Leap_Forward).",
                "Great. I can't wait to visit my local clinic for my annual four humors exam and bloodletting.",
                "Republicans literally go out of their way to complicate things, and create issues out of thin air. How and why they made vaccines an issue is beyond me. It is so odd me to that a bunch of people that surely received vaccines early in life, and are in probably very normal health, have become so fearful of vaccines. If they just took a moment to look around them, they would notice a lot of evidence that vaccinated people are just fine. \n\nI find it incredibly frustrating that these anti-science anti-medicine folks will one day end up in a hospital and rely on science and medicine to treat them. It is a huge slap in the face to healthcare professionals who have dedicated their lives to studying and treating illness and disease.",
                "Vaccines replaced by Ivermectin. \n\nTop Vaccine Official replaced by a Horse. \n\nSeriously. When this is over I really hope there is punishment for the people destroying so many lives.",
                "politicizing vaccines is the dumbest thing ever."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "The Vermont Bar Association supports the Rule of Law, issues statement.",
            "external_url": "https://www.vtbar.org/board-of-managers-issues-statement-in-support-of-rule-of-law/",
            "upvotes": 78,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“The VBA condemns acts that undermine our democratic checks and balances and denounces attacks upon the judiciary. We express our unwavering support for an independent judiciary. Respect for the rule of law is essential to the functioning of our democratic society, justice, and the protection of individual rights and liberties. Everyone stands subject and accountable to the law. We remain committed to ensuring all Vermonters have access to the judicial process and that the process remains fair and equitable.”\nNow let’s see this principle be enforced.",
                "Please forward thid story to your state and local bar association.",
                "Can you believe this even needs to be said.",
                "It's sad that they have to come out with a statement like this.",
                "Isn’t this just a mission statement affirmation before their annual meeting, or do you have more context? I imagine we could speculate, but the linked information is pretty standard and generic."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Blackpool doctor not struck off by panel over 'one-off' rape",
            "external_url": "https://www.bbc.com/news/articles/ce989vygkz7o",
            "upvotes": 94,
            "date": "03/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/63a1/live/01bfa030-0be4-11f0-8ae9-2975efdc7f47.jpg",
            "top_comments": [
                "- Police investigated the incident but did not charge the doctor.\n- The doctor denies the allegations.\n- The incident had not taken place at his workplace.\n- The alleged victim was not a patient.\n- According to the tribunal, the doctor has not abused his position of trust as a doctor, and the incident did not involve patient safety concerns.\n\n\nDespite all of that the tribunal still suspended the doctor for 12 months, and he no longer works at the place he used to work.\n\n\nBoth the General Medical Council as well as the doctor have appealed the decision of the tribunal.",
                "Many here just don't know that General Medical Council, the UK medical body, is very controversial within the UK medical professional. Unlike many doctors councils in the world, they are not led by doctors by civilians. \n\nThey are already said by a judge to be racist and pretty much hated by doctors in UK due to questionable practice.",
                "wtf \n\n“You get one strike. Don’t do it again”. \n\nSick",
                "it's never \"one-off\". People who rape are serial rapists almost every single time.",
                "BBC has now joined the click bait club",
                "\"It's OK of you do it only once and have said you are sorry.\"   \nNoted.",
                "I guess they’re waiting for him to commit a “two off.”",
                "Sounds like they should one of goto jail\nFor 20+ years. "
            ],
            "aggregate_sentiment": 52.0
        },
        {
            "category": "NEW",
            "title": "Denmark Weighs Expanding Its Fleet of US F-35 Fighters Despite Tensions over Greenland",
            "external_url": "https://armyrecognition.com/news/aerospace-news/2025/denmark-weighs-expanding-its-fleet-of-us-f-35-fighters-despite-tensions-over-greenland",
            "upvotes": 75,
            "date": "03/29/2025",
            "thumbnail": "https://armyrecognition.com/images/stories/news/2025/march/Denmark_Weighs_Expanding_Its_Fleet_of_US_F-35_Fighters_Despite_Tensions_over_Greenland.jpg",
            "top_comments": [
                "The only way F35 has a future in Europe is if they get the same independent system as Israel has. \n\nThe problem is bigger than just F35. A lot of weapons (even European weapon systems) rely on American communication protocols, satalites, infrastructure. \n\nhttps://global4cast.org/2025/02/kill-switch-how-the-u-s-can-shut-down-europes-military-in-an-instant/",
                "This is 100% not confirmed or set in stone at all in any way. Our deference minster said: \"We have to strengthen our fleet of fighter jets and it is completely logical to acquire more F-35 fighter jets,\"\n\nThere is also some posturing happening at the moment to not upset the Americans. It would cause more harm than good to say \"Thanks for the F-35 but we would never consider buying them again, because we only want to support European\" right after JD Vance called us a bad ally. Pathetic, I know but gotta use all the tricks in the book to not upset grandpa Donny.",
                "Sounds like a default hard no to me, what’s there to consider buying then anyway? The US does have the ability to limit the support and updates of these jets, limiting their functionality.",
                "Nothing is signed. Its a bargaining chip",
                "Well they're \"weighting\" it but it might be a matter of negotiations with other manufacturers at this point. If you completely and openly rule out the competition, you might not have a good deal... business is business after all",
                "Knowing Donny Do Wrong, he'll probably accept selling planes to Denmark while also threatening war with them.... because he's a fucking stupid fuck.",
                "Daft idea. It's not a reliable platform.",
                "Jfc Denmark, if there ever was a time to switch to Swedish or French planes, this would be the moment (both cheaper and better, too)",
                "US says it’s gonna take over Greenland, so in response Denmark buys a bunch of expensive planes made in US? Lockheed wins again.",
                "The concerns about the US being unreliable are well founded at this point.  The US really needs to switch to selecting leaders using randomocracy - instead of elections reps, senators, etc are selected by lottery from among all eligible citizens.  It would produce a govt that is statistically far more representative of the population, resulting in less violent swings between successive govts.  It would also greatly diminish the power of political parties, reducing the insane partisanship that brought us to the present moment."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Top vaccine official forced out of FDA",
            "external_url": "https://www.cnn.com/2025/03/28/health/fda-vaccine-peter-marks-resigns/index.html",
            "upvotes": 1229,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1232822687.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "These bozos are really trying to sabotage every aspect of living in post pandemic America.",
                "These decisions are going to kill thousands of people.",
                "Prepare for some serious epidemics (e.g., measles, MMR, influenza, COVID, etc.).",
                "‘Restoring science’??? It won’t be long until the HHS starts promoting leeches, bloodletting and prayer as primary treatment.",
                "It's sad that I have to say this, but the US Government cannot be relied on for medical information.  Use sources from the EU or organizations like WHO, the US Government is anti-science.",
                "The US is really speed-running its own version of the [Great Leap Forward](https://en.wikipedia.org/wiki/Great_Leap_Forward).",
                "Great. I can't wait to visit my local clinic for my annual four humors exam and bloodletting.",
                "Republicans literally go out of their way to complicate things, and create issues out of thin air. How and why they made vaccines an issue is beyond me. It is so odd me to that a bunch of people that surely received vaccines early in life, and are in probably very normal health, have become so fearful of vaccines. If they just took a moment to look around them, they would notice a lot of evidence that vaccinated people are just fine. \n\nI find it incredibly frustrating that these anti-science anti-medicine folks will one day end up in a hospital and rely on science and medicine to treat them. It is a huge slap in the face to healthcare professionals who have dedicated their lives to studying and treating illness and disease.",
                "Vaccines replaced by Ivermectin. \n\nTop Vaccine Official replaced by a Horse. \n\nSeriously. When this is over I really hope there is punishment for the people destroying so many lives.",
                "politicizing vaccines is the dumbest thing ever."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Collision warning sounds in cockpit of Delta plane due to close call with Air Force jet near Reagan National Airport",
            "external_url": "https://www.cnn.com/2025/03/28/us/delta-military-jet-close-call-dca/index.html",
            "upvotes": 1676,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/150325082132-social-gfx-breaking-news.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You know what . . . I think I'm shifting to Dulles as my main DC airport from now on.",
                "This happened near the spot of the fatal plane collision 2 months ago.",
                "so are they just not gonna do anything about the horrifically congested airspace in DC",
                "They should introduce some kind of incentive to avoid these kinds of mishaps.",
                "Normal rules in the US limit aircraft that are flying below 10,000 ft to an airspeed of 250knots (roughly 304 MPH). The t-38 is a training jet (hence the T for training).\n\nWhy was the military trainer jet flying so fast in busy airspace? We have plenty of other military designated training ranges to learn to fly fast in.",
                "I'm sure Pete Hegseth will see to this very quick-- ah nevermind. Good fucking luck, America.",
                "Why are they using commercial jets for training obstacles? Unconscionable. ",
                "Jebus! I flew in and out of DCA two hours ago. WTF",
                "'...a review of tracking data from FlightRadar24 shows an Air Force T-38 jet flying past the Delta plane and DCA airport going more than *350 miles per hour at 800 feet*. The military jet took off and landed at Langley Air Force Base, in Hampton, Virginia.'\n\n*(emphasis* mine)",
                "Cool.  So my anxiety I had just this evening flying into DCA wasn’t totally unfounded.  I’m glad I didn’t read this before we left."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Andrew Tate sued by ex-girlfriend for alleged sexual assault",
            "external_url": "https://www.bbc.com/news/articles/c62z2e5166eo",
            "upvotes": 2305,
            "date": "03/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b881/live/81c00fe0-0c20-11f0-ad28-1164c064d080.jpg",
            "top_comments": [
                "Me when the \"dating guru\" who claims to know everything about women is just a wife beater.",
                "That this piece of garbage, Andrew Tate, isn't rotting in prison, is proof that justice isn't fair.",
                "Am I missing something?  The girlfriend sounds like a new one, not like a 2020 girlfriend right?\n\nLike a 2024 or 2025 girlfriend?",
                "It’s always the ones you ~~least suspect~~ ~~most suspect~~ already knew about.",
                "Hope she wins the lawsuit",
                "Emory Andrew Tate III (born December 1, 1986), also known as Cobra Tate is an American-British kickboxer. When he's not beating men (or women, which he actually prefers now), he's a professional douche on social media.",
                "i hate that this guy is still alive tbh",
                "Imagine that, you fly a rapist into the country who’s being investigated for rape, and he continues to rape women here. Who could have seen that coming?",
                "Even if you didn't know who he was, what in the world would possess someone to look at THAT and want to smash?",
                "I hope he’s bottom bunk in prison. "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Elon Musk must face Twitter shareholders’ lawsuit over alleged securities fraud",
            "external_url": "https://www.cnbc.com/2025/03/28/elon-musk-must-face-twitter-shareholders-lawsuit-over-alleged-securities-fraud.html",
            "upvotes": 8713,
            "date": "03/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107044713-1649676192257-107044713-1649676075485-gettyimages-1239883418-porzycki-economic220409_npT8D.jpg?v=1650040148&w=1920&h=1080",
            "top_comments": [
                "\"Musk’s attorneys have argued that while his disclosure was filed after an SEC-mandated deadline, this was merely an error and that the tech magnate did not commit nor intend securities fraud.\"\n\nLook your honor, I may be a simple a simple country hyper-chicken, but my client did not intend to commit securities fraud, just did.",
                "I like how Musk portrays himself as the most detail-oriented guy when trying to pretend like he knows what the fuck is going on with SpaceX rockets but then he commits an \"oopsie\" like this. As if he doesn't have somebody on his staff who's job is to deal with this.",
                "Never knew this detail:\n\n\n\n\n\"In his 43-page opinion, the judge also noted that Musk had posted a tweet on March 26, 2022 indicating he was thinking about buying a different social network, not Twitter, although he had already amassed millions of shares in Twitter as of March 25, 2022.\n\nHe wrote, it was “reasonable” to read Musk’s tweet “as a statement meant to misdirect the public to think that buying Twitter was just a fantasy.” The judge also wrote that, “it is more likely than not that Musk issued a material misleading representation,” with those tweets.\n\nMusk ultimately bid on and led a leveraged buyout of Twitter in 2022 in a deal worth about $44 billion. He made sweeping changes to the business, the social platform and later renamed it X.\"",
                "I get the feeling that lawsuits against Musk won't amount to much. Buying the last election is really paying out for him.",
                "\"In the wallet\" is his weak point.",
                "It was announced today DOGE was going through onboarding with the SEC. So this will be dismissed at some point",
                "Not if he destroys the justice system first.",
                "This has to be why 🍑🍑 pardoned that other guy today… lying to investors to get money is just what these amoral people do, and they have no qualms about using the “if you’re stupid enough to believe me then it’s your own fault” mentality.  They have no business whatsoever being in the Oval Office, too bad their voters cannot seem to see past their aggrieved mentality to see that.",
                "That turd needs to face all the people he’s screwing over.",
                "I wonder how this will go, now that Musk has committed 30bn to the fire by 'buying it' with xAI donor money."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Panama Canal ports sale has been put on hold by Chinese regulators",
            "external_url": "https://edition.cnn.com/2025/03/28/business/panama-canal-ports-deal-blocked/index.html",
            "upvotes": 231,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2197143001.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If it was up for sale to a us investor.    Why did Trump order the Military to craft invasion plans.    \n\nOr was he hoping for the sale to go through and then claim a victory !!! \n\nLike he claimed Victory on “forcing” Canada to implement changes at the boarder ? (They already announced 97% of what matters on 17 Dec last year!!) \n\nAmerica you are being held for a bunch of fools !!!",
                "Before the regulators stepped in, the government pretty much ordered all Chinese businesses to boycott CK Hutchison (HK-based owner of ports) because of the deal",
                ">The deal, led by BlackRock, the world’s largest asset manager with an enormous pool of $11.6 trillion in assets, was announced earlier this month and was widely viewed as a way to ease tensions in the region.\n\nOh yeah, I'll bet that was it.",
                "Sadly I see this going one of three ways.\n\nCK Hutchison sells the ports.\n\nPanama nationalizes the ports and sells them.\n\nTrump gets distracted by something shiny and forgets about the canal.",
                "Rather have China own it. They fix shit. \n\nTrump is trash.",
                "Growing up, I never thought I'd see the day I'm rooting for the chinese government.\n\nI'm glad to know now how much propoganda was the reason.",
                "This is a temporary bump. Even if the Chinese regulators disagree, this is in Panama.",
                "Why should Chinese regulators have any say over the sale of ports in Panama between a Cayman Island registered company (CK Hutchison) and a US company?",
                "Why are Chinese regulators able to do things in the Panama Canal?",
                "the Chinese is meddling... oh shit we can't call them out now after what we have done,"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Russian researcher at Harvard being held after failing to declare frog embryos at customs",
            "external_url": "https://abcnews.go.com/US/russian-researcher-harvard-held-after-failing-declare-frog/story?id=120275976",
            "upvotes": 700,
            "date": "03/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/689d863a-ae49-45f7-8a7a-6fb2e4a3de5d/Petrova-1-ht-er-250328_1743192507251_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "*\"Rather than imposing the appropriate monetary penalties for the customs violation, CBP improperly invoked their extensive immigration authority to impose a punishment grossly disproportionate to the situation,\" Petrova's attorney, Greg Romanovsky, said in a statement to ABC News.*\n\nOh I wonder what could possibly have inspired and gave assurance to this punitive over-reach.",
                ">*Ms. Petrova's situation is especially dire because the U.S. government is now seeking to deport her to Russia, where she faces the threat of immediate arrest due to her prior political activism and outspoken opposition to Russia's invasion of Ukraine*\n\nNormally such threat would actually be a reason for asylum, but...\n\n...embryos are persons now, thus .... no normal things to be expected soon.",
                "We're possibly going to deport a productive, highly educated, all around useful person and let her die in some horrible Russian gulag because of.... fucking frog embryos in jars...\n\nSomeone make all of this make sense.",
                "She was turning them gay wasn't she",
                "These kinds of actions are the ones that are going to crash US R&D.\n\nBefore US have been riding on their scientific institutions generally paying higher salaries than competing institutions elsewhere, but a better salary is not worth being thrown into an ICE concentration camp.",
                "Yes, it can be a pain to import biologicals, but to do this in this environment speaks either to her scientific dedication or hubris. ",
                "\nwe’re turning  the friggin frog gay via ivf is the hottest conspiracy.",
                "No fucking place to stay in Boston? Thrump customs enforcement is wasting millions.",
                "To be fair, there are good reasons why a lot of these regulations exist, but the way they were enforced is a whole other matter. It's like the woman here on a valid student visa who was \"arrested\" by ICE agents who were hiding their faces.",
                "She would be arrested in Russia for speaking against war in Ukraine. But is US now kinda working together with and helping to Russia now? So it is pretty much aligned"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Columbia University Interim President Katrina Armstrong Is Stepping Down",
            "external_url": "https://www.wsj.com/us-news/education/columbia-university-interim-president-katrina-armstrong-is-stepping-down-7644f880",
            "upvotes": 446,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Anyone who would want that job is someone they should not want to hire.",
                "Caves and then walks, prob with a very strong compensation package",
                "golden parachute out of the ivory tower",
                "What do we think it’s gonna be, she couldn’t take it or the board forced her out? ",
                "Katrina Armstrong came from the Medical School and is fighting to preserve Med School funding. \n\nShe is probably being forced out by other faculty who want to fight.",
                "I hope their international student admission numbers **plummet** after this incident.",
                "Good. She was acting like a clown. Bowing down is a dumb way to approach a fascist.",
                "She's lost all credibility from now until the end of time. She had to step down.",
                "The political situation at Columbia on at least a few fronts is so tough that even Interim Presidents step down.",
                "I don't know which actually qualified person would want to take this on right now and how much you'd have to pay them to make it worth the immense risk.\n\nYou're just going to be squeezed between increasingly hostile protestors who will target you and a facist government that is going to target you with a state monopoly on violence and a university that will be happy to heap the blame on you for failures to either comply with the government or address the concerns of the student body.\n\nGoodluck!"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Andrew Tate sued by ex-girlfriend for alleged sexual assault",
            "external_url": "https://www.bbc.com/news/articles/c62z2e5166eo",
            "upvotes": 2306,
            "date": "03/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b881/live/81c00fe0-0c20-11f0-ad28-1164c064d080.jpg",
            "top_comments": [
                "Me when the \"dating guru\" who claims to know everything about women is just a wife beater.",
                "That this piece of garbage, Andrew Tate, isn't rotting in prison, is proof that justice isn't fair.",
                "Am I missing something?  The girlfriend sounds like a new one, not like a 2020 girlfriend right?\n\nLike a 2024 or 2025 girlfriend?",
                "It’s always the ones you ~~least suspect~~ ~~most suspect~~ already knew about.",
                "Hope she wins the lawsuit",
                "Emory Andrew Tate III (born December 1, 1986), also known as Cobra Tate is an American-British kickboxer. When he's not beating men (or women, which he actually prefers now), he's a professional douche on social media.",
                "i hate that this guy is still alive tbh",
                "Imagine that, you fly a rapist into the country who’s being investigated for rape, and he continues to rape women here. Who could have seen that coming?",
                "Even if you didn't know who he was, what in the world would possess someone to look at THAT and want to smash?",
                "I hope he’s bottom bunk in prison. "
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk must face Twitter shareholders’ lawsuit over alleged securities fraud",
            "external_url": "https://www.cnbc.com/2025/03/28/elon-musk-must-face-twitter-shareholders-lawsuit-over-alleged-securities-fraud.html",
            "upvotes": 8724,
            "date": "03/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107044713-1649676192257-107044713-1649676075485-gettyimages-1239883418-porzycki-economic220409_npT8D.jpg?v=1650040148&w=1920&h=1080",
            "top_comments": [
                "\"Musk’s attorneys have argued that while his disclosure was filed after an SEC-mandated deadline, this was merely an error and that the tech magnate did not commit nor intend securities fraud.\"\n\nLook your honor, I may be a simple a simple country hyper-chicken, but my client did not intend to commit securities fraud, just did.",
                "I like how Musk portrays himself as the most detail-oriented guy when trying to pretend like he knows what the fuck is going on with SpaceX rockets but then he commits an \"oopsie\" like this. As if he doesn't have somebody on his staff who's job is to deal with this.",
                "Never knew this detail:\n\n\n\n\n\"In his 43-page opinion, the judge also noted that Musk had posted a tweet on March 26, 2022 indicating he was thinking about buying a different social network, not Twitter, although he had already amassed millions of shares in Twitter as of March 25, 2022.\n\nHe wrote, it was “reasonable” to read Musk’s tweet “as a statement meant to misdirect the public to think that buying Twitter was just a fantasy.” The judge also wrote that, “it is more likely than not that Musk issued a material misleading representation,” with those tweets.\n\nMusk ultimately bid on and led a leveraged buyout of Twitter in 2022 in a deal worth about $44 billion. He made sweeping changes to the business, the social platform and later renamed it X.\"",
                "I get the feeling that lawsuits against Musk won't amount to much. Buying the last election is really paying out for him.",
                "\"In the wallet\" is his weak point.",
                "It was announced today DOGE was going through onboarding with the SEC. So this will be dismissed at some point",
                "Not if he destroys the justice system first.",
                "This has to be why 🍑🍑 pardoned that other guy today… lying to investors to get money is just what these amoral people do, and they have no qualms about using the “if you’re stupid enough to believe me then it’s your own fault” mentality.  They have no business whatsoever being in the Oval Office, too bad their voters cannot seem to see past their aggrieved mentality to see that.",
                "That turd needs to face all the people he’s screwing over.",
                "I wonder how this will go, now that Musk has committed 30bn to the fire by 'buying it' with xAI donor money."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Collision warning sounds in cockpit of Delta plane due to close call with Air Force jet near Reagan National Airport",
            "external_url": "https://www.cnn.com/2025/03/28/us/delta-military-jet-close-call-dca/index.html",
            "upvotes": 1673,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/150325082132-social-gfx-breaking-news.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You know what . . . I think I'm shifting to Dulles as my main DC airport from now on.",
                "This happened near the spot of the fatal plane collision 2 months ago.",
                "so are they just not gonna do anything about the horrifically congested airspace in DC",
                "They should introduce some kind of incentive to avoid these kinds of mishaps.",
                "Normal rules in the US limit aircraft that are flying below 10,000 ft to an airspeed of 250knots (roughly 304 MPH). The t-38 is a training jet (hence the T for training).\n\nWhy was the military trainer jet flying so fast in busy airspace? We have plenty of other military designated training ranges to learn to fly fast in.",
                "I'm sure Pete Hegseth will see to this very quick-- ah nevermind. Good fucking luck, America.",
                "Why are they using commercial jets for training obstacles? Unconscionable. ",
                "Jebus! I flew in and out of DCA two hours ago. WTF",
                "'...a review of tracking data from FlightRadar24 shows an Air Force T-38 jet flying past the Delta plane and DCA airport going more than *350 miles per hour at 800 feet*. The military jet took off and landed at Langley Air Force Base, in Hampton, Virginia.'\n\n*(emphasis* mine)",
                "Cool.  So my anxiety I had just this evening flying into DCA wasn’t totally unfounded.  I’m glad I didn’t read this before we left."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Top vaccine official forced out of FDA",
            "external_url": "https://www.cnn.com/2025/03/28/health/fda-vaccine-peter-marks-resigns/index.html",
            "upvotes": 1230,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1232822687.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "These bozos are really trying to sabotage every aspect of living in post pandemic America.",
                "These decisions are going to kill thousands of people.",
                "Prepare for some serious epidemics (e.g., measles, MMR, influenza, COVID, etc.).",
                "‘Restoring science’??? It won’t be long until the HHS starts promoting leeches, bloodletting and prayer as primary treatment.",
                "It's sad that I have to say this, but the US Government cannot be relied on for medical information.  Use sources from the EU or organizations like WHO, the US Government is anti-science.",
                "The US is really speed-running its own version of the [Great Leap Forward](https://en.wikipedia.org/wiki/Great_Leap_Forward).",
                "Great. I can't wait to visit my local clinic for my annual four humors exam and bloodletting.",
                "Republicans literally go out of their way to complicate things, and create issues out of thin air. How and why they made vaccines an issue is beyond me. It is so odd me to that a bunch of people that surely received vaccines early in life, and are in probably very normal health, have become so fearful of vaccines. If they just took a moment to look around them, they would notice a lot of evidence that vaccinated people are just fine. \n\nI find it incredibly frustrating that these anti-science anti-medicine folks will one day end up in a hospital and rely on science and medicine to treat them. It is a huge slap in the face to healthcare professionals who have dedicated their lives to studying and treating illness and disease.",
                "Vaccines replaced by Ivermectin. \n\nTop Vaccine Official replaced by a Horse. \n\nSeriously. When this is over I really hope there is punishment for the people destroying so many lives.",
                "politicizing vaccines is the dumbest thing ever."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Russian researcher at Harvard being held after failing to declare frog embryos at customs",
            "external_url": "https://abcnews.go.com/US/russian-researcher-harvard-held-after-failing-declare-frog/story?id=120275976",
            "upvotes": 707,
            "date": "03/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/689d863a-ae49-45f7-8a7a-6fb2e4a3de5d/Petrova-1-ht-er-250328_1743192507251_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "*\"Rather than imposing the appropriate monetary penalties for the customs violation, CBP improperly invoked their extensive immigration authority to impose a punishment grossly disproportionate to the situation,\" Petrova's attorney, Greg Romanovsky, said in a statement to ABC News.*\n\nOh I wonder what could possibly have inspired and gave assurance to this punitive over-reach.",
                ">*Ms. Petrova's situation is especially dire because the U.S. government is now seeking to deport her to Russia, where she faces the threat of immediate arrest due to her prior political activism and outspoken opposition to Russia's invasion of Ukraine*\n\nNormally such threat would actually be a reason for asylum, but...\n\n...embryos are persons now, thus .... no normal things to be expected soon.",
                "We're possibly going to deport a productive, highly educated, all around useful person and let her die in some horrible Russian gulag because of.... fucking frog embryos in jars...\n\nSomeone make all of this make sense.",
                "She was turning them gay wasn't she",
                "These kinds of actions are the ones that are going to crash US R&D.\n\nBefore US have been riding on their scientific institutions generally paying higher salaries than competing institutions elsewhere, but a better salary is not worth being thrown into an ICE concentration camp.",
                "Yes, it can be a pain to import biologicals, but to do this in this environment speaks either to her scientific dedication or hubris. ",
                "\nwe’re turning  the friggin frog gay via ivf is the hottest conspiracy.",
                "No fucking place to stay in Boston? Thrump customs enforcement is wasting millions.",
                "To be fair, there are good reasons why a lot of these regulations exist, but the way they were enforced is a whole other matter. It's like the woman here on a valid student visa who was \"arrested\" by ICE agents who were hiding their faces.",
                "She would be arrested in Russia for speaking against war in Ukraine. But is US now kinda working together with and helping to Russia now? So it is pretty much aligned"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Panama Canal ports sale has been put on hold by Chinese regulators",
            "external_url": "https://edition.cnn.com/2025/03/28/business/panama-canal-ports-deal-blocked/index.html",
            "upvotes": 230,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2197143001.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If it was up for sale to a us investor.    Why did Trump order the Military to craft invasion plans.    \n\nOr was he hoping for the sale to go through and then claim a victory !!! \n\nLike he claimed Victory on “forcing” Canada to implement changes at the boarder ? (They already announced 97% of what matters on 17 Dec last year!!) \n\nAmerica you are being held for a bunch of fools !!!",
                "Before the regulators stepped in, the government pretty much ordered all Chinese businesses to boycott CK Hutchison (HK-based owner of ports) because of the deal",
                ">The deal, led by BlackRock, the world’s largest asset manager with an enormous pool of $11.6 trillion in assets, was announced earlier this month and was widely viewed as a way to ease tensions in the region.\n\nOh yeah, I'll bet that was it.",
                "Sadly I see this going one of three ways.\n\nCK Hutchison sells the ports.\n\nPanama nationalizes the ports and sells them.\n\nTrump gets distracted by something shiny and forgets about the canal.",
                "Rather have China own it. They fix shit. \n\nTrump is trash.",
                "Growing up, I never thought I'd see the day I'm rooting for the chinese government.\n\nI'm glad to know now how much propoganda was the reason.",
                "This is a temporary bump. Even if the Chinese regulators disagree, this is in Panama.",
                "Why should Chinese regulators have any say over the sale of ports in Panama between a Cayman Island registered company (CK Hutchison) and a US company?",
                "Why are Chinese regulators able to do things in the Panama Canal?",
                "the Chinese is meddling... oh shit we can't call them out now after what we have done,"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk sued by Wisconsin attorney general ahead of state election - CBS Minnesota",
            "external_url": "https://www.cbsnews.com/minnesota/video/elon-musk-sued-by-wisconsin-attorney-general-ahead-of-state-election/",
            "upvotes": 37105,
            "date": "03/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/28/01229e65-5150-49fb-8057-a3d617b2fb1f/thumbnail/1200x630/91d35c20019f4f05ab89122be4e65360/637e56ce8c7202049f60fb0500b8f966.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "In another article\n\n> Wisconsin Attorney General Josh Kaul sued Musk in state court, seeking to temporarily restrain Musk from further promoting his promise to give away two $1 million checks or making any further payments to Wisconsin voters. Wisconsin law prohibits offering anything of value to an elector in order to induce their voting behavior, Kaul said in the Dane County Circuit Court lawsuit.\n“The Wisconsin Department of Justice is committed to ensuring that elections in Wisconsin are safe, secure, free, and fair,” Kaul said in a statement on X.\n\nLike holy cow can someone please charge this man with election interference.",
                "Cool. Now, convict and JAIL THIS MOTHERFUCKER.",
                "This is exactly why billionaires shouldn't exist. There is nothing respectable or admirable about this, there is no advanced strategy or genius-level 4D Chess, absolutely no hard work is going into any of these victories, they are simply throwing money at the problem like always and it always works for them cause they keep us destitute.",
                "Remember what life was like before this piece of shit was front and center in the news every fucking day? That was nice.",
                "Unfortunately we’ve already seen the ultra wealthy can’t be held accountable because they can just delay delay delay forever.\n\nGood luck to them either way.",
                "I don't understand why we're \"suing\" people for committing felonies. What happened to arresting them?",
                "Just like the lawsuit in Pennsylvania that went nowhere? When are people going to realize our institutions are being assaulted by Musk and MAGA. The US is in a state of constitutional and national security crisis.",
                "Billionaires are a global security issue.",
                "Sued, but not arrested for oh I don’t know….breaking a 💩 load of laws 🤔",
                "Why ask a court to block it preemptively? He’s just gonna say he was never going to do it, which is just admitting to fraud again but that forces you to file another separate lawsuit. \n\nShow up, watch him hand out the checks, then immediately arrest him for election fraud. It’s that fucking simple, and governments arrest people for election fraud all the time."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk's xAI buys social media platform X for $45 billion",
            "external_url": "https://www.reuters.com/markets/deals/musks-xai-buys-social-media-platform-x-45-billion-2025-03-28/",
            "upvotes": 22693,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "An all stock transaction... From one private company to another private company, both fundamentally controlled by the same person. This is really just economic sophistry isn't it?",
                "[deleted]",
                "\"$45 billion\" of xAI stock... so you have to accept xAI's totally specious $75B valuation in order to believe this transaction is actually worth $45 billion.  What a joke.  \n\nxAI has raised around $20 billion from investors and sells nothing but vaporware.",
                "Wait... so he raised money from investors for xAI, used that money to buy himself out of the $40B Twitter hole that he dug himself?? This seems very questionable at best...",
                "Okay... what?\n\nThis must be some tax/loan reshuffling thing I'm too plebeian to understand",
                "This is like when a no name influencer “sells” their shitty NFT to themselves for $10million",
                "So he Bought it for 45 billion Tanked it into the Ground to get Trump Elected. Then somehow Magically with no Innovation/ increase in revenue/ Advertisers didn't come back/ Multiple boycotts and Still the value went back up magically to what he bought it for? \n\nHe then Sells it from himself to a company owned by him in order to pay back the 45 billion dollar loan on the saudi's before they make a call on his Tesla Stock which he was tanking. and Somehow in all of this i'm pretty sure he paid Zero taxes somehow. \n\nThis Feels like all smoke and mirrors and there's got to be some Legality involved. Where's the SEC and the FTC oh right their being defanged and Gutted by Musk as we speak. \n\n  \n/sigh",
                "Moving the trash from one garbage bin to the other.",
                "This is exactly why he put his DOGE team within the SEC. Definitely committing fraud, but no one will be able to investigate him for it. We're so fucked in this country.",
                "So that recent surprise valuation of Twitter (x) now becomes clear. If only we had a functional FTC. This is just straight up fraud is what it is."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Trump signs order ending union bargaining rights for wide swaths of federal employees",
            "external_url": "https://www.npr.org/2025/03/28/nx-s1-5343474/trump-collective-bargaining-unions-federal-employees",
            "upvotes": 9188,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5313x2989+0+216/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F15%2Fb4%2Fb1a0c5b24f54b1e0156c71e26852%2Fgettyimages-2202711755.jpg",
            "top_comments": [
                "Friend is a federal prison guard and he’s boiling over this. However, he did volunteer that “We all voted for him and now he does this to us….•",
                "Is anyone really surprised, this was explicitly called out in project 2025",
                "I'm sure this will come as quite the surprise to all the union members who voted for him.  \n I mean who could expect a guy who attacked unions over and over again, including federal unions in his last term, and who praised Musk for firing people who attempted to unionize would possibly do this?!",
                "I suspect the administration will begin to treat attempts at unionizing to be domestic terrorism soon.",
                "How can these people that voted for him not have seen this?  You idiots who voted for him willingly invited this as everyone else screamed at you that you're being conned in the most graceless,  obvious manner.",
                "And how many of those Maga employees voted for Trump. Poetic.",
                "Gotta think that’s not legal.\nSupreme Court better act quick ",
                "So the billionaire who is well known to hate unions and work against them has signed and order messing with unions? You don't say?",
                "Since when did executive orders replace laws in this country? I’m pretty sure that’s not how it is supposed to work.",
                "Trumpers had a lot of time to read over P2025 and realize he'd screw them over.\n\n\nI feel no sympathy for them."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Woman Arrested After Miscarriage In Georgia Under Abortion Law",
            "external_url": "https://thegeorgiasun.com/news/woman-arrested-after-miscarriage-in-georgia-under-abortion-law/",
            "upvotes": 22426,
            "date": "03/28/2025",
            "thumbnail": "https://thegeorgiasun.com/wp-content/uploads/2022/06/shutterstock_2171223741-1170x694.jpg",
            "top_comments": [
                "You know what will help that person deal with the trauma of a miscarriage? The trauma of an arrest. That will surely improve her life /s",
                "\"*What Should Women Who Miscarry Do?: We asked several Tifton Police Department and Tift County officials what women who miscarry should do with the remains of the fetus. So far, only Tift District Attorney Patrick Warren has answered and said typically miscarriages are not handled in this manner.*\"\n\nSo they asked what she was supposed to do with the fetus and nobody had an answer.  If you can't tell her what she did wrong, why was she arrested?  Just because she probably didn't have a healthcare plan that would pay for it?",
                "\"The coroner’s office ruled it to be a occurring miscarriage\"\n\nI don't know if there's an official procedure of what to do with remains of a child when you have a miscarriage, but to jail and punish a mother for having one?   I mean... it's a miscarriage.  Did they want her to keep it in the fridge until the damn coroner can pick it up or something? Geeze! It's already traumatizing enough.",
                "People wonder why from the 1950s-70s why women hid miscarriages? This right here.",
                "What was she supposed to do with a dead fetus? At 19 weeks it was not close to viable. Women have been arrested for burying their stillborn children. Women miscarrying get turned away from hospitals because doctors are afraid to be accused of performing abortions. Maybe she didn’t even have the money to afford the ER visit (a whole other issue about how shitty the US is about healthcare).\n\nLook, I’ll be real with you. I used to work with animal control. Laws are different in different places, but when we had dead animals the law was two trash bags, into the dumpster. Trash bag/dumpster seems better to me than flushing it down the toilet. Burying it in the yard like a dead pet? If there are no laws regarding this, Tifton needs to leave this woman alone.",
                "Hey, remember when all the hippies were like \"these laws are going to be used to criminalize miscarriages!\" and the republicans were all \"nah, not us!\" and the hippies were right, just like we always are?",
                "I have suffered from 2 miscarriages and I can say with absolute certainty that if, while healing physically and emotionally from a miscarriage, I had also been arrested for said miscarriage I would be ready to burn everything down.  I can also say with absolute  certainty that I still have not emotionally healed from my miscarriages, and neither has my husband.  It's one of those things where you never actually get over it, but time makes it easier to go about your day.  This is heartbreaking and chilling and I wish this woman infinite strength.",
                "Oh, look. That thing that women were told not to worry about happening has happened.\n\n  \nThey want to criminalize women for not being perfect broodmares.",
                "Another article on the same topic. This is not an isolated case\n\n\nhttps://www.jezebel.com/georgia-police-jailed-woman-for-miscarriage-performed-autopsy-on-miscarried-fetus",
                "Nothing says family values and traditionalism like arresting a mother for a miscarriage she had no control over whatsoever /s"
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "03/29/2025 12:13:51 UTC"
}