{
    "posts": [
        {
            "category": "HOT",
            "title": "Virginia Giuffre, one of Jeffrey Epstein's most prominent abuse survivors, dies by suicide",
            "external_url": "https://www.nbcnews.com/news/us-news/virginia-giuffre-one-jeffrey-epsteins-prominent-abuse-survivors-dies-s-rcna203027",
            "upvotes": 45164,
            "date": "04/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-01/240104-virginia-giuffre-mn-1000-4fe9be.jpg",
            "top_comments": [
                "[removed]",
                "Thank you Virginia for speaking out. May you rest in peace now.",
                "*\"Virginia was a fierce warrior in the fight against sexual abuse and sex trafficking. She was the light that lifted so many survivors,\" the statement said. “In the end, the toll of abuse is so heavy that it became unbearable for Virginia to handle its weight.\"*\n\nGiuffre's abuse was ultimately beyond her because it started so early in her life as she victimized by family, friends and life in the streets all of which drove into Epstein's even deeper trap. But what endless courage to get out.",
                "i thought she was just in an auto accident and was claiming she only had days to live. Was that someone else? No i just checked, it was her, and she got out of the hospital for that and was making a recovery.\n\nwhat an odd sequence of events.",
                "She deserved so much better from this world. RIP.",
                "She’s the only reason Prince Andrew was exposed. Virginia was an American, and not subject to the Crown.\n\nRIP Virginia. Thank you for your bravery and I’m sorry this world wasn’t kinder to you. You deserved better.",
                ">At the age of 14, Giuffre reunited with her father and returned to live with him. Her father worked as a maintenance manager at the Mar-a-Lago property owned by Donald Trump, and also helped Giuffre obtain a job there.\n\nJust in case anyone needs a refresher on how and where Maxwell/Epstein ~~recruited~~ trafficked her from.",
                "I wonder how many other victims of his abuse have died this way.  People think you get better as you get older but it can damage you the rest of your life.   Brave girl.  Saved unknown from being their victims.",
                "The bad guys are winning.",
                "Virginia was the epitome of courage. Her death by suicide is heartbreaking, but I pray she is finally at peace."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Son of CIA deputy director was killed while fighting for Russia, report says | CIA",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/25/michael-alexander-gloss-cia-russia",
            "upvotes": 11869,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/08647fff3a32cb2f39cfcf68feff7e7f13abd216/0_33_1577_946/master/1577.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=040661ae85285a70377d84480d1f7f0f",
            "top_comments": [
                "You'd think that was something that would come up in a routine background check for any position at the CIA.",
                "Ok, so that IS weird, right?",
                "Died doing what he loved, being a fucking idiot.",
                "Loved homeland and hated fascism. Fought and died for Putin in the rare conflict that the US is 100 percent on the right side. This makes no fucking sense. This dude must be a really confused individual. Or maybe Russian disinformation machine is just that good. ",
                "This is such an odd story. The dude was apparently pro Russia and pro Palestine. In university, he championed gender equality and was very upset with the way the US supported Israel. \n\nHow the fuck can you have all those views and then go fight for Putin? I'm flabbergasted. Flummoxed.",
                "So he was an \"America Bad\" left-wing contrarian who hated \"imperialism\" so much that he gave his life to support a Russian war of expansion.\n\nThis is your brain on social media",
                "he was a tankie, for anyone wondering what he was doing supporting russia.\n\nTheres also a screenshot (allegedly) from an FPV drone floating around, moments before it strikes him in the face",
                "Investigate the CIA deputy director now!",
                "Good, another treasonous traitor not burdening this country. He made his choice, now he gets to die with it. ",
                "McCarthyism would have had this dude for breakfast"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Former Rep. George Santos sentenced to 87 months in New York federal fraud case",
            "external_url": "https://www.cnbc.com/2025/04/25/george-santos-fraud-sentence-congress.html",
            "upvotes": 33107,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136734-17455932402025-04-25t145727z_1834006727_rc225eatuykw_rtrmadp_0_usa-congress-santos.jpeg?v=1745609921&w=1920&h=1080",
            "top_comments": [
                "What a way to treat the man who not only founded New York, but built Central Park with his own three hands.",
                "Former Rep. George Santos, whose web of [lies](https://www.cnbc.com/2023/01/19/rep-george-santos-pushes-back-on-insane-reports-he-took-funds-for-veterans-dying-dog.html) about his life led to his expulsion from Congress, was sentenced Friday to more than seven years in prison in his federal fraud case.\n\nThe New York Republican must also pay restitution of $373,750, a judge ruled in U.S. District Court in Long Island.\n\nSantos admitted last August to engaging in a multi-pronged campaign finance scheme, stealing unemployment benefits during the Covid-19 pandemic, and lying on House financial disclosure forms.\n\nAs part of an agreement with prosecutors, Santos pleaded guilty to a single count each of wire fraud and aggravated identity theft. He also agreed to restitution and forfeiture totaling nearly $580,000.",
                "George Santos is, hands down, the best minor villain America has ever seen. His story is absolutely wild. And not merely because he has a drag-queen alter ego, [Kitara Rivache](https://www.nbcnews.com/nbc-out/out-politics-and-policy/george-santos-says-will-revive-drag-queen-persona-cameo-rcna149867).\n\nThe Republican party is an organized crime syndicate. Like the mob, [the GOP happily protected Santos from expulsion](https://apnews.com/article/george-santos-expel-house-republicans-new-york-249bd2341d157bc6727b77607d8d45ae) when he merely deceived voters with financial fraud.\n\nBut, Santos broke the most important rule in organized crime: don't steal from the mob. [Santos sent emails to Senator Kevin McCarthy's wealthy donors claiming to be McCarthy's fundraiser. Santos siphoned money from McCarthy's campaign into his own](https://www.cnbc.com/2023/01/09/george-santos-raised-money-from-wealthy-gop-donors-while-lying-about-his-resume.html).\n\nThat was the last straw. [Republicans joined Democrats in a second ethics vote against Santos, successfully removing the disgraced representative from Congress](https://www.cbsnews.com/news/who-voted-to-expel-george-santos/).",
                "Federal?\n\nI give it 48 hours until he's pardoned.",
                "Does Vegas have over under on how long he actually spends in prison and is it .5 days cause at this rate I feel it’s more likely the judge who sentenced him somehow is arrested some made up charges than this guy seeing a cell.",
                "The same George Santos that built Rome in a couple days?",
                "Former President Santos going to prison, wow. ",
                "his father, the inventor of toaster strudel, will not be very happy with this.",
                "To all the snarky “he’s gonna get pardoned” comments, no he fucking isn’t lol. This dude was an absolute nobody before coming into the picture and deeply embarrassed a lot of really powerful people. I could be mistaken but I don’t think a single republican has spoken up in defense of Santos with any meaningful weight beyond maybe a broad platitude about democrats being worse or something. If he didn’t plead guilty they would have 100% thrown the book at him.",
                "Man singlehandedly built this country, and this is how he's treated. Smdh."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "FBI arrests Wisconsin judge for alleged immigration arrest obstruction",
            "external_url": "https://www.cnbc.com/2025/04/25/fbi-arrest-judge-hannah-dugan-milwaukee.html",
            "upvotes": 55705,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136765-17455967922025-04-25t155724z_1252469857_rc235eacvo1d_rtrmadp_0_usa-fbi-judge.jpeg?v=1745623100&w=1920&h=1080",
            "top_comments": [
                "That's 2 judges in 2 days.",
                "Meanwhile, trump recently pardoned a judge in Nevada who committed fraud related to a ~~veterans charity~~ honoring a slain police officer. \n\nIf that didn’t enrage you enough, that judge had no law degree and said she was looking forward to getting back on the bench.\n\nEdit: she stole money that was supposed to go to a fund for a slain officer for personal expenses.....like plastic surgery. \n\nFrom ABC\n\n*President Trump has pardoned a Las Vegas politician convicted last year of using money meant for a statue honoring a slain police officer on personal costs, including plastic surgery.*\n\n*Michele Fiore, a former city councilwoman and Nevada state lawmaker, was* [*found guilty in October*](https://apnews.com/article/republican-michele-fiore-guilty-wire-fraud-nevada-5844d79dacf0bfd6b43d36e03eb6cd95) *of six counts of federal wire fraud and one count of conspiracy to commit wire fraud. She was out of custody ahead of a sentencing scheduled for next month.*\n\n*Federal prosecutors alleged during trial that Fiore, 54, had raised more than $70,000 for the statue of a Las Vegas police officer who was fatally shot in 2014 in the line of duty, but had instead spent some of the funds on cosmetic surgery, rent and her daughter's wedding.*\n\n*Fiore, who does not have a law degree, was appointed as a judge in deep-red Nye County in 2022 shortly after she lost her campaign for state treasurer. She was elected in June 2024 to complete the unexpired term of a judge who died but had been suspended without pay amid her legal troubles. Pahrump is an hour's drive west of Las Vegas.*",
                "Is this record time to go from \"Stop overreacting\" to \"we are literally arresting judges\"",
                "Find this beyond alarming given he fully pardoned a judge in Nevada who was caught red handed pocketing money raised for a police memorial. Was an open and shut case. \n\nShe said it was god’s doing and borderline called Trump a deity. I shit you not. She’s back in court like next week.",
                "Just want to add a historical note that in the Declaration of Independence there is a mention that if a government becomes oppressive, the people have the right to abolish it.",
                "So Trump is sending his crony at the FBI, Kash Patel, to arrest judges standing up to him.\n\n*Yeah, that's definitely the sign of a properly functioning democracy.*",
                "Guys? You're under reacting. way under reacting",
                "Everyone in this administration deserves to end up in prison when this is all over. ",
                "Time for the National Strikes to begin. If they are arresting judges now for upholding the law, there is nothing left for this country. Time to shut it all down.",
                ">Patel wrote on X that the FBI believes Milwaukee Circuit Court Judge Hannah Dugan “intentionally misdirected federal agents away” from Eduardo Flores Ruiz as agents were attempting to arrest him at her courthouse last week.\n\nIt’s not what you believe, it’s what you can prove. It will be interesting to see what kind of case they have but my money is on the FBI over reaching here."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Luigi Mangione pleads not guilty in federal court to murder of UnitedHealthcare CEO",
            "external_url": "https://www.cnbc.com/2025/04/25/luigi-mangione-pleads-not-guilty-in-federal-court-to-murder-of-unitedhealthcare-ceo.html",
            "upvotes": 8124,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108105907-17401702152025-02-21t203147z_180253610_rc22zcaawdld_rtrmadp_0_unitedhealth-ceo.jpeg?v=1740170306&w=1920&h=1080",
            "top_comments": [
                "Death penalty for thee, but not for the guy that killed 12 people recently in a shooting.",
                "Well that’s good enough for me, knock it down to rolling a stop sign and cut him loose.",
                "The aristocracy is really unhappy that one of their own was targeted, and public sentiment leaned towards the attacker. They're trying to make an example of him. Mass murdering terrorists didn't catch federal charges with a death penalty.",
                "Why did his case even go to federal court when it all happened in New York?",
                "Now bring the real murderers to trial - Health Insurance CEOs and their Boards.",
                "How about we split the difference and call it medical malpractice?",
                "We're all looking for the guy that did this.",
                "Think they are really pushing that \"innocent man\" jargon. The CEO of UnitedHealthcare was NOT an innocent man by any means. \n\nI think pretty much everyone  in health insurance company leadership roles need  criminal charges for \"theft by deception\" and should be charged for manslaughter for all the people that died bc they were unable to be diagnosed and/or treated for the illnesses and injuries that killed them, bc the insurance companies wouldn't cover the testing/diagnostics/treatment. \n\nAnd I think if our elected reps had the same type of health insurance we did, they would change their tune pretty quick.",
                "my man didn’t do shit",
                "This really isn't newsworthy. It's a procedural necessity to plead not guilty to keep the case going, get disclosure, discuss the state's evidence with counsel. 99% of felony guilty pleas start with a plea of not guilty. This is a nothing burger."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "ICE is reversing termination of legal status for international students around US, lawyers say",
            "external_url": "https://apnews.com/article/international-student-status-restored-9e8a7cb90f4193ec52bf06edc5094cd9",
            "upvotes": 5843,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Monday headlines: Trump tells ICE to revoke legal status.  Tuesday headline- ICE reverts status once again.",
                "It's not going to matter much. The uncertainty around it just makes everything worse.\n\nWe have an administration who shrugs when they accidentally deport the wrong person, actively goes after judges in every way they can, and I wouldn't be surprised to see issuing brown boots to ICE.\n\nThe world has seen what we are becoming, even if a dark part of our own population is in denial about it.",
                "I’m tired of hearing fatalist remarks about how this doesn’t matter. We can’t secede our power and need to keep the fight going. Inch by inch, if necessary. This is a good sign that the administration is responding to legal action and pushback.",
                "This was always evil and cruel. \n\nBut on a dumber level, this shit is WASTEFUL and EXPENSIVE. \n\nThis messy administration and DOGE boys will cost us billions and billions at the end of the day. Because all of this costs us time and money.",
                "The protests are working. If you go to them, keep it up.",
                "Lol they are about to find out how much international students' exorbitant tuitions subsidy domestic students'. You think paying for colleges as an American is too expensive? Without international students you're gonna pay double the current rate.",
                "So, basically... \"We have absolutely no legal foundation for our actions, so rather than set a legal precedent we'll just voluntarily reverse our decision.\"\n\nI'm hardly an expert on such matters, but from what I understand from credible sources, is that even if your student visa is terminated, you're legally allowed to remain in the country as long as you're enrolled at a school. I presume at least until the end of the current term, then you're expected to either get a new visa or leave.",
                "Because it is illegal to do since none committed a crime.",
                "For everyone saying the courts are doing nothing but giving strong rebukes - this is a result of what's happening in those cases. This isn't a sudden inexplicable about face it's being framed as, this is because they are *losing those cases*.  The judiciary isn't laying down and taking it.",
                " Trumps goons were acting unlawfully. Colour me surprised."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Elon Musk's social media platform X sues Minnesota over political deepfake ban | MPR News",
            "external_url": "https://www.mprnews.org/episode/2025/04/24/elon-musk-social-media-platform-x-sues-minnesota-political-deepfake-ban",
            "upvotes": 5731,
            "date": "04/25/2025",
            "thumbnail": "https://img.apmcdn.org/caab343605b8e3130e9316b76da4c3fc3f3bafd5/widescreen/fec767-20250330-wisconsin-supreme-court-2000.jpg",
            "top_comments": [
                "So Elon musk, who has several years worth of history of posting nazi propaganda on Twitter, is sueing because a law saw people can't use AI to create deepfakes to intentionally spread political misinformation.\n\nI mean, aside from all the other awful shit he has done, does anyone really need anymore proof musk is an evil narcissistic psycho?",
                "In the spirit of Musk's concerns: Never, ever stop creating and posting deep fakes of Elon Musk openly bragging about rigging the 2024 election.",
                "Musk is only filing suit because he personally would be responsible for generating most of it.",
                "Sueing to spread political disinformation sounds like a stupid idea and only proves that you and your platform shouldn't be trusted.",
                "He's suing for the right to deliberately mislead and lie to people. P. O. S.",
                "That guy is a taint barnacle",
                "He's such a little bitch. \nJust a complete coward on every fucking level.",
                "I'm so sick of malignant narcissist billionaires.\n\n*I apologize for being redundant though.*",
                "This would only matter to someone who wants to cheat.",
                "Elons just doing this to fuck with Tim Walz"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Man convicted of first-degree murder in rock-throwing death of Colorado driver",
            "external_url": "https://apnews.com/article/throwing-rock-car-denver-colorado-trial-05c84344aa9dfa7fcf88c644a616c6f2",
            "upvotes": 3582,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Guys... They weren't like throwing innocent little pebbles like some kid prank....\n\nthey were throwing 9lb landscaping sized rocks from their truck, one that smashed Alexa's head!!!?!??\n\nPure fucking evil.\n\nhttps://denvergazette.com/news/courts/colorado-first-responder-trauma-suffered-alexa-bartell-homicide/article_d71d5dc8-d38b-445c-9989-adfe73018d6a.amp.html",
                "> After seeing Bartell’s car leave the road after being hit, the three friends circled back a few times to look again, according to testimony and investigators. One of them, Kwak, took a photo as a memento but no one checked on the driver or called for help, according to their testimony.\n\n> Bartell’s body would not be discovered until her girlfriend, Jenna Griggs, who was on the phone with her that night when the call abruptly cut out, tracked her phone to the field, she testified.\n\ntl;dr: Not only did they do this, they had saw the results, had the chance to save them... not only didn't, but took a photo and just left them there.\n\nEdit: Fixed, ty jojo",
                "Shit like this makes your blood boil. I cannot imagine how I'd feel if a loved one died to this kind of absolutely senseless buffoonery. Fuck them all. Throw the whole damn kitchen sink.",
                "Wow, finally pieces of crap like this get sentences that fit the crime",
                "\"...but also stressed that none of the three had intended to hurt anyone.\"\n\nWhat did they intend when they threw a rock at the windscreen of a moving car? \n\nAfter it crashed and they took a photo of the wreck, then left without calling for an ambulance, were they still not intending any hurt?",
                "The detail “the friends agreed to not talk to anyone after the event” is actually super important in these cases. It signifies that they had some understanding between right and wrong during the moment of the crime. This makes it almost impossible to make an insanity argument, which the defense attorney most definitely would have attempted on the basis of his “borderline personality disorder.”",
                ">Karol-Chik testified that Koenig seemed “excited” as they drove by Bartell’s car and at one point made a “whoop” sound.\n\n>“It sounded like him celebrating,” said Karol-Chik, who admitted he had placed the fatal rock next to Koenig so he could grab it and throw it as he drove.\n\nThankfully I will never understand these sorts of people.",
                "Genuinely (and pleasantly) surprised the other two are also receiving actual lengthy sentences. Seems like it’s always “pled guilty to second degree murder, sentenced to time served”.",
                "*After seeing Bartell’s car leave the road after being hit, the three friends circled back a few times to look again, according to testimony and investigators. One of them, Kwak,* [*took a photo*](https://apnews.com/article/colorado-driver-rock-throwing-death-9ed6bb5ef63212cd58a6d51e94596f18) *as a memento but no one checked on the driver or called for help, according to their testimony.*\n\nThis Kwak action seems almost as callous as throwing the fateful stone. But Bartell's mother, while happy that justice for her daughter was achieved, still felt mixed emotions and some sympathy with the defendants plight.",
                "When my older sister was a baby, my parents took her to the zoo and had her in a stroller. There’s a tall bridge that goes over part of the zoo. Some idiot threw a hubcap off of the bridge and it landed within 10’ of my parents & sister. So fucking reckless and idiotic to do.\n\nThis woman lost her life because of their idiocy, and now they are essentially losing their lives because of their idiocy."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Jack in the Box to close up to 200 restaurants, explore sale of Del Taco brand",
            "external_url": "https://www.denver7.com/business/company-news/jack-in-the-box-to-close-up-to-200-restaurants-explore-sale-of-del-taco-brand",
            "upvotes": 211,
            "date": "04/26/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/3477185/2147483647/strip/true/crop/3000x1575+0+220/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Ffb%2F30%2Ff455c6244815a083ae84809c2eeb%2Fap080217028044.jpg",
            "top_comments": [
                "Honestly I'm surprised they survived the 90's, let alone the 00's, and 10's",
                "With the loss of traditional car antenna's, it was only a matter of when",
                "Selling Del Taco? But where am I supposed to get my Fre Shava Cadoo?!\n\nFRE SHAVA CADOOOOOO",
                "Fast food used to be cheap. Not great, just cheap. Now it is still not great, but no longer cheap.",
                "Del Taco that would be a tragedy. That’s the brand they should have kept growing",
                "Nothing beats those 2 for $1 tacos. I'm sure they're more now. They're genuinely good for what they are, it's not just a cost thing.",
                "There are 7 jack in the boxes within 5 miles of me.",
                "Absolutely crying at never having their cat food tacos at 2am after getting hammered again",
                "This is just the beginning of stores shuttering their doors in the USA.\n\nThere is no going back to domestic manufacturing all of the good they imported, not in the short term. It would be a 40-year project.\n\nAs Businesses struggle to keep viable chains and locations open we will see a massive rise in prices. They will not swallow the cost, that's not how capitalism works.",
                "Fun fact, my first job at 14 was del taco in Loma Linda, CA, 1985. I was on 3 hour shifts raking in 3.35 an hour. Greasy thing I remember about that job was the manager would give a homeless guy food (still remember his name, Charles) for cleaning the bathrooms. I also stuck a medium sized cup lid in a hamburger to this dick customer in the drive thru. Of course he came back and wanted to fight me. The same manager protected me threatening to call police."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Russian general killed in car blast hours before US envoy’s Kremlin meeting",
            "external_url": "https://www.theguardian.com/world/2025/apr/25/russian-general-killed-car-blast-hours-before-us-envoy-kremlin-meeting-yaroslav-moskalik",
            "upvotes": 29530,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4beba3175180dee351a337f00ebd19d16476b431/0_512_7846_4708/master/7846.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=61cb3211834c5c69e12d02d112f966b7",
            "top_comments": [
                "Imagine scheduling peace talks and getting met with *“please hold, your general has exploded.”*",
                "Are ya'll just finding out about this? Some dude named Pete texted me about it days ago.",
                "He shouldn't have provoked the bomb, if he didn't want to be blown up.",
                "Was he supposed to meet with Vance. He’s the harbinger of death",
                "First thing I thought was, who did it. Ukrainians, anti war Russians, or Putin himself?",
                "Oh well. No harm done.",
                "Ukraine lurking in the Signal chats.",
                "[removed]",
                "Looks better than a window lintel, doesn't it?",
                "Have they tried asking the the bomb to \"STOP IT\"?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Former congressman George Santos sentenced to 7 years in prison",
            "external_url": "https://www.bbc.co.uk/news/articles/c3r838v4xddo?fbclid=PAQ0xDSwJ5qgZleHRuA2FlbQIxMQABp-3W-D34UH6mWI5Ero6r5sNrKzNNT32-XslViUSuoWh-PEbvMca_ZPUElujI_aem_4tOymo_CJKWKQSiJaT1hTA",
            "upvotes": 106,
            "date": "04/26/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/385f/live/0836c3c0-215c-11f0-a8a4-05d8576cd994.jpg",
            "top_comments": [
                "Pardon incoming in 3... 2...",
                "One less grifter for us to deal with.",
                "We can do it to this guy but not the orange fella? What a weird world",
                "Remanded immediately I hope",
                "I can't wait to read his tell-all when he gets released! /s",
                "As a fellow Brazilian I can tell you there def was a smug maga crowd here that thought because they were rich and called themselves maga that they would be thought of as “one of their own” and could get away with crimes like they did. \nHe learned the hard way he was not."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "At least 281 injured after explosion at Port in Iran",
            "external_url": "https://www.reuters.com/world/middle-east/least-47-injured-after-explosion-port-irans-bandar-abbas-2025-04-26/",
            "upvotes": 25,
            "date": "04/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I thought that was a tornado in the picture at first."
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "NEW",
            "title": "Jack in the Box to close up to 200 restaurants, explore sale of Del Taco brand",
            "external_url": "https://www.denver7.com/business/company-news/jack-in-the-box-to-close-up-to-200-restaurants-explore-sale-of-del-taco-brand",
            "upvotes": 212,
            "date": "04/26/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/3477185/2147483647/strip/true/crop/3000x1575+0+220/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Ffb%2F30%2Ff455c6244815a083ae84809c2eeb%2Fap080217028044.jpg",
            "top_comments": [
                "Honestly I'm surprised they survived the 90's, let alone the 00's, and 10's",
                "With the loss of traditional car antenna's, it was only a matter of when",
                "Selling Del Taco? But where am I supposed to get my Fre Shava Cadoo?!\n\nFRE SHAVA CADOOOOOO",
                "Fast food used to be cheap. Not great, just cheap. Now it is still not great, but no longer cheap.",
                "Del Taco that would be a tragedy. That’s the brand they should have kept growing",
                "Nothing beats those 2 for $1 tacos. I'm sure they're more now. They're genuinely good for what they are, it's not just a cost thing.",
                "There are 7 jack in the boxes within 5 miles of me.",
                "Absolutely crying at never having their cat food tacos at 2am after getting hammered again",
                "This is just the beginning of stores shuttering their doors in the USA.\n\nThere is no going back to domestic manufacturing all of the good they imported, not in the short term. It would be a 40-year project.\n\nAs Businesses struggle to keep viable chains and locations open we will see a massive rise in prices. They will not swallow the cost, that's not how capitalism works.",
                "Fun fact, my first job at 14 was del taco in Loma Linda, CA, 1985. I was on 3 hour shifts raking in 3.35 an hour. Greasy thing I remember about that job was the manager would give a homeless guy food (still remember his name, Charles) for cleaning the bathrooms. I also stuck a medium sized cup lid in a hamburger to this dick customer in the drive thru. Of course he came back and wanted to fight me. The same manager protected me threatening to call police."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Virginia Giuffre, one of Jeffrey Epstein's most prominent abuse survivors, dies by suicide",
            "external_url": "https://www.nbcnews.com/news/us-news/virginia-giuffre-one-jeffrey-epsteins-prominent-abuse-survivors-dies-s-rcna203027",
            "upvotes": 45168,
            "date": "04/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-01/240104-virginia-giuffre-mn-1000-4fe9be.jpg",
            "top_comments": [
                "[removed]",
                "Thank you Virginia for speaking out. May you rest in peace now.",
                "*\"Virginia was a fierce warrior in the fight against sexual abuse and sex trafficking. She was the light that lifted so many survivors,\" the statement said. “In the end, the toll of abuse is so heavy that it became unbearable for Virginia to handle its weight.\"*\n\nGiuffre's abuse was ultimately beyond her because it started so early in her life as she victimized by family, friends and life in the streets all of which drove into Epstein's even deeper trap. But what endless courage to get out.",
                "i thought she was just in an auto accident and was claiming she only had days to live. Was that someone else? No i just checked, it was her, and she got out of the hospital for that and was making a recovery.\n\nwhat an odd sequence of events.",
                "She deserved so much better from this world. RIP.",
                "She’s the only reason Prince Andrew was exposed. Virginia was an American, and not subject to the Crown.\n\nRIP Virginia. Thank you for your bravery and I’m sorry this world wasn’t kinder to you. You deserved better.",
                ">At the age of 14, Giuffre reunited with her father and returned to live with him. Her father worked as a maintenance manager at the Mar-a-Lago property owned by Donald Trump, and also helped Giuffre obtain a job there.\n\nJust in case anyone needs a refresher on how and where Maxwell/Epstein ~~recruited~~ trafficked her from.",
                "I wonder how many other victims of his abuse have died this way.  People think you get better as you get older but it can damage you the rest of your life.   Brave girl.  Saved unknown from being their victims.",
                "The bad guys are winning.",
                "Virginia was the epitome of courage. Her death by suicide is heartbreaking, but I pray she is finally at peace."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Son of CIA deputy director was killed while fighting for Russia, report says | CIA",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/25/michael-alexander-gloss-cia-russia",
            "upvotes": 11872,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/08647fff3a32cb2f39cfcf68feff7e7f13abd216/0_33_1577_946/master/1577.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=040661ae85285a70377d84480d1f7f0f",
            "top_comments": [
                "You'd think that was something that would come up in a routine background check for any position at the CIA.",
                "Ok, so that IS weird, right?",
                "Died doing what he loved, being a fucking idiot.",
                "Loved homeland and hated fascism. Fought and died for Putin in the rare conflict that the US is 100 percent on the right side. This makes no fucking sense. This dude must be a really confused individual. Or maybe Russian disinformation machine is just that good. ",
                "This is such an odd story. The dude was apparently pro Russia and pro Palestine. In university, he championed gender equality and was very upset with the way the US supported Israel. \n\nHow the fuck can you have all those views and then go fight for Putin? I'm flabbergasted. Flummoxed.",
                "So he was an \"America Bad\" left-wing contrarian who hated \"imperialism\" so much that he gave his life to support a Russian war of expansion.\n\nThis is your brain on social media",
                "he was a tankie, for anyone wondering what he was doing supporting russia.\n\nTheres also a screenshot (allegedly) from an FPV drone floating around, moments before it strikes him in the face",
                "Investigate the CIA deputy director now!",
                "Good, another treasonous traitor not burdening this country. He made his choice, now he gets to die with it. ",
                "McCarthyism would have had this dude for breakfast"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Purdue University's Boilermaker Special mascot involved in deadly collision",
            "external_url": "https://abcnews.go.com/US/purdue-university-boilermaker-special-mascot-crash-indiana/story?id=121160627",
            "upvotes": 345,
            "date": "04/25/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/3bd11f29-f111-4ae7-adbc-3305b1a8d1ef/boilermaker-gty-jt-250425_1745591116777_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "It's a truck designed to look like a steam engine. It's cowcatcher appears to lift up for street travel.",
                "[removed]",
                "there are a few things that kind of stick out to me on this. why do they drive it at highway speeds? why is a 20 year old driving it? \n\nit all sounds like it was an accident just waiting to happen.\n\ni might could see a 20 year old driving it if they were just driving it around for a game, and maybe doing less than 20 mph or so. but driving it on the highway?!"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Man convicted of first-degree murder in rock-throwing death of Colorado driver",
            "external_url": "https://apnews.com/article/throwing-rock-car-denver-colorado-trial-05c84344aa9dfa7fcf88c644a616c6f2",
            "upvotes": 3580,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Guys... They weren't like throwing innocent little pebbles like some kid prank....\n\nthey were throwing 9lb landscaping sized rocks from their truck, one that smashed Alexa's head!!!?!??\n\nPure fucking evil.\n\nhttps://denvergazette.com/news/courts/colorado-first-responder-trauma-suffered-alexa-bartell-homicide/article_d71d5dc8-d38b-445c-9989-adfe73018d6a.amp.html",
                "> After seeing Bartell’s car leave the road after being hit, the three friends circled back a few times to look again, according to testimony and investigators. One of them, Kwak, took a photo as a memento but no one checked on the driver or called for help, according to their testimony.\n\n> Bartell’s body would not be discovered until her girlfriend, Jenna Griggs, who was on the phone with her that night when the call abruptly cut out, tracked her phone to the field, she testified.\n\ntl;dr: Not only did they do this, they had saw the results, had the chance to save them... not only didn't, but took a photo and just left them there.\n\nEdit: Fixed, ty jojo",
                "Shit like this makes your blood boil. I cannot imagine how I'd feel if a loved one died to this kind of absolutely senseless buffoonery. Fuck them all. Throw the whole damn kitchen sink.",
                "Wow, finally pieces of crap like this get sentences that fit the crime",
                "\"...but also stressed that none of the three had intended to hurt anyone.\"\n\nWhat did they intend when they threw a rock at the windscreen of a moving car? \n\nAfter it crashed and they took a photo of the wreck, then left without calling for an ambulance, were they still not intending any hurt?",
                "The detail “the friends agreed to not talk to anyone after the event” is actually super important in these cases. It signifies that they had some understanding between right and wrong during the moment of the crime. This makes it almost impossible to make an insanity argument, which the defense attorney most definitely would have attempted on the basis of his “borderline personality disorder.”",
                ">Karol-Chik testified that Koenig seemed “excited” as they drove by Bartell’s car and at one point made a “whoop” sound.\n\n>“It sounded like him celebrating,” said Karol-Chik, who admitted he had placed the fatal rock next to Koenig so he could grab it and throw it as he drove.\n\nThankfully I will never understand these sorts of people.",
                "Genuinely (and pleasantly) surprised the other two are also receiving actual lengthy sentences. Seems like it’s always “pled guilty to second degree murder, sentenced to time served”.",
                "*After seeing Bartell’s car leave the road after being hit, the three friends circled back a few times to look again, according to testimony and investigators. One of them, Kwak,* [*took a photo*](https://apnews.com/article/colorado-driver-rock-throwing-death-9ed6bb5ef63212cd58a6d51e94596f18) *as a memento but no one checked on the driver or called for help, according to their testimony.*\n\nThis Kwak action seems almost as callous as throwing the fateful stone. But Bartell's mother, while happy that justice for her daughter was achieved, still felt mixed emotions and some sympathy with the defendants plight.",
                "When my older sister was a baby, my parents took her to the zoo and had her in a stroller. There’s a tall bridge that goes over part of the zoo. Some idiot threw a hubcap off of the bridge and it landed within 10’ of my parents & sister. So fucking reckless and idiotic to do.\n\nThis woman lost her life because of their idiocy, and now they are essentially losing their lives because of their idiocy."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "ICE is reversing termination of legal status for international students around US, lawyers say",
            "external_url": "https://apnews.com/article/international-student-status-restored-9e8a7cb90f4193ec52bf06edc5094cd9",
            "upvotes": 5846,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Monday headlines: Trump tells ICE to revoke legal status.  Tuesday headline- ICE reverts status once again.",
                "It's not going to matter much. The uncertainty around it just makes everything worse.\n\nWe have an administration who shrugs when they accidentally deport the wrong person, actively goes after judges in every way they can, and I wouldn't be surprised to see issuing brown boots to ICE.\n\nThe world has seen what we are becoming, even if a dark part of our own population is in denial about it.",
                "I’m tired of hearing fatalist remarks about how this doesn’t matter. We can’t secede our power and need to keep the fight going. Inch by inch, if necessary. This is a good sign that the administration is responding to legal action and pushback.",
                "This was always evil and cruel. \n\nBut on a dumber level, this shit is WASTEFUL and EXPENSIVE. \n\nThis messy administration and DOGE boys will cost us billions and billions at the end of the day. Because all of this costs us time and money.",
                "The protests are working. If you go to them, keep it up.",
                "Lol they are about to find out how much international students' exorbitant tuitions subsidy domestic students'. You think paying for colleges as an American is too expensive? Without international students you're gonna pay double the current rate.",
                "So, basically... \"We have absolutely no legal foundation for our actions, so rather than set a legal precedent we'll just voluntarily reverse our decision.\"\n\nI'm hardly an expert on such matters, but from what I understand from credible sources, is that even if your student visa is terminated, you're legally allowed to remain in the country as long as you're enrolled at a school. I presume at least until the end of the current term, then you're expected to either get a new visa or leave.",
                "Because it is illegal to do since none committed a crime.",
                "For everyone saying the courts are doing nothing but giving strong rebukes - this is a result of what's happening in those cases. This isn't a sudden inexplicable about face it's being framed as, this is because they are *losing those cases*.  The judiciary isn't laying down and taking it.",
                " Trumps goons were acting unlawfully. Colour me surprised."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Elon Musk's social media platform X sues Minnesota over political deepfake ban | MPR News",
            "external_url": "https://www.mprnews.org/episode/2025/04/24/elon-musk-social-media-platform-x-sues-minnesota-political-deepfake-ban",
            "upvotes": 5732,
            "date": "04/25/2025",
            "thumbnail": "https://img.apmcdn.org/caab343605b8e3130e9316b76da4c3fc3f3bafd5/widescreen/fec767-20250330-wisconsin-supreme-court-2000.jpg",
            "top_comments": [
                "So Elon musk, who has several years worth of history of posting nazi propaganda on Twitter, is sueing because a law saw people can't use AI to create deepfakes to intentionally spread political misinformation.\n\nI mean, aside from all the other awful shit he has done, does anyone really need anymore proof musk is an evil narcissistic psycho?",
                "In the spirit of Musk's concerns: Never, ever stop creating and posting deep fakes of Elon Musk openly bragging about rigging the 2024 election.",
                "Musk is only filing suit because he personally would be responsible for generating most of it.",
                "Sueing to spread political disinformation sounds like a stupid idea and only proves that you and your platform shouldn't be trusted.",
                "He's suing for the right to deliberately mislead and lie to people. P. O. S.",
                "That guy is a taint barnacle",
                "He's such a little bitch. \nJust a complete coward on every fucking level.",
                "I'm so sick of malignant narcissist billionaires.\n\n*I apologize for being redundant though.*",
                "This would only matter to someone who wants to cheat.",
                "Elons just doing this to fuck with Tim Walz"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Luigi Mangione pleads not guilty in federal court to murder of UnitedHealthcare CEO",
            "external_url": "https://www.cnbc.com/2025/04/25/luigi-mangione-pleads-not-guilty-in-federal-court-to-murder-of-unitedhealthcare-ceo.html",
            "upvotes": 8129,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108105907-17401702152025-02-21t203147z_180253610_rc22zcaawdld_rtrmadp_0_unitedhealth-ceo.jpeg?v=1740170306&w=1920&h=1080",
            "top_comments": [
                "Death penalty for thee, but not for the guy that killed 12 people recently in a shooting.",
                "Well that’s good enough for me, knock it down to rolling a stop sign and cut him loose.",
                "The aristocracy is really unhappy that one of their own was targeted, and public sentiment leaned towards the attacker. They're trying to make an example of him. Mass murdering terrorists didn't catch federal charges with a death penalty.",
                "Why did his case even go to federal court when it all happened in New York?",
                "Now bring the real murderers to trial - Health Insurance CEOs and their Boards.",
                "How about we split the difference and call it medical malpractice?",
                "We're all looking for the guy that did this.",
                "Think they are really pushing that \"innocent man\" jargon. The CEO of UnitedHealthcare was NOT an innocent man by any means. \n\nI think pretty much everyone  in health insurance company leadership roles need  criminal charges for \"theft by deception\" and should be charged for manslaughter for all the people that died bc they were unable to be diagnosed and/or treated for the illnesses and injuries that killed them, bc the insurance companies wouldn't cover the testing/diagnostics/treatment. \n\nAnd I think if our elected reps had the same type of health insurance we did, they would change their tune pretty quick.",
                "my man didn’t do shit",
                "This really isn't newsworthy. It's a procedural necessity to plead not guilty to keep the case going, get disclosure, discuss the state's evidence with counsel. 99% of felony guilty pleas start with a plea of not guilty. This is a nothing burger."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Jack in the Box to close up to 200 restaurants, explore sale of Del Taco brand",
            "external_url": "https://www.denver7.com/business/company-news/jack-in-the-box-to-close-up-to-200-restaurants-explore-sale-of-del-taco-brand",
            "upvotes": 214,
            "date": "04/26/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/3477185/2147483647/strip/true/crop/3000x1575+0+220/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Ffb%2F30%2Ff455c6244815a083ae84809c2eeb%2Fap080217028044.jpg",
            "top_comments": [
                "Honestly I'm surprised they survived the 90's, let alone the 00's, and 10's",
                "With the loss of traditional car antenna's, it was only a matter of when",
                "Selling Del Taco? But where am I supposed to get my Fre Shava Cadoo?!\n\nFRE SHAVA CADOOOOOO",
                "Fast food used to be cheap. Not great, just cheap. Now it is still not great, but no longer cheap.",
                "Del Taco that would be a tragedy. That’s the brand they should have kept growing",
                "Nothing beats those 2 for $1 tacos. I'm sure they're more now. They're genuinely good for what they are, it's not just a cost thing.",
                "There are 7 jack in the boxes within 5 miles of me.",
                "Absolutely crying at never having their cat food tacos at 2am after getting hammered again",
                "This is just the beginning of stores shuttering their doors in the USA.\n\nThere is no going back to domestic manufacturing all of the good they imported, not in the short term. It would be a 40-year project.\n\nAs Businesses struggle to keep viable chains and locations open we will see a massive rise in prices. They will not swallow the cost, that's not how capitalism works.",
                "Fun fact, my first job at 14 was del taco in Loma Linda, CA, 1985. I was on 3 hour shifts raking in 3.35 an hour. Greasy thing I remember about that job was the manager would give a homeless guy food (still remember his name, Charles) for cleaning the bathrooms. I also stuck a medium sized cup lid in a hamburger to this dick customer in the drive thru. Of course he came back and wanted to fight me. The same manager protected me threatening to call police."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Virginia Giuffre, one of Jeffrey Epstein's most prominent abuse survivors, dies by suicide",
            "external_url": "https://www.nbcnews.com/news/us-news/virginia-giuffre-one-jeffrey-epsteins-prominent-abuse-survivors-dies-s-rcna203027",
            "upvotes": 45179,
            "date": "04/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-01/240104-virginia-giuffre-mn-1000-4fe9be.jpg",
            "top_comments": [
                "[removed]",
                "Thank you Virginia for speaking out. May you rest in peace now.",
                "*\"Virginia was a fierce warrior in the fight against sexual abuse and sex trafficking. She was the light that lifted so many survivors,\" the statement said. “In the end, the toll of abuse is so heavy that it became unbearable for Virginia to handle its weight.\"*\n\nGiuffre's abuse was ultimately beyond her because it started so early in her life as she victimized by family, friends and life in the streets all of which drove into Epstein's even deeper trap. But what endless courage to get out.",
                "i thought she was just in an auto accident and was claiming she only had days to live. Was that someone else? No i just checked, it was her, and she got out of the hospital for that and was making a recovery.\n\nwhat an odd sequence of events.",
                "She deserved so much better from this world. RIP.",
                "She’s the only reason Prince Andrew was exposed. Virginia was an American, and not subject to the Crown.\n\nRIP Virginia. Thank you for your bravery and I’m sorry this world wasn’t kinder to you. You deserved better.",
                ">At the age of 14, Giuffre reunited with her father and returned to live with him. Her father worked as a maintenance manager at the Mar-a-Lago property owned by Donald Trump, and also helped Giuffre obtain a job there.\n\nJust in case anyone needs a refresher on how and where Maxwell/Epstein ~~recruited~~ trafficked her from.",
                "I wonder how many other victims of his abuse have died this way.  People think you get better as you get older but it can damage you the rest of your life.   Brave girl.  Saved unknown from being their victims.",
                "The bad guys are winning.",
                "Virginia was the epitome of courage. Her death by suicide is heartbreaking, but I pray she is finally at peace."
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "RISING",
            "title": "Son of CIA deputy director was killed while fighting for Russia, report says | CIA",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/25/michael-alexander-gloss-cia-russia",
            "upvotes": 11877,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/08647fff3a32cb2f39cfcf68feff7e7f13abd216/0_33_1577_946/master/1577.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=040661ae85285a70377d84480d1f7f0f",
            "top_comments": [
                "You'd think that was something that would come up in a routine background check for any position at the CIA.",
                "Ok, so that IS weird, right?",
                "Died doing what he loved, being a fucking idiot.",
                "Loved homeland and hated fascism. Fought and died for Putin in the rare conflict that the US is 100 percent on the right side. This makes no fucking sense. This dude must be a really confused individual. Or maybe Russian disinformation machine is just that good. ",
                "This is such an odd story. The dude was apparently pro Russia and pro Palestine. In university, he championed gender equality and was very upset with the way the US supported Israel. \n\nHow the fuck can you have all those views and then go fight for Putin? I'm flabbergasted. Flummoxed.",
                "So he was an \"America Bad\" left-wing contrarian who hated \"imperialism\" so much that he gave his life to support a Russian war of expansion.\n\nThis is your brain on social media",
                "he was a tankie, for anyone wondering what he was doing supporting russia.\n\nTheres also a screenshot (allegedly) from an FPV drone floating around, moments before it strikes him in the face",
                "Investigate the CIA deputy director now!",
                "Good, another treasonous traitor not burdening this country. He made his choice, now he gets to die with it. ",
                "McCarthyism would have had this dude for breakfast"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Former Rep. George Santos sentenced to 87 months in New York federal fraud case",
            "external_url": "https://www.cnbc.com/2025/04/25/george-santos-fraud-sentence-congress.html",
            "upvotes": 33109,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136734-17455932402025-04-25t145727z_1834006727_rc225eatuykw_rtrmadp_0_usa-congress-santos.jpeg?v=1745609921&w=1920&h=1080",
            "top_comments": [
                "What a way to treat the man who not only founded New York, but built Central Park with his own three hands.",
                "Former Rep. George Santos, whose web of [lies](https://www.cnbc.com/2023/01/19/rep-george-santos-pushes-back-on-insane-reports-he-took-funds-for-veterans-dying-dog.html) about his life led to his expulsion from Congress, was sentenced Friday to more than seven years in prison in his federal fraud case.\n\nThe New York Republican must also pay restitution of $373,750, a judge ruled in U.S. District Court in Long Island.\n\nSantos admitted last August to engaging in a multi-pronged campaign finance scheme, stealing unemployment benefits during the Covid-19 pandemic, and lying on House financial disclosure forms.\n\nAs part of an agreement with prosecutors, Santos pleaded guilty to a single count each of wire fraud and aggravated identity theft. He also agreed to restitution and forfeiture totaling nearly $580,000.",
                "George Santos is, hands down, the best minor villain America has ever seen. His story is absolutely wild. And not merely because he has a drag-queen alter ego, [Kitara Rivache](https://www.nbcnews.com/nbc-out/out-politics-and-policy/george-santos-says-will-revive-drag-queen-persona-cameo-rcna149867).\n\nThe Republican party is an organized crime syndicate. Like the mob, [the GOP happily protected Santos from expulsion](https://apnews.com/article/george-santos-expel-house-republicans-new-york-249bd2341d157bc6727b77607d8d45ae) when he merely deceived voters with financial fraud.\n\nBut, Santos broke the most important rule in organized crime: don't steal from the mob. [Santos sent emails to Senator Kevin McCarthy's wealthy donors claiming to be McCarthy's fundraiser. Santos siphoned money from McCarthy's campaign into his own](https://www.cnbc.com/2023/01/09/george-santos-raised-money-from-wealthy-gop-donors-while-lying-about-his-resume.html).\n\nThat was the last straw. [Republicans joined Democrats in a second ethics vote against Santos, successfully removing the disgraced representative from Congress](https://www.cbsnews.com/news/who-voted-to-expel-george-santos/).",
                "Federal?\n\nI give it 48 hours until he's pardoned.",
                "Does Vegas have over under on how long he actually spends in prison and is it .5 days cause at this rate I feel it’s more likely the judge who sentenced him somehow is arrested some made up charges than this guy seeing a cell.",
                "The same George Santos that built Rome in a couple days?",
                "Former President Santos going to prison, wow. ",
                "his father, the inventor of toaster strudel, will not be very happy with this.",
                "To all the snarky “he’s gonna get pardoned” comments, no he fucking isn’t lol. This dude was an absolute nobody before coming into the picture and deeply embarrassed a lot of really powerful people. I could be mistaken but I don’t think a single republican has spoken up in defense of Santos with any meaningful weight beyond maybe a broad platitude about democrats being worse or something. If he didn’t plead guilty they would have 100% thrown the book at him.",
                "Man singlehandedly built this country, and this is how he's treated. Smdh."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "FBI arrests Wisconsin judge for alleged immigration arrest obstruction",
            "external_url": "https://www.cnbc.com/2025/04/25/fbi-arrest-judge-hannah-dugan-milwaukee.html",
            "upvotes": 55706,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136765-17455967922025-04-25t155724z_1252469857_rc235eacvo1d_rtrmadp_0_usa-fbi-judge.jpeg?v=1745623100&w=1920&h=1080",
            "top_comments": [
                "That's 2 judges in 2 days.",
                "Meanwhile, trump recently pardoned a judge in Nevada who committed fraud related to a ~~veterans charity~~ honoring a slain police officer. \n\nIf that didn’t enrage you enough, that judge had no law degree and said she was looking forward to getting back on the bench.\n\nEdit: she stole money that was supposed to go to a fund for a slain officer for personal expenses.....like plastic surgery. \n\nFrom ABC\n\n*President Trump has pardoned a Las Vegas politician convicted last year of using money meant for a statue honoring a slain police officer on personal costs, including plastic surgery.*\n\n*Michele Fiore, a former city councilwoman and Nevada state lawmaker, was* [*found guilty in October*](https://apnews.com/article/republican-michele-fiore-guilty-wire-fraud-nevada-5844d79dacf0bfd6b43d36e03eb6cd95) *of six counts of federal wire fraud and one count of conspiracy to commit wire fraud. She was out of custody ahead of a sentencing scheduled for next month.*\n\n*Federal prosecutors alleged during trial that Fiore, 54, had raised more than $70,000 for the statue of a Las Vegas police officer who was fatally shot in 2014 in the line of duty, but had instead spent some of the funds on cosmetic surgery, rent and her daughter's wedding.*\n\n*Fiore, who does not have a law degree, was appointed as a judge in deep-red Nye County in 2022 shortly after she lost her campaign for state treasurer. She was elected in June 2024 to complete the unexpired term of a judge who died but had been suspended without pay amid her legal troubles. Pahrump is an hour's drive west of Las Vegas.*",
                "Is this record time to go from \"Stop overreacting\" to \"we are literally arresting judges\"",
                "Find this beyond alarming given he fully pardoned a judge in Nevada who was caught red handed pocketing money raised for a police memorial. Was an open and shut case. \n\nShe said it was god’s doing and borderline called Trump a deity. I shit you not. She’s back in court like next week.",
                "Just want to add a historical note that in the Declaration of Independence there is a mention that if a government becomes oppressive, the people have the right to abolish it.",
                "So Trump is sending his crony at the FBI, Kash Patel, to arrest judges standing up to him.\n\n*Yeah, that's definitely the sign of a properly functioning democracy.*",
                "Guys? You're under reacting. way under reacting",
                "Everyone in this administration deserves to end up in prison when this is all over. ",
                "Time for the National Strikes to begin. If they are arresting judges now for upholding the law, there is nothing left for this country. Time to shut it all down.",
                ">Patel wrote on X that the FBI believes Milwaukee Circuit Court Judge Hannah Dugan “intentionally misdirected federal agents away” from Eduardo Flores Ruiz as agents were attempting to arrest him at her courthouse last week.\n\nIt’s not what you believe, it’s what you can prove. It will be interesting to see what kind of case they have but my money is on the FBI over reaching here."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Luigi Mangione pleads not guilty in federal court to murder of UnitedHealthcare CEO",
            "external_url": "https://www.cnbc.com/2025/04/25/luigi-mangione-pleads-not-guilty-in-federal-court-to-murder-of-unitedhealthcare-ceo.html",
            "upvotes": 8130,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108105907-17401702152025-02-21t203147z_180253610_rc22zcaawdld_rtrmadp_0_unitedhealth-ceo.jpeg?v=1740170306&w=1920&h=1080",
            "top_comments": [
                "Death penalty for thee, but not for the guy that killed 12 people recently in a shooting.",
                "Well that’s good enough for me, knock it down to rolling a stop sign and cut him loose.",
                "The aristocracy is really unhappy that one of their own was targeted, and public sentiment leaned towards the attacker. They're trying to make an example of him. Mass murdering terrorists didn't catch federal charges with a death penalty.",
                "Why did his case even go to federal court when it all happened in New York?",
                "Now bring the real murderers to trial - Health Insurance CEOs and their Boards.",
                "How about we split the difference and call it medical malpractice?",
                "We're all looking for the guy that did this.",
                "Think they are really pushing that \"innocent man\" jargon. The CEO of UnitedHealthcare was NOT an innocent man by any means. \n\nI think pretty much everyone  in health insurance company leadership roles need  criminal charges for \"theft by deception\" and should be charged for manslaughter for all the people that died bc they were unable to be diagnosed and/or treated for the illnesses and injuries that killed them, bc the insurance companies wouldn't cover the testing/diagnostics/treatment. \n\nAnd I think if our elected reps had the same type of health insurance we did, they would change their tune pretty quick.",
                "my man didn’t do shit",
                "This really isn't newsworthy. It's a procedural necessity to plead not guilty to keep the case going, get disclosure, discuss the state's evidence with counsel. 99% of felony guilty pleas start with a plea of not guilty. This is a nothing burger."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "ICE is reversing termination of legal status for international students around US, lawyers say",
            "external_url": "https://apnews.com/article/international-student-status-restored-9e8a7cb90f4193ec52bf06edc5094cd9",
            "upvotes": 5850,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Monday headlines: Trump tells ICE to revoke legal status.  Tuesday headline- ICE reverts status once again.",
                "It's not going to matter much. The uncertainty around it just makes everything worse.\n\nWe have an administration who shrugs when they accidentally deport the wrong person, actively goes after judges in every way they can, and I wouldn't be surprised to see issuing brown boots to ICE.\n\nThe world has seen what we are becoming, even if a dark part of our own population is in denial about it.",
                "I’m tired of hearing fatalist remarks about how this doesn’t matter. We can’t secede our power and need to keep the fight going. Inch by inch, if necessary. This is a good sign that the administration is responding to legal action and pushback.",
                "This was always evil and cruel. \n\nBut on a dumber level, this shit is WASTEFUL and EXPENSIVE. \n\nThis messy administration and DOGE boys will cost us billions and billions at the end of the day. Because all of this costs us time and money.",
                "The protests are working. If you go to them, keep it up.",
                "Lol they are about to find out how much international students' exorbitant tuitions subsidy domestic students'. You think paying for colleges as an American is too expensive? Without international students you're gonna pay double the current rate.",
                "So, basically... \"We have absolutely no legal foundation for our actions, so rather than set a legal precedent we'll just voluntarily reverse our decision.\"\n\nI'm hardly an expert on such matters, but from what I understand from credible sources, is that even if your student visa is terminated, you're legally allowed to remain in the country as long as you're enrolled at a school. I presume at least until the end of the current term, then you're expected to either get a new visa or leave.",
                "Because it is illegal to do since none committed a crime.",
                "For everyone saying the courts are doing nothing but giving strong rebukes - this is a result of what's happening in those cases. This isn't a sudden inexplicable about face it's being framed as, this is because they are *losing those cases*.  The judiciary isn't laying down and taking it.",
                " Trumps goons were acting unlawfully. Colour me surprised."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk's social media platform X sues Minnesota over political deepfake ban | MPR News",
            "external_url": "https://www.mprnews.org/episode/2025/04/24/elon-musk-social-media-platform-x-sues-minnesota-political-deepfake-ban",
            "upvotes": 5731,
            "date": "04/25/2025",
            "thumbnail": "https://img.apmcdn.org/caab343605b8e3130e9316b76da4c3fc3f3bafd5/widescreen/fec767-20250330-wisconsin-supreme-court-2000.jpg",
            "top_comments": [
                "So Elon musk, who has several years worth of history of posting nazi propaganda on Twitter, is sueing because a law saw people can't use AI to create deepfakes to intentionally spread political misinformation.\n\nI mean, aside from all the other awful shit he has done, does anyone really need anymore proof musk is an evil narcissistic psycho?",
                "In the spirit of Musk's concerns: Never, ever stop creating and posting deep fakes of Elon Musk openly bragging about rigging the 2024 election.",
                "Musk is only filing suit because he personally would be responsible for generating most of it.",
                "Sueing to spread political disinformation sounds like a stupid idea and only proves that you and your platform shouldn't be trusted.",
                "He's suing for the right to deliberately mislead and lie to people. P. O. S.",
                "That guy is a taint barnacle",
                "He's such a little bitch. \nJust a complete coward on every fucking level.",
                "I'm so sick of malignant narcissist billionaires.\n\n*I apologize for being redundant though.*",
                "This would only matter to someone who wants to cheat.",
                "Elons just doing this to fuck with Tim Walz"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Man convicted of first-degree murder in rock-throwing death of Colorado driver",
            "external_url": "https://apnews.com/article/throwing-rock-car-denver-colorado-trial-05c84344aa9dfa7fcf88c644a616c6f2",
            "upvotes": 3578,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Guys... They weren't like throwing innocent little pebbles like some kid prank....\n\nthey were throwing 9lb landscaping sized rocks from their truck, one that smashed Alexa's head!!!?!??\n\nPure fucking evil.\n\nhttps://denvergazette.com/news/courts/colorado-first-responder-trauma-suffered-alexa-bartell-homicide/article_d71d5dc8-d38b-445c-9989-adfe73018d6a.amp.html",
                "> After seeing Bartell’s car leave the road after being hit, the three friends circled back a few times to look again, according to testimony and investigators. One of them, Kwak, took a photo as a memento but no one checked on the driver or called for help, according to their testimony.\n\n> Bartell’s body would not be discovered until her girlfriend, Jenna Griggs, who was on the phone with her that night when the call abruptly cut out, tracked her phone to the field, she testified.\n\ntl;dr: Not only did they do this, they had saw the results, had the chance to save them... not only didn't, but took a photo and just left them there.\n\nEdit: Fixed, ty jojo",
                "Shit like this makes your blood boil. I cannot imagine how I'd feel if a loved one died to this kind of absolutely senseless buffoonery. Fuck them all. Throw the whole damn kitchen sink.",
                "Wow, finally pieces of crap like this get sentences that fit the crime",
                "\"...but also stressed that none of the three had intended to hurt anyone.\"\n\nWhat did they intend when they threw a rock at the windscreen of a moving car? \n\nAfter it crashed and they took a photo of the wreck, then left without calling for an ambulance, were they still not intending any hurt?",
                "The detail “the friends agreed to not talk to anyone after the event” is actually super important in these cases. It signifies that they had some understanding between right and wrong during the moment of the crime. This makes it almost impossible to make an insanity argument, which the defense attorney most definitely would have attempted on the basis of his “borderline personality disorder.”",
                ">Karol-Chik testified that Koenig seemed “excited” as they drove by Bartell’s car and at one point made a “whoop” sound.\n\n>“It sounded like him celebrating,” said Karol-Chik, who admitted he had placed the fatal rock next to Koenig so he could grab it and throw it as he drove.\n\nThankfully I will never understand these sorts of people.",
                "Genuinely (and pleasantly) surprised the other two are also receiving actual lengthy sentences. Seems like it’s always “pled guilty to second degree murder, sentenced to time served”.",
                "*After seeing Bartell’s car leave the road after being hit, the three friends circled back a few times to look again, according to testimony and investigators. One of them, Kwak,* [*took a photo*](https://apnews.com/article/colorado-driver-rock-throwing-death-9ed6bb5ef63212cd58a6d51e94596f18) *as a memento but no one checked on the driver or called for help, according to their testimony.*\n\nThis Kwak action seems almost as callous as throwing the fateful stone. But Bartell's mother, while happy that justice for her daughter was achieved, still felt mixed emotions and some sympathy with the defendants plight.",
                "When my older sister was a baby, my parents took her to the zoo and had her in a stroller. There’s a tall bridge that goes over part of the zoo. Some idiot threw a hubcap off of the bridge and it landed within 10’ of my parents & sister. So fucking reckless and idiotic to do.\n\nThis woman lost her life because of their idiocy, and now they are essentially losing their lives because of their idiocy."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Russian general killed in car blast hours before US envoy’s Kremlin meeting",
            "external_url": "https://www.theguardian.com/world/2025/apr/25/russian-general-killed-car-blast-hours-before-us-envoy-kremlin-meeting-yaroslav-moskalik",
            "upvotes": 29519,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4beba3175180dee351a337f00ebd19d16476b431/0_512_7846_4708/master/7846.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=61cb3211834c5c69e12d02d112f966b7",
            "top_comments": [
                "Imagine scheduling peace talks and getting met with *“please hold, your general has exploded.”*",
                "Are ya'll just finding out about this? Some dude named Pete texted me about it days ago.",
                "He shouldn't have provoked the bomb, if he didn't want to be blown up.",
                "Was he supposed to meet with Vance. He’s the harbinger of death",
                "First thing I thought was, who did it. Ukrainians, anti war Russians, or Putin himself?",
                "Oh well. No harm done.",
                "Ukraine lurking in the Signal chats.",
                "[removed]",
                "Looks better than a window lintel, doesn't it?",
                "Have they tried asking the the bomb to \"STOP IT\"?"
            ],
            "aggregate_sentiment": 60.0
        }
    ],
    "last_updated": "04/26/2025 12:13:53 UTC"
}