{
    "posts": [
        {
            "category": "HOT",
            "title": "SEC continuing $150 million lawsuit against Elon Musk over Twitter purchase",
            "external_url": "https://abcnews.go.com/US/sec-continuing-150-million-lawsuit-elon-musk-twitter/story?id=120343524",
            "upvotes": 42645,
            "date": "03/31/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/4e6250cc-4123-4551-b325-04f24c8dc133/elon-musk-5-gty-gmh-250324_1742835839454_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Unless they bump that up to 150 billion, this is a symbolic gesture at best.  Dude spent 150 million on election tampering in the past week.",
                "It's.... depressing.. that I even have to ask if the SEC is one of the things Musk is using DOGE to gut, because it's one of the places that is a check on him.\n\nI'm going to say ehhhh.... probably. Probably it is. That's our timeline.",
                "Sounds like doge will be making another round of cuts at the SEC.",
                "Didn't he just pay himself $43 billion to buy his own company?",
                "150 million to a billionaire is the equivalent to $150 to a thousandaire.\n150 million to a half-trillionaire is about 30 cents by the same scale. \nOnce a fine hits a certain threshold, mandatory jail time needs to be included because the numbers are just meaningless at that point.",
                "*\"They spend their time on s--- like this when there are so many actual crimes that go unpunished,\" Musk said on X in January in response to the SEC's suit.*\n\nThe flimflam man himself. He spends all his time breaking into critical govt agencies, running roughshod over people's privacy, and leeching off (his businesses) govt subsidies, grants, and other freebies  Lock him up",
                "In other news, the FBI has raided the SEC and locked them out of their own buildings permanently.",
                "How much is that translated to normal people money, let’s say with an income of 50k a year? About $20?",
                "Remember, any law that can be paid with a fine less than the amount stolen is not a law at all.",
                "So he's going to fire the SEC now I take it? Canadian here. I'm sure you're going to say he can't do that, and I'm going to counter with look what he's done already. Anything is possible. There are no more laws in the US."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Stocks close out their worst quarter since 2022 amid tariff uncertainty",
            "external_url": "https://www.nbcnews.com/business/markets/stocks-close-worst-quarter-2022-tariff-uncertainty-rcna198956",
            "upvotes": 5427,
            "date": "03/31/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250331-nyse-se-352p-94b957.jpg",
            "top_comments": [
                "Worst quarter so far. We are heading for stagflation or recession.",
                "Elect someone who bankrupted businesses including a casino, what could possibly go wrong?",
                "Worst part about this: It’s ENTIRELY self-inflicted.",
                "And MAGA cheers like the cult they are",
                "Dude gets an absolute full mushroom knowing he can fuck with the global economy, he doesn’t give a shit about the destruction he creates, lives ruined along the way. He is literally the absolute worst person to sit as chief of the USA. This is all self inflicted and completely unnecessary. He is the antichrist, at least until the anti christ comes. \n\nIt's a mess, aint it Sheriff? If it aint it'll do till a mess gets here.” Cormac McCarthy, No Country for Old Men…",
                "No way to have predicted this says only nation where this routinely happens.",
                "Homer Simpson with hand on the shoulder of a depressed looking Bart.\n\nWorst quarter since 2022 so far!",
                "I may not be able to tell you what Trump will do next, but I can tell you, with certainty, that it will be something stupid.",
                "Instead of the title saying *amid tariff uncertainty* it should have said *amid unnecessary tariffs*.",
                "Right-wingers blamed Biden for that in ‘22 and are now dead silent about Trump’s impact on the market. I guess when the economy’s bad, it’s only actually bad if a person you don’t like is President at the time"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "China, Japan, South Korea will jointly respond to US tariffs, Chinese state media says",
            "external_url": "https://www.reuters.com/world/china-japan-south-korea-will-jointly-respond-us-tariffs-chinese-state-media-says-2025-03-31/",
            "upvotes": 32306,
            "date": "03/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It speaks volumes when you get China, Japan and South Korea to unite and agree on something.",
                "Trump successfully uniting the world, against the United States.",
                "America truly unites the world.",
                "It's going to be one hot, long and memorable summer here in America.",
                "Congratulations Republicans, you got our biggest allies against China to team up with China! So much winning!",
                "All three countries are vital to US business as suppliers.\n\nDo the anti-globalists even care that world wide trade made the US the wealthiest country in the world?",
                "What the fuck…. He got South Korea and Japan to work together. With CHINA. To make a statement against the US.\n\nIf it wasn’t so fucking sad and terrifying, I’d almost be impressed.",
                "List of allies we have alienated in less than 3 months:\n\n* Canada\n* Mexico\n* Japan\n* South Korea\n* Ukraine\n* France\n* Denmark\n* Great Britain\n\nDid I miss anyone? Australia?\n\nEDIT: Italy, Spain with the wine tax.\n\nEDIT2: Yeah, all of Europe minus Russia.",
                "Wow it took Donald Trump to get China and South Korea to get over their disdain of Japan and work together.\n\nTrump should get the Nobel Peace Prize.",
                "We’ve somehow managed to unite the trio of hatred between these countries into hating us. It’s actually fucking impressive"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Musk’s Doge gains access to federal payroll system despite staff warnings",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/31/doge-musk-federal-payroll-system",
            "upvotes": 10013,
            "date": "03/31/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e3f43e9cc78633a9e49656eb6107bb486b02293e/0_3_2576_1547/master/2576.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=534e11295e837b3697e20ffbe4f23a49",
            "top_comments": [
                "- The memo, reviewed by the Times, stated that “such elevated access to critical high-value asset systems is rare with respect to individual systems and no single [Department of Interior] official presently has access to all HR, payroll and credentialing systems.”\n\n- The memo emphasized that gaining administrative access to the system “typically requires training and certification”.\n\n- “Without formal qualifications, the Department may experience significant failure because of operator error,” the memo said.\n\nNothing to see here, everything is fine folks. I'm sure these professionals are more than qualified to safeguard almost 275k personnel records. I'm sure nothing bad will ever come of this.",
                "Musk is a threat to all americans.\n\nEdit: musk is a threat to all people.",
                "Facts:\n\n1. Elon Musk is a bitch.\n\n2. Fuck that guy\n\n3. Elon Musk is a threat to America\n\n4. Elon Musk is a huge bitch.",
                "How are republicans spinning this one?",
                "*With this access, the Doge employees now have visibility into sensitive employee information, like social security numbers, and are able to more easily hire and fire federal workers, according to the Times, citing the two people with knowledge who spoke with the newspaper on condition of anonymity due to fear of retribution.*\n\n\"Fear of retribution\" makes sense because this group of henchmen are all about reprisals and power.",
                "We are living a Bond film, where the villain is incompetent, yet with no Bond to stop him, he just ruins a country.  This is such an unbelievable fucking nightmare.",
                "This is such bullshit. The lawless administration thinks they can do whatever they damn well please.",
                "I believe, also, despite court orders. I wonder when the media is just going to start calling them grifters, like they are.",
                "“With this access, the Doge employees now have visibility into sensitive employee information, like social security numbers, and are able to more easily hire and fire federal workers.” … Let that sink in.🤔",
                "Remember only about a month ago when our politicians agreed DOGE shouldn't have access to this info nor have the power to fire people? \n\n\n\nPaychecks have already been delayed. Yet another grim reminder that our democracy is actively being dismantled from the inside while elected officials on BOTH sides cosign this circus."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Elon Musk hands out $1 million payments after Wisconsin Supreme Court declines request to stop him",
            "external_url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-giveaway-cdea66e0dcbaa53dd183e1d10bee2b35",
            "upvotes": 27195,
            "date": "03/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Our candidate is so bad we have to pay you to vote for him.\"",
                "So giving a chance at a million bucks to vote is fine but giving water bottles to people waiting in the heat to vote is wrong?\n\nAgain, an extreme double standard.  It's always and extreme double standard.",
                "It was rigged too. Went to a GOP organizer.",
                "And he still wonders why people hate him",
                "[removed]",
                "Musk is doing this so Schimel can take school lunches away from hungry kids.",
                "Sell your future Social Security benefits for $100.",
                "If he gave away a million per day it would take 900 years for him to give away his fortune.",
                "He could spend his millions and billions on helping people. Instead, he spends money on buying elections. He could fund schools, hospitals and medical bills, helping veterans who lost limbs. But no, he instead spends his money buying politicians in order to gets laws passed so he can more easily commit fraud and leech off the government tax payers.",
                "[removed]"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "NYU canceled talk on USAID cuts for being ‘anti-governmental’, doctor says",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/31/doctor-nyu-usaid-gaza-presentation-canceled",
            "upvotes": 5031,
            "date": "03/31/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d4aae641e16cd4e294bd508ebc2b730dddda9ee/0_200_5986_3592/master/5986.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b87f6a2bfa2c0cebfe69a827ee63fc20",
            "top_comments": [
                "And the fact that Barron Trump is attending NYU has no bearing on this decision...",
                "Fascism really is taking over, huh?",
                "Is *this* cancel culture? ",
                "NYU is rushing to obey the would-be dictator in advance, trying to anticipate what the dictator will want and running out ahead to ensure they are always on the dictator's good side.\n\nThis is the sort of institutional cowardice that makes democratic collapse not only possible, but easy.",
                "Being anti government is completely legal. \nIt was even pretty popular when the people running the government now weren’t running the government",
                "Anti-governmental?  So free speech is truly dead if we can't even criticize our own government.",
                "More like \"we could lose our funding if we let you talk.\"\n\nAnd universities SHOULD be figuring out how to operate without federal funding if they want to keep their self respect.",
                "\"Anti-governmental\" is kind of the whole point of 1st Amendment free speech.",
                "\"Anti-governmental\". So that's the kind of language we're using now? Sounds more like the kind of wording you'd expect in the Soviet Union than the US.",
                "Doctors Without Borders physicians are heroic humanitarians who forgo making lots of money and put themselves in harm's way simply because it's the right thing to do. I worked alongside some of them in Bangaldesh during the Rohingya refugee crisis and was extremely impressed. This is the best of humanity. It's an absolute disgrace that an American university would disinvite their former head over some slides--apparently because they were offensive in their veracity."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Prince Andrew accuser says she has days to live after car crash",
            "external_url": "https://news.sky.com/story/prince-andrew-accuser-says-she-has-days-to-live-after-car-crash-13339369",
            "upvotes": 10812,
            "date": "03/31/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-virginia-roberts-virginia-giuffre_6872295.jpg?20250331161308",
            "top_comments": [
                "As an ICU nurse I’ve never ever ever ever heard a doctor say “you have 4 days to live.” First of all no knows if it’s 1 hour or a month. They can tell you if care is futile and won’t benefit the patient. Having said that, renal failure is not a death sentence. It’s a very difficult life with dialysis catheters and potentially a fistula. There could be intentional deception of lack of understand and fear combined to make that leap. However, her claims against Prince Amdrew have been corroborated with evidence and I 100% believe her.",
                "Something is going on in her life. The photo in this news article and the caption was shared on her instagram one day ago. \n\n\nThe post before the car crash post is about her kids, dated March 22, and says:\n\n\n“My beautiful babies have no clue how much I love them and they're being poisoned with lies. I miss them so very much. I have been through hell & back in my 41 years but this is incredibly hurting me worse than anything else.\nHurt me, abuse me but don't take my babies. My heart is shattered and every day that passes my sadness only deepens”",
                "Just to throw this out there—she is not a doctor. She probably heard something like “If you go home without treatment, you could be dead within four days due to kidney failure.” I’m not saying she’s intentionally mischaracterizing her condition; I think she just misunderstood.\n\nThey are not going to keep her in the hospital until she dies in four days. She will probably make a full recovery.",
                "not a doctor, but i believe renal failure if very treatable with dialysis.  not sure how she would die in days when she's in the hospital if that's the main medical issue.",
                "\"In a post on Instagram, Virginia Guiffre said she was in a car that was hit by a school bus \"driving 110km [68.3mph] as we were slowing for a turn\".\n\n\n\n\nDid they turn across the schoolbus trying to make a highway exit?\n\n\n\n\nI just can't see where you'd find a sharp turn and a schoolbus doing 70mph in the same place?",
                "ICU doctor here. It seems likely that this woman has misinterpreted something her care team told her. Perhaps the real message is “without therapy for your kidney failure you would probably die in about x days”. Don’t be too hard on her, ICU stays can be very disorienting, with medications, sleep deprivation and emotional response to the injury making things difficult. But it is very unlikely that a person well enough to post on social media is about to die despite modern intensive care.",
                "What a tragic life she had to live just so some billionaires could pretend women like them.",
                "I can’t find any news about the crash itself. Doesn’t Australian news cover things like that?",
                "I know almost nothing about the kidney but I don't get why dialysis isn't an option? Also are Dr's able to be that exact.. why not 3 or 5 days?",
                "I remember her story, most specifically these days because she was originally working at Mar A Largo in Florida when she was approached by Gillene Maxwell in the locker room to come work for Epstein instead."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Entire staff at federal agency that funds libraries and museums put on leave",
            "external_url": "https://www.npr.org/2025/03/31/nx-s1-5334415/doge-institute-of-museum-and-library-services",
            "upvotes": 2958,
            "date": "03/31/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4921x2768+4+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9a%2F70%2Ff68e7f6649b284c4234812a7fad3%2F41757684234-836e54d16d-o.jpg",
            "top_comments": [
                "Republicans: Anti-Literature , Anti-Science, Anti-Healthcare, Anti-Environment, Anti-Saftey, Anti-Workers, Anti-Basic Human Decency, Anti-American ",
                "Next week: Closing all the Smithsonian museums and selling off all the art.",
                "Most of these grants went to funding programs to help the weakest, most in need people in communities. Things like resume assistance, workforce development programs, and the like. \n\nThis is disgraceful and is the epitome of these regime’s hatred for anyone that needs help.",
                "Hate begets hate and ignorance begets ignorance.",
                "I guess they’re trying to change history till gradually the confederacy won the civil war, and that Trump was not a failed businessman. ",
                "Now they can selloff priceless cultural relics to billionaires to help pay for tax cuts and pump their crypto without anyone reporting on it. ",
                "Dumber people mean more conservative voters. Plain as day.",
                "Abolishing the museums means erasing part of our history.\n\nTrump is really serious in destroying our country.",
                "Republican voters hate art and free expression.",
                "The shame of it is the libraries that will be most hurt are small rural systems. You know, the ones in predominantly Trump voting areas.\n\nBut when their local library closes and they see the NYPL still going strong, they'll probably just blame Soros or Biden or immigrants, or whomever else is currently trending on OANN"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Layoffs begin at US health agencies charged with tracking disease, researching, regulating food",
            "external_url": "https://apnews.com/article/health-human-services-layoffs-restructuring-rfk-jr-ec4d7731695e4204970c7eab953b2289",
            "upvotes": 185,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I wish this was April Fools. But I know the only fools here are the ones who voted a convicted felon into office.",
                "What can possible go wrong. They are putting the country and world at risk in order to siphon off $4T in tax deductions for the wealthiest people in the world. It’s absolutely disgusting! 🤢 🤮",
                "This administration of pure corruption & ineptitude will eventually result in so much death and misery. Our overall national health is about to plummet and unemployment, homelessness and suicide are going to skyrocket.",
                "> HHS on Thursday provided a breakdown of some of the cuts.\n__ 3,500 jobs at the Food and Drug Administration, which inspects and sets safety standards for medications, medical devices and foods.\n__ 2,400 jobs at the Centers for Disease Control and Prevention, which monitors for infectious disease outbreaks and works with public health agencies nationwide.\n__ 1,200 jobs at the National Institutes of Health, the world’s leading health and medical research institution.\n__ 300 jobs at the Centers for Medicare and Medicaid Services, which oversees the Affordable Care Act marketplace, Medicare and Medicaid.\n\n\nWhat a wonderful idea when we're dealing with measles outbreaks, a massive bird flu, and we're already cutting environmental protections/safety regulations which will likely cause more pollutants in our foods.\n\n> Kennedy criticized the department he oversees as an inefficient “sprawling bureaucracy” in a video Thursday announcing the restructuring. He said the department’s $1.7 trillion yearly budget, “has failed to improve the health of Americans.”\n\n I think what has failed to improve the health of Americans is the insane cost of medical, dental, and vision care. Americans borrowed roughly 74 billion dollars last year to afford medical costs.",
                "Oh yay maybe I can finally die, I’m not changing my diet at all",
                "And you thought what was in Taco Bell was mystery meat before…",
                "Looks like I’m going back to pandemic levels of paranoia on food. Washing all my fruits and veggies in soap and vinegar and zero processed foodstuff! Yay for that time sink! 😮‍💨",
                "Looks like my efforts to avoid any US product here in Canada is a good habit to take."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Israel bombs Lebanon’s Beirut again, testing fragile truce with Hezbollah",
            "external_url": "https://www.aljazeera.com/news/2025/4/1/israel-bombs-lebanons-beirut-again-testing-fragile-truce-with-hezbollah",
            "upvotes": 328,
            "date": "04/01/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/04/AFP__20250401__38LY4ZP__v1__HighRes__LebanonIsraelConflict-1743476220.jpg?resize=1920%2C1440",
            "top_comments": [
                "I mean if one side is bombing the other that's not \"testing\". That's BREAKING the truce.\n\nThe impetus is on Israel to hold to these agreements and the international community to condemn them for failing to.\n\nKeeping up this veneer of doubt by using neutral language is complicity.",
                "Perfect truce for Israel, they get to keep bombing ",
                "“Israel violates ceasefire by bombing residential building in Beirut, deliberately murdering innocent civilians”",
                "Fuck Israel. That's all. A nation that was on the receiving end of genocide, is now the main perpetrator of genocide. The fucking irony of it all. If anyone should understand how Palestinians feel, it's an Israeli.",
                "No mention that Lebanon fired rockets at Israel first?",
                "This may sound insensitive however I was deeply sympathetic to Israel at the start… now I feel sorry\nfor Israel only that they have such terrible leaders and sympathies are now with the innocent that are bombed in Gaza and Lebanon constantly while the US keeps supplying the bombs. It’s ridiculous.\n\nEdit: I should have clarified “the start” I meant when Hamas attacked on the 13th of October 2023. Which there is no metric that says what Hamas did was ok. So the start of the latest conflict.  The reaction some people have though just turns people away from caring. There are so many things wrong in the world, thinking about all is to overwhelming for anyone.",
                "so hezbollah shot some rockets, israel retaliated, but somehow it's Israel's fault?\n\n  \noh, it's aljazeer",
                "Because everyone knows Hezbollah is just a peaceful organization that gives away a whole bunch of charity in the shape of missiles. Way to go Israel. Charity shaped\nMissiles or missile shaped charity?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "China holds military drills around Taiwan, calling its president a 'parasite'",
            "external_url": "https://www.nbcnews.com/news/world/china-holds-military-drills-taiwan-calling-president-parasite-rcna198998",
            "upvotes": 48,
            "date": "04/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250401-taiwan-mb-0744-e72a4d.jpg",
            "top_comments": [
                "Meanwhile their biggest \"ally\" is too busy performing the bathroom scene from \"Liar Liar\"",
                "I swear to god if the orange motherfucker sets us back 10 years in semiconductor technology...",
                "It seems to be a universal trait of authoritarian governments and rulers that they have no sense of irony. We in the US should know."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Layoffs begin at US health agencies charged with tracking disease, researching, regulating food",
            "external_url": "https://apnews.com/article/health-human-services-layoffs-restructuring-rfk-jr-ec4d7731695e4204970c7eab953b2289",
            "upvotes": 186,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I wish this was April Fools. But I know the only fools here are the ones who voted a convicted felon into office.",
                "What can possible go wrong. They are putting the country and world at risk in order to siphon off $4T in tax deductions for the wealthiest people in the world. It’s absolutely disgusting! 🤢 🤮",
                "This administration of pure corruption & ineptitude will eventually result in so much death and misery. Our overall national health is about to plummet and unemployment, homelessness and suicide are going to skyrocket.",
                "> HHS on Thursday provided a breakdown of some of the cuts.\n__ 3,500 jobs at the Food and Drug Administration, which inspects and sets safety standards for medications, medical devices and foods.\n__ 2,400 jobs at the Centers for Disease Control and Prevention, which monitors for infectious disease outbreaks and works with public health agencies nationwide.\n__ 1,200 jobs at the National Institutes of Health, the world’s leading health and medical research institution.\n__ 300 jobs at the Centers for Medicare and Medicaid Services, which oversees the Affordable Care Act marketplace, Medicare and Medicaid.\n\n\nWhat a wonderful idea when we're dealing with measles outbreaks, a massive bird flu, and we're already cutting environmental protections/safety regulations which will likely cause more pollutants in our foods.\n\n> Kennedy criticized the department he oversees as an inefficient “sprawling bureaucracy” in a video Thursday announcing the restructuring. He said the department’s $1.7 trillion yearly budget, “has failed to improve the health of Americans.”\n\n I think what has failed to improve the health of Americans is the insane cost of medical, dental, and vision care. Americans borrowed roughly 74 billion dollars last year to afford medical costs.",
                "Oh yay maybe I can finally die, I’m not changing my diet at all",
                "And you thought what was in Taco Bell was mystery meat before…",
                "Looks like I’m going back to pandemic levels of paranoia on food. Washing all my fruits and veggies in soap and vinegar and zero processed foodstuff! Yay for that time sink! 😮‍💨",
                "Looks like my efforts to avoid any US product here in Canada is a good habit to take."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Israel bombs Lebanon’s Beirut again, testing fragile truce with Hezbollah",
            "external_url": "https://www.aljazeera.com/news/2025/4/1/israel-bombs-lebanons-beirut-again-testing-fragile-truce-with-hezbollah",
            "upvotes": 331,
            "date": "04/01/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/04/AFP__20250401__38LY4ZP__v1__HighRes__LebanonIsraelConflict-1743476220.jpg?resize=1920%2C1440",
            "top_comments": [
                "I mean if one side is bombing the other that's not \"testing\". That's BREAKING the truce.\n\nThe impetus is on Israel to hold to these agreements and the international community to condemn them for failing to.\n\nKeeping up this veneer of doubt by using neutral language is complicity.",
                "Perfect truce for Israel, they get to keep bombing ",
                "“Israel violates ceasefire by bombing residential building in Beirut, deliberately murdering innocent civilians”",
                "Fuck Israel. That's all. A nation that was on the receiving end of genocide, is now the main perpetrator of genocide. The fucking irony of it all. If anyone should understand how Palestinians feel, it's an Israeli.",
                "No mention that Lebanon fired rockets at Israel first?",
                "This may sound insensitive however I was deeply sympathetic to Israel at the start… now I feel sorry\nfor Israel only that they have such terrible leaders and sympathies are now with the innocent that are bombed in Gaza and Lebanon constantly while the US keeps supplying the bombs. It’s ridiculous.\n\nEdit: I should have clarified “the start” I meant when Hamas attacked on the 13th of October 2023. Which there is no metric that says what Hamas did was ok. So the start of the latest conflict.  The reaction some people have though just turns people away from caring. There are so many things wrong in the world, thinking about all is to overwhelming for anyone.",
                "so hezbollah shot some rockets, israel retaliated, but somehow it's Israel's fault?\n\n  \noh, it's aljazeer",
                "Because everyone knows Hezbollah is just a peaceful organization that gives away a whole bunch of charity in the shape of missiles. Way to go Israel. Charity shaped\nMissiles or missile shaped charity?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Chinese Exercises Around Taiwan",
            "external_url": "https://www.reuters.com/world/asia-pacific/chinese-military-says-it-is-conducting-exercises-around-taiwan-2025-03-31/",
            "upvotes": 225,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They know Trump won't do anything.",
                "3 day special operation?",
                "Well, by appeasing Putin, the US showed the world that they are cowards and keen to betray their allies.\n\nChina is taking notes.",
                "They know we now have zero credibility to say shit about saber-rattling.",
                "I used to go on deployments where we would do figure 8s in the South China Sea just a couple years ago.\n\nThe only thing we will do is follow their boats around.",
                "Jumping jacks and sit ups?",
                "They need it for national and international security",
                "This is the one boys a girls",
                "Same old empty threat. Nothing new."
            ],
            "aggregate_sentiment": 51.0
        },
        {
            "category": "NEW",
            "title": "Liquid egg products distributed in Colorado recalled because of possible bleach contamination",
            "external_url": "https://www.denver7.com/life/recalls/liquid-egg-products-recalled-because-of-possible-bleach-contamination",
            "upvotes": 994,
            "date": "04/01/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/32c88c4/2147483647/strip/true/crop/1920x1008+0+36/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F95%2Ff8%2F1d8b534242bb9d4af23b5d55a07b%2Fthree-slot-3.png",
            "top_comments": [
                "What a waste! MAGA will drink it!",
                "The Trump solution to killing any bacteria 🦠",
                "They're never going to financially recover from this",
                "Great, my dad uses egg beaters for his breakfast. Guess I’d better let him know there might be BLEACH in his next carton.",
                "> Officials claimed that use of the recalled products should not cause adverse health consequences.\n\nI don't think most people want to risk it when it comes to cleaning solutions mixed into their eggs.",
                "Wow egg whites AND COVID protection!  WHEN WILL THE WINNING EVER STOP",
                "At some point, I'm going to accept that they're just trying to kill us off.",
                "That's to keep the covid off, duh",
                "Let the people who cheer the FDA, USDA, etc being defunded and dismantled have these products",
                ">The liquid eggs were distributed to locations in Arizona, California, Colorado, Florida, Illinois, Iowa, Ohio and Texas — but FSIS said there is a possibility they were distributed nationwide.\n\nI couldn't imagine pawning my heirloom garden gnomes for liquid eggs only to have to throw it out because they contain bleach. A potential nationwide recall is huge too."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Stocks close out their worst quarter since 2022 amid tariff uncertainty",
            "external_url": "https://www.nbcnews.com/business/markets/stocks-close-worst-quarter-2022-tariff-uncertainty-rcna198956",
            "upvotes": 5437,
            "date": "03/31/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250331-nyse-se-352p-94b957.jpg",
            "top_comments": [
                "Worst quarter so far. We are heading for stagflation or recession.",
                "Elect someone who bankrupted businesses including a casino, what could possibly go wrong?",
                "Worst part about this: It’s ENTIRELY self-inflicted.",
                "And MAGA cheers like the cult they are",
                "Dude gets an absolute full mushroom knowing he can fuck with the global economy, he doesn’t give a shit about the destruction he creates, lives ruined along the way. He is literally the absolute worst person to sit as chief of the USA. This is all self inflicted and completely unnecessary. He is the antichrist, at least until the anti christ comes. \n\nIt's a mess, aint it Sheriff? If it aint it'll do till a mess gets here.” Cormac McCarthy, No Country for Old Men…",
                "No way to have predicted this says only nation where this routinely happens.",
                "Homer Simpson with hand on the shoulder of a depressed looking Bart.\n\nWorst quarter since 2022 so far!",
                "I may not be able to tell you what Trump will do next, but I can tell you, with certainty, that it will be something stupid.",
                "Instead of the title saying *amid tariff uncertainty* it should have said *amid unnecessary tariffs*.",
                "Right-wingers blamed Biden for that in ‘22 and are now dead silent about Trump’s impact on the market. I guess when the economy’s bad, it’s only actually bad if a person you don’t like is President at the time"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Entire staff at federal agency that funds libraries and museums put on leave",
            "external_url": "https://www.npr.org/2025/03/31/nx-s1-5334415/doge-institute-of-museum-and-library-services",
            "upvotes": 2959,
            "date": "03/31/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4921x2768+4+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9a%2F70%2Ff68e7f6649b284c4234812a7fad3%2F41757684234-836e54d16d-o.jpg",
            "top_comments": [
                "Republicans: Anti-Literature , Anti-Science, Anti-Healthcare, Anti-Environment, Anti-Saftey, Anti-Workers, Anti-Basic Human Decency, Anti-American ",
                "Next week: Closing all the Smithsonian museums and selling off all the art.",
                "Most of these grants went to funding programs to help the weakest, most in need people in communities. Things like resume assistance, workforce development programs, and the like. \n\nThis is disgraceful and is the epitome of these regime’s hatred for anyone that needs help.",
                "Hate begets hate and ignorance begets ignorance.",
                "I guess they’re trying to change history till gradually the confederacy won the civil war, and that Trump was not a failed businessman. ",
                "Now they can selloff priceless cultural relics to billionaires to help pay for tax cuts and pump their crypto without anyone reporting on it. ",
                "Dumber people mean more conservative voters. Plain as day.",
                "Abolishing the museums means erasing part of our history.\n\nTrump is really serious in destroying our country.",
                "Republican voters hate art and free expression.",
                "The shame of it is the libraries that will be most hurt are small rural systems. You know, the ones in predominantly Trump voting areas.\n\nBut when their local library closes and they see the NYPL still going strong, they'll probably just blame Soros or Biden or immigrants, or whomever else is currently trending on OANN"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "SEC continuing $150 million lawsuit against Elon Musk over Twitter purchase",
            "external_url": "https://abcnews.go.com/US/sec-continuing-150-million-lawsuit-elon-musk-twitter/story?id=120343524",
            "upvotes": 42656,
            "date": "03/31/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/4e6250cc-4123-4551-b325-04f24c8dc133/elon-musk-5-gty-gmh-250324_1742835839454_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Unless they bump that up to 150 billion, this is a symbolic gesture at best.  Dude spent 150 million on election tampering in the past week.",
                "It's.... depressing.. that I even have to ask if the SEC is one of the things Musk is using DOGE to gut, because it's one of the places that is a check on him.\n\nI'm going to say ehhhh.... probably. Probably it is. That's our timeline.",
                "Sounds like doge will be making another round of cuts at the SEC.",
                "Didn't he just pay himself $43 billion to buy his own company?",
                "150 million to a billionaire is the equivalent to $150 to a thousandaire.\n150 million to a half-trillionaire is about 30 cents by the same scale. \nOnce a fine hits a certain threshold, mandatory jail time needs to be included because the numbers are just meaningless at that point.",
                "*\"They spend their time on s--- like this when there are so many actual crimes that go unpunished,\" Musk said on X in January in response to the SEC's suit.*\n\nThe flimflam man himself. He spends all his time breaking into critical govt agencies, running roughshod over people's privacy, and leeching off (his businesses) govt subsidies, grants, and other freebies  Lock him up",
                "In other news, the FBI has raided the SEC and locked them out of their own buildings permanently.",
                "How much is that translated to normal people money, let’s say with an income of 50k a year? About $20?",
                "Remember, any law that can be paid with a fine less than the amount stolen is not a law at all.",
                "So he's going to fire the SEC now I take it? Canadian here. I'm sure you're going to say he can't do that, and I'm going to counter with look what he's done already. Anything is possible. There are no more laws in the US."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "NYU canceled talk on USAID cuts for being ‘anti-governmental’, doctor says",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/31/doctor-nyu-usaid-gaza-presentation-canceled",
            "upvotes": 5030,
            "date": "03/31/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d4aae641e16cd4e294bd508ebc2b730dddda9ee/0_200_5986_3592/master/5986.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b87f6a2bfa2c0cebfe69a827ee63fc20",
            "top_comments": [
                "And the fact that Barron Trump is attending NYU has no bearing on this decision...",
                "Fascism really is taking over, huh?",
                "Is *this* cancel culture? ",
                "NYU is rushing to obey the would-be dictator in advance, trying to anticipate what the dictator will want and running out ahead to ensure they are always on the dictator's good side.\n\nThis is the sort of institutional cowardice that makes democratic collapse not only possible, but easy.",
                "Being anti government is completely legal. \nIt was even pretty popular when the people running the government now weren’t running the government",
                "Anti-governmental?  So free speech is truly dead if we can't even criticize our own government.",
                "More like \"we could lose our funding if we let you talk.\"\n\nAnd universities SHOULD be figuring out how to operate without federal funding if they want to keep their self respect.",
                "\"Anti-governmental\" is kind of the whole point of 1st Amendment free speech.",
                "\"Anti-governmental\". So that's the kind of language we're using now? Sounds more like the kind of wording you'd expect in the Soviet Union than the US.",
                "Doctors Without Borders physicians are heroic humanitarians who forgo making lots of money and put themselves in harm's way simply because it's the right thing to do. I worked alongside some of them in Bangaldesh during the Rohingya refugee crisis and was extremely impressed. This is the best of humanity. It's an absolute disgrace that an American university would disinvite their former head over some slides--apparently because they were offensive in their veracity."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "NEW",
            "title": "Musk’s Doge gains access to federal payroll system despite staff warnings",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/31/doge-musk-federal-payroll-system",
            "upvotes": 10014,
            "date": "03/31/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e3f43e9cc78633a9e49656eb6107bb486b02293e/0_3_2576_1547/master/2576.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=534e11295e837b3697e20ffbe4f23a49",
            "top_comments": [
                "- The memo, reviewed by the Times, stated that “such elevated access to critical high-value asset systems is rare with respect to individual systems and no single [Department of Interior] official presently has access to all HR, payroll and credentialing systems.”\n\n- The memo emphasized that gaining administrative access to the system “typically requires training and certification”.\n\n- “Without formal qualifications, the Department may experience significant failure because of operator error,” the memo said.\n\nNothing to see here, everything is fine folks. I'm sure these professionals are more than qualified to safeguard almost 275k personnel records. I'm sure nothing bad will ever come of this.",
                "Musk is a threat to all americans.\n\nEdit: musk is a threat to all people.",
                "Facts:\n\n1. Elon Musk is a bitch.\n\n2. Fuck that guy\n\n3. Elon Musk is a threat to America\n\n4. Elon Musk is a huge bitch.",
                "How are republicans spinning this one?",
                "*With this access, the Doge employees now have visibility into sensitive employee information, like social security numbers, and are able to more easily hire and fire federal workers, according to the Times, citing the two people with knowledge who spoke with the newspaper on condition of anonymity due to fear of retribution.*\n\n\"Fear of retribution\" makes sense because this group of henchmen are all about reprisals and power.",
                "We are living a Bond film, where the villain is incompetent, yet with no Bond to stop him, he just ruins a country.  This is such an unbelievable fucking nightmare.",
                "This is such bullshit. The lawless administration thinks they can do whatever they damn well please.",
                "I believe, also, despite court orders. I wonder when the media is just going to start calling them grifters, like they are.",
                "“With this access, the Doge employees now have visibility into sensitive employee information, like social security numbers, and are able to more easily hire and fire federal workers.” … Let that sink in.🤔",
                "Remember only about a month ago when our politicians agreed DOGE shouldn't have access to this info nor have the power to fire people? \n\n\n\nPaychecks have already been delayed. Yet another grim reminder that our democracy is actively being dismantled from the inside while elected officials on BOTH sides cosign this circus."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Israel bombs Lebanon’s Beirut again, testing fragile truce with Hezbollah",
            "external_url": "https://www.aljazeera.com/news/2025/4/1/israel-bombs-lebanons-beirut-again-testing-fragile-truce-with-hezbollah",
            "upvotes": 328,
            "date": "04/01/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/04/AFP__20250401__38LY4ZP__v1__HighRes__LebanonIsraelConflict-1743476220.jpg?resize=1920%2C1440",
            "top_comments": [
                "I mean if one side is bombing the other that's not \"testing\". That's BREAKING the truce.\n\nThe impetus is on Israel to hold to these agreements and the international community to condemn them for failing to.\n\nKeeping up this veneer of doubt by using neutral language is complicity.",
                "Perfect truce for Israel, they get to keep bombing ",
                "“Israel violates ceasefire by bombing residential building in Beirut, deliberately murdering innocent civilians”",
                "Fuck Israel. That's all. A nation that was on the receiving end of genocide, is now the main perpetrator of genocide. The fucking irony of it all. If anyone should understand how Palestinians feel, it's an Israeli.",
                "No mention that Lebanon fired rockets at Israel first?",
                "This may sound insensitive however I was deeply sympathetic to Israel at the start… now I feel sorry\nfor Israel only that they have such terrible leaders and sympathies are now with the innocent that are bombed in Gaza and Lebanon constantly while the US keeps supplying the bombs. It’s ridiculous.\n\nEdit: I should have clarified “the start” I meant when Hamas attacked on the 13th of October 2023. Which there is no metric that says what Hamas did was ok. So the start of the latest conflict.  The reaction some people have though just turns people away from caring. There are so many things wrong in the world, thinking about all is to overwhelming for anyone.",
                "so hezbollah shot some rockets, israel retaliated, but somehow it's Israel's fault?\n\n  \noh, it's aljazeer",
                "Because everyone knows Hezbollah is just a peaceful organization that gives away a whole bunch of charity in the shape of missiles. Way to go Israel. Charity shaped\nMissiles or missile shaped charity?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Liquid egg products distributed in Colorado recalled because of possible bleach contamination",
            "external_url": "https://www.denver7.com/life/recalls/liquid-egg-products-recalled-because-of-possible-bleach-contamination",
            "upvotes": 1004,
            "date": "04/01/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/32c88c4/2147483647/strip/true/crop/1920x1008+0+36/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F95%2Ff8%2F1d8b534242bb9d4af23b5d55a07b%2Fthree-slot-3.png",
            "top_comments": [
                "What a waste! MAGA will drink it!",
                "The Trump solution to killing any bacteria 🦠",
                "They're never going to financially recover from this",
                "Great, my dad uses egg beaters for his breakfast. Guess I’d better let him know there might be BLEACH in his next carton.",
                "> Officials claimed that use of the recalled products should not cause adverse health consequences.\n\nI don't think most people want to risk it when it comes to cleaning solutions mixed into their eggs.",
                "Wow egg whites AND COVID protection!  WHEN WILL THE WINNING EVER STOP",
                "At some point, I'm going to accept that they're just trying to kill us off.",
                "That's to keep the covid off, duh",
                "Let the people who cheer the FDA, USDA, etc being defunded and dismantled have these products",
                ">The liquid eggs were distributed to locations in Arizona, California, Colorado, Florida, Illinois, Iowa, Ohio and Texas — but FSIS said there is a possibility they were distributed nationwide.\n\nI couldn't imagine pawning my heirloom garden gnomes for liquid eggs only to have to throw it out because they contain bleach. A potential nationwide recall is huge too."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "Chinese Exercises Around Taiwan",
            "external_url": "https://www.reuters.com/world/asia-pacific/chinese-military-says-it-is-conducting-exercises-around-taiwan-2025-03-31/",
            "upvotes": 227,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They know Trump won't do anything.",
                "3 day special operation?",
                "Well, by appeasing Putin, the US showed the world that they are cowards and keen to betray their allies.\n\nChina is taking notes.",
                "They know we now have zero credibility to say shit about saber-rattling.",
                "I used to go on deployments where we would do figure 8s in the South China Sea just a couple years ago.\n\nThe only thing we will do is follow their boats around.",
                "Jumping jacks and sit ups?",
                "They need it for national and international security",
                "This is the one boys a girls",
                "Same old empty threat. Nothing new."
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "RISING",
            "title": "SEC continuing $150 million lawsuit against Elon Musk over Twitter purchase",
            "external_url": "https://abcnews.go.com/US/sec-continuing-150-million-lawsuit-elon-musk-twitter/story?id=120343524",
            "upvotes": 42653,
            "date": "03/31/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/4e6250cc-4123-4551-b325-04f24c8dc133/elon-musk-5-gty-gmh-250324_1742835839454_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Unless they bump that up to 150 billion, this is a symbolic gesture at best.  Dude spent 150 million on election tampering in the past week.",
                "It's.... depressing.. that I even have to ask if the SEC is one of the things Musk is using DOGE to gut, because it's one of the places that is a check on him.\n\nI'm going to say ehhhh.... probably. Probably it is. That's our timeline.",
                "Sounds like doge will be making another round of cuts at the SEC.",
                "Didn't he just pay himself $43 billion to buy his own company?",
                "150 million to a billionaire is the equivalent to $150 to a thousandaire.\n150 million to a half-trillionaire is about 30 cents by the same scale. \nOnce a fine hits a certain threshold, mandatory jail time needs to be included because the numbers are just meaningless at that point.",
                "*\"They spend their time on s--- like this when there are so many actual crimes that go unpunished,\" Musk said on X in January in response to the SEC's suit.*\n\nThe flimflam man himself. He spends all his time breaking into critical govt agencies, running roughshod over people's privacy, and leeching off (his businesses) govt subsidies, grants, and other freebies  Lock him up",
                "In other news, the FBI has raided the SEC and locked them out of their own buildings permanently.",
                "How much is that translated to normal people money, let’s say with an income of 50k a year? About $20?",
                "Remember, any law that can be paid with a fine less than the amount stolen is not a law at all.",
                "So he's going to fire the SEC now I take it? Canadian here. I'm sure you're going to say he can't do that, and I'm going to counter with look what he's done already. Anything is possible. There are no more laws in the US."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Stocks close out their worst quarter since 2022 amid tariff uncertainty",
            "external_url": "https://www.nbcnews.com/business/markets/stocks-close-worst-quarter-2022-tariff-uncertainty-rcna198956",
            "upvotes": 5426,
            "date": "03/31/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250331-nyse-se-352p-94b957.jpg",
            "top_comments": [
                "Worst quarter so far. We are heading for stagflation or recession.",
                "Elect someone who bankrupted businesses including a casino, what could possibly go wrong?",
                "Worst part about this: It’s ENTIRELY self-inflicted.",
                "And MAGA cheers like the cult they are",
                "Dude gets an absolute full mushroom knowing he can fuck with the global economy, he doesn’t give a shit about the destruction he creates, lives ruined along the way. He is literally the absolute worst person to sit as chief of the USA. This is all self inflicted and completely unnecessary. He is the antichrist, at least until the anti christ comes. \n\nIt's a mess, aint it Sheriff? If it aint it'll do till a mess gets here.” Cormac McCarthy, No Country for Old Men…",
                "No way to have predicted this says only nation where this routinely happens.",
                "Homer Simpson with hand on the shoulder of a depressed looking Bart.\n\nWorst quarter since 2022 so far!",
                "I may not be able to tell you what Trump will do next, but I can tell you, with certainty, that it will be something stupid.",
                "Instead of the title saying *amid tariff uncertainty* it should have said *amid unnecessary tariffs*.",
                "Right-wingers blamed Biden for that in ‘22 and are now dead silent about Trump’s impact on the market. I guess when the economy’s bad, it’s only actually bad if a person you don’t like is President at the time"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "China, Japan, South Korea will jointly respond to US tariffs, Chinese state media says",
            "external_url": "https://www.reuters.com/world/china-japan-south-korea-will-jointly-respond-us-tariffs-chinese-state-media-says-2025-03-31/",
            "upvotes": 32304,
            "date": "03/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It speaks volumes when you get China, Japan and South Korea to unite and agree on something.",
                "Trump successfully uniting the world, against the United States.",
                "America truly unites the world.",
                "It's going to be one hot, long and memorable summer here in America.",
                "Congratulations Republicans, you got our biggest allies against China to team up with China! So much winning!",
                "All three countries are vital to US business as suppliers.\n\nDo the anti-globalists even care that world wide trade made the US the wealthiest country in the world?",
                "What the fuck…. He got South Korea and Japan to work together. With CHINA. To make a statement against the US.\n\nIf it wasn’t so fucking sad and terrifying, I’d almost be impressed.",
                "List of allies we have alienated in less than 3 months:\n\n* Canada\n* Mexico\n* Japan\n* South Korea\n* Ukraine\n* France\n* Denmark\n* Great Britain\n\nDid I miss anyone? Australia?\n\nEDIT: Italy, Spain with the wine tax.\n\nEDIT2: Yeah, all of Europe minus Russia.",
                "Wow it took Donald Trump to get China and South Korea to get over their disdain of Japan and work together.\n\nTrump should get the Nobel Peace Prize.",
                "We’ve somehow managed to unite the trio of hatred between these countries into hating us. It’s actually fucking impressive"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "Musk’s Doge gains access to federal payroll system despite staff warnings",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/31/doge-musk-federal-payroll-system",
            "upvotes": 10014,
            "date": "03/31/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e3f43e9cc78633a9e49656eb6107bb486b02293e/0_3_2576_1547/master/2576.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=534e11295e837b3697e20ffbe4f23a49",
            "top_comments": [
                "- The memo, reviewed by the Times, stated that “such elevated access to critical high-value asset systems is rare with respect to individual systems and no single [Department of Interior] official presently has access to all HR, payroll and credentialing systems.”\n\n- The memo emphasized that gaining administrative access to the system “typically requires training and certification”.\n\n- “Without formal qualifications, the Department may experience significant failure because of operator error,” the memo said.\n\nNothing to see here, everything is fine folks. I'm sure these professionals are more than qualified to safeguard almost 275k personnel records. I'm sure nothing bad will ever come of this.",
                "Musk is a threat to all americans.\n\nEdit: musk is a threat to all people.",
                "Facts:\n\n1. Elon Musk is a bitch.\n\n2. Fuck that guy\n\n3. Elon Musk is a threat to America\n\n4. Elon Musk is a huge bitch.",
                "How are republicans spinning this one?",
                "*With this access, the Doge employees now have visibility into sensitive employee information, like social security numbers, and are able to more easily hire and fire federal workers, according to the Times, citing the two people with knowledge who spoke with the newspaper on condition of anonymity due to fear of retribution.*\n\n\"Fear of retribution\" makes sense because this group of henchmen are all about reprisals and power.",
                "We are living a Bond film, where the villain is incompetent, yet with no Bond to stop him, he just ruins a country.  This is such an unbelievable fucking nightmare.",
                "This is such bullshit. The lawless administration thinks they can do whatever they damn well please.",
                "I believe, also, despite court orders. I wonder when the media is just going to start calling them grifters, like they are.",
                "“With this access, the Doge employees now have visibility into sensitive employee information, like social security numbers, and are able to more easily hire and fire federal workers.” … Let that sink in.🤔",
                "Remember only about a month ago when our politicians agreed DOGE shouldn't have access to this info nor have the power to fire people? \n\n\n\nPaychecks have already been delayed. Yet another grim reminder that our democracy is actively being dismantled from the inside while elected officials on BOTH sides cosign this circus."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk hands out $1 million payments after Wisconsin Supreme Court declines request to stop him",
            "external_url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-giveaway-cdea66e0dcbaa53dd183e1d10bee2b35",
            "upvotes": 27197,
            "date": "03/31/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Our candidate is so bad we have to pay you to vote for him.\"",
                "So giving a chance at a million bucks to vote is fine but giving water bottles to people waiting in the heat to vote is wrong?\n\nAgain, an extreme double standard.  It's always and extreme double standard.",
                "It was rigged too. Went to a GOP organizer.",
                "And he still wonders why people hate him",
                "[removed]",
                "Musk is doing this so Schimel can take school lunches away from hungry kids.",
                "Sell your future Social Security benefits for $100.",
                "If he gave away a million per day it would take 900 years for him to give away his fortune.",
                "He could spend his millions and billions on helping people. Instead, he spends money on buying elections. He could fund schools, hospitals and medical bills, helping veterans who lost limbs. But no, he instead spends his money buying politicians in order to gets laws passed so he can more easily commit fraud and leech off the government tax payers.",
                "[removed]"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "NYU canceled talk on USAID cuts for being ‘anti-governmental’, doctor says",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/31/doctor-nyu-usaid-gaza-presentation-canceled",
            "upvotes": 5042,
            "date": "03/31/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d4aae641e16cd4e294bd508ebc2b730dddda9ee/0_200_5986_3592/master/5986.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b87f6a2bfa2c0cebfe69a827ee63fc20",
            "top_comments": [
                "And the fact that Barron Trump is attending NYU has no bearing on this decision...",
                "Fascism really is taking over, huh?",
                "Is *this* cancel culture? ",
                "NYU is rushing to obey the would-be dictator in advance, trying to anticipate what the dictator will want and running out ahead to ensure they are always on the dictator's good side.\n\nThis is the sort of institutional cowardice that makes democratic collapse not only possible, but easy.",
                "Being anti government is completely legal. \nIt was even pretty popular when the people running the government now weren’t running the government",
                "Anti-governmental?  So free speech is truly dead if we can't even criticize our own government.",
                "More like \"we could lose our funding if we let you talk.\"\n\nAnd universities SHOULD be figuring out how to operate without federal funding if they want to keep their self respect.",
                "\"Anti-governmental\" is kind of the whole point of 1st Amendment free speech.",
                "\"Anti-governmental\". So that's the kind of language we're using now? Sounds more like the kind of wording you'd expect in the Soviet Union than the US.",
                "Doctors Without Borders physicians are heroic humanitarians who forgo making lots of money and put themselves in harm's way simply because it's the right thing to do. I worked alongside some of them in Bangaldesh during the Rohingya refugee crisis and was extremely impressed. This is the best of humanity. It's an absolute disgrace that an American university would disinvite their former head over some slides--apparently because they were offensive in their veracity."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Prince Andrew accuser says she has days to live after car crash",
            "external_url": "https://news.sky.com/story/prince-andrew-accuser-says-she-has-days-to-live-after-car-crash-13339369",
            "upvotes": 10808,
            "date": "03/31/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-virginia-roberts-virginia-giuffre_6872295.jpg?20250331161308",
            "top_comments": [
                "As an ICU nurse I’ve never ever ever ever heard a doctor say “you have 4 days to live.” First of all no knows if it’s 1 hour or a month. They can tell you if care is futile and won’t benefit the patient. Having said that, renal failure is not a death sentence. It’s a very difficult life with dialysis catheters and potentially a fistula. There could be intentional deception of lack of understand and fear combined to make that leap. However, her claims against Prince Amdrew have been corroborated with evidence and I 100% believe her.",
                "Something is going on in her life. The photo in this news article and the caption was shared on her instagram one day ago. \n\n\nThe post before the car crash post is about her kids, dated March 22, and says:\n\n\n“My beautiful babies have no clue how much I love them and they're being poisoned with lies. I miss them so very much. I have been through hell & back in my 41 years but this is incredibly hurting me worse than anything else.\nHurt me, abuse me but don't take my babies. My heart is shattered and every day that passes my sadness only deepens”",
                "Just to throw this out there—she is not a doctor. She probably heard something like “If you go home without treatment, you could be dead within four days due to kidney failure.” I’m not saying she’s intentionally mischaracterizing her condition; I think she just misunderstood.\n\nThey are not going to keep her in the hospital until she dies in four days. She will probably make a full recovery.",
                "not a doctor, but i believe renal failure if very treatable with dialysis.  not sure how she would die in days when she's in the hospital if that's the main medical issue.",
                "\"In a post on Instagram, Virginia Guiffre said she was in a car that was hit by a school bus \"driving 110km [68.3mph] as we were slowing for a turn\".\n\n\n\n\nDid they turn across the schoolbus trying to make a highway exit?\n\n\n\n\nI just can't see where you'd find a sharp turn and a schoolbus doing 70mph in the same place?",
                "ICU doctor here. It seems likely that this woman has misinterpreted something her care team told her. Perhaps the real message is “without therapy for your kidney failure you would probably die in about x days”. Don’t be too hard on her, ICU stays can be very disorienting, with medications, sleep deprivation and emotional response to the injury making things difficult. But it is very unlikely that a person well enough to post on social media is about to die despite modern intensive care.",
                "What a tragic life she had to live just so some billionaires could pretend women like them.",
                "I can’t find any news about the crash itself. Doesn’t Australian news cover things like that?",
                "I know almost nothing about the kidney but I don't get why dialysis isn't an option? Also are Dr's able to be that exact.. why not 3 or 5 days?",
                "I remember her story, most specifically these days because she was originally working at Mar A Largo in Florida when she was approached by Gillene Maxwell in the locker room to come work for Epstein instead."
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "04/01/2025 12:16:22 UTC"
}