{
    "posts": [
        {
            "category": "HOT",
            "title": "Montreal woman dies at 32 after being told she was ‘too young for breast cancer’",
            "external_url": "https://www.ctvnews.ca/health/article/montreal-woman-dies-at-32-after-being-told-she-was-too-young-for-breast-cancer/",
            "upvotes": 27263,
            "date": "05/04/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/FSTITERYMVGAPPEOV7OFRR5OYM.jpeg?smart=true&auth=b392430a689284320ca2112096fbf9b2f397ee3428269f049fd2d976491ddd04&width=1200&height=630",
            "top_comments": [
                "My work partner died in her mid 20s after a battle with breast cancer.\nIf you've got it, you can have cancer in it",
                "How can this be happening in this day and age...? My mother died at 35 after a long fight with breast cancer, and that was in 2000. Women shouldn't be falling through the cracks. This is outrageous. ",
                "My mom had breast cancer at 25. I was a baby. She made it and is still alive today almost 40 years later.",
                "Awful. Rates of certain cancers are increasing in younger demographics. We really need to adjust our screening guidelines. Early diagnosis saves lives",
                "The discrimination towards younger patients is honestly sad",
                "My girlfriend with PCOS and very large cysts was told to \"come back later if it doesn't resolve itself after a while\", because \"it just goes away naturally most of the time\". After (IIRC) about half a year passed of constant, non-stop pain that was bad enough to prevent her from moving up and down the stairs of her own home, and an ovary quite visibly pushing against her abdomen with how swollen from cysts it was, she finally got someone to give enough of a shit to *consider* getting her scheduled for surgery; this wouldn't happen until at the nine month mark, when the ovary experienced a torsion and the pain somehow managed to skyrocket even more - although she was reassured it should sort itself out on its own.\n\nJust a couple weeks or so before the scheduled surgery, the pain started subsiding; while relieved it started to seemingly lighten up, my girlfriend still kept the surgery date so she could get it taken care of. Luckily she did, because it turns out the torsion ***DIDN'T*** sort itself out, the ovary strangled itself of blood supply, and was no longer hurting because it was fucking dead tissue. As it was, due to how filled with decaying tissue it was, had it ruptured at all during the flight home to get her surgery (she was visiting family on the other side of the country when it got scheduled), she would gone into sepsis and died in a matter of hours.\n\nAs it is, the incompetence of self-absorbed, chauvinistic cockwombles led to her losing half of her chances of having children outright. All because she was assured \"it would take care of itself\" as, *WHILE JUST A TEENAGER*, she was actively in tears just from existing.",
                "I knew a girl who died at 24 from stage 4 breast cancer after she went to get a lump checked and they told her it was just a cyst and denied her any further investigation. By the time they finally realised it was too late. I had a lump and had to BEG AND DEMAND a mammogram because I was “too young”. Thankfully nothing but after my friend died I will always advocate for myself.",
                "My first wife was denied a mammogram due to being too young. Ended up being diagnosed with Stage 3 ductal carcinoma at age 28.  Died at age 37.",
                "A woman I loved with all my heart died from breast cancer at 26, in the US, after extensive care. \n\nFUCK CANCER and FUCK ANY GOVERNMENT THAT DEPRIORITIZES DEFEATING IT.",
                "I was diagnosed after 6mo with stage 3 colon cancer at 37. My PCF kinda gave up diagnosing and I got pissed and found a diagnosis. I had to go see him after treatment and he said he was just so sorry and so surprised.\n\nI looked him dead in the face and said \"you fucked up. You assumed it was something else due to my age, gave up, and it cost me 6 critical months. I'm only here seeing you because my insurance required it.\"\n\nHe was a little shocked by that response too."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Cincinnati police fatally shot an armed 18-year-old. The next day, his father killed a sheriff’s deputy, authorities say | CNN",
            "external_url": "https://www.cnn.com/2025/05/03/us/ohio-rodney-hinton-jr-arrest-hnk",
            "upvotes": 23644,
            "date": "05/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21594534-32264-561-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He killed him by running into him full speed while he was directing traffic for UC’s graduation…",
                "To be clear, the sheriff that was killed was not connected to the shooting of the 18 year old.  The father snapped and ran over a sheriff directing traffic.  He watched the body cam video of his son's death and lost it.\n\nSad day for everyone involved",
                "The Sheriff that was killed was doing traffic duty for university of Cincinnati graduation. Heard he was close to retirement.\n\nEdit: already retired and was just helping with traffic",
                "From the article for those wondering what lead to the son being shot by police. \n\n\n\"Hinton Jr.’s son was armed and fleeing from a stolen vehicle when a responding officer fatally shot him, police said. Police body cam footage does not clearly show whether the fleeing man pointed a gun at the officer.\" ",
                "Very sad story the cop wasn't even involved",
                "Armed car thief get shot, his father road kills unrelated officer in rage outburst.\n\nHere you go.",
                "*”One of the officers shot the 18-year-old as he emerged from between two dumpsters, the body cam video showed. On the footage, moments before the shooting another officer can be heard yelling, ‘He’s got a gun! He’s got a gun! On your right! On your right!’*\n\n*The officer said after the shooting that the 18-year-old appeared to point the gun at him, according to Theetge.*”\n\n**If**(!!!) this is true it sounds about as justified as it can get.\n\nNot to mention the cop he killed was just some random guy directing traffic… I’ll wait until more evidence comes out before forming an opinion of the son but the dad sounds like an absolute POS.\n\nEdit: also the guy he killed was a retired reserve cop. The dude was just an old man that probably just wanted to do something to keep himself busy. One of my coworkers does this kind of thing. He’s in his 60s and dresses up like a cop every two months to direct traffic at football games lol. I’m not convinced he even gets paid to do it",
                "My advice to others here: I once got into an argument on Reddit with someone who argued that police shooting/killing an active shooter was extrajudicial punishment/illegal murder and was wrong. Just post your comment and move on, do not engage! It's not worth the time!",
                "I can’t believe how a lot of people are blaming cops for this. This guy’s son stole a car. When get caught instead of surrendering he try to run with a gun in his hand. What do you expect a cop to do? Just wait and let him shoot at them??? \nand the next day his dad go and killed a random cop??? I just can’t believe how people are justifying this.",
                "So a guy is killed by police while brandishing a firearm in the commission of a felony and his father responds by murdering a cop who had nothing to do with it, yeah that family sounds like a great value to society"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Sheinbaum says she rejected Trumps offer to send troops to Mexico",
            "external_url": "https://www.reuters.com/world/americas/sheinbaum-says-she-rejected-trumps-offer-send-troops-mexico-2025-05-03/",
            "upvotes": 5915,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was told Donald Trump was the anti-war, anti-Imperialist President.  Hmm 🤔",
                "The cartels are already armed with American weapons.",
                ">\"In one of the calls, (Trump) said, 'How can we help you fight drug trafficking? I propose that the U.S. Army come in to help you,'\"\n\nThis guy is on crack!",
                "“Yeah, I’ll pass on having your military just enter my country”",
                "I give it until the end of the year, but probably sooner, that Trump sends in troops on Mexican soil anyway. After he gets riled up there, he could very well threaten or actually try sending troops into Canada. Y'know, for \"security reasons.\" He may even just continue claiming Canada as the \"51st state\" and use that as pretense.",
                "It looks like he’s gunna send them anyways",
                "We should've rejected voting in Trump a second time...",
                "Remember kids, vampires can’t enter your house without an invitation.",
                "Thats a funny way to say passive invasion. More of the media sane washing Trump smh. ",
                "Maybe the whole point in crashing the economy was to force an entire younger generation to join the military as the only means of gainful employment, then get dragged into whatever insane military campaigns Trump has in mind with promises to conquer America's way to prosperity."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "United Airlines cuts 35 daily flights at Newark airport, citing shortage of air traffic controllers",
            "external_url": "https://apnews.com/article/newark-airport-flight-delays-cancellations-united-d0f8a2fbc8844a05ab9e7d577922c141",
            "upvotes": 1347,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In this economy people would thrive to get a job like that. Can’t see why no one is taking them. Can’t see a reason at all why we would be at a shortage. Can’t see a big stupid fake tan fat fucking reason why.",
                "White House suggests “really high” traffic lights.",
                "And the MAGA crowd erupted in applause, for they understood that this brings us all one step closer  to the return of our Golden age, as they yearn for the mines, and the horse drawn carriages.",
                ">“This particular air traffic control facility has been chronically understaffed for years and without these controllers, it’s now clear — and the FAA tells us — that Newark airport cannot handle the number of planes that are scheduled to operate there in the weeks and months ahead,” Kirby wrote in a letter to customers.\n\nThis sounds like a government position that's hostile to an American business. It's anti-capitalist, some might say communist, to deny the airline industry the government support it needs to thrive.",
                "I seriously can’t imagine the stress of being an EWR controller, not even for 500k a year yet along 200k a year. (Jersey is crazy expensive) with the scheduling and hours? Nope… maybe it’s cool for some people, but not me. Somewhere in Montana? Yeah, sign me up. \n\nThere is a much better way to do this, but, nah…",
                "Maybe they can hire controllers who work remotely in the Philippines.",
                "High stress....as it is now the world has a problem with stress and mental health....Maga's this is your time to shine..step up",
                "The chickens are coming home",
                "Maybe stop trying to cut their benefits",
                "Maybe electing an unqualified moron with a bone to pick against the world was a bad idea."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Former Abercrombie & Fitch CEO is ruled unfit for trial and ordered hospitalized",
            "external_url": "https://abcnews.go.com/US/wireStory/former-abercrombie-fitch-ceo-ruled-unfit-trial-ordered-121417264",
            "upvotes": 3309,
            "date": "05/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1546fa24-1bfa-4c2e-892d-d1f7084e4805/wirestory_be6824abaf11f15b3e82eba45f559e7b_16x9.jpg?w=1600",
            "top_comments": [
                "Poor guy, sex trafficking really takes a toll on your body.",
                "Ah, the Harvey Weinstein defense strategy",
                "That’s cool just take all his money. He won’t remember having it those victims I’m sure would appreciate it.",
                "Looks like Nic Cage in Longlegs",
                "In classic Reddit fashion, nobody read the article. Dude is being institutionalized until he can stand trial, and they said at that point he would (if it never happens… he’s dead in a hospital). Both sides agreed. So basically he’s in “bonus sentence” territory at best at this point. You have to be an absolute ghoul to think a Bureau of Prisons hospitalization is somehow a five star resort.\n\nSome people also saying he’s “suspiciously” and “suddenly” got Alzheimer’s, TBI and dementia. Those following the trial know that’s not a thing, and Alzheimer’s isn’t the kind of thing you just kinda walk with a limp and get diagnosed with agreement from all parties. Four different doctors and the prosecution agreed. “But why just as he’s charged?” Because it’s his lawyers that noticed he wasn’t replying coherently and referred him.\n\nEdit: so many comments about “but he won’t face charges” as if he gives a fuck and is in any position to understand them. I’m sure a custodial clarification against an effective corpse will make the victims families feel awesome.",
                "I wish they would charge these rapists in the prime of their life instead of when they’re in the worst health of their life and knocking on deaths door",
                "Just so hard to believe, the store with near naked teenagers had a predator founder.",
                "100% predator. He got off easy. Fucker.",
                "lot of people in the comments not realizing that this doesn’t mean his was found not guilty or will never have a trial.",
                "Couldn’t have happened to a more deserving predator"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Warren Buffett announces retirement from leading Berkshire Hathaway",
            "external_url": "https://www.theguardian.com/business/2025/may/03/warren-buffett-retirement-berkshire-hathaway",
            "upvotes": 5415,
            "date": "05/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d218a78e339c9698ddcbc45fd9e63371a830d6c/0_167_4352_2611/master/4352.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=15b65b9f6325868b57d16e2ab187bcf7",
            "top_comments": [
                "“I’m getting too old for this shit”",
                "Fella is turning 95 soon.\n\n>Buffett, a Democrat, has previously said that he [plans to donate](https://www.reuters.com/business/finance/buffett-refines-plans-his-fortune-donates-more-berkshire-shares-2024-11-25/#:~:text=Nov%2025%20(Reuters)%20%2D%20Warren,his%20fortune%20after%20his%20death.) 99.5% of his remaining wealth to a charitable trust overseen by his daughter and two sons when he dies. According to Forbes, Buffett has a net worth of $165.3bn.\n\nAnd to think the level of evil this guy could have unleashed with his understanding of the markets - considering he charitably *spent down* to just 165bn.",
                "It's crazy to think this should probably be a big news story but the world is such to where something even crazier will probably happen no later than Tuesday.",
                "I bet he grows his hair out and starts doing yoga. ",
                "Do you think Warren is eligible for social security?",
                "He's heading for the bunker.",
                "Year in year out he had been repeating he ”will never retire”. Something tells me the current admin might have something to do with this change of mind.",
                "Have fun at Margaritaville",
                "Selling stock over last year and saving $300 billion in cash as markets tanked is some move to go out on, hell of a big decision for next leader on what to do with the cash pile. ",
                "I hope his 401k is ok"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Murdered woman's divorce attorney arrested in her 2013 killing",
            "external_url": "https://www.nbcnews.com/news/us-news/murdered-womans-divorce-attorney-arrested-2013-killing-rcna204619",
            "upvotes": 3549,
            "date": "05/03/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-03/Aliza-Sherman-Main-1920x1080-78da67.jpg",
            "top_comments": [
                ">The grand jury’s indictment said Moore killed Sherman to prevent her divorce trial, which was scheduled to start the following day.\n\n>The indictment states that at the time of Sherman’s murder, Moore was being investigated for sending bomb threats to the courthouse on the days he had to appear in court to similarly avoid trials. Moore knew he was being investigating for the bomb threats, according to the indictment.\n\n>In 2017, Moore pleaded guilty to inducing panic related to the bomb threats and falsification for giving authorities misleading statements during the Sherman investigation.\n\nThe attorney is a piece of work. Along with the murder (which was done to prevent her trial from going forward), he sent bomb threats to the courthouse to avoid going to work to do his job.",
                "I'm so confused as to the motive in this case. He killed her and called in bomb threats to....avoid having to go to the courthouse, when he was an attorney? Why? That is so appalling and crazy that there must be something that we are missing in this whole mess.\n\nWas there someone/something there that he was desperately trying to avoid? Was he entangled in something extremely illegal?\n\nEDIT: This is fascinating, according to another article I pulled up, he was charged with:\n\n\nAt least six counts of inducing panic\n\nThree counts of terroristic threats\n\nTelecommunications fraud\n\nObstructing official business\n\nFalsification\n\nTwo counts of forgery\n\nPossessing criminal tools\n\n\n\nbut pleaded down to charges of two counts of felony inducing panic and one count of falsification and served 6 months. So I'm so curious as to how her murder played into all of this fuckery and what crimes he was involved with during this time.",
                "So he killed someone to avoid going to work? This sounds like a Seinfeld episode or something.",
                "It’s not discussed in the linked article, but the victim Aliza Sherman was divorcing her husband because he had allegedly been abusing her for years, and when she began trying to seperate from him, it escalated to a point that she was fearing for her life. \n\nThe murder suspect wasn’t even her original choice for a divorce attorney; her first lawyer had his license suspended due to professional misconduct, so the law firm handed her case to the suspect, who was a senior associate at the time. Aliza claimed that the suspect would be late for meetings and wouldn’t respond to her texts and emails. He also delayed the divorce proceedings numerous times because he didn’t feel fully prepared, which meant that Aliza had been living in fear of her estranged husband for several months by the time she was murdered.  \n\nSource: https://clevelandmagazine.com/in-the-cle/the-read/articles/aliza-sherman",
                "Why didn’t he want the case to go to trial?",
                "Twelve years later, and the guy who was supposed to protect her turns out to be the monster. Absolutely chilling.",
                "His motive was to avoid appearing in court?? Why the hell didn’t he just switch to a line of work that didn’t require appearing in court?",
                "How shit were the original investigators not to look further  into the guy making bomb threats to avoid work when one of his clients is suddenly off'ed allowing him to... Avoid work....",
                "Sometimes, we don’t need logic. Some people are psychopaths in the clinical sense, lacking empathy, remorse, and other qualities. Many functional psychopaths exist, but we don’t realise this because they’re very good at hiding their true nature. Some don’t resist their nature, leading to such stories.",
                "Here’s a more detailed article \n\nhttps://www.wkyc.com/article/news/crime/cold-cases/former-divorce-attorney-cleveland-clinic-nurse-aliza-sherman-arrested-2013-murder/95-285a5922-cd6d-45ca-9a11-b971fe0b0b69\n\nI’m wondering if the now deceased ex husband was possibly involved. \n\nIt was pretty much a hit he got a hot spot so that he could send messages without it pinging I guess to give himself a fake alibi. \n\nFrom what I read doesn’t seem like a strongest case but I’m not a lawyer"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Crews working to contain weeklong oil spill in Gulf of Mexico",
            "external_url": "https://www.chron.com/gulf-coast/article/oil-spill-louisiana-gas-discharge-20308502.php",
            "upvotes": 2934,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh, it’s Mexico’s when things go bad.",
                "An 82-year-old well leaking into the Gulf… sounds like Spectrum’s maintenance plan was “just pray it holds.”",
                "Upvote for the source calling the Gulf by it's proper name.",
                "Trump: Gulf of Mexico? Sounds like their problem.",
                "The article actually isn't accurate in saying the oil spill happened in the Gulf. It happened within the bird's foot delta a few miles from where the Mississippi empties into the Gulf itself,  specifically in the Pass A Loutre Wildlife Management Area, well within the Louisiana border. I do research in this area all the time, and am not looking forward to dealing with this in the upcoming weeks. ",
                "Oh sure when we spill oil in it it’s Mexico’s gulf.",
                "It's a good thing it's not in the Gulf of America.",
                "No worries, Mexico will pay to clean it up.",
                "It’s gulf of America unless there’s a oil leak then it’s the Gulf of Mexico",
                "Oh so it’s Mexico when it’s dirty?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Malta offers to pay for Gaza flotilla repairs but will not let vessel in unless the government is allowed to inspect the vessel.",
            "external_url": "https://timesofmalta.com/article/malta-offers-pay-gaza-flotilla-repairs-let-vessel.1109162",
            "upvotes": 211,
            "date": "05/04/2025",
            "thumbnail": "https://cdn-attachments.timesofmalta.com/b13e09cc0b557c1d7ce9c8c30cb29d7585edb657-1746352391-fde1926d-1200x630.png",
            "top_comments": [
                "\"Malta has offered to pay for the repairs of the Gaza-bound boat and help it reach its destination, but it continues to refuse to let the vessel in Maltese territorial waters and ports.\n\nThe government will not let them in unless it is allowed to inspect the ship and ensure it is truly carrying humanitarian aid and that its damage is compatible with the damage sustained by an attack, Prime Minister Robert Abela told reporters Sunday.\"",
                ">The captain also refused to let two police negotiators on board, and is refusing to allow a Transport Malta maritime surveyor on the vessel to establish the facts, he said.\n\nwell isn't this interesting",
                "Seems pretty reasonable",
                "So a flotilla that explicitly intended to run the Gaza blockade blew up before even getting there, everyone blamed Israel, and now the captain of said ship is refusing to allow the government of Malta to inspect if said ship was actually struck by munitions or if there was an alternative explanation for the explosion, which Malta subtly implies might have been hidden munitions on-board being smuggled by saying they'd like to check on said humanitarian aid that should be on-board?\n\nLmao. \n\nI get hating the Israelis to some extent, but the willful blindness of people who support the Palestinians considering the past of \"humanitarian aid ships\" trying to run the Gaza blockade is quite a checkered one, to say the least.",
                "Nothing to see here. \nYes, we are telling the truth. Why do you ask?",
                "Well of course the Hamasniks on board will comply, right? Don't they want to open the blinds and the sunshine reveal what actually happened and what they are carrying?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Police disband pro-Palestinian camp at Swarthmore College and arrest nine activists",
            "external_url": "https://www.theguardian.com/us-news/2025/may/02/swarthmore-students-suspended-pro-palestinian-camp",
            "upvotes": 1215,
            "date": "05/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ae4221eee0ba99b7ee7d1c111f708ecdd824f799/0_324_4928_2956/master/4928.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8433db484b76ed138b892ffd3db706f3",
            "top_comments": [
                "*The sweep of Swarthmore College’s encampment came after a total of nine Swarthmore College students – eight current and one former – were given notices of their interim suspension beginning on Thursday for erecting the encampment earlier in the week*\n\nThis comes later in the article which initially says or implies that the encampment was composed almost entirely of outsiders. The old divide and conquer tactic which make it look like Outsiders are the rousing up trouble on our campus and leading a few of our students down a dangerous path.",
                "> Swarthmore College is one of 60 schools under investigation for what the Trump administration considers antisemitic harassment on campus.\n\nSo, just another attack on the 1st amendment by the free speech absolutists.",
                "how are people ok with protestors setting up camp on private property? i bet yall would change your minds if they camped in your own front yard.",
                "How quickly and easily the rank and file join the crusade of fascism",
                "They won’t arrest westboro baptist violently protesting woman’s health clinic and veteran funerals, but non violent anti Palestinian genocide protest are too far for the government?\n\nEdit: correct misspelling of westboro",
                "What exactly did Swarthmore College do that these students felt that they needed to target the school for encampments?\n\nOr is this just more cargo cult tiktok influencer \"activism\".",
                "The school’s administrators invited the cops in to crack down:\n\n> “With rising concerns about safety and security on campus, a continued and growing presence of individuals unaffiliated with the college, warnings from outside law enforcement agencies and no signs that protestors were willing to engage in conversation that would bring the encampment to an end,” [Predident Valerie] Smith said, “I felt we had no choice but to seek outside assistance from local law enforcement.”\n\n“Engage with conversation that would bring the encampment to and end” is a funny way of twisting words. I wonder how much was dialogue and how much was ultimatum. And I cannot imagine the students were interested in leaving until the admin divested from Israel. ",
                "Freedom of speech - as long as it doesn't conflict with the official stance.",
                "Let me guess... pro-Palestine but not anti-Hamas. That combination seems to be particularly rare in these protests.",
                "Everyone’s sphincter is clenched hoping that letting their students have free speech doesn’t take away their federal funding"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Malta offers to pay for Gaza flotilla repairs but will not let vessel in unless the government is allowed to inspect the vessel.",
            "external_url": "https://timesofmalta.com/article/malta-offers-pay-gaza-flotilla-repairs-let-vessel.1109162",
            "upvotes": 209,
            "date": "05/04/2025",
            "thumbnail": "https://cdn-attachments.timesofmalta.com/b13e09cc0b557c1d7ce9c8c30cb29d7585edb657-1746352391-fde1926d-1200x630.png",
            "top_comments": [
                "\"Malta has offered to pay for the repairs of the Gaza-bound boat and help it reach its destination, but it continues to refuse to let the vessel in Maltese territorial waters and ports.\n\nThe government will not let them in unless it is allowed to inspect the ship and ensure it is truly carrying humanitarian aid and that its damage is compatible with the damage sustained by an attack, Prime Minister Robert Abela told reporters Sunday.\"",
                ">The captain also refused to let two police negotiators on board, and is refusing to allow a Transport Malta maritime surveyor on the vessel to establish the facts, he said.\n\nwell isn't this interesting",
                "Seems pretty reasonable",
                "So a flotilla that explicitly intended to run the Gaza blockade blew up before even getting there, everyone blamed Israel, and now the captain of said ship is refusing to allow the government of Malta to inspect if said ship was actually struck by munitions or if there was an alternative explanation for the explosion, which Malta subtly implies might have been hidden munitions on-board being smuggled by saying they'd like to check on said humanitarian aid that should be on-board?\n\nLmao. \n\nI get hating the Israelis to some extent, but the willful blindness of people who support the Palestinians considering the past of \"humanitarian aid ships\" trying to run the Gaza blockade is quite a checkered one, to say the least.",
                "Nothing to see here. \nYes, we are telling the truth. Why do you ask?",
                "Well of course the Hamasniks on board will comply, right? Don't they want to open the blinds and the sunshine reveal what actually happened and what they are carrying?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "P Town Bar Raided During Queer Event",
            "external_url": "https://qburgh.com/p-town-raided-during-event/",
            "upvotes": 237,
            "date": "05/04/2025",
            "thumbnail": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvcWJ1cmdoLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDVcL29mZmljZXItaW5zaWRlLXAtdG93bi1kdXJpbmctcmFpZC5wbmciLCJ0eHQiOiJQIFRvd24gQmFyICdSYWlkZWQnIER1cmluZyBRdWVlciBFdmVudCIsInRlbXBsYXRlIjoiZnVsbHNjcmVlbiIsImJsb2dfaWQiOjE3OTczNTg0OX0.kMopvQn7xokyOm_W3ru9tJjP4V_OMyhc9n2auNee-g0MQ",
            "top_comments": [
                ">\"police offered little explanation beyond calling it a “compliance check,” but the scale and timing of the action left many shaken and deeply skeptical.\" \n\nSeems like harassment is the explanation to their actions.",
                "This is just the beginning. I don't doubt there will be many more during Pride month this year.  But make no mistake, the LGBTQ community will never comply and we will never go back in the closet. ",
                "If the city council doesn’t do something then you work to replace city council with people that will.",
                "I'm a musician and have played in bars and clubs for 35 years, and I've never seen this happen.  😞",
                "For any other queers reading this, no, it's not THE P-Town. I'm not saying anything one way or another about LEO'S actions, just that the title's a little clickbatey. Provincetown is fine. ",
                "Where's the raids on churches?\n..you know where child molestation always seems to happen",
                "Thought by P-Town they meant Provincetown, Massachusetts….the last part sounded redundant",
                "Im from Pittsburgh, and have never once heard it referred to as P-town",
                "[removed]",
                "Take names. For the later trials."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "United Airlines cuts 35 daily flights at Newark airport, citing shortage of air traffic controllers",
            "external_url": "https://apnews.com/article/newark-airport-flight-delays-cancellations-united-d0f8a2fbc8844a05ab9e7d577922c141",
            "upvotes": 1351,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In this economy people would thrive to get a job like that. Can’t see why no one is taking them. Can’t see a reason at all why we would be at a shortage. Can’t see a big stupid fake tan fat fucking reason why.",
                "White House suggests “really high” traffic lights.",
                "And the MAGA crowd erupted in applause, for they understood that this brings us all one step closer  to the return of our Golden age, as they yearn for the mines, and the horse drawn carriages.",
                ">“This particular air traffic control facility has been chronically understaffed for years and without these controllers, it’s now clear — and the FAA tells us — that Newark airport cannot handle the number of planes that are scheduled to operate there in the weeks and months ahead,” Kirby wrote in a letter to customers.\n\nThis sounds like a government position that's hostile to an American business. It's anti-capitalist, some might say communist, to deny the airline industry the government support it needs to thrive.",
                "I seriously can’t imagine the stress of being an EWR controller, not even for 500k a year yet along 200k a year. (Jersey is crazy expensive) with the scheduling and hours? Nope… maybe it’s cool for some people, but not me. Somewhere in Montana? Yeah, sign me up. \n\nThere is a much better way to do this, but, nah…",
                "Maybe they can hire controllers who work remotely in the Philippines.",
                "High stress....as it is now the world has a problem with stress and mental health....Maga's this is your time to shine..step up",
                "The chickens are coming home",
                "Maybe stop trying to cut their benefits",
                "Maybe electing an unqualified moron with a bone to pick against the world was a bad idea."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "5.3-magnitude earthquake rattles rural southeastern New Mexico, West Texas",
            "external_url": "https://www.cbsnews.com/news/5-3-magnitude-earthquake-rattles-rural-southeastern-new-mexico-west-texas/",
            "upvotes": 235,
            "date": "05/04/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/04/94fa4567-f863-416f-a3a9-5014ae1df706/thumbnail/1200x630/4a5a80dda74ee3bd16a835d0a8970139/screenshot-2025-05-03-195502.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "Is this one of those “fracking earthquakes” like the ones in Oklahoma?",
                "right in the heart of oil country. hmmm",
                "\"Ptttch we don't need the US Geological Survey anymore, throw 'em out with NOAA\"",
                "Where's that new \"spaceport\" being built again?",
                "Isn't this where the measles outbreak is also concentrated?\n\nWho will be the first fundamentalist to start claiming something like \".....it's a message from God because too many people are still getting vaccinated....\"",
                "Just hope they are not counting on FEMA help.",
                "There was a 3.1 magnitude earthquake in Socorro on Tuesday as well.",
                "Does anyone know if these fracking caused earthquakes are trending up in magnitude over time and if there is a general upper limit for fracking earthquakes or it is their magnitude purely a function of very local geology?",
                "For some reason i briefly thought there was somehow a city in West Texas called New Mexico"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Montreal woman dies at 32 after being told she was ‘too young for breast cancer’",
            "external_url": "https://www.ctvnews.ca/health/article/montreal-woman-dies-at-32-after-being-told-she-was-too-young-for-breast-cancer/",
            "upvotes": 27263,
            "date": "05/04/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/FSTITERYMVGAPPEOV7OFRR5OYM.jpeg?smart=true&auth=b392430a689284320ca2112096fbf9b2f397ee3428269f049fd2d976491ddd04&width=1200&height=630",
            "top_comments": [
                "My work partner died in her mid 20s after a battle with breast cancer.\nIf you've got it, you can have cancer in it",
                "How can this be happening in this day and age...? My mother died at 35 after a long fight with breast cancer, and that was in 2000. Women shouldn't be falling through the cracks. This is outrageous. ",
                "My mom had breast cancer at 25. I was a baby. She made it and is still alive today almost 40 years later.",
                "Awful. Rates of certain cancers are increasing in younger demographics. We really need to adjust our screening guidelines. Early diagnosis saves lives",
                "The discrimination towards younger patients is honestly sad",
                "My girlfriend with PCOS and very large cysts was told to \"come back later if it doesn't resolve itself after a while\", because \"it just goes away naturally most of the time\". After (IIRC) about half a year passed of constant, non-stop pain that was bad enough to prevent her from moving up and down the stairs of her own home, and an ovary quite visibly pushing against her abdomen with how swollen from cysts it was, she finally got someone to give enough of a shit to *consider* getting her scheduled for surgery; this wouldn't happen until at the nine month mark, when the ovary experienced a torsion and the pain somehow managed to skyrocket even more - although she was reassured it should sort itself out on its own.\n\nJust a couple weeks or so before the scheduled surgery, the pain started subsiding; while relieved it started to seemingly lighten up, my girlfriend still kept the surgery date so she could get it taken care of. Luckily she did, because it turns out the torsion ***DIDN'T*** sort itself out, the ovary strangled itself of blood supply, and was no longer hurting because it was fucking dead tissue. As it was, due to how filled with decaying tissue it was, had it ruptured at all during the flight home to get her surgery (she was visiting family on the other side of the country when it got scheduled), she would gone into sepsis and died in a matter of hours.\n\nAs it is, the incompetence of self-absorbed, chauvinistic cockwombles led to her losing half of her chances of having children outright. All because she was assured \"it would take care of itself\" as, *WHILE JUST A TEENAGER*, she was actively in tears just from existing.",
                "I knew a girl who died at 24 from stage 4 breast cancer after she went to get a lump checked and they told her it was just a cyst and denied her any further investigation. By the time they finally realised it was too late. I had a lump and had to BEG AND DEMAND a mammogram because I was “too young”. Thankfully nothing but after my friend died I will always advocate for myself.",
                "My first wife was denied a mammogram due to being too young. Ended up being diagnosed with Stage 3 ductal carcinoma at age 28.  Died at age 37.",
                "A woman I loved with all my heart died from breast cancer at 26, in the US, after extensive care. \n\nFUCK CANCER and FUCK ANY GOVERNMENT THAT DEPRIORITIZES DEFEATING IT.",
                "I was diagnosed after 6mo with stage 3 colon cancer at 37. My PCF kinda gave up diagnosing and I got pissed and found a diagnosis. I had to go see him after treatment and he said he was just so sorry and so surprised.\n\nI looked him dead in the face and said \"you fucked up. You assumed it was something else due to my age, gave up, and it cost me 6 critical months. I'm only here seeing you because my insurance required it.\"\n\nHe was a little shocked by that response too."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Police disband pro-Palestinian camp at Swarthmore College and arrest nine activists",
            "external_url": "https://www.theguardian.com/us-news/2025/may/02/swarthmore-students-suspended-pro-palestinian-camp",
            "upvotes": 1215,
            "date": "05/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ae4221eee0ba99b7ee7d1c111f708ecdd824f799/0_324_4928_2956/master/4928.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8433db484b76ed138b892ffd3db706f3",
            "top_comments": [
                "*The sweep of Swarthmore College’s encampment came after a total of nine Swarthmore College students – eight current and one former – were given notices of their interim suspension beginning on Thursday for erecting the encampment earlier in the week*\n\nThis comes later in the article which initially says or implies that the encampment was composed almost entirely of outsiders. The old divide and conquer tactic which make it look like Outsiders are the rousing up trouble on our campus and leading a few of our students down a dangerous path.",
                "> Swarthmore College is one of 60 schools under investigation for what the Trump administration considers antisemitic harassment on campus.\n\nSo, just another attack on the 1st amendment by the free speech absolutists.",
                "how are people ok with protestors setting up camp on private property? i bet yall would change your minds if they camped in your own front yard.",
                "How quickly and easily the rank and file join the crusade of fascism",
                "They won’t arrest westboro baptist violently protesting woman’s health clinic and veteran funerals, but non violent anti Palestinian genocide protest are too far for the government?\n\nEdit: correct misspelling of westboro",
                "What exactly did Swarthmore College do that these students felt that they needed to target the school for encampments?\n\nOr is this just more cargo cult tiktok influencer \"activism\".",
                "The school’s administrators invited the cops in to crack down:\n\n> “With rising concerns about safety and security on campus, a continued and growing presence of individuals unaffiliated with the college, warnings from outside law enforcement agencies and no signs that protestors were willing to engage in conversation that would bring the encampment to an end,” [Predident Valerie] Smith said, “I felt we had no choice but to seek outside assistance from local law enforcement.”\n\n“Engage with conversation that would bring the encampment to and end” is a funny way of twisting words. I wonder how much was dialogue and how much was ultimatum. And I cannot imagine the students were interested in leaving until the admin divested from Israel. ",
                "Freedom of speech - as long as it doesn't conflict with the official stance.",
                "Let me guess... pro-Palestine but not anti-Hamas. That combination seems to be particularly rare in these protests.",
                "Everyone’s sphincter is clenched hoping that letting their students have free speech doesn’t take away their federal funding"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Former Abercrombie & Fitch CEO is ruled unfit for trial and ordered hospitalized",
            "external_url": "https://abcnews.go.com/US/wireStory/former-abercrombie-fitch-ceo-ruled-unfit-trial-ordered-121417264",
            "upvotes": 3310,
            "date": "05/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1546fa24-1bfa-4c2e-892d-d1f7084e4805/wirestory_be6824abaf11f15b3e82eba45f559e7b_16x9.jpg?w=1600",
            "top_comments": [
                "Poor guy, sex trafficking really takes a toll on your body.",
                "Ah, the Harvey Weinstein defense strategy",
                "That’s cool just take all his money. He won’t remember having it those victims I’m sure would appreciate it.",
                "Looks like Nic Cage in Longlegs",
                "In classic Reddit fashion, nobody read the article. Dude is being institutionalized until he can stand trial, and they said at that point he would (if it never happens… he’s dead in a hospital). Both sides agreed. So basically he’s in “bonus sentence” territory at best at this point. You have to be an absolute ghoul to think a Bureau of Prisons hospitalization is somehow a five star resort.\n\nSome people also saying he’s “suspiciously” and “suddenly” got Alzheimer’s, TBI and dementia. Those following the trial know that’s not a thing, and Alzheimer’s isn’t the kind of thing you just kinda walk with a limp and get diagnosed with agreement from all parties. Four different doctors and the prosecution agreed. “But why just as he’s charged?” Because it’s his lawyers that noticed he wasn’t replying coherently and referred him.\n\nEdit: so many comments about “but he won’t face charges” as if he gives a fuck and is in any position to understand them. I’m sure a custodial clarification against an effective corpse will make the victims families feel awesome.",
                "I wish they would charge these rapists in the prime of their life instead of when they’re in the worst health of their life and knocking on deaths door",
                "Just so hard to believe, the store with near naked teenagers had a predator founder.",
                "100% predator. He got off easy. Fucker.",
                "lot of people in the comments not realizing that this doesn’t mean his was found not guilty or will never have a trial.",
                "Couldn’t have happened to a more deserving predator"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Crews working to contain weeklong oil spill in Gulf of Mexico",
            "external_url": "https://www.chron.com/gulf-coast/article/oil-spill-louisiana-gas-discharge-20308502.php",
            "upvotes": 2929,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh, it’s Mexico’s when things go bad.",
                "An 82-year-old well leaking into the Gulf… sounds like Spectrum’s maintenance plan was “just pray it holds.”",
                "Upvote for the source calling the Gulf by it's proper name.",
                "Trump: Gulf of Mexico? Sounds like their problem.",
                "The article actually isn't accurate in saying the oil spill happened in the Gulf. It happened within the bird's foot delta a few miles from where the Mississippi empties into the Gulf itself,  specifically in the Pass A Loutre Wildlife Management Area, well within the Louisiana border. I do research in this area all the time, and am not looking forward to dealing with this in the upcoming weeks. ",
                "Oh sure when we spill oil in it it’s Mexico’s gulf.",
                "It's a good thing it's not in the Gulf of America.",
                "No worries, Mexico will pay to clean it up.",
                "It’s gulf of America unless there’s a oil leak then it’s the Gulf of Mexico",
                "Oh so it’s Mexico when it’s dirty?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Sheinbaum says she rejected Trumps offer to send troops to Mexico",
            "external_url": "https://www.reuters.com/world/americas/sheinbaum-says-she-rejected-trumps-offer-send-troops-mexico-2025-05-03/",
            "upvotes": 5915,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was told Donald Trump was the anti-war, anti-Imperialist President.  Hmm 🤔",
                "The cartels are already armed with American weapons.",
                ">\"In one of the calls, (Trump) said, 'How can we help you fight drug trafficking? I propose that the U.S. Army come in to help you,'\"\n\nThis guy is on crack!",
                "“Yeah, I’ll pass on having your military just enter my country”",
                "I give it until the end of the year, but probably sooner, that Trump sends in troops on Mexican soil anyway. After he gets riled up there, he could very well threaten or actually try sending troops into Canada. Y'know, for \"security reasons.\" He may even just continue claiming Canada as the \"51st state\" and use that as pretense.",
                "It looks like he’s gunna send them anyways",
                "We should've rejected voting in Trump a second time...",
                "Remember kids, vampires can’t enter your house without an invitation.",
                "Thats a funny way to say passive invasion. More of the media sane washing Trump smh. ",
                "Maybe the whole point in crashing the economy was to force an entire younger generation to join the military as the only means of gainful employment, then get dragged into whatever insane military campaigns Trump has in mind with promises to conquer America's way to prosperity."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Murdered woman's divorce attorney arrested in her 2013 killing",
            "external_url": "https://www.nbcnews.com/news/us-news/murdered-womans-divorce-attorney-arrested-2013-killing-rcna204619",
            "upvotes": 3541,
            "date": "05/03/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-03/Aliza-Sherman-Main-1920x1080-78da67.jpg",
            "top_comments": [
                ">The grand jury’s indictment said Moore killed Sherman to prevent her divorce trial, which was scheduled to start the following day.\n\n>The indictment states that at the time of Sherman’s murder, Moore was being investigated for sending bomb threats to the courthouse on the days he had to appear in court to similarly avoid trials. Moore knew he was being investigating for the bomb threats, according to the indictment.\n\n>In 2017, Moore pleaded guilty to inducing panic related to the bomb threats and falsification for giving authorities misleading statements during the Sherman investigation.\n\nThe attorney is a piece of work. Along with the murder (which was done to prevent her trial from going forward), he sent bomb threats to the courthouse to avoid going to work to do his job.",
                "I'm so confused as to the motive in this case. He killed her and called in bomb threats to....avoid having to go to the courthouse, when he was an attorney? Why? That is so appalling and crazy that there must be something that we are missing in this whole mess.\n\nWas there someone/something there that he was desperately trying to avoid? Was he entangled in something extremely illegal?\n\nEDIT: This is fascinating, according to another article I pulled up, he was charged with:\n\n\nAt least six counts of inducing panic\n\nThree counts of terroristic threats\n\nTelecommunications fraud\n\nObstructing official business\n\nFalsification\n\nTwo counts of forgery\n\nPossessing criminal tools\n\n\n\nbut pleaded down to charges of two counts of felony inducing panic and one count of falsification and served 6 months. So I'm so curious as to how her murder played into all of this fuckery and what crimes he was involved with during this time.",
                "So he killed someone to avoid going to work? This sounds like a Seinfeld episode or something.",
                "It’s not discussed in the linked article, but the victim Aliza Sherman was divorcing her husband because he had allegedly been abusing her for years, and when she began trying to seperate from him, it escalated to a point that she was fearing for her life. \n\nThe murder suspect wasn’t even her original choice for a divorce attorney; her first lawyer had his license suspended due to professional misconduct, so the law firm handed her case to the suspect, who was a senior associate at the time. Aliza claimed that the suspect would be late for meetings and wouldn’t respond to her texts and emails. He also delayed the divorce proceedings numerous times because he didn’t feel fully prepared, which meant that Aliza had been living in fear of her estranged husband for several months by the time she was murdered.  \n\nSource: https://clevelandmagazine.com/in-the-cle/the-read/articles/aliza-sherman",
                "Why didn’t he want the case to go to trial?",
                "Twelve years later, and the guy who was supposed to protect her turns out to be the monster. Absolutely chilling.",
                "His motive was to avoid appearing in court?? Why the hell didn’t he just switch to a line of work that didn’t require appearing in court?",
                "How shit were the original investigators not to look further  into the guy making bomb threats to avoid work when one of his clients is suddenly off'ed allowing him to... Avoid work....",
                "Sometimes, we don’t need logic. Some people are psychopaths in the clinical sense, lacking empathy, remorse, and other qualities. Many functional psychopaths exist, but we don’t realise this because they’re very good at hiding their true nature. Some don’t resist their nature, leading to such stories.",
                "Here’s a more detailed article \n\nhttps://www.wkyc.com/article/news/crime/cold-cases/former-divorce-attorney-cleveland-clinic-nurse-aliza-sherman-arrested-2013-murder/95-285a5922-cd6d-45ca-9a11-b971fe0b0b69\n\nI’m wondering if the now deceased ex husband was possibly involved. \n\nIt was pretty much a hit he got a hot spot so that he could send messages without it pinging I guess to give himself a fake alibi. \n\nFrom what I read doesn’t seem like a strongest case but I’m not a lawyer"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Malta offers to pay for Gaza flotilla repairs but will not let vessel in unless the government is allowed to inspect the vessel.",
            "external_url": "https://timesofmalta.com/article/malta-offers-pay-gaza-flotilla-repairs-let-vessel.1109162",
            "upvotes": 210,
            "date": "05/04/2025",
            "thumbnail": "https://cdn-attachments.timesofmalta.com/b13e09cc0b557c1d7ce9c8c30cb29d7585edb657-1746352391-fde1926d-1200x630.png",
            "top_comments": [
                "\"Malta has offered to pay for the repairs of the Gaza-bound boat and help it reach its destination, but it continues to refuse to let the vessel in Maltese territorial waters and ports.\n\nThe government will not let them in unless it is allowed to inspect the ship and ensure it is truly carrying humanitarian aid and that its damage is compatible with the damage sustained by an attack, Prime Minister Robert Abela told reporters Sunday.\"",
                ">The captain also refused to let two police negotiators on board, and is refusing to allow a Transport Malta maritime surveyor on the vessel to establish the facts, he said.\n\nwell isn't this interesting",
                "Seems pretty reasonable",
                "So a flotilla that explicitly intended to run the Gaza blockade blew up before even getting there, everyone blamed Israel, and now the captain of said ship is refusing to allow the government of Malta to inspect if said ship was actually struck by munitions or if there was an alternative explanation for the explosion, which Malta subtly implies might have been hidden munitions on-board being smuggled by saying they'd like to check on said humanitarian aid that should be on-board?\n\nLmao. \n\nI get hating the Israelis to some extent, but the willful blindness of people who support the Palestinians considering the past of \"humanitarian aid ships\" trying to run the Gaza blockade is quite a checkered one, to say the least.",
                "Nothing to see here. \nYes, we are telling the truth. Why do you ask?",
                "Well of course the Hamasniks on board will comply, right? Don't they want to open the blinds and the sunshine reveal what actually happened and what they are carrying?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "United Airlines cuts 35 daily flights at Newark airport, citing shortage of air traffic controllers",
            "external_url": "https://apnews.com/article/newark-airport-flight-delays-cancellations-united-d0f8a2fbc8844a05ab9e7d577922c141",
            "upvotes": 1352,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In this economy people would thrive to get a job like that. Can’t see why no one is taking them. Can’t see a reason at all why we would be at a shortage. Can’t see a big stupid fake tan fat fucking reason why.",
                "White House suggests “really high” traffic lights.",
                "And the MAGA crowd erupted in applause, for they understood that this brings us all one step closer  to the return of our Golden age, as they yearn for the mines, and the horse drawn carriages.",
                ">“This particular air traffic control facility has been chronically understaffed for years and without these controllers, it’s now clear — and the FAA tells us — that Newark airport cannot handle the number of planes that are scheduled to operate there in the weeks and months ahead,” Kirby wrote in a letter to customers.\n\nThis sounds like a government position that's hostile to an American business. It's anti-capitalist, some might say communist, to deny the airline industry the government support it needs to thrive.",
                "I seriously can’t imagine the stress of being an EWR controller, not even for 500k a year yet along 200k a year. (Jersey is crazy expensive) with the scheduling and hours? Nope… maybe it’s cool for some people, but not me. Somewhere in Montana? Yeah, sign me up. \n\nThere is a much better way to do this, but, nah…",
                "Maybe they can hire controllers who work remotely in the Philippines.",
                "High stress....as it is now the world has a problem with stress and mental health....Maga's this is your time to shine..step up",
                "The chickens are coming home",
                "Maybe stop trying to cut their benefits",
                "Maybe electing an unqualified moron with a bone to pick against the world was a bad idea."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "P Town Bar Raided During Queer Event",
            "external_url": "https://qburgh.com/p-town-raided-during-event/",
            "upvotes": 236,
            "date": "05/04/2025",
            "thumbnail": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvcWJ1cmdoLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDVcL29mZmljZXItaW5zaWRlLXAtdG93bi1kdXJpbmctcmFpZC5wbmciLCJ0eHQiOiJQIFRvd24gQmFyICdSYWlkZWQnIER1cmluZyBRdWVlciBFdmVudCIsInRlbXBsYXRlIjoiZnVsbHNjcmVlbiIsImJsb2dfaWQiOjE3OTczNTg0OX0.kMopvQn7xokyOm_W3ru9tJjP4V_OMyhc9n2auNee-g0MQ",
            "top_comments": [
                ">\"police offered little explanation beyond calling it a “compliance check,” but the scale and timing of the action left many shaken and deeply skeptical.\" \n\nSeems like harassment is the explanation to their actions.",
                "This is just the beginning. I don't doubt there will be many more during Pride month this year.  But make no mistake, the LGBTQ community will never comply and we will never go back in the closet. ",
                "If the city council doesn’t do something then you work to replace city council with people that will.",
                "I'm a musician and have played in bars and clubs for 35 years, and I've never seen this happen.  😞",
                "For any other queers reading this, no, it's not THE P-Town. I'm not saying anything one way or another about LEO'S actions, just that the title's a little clickbatey. Provincetown is fine. ",
                "Where's the raids on churches?\n..you know where child molestation always seems to happen",
                "Thought by P-Town they meant Provincetown, Massachusetts….the last part sounded redundant",
                "Im from Pittsburgh, and have never once heard it referred to as P-town",
                "[removed]",
                "Take names. For the later trials."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Police disband pro-Palestinian camp at Swarthmore College and arrest nine activists",
            "external_url": "https://www.theguardian.com/us-news/2025/may/02/swarthmore-students-suspended-pro-palestinian-camp",
            "upvotes": 1219,
            "date": "05/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ae4221eee0ba99b7ee7d1c111f708ecdd824f799/0_324_4928_2956/master/4928.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8433db484b76ed138b892ffd3db706f3",
            "top_comments": [
                "*The sweep of Swarthmore College’s encampment came after a total of nine Swarthmore College students – eight current and one former – were given notices of their interim suspension beginning on Thursday for erecting the encampment earlier in the week*\n\nThis comes later in the article which initially says or implies that the encampment was composed almost entirely of outsiders. The old divide and conquer tactic which make it look like Outsiders are the rousing up trouble on our campus and leading a few of our students down a dangerous path.",
                "> Swarthmore College is one of 60 schools under investigation for what the Trump administration considers antisemitic harassment on campus.\n\nSo, just another attack on the 1st amendment by the free speech absolutists.",
                "how are people ok with protestors setting up camp on private property? i bet yall would change your minds if they camped in your own front yard.",
                "How quickly and easily the rank and file join the crusade of fascism",
                "They won’t arrest westboro baptist violently protesting woman’s health clinic and veteran funerals, but non violent anti Palestinian genocide protest are too far for the government?\n\nEdit: correct misspelling of westboro",
                "What exactly did Swarthmore College do that these students felt that they needed to target the school for encampments?\n\nOr is this just more cargo cult tiktok influencer \"activism\".",
                "The school’s administrators invited the cops in to crack down:\n\n> “With rising concerns about safety and security on campus, a continued and growing presence of individuals unaffiliated with the college, warnings from outside law enforcement agencies and no signs that protestors were willing to engage in conversation that would bring the encampment to an end,” [Predident Valerie] Smith said, “I felt we had no choice but to seek outside assistance from local law enforcement.”\n\n“Engage with conversation that would bring the encampment to and end” is a funny way of twisting words. I wonder how much was dialogue and how much was ultimatum. And I cannot imagine the students were interested in leaving until the admin divested from Israel. ",
                "Freedom of speech - as long as it doesn't conflict with the official stance.",
                "Let me guess... pro-Palestine but not anti-Hamas. That combination seems to be particularly rare in these protests.",
                "Everyone’s sphincter is clenched hoping that letting their students have free speech doesn’t take away their federal funding"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "5.3-magnitude earthquake rattles rural southeastern New Mexico, West Texas",
            "external_url": "https://www.cbsnews.com/news/5-3-magnitude-earthquake-rattles-rural-southeastern-new-mexico-west-texas/",
            "upvotes": 235,
            "date": "05/04/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/04/94fa4567-f863-416f-a3a9-5014ae1df706/thumbnail/1200x630/4a5a80dda74ee3bd16a835d0a8970139/screenshot-2025-05-03-195502.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "Is this one of those “fracking earthquakes” like the ones in Oklahoma?",
                "right in the heart of oil country. hmmm",
                "\"Ptttch we don't need the US Geological Survey anymore, throw 'em out with NOAA\"",
                "Where's that new \"spaceport\" being built again?",
                "Isn't this where the measles outbreak is also concentrated?\n\nWho will be the first fundamentalist to start claiming something like \".....it's a message from God because too many people are still getting vaccinated....\"",
                "Just hope they are not counting on FEMA help.",
                "There was a 3.1 magnitude earthquake in Socorro on Tuesday as well.",
                "Does anyone know if these fracking caused earthquakes are trending up in magnitude over time and if there is a general upper limit for fracking earthquakes or it is their magnitude purely a function of very local geology?",
                "For some reason i briefly thought there was somehow a city in West Texas called New Mexico"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Montreal woman dies at 32 after being told she was ‘too young for breast cancer’",
            "external_url": "https://www.ctvnews.ca/health/article/montreal-woman-dies-at-32-after-being-told-she-was-too-young-for-breast-cancer/",
            "upvotes": 27268,
            "date": "05/04/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/FSTITERYMVGAPPEOV7OFRR5OYM.jpeg?smart=true&auth=b392430a689284320ca2112096fbf9b2f397ee3428269f049fd2d976491ddd04&width=1200&height=630",
            "top_comments": [
                "My work partner died in her mid 20s after a battle with breast cancer.\nIf you've got it, you can have cancer in it",
                "How can this be happening in this day and age...? My mother died at 35 after a long fight with breast cancer, and that was in 2000. Women shouldn't be falling through the cracks. This is outrageous. ",
                "My mom had breast cancer at 25. I was a baby. She made it and is still alive today almost 40 years later.",
                "Awful. Rates of certain cancers are increasing in younger demographics. We really need to adjust our screening guidelines. Early diagnosis saves lives",
                "The discrimination towards younger patients is honestly sad",
                "My girlfriend with PCOS and very large cysts was told to \"come back later if it doesn't resolve itself after a while\", because \"it just goes away naturally most of the time\". After (IIRC) about half a year passed of constant, non-stop pain that was bad enough to prevent her from moving up and down the stairs of her own home, and an ovary quite visibly pushing against her abdomen with how swollen from cysts it was, she finally got someone to give enough of a shit to *consider* getting her scheduled for surgery; this wouldn't happen until at the nine month mark, when the ovary experienced a torsion and the pain somehow managed to skyrocket even more - although she was reassured it should sort itself out on its own.\n\nJust a couple weeks or so before the scheduled surgery, the pain started subsiding; while relieved it started to seemingly lighten up, my girlfriend still kept the surgery date so she could get it taken care of. Luckily she did, because it turns out the torsion ***DIDN'T*** sort itself out, the ovary strangled itself of blood supply, and was no longer hurting because it was fucking dead tissue. As it was, due to how filled with decaying tissue it was, had it ruptured at all during the flight home to get her surgery (she was visiting family on the other side of the country when it got scheduled), she would gone into sepsis and died in a matter of hours.\n\nAs it is, the incompetence of self-absorbed, chauvinistic cockwombles led to her losing half of her chances of having children outright. All because she was assured \"it would take care of itself\" as, *WHILE JUST A TEENAGER*, she was actively in tears just from existing.",
                "I knew a girl who died at 24 from stage 4 breast cancer after she went to get a lump checked and they told her it was just a cyst and denied her any further investigation. By the time they finally realised it was too late. I had a lump and had to BEG AND DEMAND a mammogram because I was “too young”. Thankfully nothing but after my friend died I will always advocate for myself.",
                "My first wife was denied a mammogram due to being too young. Ended up being diagnosed with Stage 3 ductal carcinoma at age 28.  Died at age 37.",
                "A woman I loved with all my heart died from breast cancer at 26, in the US, after extensive care. \n\nFUCK CANCER and FUCK ANY GOVERNMENT THAT DEPRIORITIZES DEFEATING IT.",
                "I was diagnosed after 6mo with stage 3 colon cancer at 37. My PCF kinda gave up diagnosing and I got pissed and found a diagnosis. I had to go see him after treatment and he said he was just so sorry and so surprised.\n\nI looked him dead in the face and said \"you fucked up. You assumed it was something else due to my age, gave up, and it cost me 6 critical months. I'm only here seeing you because my insurance required it.\"\n\nHe was a little shocked by that response too."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Cincinnati police fatally shot an armed 18-year-old. The next day, his father killed a sheriff’s deputy, authorities say | CNN",
            "external_url": "https://www.cnn.com/2025/05/03/us/ohio-rodney-hinton-jr-arrest-hnk",
            "upvotes": 23641,
            "date": "05/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21594534-32264-561-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He killed him by running into him full speed while he was directing traffic for UC’s graduation…",
                "To be clear, the sheriff that was killed was not connected to the shooting of the 18 year old.  The father snapped and ran over a sheriff directing traffic.  He watched the body cam video of his son's death and lost it.\n\nSad day for everyone involved",
                "The Sheriff that was killed was doing traffic duty for university of Cincinnati graduation. Heard he was close to retirement.\n\nEdit: already retired and was just helping with traffic",
                "From the article for those wondering what lead to the son being shot by police. \n\n\n\"Hinton Jr.’s son was armed and fleeing from a stolen vehicle when a responding officer fatally shot him, police said. Police body cam footage does not clearly show whether the fleeing man pointed a gun at the officer.\" ",
                "Very sad story the cop wasn't even involved",
                "Armed car thief get shot, his father road kills unrelated officer in rage outburst.\n\nHere you go.",
                "*”One of the officers shot the 18-year-old as he emerged from between two dumpsters, the body cam video showed. On the footage, moments before the shooting another officer can be heard yelling, ‘He’s got a gun! He’s got a gun! On your right! On your right!’*\n\n*The officer said after the shooting that the 18-year-old appeared to point the gun at him, according to Theetge.*”\n\n**If**(!!!) this is true it sounds about as justified as it can get.\n\nNot to mention the cop he killed was just some random guy directing traffic… I’ll wait until more evidence comes out before forming an opinion of the son but the dad sounds like an absolute POS.\n\nEdit: also the guy he killed was a retired reserve cop. The dude was just an old man that probably just wanted to do something to keep himself busy. One of my coworkers does this kind of thing. He’s in his 60s and dresses up like a cop every two months to direct traffic at football games lol. I’m not convinced he even gets paid to do it",
                "My advice to others here: I once got into an argument on Reddit with someone who argued that police shooting/killing an active shooter was extrajudicial punishment/illegal murder and was wrong. Just post your comment and move on, do not engage! It's not worth the time!",
                "I can’t believe how a lot of people are blaming cops for this. This guy’s son stole a car. When get caught instead of surrendering he try to run with a gun in his hand. What do you expect a cop to do? Just wait and let him shoot at them??? \nand the next day his dad go and killed a random cop??? I just can’t believe how people are justifying this.",
                "So a guy is killed by police while brandishing a firearm in the commission of a felony and his father responds by murdering a cop who had nothing to do with it, yeah that family sounds like a great value to society"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Sheinbaum says she rejected Trumps offer to send troops to Mexico",
            "external_url": "https://www.reuters.com/world/americas/sheinbaum-says-she-rejected-trumps-offer-send-troops-mexico-2025-05-03/",
            "upvotes": 5917,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was told Donald Trump was the anti-war, anti-Imperialist President.  Hmm 🤔",
                "The cartels are already armed with American weapons.",
                ">\"In one of the calls, (Trump) said, 'How can we help you fight drug trafficking? I propose that the U.S. Army come in to help you,'\"\n\nThis guy is on crack!",
                "“Yeah, I’ll pass on having your military just enter my country”",
                "I give it until the end of the year, but probably sooner, that Trump sends in troops on Mexican soil anyway. After he gets riled up there, he could very well threaten or actually try sending troops into Canada. Y'know, for \"security reasons.\" He may even just continue claiming Canada as the \"51st state\" and use that as pretense.",
                "It looks like he’s gunna send them anyways",
                "We should've rejected voting in Trump a second time...",
                "Remember kids, vampires can’t enter your house without an invitation.",
                "Thats a funny way to say passive invasion. More of the media sane washing Trump smh. ",
                "Maybe the whole point in crashing the economy was to force an entire younger generation to join the military as the only means of gainful employment, then get dragged into whatever insane military campaigns Trump has in mind with promises to conquer America's way to prosperity."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Former Abercrombie & Fitch CEO is ruled unfit for trial and ordered hospitalized",
            "external_url": "https://abcnews.go.com/US/wireStory/former-abercrombie-fitch-ceo-ruled-unfit-trial-ordered-121417264",
            "upvotes": 3305,
            "date": "05/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1546fa24-1bfa-4c2e-892d-d1f7084e4805/wirestory_be6824abaf11f15b3e82eba45f559e7b_16x9.jpg?w=1600",
            "top_comments": [
                "Poor guy, sex trafficking really takes a toll on your body.",
                "Ah, the Harvey Weinstein defense strategy",
                "That’s cool just take all his money. He won’t remember having it those victims I’m sure would appreciate it.",
                "Looks like Nic Cage in Longlegs",
                "In classic Reddit fashion, nobody read the article. Dude is being institutionalized until he can stand trial, and they said at that point he would (if it never happens… he’s dead in a hospital). Both sides agreed. So basically he’s in “bonus sentence” territory at best at this point. You have to be an absolute ghoul to think a Bureau of Prisons hospitalization is somehow a five star resort.\n\nSome people also saying he’s “suspiciously” and “suddenly” got Alzheimer’s, TBI and dementia. Those following the trial know that’s not a thing, and Alzheimer’s isn’t the kind of thing you just kinda walk with a limp and get diagnosed with agreement from all parties. Four different doctors and the prosecution agreed. “But why just as he’s charged?” Because it’s his lawyers that noticed he wasn’t replying coherently and referred him.\n\nEdit: so many comments about “but he won’t face charges” as if he gives a fuck and is in any position to understand them. I’m sure a custodial clarification against an effective corpse will make the victims families feel awesome.",
                "I wish they would charge these rapists in the prime of their life instead of when they’re in the worst health of their life and knocking on deaths door",
                "Just so hard to believe, the store with near naked teenagers had a predator founder.",
                "100% predator. He got off easy. Fucker.",
                "lot of people in the comments not realizing that this doesn’t mean his was found not guilty or will never have a trial.",
                "Couldn’t have happened to a more deserving predator"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Warren Buffett announces retirement from leading Berkshire Hathaway",
            "external_url": "https://www.theguardian.com/business/2025/may/03/warren-buffett-retirement-berkshire-hathaway",
            "upvotes": 5418,
            "date": "05/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d218a78e339c9698ddcbc45fd9e63371a830d6c/0_167_4352_2611/master/4352.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=15b65b9f6325868b57d16e2ab187bcf7",
            "top_comments": [
                "“I’m getting too old for this shit”",
                "Fella is turning 95 soon.\n\n>Buffett, a Democrat, has previously said that he [plans to donate](https://www.reuters.com/business/finance/buffett-refines-plans-his-fortune-donates-more-berkshire-shares-2024-11-25/#:~:text=Nov%2025%20(Reuters)%20%2D%20Warren,his%20fortune%20after%20his%20death.) 99.5% of his remaining wealth to a charitable trust overseen by his daughter and two sons when he dies. According to Forbes, Buffett has a net worth of $165.3bn.\n\nAnd to think the level of evil this guy could have unleashed with his understanding of the markets - considering he charitably *spent down* to just 165bn.",
                "It's crazy to think this should probably be a big news story but the world is such to where something even crazier will probably happen no later than Tuesday.",
                "I bet he grows his hair out and starts doing yoga. ",
                "Do you think Warren is eligible for social security?",
                "He's heading for the bunker.",
                "Year in year out he had been repeating he ”will never retire”. Something tells me the current admin might have something to do with this change of mind.",
                "Have fun at Margaritaville",
                "Selling stock over last year and saving $300 billion in cash as markets tanked is some move to go out on, hell of a big decision for next leader on what to do with the cash pile. ",
                "I hope his 401k is ok"
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "05/04/2025 12:14:53 UTC"
}