{
    "posts": [
        {
            "category": "HOT",
            "title": "Man sentenced to 53 years in prison in hate crime murder of 6-year-old Palestinian-American boy",
            "external_url": "https://abcnews.go.com/US/man-sentenced-53-years-prison-hate-crime-murder/story?id=121400634",
            "upvotes": 27574,
            "date": "05/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6d0db2c2-7dbe-4bf7-a781-e7a9021e5fb2/Alfayoumi-ap-er-250502_1746199431318_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "No matter what your political, social, cultural or religious views are, if you are killing a 6 year old as result of it, you are wrong.",
                "An Illinois man has been sentenced to 53 years in prison for the 2023 fatal stabbing of a 6-year-old Palestinian-American boy.\n\nWadee Alfayoumi was stabbed 26 times and his mother more than a dozen in the Oct. 14, 2023, attack inside their home in the Chicago suburb of Plainfield.\n\nTheir landlord, 73-year-old Joseph Czuba, was convicted in February on multiple murder charges, as well as attempted murder, aggravated battery and hate crime counts. A Will County jury found Czuba guilty of all counts after deliberating for less than two hours.\n\nAuthorities said he targeted his tenants because they were Muslim and in response to the war between Israel and Hamas that had just ignited after Hamas' Oct. 7, 2023, attack on Israel.\n\nWadee's great uncle, Mahmoud Yousef, addressed the sentencing outside the courthouse, telling reporters, \"It doesn't matter what numbers are. He took a life from us. He took a future.\"\n\nThe child's mother, Hanan Shaheen, was the first to take the stand in the weeklong trial.\n\nShe said Czuba attacked her first with a knife, stabbing her multiple times, saying, \"You devil Muslim, you must die,\" as her son watched, according  to WLS, which was in the courtroom.\n\nShe testified that she called 911 from the bathroom when he appeared to leave, but then she started to hear her son screaming, according to WLS.\n\n\"I started hearing my son screaming, screaming, screaming, 'Oh no, stop,'\" Shaheen said, according to WLS.\n\nJurors also listened to the mother's 911 call from the bathroom, in which she was heard telling the dispatcher, \"He's killing my baby,\" WLS reported.\n\nJurors additionally heard remarks Czuba made in a law enforcement vehicle following the attack.\n\n\"I thought they were going to do jihad on me,\" Czuba said, according to WLS.\n\nHe also said he was \"afraid for my life\" and his wife and said the family was \"just like infested rats,\" according to WLS.",
                "I initially thought, “damn, only 53 years?” But then I realized he’s already an old POS.",
                "\"I thought they were going to do jihad on me,\" Czuba said, according to WLS.\n\n\nWorld's smartest islamophobe",
                "[removed]",
                "There is a special circle of hell for people like this.",
                "It’s amazing how religious fanatics claim they love god, and think they are better than everyone else, but yet they do the work of the devil, or whatever they call him in their religion.",
                "This guy can rot in hell, murdering a 5-year old for his religion, there are no words",
                "Omg poor little boy. May he RIP.  Anyone that hurts a child is just a monster \n\nI really wish reddit didn’t have the news just in the middle of scrolling and saw this post, it’s so depressing and heartbreaking. As someone with a young son it just brings me such anxiety and pain to read stories of kids being killed :(",
                "You can thank Fox News and all the other right wing media for the death of this child."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "National Science Foundation Halts Funding Indefinitely",
            "external_url": "https://www.scientificamerican.com/article/under-trump-national-science-foundation-cuts-off-all-funding-to-scientists/",
            "upvotes": 1364,
            "date": "05/03/2025",
            "thumbnail": "https://static.scientificamerican.com/dam/m/2737c995ce342838/original/NSF_Logo_on-HQ.jpg?m=1746204485.782&w=1200",
            "top_comments": [
                "This is so fucked! What's the point of taking intellectualism back to the fucking stone age?!??",
                "Oh God...they told us right there in print what they were going to do and people laughed.  \"Trump just being Trump\" was the most common excuse I heard \n\n\"He doesn't really mean it\"  \n\nYeah none of us are laughing now...more like screaming in terror.",
                "All of these things are traps set for anyone in the future who would try to fix the damage: they would have to spend a LOT of money to restart all these programs.",
                "\"Hell is empty, and all the devils are here.\"",
                "If you don't have a sense for scale, this is IMO the biggest news in weeks. Smart people can't do stuff without their NSF grants. Wow. ",
                "I'm funded through the NSF. Overall, the atmosphere in research has been incredibly dim. No one sees even the slightest light at the end of the tunnel.",
                "Looks like we just maxed the tech tree for this playthrough.",
                "Wow, I don't think ppl understand the gravity of this news. Sadly, without scientists they won't have anyone to explain it to them either. This would shutdown most University STEM research programs.",
                "With all this \"cost savings\" they conveniently neglect to mention how much investment they're torching by preventing the completion of these studies.  Many years of scientific research and the funding that supported it will rot on the vine because they're effectively preventing the harvest.  They're f@#$&# liquidating taxpayer investments before they mature... At best to claim they saved a buck.  At worst to intentionally sabotage the government, the dollar, the country, and modern western society.",
                "This is how you truly crash the economy.\n\nCut all funding to science, thus stifling the innovation and invention that drives the economy."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "CDC reports 216 child deaths this flu season, the most in 15 years.",
            "external_url": "https://www.nbcnews.com/health/cold-and-flu/cdc-reports-216-child-deaths-flu-season-15-years-rcna204468",
            "upvotes": 6722,
            "date": "05/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-12/241217-covid-ch-0958-6da6ba.jpg",
            "top_comments": [
                "Time to do away with the CDC child death reporting department.",
                ">There are likely several contributors to this season’s severity, but a big one is that fewer children get flu shots, added O’Leary, a University of Colorado pediatric infectious diseases specialist.\n\n>The flu vaccination rate for U.S. children has plummeted from about 64% five years ago to 49% this season.\n\nDamn, really? That’s an alarming trend.",
                "It was a bad flu season. :/ - signed a pediatrician",
                "If only medicine could come up with a way to prevent children from getting the flu...",
                "People really gonna have to learn all over again why these vaccinations are a thing.",
                "Surely we'll be fine next year\n\nhttps://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-confirms-cancellation-vaccine-advisers-meeting-2025-02-27/",
                "The most in 15 years SO FAR",
                "Republicans: \"There are no amount of kids deaths that is more immportant then me not getting stuck with a needle.\" ",
                "If children are dying of flu in 2025 without extenuating medical circumstances, then their parents are guilty of neglect. Simple as that.",
                " Next year we’ll surely beat this number… since we may not even get a vaccine."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Conservative MP will resign Alberta riding so Poilievre can run again | Globalnews.ca",
            "external_url": "https://globalnews.ca/news/11161267/pierre-poilievre-running-again-alberta/",
            "upvotes": 5315,
            "date": "05/02/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/04/b6dae6fca70b2303a683a628bd7e02b6102a36b480a1c8e090066858390ee6fe_1ba569.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "Say what you want, but this is a little bit embarrassing for him.",
                "Nothing says personal responsibility like blowing a 27-point lead, losing your own seat, then getting someone else to take the fall.",
                "Doesn’t really seem right, losing your riding so just picking another, guaranteed riding. Not really the will of the people who voted against you.",
                "I know this is common in Westminster parliamentary systems but I don't like this. If you lose, you lose. He's not really a resident of that Alberta riding/district. He's just pretending to be. (Yes I know district shopping happens in America too. I don't like it either).\n\nA MMP legislature with party lists would solve this issue and have the added effect of allowing voters to be better represented in parliament.",
                "God damn it. This is my riding. \nI guess I'll get the chance to call him a cunt in person.",
                "Here's hoping Poilievre gets embarrassed again!",
                "It would be fucking hilarious if he loses again",
                "Things are turning up milhouse",
                "Let him run\n\nLet him run for PM for the rest of his life\n\nHis policies suck, he sucks, he's a shit person and a has a shitty personality.",
                "My boss is super conservative and just before the election he was very vocal about \"if you lose your seat you should be fired\". You lose your out mentality.\n\nStrangely, he hasn't brought it up since the election!"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "RFK Jr plans placebo-trial testing for 'all new vaccines'",
            "external_url": "https://www.bbc.co.uk/news/articles/crkx3egk3ygo?fbclid=PAQ0xDSwKBlMBleHRuA2FlbQIxMQABpxz-vcbOrpXyUIHbPkD3JoXLspK0TLUXLuOcteBADjQhncwVIbIUdrNn0JIM_aem_7pfTbvCYLxHUeeNvWyACMQ",
            "upvotes": 11388,
            "date": "05/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/37c6/live/d61a2670-26a6-11f0-b505-55b7c1f611de.jpg",
            "top_comments": [
                "Give him the placebos and us the vaccines.",
                "Aren't clinical trials for new vaccines double-blind with placebo controls anyways? Like this is standard practice.",
                "Using a true placebo is actually a terrible research design when there is an existing standard vaccine. Dude is a fucking idiot.",
                "\"some of you may die but that's a price I am willing to pay\" -L. Farquot",
                "The Kennedy’s lobotomized the wrong one",
                "I think RFK is the best choice for a test subject. Be sure to send him in the most virulent environment to have thorough result.",
                "This is extremely unethical behavior…and it also won’t convince skeptics. If they don’t believe the huge effect sizes MMR vaccine adoption shows, they won’t believe anything.",
                "Can we please get Bobbie Brainworms out and an actual medical professional to make critical care decisions. Why are we allowing this clearly crazy man to dictate health policy. He is literally brain damaged. The US is insane.",
                "Are these “trials” going to be actual trials or just fake experiments to confirm their bias against",
                "RFK is the mengele of the magas"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Trump signs executive order directing federal funding cuts to PBS and NPR",
            "external_url": "https://apnews.com/article/trump-npr-pbs-republicans-public-broadcasting-f0e3e1acb96986732a0211833165bf84",
            "upvotes": 19599,
            "date": "05/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What is the point of having a Congress when one person can so completely change the course of so many things?",
                "Back in my day, the executive’s job was to *execute* the laws enacted by the legislature, not undermine them.",
                "Republicans have given up the legislative branch completely and are trying to help weaken the judicial as well. Pathetic. They are all worthless cunts.",
                "Republicans in Congress are the chair facing the bed in the hotel room.",
                "The good news is apparently NPR gets about one percent of its budget from the feds. This will largely hurt public tv and radio in less affluent states.",
                "So basically this means gov censorship to things they don’t agree with. Let’s not pretend this is anything but that.",
                "Congress approved this funding in the ‘60s. You can’t just EO that away. More performative nonsense from Dementia Don",
                "I was reading an article in CNN about this, in which it was cited that Republicans were complaining that PBS programs have a \"liberal\" bias.  What a crock of shit.  I'd been listening to PBS Newshour podcast for the past few months and it's been such a breath of fresh air.  It's nearly an hour and ad-free, so they can really delve into stories.  Their political coverage is especially good, and they always have conservatives on to give their perspective as well as liberals.",
                "There goes free entertainment and unbiased news.",
                "How did the Nazis feel about the BBC? They confiscated all the radios!"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Sean 'Diddy' Combs rejects plea deal ahead of sex trafficking trial",
            "external_url": "https://abcnews.go.com/US/sean-diddy-combs-rejects-plea-deal-ahead-sex/story?id=121371141",
            "upvotes": 1989,
            "date": "05/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6cffb08e-de0f-45e2-b3da-d733b13eadd0/Diddy-ap-er-250501_1746127092174_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Great news. That means he’ll never get out.",
                ">Maurene Comey, an assistant United States attorney, said a guilty plea would have reduced the amount of prison time Combs would be exposed to compared to a trial conviction on all counts, which could result in what is effectively a life sentence.\n\nHe brought on a new lawyer earlier this week. And is first lawyer was allowed to leave in February.",
                "Diddy is one of those people who will just continue being a creep. He shouldn't be in society at any age.",
                "While most regular people would take a plea from the feds, someone of Diddy's level of fame and wealth usually never does so this is not surprising.",
                "Prosecutors better not mess this up.",
                "[removed]",
                "Dude's 55. Considering the seriousness of the allegations, it might be a life sentence for him regardless. I'd bet the best he could've gotten was the potential for parole, but he's almost certainly not getting that now.",
                "The thing a lot of people seem to miss is that Diddy is the lone defendant named in the case involving racketeering, conspiracy, sex trafficking and prostitution, according to the [US DOJ] (https://www.justice.gov/usao-sdny/media/1368556/dl) criminal filing.\n\nConvincing a jury that he didn't have any help or  no one else involved \nin a criminal enterprise was worthy of being named as defendants in a RICO case is wild.  \n\nGonna be interesting to see how this all plays out.",
                "I wonder what kind of leverage he has in order to pursue this route",
                "He really is one of those people who should do the *opposite* of whatever they think they should do."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Army plans for a potential parade on Trump’s birthday call for 6,600 soldiers",
            "external_url": "https://www.cnn.com/2025/05/01/politics/army-plans-military-parade-trump-birthday",
            "upvotes": 7840,
            "date": "05/02/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2212098240-20250502004058129.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He's wanted this for a long time.  I agree with something John Oliver said to the effect of \"yeah he'll get it and as he watches it roll by he'll think, no... this doesn't do it either.  It still doesn't fill the giant hole in me where my father's love should be.\"",
                "Someone tell DOGE to look at the costs involved here!",
                "If not dictator, why dictator shaped",
                "The phrase that stuck with me when this was proposed during Trump 1.0 was \"third world bullshit\".  IIIRC the guy who said that also killed Bin Laden and happens to be pretty politically conservative.     \n\n   Military specific parades\\* and officers wearing huge hats are warning signs that you live in an authoritarian shit hole.    If there are any major changes to the military dress uniforms during Trump's presidency, Canada here I come.     \n\n   \n\n  \\*Ceremonial segments of our military, like marching bands, joining other parades is 100% OK and a great way to recognize our service members.   It's rolling tanks and troops through the middle of a city that is problematic.",
                "Many Federal employees were fired for this.",
                "In 1775 the Army was created to take down a tyrant.  250 years later they dance for one.",
                "Trump wants the Hitler style  parades in his honor .the man doesn’t have an ounce of humility.  I can’t believe his head hasn’t exploded by now.",
                "TL;DR:\nThe Army is planning a large birthday festival for its 250th anniversary on June 14 — which is also Trump's birthday — and may add a military parade involving over 6,600 troops, 150+ vehicles, 50 helicopters, and bands. The parade is still under discussion, pending White House approval, and could cost tens of millions. Concerns include security, logistics, housing troops, and road damage from heavy vehicles. Trump has long wanted such a parade, but high costs and local objections stopped past efforts.",
                "ya we dont do military parades for the servant office of the president.  He is a servant.  Im just gonna make sure to say that every time.  servant trump.",
                "A military parade for a draft dodger... Oh the irony."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Cat survives 380-foot fall that killed couple hiking in Utah's Bryce Canyon National Park, animal sanctuary says",
            "external_url": "https://www.cbsnews.com/news/cat-survives-380-foot-fall-killed-couple-bryce-canyon-national-park-utah/",
            "upvotes": 2625,
            "date": "05/02/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/02/66ba8d9f-b5d2-4ae5-b009-444bfa8c2f20/thumbnail/1200x630/c6db1ff76635773da1dcc7ee94e2f465/mirage-gp4dg0xxaaasofk.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                ">The feline \"was found in a black soft-sided carrier that was dirty and torn, but seemed to have weathered the fall fairly well,\" the Best Friends Animal Society said.\n\nHow much of that was due to the carrier?",
                ">Tourists spotted the bodies Tuesday below Inspiration Point after the two fell late Monday or early Tuesday, the Garfield County Sheriff's Office said in a statement. How they fell was unknown, but they had crossed over safety railings, according to the statement.\n\nThe safety railing looks to be around 4 feet high and well maintained from some of the pictures.",
                "The cat was in a carrier. I wouldn't have been too surprised at a cat free-falling where it can orient itself. Being in a carrier meant it couldn't do that.\n\nOn the other hand, the carrier might have protected it from being scratched or impaled.",
                "poor senior baby 🥺 she better get all the treats. all of them.",
                "Man, I really want to go home to my cats right now.",
                "Am I the only one thinking this was intentional? Why else bring the cat? And in the dead of night? I'm thinking they meant to jump.",
                "These people were incredibly stupid and not to mention thoughtless when it came to the safety of their pet. All for a photo!",
                "So not only did they climb over a safety fence, they brought their cat with them?  Just horrible, evil shit to do.   Or at the very least, highly inconsiderate.  \n\nAlso, cats are so good at surviving things.   [This cat survived for two months in a closed shipping container](https://www.thesun.co.uk/news/12628172/miracle-cat-two-months-trappe-shipping-container-spiders/).",
                ">Nannen and Crane were living in a U-Haul van and recently spent a significant amount of time in Arizona. Florida was their last state of permanent residence, according to the sheriff's office.\n\nCertainly paints a picture.",
                "Maybe they jumped and took the cat with them."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "Chile issues tsunami warning after earthquake",
            "external_url": "https://www.bbc.co.uk/news/articles/c8dg32qmg7qo",
            "upvotes": 3131,
            "date": "05/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/99a5/live/e6e77660-276e-11f0-8c66-ebf25fc2cfef.jpg",
            "top_comments": [
                "Magnitude 7.4, 219 km south of Ushuaia, Argentina. That's extremely south, far from heavily populated areas.",
                "Chile takes these threats seriously, and it shows. Their early warning systems are some of the best in the world.",
                "Whoa, in the Drake Passage, one of the worst sailing spots, IN THE WORLD, and a tsunami. Thoughts go out to everyone in that passage right now",
                "Hope there are no deaths and everyone comes out safe",
                "if i lived there, i would be concerned.",
                "\"people should evacuate coastal area\"\n\n... how? where? Whole country is a coastal area.\n\n\nEdit: Way too many of you responded seriously to my tongue-in-cheek comment. Get off your high horses, people. And no, I don't think every similar comment should be flagged with a   /s\n\n\nI was actually visiting that area of Chile just last month, I know you're not stuck on the coast and you can drive for hours eastward.",
                "I hope everyone's gonna be okay, holy crap ",
                "Next time, ticket and fine the tsunami. The warnings are obviously not working!",
                "Trump is readying rolls of paper towels as we speak",
                "Let’s hope there are few casualties, and The Times newspaper finally gets to print their headline. "
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "National Science Foundation Halts Funding Indefinitely",
            "external_url": "https://www.scientificamerican.com/article/under-trump-national-science-foundation-cuts-off-all-funding-to-scientists/",
            "upvotes": 1359,
            "date": "05/03/2025",
            "thumbnail": "https://static.scientificamerican.com/dam/m/2737c995ce342838/original/NSF_Logo_on-HQ.jpg?m=1746204485.782&w=1200",
            "top_comments": [
                "This is so fucked! What's the point of taking intellectualism back to the fucking stone age?!??",
                "Oh God...they told us right there in print what they were going to do and people laughed.  \"Trump just being Trump\" was the most common excuse I heard \n\n\"He doesn't really mean it\"  \n\nYeah none of us are laughing now...more like screaming in terror.",
                "All of these things are traps set for anyone in the future who would try to fix the damage: they would have to spend a LOT of money to restart all these programs.",
                "\"Hell is empty, and all the devils are here.\"",
                "If you don't have a sense for scale, this is IMO the biggest news in weeks. Smart people can't do stuff without their NSF grants. Wow. ",
                "I'm funded through the NSF. Overall, the atmosphere in research has been incredibly dim. No one sees even the slightest light at the end of the tunnel.",
                "Looks like we just maxed the tech tree for this playthrough.",
                "Wow, I don't think ppl understand the gravity of this news. Sadly, without scientists they won't have anyone to explain it to them either. This would shutdown most University STEM research programs.",
                "With all this \"cost savings\" they conveniently neglect to mention how much investment they're torching by preventing the completion of these studies.  Many years of scientific research and the funding that supported it will rot on the vine because they're effectively preventing the harvest.  They're f@#$&# liquidating taxpayer investments before they mature... At best to claim they saved a buck.  At worst to intentionally sabotage the government, the dollar, the country, and modern western society.",
                "This is how you truly crash the economy.\n\nCut all funding to science, thus stifling the innovation and invention that drives the economy."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Sean 'Diddy' Combs rejects plea deal ahead of sex trafficking trial",
            "external_url": "https://abcnews.go.com/US/sean-diddy-combs-rejects-plea-deal-ahead-sex/story?id=121371141",
            "upvotes": 1987,
            "date": "05/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6cffb08e-de0f-45e2-b3da-d733b13eadd0/Diddy-ap-er-250501_1746127092174_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Great news. That means he’ll never get out.",
                ">Maurene Comey, an assistant United States attorney, said a guilty plea would have reduced the amount of prison time Combs would be exposed to compared to a trial conviction on all counts, which could result in what is effectively a life sentence.\n\nHe brought on a new lawyer earlier this week. And is first lawyer was allowed to leave in February.",
                "Diddy is one of those people who will just continue being a creep. He shouldn't be in society at any age.",
                "While most regular people would take a plea from the feds, someone of Diddy's level of fame and wealth usually never does so this is not surprising.",
                "Prosecutors better not mess this up.",
                "[removed]",
                "Dude's 55. Considering the seriousness of the allegations, it might be a life sentence for him regardless. I'd bet the best he could've gotten was the potential for parole, but he's almost certainly not getting that now.",
                "The thing a lot of people seem to miss is that Diddy is the lone defendant named in the case involving racketeering, conspiracy, sex trafficking and prostitution, according to the [US DOJ] (https://www.justice.gov/usao-sdny/media/1368556/dl) criminal filing.\n\nConvincing a jury that he didn't have any help or  no one else involved \nin a criminal enterprise was worthy of being named as defendants in a RICO case is wild.  \n\nGonna be interesting to see how this all plays out.",
                "I wonder what kind of leverage he has in order to pursue this route",
                "He really is one of those people who should do the *opposite* of whatever they think they should do."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Man sentenced to 53 years in prison in hate crime murder of 6-year-old Palestinian-American boy",
            "external_url": "https://abcnews.go.com/US/man-sentenced-53-years-prison-hate-crime-murder/story?id=121400634",
            "upvotes": 27565,
            "date": "05/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6d0db2c2-7dbe-4bf7-a781-e7a9021e5fb2/Alfayoumi-ap-er-250502_1746199431318_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "No matter what your political, social, cultural or religious views are, if you are killing a 6 year old as result of it, you are wrong.",
                "An Illinois man has been sentenced to 53 years in prison for the 2023 fatal stabbing of a 6-year-old Palestinian-American boy.\n\nWadee Alfayoumi was stabbed 26 times and his mother more than a dozen in the Oct. 14, 2023, attack inside their home in the Chicago suburb of Plainfield.\n\nTheir landlord, 73-year-old Joseph Czuba, was convicted in February on multiple murder charges, as well as attempted murder, aggravated battery and hate crime counts. A Will County jury found Czuba guilty of all counts after deliberating for less than two hours.\n\nAuthorities said he targeted his tenants because they were Muslim and in response to the war between Israel and Hamas that had just ignited after Hamas' Oct. 7, 2023, attack on Israel.\n\nWadee's great uncle, Mahmoud Yousef, addressed the sentencing outside the courthouse, telling reporters, \"It doesn't matter what numbers are. He took a life from us. He took a future.\"\n\nThe child's mother, Hanan Shaheen, was the first to take the stand in the weeklong trial.\n\nShe said Czuba attacked her first with a knife, stabbing her multiple times, saying, \"You devil Muslim, you must die,\" as her son watched, according  to WLS, which was in the courtroom.\n\nShe testified that she called 911 from the bathroom when he appeared to leave, but then she started to hear her son screaming, according to WLS.\n\n\"I started hearing my son screaming, screaming, screaming, 'Oh no, stop,'\" Shaheen said, according to WLS.\n\nJurors also listened to the mother's 911 call from the bathroom, in which she was heard telling the dispatcher, \"He's killing my baby,\" WLS reported.\n\nJurors additionally heard remarks Czuba made in a law enforcement vehicle following the attack.\n\n\"I thought they were going to do jihad on me,\" Czuba said, according to WLS.\n\nHe also said he was \"afraid for my life\" and his wife and said the family was \"just like infested rats,\" according to WLS.",
                "I initially thought, “damn, only 53 years?” But then I realized he’s already an old POS.",
                "\"I thought they were going to do jihad on me,\" Czuba said, according to WLS.\n\n\nWorld's smartest islamophobe",
                "[removed]",
                "There is a special circle of hell for people like this.",
                "It’s amazing how religious fanatics claim they love god, and think they are better than everyone else, but yet they do the work of the devil, or whatever they call him in their religion.",
                "This guy can rot in hell, murdering a 5-year old for his religion, there are no words",
                "Omg poor little boy. May he RIP.  Anyone that hurts a child is just a monster \n\nI really wish reddit didn’t have the news just in the middle of scrolling and saw this post, it’s so depressing and heartbreaking. As someone with a young son it just brings me such anxiety and pain to read stories of kids being killed :(",
                "You can thank Fox News and all the other right wing media for the death of this child."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Conservative MP will resign Alberta riding so Poilievre can run again | Globalnews.ca",
            "external_url": "https://globalnews.ca/news/11161267/pierre-poilievre-running-again-alberta/",
            "upvotes": 5316,
            "date": "05/02/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/04/b6dae6fca70b2303a683a628bd7e02b6102a36b480a1c8e090066858390ee6fe_1ba569.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "Say what you want, but this is a little bit embarrassing for him.",
                "Nothing says personal responsibility like blowing a 27-point lead, losing your own seat, then getting someone else to take the fall.",
                "Doesn’t really seem right, losing your riding so just picking another, guaranteed riding. Not really the will of the people who voted against you.",
                "I know this is common in Westminster parliamentary systems but I don't like this. If you lose, you lose. He's not really a resident of that Alberta riding/district. He's just pretending to be. (Yes I know district shopping happens in America too. I don't like it either).\n\nA MMP legislature with party lists would solve this issue and have the added effect of allowing voters to be better represented in parliament.",
                "God damn it. This is my riding. \nI guess I'll get the chance to call him a cunt in person.",
                "Here's hoping Poilievre gets embarrassed again!",
                "It would be fucking hilarious if he loses again",
                "Things are turning up milhouse",
                "Let him run\n\nLet him run for PM for the rest of his life\n\nHis policies suck, he sucks, he's a shit person and a has a shitty personality.",
                "My boss is super conservative and just before the election he was very vocal about \"if you lose your seat you should be fired\". You lose your out mentality.\n\nStrangely, he hasn't brought it up since the election!"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "CDC reports 216 child deaths this flu season, the most in 15 years.",
            "external_url": "https://www.nbcnews.com/health/cold-and-flu/cdc-reports-216-child-deaths-flu-season-15-years-rcna204468",
            "upvotes": 6711,
            "date": "05/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-12/241217-covid-ch-0958-6da6ba.jpg",
            "top_comments": [
                "Time to do away with the CDC child death reporting department.",
                ">There are likely several contributors to this season’s severity, but a big one is that fewer children get flu shots, added O’Leary, a University of Colorado pediatric infectious diseases specialist.\n\n>The flu vaccination rate for U.S. children has plummeted from about 64% five years ago to 49% this season.\n\nDamn, really? That’s an alarming trend.",
                "It was a bad flu season. :/ - signed a pediatrician",
                "If only medicine could come up with a way to prevent children from getting the flu...",
                "People really gonna have to learn all over again why these vaccinations are a thing.",
                "Surely we'll be fine next year\n\nhttps://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-confirms-cancellation-vaccine-advisers-meeting-2025-02-27/",
                "The most in 15 years SO FAR",
                "Republicans: \"There are no amount of kids deaths that is more immportant then me not getting stuck with a needle.\" ",
                "If children are dying of flu in 2025 without extenuating medical circumstances, then their parents are guilty of neglect. Simple as that.",
                " Next year we’ll surely beat this number… since we may not even get a vaccine."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "US Approved Sale Of SeaVision Maritime Software To Indian Navy For $131 Million",
            "external_url": "https://voznation.com/us-approved-sale-of-seavision-maritime-software-to-indian-navy-for-131-million/",
            "upvotes": 294,
            "date": "05/02/2025",
            "thumbnail": "https://i0.wp.com/voznation.com/wp-content/uploads/2025/05/SeaVision-Deal-with-USA.jpg",
            "top_comments": [
                "Wasn't there an announcement yesterday that we were not going to do business with countries that buy oil from Iran?",
                "Meanwhile China and India.\n\nYeah we heard that before",
                "For US, it was never about who is doing the right or wrong thing. its always about what or who can benefit US in the short term. We are too blind and too ignorant to see the impact of certain decisions in the long run.",
                "Thumbnail shows 113mil",
                "The US doesn’t have friends it has interests",
                "Can they sell me SeaQuest DSV?",
                "India will sell SeaVision to China at a hefty markup.",
                "Is it a $131 million deal or just $113\n\n\nGetting mixed messaging here"
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "NEW",
            "title": "Cat survives 380-foot fall that killed couple hiking in Utah's Bryce Canyon National Park, animal sanctuary says",
            "external_url": "https://www.cbsnews.com/news/cat-survives-380-foot-fall-killed-couple-bryce-canyon-national-park-utah/",
            "upvotes": 2625,
            "date": "05/02/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/02/66ba8d9f-b5d2-4ae5-b009-444bfa8c2f20/thumbnail/1200x630/c6db1ff76635773da1dcc7ee94e2f465/mirage-gp4dg0xxaaasofk.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                ">The feline \"was found in a black soft-sided carrier that was dirty and torn, but seemed to have weathered the fall fairly well,\" the Best Friends Animal Society said.\n\nHow much of that was due to the carrier?",
                ">Tourists spotted the bodies Tuesday below Inspiration Point after the two fell late Monday or early Tuesday, the Garfield County Sheriff's Office said in a statement. How they fell was unknown, but they had crossed over safety railings, according to the statement.\n\nThe safety railing looks to be around 4 feet high and well maintained from some of the pictures.",
                "The cat was in a carrier. I wouldn't have been too surprised at a cat free-falling where it can orient itself. Being in a carrier meant it couldn't do that.\n\nOn the other hand, the carrier might have protected it from being scratched or impaled.",
                "poor senior baby 🥺 she better get all the treats. all of them.",
                "Man, I really want to go home to my cats right now.",
                "Am I the only one thinking this was intentional? Why else bring the cat? And in the dead of night? I'm thinking they meant to jump.",
                "These people were incredibly stupid and not to mention thoughtless when it came to the safety of their pet. All for a photo!",
                "So not only did they climb over a safety fence, they brought their cat with them?  Just horrible, evil shit to do.   Or at the very least, highly inconsiderate.  \n\nAlso, cats are so good at surviving things.   [This cat survived for two months in a closed shipping container](https://www.thesun.co.uk/news/12628172/miracle-cat-two-months-trappe-shipping-container-spiders/).",
                ">Nannen and Crane were living in a U-Haul van and recently spent a significant amount of time in Arizona. Florida was their last state of permanent residence, according to the sheriff's office.\n\nCertainly paints a picture.",
                "Maybe they jumped and took the cat with them."
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "NEW",
            "title": "Activist aid ship hit by drones on way to Gaza, NGO says",
            "external_url": "https://www.reuters.com/world/middle-east/ship-carrying-activists-aid-gaza-attacked-by-drones-ngo-says-2025-05-02/",
            "upvotes": 2649,
            "date": "05/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So that's an unarmed aid vessel OUTSIDE of an active warzone being indiscriminately attacked.",
                "nobody's mentioning how this ship was near MALTA, international waters next to Italy. It would be disgusting enough if it was close to Gaza but this is completely indefensible shit, as if we haven't seen enough",
                "Israel has had multiple chances to put Netanyahu out to pasture for good, but the majority must love war crimes as much as he does.",
                "The attacked vessel is named *Conscience*, a thing that the IDF is completely lacking.",
                "Totally in line with the World's Most Moral Army.",
                "Let me guess, terrorists we’re hidden in the food? Or was the medicine poison meant as weapons?",
                "Yeah but Kneecap said Fuck Israel at Coachella, so this is justified.",
                "Every single day something new with this regime. The world is SICK and TIRED! I pray Israelis stand up to the war crimes and atrocities committed in their name by their government. All life is sacred in Judaism- where is the integrity? \n\nEdit: we need more of this: https://www.bbc.com/news/articles/crldw5gklrro.amp",
                "article about drones of unknown origin hitting a ship of the coast of malta that was bound for gaza\n\nthis reddit instantly start the israel hate train going with 0 evidence\n\nstay classy",
                "Israel is a terrorist state."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Chile issues tsunami warning after earthquake",
            "external_url": "https://www.bbc.co.uk/news/articles/c8dg32qmg7qo",
            "upvotes": 3132,
            "date": "05/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/99a5/live/e6e77660-276e-11f0-8c66-ebf25fc2cfef.jpg",
            "top_comments": [
                "Magnitude 7.4, 219 km south of Ushuaia, Argentina. That's extremely south, far from heavily populated areas.",
                "Chile takes these threats seriously, and it shows. Their early warning systems are some of the best in the world.",
                "Whoa, in the Drake Passage, one of the worst sailing spots, IN THE WORLD, and a tsunami. Thoughts go out to everyone in that passage right now",
                "Hope there are no deaths and everyone comes out safe",
                "if i lived there, i would be concerned.",
                "\"people should evacuate coastal area\"\n\n... how? where? Whole country is a coastal area.\n\n\nEdit: Way too many of you responded seriously to my tongue-in-cheek comment. Get off your high horses, people. And no, I don't think every similar comment should be flagged with a   /s\n\n\nI was actually visiting that area of Chile just last month, I know you're not stuck on the coast and you can drive for hours eastward.",
                "I hope everyone's gonna be okay, holy crap ",
                "Next time, ticket and fine the tsunami. The warnings are obviously not working!",
                "Trump is readying rolls of paper towels as we speak",
                "Let’s hope there are few casualties, and The Times newspaper finally gets to print their headline. "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "RFK Jr plans placebo-trial testing for 'all new vaccines'",
            "external_url": "https://www.bbc.co.uk/news/articles/crkx3egk3ygo?fbclid=PAQ0xDSwKBlMBleHRuA2FlbQIxMQABpxz-vcbOrpXyUIHbPkD3JoXLspK0TLUXLuOcteBADjQhncwVIbIUdrNn0JIM_aem_7pfTbvCYLxHUeeNvWyACMQ",
            "upvotes": 11393,
            "date": "05/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/37c6/live/d61a2670-26a6-11f0-b505-55b7c1f611de.jpg",
            "top_comments": [
                "Give him the placebos and us the vaccines.",
                "Aren't clinical trials for new vaccines double-blind with placebo controls anyways? Like this is standard practice.",
                "Using a true placebo is actually a terrible research design when there is an existing standard vaccine. Dude is a fucking idiot.",
                "\"some of you may die but that's a price I am willing to pay\" -L. Farquot",
                "The Kennedy’s lobotomized the wrong one",
                "I think RFK is the best choice for a test subject. Be sure to send him in the most virulent environment to have thorough result.",
                "This is extremely unethical behavior…and it also won’t convince skeptics. If they don’t believe the huge effect sizes MMR vaccine adoption shows, they won’t believe anything.",
                "Can we please get Bobbie Brainworms out and an actual medical professional to make critical care decisions. Why are we allowing this clearly crazy man to dictate health policy. He is literally brain damaged. The US is insane.",
                "Are these “trials” going to be actual trials or just fake experiments to confirm their bias against",
                "RFK is the mengele of the magas"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "National Science Foundation Halts Funding Indefinitely",
            "external_url": "https://www.scientificamerican.com/article/under-trump-national-science-foundation-cuts-off-all-funding-to-scientists/",
            "upvotes": 1361,
            "date": "05/03/2025",
            "thumbnail": "https://static.scientificamerican.com/dam/m/2737c995ce342838/original/NSF_Logo_on-HQ.jpg?m=1746204485.782&w=1200",
            "top_comments": [
                "This is so fucked! What's the point of taking intellectualism back to the fucking stone age?!??",
                "Oh God...they told us right there in print what they were going to do and people laughed.  \"Trump just being Trump\" was the most common excuse I heard \n\n\"He doesn't really mean it\"  \n\nYeah none of us are laughing now...more like screaming in terror.",
                "All of these things are traps set for anyone in the future who would try to fix the damage: they would have to spend a LOT of money to restart all these programs.",
                "\"Hell is empty, and all the devils are here.\"",
                "If you don't have a sense for scale, this is IMO the biggest news in weeks. Smart people can't do stuff without their NSF grants. Wow. ",
                "I'm funded through the NSF. Overall, the atmosphere in research has been incredibly dim. No one sees even the slightest light at the end of the tunnel.",
                "Looks like we just maxed the tech tree for this playthrough.",
                "Wow, I don't think ppl understand the gravity of this news. Sadly, without scientists they won't have anyone to explain it to them either. This would shutdown most University STEM research programs.",
                "With all this \"cost savings\" they conveniently neglect to mention how much investment they're torching by preventing the completion of these studies.  Many years of scientific research and the funding that supported it will rot on the vine because they're effectively preventing the harvest.  They're f@#$&# liquidating taxpayer investments before they mature... At best to claim they saved a buck.  At worst to intentionally sabotage the government, the dollar, the country, and modern western society.",
                "This is how you truly crash the economy.\n\nCut all funding to science, thus stifling the innovation and invention that drives the economy."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Man sentenced to 53 years in prison in hate crime murder of 6-year-old Palestinian-American boy",
            "external_url": "https://abcnews.go.com/US/man-sentenced-53-years-prison-hate-crime-murder/story?id=121400634",
            "upvotes": 27575,
            "date": "05/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6d0db2c2-7dbe-4bf7-a781-e7a9021e5fb2/Alfayoumi-ap-er-250502_1746199431318_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "No matter what your political, social, cultural or religious views are, if you are killing a 6 year old as result of it, you are wrong.",
                "An Illinois man has been sentenced to 53 years in prison for the 2023 fatal stabbing of a 6-year-old Palestinian-American boy.\n\nWadee Alfayoumi was stabbed 26 times and his mother more than a dozen in the Oct. 14, 2023, attack inside their home in the Chicago suburb of Plainfield.\n\nTheir landlord, 73-year-old Joseph Czuba, was convicted in February on multiple murder charges, as well as attempted murder, aggravated battery and hate crime counts. A Will County jury found Czuba guilty of all counts after deliberating for less than two hours.\n\nAuthorities said he targeted his tenants because they were Muslim and in response to the war between Israel and Hamas that had just ignited after Hamas' Oct. 7, 2023, attack on Israel.\n\nWadee's great uncle, Mahmoud Yousef, addressed the sentencing outside the courthouse, telling reporters, \"It doesn't matter what numbers are. He took a life from us. He took a future.\"\n\nThe child's mother, Hanan Shaheen, was the first to take the stand in the weeklong trial.\n\nShe said Czuba attacked her first with a knife, stabbing her multiple times, saying, \"You devil Muslim, you must die,\" as her son watched, according  to WLS, which was in the courtroom.\n\nShe testified that she called 911 from the bathroom when he appeared to leave, but then she started to hear her son screaming, according to WLS.\n\n\"I started hearing my son screaming, screaming, screaming, 'Oh no, stop,'\" Shaheen said, according to WLS.\n\nJurors also listened to the mother's 911 call from the bathroom, in which she was heard telling the dispatcher, \"He's killing my baby,\" WLS reported.\n\nJurors additionally heard remarks Czuba made in a law enforcement vehicle following the attack.\n\n\"I thought they were going to do jihad on me,\" Czuba said, according to WLS.\n\nHe also said he was \"afraid for my life\" and his wife and said the family was \"just like infested rats,\" according to WLS.",
                "I initially thought, “damn, only 53 years?” But then I realized he’s already an old POS.",
                "\"I thought they were going to do jihad on me,\" Czuba said, according to WLS.\n\n\nWorld's smartest islamophobe",
                "[removed]",
                "There is a special circle of hell for people like this.",
                "It’s amazing how religious fanatics claim they love god, and think they are better than everyone else, but yet they do the work of the devil, or whatever they call him in their religion.",
                "This guy can rot in hell, murdering a 5-year old for his religion, there are no words",
                "Omg poor little boy. May he RIP.  Anyone that hurts a child is just a monster \n\nI really wish reddit didn’t have the news just in the middle of scrolling and saw this post, it’s so depressing and heartbreaking. As someone with a young son it just brings me such anxiety and pain to read stories of kids being killed :(",
                "You can thank Fox News and all the other right wing media for the death of this child."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "CDC reports 216 child deaths this flu season, the most in 15 years.",
            "external_url": "https://www.nbcnews.com/health/cold-and-flu/cdc-reports-216-child-deaths-flu-season-15-years-rcna204468",
            "upvotes": 6722,
            "date": "05/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-12/241217-covid-ch-0958-6da6ba.jpg",
            "top_comments": [
                "Time to do away with the CDC child death reporting department.",
                ">There are likely several contributors to this season’s severity, but a big one is that fewer children get flu shots, added O’Leary, a University of Colorado pediatric infectious diseases specialist.\n\n>The flu vaccination rate for U.S. children has plummeted from about 64% five years ago to 49% this season.\n\nDamn, really? That’s an alarming trend.",
                "It was a bad flu season. :/ - signed a pediatrician",
                "If only medicine could come up with a way to prevent children from getting the flu...",
                "People really gonna have to learn all over again why these vaccinations are a thing.",
                "Surely we'll be fine next year\n\nhttps://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-confirms-cancellation-vaccine-advisers-meeting-2025-02-27/",
                "The most in 15 years SO FAR",
                "Republicans: \"There are no amount of kids deaths that is more immportant then me not getting stuck with a needle.\" ",
                "If children are dying of flu in 2025 without extenuating medical circumstances, then their parents are guilty of neglect. Simple as that.",
                " Next year we’ll surely beat this number… since we may not even get a vaccine."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Conservative MP will resign Alberta riding so Poilievre can run again | Globalnews.ca",
            "external_url": "https://globalnews.ca/news/11161267/pierre-poilievre-running-again-alberta/",
            "upvotes": 5322,
            "date": "05/02/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/04/b6dae6fca70b2303a683a628bd7e02b6102a36b480a1c8e090066858390ee6fe_1ba569.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "Say what you want, but this is a little bit embarrassing for him.",
                "Nothing says personal responsibility like blowing a 27-point lead, losing your own seat, then getting someone else to take the fall.",
                "Doesn’t really seem right, losing your riding so just picking another, guaranteed riding. Not really the will of the people who voted against you.",
                "I know this is common in Westminster parliamentary systems but I don't like this. If you lose, you lose. He's not really a resident of that Alberta riding/district. He's just pretending to be. (Yes I know district shopping happens in America too. I don't like it either).\n\nA MMP legislature with party lists would solve this issue and have the added effect of allowing voters to be better represented in parliament.",
                "God damn it. This is my riding. \nI guess I'll get the chance to call him a cunt in person.",
                "Here's hoping Poilievre gets embarrassed again!",
                "It would be fucking hilarious if he loses again",
                "Things are turning up milhouse",
                "Let him run\n\nLet him run for PM for the rest of his life\n\nHis policies suck, he sucks, he's a shit person and a has a shitty personality.",
                "My boss is super conservative and just before the election he was very vocal about \"if you lose your seat you should be fired\". You lose your out mentality.\n\nStrangely, he hasn't brought it up since the election!"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "RFK Jr plans placebo-trial testing for 'all new vaccines'",
            "external_url": "https://www.bbc.co.uk/news/articles/crkx3egk3ygo?fbclid=PAQ0xDSwKBlMBleHRuA2FlbQIxMQABpxz-vcbOrpXyUIHbPkD3JoXLspK0TLUXLuOcteBADjQhncwVIbIUdrNn0JIM_aem_7pfTbvCYLxHUeeNvWyACMQ",
            "upvotes": 11396,
            "date": "05/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/37c6/live/d61a2670-26a6-11f0-b505-55b7c1f611de.jpg",
            "top_comments": [
                "Give him the placebos and us the vaccines.",
                "Aren't clinical trials for new vaccines double-blind with placebo controls anyways? Like this is standard practice.",
                "Using a true placebo is actually a terrible research design when there is an existing standard vaccine. Dude is a fucking idiot.",
                "\"some of you may die but that's a price I am willing to pay\" -L. Farquot",
                "The Kennedy’s lobotomized the wrong one",
                "I think RFK is the best choice for a test subject. Be sure to send him in the most virulent environment to have thorough result.",
                "This is extremely unethical behavior…and it also won’t convince skeptics. If they don’t believe the huge effect sizes MMR vaccine adoption shows, they won’t believe anything.",
                "Can we please get Bobbie Brainworms out and an actual medical professional to make critical care decisions. Why are we allowing this clearly crazy man to dictate health policy. He is literally brain damaged. The US is insane.",
                "Are these “trials” going to be actual trials or just fake experiments to confirm their bias against",
                "RFK is the mengele of the magas"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Trump signs executive order directing federal funding cuts to PBS and NPR",
            "external_url": "https://apnews.com/article/trump-npr-pbs-republicans-public-broadcasting-f0e3e1acb96986732a0211833165bf84",
            "upvotes": 19598,
            "date": "05/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What is the point of having a Congress when one person can so completely change the course of so many things?",
                "Back in my day, the executive’s job was to *execute* the laws enacted by the legislature, not undermine them.",
                "Republicans have given up the legislative branch completely and are trying to help weaken the judicial as well. Pathetic. They are all worthless cunts.",
                "Republicans in Congress are the chair facing the bed in the hotel room.",
                "The good news is apparently NPR gets about one percent of its budget from the feds. This will largely hurt public tv and radio in less affluent states.",
                "So basically this means gov censorship to things they don’t agree with. Let’s not pretend this is anything but that.",
                "Congress approved this funding in the ‘60s. You can’t just EO that away. More performative nonsense from Dementia Don",
                "I was reading an article in CNN about this, in which it was cited that Republicans were complaining that PBS programs have a \"liberal\" bias.  What a crock of shit.  I'd been listening to PBS Newshour podcast for the past few months and it's been such a breath of fresh air.  It's nearly an hour and ad-free, so they can really delve into stories.  Their political coverage is especially good, and they always have conservatives on to give their perspective as well as liberals.",
                "There goes free entertainment and unbiased news.",
                "How did the Nazis feel about the BBC? They confiscated all the radios!"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Sean 'Diddy' Combs rejects plea deal ahead of sex trafficking trial",
            "external_url": "https://abcnews.go.com/US/sean-diddy-combs-rejects-plea-deal-ahead-sex/story?id=121371141",
            "upvotes": 1993,
            "date": "05/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6cffb08e-de0f-45e2-b3da-d733b13eadd0/Diddy-ap-er-250501_1746127092174_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Great news. That means he’ll never get out.",
                ">Maurene Comey, an assistant United States attorney, said a guilty plea would have reduced the amount of prison time Combs would be exposed to compared to a trial conviction on all counts, which could result in what is effectively a life sentence.\n\nHe brought on a new lawyer earlier this week. And is first lawyer was allowed to leave in February.",
                "Diddy is one of those people who will just continue being a creep. He shouldn't be in society at any age.",
                "While most regular people would take a plea from the feds, someone of Diddy's level of fame and wealth usually never does so this is not surprising.",
                "Prosecutors better not mess this up.",
                "[removed]",
                "Dude's 55. Considering the seriousness of the allegations, it might be a life sentence for him regardless. I'd bet the best he could've gotten was the potential for parole, but he's almost certainly not getting that now.",
                "The thing a lot of people seem to miss is that Diddy is the lone defendant named in the case involving racketeering, conspiracy, sex trafficking and prostitution, according to the [US DOJ] (https://www.justice.gov/usao-sdny/media/1368556/dl) criminal filing.\n\nConvincing a jury that he didn't have any help or  no one else involved \nin a criminal enterprise was worthy of being named as defendants in a RICO case is wild.  \n\nGonna be interesting to see how this all plays out.",
                "I wonder what kind of leverage he has in order to pursue this route",
                "He really is one of those people who should do the *opposite* of whatever they think they should do."
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "RISING",
            "title": "Army plans for a potential parade on Trump’s birthday call for 6,600 soldiers",
            "external_url": "https://www.cnn.com/2025/05/01/politics/army-plans-military-parade-trump-birthday",
            "upvotes": 7833,
            "date": "05/02/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2212098240-20250502004058129.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "He's wanted this for a long time.  I agree with something John Oliver said to the effect of \"yeah he'll get it and as he watches it roll by he'll think, no... this doesn't do it either.  It still doesn't fill the giant hole in me where my father's love should be.\"",
                "Someone tell DOGE to look at the costs involved here!",
                "If not dictator, why dictator shaped",
                "The phrase that stuck with me when this was proposed during Trump 1.0 was \"third world bullshit\".  IIIRC the guy who said that also killed Bin Laden and happens to be pretty politically conservative.     \n\n   Military specific parades\\* and officers wearing huge hats are warning signs that you live in an authoritarian shit hole.    If there are any major changes to the military dress uniforms during Trump's presidency, Canada here I come.     \n\n   \n\n  \\*Ceremonial segments of our military, like marching bands, joining other parades is 100% OK and a great way to recognize our service members.   It's rolling tanks and troops through the middle of a city that is problematic.",
                "Many Federal employees were fired for this.",
                "In 1775 the Army was created to take down a tyrant.  250 years later they dance for one.",
                "Trump wants the Hitler style  parades in his honor .the man doesn’t have an ounce of humility.  I can’t believe his head hasn’t exploded by now.",
                "TL;DR:\nThe Army is planning a large birthday festival for its 250th anniversary on June 14 — which is also Trump's birthday — and may add a military parade involving over 6,600 troops, 150+ vehicles, 50 helicopters, and bands. The parade is still under discussion, pending White House approval, and could cost tens of millions. Concerns include security, logistics, housing troops, and road damage from heavy vehicles. Trump has long wanted such a parade, but high costs and local objections stopped past efforts.",
                "ya we dont do military parades for the servant office of the president.  He is a servant.  Im just gonna make sure to say that every time.  servant trump.",
                "A military parade for a draft dodger... Oh the irony."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Cat survives 380-foot fall that killed couple hiking in Utah's Bryce Canyon National Park, animal sanctuary says",
            "external_url": "https://www.cbsnews.com/news/cat-survives-380-foot-fall-killed-couple-bryce-canyon-national-park-utah/",
            "upvotes": 2625,
            "date": "05/02/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/02/66ba8d9f-b5d2-4ae5-b009-444bfa8c2f20/thumbnail/1200x630/c6db1ff76635773da1dcc7ee94e2f465/mirage-gp4dg0xxaaasofk.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                ">The feline \"was found in a black soft-sided carrier that was dirty and torn, but seemed to have weathered the fall fairly well,\" the Best Friends Animal Society said.\n\nHow much of that was due to the carrier?",
                ">Tourists spotted the bodies Tuesday below Inspiration Point after the two fell late Monday or early Tuesday, the Garfield County Sheriff's Office said in a statement. How they fell was unknown, but they had crossed over safety railings, according to the statement.\n\nThe safety railing looks to be around 4 feet high and well maintained from some of the pictures.",
                "The cat was in a carrier. I wouldn't have been too surprised at a cat free-falling where it can orient itself. Being in a carrier meant it couldn't do that.\n\nOn the other hand, the carrier might have protected it from being scratched or impaled.",
                "poor senior baby 🥺 she better get all the treats. all of them.",
                "Man, I really want to go home to my cats right now.",
                "Am I the only one thinking this was intentional? Why else bring the cat? And in the dead of night? I'm thinking they meant to jump.",
                "These people were incredibly stupid and not to mention thoughtless when it came to the safety of their pet. All for a photo!",
                "So not only did they climb over a safety fence, they brought their cat with them?  Just horrible, evil shit to do.   Or at the very least, highly inconsiderate.  \n\nAlso, cats are so good at surviving things.   [This cat survived for two months in a closed shipping container](https://www.thesun.co.uk/news/12628172/miracle-cat-two-months-trappe-shipping-container-spiders/).",
                ">Nannen and Crane were living in a U-Haul van and recently spent a significant amount of time in Arizona. Florida was their last state of permanent residence, according to the sheriff's office.\n\nCertainly paints a picture.",
                "Maybe they jumped and took the cat with them."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Chile issues tsunami warning after earthquake",
            "external_url": "https://www.bbc.co.uk/news/articles/c8dg32qmg7qo",
            "upvotes": 3130,
            "date": "05/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/99a5/live/e6e77660-276e-11f0-8c66-ebf25fc2cfef.jpg",
            "top_comments": [
                "Magnitude 7.4, 219 km south of Ushuaia, Argentina. That's extremely south, far from heavily populated areas.",
                "Chile takes these threats seriously, and it shows. Their early warning systems are some of the best in the world.",
                "Whoa, in the Drake Passage, one of the worst sailing spots, IN THE WORLD, and a tsunami. Thoughts go out to everyone in that passage right now",
                "Hope there are no deaths and everyone comes out safe",
                "if i lived there, i would be concerned.",
                "\"people should evacuate coastal area\"\n\n... how? where? Whole country is a coastal area.\n\n\nEdit: Way too many of you responded seriously to my tongue-in-cheek comment. Get off your high horses, people. And no, I don't think every similar comment should be flagged with a   /s\n\n\nI was actually visiting that area of Chile just last month, I know you're not stuck on the coast and you can drive for hours eastward.",
                "I hope everyone's gonna be okay, holy crap ",
                "Next time, ticket and fine the tsunami. The warnings are obviously not working!",
                "Trump is readying rolls of paper towels as we speak",
                "Let’s hope there are few casualties, and The Times newspaper finally gets to print their headline. "
            ],
            "aggregate_sentiment": 55.0
        }
    ],
    "last_updated": "05/03/2025 08:10:28 UTC"
}