{
    "posts": [
        {
            "category": "HOT",
            "title": "Yale professor who studies fascism fleeing US to work in Canada",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/26/yale-professor-fascism-canada?CMP=Share_AndroidApp_Other",
            "upvotes": 31564,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4ca5fca8e505ad4e446eed6c79a9a958f0d89e2f/0_72_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1b62264f6b12cd17697d55043a02c080",
            "top_comments": [
                "\"Out here, nobody knows where I am, and I’m believed to be away on a trip. Here are brewing economically and politically dark times, so I’m happy to be able to get away from everything.\" \n\n-Einstein hiding in Northern Germany in 1922, eleven years before he renounced his German citizenship following Hitlers rise to chancellor.",
                "A poignant quote from the article:  \"Social media posts spread on Wednesday, noting the alarm sounded by a scholar of fascism leaving the country over its political climate. Nikole Hannah-Jones, the journalist and creator of the 1619 Project,[wrote](https://bsky.app/profile/nhannahjones.bsky.social/post/3llakwvszts2c) on the social media platform Bluesky: “When scholars of authoritarianism and fascism leave US universities because of the deteriorating political situation here, we should really worry.”",
                "The vast majority of U.S. residents cannot leave. They either lack the resources or no one would be willing to take them on due to factors such as age, education, and others reasons. Protected is our freedom to travel, and essentially to leave has been our right. However, with a passport costing $250 and roughly 60% of Americans being a single paycheck away from homelessness, the majority have no freedom to travel or leave.  Trickle-down only worked for billionaires. The middle class has been significantly eroded over the past few decades. We are now stuck with our makings.",
                "If only there had been a literal decade of warnings for people to pay attention to…",
                "\"Those who do not learn from history are doomed to repeat it\"\n\nThis is simply an example of the inverse being true.",
                "He'll be back when he has to do his fieldwork.",
                "Fleeing from Germany to France vibes.",
                "We're hostages tied to a chair while children with loaded guns are running around.  I hate it here",
                "As a Canadian, I think we're better off for having him. But I'm sorry it's coming to this; I have friends in the States and I really feel for them.",
                "This is one of the few silver linings for Canada - a reverse brain drain.\n\nStill, I'd rather have a sane southern neighbor."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "NY county clerk refuses to file Texas' fine for doctor accused of prescribing abortion pills",
            "external_url": "https://apnews.com/article/abortion-pills-lawsuit-texas-new-york-carpenter-e97d5c38d9429083d03c2a7b385cbbfd",
            "upvotes": 4269,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait, didn't they try this shit with the fugitive slave act? Wasn't there a war sometime after that?",
                ">“New York is shredding the Constitution to hide lawbreakers from justice, and it must end,” Paxton said on X. \n\nOh, New York is the one shredding the constitution, is it?",
                "And this sets up the fight they're looking for over NY's shield law, as well as whether they can punish someone in another state that engaged in behavior based in and legal in that state.\n\nIf they win that fight it will be a disaster, but particularly for trans health care and abortion in the short term.",
                "Well kudos to this person. Putting your job on the line for your principles is courageous. America is going to need a lot more of this.",
                "Just wait till Texas has a snatch squad or “bounty hunter” grab her and bring to Texas. Sure it would be illegal, but who’s going to stop them these days.? I’m sure a New York judge would issue an order for her to be brought back, which would swiftly be ignored.",
                "Ken Paxton should be in jail.",
                "Ken Paxton is a crook who used his position as Texas AG to evade securities fraud charges. ",
                "Good on them, fuck Texas!",
                "MAGAverse gonna go on full meltdown.",
                "Sounds like somebody got the memo ... DO NOT COMPLY WITH FASCISTS👍"
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "HOT",
            "title": "US honeybee deaths hit record high as scientists scramble to find main cause",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/25/honeybees-deaths-record-high",
            "upvotes": 24395,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ddbb4889fe4a8b0686f7bdaf1b74cc7a365ba0df/0_200_3000_1799/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2e9dd540a3f847f4f714379735a3b6bf",
            "top_comments": [
                "Stop using weed killer. It's toxic to them and destroys their main food sources.",
                "Half of America thinking climate change and environmental science is woke might have something to do with it.",
                "Well there’s the whole saturate the country in pesticides and glyphosate to start…",
                "> Commercial beekeepers have reported losing more than 60% of their colonies, on average, over the winter, according to an ongoing Project Apis m. survey that covers more than two-thirds of America’s managed bees.\n\nThe average winter loss used to be 10-20% until colony collapse began. They pollinate half our crops. This should freak everyone out.",
                "We live in the city, we have a nice backyard garden, we don't use any pesticides, weed killers, bottled nutrients, etc for approximately 14 years. The bees have made a home here. Every year when they swarm its seems another groups attempts to set up camp here. I do believe they can tell when you don't use harmful chemicals around your property",
                "Nothing will change without strict regulations on pesticides. It's not just agriculture sterilizing the countryside. Any idiot with a credit card can buy a barrel of poison and sterilize not just their yard but everything downwind and downstream of it for miles. \n\nWe thought we fixed everything by banning DDT, but that first Silent Spring was just the beginning. We're about to lose even more birds and wildlife in our world as insect populations continue to collapse.",
                "neonicitinoids by agra biotech firms for crop pesticides- banned elsewhere, not in usa.",
                "It's us. \"Us\" is the main cause",
                "Scientists aren't scrambling to find the main cause, the people just don't like the answer.",
                "Who is scrambling?\n\nAnyone who has any amount of time greater than 30 seconds researching the decline in insect populations in the US know that insecticides and herbicides are the leading cause for the destruction of almost every single insect species.\n\nThese articles either try to shock people into thinking “omg how unexpected! Surely the big companies aren’t at fault and didn’t see this coming!” or the “scientists” they’re referring to are categorical fucking morons.\n\n\nMake no mistake, almost all insects are surprisingly integral to our ecosystems that we literally need to survive but Honeybees are some of, if not the, most important.\n\nWe lose them, we’re in serious trouble."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Exclusive: FDA staff struggle to meet product review deadlines after DOGE layoffs",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/fda-staff-struggle-meet-product-review-deadlines-after-doge-layoffs-2025-03-27/",
            "upvotes": 1744,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "3500 FDA employees will be laid off. This is in addition to those already let go",
                "This isn't a bug, it's a feature.\n\n1. Fire all the staff so they can't get their reviews and approvals done in a timely manner.  \n2. Publicly complain that the FDA approvals are taking too long and regulations are too onerous.  \n3. Remove regulations.",
                "Going back to when America was great and milk producers put formaldehyde in milk to extend the shelf life. Before the FDA all we could do was to plead with the companies to please stop killing kids.\n\nhttps://www.smithsonianmag.com/science-nature/19th-century-fight-bacteria-ridden-milk-embalming-fluid-180970473/",
                "1. Break government\n\n2. Claim government doesn't work\n\n3. Abandon regulatory agencies, privatize program administration.\n\nEnjoy Russia-West.",
                "The plan to Make America Shittier is working.",
                "I am a medical device auditor.  I can remember a time when a [483](https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/inspection-references/fda-form-483-frequently-asked-questions) was something to be feared by corporate executives.  Defending companies from the FDA was a career path. Now, it's barely even heard of.\n\nThe FDA was barely surviving as it was.  They were a good organization that [helped a lot of people](https://www.fda.gov/about-fda/fda-history-exhibits/frances-oldham-kelsey-medical-reviewer-famous-averting-public-health-tragedy).  But medical devices and especially pharmaceuticals went the way of Boeing back in [2017](https://en.wikipedia.org/wiki/Executive_Order_13771).  With his [newest deregulation efforts](https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-launches-massive-10-to-1-deregulation-initiative/#:~:text=In%20his%20first%20term%2C%20President,for%20everyone%20new%20regulation%20issued.), it really is gone.  This is just another nail in the coffin.  Hopefully we can rebuild someday.",
                "I really hate republicans.",
                "Think about it this way......\n\nA health inspector isn't necessarily efficient for a business. But we need them to maintain food safety. It's not fraud, it's not a Kabal of deep state food molesters. It's a necessary protection. \n\nBut if everything is looked at through the lens of business and not country. Well, the health inspector can be made to look \"fraudulent\".",
                "I work at a medical device manufacturer and the documentation and safety guidelines are all targeted at FDA requirements. Audits at the facility are a huge deal, and any pushback on following process gets over ridden because the consequences of a failed audit are not worth the risk. I don't think most companies are going to backslide on purpose but when the watchdog isn't there it becomes much much easier.",
                "People like to forget a lot of these rules and regulations are written in the blood of the victims of capitalists making food or medicines for maximum profits.\n\nThey dont care if a few hundred or thousand children die or are born deformed as long as profits remain high."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Scientists find 18 million tons of 'white gold' beneath California's Salton Sea worth $540 billion: Report",
            "external_url": "https://www.deccanherald.com/world/scientists-find-18-million-tons-of-white-gold-beneath-californias-salton-sea-worth-540-billion-report-3463540",
            "upvotes": 7639,
            "date": "03/27/2025",
            "thumbnail": "https://images.deccanherald.com/deccanherald%2F2025-03-26%2F1polbv4b%2FiStock-1272885374.jpg?rect=0%2C137%2C3644%2C1913&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
            "top_comments": [
                "Lithium. It's lithium. And it's double the amount estimated underneath Greenland.\n\nEdit: my math was a bit off lol...not double the amount....*it's WAY MORE*. A 2023 geological survey estimated 235,000 tonnes of lithium resources. 18,000,000 tonnes is more than that.",
                "I hate journalism these days. Just call it fucking Lithium and don't make me click to figure out what the hell you are talking about. \n\n\nMaybe I'm out of the loop but I've never heard it called white gold before",
                "How long before Elon buys the Salton Sea for his battery operations?",
                "Dam i should have bought the land years back when it was like 5k an acre.",
                "White gold?  So cocaine?",
                "A substantial Lithium deposit in the United States is a big deal.",
                "This means Greenland doesn’t need protecting by America?",
                "At less than $1 / oz, is 'gold' really the right comparable?",
                "How long before Trump invades California?",
                "Well good, maybe if they find cobalt and nickel somewhere they won't want Canada anymore."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Republican controlled Congress removes funding for protecting California coast",
            "external_url": "https://www.sfgate.com/bayarea/article/california-coastal-bluff-funding-20242812.php",
            "upvotes": 3129,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Every day there's less and less reason to pay federal taxes. \n\n  \nThe state needs to wake up and give us the option to divert the funds to them to actually provide the services being stolen from us.",
                "Seems to me like Congress isn't really thinking of America's best interests how long until we can't call ourselves the United States if we literally don't unite on everything and or anything?",
                "If Democrats get back into power, I fully support ceasing federal funds to red states. I mean, that’s the game now right?",
                "Ok so California should stop paying federal taxes.",
                "Imagine being in an elected position charged with protecting, serving, and benefiting our country and deciding to do dumb shit like this day in and day out.\n\nThese people are incompetent in the best case scenarios... Everyone in our country should be demanding these people's heads at this point.  The damage they're doing is immeasurable.",
                "And California needs to protect the coast to avoid \"Trump CaliBeach Blast costal lenght Resort and Casino\"",
                "Nobody is more effectively antiAmerican than the GOP",
                "OC Repugs will just \"feel\" that it's all our Democratic Party Governor's fault - never thinking (or admitting) that they all caused this; all the while, and in the aftermath, never even realizing the foundational purpose for the money in the first place.",
                "Time for Cali to become independent and create a new government, something like a Republic, call it the \"New California Republic\", yeah, sounds nice, NCR for short.",
                "Shit like this is why I think we will live to see secessionist movements sprout up and grow. \n\nIn fascist America blue states are nothing but slushfunds and whipping boy societies for our rural red apartheid overlords. \n\nThe west coast and New England made America wealthy and influential. Now jealous spiteful backwater and flyover states want to punish us relentlessly for tolerating LGBTQ people and being sane and secular. \n\nEventually the question will be why the fuck are we still in this union? We get nothing but grief from it. The president they assign to lord over us just wants to hurt and insult us. Our tax dollars go out to them but we get nothing but insane policy and punishment.\n\nWhen the cost of existing in this union exceeds the benefit by such an enormous amount people will start looking for the door. Fighting for freedom is often preferable to suffering forever."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "A DHS staffer faces serious punishment for accidentally adding a reporter to a group email",
            "external_url": "https://www.nbcnews.com/politics/national-security/dhs-staffer-faces-serious-punishment-accidentally-adding-reporter-grou-rcna198233",
            "upvotes": 1746,
            "date": "03/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-11/241105-dhs-seal-wc-1420-227213.jpg",
            "top_comments": [
                "\"But unlike Waltz and Hegseth, who both remain in their jobs, the career DHS employee was put on administrative leave and told late last week that the agency intends to revoke her security clearance, the officials said. \"\n\nThis is what happens to low level staff and the email was not even classified. Go figure.",
                "If somenpne in uniform had done what hegseth and the rest did, they'd be in jail.",
                ".... what about the jerks in charge who were breaking the law by using Signal in the first place?",
                "You can’t make this shit up.",
                "I see they found a female, non-partisan, career, low-level employee to throw under their wildly swerving bus. Fucking pieces of shit.",
                "If Republicans didn't have double standards, then they wouldn't have any standards at all.",
                "So they are going with the blame the coffee boy again..\n\n  \nRepublicans can never own their own mistakes they are the party of \"the other guy did it\"..",
                "\"Different spanks for different ranks.\"",
                "Welcome to the MAGA world where the rules don’t apply to the inner circle, but apply in the strictest sense to everyone else.",
                "That staffer caused an event that likely saved us from a worse national security disaster had the boneheaded use of Signal for secret communications not been discovered."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "Babysitter finds man under bed after child complains of 'monster'",
            "external_url": "https://www.bbc.com/news/articles/c70e2y98p06o",
            "upvotes": 2885,
            "date": "03/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/f543/live/8d4f9f70-0b20-11f0-88df-cbea984e02db.jpg",
            "top_comments": [
                "While trying to show the child there was nothing under the bed, the female victim \"came face-to-face\" with a male suspect, Barton County Sheriff's Office said. An altercation ensued with the babysitter and one child was knocked over.\n\nThe suspect fled and was found and arrested on the same block the next morning, on Tuesday, after leading deputies on a short foot chase.\n\nThe 27-year-old, who once lived at the residence and had a protection from abuse order to stay away from the property, was booked into jail on requested charges of aggravated kidnapping, among other crimes.\n\nOther charges requested include aggravated burglary, aggravated battery, child endangerment, felony obstruction of a law enforcement officer and violation of a protection from abuse order.\n\nThat's terrifying. \n\nAnother reason to not blow off your kids when they say they are afraid of something.",
                "That babysitter is getting a raise...and probably some PTSD treatment.",
                "> The 27-year-old, who once lived at the residence and had a protection from abuse order to stay away from the property, was booked into jail on requested charges of aggravated kidnapping, among other crimes.\n\nThat is terrifying. This is the kind of thing that would make me want to move.",
                "This is terrifying for an adult, let alone a child.",
                "Yeah I’d fucking never recover from that…..",
                "Real life Creepypasta .",
                "I feel like this is basically one of those “Scary Stories” shorts from a book I read when I was a kid",
                "That poor kid is gonna sleep on futons the rest of their life. I'm glad that no one got hurt.",
                "Imagine being a kid, telling your babysitter there’s a monster under your bed. She’s like “oh no, no monsters under here” bends down to check and starts screaming. Trauma for life.",
                "Hey Chuck, it's Pimento!"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Measles case confirmed in person who rode Amtrak train to Washington, D.C., health officials say",
            "external_url": "https://www.cbsnews.com/news/measles-case-confirmed-dc-amtrak-passenger-train-union-station-health-officials/",
            "upvotes": 912,
            "date": "03/27/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2021/07/14/23986ecc-2f39-4b9f-b257-396da71421b8/thumbnail/1200x630/f3dc1c1d2ba998f1aaafabd7333f28cb/GettyImages-1232126765.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Sure glad that I got a simple injection when I was a child that protects me from getting it",
                "For context, the average person with covid will infect about 3 people.\n\n\nThe average person with measles will infect 12.  It is wildly infectious, and it can kill kids.\n\n\nThere is a reason we worked so hard to get rid of it.",
                "It would be poetic justice if RFK Jr gets it.",
                ">Before becoming contagious, the individual with measles had flown from Minnesota into Reagan National Airport, a spokesperson for the D.C. Health Department told CBS News. Neither the identity nor a description of the individual has been released, but the spokesperson said they were vaccinated against measles.\n\nWell that's scary in multiple ways.  Vaccination isn't 100% and immunity can fade with time, which is why a bunch of anti-vaxxers deciding they're going to make their arrogance everyone else's problem is such a bad scenario.",
                "Dude, just drink cod liver oil until you turn yellow and your liver quits",
                "We still have health officials?",
                "RFK says vitamins fix that. So free vitamins for everyone",
                "Non responder.\nWe all have neighbors that are non responders to vaccinations.\nThat’s another part of the population that is at risk when people don’t vaccinate.\nPlease vaccinate to protect all of us.",
                "Good, may the measles blow through DC all the way into the White House.",
                "Enough people refuse or just ignore vaccinations that germs that can be easily contained will always be around the corner waiting to pounce again."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Judge orders Trump administration to preserve Signal chat on Yemen strikes",
            "external_url": "https://abcnews.go.com/US/judge-holds-hearing-administrations-signal-app/story?id=120229350",
            "upvotes": 693,
            "date": "03/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e844e726-deae-4aeb-b402-caceb8c47841/pete-hegseth-1-ht-gmh-250325_1742909596131_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Serious question, WTF is going to happen if they don't? I mean, they've already broken the law, disobeyed the Scotus... And... No repercussions.",
                "Jeffrey Goldberg has the chat in case the admin, er, \"loses\" it.",
                "This will go over well",
                "They might want to think about going with their usual approach of deleting everything and lying.  I'm pretty sure a certain editor in chief will be very happy to share the complete chat with anyone who asks.  Then again, it apparently never occurred to them that if they lied about it he might drop the receipts, so I guess we'll see what happens.",
                "Already deleted.\n\nI'll eat my own ass on camera if I'm wrong.",
                "The only thing that can stop Trump is congress. And the current one is complicit. \n\nSo, if you want to establish a working system of checks and balances again then do not vote for the republican congressman that is supposed to be serving your district/state. They no longer work for you.",
                "They're not going to do it, and it will be yet another flagrant violation of the judicial authority. Consternation will be had by people who could do something about it. Add it to the flaming pile.",
                "They're gonna be like, we can't cuz we don't know how",
                "but judge, we set the chat to self-delete....",
                "I won't follow you. I am a king. Roberts and the SC  have  already crowned me.\n\n\\-Donald Trump"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Amazon Is Canceling a Major Alexa Privacy Feature on March 28: Should You Worry?",
            "external_url": "https://www.cnet.com/home/security/amazon-is-canceling-this-alexa-privacy-feature-on-march-28-should-you-worry/",
            "upvotes": 12,
            "date": "03/28/2025",
            "thumbnail": "https://www.cnet.com/a/img/resize/e96a94cc497a0c79571c56582862da7657342872/hub/2025/03/20/5d2afd3b-c532-43c5-9f58-f6447aaeebba/gettyimages-1279899369.jpg?auto=webp&fit=crop&height=675&width=1200",
            "top_comments": [
                "From the article: \n\"As Amazon readies the huge AI upgrade to Alexa called Alexa Plus, the retail juggernaut has revealed a disturbing change in its privacy policies. Beginning on March 28th, users of Echo smart speakers and Echo Show displays won't be able to block their devices from sending all voice recordings to Amazon for analysis.\n\n\nKeeping voice recordings local is an important privacy feature for any voice assistant, and removing it raises serious questions about what Amazon is listening to. And even if you didn't know about these privacy settings before, I bet you're worried about voice assistant privacy in general: Our CNET Survey found over 70% of people have privacy concerns about adding more AI to home voice assistants -- and now we're seeing those fears in action.\"",
                "No, because I don’t have Alexa.",
                "I'm worried shitless, constantly, every single day. This changes nothing.",
                "Let me drop some crazy logic on you who use this…you could always “not” use Alexa…\n\nOmg! Wow! Big IQ logic dropped!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Stellantis offers buyouts to UAW employees at more than 20 sites in Detroit and Toledo",
            "external_url": "https://www.freep.com/story/money/cars/chrysler/2025/03/20/stellantis-buyouts-detroit-toledo-mopar/82580225007/",
            "upvotes": 51,
            "date": "03/27/2025",
            "thumbnail": "https://www.freep.com/gcdn/authoring/authoring-images/2024/02/13/PDTF/72588836007-img-stellantis-011921-03-1.JPG?crop=2399,1350,x0,y240&width=2399&height=1350&format=pjpg&auto=webp",
            "top_comments": [
                "Those tariffs are really helping to bring back jobs apparently...",
                "When only rich people can afford to buy cars there will be a lot more layoffs and less buyouts. That's what Trump's tariffs will do.",
                "Just a reminder that Sean O'Brien helped elect Trump.",
                "But MAGA folks keep telling me Stellantis is going to open more plants thanks to Trump. Now I'm confused. /s",
                "*\"Stellantis continues to review its operations to improve efficiency and protect its competitiveness in a very dynamic market\".*\n\n\"very dynamic market\"=a disruptive market within which capitalism can't function--efficiently or at all. (courtesy of current Admin.)",
                "Buy out and bust the union. When the manufacturing job comes back they can pay non-union workers pennies on the dollar."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Judge orders Trump administration to preserve Signal chat on Yemen strikes",
            "external_url": "https://abcnews.go.com/US/judge-holds-hearing-administrations-signal-app/story?id=120229350",
            "upvotes": 701,
            "date": "03/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e844e726-deae-4aeb-b402-caceb8c47841/pete-hegseth-1-ht-gmh-250325_1742909596131_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Serious question, WTF is going to happen if they don't? I mean, they've already broken the law, disobeyed the Scotus... And... No repercussions.",
                "Jeffrey Goldberg has the chat in case the admin, er, \"loses\" it.",
                "This will go over well",
                "They might want to think about going with their usual approach of deleting everything and lying.  I'm pretty sure a certain editor in chief will be very happy to share the complete chat with anyone who asks.  Then again, it apparently never occurred to them that if they lied about it he might drop the receipts, so I guess we'll see what happens.",
                "Already deleted.\n\nI'll eat my own ass on camera if I'm wrong.",
                "The only thing that can stop Trump is congress. And the current one is complicit. \n\nSo, if you want to establish a working system of checks and balances again then do not vote for the republican congressman that is supposed to be serving your district/state. They no longer work for you.",
                "They're not going to do it, and it will be yet another flagrant violation of the judicial authority. Consternation will be had by people who could do something about it. Add it to the flaming pile.",
                "They're gonna be like, we can't cuz we don't know how",
                "but judge, we set the chat to self-delete....",
                "I won't follow you. I am a king. Roberts and the SC  have  already crowned me.\n\n\\-Donald Trump"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Measles case confirmed in person who rode Amtrak train to Washington, D.C., health officials say",
            "external_url": "https://www.cbsnews.com/news/measles-case-confirmed-dc-amtrak-passenger-train-union-station-health-officials/",
            "upvotes": 913,
            "date": "03/27/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2021/07/14/23986ecc-2f39-4b9f-b257-396da71421b8/thumbnail/1200x630/f3dc1c1d2ba998f1aaafabd7333f28cb/GettyImages-1232126765.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Sure glad that I got a simple injection when I was a child that protects me from getting it",
                "For context, the average person with covid will infect about 3 people.\n\n\nThe average person with measles will infect 12.  It is wildly infectious, and it can kill kids.\n\n\nThere is a reason we worked so hard to get rid of it.",
                "It would be poetic justice if RFK Jr gets it.",
                ">Before becoming contagious, the individual with measles had flown from Minnesota into Reagan National Airport, a spokesperson for the D.C. Health Department told CBS News. Neither the identity nor a description of the individual has been released, but the spokesperson said they were vaccinated against measles.\n\nWell that's scary in multiple ways.  Vaccination isn't 100% and immunity can fade with time, which is why a bunch of anti-vaxxers deciding they're going to make their arrogance everyone else's problem is such a bad scenario.",
                "Dude, just drink cod liver oil until you turn yellow and your liver quits",
                "We still have health officials?",
                "RFK says vitamins fix that. So free vitamins for everyone",
                "Non responder.\nWe all have neighbors that are non responders to vaccinations.\nThat’s another part of the population that is at risk when people don’t vaccinate.\nPlease vaccinate to protect all of us.",
                "Good, may the measles blow through DC all the way into the White House.",
                "Enough people refuse or just ignore vaccinations that germs that can be easily contained will always be around the corner waiting to pounce again."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Exclusive: FDA staff struggle to meet product review deadlines after DOGE layoffs",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/fda-staff-struggle-meet-product-review-deadlines-after-doge-layoffs-2025-03-27/",
            "upvotes": 1746,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "3500 FDA employees will be laid off. This is in addition to those already let go",
                "This isn't a bug, it's a feature.\n\n1. Fire all the staff so they can't get their reviews and approvals done in a timely manner.  \n2. Publicly complain that the FDA approvals are taking too long and regulations are too onerous.  \n3. Remove regulations.",
                "Going back to when America was great and milk producers put formaldehyde in milk to extend the shelf life. Before the FDA all we could do was to plead with the companies to please stop killing kids.\n\nhttps://www.smithsonianmag.com/science-nature/19th-century-fight-bacteria-ridden-milk-embalming-fluid-180970473/",
                "1. Break government\n\n2. Claim government doesn't work\n\n3. Abandon regulatory agencies, privatize program administration.\n\nEnjoy Russia-West.",
                "The plan to Make America Shittier is working.",
                "I am a medical device auditor.  I can remember a time when a [483](https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/inspection-references/fda-form-483-frequently-asked-questions) was something to be feared by corporate executives.  Defending companies from the FDA was a career path. Now, it's barely even heard of.\n\nThe FDA was barely surviving as it was.  They were a good organization that [helped a lot of people](https://www.fda.gov/about-fda/fda-history-exhibits/frances-oldham-kelsey-medical-reviewer-famous-averting-public-health-tragedy).  But medical devices and especially pharmaceuticals went the way of Boeing back in [2017](https://en.wikipedia.org/wiki/Executive_Order_13771).  With his [newest deregulation efforts](https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-launches-massive-10-to-1-deregulation-initiative/#:~:text=In%20his%20first%20term%2C%20President,for%20everyone%20new%20regulation%20issued.), it really is gone.  This is just another nail in the coffin.  Hopefully we can rebuild someday.",
                "I really hate republicans.",
                "Think about it this way......\n\nA health inspector isn't necessarily efficient for a business. But we need them to maintain food safety. It's not fraud, it's not a Kabal of deep state food molesters. It's a necessary protection. \n\nBut if everything is looked at through the lens of business and not country. Well, the health inspector can be made to look \"fraudulent\".",
                "I work at a medical device manufacturer and the documentation and safety guidelines are all targeted at FDA requirements. Audits at the facility are a huge deal, and any pushback on following process gets over ridden because the consequences of a failed audit are not worth the risk. I don't think most companies are going to backslide on purpose but when the watchdog isn't there it becomes much much easier.",
                "People like to forget a lot of these rules and regulations are written in the blood of the victims of capitalists making food or medicines for maximum profits.\n\nThey dont care if a few hundred or thousand children die or are born deformed as long as profits remain high."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "5 injured, including 2 Americans, in stabbing attack in Amsterdam, police say",
            "external_url": "https://www.cbsnews.com/news/stabbing-attack-amsterdam-injured/",
            "upvotes": 163,
            "date": "03/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/27/25c59835-6413-4da4-8fe6-db7a1e76ab0f/thumbnail/1200x630/3b83e840f2711270a6ed45b274f4f6fa/ap25086595682391.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "The guy who stopped him is a hero:\n\n[https://www.reddit.com/r/PublicFreakout/comments/1jle5ei/a\\_guy\\_makes\\_a\\_citizens\\_arrest\\_on\\_the\\_mass\\_stabber/](https://www.reddit.com/r/PublicFreakout/comments/1jle5ei/a_guy_makes_a_citizens_arrest_on_the_mass_stabber/)",
                "There's nothing in the article describing the attackers motives, FYI.",
                "If this was in the US, the comments would be hundreds more about how unsafe the US is. Mentally ill people are everywhere",
                "I had a friend go to Amsterdam with his dad at 18 and he got beat to death🙁",
                "I had a friend go to Amsterdam with his dad at 18 and he got beat to death🙁",
                "That's just another day in Amsterdam, I remember 2 days ago another person got stabbed ",
                "Which country of the American continents are these Americans from?",
                "Oh no not the americans, Suddenly this is important, but lets worry about the americans."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "King Charles postpones engagements due to side effects of cancer treatment",
            "external_url": "https://www.abc.net.au/news/2025-03-28/king-charles-admitted-to-hospital/105106678",
            "upvotes": 183,
            "date": "03/27/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/10fcd83bc1cc735ccc121681ccca4364?impolicy=wcms_watermark_news&cropH=1776&cropW=3157&xPos=0&yPos=179&width=862&height=485&imformat=generic",
            "top_comments": [
                "That does not sound promising at all.",
                "William better be doing his warm up stretches",
                "We all knew this going to be a brief reign. GL Charles. Modern Medicine Save the King. ",
                "Staying at home is totally fine mate. Hope he gets better soon.\nHeard he's been using cannabis lately.\nHope he's just lazy and chilling",
                "Please let the postponed engagement include meeting with tRump. He is not worthy of sitting with my king.",
                "And Trisha Paytas is pregnant again.  \n\nWhen one supreme rises …",
                "Alternative medicine kinda side affects?? You know Charlie blazes",
                "Isn’t he just doing like beet juice enemas and RFK Jr style “treatments”?",
                "Will he even make a full year on the throne? William might wait the least of any monarch in the last century",
                "William is probably rubbing his hands together."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Record 4.5m children in poverty in UK as cuts condemned as ‘morally repugnant’",
            "external_url": "https://www.theguardian.com/society/2025/mar/27/children-poverty-government-benefit-welfare-cuts-uk",
            "upvotes": 135,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f4d55e89f30478cd82377dceaff771b5df69ec7e/0_543_6770_4062/master/6770.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=67058003f40f9e858091bf218aec591d",
            "top_comments": [
                "Rachel Reeves and Keir Starmer think that the problem with austerity was that it didn't go far enough.\n\nWhat they'll get is further collapse of social cohesion, trust, faith in institutions, and hope for the future. They'll intensify the social unraveling that creates the breeding ground for fascism."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "A DHS staffer faces serious punishment for accidentally adding a reporter to a group email",
            "external_url": "https://www.nbcnews.com/politics/national-security/dhs-staffer-faces-serious-punishment-accidentally-adding-reporter-grou-rcna198233",
            "upvotes": 1750,
            "date": "03/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-11/241105-dhs-seal-wc-1420-227213.jpg",
            "top_comments": [
                "\"But unlike Waltz and Hegseth, who both remain in their jobs, the career DHS employee was put on administrative leave and told late last week that the agency intends to revoke her security clearance, the officials said. \"\n\nThis is what happens to low level staff and the email was not even classified. Go figure.",
                "If somenpne in uniform had done what hegseth and the rest did, they'd be in jail.",
                ".... what about the jerks in charge who were breaking the law by using Signal in the first place?",
                "You can’t make this shit up.",
                "I see they found a female, non-partisan, career, low-level employee to throw under their wildly swerving bus. Fucking pieces of shit.",
                "If Republicans didn't have double standards, then they wouldn't have any standards at all.",
                "So they are going with the blame the coffee boy again..\n\n  \nRepublicans can never own their own mistakes they are the party of \"the other guy did it\"..",
                "\"Different spanks for different ranks.\"",
                "Welcome to the MAGA world where the rules don’t apply to the inner circle, but apply in the strictest sense to everyone else.",
                "That staffer caused an event that likely saved us from a worse national security disaster had the boneheaded use of Signal for secret communications not been discovered."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Pete Hegseth, Mike Waltz, Tulsi Gabbard: Private Data and Passwords of Senior U.S. Security Officials Found Online",
            "external_url": "https://www.spiegel.de/international/world/pete-hegseth-mike-waltz-tulsi-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7",
            "upvotes": 859,
            "date": "03/27/2025",
            "thumbnail": "https://cdn.prod.www.spiegel.de/images/87ac326a-da00-4ba1-b643-d410f8595cbe_w1200_r1.778_fpx60.66_fpy45.jpg",
            "top_comments": [
                "Wow, Pete and I have the same password \"BeerMonkey2K\"",
                "This administration is so irresponsibly compromised.",
                "The one where Hegseth has a Russian email account? Yeah, I don't want explanations anymore. United States of Russia.",
                "Lmao I can't wait for everyone to try as many sites as they can and figure out where these ass clowns use all of the same passwords at. \n\nHopefully people post order history and private message history if they see any. \n\nI'd be more concerned about official homeland security stuff being compromised with stale passwords, but that important shit is all gone and offered to the highest bidder already anyway.",
                "Shitshow clowns. Fuck all the coward Fox news senators that approved these incompetent and corrupt assholes.",
                "When you employ clowns, you build a circus.",
                "\"clean on OPSEC\" - yeah.",
                "I want to see these hypocritical douche's porn search histories.",
                "MAGA doesn't care. It's never a big deal. Libs are making shit up to cry about as usual. \n\nThe US is cooked",
                "Big Balls wheeling and dealing"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "NY county clerk refuses to file Texas' fine for doctor accused of prescribing abortion pills",
            "external_url": "https://apnews.com/article/abortion-pills-lawsuit-texas-new-york-carpenter-e97d5c38d9429083d03c2a7b385cbbfd",
            "upvotes": 4273,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait, didn't they try this shit with the fugitive slave act? Wasn't there a war sometime after that?",
                ">“New York is shredding the Constitution to hide lawbreakers from justice, and it must end,” Paxton said on X. \n\nOh, New York is the one shredding the constitution, is it?",
                "And this sets up the fight they're looking for over NY's shield law, as well as whether they can punish someone in another state that engaged in behavior based in and legal in that state.\n\nIf they win that fight it will be a disaster, but particularly for trans health care and abortion in the short term.",
                "Well kudos to this person. Putting your job on the line for your principles is courageous. America is going to need a lot more of this.",
                "Just wait till Texas has a snatch squad or “bounty hunter” grab her and bring to Texas. Sure it would be illegal, but who’s going to stop them these days.? I’m sure a New York judge would issue an order for her to be brought back, which would swiftly be ignored.",
                "Ken Paxton should be in jail.",
                "Ken Paxton is a crook who used his position as Texas AG to evade securities fraud charges. ",
                "Good on them, fuck Texas!",
                "MAGAverse gonna go on full meltdown.",
                "Sounds like somebody got the memo ... DO NOT COMPLY WITH FASCISTS👍"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Pete Hegseth, Mike Waltz, Tulsi Gabbard: Private Data and Passwords of Senior U.S. Security Officials Found Online",
            "external_url": "https://www.spiegel.de/international/world/pete-hegseth-mike-waltz-tulsi-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7",
            "upvotes": 859,
            "date": "03/27/2025",
            "thumbnail": "https://cdn.prod.www.spiegel.de/images/87ac326a-da00-4ba1-b643-d410f8595cbe_w1200_r1.778_fpx60.66_fpy45.jpg",
            "top_comments": [
                "Wow, Pete and I have the same password \"BeerMonkey2K\"",
                "This administration is so irresponsibly compromised.",
                "The one where Hegseth has a Russian email account? Yeah, I don't want explanations anymore. United States of Russia.",
                "Lmao I can't wait for everyone to try as many sites as they can and figure out where these ass clowns use all of the same passwords at. \n\nHopefully people post order history and private message history if they see any. \n\nI'd be more concerned about official homeland security stuff being compromised with stale passwords, but that important shit is all gone and offered to the highest bidder already anyway.",
                "Shitshow clowns. Fuck all the coward Fox news senators that approved these incompetent and corrupt assholes.",
                "When you employ clowns, you build a circus.",
                "\"clean on OPSEC\" - yeah.",
                "I want to see these hypocritical douche's porn search histories.",
                "MAGA doesn't care. It's never a big deal. Libs are making shit up to cry about as usual. \n\nThe US is cooked",
                "Big Balls wheeling and dealing"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Judge orders Trump administration to preserve Signal chat on Yemen strikes",
            "external_url": "https://abcnews.go.com/US/judge-holds-hearing-administrations-signal-app/story?id=120229350",
            "upvotes": 696,
            "date": "03/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e844e726-deae-4aeb-b402-caceb8c47841/pete-hegseth-1-ht-gmh-250325_1742909596131_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Serious question, WTF is going to happen if they don't? I mean, they've already broken the law, disobeyed the Scotus... And... No repercussions.",
                "Jeffrey Goldberg has the chat in case the admin, er, \"loses\" it.",
                "This will go over well",
                "They might want to think about going with their usual approach of deleting everything and lying.  I'm pretty sure a certain editor in chief will be very happy to share the complete chat with anyone who asks.  Then again, it apparently never occurred to them that if they lied about it he might drop the receipts, so I guess we'll see what happens.",
                "Already deleted.\n\nI'll eat my own ass on camera if I'm wrong.",
                "The only thing that can stop Trump is congress. And the current one is complicit. \n\nSo, if you want to establish a working system of checks and balances again then do not vote for the republican congressman that is supposed to be serving your district/state. They no longer work for you.",
                "They're not going to do it, and it will be yet another flagrant violation of the judicial authority. Consternation will be had by people who could do something about it. Add it to the flaming pile.",
                "They're gonna be like, we can't cuz we don't know how",
                "but judge, we set the chat to self-delete....",
                "I won't follow you. I am a king. Roberts and the SC  have  already crowned me.\n\n\\-Donald Trump"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Exclusive: FDA staff struggle to meet product review deadlines after DOGE layoffs",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/fda-staff-struggle-meet-product-review-deadlines-after-doge-layoffs-2025-03-27/",
            "upvotes": 1744,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "3500 FDA employees will be laid off. This is in addition to those already let go",
                "This isn't a bug, it's a feature.\n\n1. Fire all the staff so they can't get their reviews and approvals done in a timely manner.  \n2. Publicly complain that the FDA approvals are taking too long and regulations are too onerous.  \n3. Remove regulations.",
                "Going back to when America was great and milk producers put formaldehyde in milk to extend the shelf life. Before the FDA all we could do was to plead with the companies to please stop killing kids.\n\nhttps://www.smithsonianmag.com/science-nature/19th-century-fight-bacteria-ridden-milk-embalming-fluid-180970473/",
                "1. Break government\n\n2. Claim government doesn't work\n\n3. Abandon regulatory agencies, privatize program administration.\n\nEnjoy Russia-West.",
                "The plan to Make America Shittier is working.",
                "I am a medical device auditor.  I can remember a time when a [483](https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/inspection-references/fda-form-483-frequently-asked-questions) was something to be feared by corporate executives.  Defending companies from the FDA was a career path. Now, it's barely even heard of.\n\nThe FDA was barely surviving as it was.  They were a good organization that [helped a lot of people](https://www.fda.gov/about-fda/fda-history-exhibits/frances-oldham-kelsey-medical-reviewer-famous-averting-public-health-tragedy).  But medical devices and especially pharmaceuticals went the way of Boeing back in [2017](https://en.wikipedia.org/wiki/Executive_Order_13771).  With his [newest deregulation efforts](https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-launches-massive-10-to-1-deregulation-initiative/#:~:text=In%20his%20first%20term%2C%20President,for%20everyone%20new%20regulation%20issued.), it really is gone.  This is just another nail in the coffin.  Hopefully we can rebuild someday.",
                "I really hate republicans.",
                "Think about it this way......\n\nA health inspector isn't necessarily efficient for a business. But we need them to maintain food safety. It's not fraud, it's not a Kabal of deep state food molesters. It's a necessary protection. \n\nBut if everything is looked at through the lens of business and not country. Well, the health inspector can be made to look \"fraudulent\".",
                "I work at a medical device manufacturer and the documentation and safety guidelines are all targeted at FDA requirements. Audits at the facility are a huge deal, and any pushback on following process gets over ridden because the consequences of a failed audit are not worth the risk. I don't think most companies are going to backslide on purpose but when the watchdog isn't there it becomes much much easier.",
                "People like to forget a lot of these rules and regulations are written in the blood of the victims of capitalists making food or medicines for maximum profits.\n\nThey dont care if a few hundred or thousand children die or are born deformed as long as profits remain high."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Measles case confirmed in person who rode Amtrak train to Washington, D.C., health officials say",
            "external_url": "https://www.cbsnews.com/news/measles-case-confirmed-dc-amtrak-passenger-train-union-station-health-officials/",
            "upvotes": 913,
            "date": "03/27/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2021/07/14/23986ecc-2f39-4b9f-b257-396da71421b8/thumbnail/1200x630/f3dc1c1d2ba998f1aaafabd7333f28cb/GettyImages-1232126765.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Sure glad that I got a simple injection when I was a child that protects me from getting it",
                "For context, the average person with covid will infect about 3 people.\n\n\nThe average person with measles will infect 12.  It is wildly infectious, and it can kill kids.\n\n\nThere is a reason we worked so hard to get rid of it.",
                "It would be poetic justice if RFK Jr gets it.",
                ">Before becoming contagious, the individual with measles had flown from Minnesota into Reagan National Airport, a spokesperson for the D.C. Health Department told CBS News. Neither the identity nor a description of the individual has been released, but the spokesperson said they were vaccinated against measles.\n\nWell that's scary in multiple ways.  Vaccination isn't 100% and immunity can fade with time, which is why a bunch of anti-vaxxers deciding they're going to make their arrogance everyone else's problem is such a bad scenario.",
                "Dude, just drink cod liver oil until you turn yellow and your liver quits",
                "We still have health officials?",
                "RFK says vitamins fix that. So free vitamins for everyone",
                "Non responder.\nWe all have neighbors that are non responders to vaccinations.\nThat’s another part of the population that is at risk when people don’t vaccinate.\nPlease vaccinate to protect all of us.",
                "Good, may the measles blow through DC all the way into the White House.",
                "Enough people refuse or just ignore vaccinations that germs that can be easily contained will always be around the corner waiting to pounce again."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Republican controlled Congress removes funding for protecting California coast",
            "external_url": "https://www.sfgate.com/bayarea/article/california-coastal-bluff-funding-20242812.php",
            "upvotes": 3141,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Every day there's less and less reason to pay federal taxes. \n\n  \nThe state needs to wake up and give us the option to divert the funds to them to actually provide the services being stolen from us.",
                "Seems to me like Congress isn't really thinking of America's best interests how long until we can't call ourselves the United States if we literally don't unite on everything and or anything?",
                "If Democrats get back into power, I fully support ceasing federal funds to red states. I mean, that’s the game now right?",
                "Ok so California should stop paying federal taxes.",
                "Imagine being in an elected position charged with protecting, serving, and benefiting our country and deciding to do dumb shit like this day in and day out.\n\nThese people are incompetent in the best case scenarios... Everyone in our country should be demanding these people's heads at this point.  The damage they're doing is immeasurable.",
                "And California needs to protect the coast to avoid \"Trump CaliBeach Blast costal lenght Resort and Casino\"",
                "Nobody is more effectively antiAmerican than the GOP",
                "OC Repugs will just \"feel\" that it's all our Democratic Party Governor's fault - never thinking (or admitting) that they all caused this; all the while, and in the aftermath, never even realizing the foundational purpose for the money in the first place.",
                "Time for Cali to become independent and create a new government, something like a Republic, call it the \"New California Republic\", yeah, sounds nice, NCR for short.",
                "Shit like this is why I think we will live to see secessionist movements sprout up and grow. \n\nIn fascist America blue states are nothing but slushfunds and whipping boy societies for our rural red apartheid overlords. \n\nThe west coast and New England made America wealthy and influential. Now jealous spiteful backwater and flyover states want to punish us relentlessly for tolerating LGBTQ people and being sane and secular. \n\nEventually the question will be why the fuck are we still in this union? We get nothing but grief from it. The president they assign to lord over us just wants to hurt and insult us. Our tax dollars go out to them but we get nothing but insane policy and punishment.\n\nWhen the cost of existing in this union exceeds the benefit by such an enormous amount people will start looking for the door. Fighting for freedom is often preferable to suffering forever."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "A DHS staffer faces serious punishment for accidentally adding a reporter to a group email",
            "external_url": "https://www.nbcnews.com/politics/national-security/dhs-staffer-faces-serious-punishment-accidentally-adding-reporter-grou-rcna198233",
            "upvotes": 1746,
            "date": "03/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-11/241105-dhs-seal-wc-1420-227213.jpg",
            "top_comments": [
                "\"But unlike Waltz and Hegseth, who both remain in their jobs, the career DHS employee was put on administrative leave and told late last week that the agency intends to revoke her security clearance, the officials said. \"\n\nThis is what happens to low level staff and the email was not even classified. Go figure.",
                "If somenpne in uniform had done what hegseth and the rest did, they'd be in jail.",
                ".... what about the jerks in charge who were breaking the law by using Signal in the first place?",
                "You can’t make this shit up.",
                "I see they found a female, non-partisan, career, low-level employee to throw under their wildly swerving bus. Fucking pieces of shit.",
                "If Republicans didn't have double standards, then they wouldn't have any standards at all.",
                "So they are going with the blame the coffee boy again..\n\n  \nRepublicans can never own their own mistakes they are the party of \"the other guy did it\"..",
                "\"Different spanks for different ranks.\"",
                "Welcome to the MAGA world where the rules don’t apply to the inner circle, but apply in the strictest sense to everyone else.",
                "That staffer caused an event that likely saved us from a worse national security disaster had the boneheaded use of Signal for secret communications not been discovered."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Yale professor who studies fascism fleeing US to work in Canada",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/26/yale-professor-fascism-canada?CMP=Share_AndroidApp_Other",
            "upvotes": 31568,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4ca5fca8e505ad4e446eed6c79a9a958f0d89e2f/0_72_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1b62264f6b12cd17697d55043a02c080",
            "top_comments": [
                "\"Out here, nobody knows where I am, and I’m believed to be away on a trip. Here are brewing economically and politically dark times, so I’m happy to be able to get away from everything.\" \n\n-Einstein hiding in Northern Germany in 1922, eleven years before he renounced his German citizenship following Hitlers rise to chancellor.",
                "A poignant quote from the article:  \"Social media posts spread on Wednesday, noting the alarm sounded by a scholar of fascism leaving the country over its political climate. Nikole Hannah-Jones, the journalist and creator of the 1619 Project,[wrote](https://bsky.app/profile/nhannahjones.bsky.social/post/3llakwvszts2c) on the social media platform Bluesky: “When scholars of authoritarianism and fascism leave US universities because of the deteriorating political situation here, we should really worry.”",
                "The vast majority of U.S. residents cannot leave. They either lack the resources or no one would be willing to take them on due to factors such as age, education, and others reasons. Protected is our freedom to travel, and essentially to leave has been our right. However, with a passport costing $250 and roughly 60% of Americans being a single paycheck away from homelessness, the majority have no freedom to travel or leave.  Trickle-down only worked for billionaires. The middle class has been significantly eroded over the past few decades. We are now stuck with our makings.",
                "If only there had been a literal decade of warnings for people to pay attention to…",
                "\"Those who do not learn from history are doomed to repeat it\"\n\nThis is simply an example of the inverse being true.",
                "He'll be back when he has to do his fieldwork.",
                "Fleeing from Germany to France vibes.",
                "We're hostages tied to a chair while children with loaded guns are running around.  I hate it here",
                "As a Canadian, I think we're better off for having him. But I'm sorry it's coming to this; I have friends in the States and I really feel for them.",
                "This is one of the few silver linings for Canada - a reverse brain drain.\n\nStill, I'd rather have a sane southern neighbor."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Babysitter finds man under bed after child complains of 'monster'",
            "external_url": "https://www.bbc.com/news/articles/c70e2y98p06o",
            "upvotes": 2891,
            "date": "03/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/f543/live/8d4f9f70-0b20-11f0-88df-cbea984e02db.jpg",
            "top_comments": [
                "While trying to show the child there was nothing under the bed, the female victim \"came face-to-face\" with a male suspect, Barton County Sheriff's Office said. An altercation ensued with the babysitter and one child was knocked over.\n\nThe suspect fled and was found and arrested on the same block the next morning, on Tuesday, after leading deputies on a short foot chase.\n\nThe 27-year-old, who once lived at the residence and had a protection from abuse order to stay away from the property, was booked into jail on requested charges of aggravated kidnapping, among other crimes.\n\nOther charges requested include aggravated burglary, aggravated battery, child endangerment, felony obstruction of a law enforcement officer and violation of a protection from abuse order.\n\nThat's terrifying. \n\nAnother reason to not blow off your kids when they say they are afraid of something.",
                "That babysitter is getting a raise...and probably some PTSD treatment.",
                "> The 27-year-old, who once lived at the residence and had a protection from abuse order to stay away from the property, was booked into jail on requested charges of aggravated kidnapping, among other crimes.\n\nThat is terrifying. This is the kind of thing that would make me want to move.",
                "This is terrifying for an adult, let alone a child.",
                "Yeah I’d fucking never recover from that…..",
                "Real life Creepypasta .",
                "I feel like this is basically one of those “Scary Stories” shorts from a book I read when I was a kid",
                "That poor kid is gonna sleep on futons the rest of their life. I'm glad that no one got hurt.",
                "Imagine being a kid, telling your babysitter there’s a monster under your bed. She’s like “oh no, no monsters under here” bends down to check and starts screaming. Trauma for life.",
                "Hey Chuck, it's Pimento!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Judge renews block on Iowa's law banning books that depict sex acts from schools",
            "external_url": "https://www.desmoinesregister.com/story/news/crime-and-courts/2025/03/26/iowa-school-book-ban-law-forbidding-sex-references-blocked-by-court-senate-file-496/82659992007/",
            "upvotes": 597,
            "date": "03/27/2025",
            "thumbnail": "https://staticassets.gannettdigital.com/gci-static-assets/assets/global/checkout/meta-generic.png",
            "top_comments": [
                "Thy two breasts are like two young roes that are twins. – Bible : Song of Solomon 7 : 3",
                "No Bible in school, a win for everyone",
                "I love that they think books are where kids go for “depictions” of sex acts. What year is this???",
                "Despite how people will clutch pearls and shit, especially given the framing of discussions and bills like this by legislators, this was and is the correct decision. By banning everything that \"depicts sex acts,\" it puts a chilling level of oversight onto all literature. The text definitions in these types of bills always allow and open for very easy extension into more and more literature and content.\n\nIt's sort of like (because it kind of is) the anti trans/LGBTQ bills that pop up where they use weaponized vagueness to chill speech and allow further extension, even if the bill is framed as something \"good\" with its name and marketing.",
                "There were definitely a number of teen books I read as a kid and teen (like Many Waters by Madaleine L'Engle) that had coitus in the story and it was all very on the surface descriptions and was just fucking fine for kids to read. Sex is part of life.",
                "Lots of good hitters in the comments. As a summary, as well as a few additions that come to mind:\n\n- Lot offering his daughters to a gangbang scenario\n- Same daughters get impregnated by a drunken Lot\n- Onan spilling his seed on the ground\n- The Judah and Tamar scenario\n- Ezekiel’s prophetic pronouncement about a whoring Israel that’s compared to lusting after donkey penis and horse ejaculation\n\nAny others we’ve forgotten, folks?",
                "Genesis 19:30-36 (NIV):\n\n^(30) Lot and his two daughters left Zoar and settled in the mountains, for he was afraid to stay in Zoar. He and his two daughters lived in a cave. ^(31) One day the older daughter said to the younger, “Our father is old, and there is no man around here to give us children—as is the custom all over the earth. ^(32) Let’s get our father to drink wine and then sleep with him and preserve our family line through our father.”\n\n^(33) That night they got their father to drink wine, and the older daughter went in and slept with him. He was not aware of it when she lay down or when she got up.\n\n^(34) The next day the older daughter said to the younger, “Last night I slept with my father. Let’s get him to drink wine again tonight, and you go in and sleep with him so we can preserve our family line through our father.” ^(35) So they got their father to drink wine that night also, and the younger daughter went in and slept with him. Again he was not aware of it when she lay down or when she got up.\n\n^(36) So both of Lot’s daughters became pregnant by their father.",
                "When I was in 8th grade I stumbled on a book that depicted actual sexual relationships between high-school age teenagers in the library at school - nothing actually pornagraphic, it just discussed teenage sexuality as it was. There was an instance at a camp, another at a party, I forget. I've actually tried finding the book as an adult and I've never been able to. It had won an award even but that never helped me.\n\nThis book also had characters that were questioning their sexuality, in a very adolescent ways and exploratory sense - all of this wasn't the story itself, much like in real life, diacovering sexuality is just one of the things that happens during adolescence and high-school. \n\nIn 8th grade I was just beginning to notice how much I noticed the other the other boys and how little I noticed the girls...\n\nThat book was the first book I had ever read that presented my experience alongside the \"normal experience\" as if it was the same. It was one of the only examples in my childhood of a gay high-schooler. He was dealing with some of same shit I was - I think my experience, especially where I grew up, would have been harder had I not read that book. It reassured me that I was normal, just uncommon.\n\nThese parents believe their protecting their children from the evils of the world. That book didn't make me gay tho, I was always gay. Teenagers don't need sexually explicit content to be sexual - evolution will take care of that all on its own. Helping the kids understand all of this is better for them than pretending none of this is real.",
                "So they just don't have Biology anymore?",
                "This is just banning books with extra steps. Humans eat, shit, and fuck. Any literature that accurately describes the human condition will cover at least two out of three of these."
            ],
            "aggregate_sentiment": 42.0
        }
    ],
    "last_updated": "03/28/2025 00:40:34 UTC"
}