{
    "posts": [
        {
            "category": "HOT",
            "title": "U.S. sent 238 migrants to Salvadoran mega-prison; documents indicate most have no apparent criminal records",
            "external_url": "https://www.cbsnews.com/news/what-records-show-about-migrants-sent-to-salvadoran-prison-60-minutes-transcript/",
            "upvotes": 27981,
            "date": "04/07/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/06/3b1e09e0-d953-4d74-b1bc-7c3e37d31442/thumbnail/1200x630/fd149fa128df9273bc0e471b42d3f4f0/gettyimages-2205557653.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "We knew this - and then administration actually stated that the lack of a criminal record was itself evidence of how dangerous they were.\n\nEta: [ICE official in March saying this](https://www.google.com/amp/s/abcnews.go.com/amp/US/noncitizens-deported-alien-enemies-act-criminal-records-ice/story%3fid=119912375)",
                "> Among them: a makeup artist, a soccer player and a food delivery driver, being held in a place so harsh that El Salvador's justice minister once said the only way out is in a coffin.\n\nReading this article was so sad. Imagine coming to claim asylum, being told you have a valid claim, then vanishing before your court case. Only for photos of you to surface being dragged into a prison that is hell on earth.",
                "In any normal and sane society, this would be grounds for impeachment. I still can’t comprehend that THIS is the world we’re currently living in.",
                "I find this so incredibly sad. I saw a picture of rows of the deportees sat in the prison, heads shaved just vacantly looking into the distance, because at that point you know you’re never getting out. They didn’t send them there to process their claims or hold them to then deport its far far more sinister. It’s really scary and horrible and I can’t believe they can get away with this.",
                "But MAGA said it was only violent criminals? No surprise, Trump is trying to send a racist message to all immigrants by imprisoning them and throwing them in harsh conditions. Next, MAGA is gonna be convincing us why people who come here for a better life deserve to go die in a concentration camp",
                "60 minutes segment on this aired last night (as talked about in the article), highly recommend finding it on YouTube if you can. It’s terrifying.",
                "Even if you support deportation, it doesn't make sense to use money to deport these people specifically to a third country and have them imprisoned. It's inhumane and a waste of money. \n\nWe have due process of law. These people should've had/deserve a day in court, then through litigation, a determination could have been made whether or not they could stay legitimately. \n\nAmericans should be worried about the creeping erosion of our rights and civil liberties.",
                "First it was remove all criminals, and then it was being here without papers was criminal. Moving the goal posts. Being undocumented in the US is a civil offense, not a criminal offense. Everyone should be concerned when there is no due process.",
                "Maga morons will still say they deserve it until it happens to somebody they know",
                "This needs to end. Where is congress? They should be putting the brakes on this president.Nearly everything he does is illegal."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Elon Musk's X to clamp down on parody accounts",
            "external_url": "https://www.bbc.com/news/articles/c4g37elkrxdo",
            "upvotes": 6080,
            "date": "04/07/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e94a/live/b7740ce0-139b-11f0-b054-11b99aeb4b3e.jpg",
            "top_comments": [
                "Free speech absolutists are always just right wing chuds screaming about censorship until they are in control",
                "The bastion of free speech and open comedy. Why would anyone still use X",
                "Is he making comedy illegal on X?",
                "Freedom of speech? More like parody of freedom.",
                "Stop using X.   He doesn’t have to allow free speech on his private platform.  Boycott everything Musk.",
                "If only there was some checkmark system which could be used to see if an account is real or parody.",
                "What happened to “legalize comedy”?",
                "\"Free Speech Absolutist\" indeed...\n\nGentle reminder:\n\n#ELON FUCKS GOATS",
                "thought there was war against comedy mr elon ?",
                "Remember when Elon Musk called himself a \"free speech absolutist\" and some people actually believed him?"
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "HOT",
            "title": "US sidelines DOJ lawyer involved in deportation case, which judge calls 'wholly lawless'",
            "external_url": "https://www.reuters.com/world/us/us-sidelines-doj-lawyer-after-judge-orders-return-man-deported-erroneously-2025-04-06/",
            "upvotes": 2292,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The whole administration is lawless.",
                "Send Marco Rubio to El Salvador to rescue Garcia. He's secretary of state.",
                "Trump is testing the checks and balances of democracy…….Pam bondi is absolute SCUM",
                "Let's not forget what's at stake considering the absolutely horrific conditions at the mega prison they're sending legally protected people to, and now of course floating the idea of sending American citizens there too. https://youtu.be/WMUbrG7eJbY",
                "She should be in jail.",
                "He wasn’t sycophant enough..",
                "Pam Bondi can run the case then and we can watch her unqualified ass fail to push the Trump bullshit through the courts in person.",
                "You didn’t lie or manipulate hard enough, you failed to be as big of an asshole and douchebag as is required to be associated with this administration, you’re fired.",
                "Lawyer truthfully responded to a question from the judge.\nNow he's been removed by the Trump DOJ.\n\n> Reuveni said he had raised questions with U.S. officials about why the federal government could not bring back Abrego Garcia but had received no \"satisfactory\" answer. He acknowledged what he called an \"absence of evidence\" justifying Abrego Garcia's detention and deportation.",
                "DOJ is going to run out of attorneys pretty quick at this rate."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Visa records of CMU international students terminated without notice",
            "external_url": "https://www.ourmidland.com/news/article/cmu-international-students-visa-termination-20259385.php",
            "upvotes": 1326,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The administration is canceling visas without notice so they can claim they are illegal immigrants, arrest them, and send them to foreign prisons without due process.",
                "There is a university near me which has thousands of foreign students paying top dollar for education. One commented on reddit the other day and asked if $68,000 was too much to pay for tuition plus room and board for next year.\n\nI can't think of a better way to destroy medium-sized cities in America, mostly in rural locations, mostly with economies which revolve entirely around these universities.",
                "I don't understand the intent of cancelling student VISAs without notice beyond trying to spark chaos and fear",
                "Trump is like: \"We can't find any students here illegally so we need to create them in order to justify our Gestapo tactics.\" \n\nThis is a stepping stone. Next will be his political enemies, any registered Democrat, anyone that said anything negative online about Trump, any minority including ones that voted for him and then finally his own people out of paranoia until there is no one left. \n\nFascism is a cancer that will kill everything it touches.",
                "At what point will foreign countries not see this as America taking their citizens prisoner?",
                "Colleges are education factories. They manufacture degrees and credentials. This is a valuable export when foreign students come here to study.\n\nWe are destroying our own best industry.",
                "Man, universities are going to lose out on all that out of state tuition fees.",
                "America is turning into quite the scary place. Do 70 million people really hate foreigners that much that people who come to study then go home are picked on?",
                "The federal government is going to absolutely devastate a lot of smaller American cities with this stuff.",
                "How did they find out?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "CNN: Kennedy arrives in Texas after a second unvaccinated child dies of measles amid the state’s outbreak",
            "external_url": "https://www.cnn.com/2025/04/06/health/measles-texas-second-child-dies/index.html",
            "upvotes": 13000,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25058597447123.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The fuck's he gonna do? Find a heroin dealer?",
                "He let 83 die of measles in Samoa. He doesn't care.",
                "Imagine the parents who have lost their child, when they hear from ol' Ken that perhaps vaccines might be the way to go after all...\n\n\nEDIT: [Welp! my comment was premature! he actually straight up said it!](https://www.statnews.com/2025/04/06/rfk-jr-measles-statement-west-texas-outbreak/)",
                "[removed]",
                "Killer showing up to the scene of his crime is a real psychopath move",
                "Relax folks, it's just the brainworm doing the lords work. RFK is just a vessel.",
                "When will RFK be put  in jail for his conspiracy theories and lies ?",
                "Second worst trip a Kennedy made to Texas",
                "Is it so he can eat the remains?",
                "I bet Kennedy has been vaccinated."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "China stocks sink on trade war fears; Hong Kong dives 9%",
            "external_url": "https://www.reuters.com/world/china/china-stocks-sink-trade-war-fears-hong-kong-dives-8-2025-04-07/",
            "upvotes": 1838,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Happy Global Recession day everyone!",
                "The futures overnight here are setting us up for a true Black Monday sell off in the morning.",
                "It would be really embarrassing if the US was once again the cause for a global recession like in 2008",
                "Having just read that approximately 87% of the US stock market is owned by individuals in the top 10% of wealth, it’s clear why the normal maga fan couldn’t care less about the stock market crashing. They don’t own stock.",
                "\"This is not just a stock market drop — it's a catastrophe for the entire world! Trade wars led by major powers are destroying the stability of the global economy, and the consequences of this irresponsibility are being felt by millions of people in all corners of the planet. Every market crash means losses for businesses, jobs, and the savings of ordinary people. How much longer will this madness continue? How much longer will the world pay for political games played by a few individuals who don't think about the consequences for everyone?\"",
                "well done Trump voters, well done.  Good thing you base your Presidential vote on the most inconsequential of issues to own the libs, I would hate to think where this country would be this morning if Kamala was president and YOU didn't make bathrooms a top priority for this country.  Crisis adverted, am I right?",
                "So this is what he thinks liberation looks like, right?",
                "What’s happening holy shit this is stupid",
                "China needs to abandon Russia and enter trade negotiations with Europe and Asian countries.",
                "3 weeks to to the spread....of economic progress!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Protest following officer-involved shooting, video spreads on social media - East Idaho News",
            "external_url": "https://www.eastidahonews.com/2025/04/protest-following-officer-involved-shooting-as-video-spreads-on-social-media/?fbclid=IwY2xjawJgEO1leHRuA2FlbQIxMQABHqmigpnavDytSLrVf_HCK1lieqkEJ7yPrOoVJuYYeekPfCygl84v0QVXtOtM_aem_Zgf-RNswr5WWOf-GQu8OVA",
            "upvotes": 4436,
            "date": "04/07/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/Unknown-8.jpg",
            "top_comments": [
                "> Multiple people who know the man tell EastIdahoNews.com he is 16 or 17 and has autism or other special needs. Those claims have not yet been confirmed. It’s unclear what led to the situation in the front yard, but many say police were too aggressive in their response to the situation.\n\nThey keep calling him a man, and really seem to be downplaying the fact he might have been a teenage boy?",
                "“Officer-involved shooting”\n\nSick of this",
                "A chain link fence was between them and a knife.  Sounds to me like trigger happy police wanted to shoot someone.  And It appears to me that no attempt at de escalation was attempted. They were in no immediate danger.  I get in the heat of a moment you may not know but if that's the case maybe take cover and assess before unloading on a human being.",
                "The dancing around the details is Olympic level mental gymnastics with that headline. ",
                "The video in the player doesn't show blood or anything but I marked it NSFW because it does show cops shoot nine rounds into an autistic boy from behind a fence moments after arriving on scene.",
                "Those fucks weren't even in any danger.  Just step back and maintain distance, and don't provoke people by rushing into the situation screaming while pointing a gun. This country has a huge problem with police culture in what situations violence is expected to be 'reasonable' (hint: nearly any situation).",
                "Never call the police",
                "Officer had his gun pulled as soon as he got out of the police car.",
                "How trigger happy are these cops Jesus",
                "That was a firing squad."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Chinese woman detained by US border patrol in Arizona dies by suicide",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/chinese-woman-border-patrol-arizona-suicide",
            "upvotes": 37925,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4f8803d21e78b9889f3651d55759542f0f3313b0/122_184_3864_2320/master/3864.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e6e0b32190d809a66ec28e3b37cdc695",
            "top_comments": [
                "Pulled up carrying $220k. Dies in custody. No one follows procedures for a death in custody. I wonder where that $ is now. I wonder if it was $220k or a lot lot more.",
                "> The Tucson Sentinel first reported the woman’s death, saying that border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\n\nImagine if someone hadn't made inquiries. How long before anyone who knew her would have gotten answers? She would have just disappeared.",
                "A friend of mine got picked up for drunk driving and was thrown in the county jail. A long line of them were handcuffed together, sitting in a cell waiting to be processed all night. He had chest pain, yelled for help, the guy next to him yelled for help, help didn’t come. He died. They didn’t give a shit. And he was a white middle-aged well off male.",
                "There is going to be a LOT of this and ICE/DHS will not be accurately reporting it either.",
                "\"border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\" so how many have died in custody that we don't know about?",
                "I'm not saying it wasn't suicide, but the article says they didn't even disclose her death until the Tucson Sentinel made inquiries. Seems like they were hoping no one would notice.",
                "So we’re disappearing people and not telling anyone when they die.\n\nCool cool cool. Super cool.",
                "\"A border patrol spokesperson told the Tucson Sentinel that the woman was found “unresponsive in a cell”\n\nAnd that's all we'll hear about that.",
                "1971, Ahmed Timol, anti-apartheid activist, \"died by suicide in police custody\" UNTIL they discovered the truth in 2017. He was tortured and then thrown out of the 10th floor. 72 others \"died in police custody\" stories and many others in the  regime of South Africa. Along with countless others in violently oppressive regimes across history and the planet. \n\n[NPR article ](https://www.npr.org/sections/thetwo-way/2017/10/12/557399388/four-decades-later-south-african-court-rules-that-activist-was-murdered)",
                "I was told nothing like this would happen.\nEdit: Turns out my grandmas full of shit huh"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Dow drops 1,200 and global markets tumble as worries deepen about impact of Trump’s trade war",
            "external_url": "https://apnews.com/article/stocks-markets-nikkei-tariffs-trump-76d0de278a6cad291ace624a74a6a1b6",
            "upvotes": 430,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump [2017](https://www.cnbc.com/2017/02/23/mnuchin-the-stock-market-is-the-trump-administrations-report-card.html): The stock market is the administration’s economic report card\n\nTrump 2025: The stock market is not the economy",
                "It was looking up until everyone realized there was no actual source for the tariff pause. Now Trump has announced another 50% tariff on China in retaliation for the retaliatory 34% that they implemented so expect stocks to go down again.",
                "Things were up 1-2% before the white house announced that the reported \"tariff pause\" was fake news.",
                "Herbert Hoover took 9 months to crash the stock market, the orange felon is going to show us how smart he is by doing it in less than 3.",
                "maybe fucking with peoples money will be enough of a kick in the ass to wake some more up?",
                "Trump take economy to make people forget that Trump take egg.",
                "\"Did you even say thank you\"?",
                "Feels like the Soviets have seen they can't compete in a 21st century setting so they're trying to drag the entire world down to their level.",
                "\"My trade balance with Costco is low, they should pay me to take the groceries out of the store and eat them\" I say, very rationally, as the police arrest me for shoplifting."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "National Park Services removes references to Harriet Tubman from ‘Underground Railroad’ webpage",
            "external_url": "https://www.cnn.com/2025/04/06/us/national-parks-underground-railroad-harriet-tubman/index.html",
            "upvotes": 8041,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-615230666.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You can remove the references, but kids will still learn about it as part of their education.... Oh. Well, they can still read about it in the libraries... Shit.",
                "that's step one. next they'll rewrite what's left to be anti underground railroad",
                "It was never about DEI, it was never about abortion, it was never about Christianity, and it was never about bathrooms.\n\nIt’s been about white supremacy all along.",
                "Fk you Trump. Harriet Tubman is one of America's truest and greatest heroes.",
                "Bro, Harriet Tubman is the farthest thing you could get from a dei hire. She worked hard af.",
                "Spoiler: Some us are not just going to forget she existed. Buy a book. Tell your children. Carry the torch.",
                "… then why even have an Underground Railroad webpage? Just nuke the whole thing and claim it was all a fever dream.",
                "Nazi’s doing Nazi stuff, fantastic",
                "Why is it they are always on the side of awful evil shit?",
                "That's General Tubman to you. "
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Dow drops 1,200 and global markets tumble as worries deepen about impact of Trump’s trade war",
            "external_url": "https://apnews.com/article/stocks-markets-nikkei-tariffs-trump-76d0de278a6cad291ace624a74a6a1b6",
            "upvotes": 431,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump [2017](https://www.cnbc.com/2017/02/23/mnuchin-the-stock-market-is-the-trump-administrations-report-card.html): The stock market is the administration’s economic report card\n\nTrump 2025: The stock market is not the economy",
                "It was looking up until everyone realized there was no actual source for the tariff pause. Now Trump has announced another 50% tariff on China in retaliation for the retaliatory 34% that they implemented so expect stocks to go down again.",
                "Things were up 1-2% before the white house announced that the reported \"tariff pause\" was fake news.",
                "Herbert Hoover took 9 months to crash the stock market, the orange felon is going to show us how smart he is by doing it in less than 3.",
                "maybe fucking with peoples money will be enough of a kick in the ass to wake some more up?",
                "Trump take economy to make people forget that Trump take egg.",
                "\"Did you even say thank you\"?",
                "Feels like the Soviets have seen they can't compete in a 21st century setting so they're trying to drag the entire world down to their level.",
                "\"My trade balance with Costco is low, they should pay me to take the groceries out of the store and eat them\" I say, very rationally, as the police arrest me for shoplifting."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "US sidelines DOJ lawyer involved in deportation case, which judge calls 'wholly lawless'",
            "external_url": "https://www.reuters.com/world/us/us-sidelines-doj-lawyer-after-judge-orders-return-man-deported-erroneously-2025-04-06/",
            "upvotes": 2288,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The whole administration is lawless.",
                "Send Marco Rubio to El Salvador to rescue Garcia. He's secretary of state.",
                "Trump is testing the checks and balances of democracy…….Pam bondi is absolute SCUM",
                "Let's not forget what's at stake considering the absolutely horrific conditions at the mega prison they're sending legally protected people to, and now of course floating the idea of sending American citizens there too. https://youtu.be/WMUbrG7eJbY",
                "She should be in jail.",
                "He wasn’t sycophant enough..",
                "Pam Bondi can run the case then and we can watch her unqualified ass fail to push the Trump bullshit through the courts in person.",
                "You didn’t lie or manipulate hard enough, you failed to be as big of an asshole and douchebag as is required to be associated with this administration, you’re fired.",
                "Lawyer truthfully responded to a question from the judge.\nNow he's been removed by the Trump DOJ.\n\n> Reuveni said he had raised questions with U.S. officials about why the federal government could not bring back Abrego Garcia but had received no \"satisfactory\" answer. He acknowledged what he called an \"absence of evidence\" justifying Abrego Garcia's detention and deportation.",
                "DOJ is going to run out of attorneys pretty quick at this rate."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Elon Musk's X to clamp down on parody accounts",
            "external_url": "https://www.bbc.com/news/articles/c4g37elkrxdo",
            "upvotes": 6078,
            "date": "04/07/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e94a/live/b7740ce0-139b-11f0-b054-11b99aeb4b3e.jpg",
            "top_comments": [
                "Free speech absolutists are always just right wing chuds screaming about censorship until they are in control",
                "The bastion of free speech and open comedy. Why would anyone still use X",
                "Is he making comedy illegal on X?",
                "Freedom of speech? More like parody of freedom.",
                "Stop using X.   He doesn’t have to allow free speech on his private platform.  Boycott everything Musk.",
                "If only there was some checkmark system which could be used to see if an account is real or parody.",
                "What happened to “legalize comedy”?",
                "\"Free Speech Absolutist\" indeed...\n\nGentle reminder:\n\n#ELON FUCKS GOATS",
                "thought there was war against comedy mr elon ?",
                "Remember when Elon Musk called himself a \"free speech absolutist\" and some people actually believed him?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Gaza air strikes follow heaviest rocket fire by Hamas in months",
            "external_url": "https://www.bbc.com/news/articles/c0jzgp947qdo",
            "upvotes": 135,
            "date": "04/07/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3719/live/77ee8940-139d-11f0-ac9f-c37d6fd89579.jpg",
            "top_comments": [
                "10 rockets fired by Hamas, 5 shot down by Israel. 1 Israeli injured by falling debris.\n\nThat's the heaviest rocket fire in months.\n\nIsrael has killed 56 Palestinians in the last 24 hours.",
                "Waiting for Mr “peace on earth” to fix this.",
                "What's left of Hamas might be trying to martyr itself at this point. Why else would they continue to fire ineffective rockets at Israel knowing it would provoke a hundredfold retaliation?",
                "I genuinely don’t understand. How many rockets does it take?!",
                "But the rockets don't do anything right?",
                "Awe inspiring will to resist.",
                "This is all going according to the trumps plans, soon he will have his trump tower in Gaza and somehow this was the better than Kamala (/s the last part)",
                "Trumps chaos coming to a neighborhood near you.",
                "Got to give it to Hamas for lasting this long."
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "NEW",
            "title": "Visa records of CMU international students terminated without notice",
            "external_url": "https://www.ourmidland.com/news/article/cmu-international-students-visa-termination-20259385.php",
            "upvotes": 1320,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The administration is canceling visas without notice so they can claim they are illegal immigrants, arrest them, and send them to foreign prisons without due process.",
                "There is a university near me which has thousands of foreign students paying top dollar for education. One commented on reddit the other day and asked if $68,000 was too much to pay for tuition plus room and board for next year.\n\nI can't think of a better way to destroy medium-sized cities in America, mostly in rural locations, mostly with economies which revolve entirely around these universities.",
                "I don't understand the intent of cancelling student VISAs without notice beyond trying to spark chaos and fear",
                "Trump is like: \"We can't find any students here illegally so we need to create them in order to justify our Gestapo tactics.\" \n\nThis is a stepping stone. Next will be his political enemies, any registered Democrat, anyone that said anything negative online about Trump, any minority including ones that voted for him and then finally his own people out of paranoia until there is no one left. \n\nFascism is a cancer that will kill everything it touches.",
                "At what point will foreign countries not see this as America taking their citizens prisoner?",
                "Colleges are education factories. They manufacture degrees and credentials. This is a valuable export when foreign students come here to study.\n\nWe are destroying our own best industry.",
                "Man, universities are going to lose out on all that out of state tuition fees.",
                "America is turning into quite the scary place. Do 70 million people really hate foreigners that much that people who come to study then go home are picked on?",
                "The federal government is going to absolutely devastate a lot of smaller American cities with this stuff.",
                "How did they find out?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "M23 rebels and Congolese government hold first direct talks in Qatar after months of conflict",
            "external_url": "https://www.zimsphere.co.zw/2025/04/m23-rebels-and-congolese-government.html",
            "upvotes": 92,
            "date": "04/07/2025",
            "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjG14fEE6Ln1LqSr4b_274Faa5KG6Pt6OSzlhMvpeH_oxQolZQwjYrBz5X5ZFUnHqjJc1nEOdgDwWh4eD6Fe9QqFf3CjlBEV_1QVMHcW2BdVhxH90pJQ5vxnWeNWpIa4PMSgJ57BFjSGQ_uA6BVvubwelNEaRXX7z6R6giFZM6bm6afjMTqvpInSfx-90A5/w680/THHAEPWSYVKFXGCK5LWJUCFCT4.jpg",
            "top_comments": [
                "Good. I really hope this doesn't spread again to neighbouring countries, the loss of life will be insane. Last thing we want is a 3rd Congo war."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "U.S. sent 238 migrants to Salvadoran mega-prison; documents indicate most have no apparent criminal records",
            "external_url": "https://www.cbsnews.com/news/what-records-show-about-migrants-sent-to-salvadoran-prison-60-minutes-transcript/",
            "upvotes": 27975,
            "date": "04/07/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/06/3b1e09e0-d953-4d74-b1bc-7c3e37d31442/thumbnail/1200x630/fd149fa128df9273bc0e471b42d3f4f0/gettyimages-2205557653.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "We knew this - and then administration actually stated that the lack of a criminal record was itself evidence of how dangerous they were.\n\nEta: [ICE official in March saying this](https://www.google.com/amp/s/abcnews.go.com/amp/US/noncitizens-deported-alien-enemies-act-criminal-records-ice/story%3fid=119912375)",
                "> Among them: a makeup artist, a soccer player and a food delivery driver, being held in a place so harsh that El Salvador's justice minister once said the only way out is in a coffin.\n\nReading this article was so sad. Imagine coming to claim asylum, being told you have a valid claim, then vanishing before your court case. Only for photos of you to surface being dragged into a prison that is hell on earth.",
                "In any normal and sane society, this would be grounds for impeachment. I still can’t comprehend that THIS is the world we’re currently living in.",
                "I find this so incredibly sad. I saw a picture of rows of the deportees sat in the prison, heads shaved just vacantly looking into the distance, because at that point you know you’re never getting out. They didn’t send them there to process their claims or hold them to then deport its far far more sinister. It’s really scary and horrible and I can’t believe they can get away with this.",
                "But MAGA said it was only violent criminals? No surprise, Trump is trying to send a racist message to all immigrants by imprisoning them and throwing them in harsh conditions. Next, MAGA is gonna be convincing us why people who come here for a better life deserve to go die in a concentration camp",
                "60 minutes segment on this aired last night (as talked about in the article), highly recommend finding it on YouTube if you can. It’s terrifying.",
                "Even if you support deportation, it doesn't make sense to use money to deport these people specifically to a third country and have them imprisoned. It's inhumane and a waste of money. \n\nWe have due process of law. These people should've had/deserve a day in court, then through litigation, a determination could have been made whether or not they could stay legitimately. \n\nAmericans should be worried about the creeping erosion of our rights and civil liberties.",
                "First it was remove all criminals, and then it was being here without papers was criminal. Moving the goal posts. Being undocumented in the US is a civil offense, not a criminal offense. Everyone should be concerned when there is no due process.",
                "Maga morons will still say they deserve it until it happens to somebody they know",
                "This needs to end. Where is congress? They should be putting the brakes on this president.Nearly everything he does is illegal."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "NEW",
            "title": "China stocks sink on trade war fears; Hong Kong dives 9%",
            "external_url": "https://www.reuters.com/world/china/china-stocks-sink-trade-war-fears-hong-kong-dives-8-2025-04-07/",
            "upvotes": 1845,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Happy Global Recession day everyone!",
                "The futures overnight here are setting us up for a true Black Monday sell off in the morning.",
                "It would be really embarrassing if the US was once again the cause for a global recession like in 2008",
                "Having just read that approximately 87% of the US stock market is owned by individuals in the top 10% of wealth, it’s clear why the normal maga fan couldn’t care less about the stock market crashing. They don’t own stock.",
                "\"This is not just a stock market drop — it's a catastrophe for the entire world! Trade wars led by major powers are destroying the stability of the global economy, and the consequences of this irresponsibility are being felt by millions of people in all corners of the planet. Every market crash means losses for businesses, jobs, and the savings of ordinary people. How much longer will this madness continue? How much longer will the world pay for political games played by a few individuals who don't think about the consequences for everyone?\"",
                "well done Trump voters, well done.  Good thing you base your Presidential vote on the most inconsequential of issues to own the libs, I would hate to think where this country would be this morning if Kamala was president and YOU didn't make bathrooms a top priority for this country.  Crisis adverted, am I right?",
                "So this is what he thinks liberation looks like, right?",
                "What’s happening holy shit this is stupid",
                "China needs to abandon Russia and enter trade negotiations with Europe and Asian countries.",
                "3 weeks to to the spread....of economic progress!"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "New Zealand Govt announces huge boost to defence spending.",
            "external_url": "https://www.1news.co.nz/2025/04/07/govt-announces-huge-boost-to-defence-spending/",
            "upvotes": 989,
            "date": "04/07/2025",
            "thumbnail": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/the-nzdf-has-been-awaiting-an-updated-defence-capability-pla-ARWGBFGFNVDDNHLG5575G7BNCE.jpg?auth=b698db17cee5b88ee0f222315e5cb3f7cd9e1467f5a2cfb04cd80c0029e36ad4&quality=70&width=600&height=315&focal=512%2C288",
            "top_comments": [
                "It sums up in just a couple of items. \n\nTwo ageing Air Force Boeing 757 planes are set to be replaced with an indicative cost between $600 million to $1 billion.\n\nBut there will be no replacement for the HMNZS Manawanui that sunk in Samoan waters, instead, there will be a $300 to $600 million investment for additional maintenance and upgrades to the ANZAC frigates HMNZS Te Kaha and Te Mana.\n\nThere's also additional money for helicopters, with $2 billion being appraised as an indicative cost to procure a fleet of them to operate from Navy ships.",
                "Theyve got about the same budget and number of military employees as the Los Angeles police department. ",
                "What about the penguins? Who is going to defend them? 😱",
                "Y'all laugh now but once the new Bob Semple tanks come rolling out you will have wished you let sleeping Kiwis lie.",
                "Weird times are coming, much love to you NZ",
                "Hopefully we see more countries invest in their defense during these uncertain times",
                "If Trump can claim Greenland. Why can't China claim NZ.",
                "Kiwiland has to arm up. Emutopia has been talking mad shit lately. Perun taught me that.",
                "I hope they are not purchasing from the US.",
                "America withdrawing from the world will force other countries to begin researching nuclear weapons development."
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "NEW",
            "title": "Protest following officer-involved shooting, video spreads on social media - East Idaho News",
            "external_url": "https://www.eastidahonews.com/2025/04/protest-following-officer-involved-shooting-as-video-spreads-on-social-media/?fbclid=IwY2xjawJgEO1leHRuA2FlbQIxMQABHqmigpnavDytSLrVf_HCK1lieqkEJ7yPrOoVJuYYeekPfCygl84v0QVXtOtM_aem_Zgf-RNswr5WWOf-GQu8OVA",
            "upvotes": 4430,
            "date": "04/07/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/Unknown-8.jpg",
            "top_comments": [
                "> Multiple people who know the man tell EastIdahoNews.com he is 16 or 17 and has autism or other special needs. Those claims have not yet been confirmed. It’s unclear what led to the situation in the front yard, but many say police were too aggressive in their response to the situation.\n\nThey keep calling him a man, and really seem to be downplaying the fact he might have been a teenage boy?",
                "“Officer-involved shooting”\n\nSick of this",
                "A chain link fence was between them and a knife.  Sounds to me like trigger happy police wanted to shoot someone.  And It appears to me that no attempt at de escalation was attempted. They were in no immediate danger.  I get in the heat of a moment you may not know but if that's the case maybe take cover and assess before unloading on a human being.",
                "The dancing around the details is Olympic level mental gymnastics with that headline. ",
                "The video in the player doesn't show blood or anything but I marked it NSFW because it does show cops shoot nine rounds into an autistic boy from behind a fence moments after arriving on scene.",
                "Those fucks weren't even in any danger.  Just step back and maintain distance, and don't provoke people by rushing into the situation screaming while pointing a gun. This country has a huge problem with police culture in what situations violence is expected to be 'reasonable' (hint: nearly any situation).",
                "Never call the police",
                "Officer had his gun pulled as soon as he got out of the police car.",
                "How trigger happy are these cops Jesus",
                "That was a firing squad."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "US sidelines DOJ lawyer involved in deportation case, which judge calls 'wholly lawless'",
            "external_url": "https://www.reuters.com/world/us/us-sidelines-doj-lawyer-after-judge-orders-return-man-deported-erroneously-2025-04-06/",
            "upvotes": 2296,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The whole administration is lawless.",
                "Send Marco Rubio to El Salvador to rescue Garcia. He's secretary of state.",
                "Trump is testing the checks and balances of democracy…….Pam bondi is absolute SCUM",
                "Let's not forget what's at stake considering the absolutely horrific conditions at the mega prison they're sending legally protected people to, and now of course floating the idea of sending American citizens there too. https://youtu.be/WMUbrG7eJbY",
                "She should be in jail.",
                "He wasn’t sycophant enough..",
                "Pam Bondi can run the case then and we can watch her unqualified ass fail to push the Trump bullshit through the courts in person.",
                "You didn’t lie or manipulate hard enough, you failed to be as big of an asshole and douchebag as is required to be associated with this administration, you’re fired.",
                "Lawyer truthfully responded to a question from the judge.\nNow he's been removed by the Trump DOJ.\n\n> Reuveni said he had raised questions with U.S. officials about why the federal government could not bring back Abrego Garcia but had received no \"satisfactory\" answer. He acknowledged what he called an \"absence of evidence\" justifying Abrego Garcia's detention and deportation.",
                "DOJ is going to run out of attorneys pretty quick at this rate."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Dow drops 1,200 and global markets tumble as worries deepen about impact of Trump’s trade war",
            "external_url": "https://apnews.com/article/stocks-markets-nikkei-tariffs-trump-76d0de278a6cad291ace624a74a6a1b6",
            "upvotes": 423,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump [2017](https://www.cnbc.com/2017/02/23/mnuchin-the-stock-market-is-the-trump-administrations-report-card.html): The stock market is the administration’s economic report card\n\nTrump 2025: The stock market is not the economy",
                "It was looking up until everyone realized there was no actual source for the tariff pause. Now Trump has announced another 50% tariff on China in retaliation for the retaliatory 34% that they implemented so expect stocks to go down again.",
                "Things were up 1-2% before the white house announced that the reported \"tariff pause\" was fake news.",
                "Herbert Hoover took 9 months to crash the stock market, the orange felon is going to show us how smart he is by doing it in less than 3.",
                "maybe fucking with peoples money will be enough of a kick in the ass to wake some more up?",
                "Trump take economy to make people forget that Trump take egg.",
                "\"Did you even say thank you\"?",
                "Feels like the Soviets have seen they can't compete in a 21st century setting so they're trying to drag the entire world down to their level.",
                "\"My trade balance with Costco is low, they should pay me to take the groceries out of the store and eat them\" I say, very rationally, as the police arrest me for shoplifting."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk's X to clamp down on parody accounts",
            "external_url": "https://www.bbc.com/news/articles/c4g37elkrxdo",
            "upvotes": 6077,
            "date": "04/07/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e94a/live/b7740ce0-139b-11f0-b054-11b99aeb4b3e.jpg",
            "top_comments": [
                "Free speech absolutists are always just right wing chuds screaming about censorship until they are in control",
                "The bastion of free speech and open comedy. Why would anyone still use X",
                "Is he making comedy illegal on X?",
                "Freedom of speech? More like parody of freedom.",
                "Stop using X.   He doesn’t have to allow free speech on his private platform.  Boycott everything Musk.",
                "If only there was some checkmark system which could be used to see if an account is real or parody.",
                "What happened to “legalize comedy”?",
                "\"Free Speech Absolutist\" indeed...\n\nGentle reminder:\n\n#ELON FUCKS GOATS",
                "thought there was war against comedy mr elon ?",
                "Remember when Elon Musk called himself a \"free speech absolutist\" and some people actually believed him?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "U.S. sent 238 migrants to Salvadoran mega-prison; documents indicate most have no apparent criminal records",
            "external_url": "https://www.cbsnews.com/news/what-records-show-about-migrants-sent-to-salvadoran-prison-60-minutes-transcript/",
            "upvotes": 27993,
            "date": "04/07/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/06/3b1e09e0-d953-4d74-b1bc-7c3e37d31442/thumbnail/1200x630/fd149fa128df9273bc0e471b42d3f4f0/gettyimages-2205557653.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "We knew this - and then administration actually stated that the lack of a criminal record was itself evidence of how dangerous they were.\n\nEta: [ICE official in March saying this](https://www.google.com/amp/s/abcnews.go.com/amp/US/noncitizens-deported-alien-enemies-act-criminal-records-ice/story%3fid=119912375)",
                "> Among them: a makeup artist, a soccer player and a food delivery driver, being held in a place so harsh that El Salvador's justice minister once said the only way out is in a coffin.\n\nReading this article was so sad. Imagine coming to claim asylum, being told you have a valid claim, then vanishing before your court case. Only for photos of you to surface being dragged into a prison that is hell on earth.",
                "In any normal and sane society, this would be grounds for impeachment. I still can’t comprehend that THIS is the world we’re currently living in.",
                "I find this so incredibly sad. I saw a picture of rows of the deportees sat in the prison, heads shaved just vacantly looking into the distance, because at that point you know you’re never getting out. They didn’t send them there to process their claims or hold them to then deport its far far more sinister. It’s really scary and horrible and I can’t believe they can get away with this.",
                "But MAGA said it was only violent criminals? No surprise, Trump is trying to send a racist message to all immigrants by imprisoning them and throwing them in harsh conditions. Next, MAGA is gonna be convincing us why people who come here for a better life deserve to go die in a concentration camp",
                "60 minutes segment on this aired last night (as talked about in the article), highly recommend finding it on YouTube if you can. It’s terrifying.",
                "Even if you support deportation, it doesn't make sense to use money to deport these people specifically to a third country and have them imprisoned. It's inhumane and a waste of money. \n\nWe have due process of law. These people should've had/deserve a day in court, then through litigation, a determination could have been made whether or not they could stay legitimately. \n\nAmericans should be worried about the creeping erosion of our rights and civil liberties.",
                "First it was remove all criminals, and then it was being here without papers was criminal. Moving the goal posts. Being undocumented in the US is a civil offense, not a criminal offense. Everyone should be concerned when there is no due process.",
                "Maga morons will still say they deserve it until it happens to somebody they know",
                "This needs to end. Where is congress? They should be putting the brakes on this president.Nearly everything he does is illegal."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "China stocks sink on trade war fears; Hong Kong dives 9%",
            "external_url": "https://www.reuters.com/world/china/china-stocks-sink-trade-war-fears-hong-kong-dives-8-2025-04-07/",
            "upvotes": 1840,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Happy Global Recession day everyone!",
                "The futures overnight here are setting us up for a true Black Monday sell off in the morning.",
                "It would be really embarrassing if the US was once again the cause for a global recession like in 2008",
                "Having just read that approximately 87% of the US stock market is owned by individuals in the top 10% of wealth, it’s clear why the normal maga fan couldn’t care less about the stock market crashing. They don’t own stock.",
                "\"This is not just a stock market drop — it's a catastrophe for the entire world! Trade wars led by major powers are destroying the stability of the global economy, and the consequences of this irresponsibility are being felt by millions of people in all corners of the planet. Every market crash means losses for businesses, jobs, and the savings of ordinary people. How much longer will this madness continue? How much longer will the world pay for political games played by a few individuals who don't think about the consequences for everyone?\"",
                "well done Trump voters, well done.  Good thing you base your Presidential vote on the most inconsequential of issues to own the libs, I would hate to think where this country would be this morning if Kamala was president and YOU didn't make bathrooms a top priority for this country.  Crisis adverted, am I right?",
                "So this is what he thinks liberation looks like, right?",
                "What’s happening holy shit this is stupid",
                "China needs to abandon Russia and enter trade negotiations with Europe and Asian countries.",
                "3 weeks to to the spread....of economic progress!"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Visa records of CMU international students terminated without notice",
            "external_url": "https://www.ourmidland.com/news/article/cmu-international-students-visa-termination-20259385.php",
            "upvotes": 1323,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The administration is canceling visas without notice so they can claim they are illegal immigrants, arrest them, and send them to foreign prisons without due process.",
                "There is a university near me which has thousands of foreign students paying top dollar for education. One commented on reddit the other day and asked if $68,000 was too much to pay for tuition plus room and board for next year.\n\nI can't think of a better way to destroy medium-sized cities in America, mostly in rural locations, mostly with economies which revolve entirely around these universities.",
                "I don't understand the intent of cancelling student VISAs without notice beyond trying to spark chaos and fear",
                "Trump is like: \"We can't find any students here illegally so we need to create them in order to justify our Gestapo tactics.\" \n\nThis is a stepping stone. Next will be his political enemies, any registered Democrat, anyone that said anything negative online about Trump, any minority including ones that voted for him and then finally his own people out of paranoia until there is no one left. \n\nFascism is a cancer that will kill everything it touches.",
                "At what point will foreign countries not see this as America taking their citizens prisoner?",
                "Colleges are education factories. They manufacture degrees and credentials. This is a valuable export when foreign students come here to study.\n\nWe are destroying our own best industry.",
                "Man, universities are going to lose out on all that out of state tuition fees.",
                "America is turning into quite the scary place. Do 70 million people really hate foreigners that much that people who come to study then go home are picked on?",
                "The federal government is going to absolutely devastate a lot of smaller American cities with this stuff.",
                "How did they find out?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Gaza air strikes follow heaviest rocket fire by Hamas in months",
            "external_url": "https://www.bbc.com/news/articles/c0jzgp947qdo",
            "upvotes": 133,
            "date": "04/07/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3719/live/77ee8940-139d-11f0-ac9f-c37d6fd89579.jpg",
            "top_comments": [
                "10 rockets fired by Hamas, 5 shot down by Israel. 1 Israeli injured by falling debris.\n\nThat's the heaviest rocket fire in months.\n\nIsrael has killed 56 Palestinians in the last 24 hours.",
                "Waiting for Mr “peace on earth” to fix this.",
                "What's left of Hamas might be trying to martyr itself at this point. Why else would they continue to fire ineffective rockets at Israel knowing it would provoke a hundredfold retaliation?",
                "I genuinely don’t understand. How many rockets does it take?!",
                "But the rockets don't do anything right?",
                "Awe inspiring will to resist.",
                "This is all going according to the trumps plans, soon he will have his trump tower in Gaza and somehow this was the better than Kamala (/s the last part)",
                "Trumps chaos coming to a neighborhood near you.",
                "Got to give it to Hamas for lasting this long."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "New Zealand Govt announces huge boost to defence spending.",
            "external_url": "https://www.1news.co.nz/2025/04/07/govt-announces-huge-boost-to-defence-spending/",
            "upvotes": 989,
            "date": "04/07/2025",
            "thumbnail": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/the-nzdf-has-been-awaiting-an-updated-defence-capability-pla-ARWGBFGFNVDDNHLG5575G7BNCE.jpg?auth=b698db17cee5b88ee0f222315e5cb3f7cd9e1467f5a2cfb04cd80c0029e36ad4&quality=70&width=600&height=315&focal=512%2C288",
            "top_comments": [
                "It sums up in just a couple of items. \n\nTwo ageing Air Force Boeing 757 planes are set to be replaced with an indicative cost between $600 million to $1 billion.\n\nBut there will be no replacement for the HMNZS Manawanui that sunk in Samoan waters, instead, there will be a $300 to $600 million investment for additional maintenance and upgrades to the ANZAC frigates HMNZS Te Kaha and Te Mana.\n\nThere's also additional money for helicopters, with $2 billion being appraised as an indicative cost to procure a fleet of them to operate from Navy ships.",
                "Theyve got about the same budget and number of military employees as the Los Angeles police department. ",
                "What about the penguins? Who is going to defend them? 😱",
                "Y'all laugh now but once the new Bob Semple tanks come rolling out you will have wished you let sleeping Kiwis lie.",
                "Weird times are coming, much love to you NZ",
                "Hopefully we see more countries invest in their defense during these uncertain times",
                "If Trump can claim Greenland. Why can't China claim NZ.",
                "Kiwiland has to arm up. Emutopia has been talking mad shit lately. Perun taught me that.",
                "I hope they are not purchasing from the US.",
                "America withdrawing from the world will force other countries to begin researching nuclear weapons development."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "CNN: Kennedy arrives in Texas after a second unvaccinated child dies of measles amid the state’s outbreak",
            "external_url": "https://www.cnn.com/2025/04/06/health/measles-texas-second-child-dies/index.html",
            "upvotes": 12999,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25058597447123.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The fuck's he gonna do? Find a heroin dealer?",
                "He let 83 die of measles in Samoa. He doesn't care.",
                "Imagine the parents who have lost their child, when they hear from ol' Ken that perhaps vaccines might be the way to go after all...\n\n\nEDIT: [Welp! my comment was premature! he actually straight up said it!](https://www.statnews.com/2025/04/06/rfk-jr-measles-statement-west-texas-outbreak/)",
                "[removed]",
                "Killer showing up to the scene of his crime is a real psychopath move",
                "Relax folks, it's just the brainworm doing the lords work. RFK is just a vessel.",
                "When will RFK be put  in jail for his conspiracy theories and lies ?",
                "Second worst trip a Kennedy made to Texas",
                "Is it so he can eat the remains?",
                "I bet Kennedy has been vaccinated."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Protest following officer-involved shooting, video spreads on social media - East Idaho News",
            "external_url": "https://www.eastidahonews.com/2025/04/protest-following-officer-involved-shooting-as-video-spreads-on-social-media/?fbclid=IwY2xjawJgEO1leHRuA2FlbQIxMQABHqmigpnavDytSLrVf_HCK1lieqkEJ7yPrOoVJuYYeekPfCygl84v0QVXtOtM_aem_Zgf-RNswr5WWOf-GQu8OVA",
            "upvotes": 4432,
            "date": "04/07/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/Unknown-8.jpg",
            "top_comments": [
                "> Multiple people who know the man tell EastIdahoNews.com he is 16 or 17 and has autism or other special needs. Those claims have not yet been confirmed. It’s unclear what led to the situation in the front yard, but many say police were too aggressive in their response to the situation.\n\nThey keep calling him a man, and really seem to be downplaying the fact he might have been a teenage boy?",
                "“Officer-involved shooting”\n\nSick of this",
                "A chain link fence was between them and a knife.  Sounds to me like trigger happy police wanted to shoot someone.  And It appears to me that no attempt at de escalation was attempted. They were in no immediate danger.  I get in the heat of a moment you may not know but if that's the case maybe take cover and assess before unloading on a human being.",
                "The dancing around the details is Olympic level mental gymnastics with that headline. ",
                "The video in the player doesn't show blood or anything but I marked it NSFW because it does show cops shoot nine rounds into an autistic boy from behind a fence moments after arriving on scene.",
                "Those fucks weren't even in any danger.  Just step back and maintain distance, and don't provoke people by rushing into the situation screaming while pointing a gun. This country has a huge problem with police culture in what situations violence is expected to be 'reasonable' (hint: nearly any situation).",
                "Never call the police",
                "Officer had his gun pulled as soon as he got out of the police car.",
                "How trigger happy are these cops Jesus",
                "That was a firing squad."
            ],
            "aggregate_sentiment": 20.0
        }
    ],
    "last_updated": "04/07/2025 16:10:18 UTC"
}