{
    "posts": [
        {
            "category": "HOT",
            "title": "Record number of Americans are seeking residency in UK, according to Home Office",
            "external_url": "https://www.theguardian.com/us-news/2025/may/24/americans-british-citizenship",
            "upvotes": 4843,
            "date": "05/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b5d46f93582dcaa734073c597c92474b53b475fd/0_0_3750_3000/master/3750.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a5ce1eca4fc1f7612f1dc9daf1b3d9cc",
            "top_comments": [
                "I'm genuinely kinda shocked more countries aren't trying to capitalize on America destroying its scientific institutions. It'd be pretty easy right now to poach our best and brightest minds for their gain",
                "RE: the British government “will introduce new, higher language requirements” because “the ability to speak English is integral to everyone’s ability to contribute and integrate”.\n\nThat rules out some of the Redditirs whose postings I have seen.",
                "I found a way over here via enrolling in a masters program. Might not be permanent, but I’m working on rolling it into a grad visa and then maybe stay via a skilled worker visa. Wish there were better options for bailing out of the US. So many people living there hate what is happening and simply don’t have the resources to leave or the agency to change it.",
                "The thought of ditching the US really does seem more and more appealing as things get worse and worse.",
                "We can only hope that they make an attempt to integrate with our culture and learn our language",
                "1,900 people didn’t wait for the next headline. They just applied. That’s the story.",
                "Took almost 200 years but it's time to go home.",
                "If I had the money to leave I’d already be out",
                "Between people leaving, people being deported, tourism down and people who voted against this regime actively trying to boycott supporters of Trump the economy is going to dump big time.  It may not be apparent now but a year from now will look very different from what the Biden presidency accomplished. Shame on our elected congress.",
                "I started applying for teaching jobs in South Korea the day after the election. I have no intention of returning to the states as long as the GOP and tech bros control the government."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Publix recalls baby food sold in more than 1,400 stores after testing finds elevated lead levels",
            "external_url": "https://www.cbsnews.com/news/publix-baby-food-recall-lead-pouches/",
            "upvotes": 2338,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2021/02/19/e15e76e8-dedc-468c-8dd1-4f70585b9bf9/thumbnail/1200x630/7f10b6a225f9f8fcc7880cfe836c99e1/about-publix-store-front-306x150.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Publix said all the potentially contaminated products have been removed from store shelves. No illnesses have been reported, the company said. Customers can return the pouches to local stores for full refund.\n\nThis is the second baby food pouch recall because of potential lead contamination in two months. In March, Target recalled more than 25,000 packages of its store brand Good & Gather Baby Pea, Zucchini, Kale & Thyme Vegetable Puree because of elevated lead levels.",
                "Man I can't wait until we stop testing for this stuff so I don't have to worry anymore",
                "“Publix recalled 4-ounce Greenwise Pear, Kiwi, Spinach & Pea Baby Food pouches sold at more than 1,400 stores.”\n\nSaved you a click.",
                "Not much more of these warnings are going to be coming anymore.  Can’t wait to see the chaos that comes from that. ",
                "You can't expect companies to spend 10 whole dollars to test a batch of baby food for lead. Far more cost effective to put that money toward a lobbyist...",
                "How the fuck is lead introduced into baby food? Are they using lead mixing bowls? Why is lead anywhere near a baby food processing facility? Please explain to me, I don’t understand.",
                "How dare they test for lead in baby food?!? Where is RFK?!?",
                "Fox News is outraged that Publix is preventing future Fox news watchers.",
                "Back in my day we had to eat paint chips to get our lead.",
                "Elevated…? \n\nUp from what…? There is zero “safe level” for lead."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "\"Rust\" armorer Hannah Gutierrez-Reed released from prison 13 months after involuntary manslaughter conviction",
            "external_url": "https://www.cbsnews.com/news/rust-armorer-hannah-gutierrez-reed-released-from-prison/",
            "upvotes": 3005,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/04/15/d6c32a4a-9cb3-4ece-9337-132cf480eee8/thumbnail/1200x630/22c3e22acdbfedbb2ab58487d54b3b7b/ap24103814537427.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Just in time for the premiere!",
                "Serious questions: How did the live ammo even made it into the vicinity of the set? Would there be a valid reason to have live ammo with actors around?",
                "She did more time than anyone at Beoing, who was initially prosecuted for negligence for those two major plane crashes, but the Trump administration had a change of *heart*.",
                "I guess the question comes down to how long we want to put people into jail for accidents -even when they are caused by irresponsibility.  Distracted driving, failing to inspect construction equipment, not stopping some unsafe condition on a work site.  It's all basically the same so far as I see it.  Yeah, there are some situations where we know there will never be a repeat (she'll never get a job doing this again).  \n\n\nI feel like 13 months is probably about right for something like this where there isn't a guilty mind involved.",
                "The UPM who replaced the one who quit with her never was punished or convicted of any wrong doing even though he knew she wasn’t qualify",
                "Prison time was far shorter than all the time spent on legal wrangling and the trials.",
                "Did her defense team ever bother appealing based on the Brady violation that came to light during Baldwin's trial?",
                "I'm fine with her getting out.  I am pissed that the production team that hired her is getting off without any punishment.",
                "Such a tragedy all around…I feel bad for Baldwin as he shot a close friend by accident and he was given the prop with no way of knowing…I mean he’s shot a lot off movie guns",
                "This woman definitely fucked up, but let’s be real. This accident was mainly the fault of production and the AD who threw her completely under the bus. She deserved time, but others on this set deserved more."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Russia launches major aerial attack on Ukraine capital",
            "external_url": "https://www.bbc.com/news/articles/cy908n4vr0jo",
            "upvotes": 3171,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/a586/live/a0bdf040-38af-11f0-8519-3b5a01ebe413.jpg",
            "top_comments": [
                "Russia launched 250 drones and 14 ballistic missiles against Kyiv, Ukraine's air force said, causing fires in residential buildings. It was one of the biggest combined aerial assaults on the city since the war began. The air force said it had downed six missiles and 245 drones.",
                "Fuck Russia. Fuck Trump and his cronies in washington taking care of a genocidal, geriatric, pilled-up grandpa.",
                "Don't forget people, it's important for the peace efforts to let them enough time to prepare a memorandum and then a ceasefire, all they need is time to be sure of how to prepare peace.\n\n\nAlso, it's Biden's war, not mine, if I was president by the time, this war would never have begun. And you know, my doctor, he saw my results in the IQ test, beautiful results, beautiful, he never saw such results, he told me they were beautiful, he never saw such results like these, he said you're in the genius category, and Putin is a good guy I think, he 'ever wanted this war, it was all Biden's war, nice guy that putin, very clever, very smart, and yes, these IQ results, I wish you could see them, so beautiful.",
                "[removed]",
                "I thought Trump was going to end this with one call months ago.  Did he lose the phone number?",
                "Fuck Russia and fuck their puppet president.",
                "I thought Trump brokered a truce 🤨",
                "At this point, just bomb the Kremlin and then accuse Russia of escalation 🤦🏼 uno reverse card",
                "[removed]",
                "My wife decided to visit her mom in Kyiv this week. Great timing. :/"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "New COVID variant NB.1.8.1 behind surge in China, now detected in U.S.",
            "external_url": "https://www.cbsnews.com/news/us-reports-cases-new-covid-variant-nb-1-8-1-behind-surge-china/",
            "upvotes": 28538,
            "date": "05/24/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2022/07/02/f51bdaca-e805-497f-ac63-87512d4f26e8/thumbnail/1200x630g8/61033adab0efca6ba877823db762172b/GettyImages-457163942.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Covid starting to look like patch notes",
                "If Nintendo reveals AC for the Switch 2, then it's time to panic.",
                "I'm starting to get sick of reality's recycled plot devices.",
                "[https://cdn.who.int/media/docs/default-source/documents/epp/tracking-sars-cov-2/23052025\\_nb.1.8.1\\_ire.pdf?sfvrsn=7b14df58\\_4](https://cdn.who.int/media/docs/default-source/documents/epp/tracking-sars-cov-2/23052025_nb.1.8.1_ire.pdf?sfvrsn=7b14df58_4)\n\nWHO TAG-VE Risk Evaluation for SARS-CoV-2 Variant Under Monitoring: NB.1.8.1\n\nExecutive Summary\n\nNB.1.8.1 has been designated a SARS-CoV-2 variant under monitoring (VUM) with increasing proportions\n\nglobally, while LP.8.1 is starting to decline. Considering the available evidence, the additional public health risk\n\nposed by NB.1.8.1 is evaluated as low at the global level. Currently approved COVID-19 vaccines are expected\n\nto remain effective to this variant against symptomatic and severe disease. Despite a concurrent increase in\n\ncases and hospitalizations in some countries where NB.1.8.1 is widespread, current data do not indicate that\n\nthis variant leads to more severe illness than other variants in circulation.",
                "Take a look at [Covid.gov](https://www.whitehouse.gov/lab-leak-true-origins-of-covid-19/). They turned that site into a joke.",
                "I will laugh so hard if that meme VIP dinner last night turns into a super spreader event.",
                "Oh good, just in time for it to be against the law for most of us to get vaccinated against it.",
                "Covid dlc before gta6",
                "We had first COVID, yes, but what about second COVID?",
                "What a great time to make covid vaccines harder to get /s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Israeli strike kills nine of Gaza doctor's children, hospital says",
            "external_url": "https://www.bbc.com/news/articles/c0eq9lq7xr1o",
            "upvotes": 429,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8869/live/124e1230-3879-11f0-af52-6daeecfc60cc.jpg",
            "top_comments": [
                "I can’t even imagine losing your children like this. Just utter depravity.",
                "They learnt lessons from the Nazis; why bother with concentration camps when you can skip straight to the ethnic cleansing?",
                "“The IDF is finally conducting a campaign against the civilian rule of ⁦‪Hamas‬⁩ and not just focusing on the military infrastructure. We are eliminating ministers, officials, money changers, and elements of the economic and governmental system”\n\nIsraeli defense minister Smotrich a few days ago. Expect more targeted assassinations of healthcare workers and their families.",
                "At this point, there is never going to be accountability, there will never be ramifications of what has been done, there is never turning back to the children who have lost limbs, lives, parents, relatives because they see nothing but revenge. So the cycle will continue, the cause for freedom will continue, in forms of terror, in forms of violence, exactly what those in power need to fuel their desire for power and money to feed their military doctrines.\n\nPeace is only going to be a thought, condemnation will come and go, stern words will be thrown out. But the victim card that Israel holds, unfortunately, over the world is heavy, because 6 million plus lives were lost, and the loss of innocence is being used as a tool to say \"never again\" fueld with violence, and desire to stay in power.\n\nAt the end only innocence will suffer, only innocence will be stolen, only tears that will be cared for, will be the ones who are privileged and not the impoverished. \n\nSadly because rich tears are far more valuable than the poor ones for the world to do something and care.",
                "\"we thought there were more\" - Israel when asked why they killed 9 children ",
                "Evil",
                "Everyone is Hamas, so no genocide. - Israel\n\nBibi belongs in jail!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Tree-sitter enters third week in WA's Olympic Foothills to halt logging",
            "external_url": "https://www.fox13seattle.com/news/tree-sitter-enters-third-week",
            "upvotes": 1465,
            "date": "05/24/2025",
            "thumbnail": "https://images.foxtv.com/static.q13fox.com/www.q13fox.com/content/uploads/2025/05/1280/720/vlcsnap-2025-05-23-19h10m42s347.jpg?ve=1&tl=1",
            "top_comments": [
                "Here’s one for the guy who replied that the states would manage their forests just fine and keep them safe, when I posted worrying about this administration opening 59% of our national forests for logging.\n\nThanks so much, Washington, for continuing to demonstrate that money into the right pockets trumps everything else.",
                "save the trees! especially the old growth forests.",
                "read the article, this guy is fucking hardcore.  he has a trap set that will straight up kill him if anything in his camp is tampered with.  if you try and force him down *you will kill him*",
                "It’s early, I had to read that title twice to realize tree sitting is not an Olympic event.",
                "Not all heroes wear capes. Some wear rope harnesses and fight for forests the quiet way",
                "Honestly, we(those of us with jobs and life obligations we can’t abandon to live in a tree) should start a fund to pay people a modest wage to stage protests like these. I can’t stand the sight of our natural world being pillaged, but I can’t just abandon my life to do stuff like this, as much as I would like to. Does that make me a bad person? A hypocrite? Sometimes I just don’t know anymore.",
                "This is what a real hero looks like. Fuck Trump and all his fascist ilk.",
                " 3 weeks? They’re a tree shitter too by now",
                "Is this some sort of advertisement for that weird Broadway musical where Idena dances around a tree for two hours"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Killer whales left trapped in abandoned French marine park four months after closure.",
            "external_url": "https://www.standard.co.uk/news/world/orcas-trapped-french-marine-park-four-months-after-closure-b1227904.html",
            "upvotes": 27450,
            "date": "05/23/2025",
            "thumbnail": "https://static.standard.co.uk/2025/05/15/9/55/GettyImages-2191585917.jpg?width=1200&auto=webp&quality=75",
            "top_comments": [
                "Several sanctuaries have petitioned France to rescue the orcas. So far two, one in Japan and one in Canada, have been rejected for being too far to transport. There are also dolphins in another enclosure that need help too. They can not be released due to being bred in captivity.\n\n**Edit:** Courtesy of /u/MtnMoonMama here is a link to write President Macron about the situation if you feel so inclined. https://www.elysee.fr/en/contact/",
                "So they’re feeding them but can’t seem to find the resources to clean the enclosures? Sounds like rubbish excuses from those responsible. ",
                "Fucking Christ, that drone shot of them being in separate pools, is just fucking heart breaking. They've been like that for MONTHS! Fucking hell. The previous owners of that abandoned park need to be in jail for decades.",
                "This an intelligent animal that is huge and made for a life in the open ocean.\n\nIt must drive them absolutely fucking insane being confined to a limited space",
                "You can send Emmanuel Macron a direct message here\n\n\nhttps://www.elysee.fr/en/contact/\n\n\nEdit: fill out the form. Send it. They send you an email with a link you must click. Click the link to send. ",
                "Need to find a maladjusted orphan boy with a soft heart to solve this one. ",
                "Keeping these animals who travel thousands of miles in the wild in little kiddie pools is straight up torture. Idk why we still allow this",
                "is it the price of long distance travel that is the problem? i can't imagine the stress of that trip would be more than what they are going through now",
                "Man, where's the Mexican space program when you need it.",
                "Humans are fucking garbage"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "ICE Arrests Mississippi Father at His Citizenship Hearing",
            "external_url": "https://www.mississippifreepress.org/ice-arrests-mississippi-father-at-his-citizenship-hearing-threatening-deportation/",
            "upvotes": 273,
            "date": "05/24/2025",
            "thumbnail": "https://www.mississippifreepress.org/wp-content/uploads/2025/05/Kasper-Eriksen-and-family6_courtesy-Savannah-Eriksen.jpg",
            "top_comments": [
                "So many stories like this. We are very quickly becoming unrecognizable to the America that was once great in so many ways. Why would anyone choose to be here now? The land of opportunity no more so long as little caesar and his puppet masters are in power.",
                "The party of law and order really seems to hate law and order. Like, literally trying to subvert the courts and prevent them from doing their job, while people are trying to comply with the law at the courthouse.",
                "He’s also a Trump supporter. So, leopards ate his face.",
                "Guy's a massive trumper. While I oppose his arrest and possible deportation on principle, I don't exactly feel bad for him. This is exactly what he voted for. He just didn't think it would happen to him \\[because he's white\\].",
                "lol they camping citizenship offices and ceremonies and grab them before the paperwork finishes? that’s messed up",
                "Do you have to be present at at these hearings or can a lawyer represent you?",
                "It looks like ICE is pretty unbiased as to who it goes after.",
                "\"Why aren't people immigrating here from great countries like Norway?\"\n\n  \nWell...ok.",
                "\"fear to be deported from Mississippi to Denmark\" 😂😂😂",
                "This is how you know it’s not about doing things the right way as MAGAs love to claim"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Belgium’s future queen caught up in Harvard foreign student ban",
            "external_url": "https://www.theguardian.com/world/2025/may/23/belgium-future-queen-caught-up-harvard-foreign-student-ban",
            "upvotes": 20518,
            "date": "05/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d0fad91d174129333633af0dd7dae3047248878b/2016_115_1435_1148/master/1435.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5be6fbb9164c1aab0e2f3c34b6c77a0e",
            "top_comments": [
                "There will be lots of sons and daughters of prominent politicians and rich internationals impacted by this.  I bet there will be lots of exceptions made.",
                "Go read the DHS rational for this decision it’s insanity. They accuse Harvard of basically working with the CCP to undermine American interests",
                "I remember in his first term, POTUS wondered out loud about why people from “white” European counties aren’t immigrating to the US instead of from those “sh*thole” countries. He’s his own worst enemy in terms of promotion, self or otherwise.",
                "With her stature as future Queen, the Yales and Stanfords will be eager to offer her a spot. I have more sympathy for the normal people who got in purely on merit — they're the ones truly screwed.",
                "Yep she is a radical and a terrorist suspect.   Needs to have Trumps ICE treatment ….  No questions asked no due process like the rest of them … let’s see how he sugar coats this one.  Insane !",
                "Not calling her crown princess is weird.",
                "Ha! This is so funny given how enamored Trump is with royals!",
                "Harvard sues and judge has blocked Trump’s ban.\n\nhttps://www.nytimes.com/2025/05/23/us/harvard-sues-trump-international-students-garber.html",
                "They forgot to exempt white girls",
                "im sorry, but what about university autonomy? how the fuck is this happening? what the fuck is wrong with the usa? baffling. absolutely baffling"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Crypto investor charged in NYC for kidnapping, torture of Italian tourist, police say",
            "external_url": "https://www.cbsnews.com/amp/newyork/news/kidnapping-torture-arrest-soho-italian-tourist/",
            "upvotes": 2,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/23/848bb1fe-05f0-4636-8209-5be198c5f672/thumbnail/1200x630/b16228493cbe4a2e3e4666ca78618bc9/6-reid-image-720.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Sabotage suspected as power cut hits Cannes Film Festival",
            "external_url": "https://www.bbc.com/news/articles/c4gel3g84q0o",
            "upvotes": 26,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3b4a/live/a5502e50-38ca-11f0-96c3-cf669419a2b0.jpg",
            "top_comments": [
                "It's the cannes! He hates these cannes! ",
                "I can't stand it. I know you planned it.",
                "You must construct additional pylons.",
                "I Cannes ‘tand it, I know you planned it"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump's trade war puts Australian beef centre stage in Shanghai",
            "external_url": "https://www.abc.net.au/news/2025-05-24/shanghai-expo-during-trump-tariffs-puts-aussie-beef-centre-stage/105326724",
            "upvotes": 8,
            "date": "05/24/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/ef08860d3a56df67c28ee69b5735e409?impolicy=wcms_watermark_news&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
            "top_comments": [
                "I bet those farmers sitting on beef in the US are enjoying the vote.",
                "Australia beef sales will now be the choice. US beef took theirs off the menu. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "White House slashing staff in major overhaul of National Security Council, officials say",
            "external_url": "https://apnews.com/article/trump-national-security-council-nsc-50ac71e10b9700a0c0e4266afc958cc3",
            "upvotes": 34,
            "date": "05/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "After all, who needs intelligence briefings when the president is a stone cold moron so stupid the briefings literally bounce off his smooth brain?",
                "Uhg, I'm sure this is bad and has lots of ripple effects we can't even foresee but at this point..add it to the list of shit we have to try to fix once fuckface is gone",
                "I hear the secret service has way too many agents.  Maybe start there?",
                "Key Proposals Regarding NSC in Project 2025: Ensure national security decisions are aligned with the President's objectives. Replace career officials with individuals more closely aligned with loyalty and adherence to President's vision. Consolidate executive power, so the President has greater control of national security decisions. To emphasize alignment with conservative principles, or a Christian Nationalist Agenda. Criminalize behavior that does not conform to specific religious doctrines. Such a fun timeline."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "ICE Arrests Mississippi Father at His Citizenship Hearing",
            "external_url": "https://www.mississippifreepress.org/ice-arrests-mississippi-father-at-his-citizenship-hearing-threatening-deportation/",
            "upvotes": 266,
            "date": "05/24/2025",
            "thumbnail": "https://www.mississippifreepress.org/wp-content/uploads/2025/05/Kasper-Eriksen-and-family6_courtesy-Savannah-Eriksen.jpg",
            "top_comments": [
                "So many stories like this. We are very quickly becoming unrecognizable to the America that was once great in so many ways. Why would anyone choose to be here now? The land of opportunity no more so long as little caesar and his puppet masters are in power.",
                "The party of law and order really seems to hate law and order. Like, literally trying to subvert the courts and prevent them from doing their job, while people are trying to comply with the law at the courthouse.",
                "He’s also a Trump supporter. So, leopards ate his face.",
                "Guy's a massive trumper. While I oppose his arrest and possible deportation on principle, I don't exactly feel bad for him. This is exactly what he voted for. He just didn't think it would happen to him \\[because he's white\\].",
                "lol they camping citizenship offices and ceremonies and grab them before the paperwork finishes? that’s messed up",
                "Do you have to be present at at these hearings or can a lawyer represent you?",
                "It looks like ICE is pretty unbiased as to who it goes after.",
                "\"Why aren't people immigrating here from great countries like Norway?\"\n\n  \nWell...ok.",
                "\"fear to be deported from Mississippi to Denmark\" 😂😂😂",
                "This is how you know it’s not about doing things the right way as MAGAs love to claim"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Ten Women Assaulted by Denver Lyft Driver Urge Governor to Sign Rideshare Bill",
            "external_url": "https://www.westword.com/news/women-assaulted-by-lyft-driver-ask-colorado-gov-sign-bill-24608150",
            "upvotes": 23,
            "date": "05/24/2025",
            "thumbnail": "https://media2.westword.com/den/imager/ten-women-kidnapped-assaulted-by-denver-lyft-driver-urge-governor-to-sign-rideshare-safety-bill/u/r-landingfeature/24608845/lyft_copy.webp?cb=1748004297",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Israeli strike kills nine of Gaza doctor's children, hospital says",
            "external_url": "https://www.bbc.com/news/articles/c0eq9lq7xr1o",
            "upvotes": 432,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8869/live/124e1230-3879-11f0-af52-6daeecfc60cc.jpg",
            "top_comments": [
                "I can’t even imagine losing your children like this. Just utter depravity.",
                "They learnt lessons from the Nazis; why bother with concentration camps when you can skip straight to the ethnic cleansing?",
                "“The IDF is finally conducting a campaign against the civilian rule of ⁦‪Hamas‬⁩ and not just focusing on the military infrastructure. We are eliminating ministers, officials, money changers, and elements of the economic and governmental system”\n\nIsraeli defense minister Smotrich a few days ago. Expect more targeted assassinations of healthcare workers and their families.",
                "At this point, there is never going to be accountability, there will never be ramifications of what has been done, there is never turning back to the children who have lost limbs, lives, parents, relatives because they see nothing but revenge. So the cycle will continue, the cause for freedom will continue, in forms of terror, in forms of violence, exactly what those in power need to fuel their desire for power and money to feed their military doctrines.\n\nPeace is only going to be a thought, condemnation will come and go, stern words will be thrown out. But the victim card that Israel holds, unfortunately, over the world is heavy, because 6 million plus lives were lost, and the loss of innocence is being used as a tool to say \"never again\" fueld with violence, and desire to stay in power.\n\nAt the end only innocence will suffer, only innocence will be stolen, only tears that will be cared for, will be the ones who are privileged and not the impoverished. \n\nSadly because rich tears are far more valuable than the poor ones for the world to do something and care.",
                "\"we thought there were more\" - Israel when asked why they killed 9 children ",
                "Evil",
                "Everyone is Hamas, so no genocide. - Israel\n\nBibi belongs in jail!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Power outage hits Cannes Film Festival and traffic in southeastern France",
            "external_url": "https://abcnews.go.com/International/wireStory/power-outage-hits-cannes-film-festival-traffic-southeastern-122148128",
            "upvotes": 144,
            "date": "05/24/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/99267b56-7f22-42fc-8aba-0f9edd3b2317/wirestory_1747c2b19ae0eb92e5d7a6b21accdf68_16x9.jpg?w=1600",
            "top_comments": [
                "Cannes Film Festival organizers confirmed the outage affected the early activities of Saturday and said the Palais des Festivals — the Croisette's main venue — had switched to an independent power supply.\n\n“All scheduled events and screenings, including the Closing Ceremony, will proceed as planned and under normal conditions,” the statement said. \"At this stage, the cause of the outage has not yet been identified. Restoration efforts are underway.\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Publix recalls baby food sold in more than 1,400 stores after testing finds elevated lead levels",
            "external_url": "https://www.cbsnews.com/news/publix-baby-food-recall-lead-pouches/",
            "upvotes": 2343,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2021/02/19/e15e76e8-dedc-468c-8dd1-4f70585b9bf9/thumbnail/1200x630/7f10b6a225f9f8fcc7880cfe836c99e1/about-publix-store-front-306x150.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Publix said all the potentially contaminated products have been removed from store shelves. No illnesses have been reported, the company said. Customers can return the pouches to local stores for full refund.\n\nThis is the second baby food pouch recall because of potential lead contamination in two months. In March, Target recalled more than 25,000 packages of its store brand Good & Gather Baby Pea, Zucchini, Kale & Thyme Vegetable Puree because of elevated lead levels.",
                "Man I can't wait until we stop testing for this stuff so I don't have to worry anymore",
                "“Publix recalled 4-ounce Greenwise Pear, Kiwi, Spinach & Pea Baby Food pouches sold at more than 1,400 stores.”\n\nSaved you a click.",
                "Not much more of these warnings are going to be coming anymore.  Can’t wait to see the chaos that comes from that. ",
                "You can't expect companies to spend 10 whole dollars to test a batch of baby food for lead. Far more cost effective to put that money toward a lobbyist...",
                "How the fuck is lead introduced into baby food? Are they using lead mixing bowls? Why is lead anywhere near a baby food processing facility? Please explain to me, I don’t understand.",
                "How dare they test for lead in baby food?!? Where is RFK?!?",
                "Fox News is outraged that Publix is preventing future Fox news watchers.",
                "Back in my day we had to eat paint chips to get our lead.",
                "Elevated…? \n\nUp from what…? There is zero “safe level” for lead."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Record number of Americans are seeking residency in UK, according to Home Office",
            "external_url": "https://www.theguardian.com/us-news/2025/may/24/americans-british-citizenship",
            "upvotes": 4844,
            "date": "05/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b5d46f93582dcaa734073c597c92474b53b475fd/0_0_3750_3000/master/3750.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a5ce1eca4fc1f7612f1dc9daf1b3d9cc",
            "top_comments": [
                "I'm genuinely kinda shocked more countries aren't trying to capitalize on America destroying its scientific institutions. It'd be pretty easy right now to poach our best and brightest minds for their gain",
                "RE: the British government “will introduce new, higher language requirements” because “the ability to speak English is integral to everyone’s ability to contribute and integrate”.\n\nThat rules out some of the Redditirs whose postings I have seen.",
                "I found a way over here via enrolling in a masters program. Might not be permanent, but I’m working on rolling it into a grad visa and then maybe stay via a skilled worker visa. Wish there were better options for bailing out of the US. So many people living there hate what is happening and simply don’t have the resources to leave or the agency to change it.",
                "The thought of ditching the US really does seem more and more appealing as things get worse and worse.",
                "We can only hope that they make an attempt to integrate with our culture and learn our language",
                "1,900 people didn’t wait for the next headline. They just applied. That’s the story.",
                "Took almost 200 years but it's time to go home.",
                "If I had the money to leave I’d already be out",
                "Between people leaving, people being deported, tourism down and people who voted against this regime actively trying to boycott supporters of Trump the economy is going to dump big time.  It may not be apparent now but a year from now will look very different from what the Biden presidency accomplished. Shame on our elected congress.",
                "I started applying for teaching jobs in South Korea the day after the election. I have no intention of returning to the states as long as the GOP and tech bros control the government."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Israeli strike kills nine of Gaza doctor's children, hospital says",
            "external_url": "https://www.bbc.com/news/articles/c0eq9lq7xr1o",
            "upvotes": 431,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8869/live/124e1230-3879-11f0-af52-6daeecfc60cc.jpg",
            "top_comments": [
                "I can’t even imagine losing your children like this. Just utter depravity.",
                "They learnt lessons from the Nazis; why bother with concentration camps when you can skip straight to the ethnic cleansing?",
                "“The IDF is finally conducting a campaign against the civilian rule of ⁦‪Hamas‬⁩ and not just focusing on the military infrastructure. We are eliminating ministers, officials, money changers, and elements of the economic and governmental system”\n\nIsraeli defense minister Smotrich a few days ago. Expect more targeted assassinations of healthcare workers and their families.",
                "At this point, there is never going to be accountability, there will never be ramifications of what has been done, there is never turning back to the children who have lost limbs, lives, parents, relatives because they see nothing but revenge. So the cycle will continue, the cause for freedom will continue, in forms of terror, in forms of violence, exactly what those in power need to fuel their desire for power and money to feed their military doctrines.\n\nPeace is only going to be a thought, condemnation will come and go, stern words will be thrown out. But the victim card that Israel holds, unfortunately, over the world is heavy, because 6 million plus lives were lost, and the loss of innocence is being used as a tool to say \"never again\" fueld with violence, and desire to stay in power.\n\nAt the end only innocence will suffer, only innocence will be stolen, only tears that will be cared for, will be the ones who are privileged and not the impoverished. \n\nSadly because rich tears are far more valuable than the poor ones for the world to do something and care.",
                "\"we thought there were more\" - Israel when asked why they killed 9 children ",
                "Evil",
                "Everyone is Hamas, so no genocide. - Israel\n\nBibi belongs in jail!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Record number of Americans are seeking residency in UK, according to Home Office",
            "external_url": "https://www.theguardian.com/us-news/2025/may/24/americans-british-citizenship",
            "upvotes": 4847,
            "date": "05/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b5d46f93582dcaa734073c597c92474b53b475fd/0_0_3750_3000/master/3750.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a5ce1eca4fc1f7612f1dc9daf1b3d9cc",
            "top_comments": [
                "I'm genuinely kinda shocked more countries aren't trying to capitalize on America destroying its scientific institutions. It'd be pretty easy right now to poach our best and brightest minds for their gain",
                "RE: the British government “will introduce new, higher language requirements” because “the ability to speak English is integral to everyone’s ability to contribute and integrate”.\n\nThat rules out some of the Redditirs whose postings I have seen.",
                "I found a way over here via enrolling in a masters program. Might not be permanent, but I’m working on rolling it into a grad visa and then maybe stay via a skilled worker visa. Wish there were better options for bailing out of the US. So many people living there hate what is happening and simply don’t have the resources to leave or the agency to change it.",
                "The thought of ditching the US really does seem more and more appealing as things get worse and worse.",
                "We can only hope that they make an attempt to integrate with our culture and learn our language",
                "1,900 people didn’t wait for the next headline. They just applied. That’s the story.",
                "Took almost 200 years but it's time to go home.",
                "If I had the money to leave I’d already be out",
                "Between people leaving, people being deported, tourism down and people who voted against this regime actively trying to boycott supporters of Trump the economy is going to dump big time.  It may not be apparent now but a year from now will look very different from what the Biden presidency accomplished. Shame on our elected congress.",
                "I started applying for teaching jobs in South Korea the day after the election. I have no intention of returning to the states as long as the GOP and tech bros control the government."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Publix recalls baby food sold in more than 1,400 stores after testing finds elevated lead levels",
            "external_url": "https://www.cbsnews.com/news/publix-baby-food-recall-lead-pouches/",
            "upvotes": 2337,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2021/02/19/e15e76e8-dedc-468c-8dd1-4f70585b9bf9/thumbnail/1200x630/7f10b6a225f9f8fcc7880cfe836c99e1/about-publix-store-front-306x150.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Publix said all the potentially contaminated products have been removed from store shelves. No illnesses have been reported, the company said. Customers can return the pouches to local stores for full refund.\n\nThis is the second baby food pouch recall because of potential lead contamination in two months. In March, Target recalled more than 25,000 packages of its store brand Good & Gather Baby Pea, Zucchini, Kale & Thyme Vegetable Puree because of elevated lead levels.",
                "Man I can't wait until we stop testing for this stuff so I don't have to worry anymore",
                "“Publix recalled 4-ounce Greenwise Pear, Kiwi, Spinach & Pea Baby Food pouches sold at more than 1,400 stores.”\n\nSaved you a click.",
                "Not much more of these warnings are going to be coming anymore.  Can’t wait to see the chaos that comes from that. ",
                "You can't expect companies to spend 10 whole dollars to test a batch of baby food for lead. Far more cost effective to put that money toward a lobbyist...",
                "How the fuck is lead introduced into baby food? Are they using lead mixing bowls? Why is lead anywhere near a baby food processing facility? Please explain to me, I don’t understand.",
                "How dare they test for lead in baby food?!? Where is RFK?!?",
                "Fox News is outraged that Publix is preventing future Fox news watchers.",
                "Back in my day we had to eat paint chips to get our lead.",
                "Elevated…? \n\nUp from what…? There is zero “safe level” for lead."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "ICE Arrests Mississippi Father at His Citizenship Hearing",
            "external_url": "https://www.mississippifreepress.org/ice-arrests-mississippi-father-at-his-citizenship-hearing-threatening-deportation/",
            "upvotes": 268,
            "date": "05/24/2025",
            "thumbnail": "https://www.mississippifreepress.org/wp-content/uploads/2025/05/Kasper-Eriksen-and-family6_courtesy-Savannah-Eriksen.jpg",
            "top_comments": [
                "So many stories like this. We are very quickly becoming unrecognizable to the America that was once great in so many ways. Why would anyone choose to be here now? The land of opportunity no more so long as little caesar and his puppet masters are in power.",
                "The party of law and order really seems to hate law and order. Like, literally trying to subvert the courts and prevent them from doing their job, while people are trying to comply with the law at the courthouse.",
                "He’s also a Trump supporter. So, leopards ate his face.",
                "Guy's a massive trumper. While I oppose his arrest and possible deportation on principle, I don't exactly feel bad for him. This is exactly what he voted for. He just didn't think it would happen to him \\[because he's white\\].",
                "lol they camping citizenship offices and ceremonies and grab them before the paperwork finishes? that’s messed up",
                "Do you have to be present at at these hearings or can a lawyer represent you?",
                "It looks like ICE is pretty unbiased as to who it goes after.",
                "\"Why aren't people immigrating here from great countries like Norway?\"\n\n  \nWell...ok.",
                "\"fear to be deported from Mississippi to Denmark\" 😂😂😂",
                "This is how you know it’s not about doing things the right way as MAGAs love to claim"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Tree-sitter enters third week in WA's Olympic Foothills to halt logging",
            "external_url": "https://www.fox13seattle.com/news/tree-sitter-enters-third-week",
            "upvotes": 1462,
            "date": "05/24/2025",
            "thumbnail": "https://images.foxtv.com/static.q13fox.com/www.q13fox.com/content/uploads/2025/05/1280/720/vlcsnap-2025-05-23-19h10m42s347.jpg?ve=1&tl=1",
            "top_comments": [
                "Here’s one for the guy who replied that the states would manage their forests just fine and keep them safe, when I posted worrying about this administration opening 59% of our national forests for logging.\n\nThanks so much, Washington, for continuing to demonstrate that money into the right pockets trumps everything else.",
                "save the trees! especially the old growth forests.",
                "read the article, this guy is fucking hardcore.  he has a trap set that will straight up kill him if anything in his camp is tampered with.  if you try and force him down *you will kill him*",
                "It’s early, I had to read that title twice to realize tree sitting is not an Olympic event.",
                "Not all heroes wear capes. Some wear rope harnesses and fight for forests the quiet way",
                "Honestly, we(those of us with jobs and life obligations we can’t abandon to live in a tree) should start a fund to pay people a modest wage to stage protests like these. I can’t stand the sight of our natural world being pillaged, but I can’t just abandon my life to do stuff like this, as much as I would like to. Does that make me a bad person? A hypocrite? Sometimes I just don’t know anymore.",
                "This is what a real hero looks like. Fuck Trump and all his fascist ilk.",
                " 3 weeks? They’re a tree shitter too by now",
                "Is this some sort of advertisement for that weird Broadway musical where Idena dances around a tree for two hours"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "\"Rust\" armorer Hannah Gutierrez-Reed released from prison 13 months after involuntary manslaughter conviction",
            "external_url": "https://www.cbsnews.com/news/rust-armorer-hannah-gutierrez-reed-released-from-prison/",
            "upvotes": 3007,
            "date": "05/24/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/04/15/d6c32a4a-9cb3-4ece-9337-132cf480eee8/thumbnail/1200x630/22c3e22acdbfedbb2ab58487d54b3b7b/ap24103814537427.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Just in time for the premiere!",
                "Serious questions: How did the live ammo even made it into the vicinity of the set? Would there be a valid reason to have live ammo with actors around?",
                "She did more time than anyone at Beoing, who was initially prosecuted for negligence for those two major plane crashes, but the Trump administration had a change of *heart*.",
                "I guess the question comes down to how long we want to put people into jail for accidents -even when they are caused by irresponsibility.  Distracted driving, failing to inspect construction equipment, not stopping some unsafe condition on a work site.  It's all basically the same so far as I see it.  Yeah, there are some situations where we know there will never be a repeat (she'll never get a job doing this again).  \n\n\nI feel like 13 months is probably about right for something like this where there isn't a guilty mind involved.",
                "The UPM who replaced the one who quit with her never was punished or convicted of any wrong doing even though he knew she wasn’t qualify",
                "Prison time was far shorter than all the time spent on legal wrangling and the trials.",
                "Did her defense team ever bother appealing based on the Brady violation that came to light during Baldwin's trial?",
                "I'm fine with her getting out.  I am pissed that the production team that hired her is getting off without any punishment.",
                "Such a tragedy all around…I feel bad for Baldwin as he shot a close friend by accident and he was given the prop with no way of knowing…I mean he’s shot a lot off movie guns",
                "This woman definitely fucked up, but let’s be real. This accident was mainly the fault of production and the AD who threw her completely under the bus. She deserved time, but others on this set deserved more."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Russia launches major aerial attack on Ukraine capital",
            "external_url": "https://www.bbc.com/news/articles/cy908n4vr0jo",
            "upvotes": 3167,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/a586/live/a0bdf040-38af-11f0-8519-3b5a01ebe413.jpg",
            "top_comments": [
                "Russia launched 250 drones and 14 ballistic missiles against Kyiv, Ukraine's air force said, causing fires in residential buildings. It was one of the biggest combined aerial assaults on the city since the war began. The air force said it had downed six missiles and 245 drones.",
                "Fuck Russia. Fuck Trump and his cronies in washington taking care of a genocidal, geriatric, pilled-up grandpa.",
                "Don't forget people, it's important for the peace efforts to let them enough time to prepare a memorandum and then a ceasefire, all they need is time to be sure of how to prepare peace.\n\n\nAlso, it's Biden's war, not mine, if I was president by the time, this war would never have begun. And you know, my doctor, he saw my results in the IQ test, beautiful results, beautiful, he never saw such results, he told me they were beautiful, he never saw such results like these, he said you're in the genius category, and Putin is a good guy I think, he 'ever wanted this war, it was all Biden's war, nice guy that putin, very clever, very smart, and yes, these IQ results, I wish you could see them, so beautiful.",
                "[removed]",
                "I thought Trump was going to end this with one call months ago.  Did he lose the phone number?",
                "Fuck Russia and fuck their puppet president.",
                "I thought Trump brokered a truce 🤨",
                "At this point, just bomb the Kremlin and then accuse Russia of escalation 🤦🏼 uno reverse card",
                "[removed]",
                "My wife decided to visit her mom in Kyiv this week. Great timing. :/"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "New COVID variant NB.1.8.1 behind surge in China, now detected in U.S.",
            "external_url": "https://www.cbsnews.com/news/us-reports-cases-new-covid-variant-nb-1-8-1-behind-surge-china/",
            "upvotes": 28537,
            "date": "05/24/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2022/07/02/f51bdaca-e805-497f-ac63-87512d4f26e8/thumbnail/1200x630g8/61033adab0efca6ba877823db762172b/GettyImages-457163942.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Covid starting to look like patch notes",
                "If Nintendo reveals AC for the Switch 2, then it's time to panic.",
                "I'm starting to get sick of reality's recycled plot devices.",
                "[https://cdn.who.int/media/docs/default-source/documents/epp/tracking-sars-cov-2/23052025\\_nb.1.8.1\\_ire.pdf?sfvrsn=7b14df58\\_4](https://cdn.who.int/media/docs/default-source/documents/epp/tracking-sars-cov-2/23052025_nb.1.8.1_ire.pdf?sfvrsn=7b14df58_4)\n\nWHO TAG-VE Risk Evaluation for SARS-CoV-2 Variant Under Monitoring: NB.1.8.1\n\nExecutive Summary\n\nNB.1.8.1 has been designated a SARS-CoV-2 variant under monitoring (VUM) with increasing proportions\n\nglobally, while LP.8.1 is starting to decline. Considering the available evidence, the additional public health risk\n\nposed by NB.1.8.1 is evaluated as low at the global level. Currently approved COVID-19 vaccines are expected\n\nto remain effective to this variant against symptomatic and severe disease. Despite a concurrent increase in\n\ncases and hospitalizations in some countries where NB.1.8.1 is widespread, current data do not indicate that\n\nthis variant leads to more severe illness than other variants in circulation.",
                "Take a look at [Covid.gov](https://www.whitehouse.gov/lab-leak-true-origins-of-covid-19/). They turned that site into a joke.",
                "I will laugh so hard if that meme VIP dinner last night turns into a super spreader event.",
                "Oh good, just in time for it to be against the law for most of us to get vaccinated against it.",
                "Covid dlc before gta6",
                "We had first COVID, yes, but what about second COVID?",
                "What a great time to make covid vaccines harder to get /s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Killer whales left trapped in abandoned French marine park four months after closure.",
            "external_url": "https://www.standard.co.uk/news/world/orcas-trapped-french-marine-park-four-months-after-closure-b1227904.html",
            "upvotes": 27447,
            "date": "05/23/2025",
            "thumbnail": "https://static.standard.co.uk/2025/05/15/9/55/GettyImages-2191585917.jpg?width=1200&auto=webp&quality=75",
            "top_comments": [
                "Several sanctuaries have petitioned France to rescue the orcas. So far two, one in Japan and one in Canada, have been rejected for being too far to transport. There are also dolphins in another enclosure that need help too. They can not be released due to being bred in captivity.\n\n**Edit:** Courtesy of /u/MtnMoonMama here is a link to write President Macron about the situation if you feel so inclined. https://www.elysee.fr/en/contact/",
                "So they’re feeding them but can’t seem to find the resources to clean the enclosures? Sounds like rubbish excuses from those responsible. ",
                "Fucking Christ, that drone shot of them being in separate pools, is just fucking heart breaking. They've been like that for MONTHS! Fucking hell. The previous owners of that abandoned park need to be in jail for decades.",
                "This an intelligent animal that is huge and made for a life in the open ocean.\n\nIt must drive them absolutely fucking insane being confined to a limited space",
                "You can send Emmanuel Macron a direct message here\n\n\nhttps://www.elysee.fr/en/contact/\n\n\nEdit: fill out the form. Send it. They send you an email with a link you must click. Click the link to send. ",
                "Need to find a maladjusted orphan boy with a soft heart to solve this one. ",
                "Keeping these animals who travel thousands of miles in the wild in little kiddie pools is straight up torture. Idk why we still allow this",
                "is it the price of long distance travel that is the problem? i can't imagine the stress of that trip would be more than what they are going through now",
                "Man, where's the Mexican space program when you need it.",
                "Humans are fucking garbage"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Belgium’s future queen caught up in Harvard foreign student ban",
            "external_url": "https://www.theguardian.com/world/2025/may/23/belgium-future-queen-caught-up-harvard-foreign-student-ban",
            "upvotes": 20517,
            "date": "05/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d0fad91d174129333633af0dd7dae3047248878b/2016_115_1435_1148/master/1435.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5be6fbb9164c1aab0e2f3c34b6c77a0e",
            "top_comments": [
                "There will be lots of sons and daughters of prominent politicians and rich internationals impacted by this.  I bet there will be lots of exceptions made.",
                "Go read the DHS rational for this decision it’s insanity. They accuse Harvard of basically working with the CCP to undermine American interests",
                "I remember in his first term, POTUS wondered out loud about why people from “white” European counties aren’t immigrating to the US instead of from those “sh*thole” countries. He’s his own worst enemy in terms of promotion, self or otherwise.",
                "With her stature as future Queen, the Yales and Stanfords will be eager to offer her a spot. I have more sympathy for the normal people who got in purely on merit — they're the ones truly screwed.",
                "Yep she is a radical and a terrorist suspect.   Needs to have Trumps ICE treatment ….  No questions asked no due process like the rest of them … let’s see how he sugar coats this one.  Insane !",
                "Not calling her crown princess is weird.",
                "Ha! This is so funny given how enamored Trump is with royals!",
                "Harvard sues and judge has blocked Trump’s ban.\n\nhttps://www.nytimes.com/2025/05/23/us/harvard-sues-trump-international-students-garber.html",
                "They forgot to exempt white girls",
                "im sorry, but what about university autonomy? how the fuck is this happening? what the fuck is wrong with the usa? baffling. absolutely baffling"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/24/2025 20:09:11 UTC"
}