{
    "posts": [
        {
            "category": "HOT",
            "title": "Japan court orders controversial ‘Moonies’ church to disband",
            "external_url": "https://www.bbc.com/news/articles/cge1lr7225yo.amp",
            "upvotes": 5080,
            "date": "03/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/6c21/live/093e3620-0949-11f0-bdd3-f7314caa23ee.jpg",
            "top_comments": [
                "That assassin flat out achieved his objectives. Crazy.",
                "Americans might not be aware, but the Unification Church has leveraged its Japanese influence to control something like 80% of the sushi market in the US via a company called True World Foods.",
                "God, I haven't heard about  the moonies for decades.\n\nI thought they already disbanded.",
                "The order handed down by a Tokyo district court will strip the church of its tax-exempt status and require it to liquidate its assets, but it will still be allowed to operate in Japan.\n\nSo it's not really disbanded.",
                "fucking do it. tired of these ponzi schemes disguised as churches skirting the law because \"we don't want to be religiously intolerant\"",
                "Not so fun fact: The majority of the Unification Church's global revenue came from Japan and they diverted lots of funds to North Korea, which may or may not have went to North Korea's nuclear development and development of intercontinental ballistic missiles.",
                "A friend grew up in that cult.  The stories are fucking made of nightmares.",
                "This year is also the 30th anniversary of Omu Shinrikyo’s Sarin gas attack .",
                "Do Happy University and Soka Gakkai next.\n\nMaybe even Nippon Kaigi.",
                "No more Shooreh Pippi…"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "After living in the US for 35 years and raising 3 citizens, these parents got deported to Colombia. Their kids want them back",
            "external_url": "https://www.cnn.com/2025/03/24/us/colombia-immigrants-deported/index.html",
            "upvotes": 1964,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/88879383-1740868315540319-r.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "From the article: \n\n“Gladys and Nelson came to the United States without authorization in 1989, according to an Immigration and Customs Enforcement statement dated March 14. They had no visas when they arrived, Crooms said, but were granted permission to apply for asylum. The couple was fleeing crime in their native Colombia, according to Crooms and their daughter Stephanie.\n\nIn 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE.“\n\nThey applied for asylum, denied and ordered to come back to Columbia. \n\nWhen people applied for asylum they issued temporary SS number and work permit. \nHow did they legally worked in US for 30 years without valid SS number?",
                "Damn, I would be devastated if something like that happens to my parents. I hope the best for them.",
                "As shitty as it is, this isn’t a current administration caused problem. They were told 25 years ago they had to leave.",
                "*\"In 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE*\n\n*...*\n\n*The Gonzalezes did not plan to leave the United States after the order was issued, according to Crooms, who said the couple’s attorney at the time misled them that the order could be appealed and possibly lead to eventual legalization.*\n\n*...*\n\n*The couple’s deportation officer “had not pushed for them to depart until 2018,” leveling with them that it was time to leave the country if their status couldn’t be legalized, Crooms said.\"*\n\nSeems pretty reasonable to me they needed to be deported, they've been told so since 2000, and again in 2018. Just not in handcuffs.",
                "They lost their hearings and were ordered to leave and failed to do so…this one isn’t the hill to die on",
                "\n\n“Gladys and Nelson came to the United States without authorization in 1989\n\nIn 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order.”\n\nSo they entered illegally 36 years ago. Where ordered to leave 25 years ago and chose not to. I would say the US government was more then fair and consideret before deportation. They thought they were above the law. Their children can blame them not the US government.",
                "The headline implies that their parents were suddenly, unexpectedly deported.  \nBut in reality\n\n>In 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE.\n\n  \nSo they've been on notice for over TWENTY years.   \nDon't cry for me, Argentina. I mean, Columbia.",
                "The news would be that the government allowed them to be illegal 35 years. Not that they were finally deported.",
                "So, they overstayed by 25 years?\n\n>**In 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order**, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE.",
                "Entered illegally, informed to leave, didn't do it.\n\nWhat should happen?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "United Airlines flight to China diverted to San Francisco after pilot forgets passport",
            "external_url": "https://www.nbcnews.com/news/us-news/united-airlines-flight-china-diverted-san-francisco-pilot-forgets-pass-rcna197942",
            "upvotes": 2301,
            "date": "03/25/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250325-united-plane-mb-1302-69636d.jpg",
            "top_comments": [
                "Imagine the pilot saying 'We'll be turning back… my bad, y'all.'",
                "How was he even allowed to board in the first place? Don’t they check passport at departure?\n\nI know there are crew lanes; I meant don’t they check at crew lanes?",
                "I have (sad and hilarious) nightmares about doing this.",
                "If the pilot just stayed on the plane when they landed, would it even matter? I suppose it's probably pretty unlikely that the pilot would be taking the same plane back, but in the event that they were, would they HAVE to even get off the plane once it landed and go through customs? ",
                "~~If the destination were in EU, that's 600 euros per ticket.~~\n\nEDIT: United is not an EU registered airline so you are fucked either way. Sorry for the misinformation.",
                "Article does NOT mention whether the pilot or airline were immediately transparent with their 100-300 customers who were just massively inconvenienced. \n\n\nHumans make human errors. Fine. I'm a lot more forgiving if they own up to them and apologize up front. ",
                "Would've been funny if they'd just had the pilot not deboard in China, and come back with nobody the wiser. I'm sure that would've required a new flight crew for the be trip, but it still would've been sneaky.",
                "In usual cases, one's wife may kill you. In this case, every passenger, the crew, and corporate will want to kill you. Either way, just crash in front of the customs desk at the Chinese airport, and enjoy your new legendary status in United Lore. \n\nI hope the chucklefuck brought his other IDs to allow himself back into the US. And I hope he meets customs racial standards to boot.",
                "So how long were those people on the last plane",
                "Do passengers get their money back as well as compensation for their lost time/trip?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "US Postal Service chief DeJoy steps down",
            "external_url": "https://www.reuters.com/world/us/us-postal-chief-dejoy-stepping-down-immediately-2025-03-24/",
            "upvotes": 17866,
            "date": "03/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Next week it'll probably be announced he's won a contract to operate most USPS services at a premium markup.",
                "May he live out the rest of his days in utter disgrace. What a legacy of malice and public disservice he leaves. ",
                "Woulda been good news 4 years ago",
                "The perception that the Post Office loses money versus say *costs* money, is really annoying. Does the military cost or lose money? Does infrastructure cost or lose money? It's a service we need and it comes at a price and it's worth it.",
                "the absolute right-wing, corporate, capitalist fetishization implicit in this article's framing of the story is so frustrating. it's journalistic malpractice.\n   \n> the money-losing U.S. Postal Service\n   \n> the agency that has lost more than $100 billion since 2007\n   \n> cutting forecast cumulative losses over a decade to $80 billion from $160 billion\n    \n> USPS, an agency with 635,000 employees that lost $9.5 billion last year\n    \n**IT'S NOT A FUCKING BUSINESS.** It's a public fucking service! It **costs** money, it does not **lose** money. \n    \nDoes Reuters list 4 times per article about the US military about how much money it \"loses?\" About how much money the Department of Homeland Security \"loses\" every year? What about how much oil and gas subsidies \"lose\" the US? Or how much corporate tax write offs \"lose\" the American people? Medicare? Fire departments? Public utilities? Federal highways? ICE?\n   \nOf course they fucking don't - because that wouldn't be right-wing propaganda. It's not just about the facts, it's about the framing and how those facts are told.\n   \nJesus Christ.",
                "Someone worse incoming? Or is his leadership no longer needed?",
                "making way for next commissioner, Kyle Rittenhouse",
                "Republicans are locking in all future elections by eliminating the reliability of mail-in-voting.  \n\nWill you vote by mail in the next election, knowing that your vote will now be handled by a privatized mail company owned by a Republican billionaire?",
                "Reuters is usually better than this. No mention of the fact that the only reason the post office loses money is because Congress made it so it must fund retirement for workers so far into the future that it covers workers not even born yet. It didn’t need DeJoy’s restructuring- it needed to be let off the hook.",
                "This can only mean someone even worse than DeJoy is going to take over and/or completely dismantle it."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Samsung CEO Han Jong-Hee dies at 63",
            "external_url": "https://www.cnn.com/2025/03/24/tech/samsung-co-ceo-han-jong-hee-death-intl-hnk/index.html",
            "upvotes": 10448,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2192184336.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Another article gives slightly more information on cause. \n\n>  South Korean tech giant Samsung Electronics said on Tuesday that its co-chief executive officer Han Jong-hee has died from cardiac arrest. Han was 63.",
                "My brother works at Samsung Electronics in Korea and posted this morning on our family group chat. He said the guy apparently collapsed at his daughter's wedding after drinking heavily. He was a known heavy drinker within the Samsung circle. He would mix beer with hard liquor and one-shot those despite health concerns.",
                "This is samsung electronics, a subsidiary. The wider group is controlled by Lee Jae-Yong (the family)",
                "To quote Pusha T “ask Steve Jobs, wealth don’t buy health.”",
                "He collapsed during his daughter's wedding reception. I just watched an ER show and the cardiologist said people get confused about the difference between a heart attack and cardiac arrest. A heart attack people are not completely unconscious and they have pain in their chest or arm. A cardiac arrest is when you collapse because your heart has stopped and is likely just quivering. Most people survive a heart attack unless they go into cardiac arrest. In cardiac arrest less than 10% of people survive even with intensive treatment.",
                "Absolutely no information in the article except that he died - interesting\n\n63 is young…was he sick?",
                "Yep, this is the drop dead zone for men. ",
                "[deleted]",
                "Huh, didn't even know he was sick.",
                "Samsung rotates their CEOs every couple of years. They'll just move on"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Consumer confidence plummets to lowest level since January 2021",
            "external_url": "https://www.cnn.com/2025/03/25/economy/us-consumer-confidence-march-recession/index.html",
            "upvotes": 665,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2199175993-20250325122218314.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Since our president is actively sabotaging our economy, it's no wonder consumer confidence is tanking.",
                "I’ve cut back my spending since my grocery bill is so high. I’m nervous about how all of these government layoffs and cancelled contracts will affect the economy.",
                "Maybe that's cause idiots are in charge. But I dunno just spitballin'.",
                "Finally, America is great again. 🦅🇺🇸",
                "Consumer confidence plummets to lowest level since last time Trump was in office.",
                "We are so great, you guys.",
                "I'm still confused as fuck why my fellow countrymen voted for this, but congratulations on getting what you wanted.",
                "*If* I buy anything beyond what I need to literally survive, so just \"for fun,\" it's going to be at a thrift store or an antique store. Not at a big-box or at the online behemoth store whose CEO actively supports this administration.\n\nI've completely cut out frivolous shopping of any kind and totally changed my financial habits since January 20th. I also cancelled all streaming services. I'm fucking done supporting rampant capitalism, and I feel just great about it. I'm enjoying the things I already have.",
                "Well, yeah. Inflation was already bad enough before all this mess. Now tariffs AND countless people suddenly losing their jobs? What is there possibly to be confident about as a consumer?",
                "Picking up right where he left off."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Oscar-winning Palestinian director attacked by Israeli settlers and arrested",
            "external_url": "https://www.theguardian.com/world/2025/mar/24/oscar-winning-palestinian-director-attacked-by-israeli-settlers-and-arrested",
            "upvotes": 17361,
            "date": "03/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1c062253020fbc7665681aec4d4423d7d450f595/0_247_1365_819/master/1365.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=94da34fd8ec7e1b54b4756a49420ead3",
            "top_comments": [
                "To clarify, he was apparently attacked by Israeli settlers at his home and was subsequently detained and disappeared by the Israeli military. \n\nHis Israeli co-director stated that the attack by the settlers left Ballal bleeding from the head. When an ambulance arrived for him, Israeli soldiers prevented medics from treating him, pulled him out of the ambulance, blindfolded him, forced him and another attack victim into a car, and drove away.\n\n[The Associated Press](https://apnews.com/article/no-other-land-oscar-israel-palestinians-084c63f33e748a3279646759e9b705c2) is reporting that they have received verified video showing part of the attack, which targeted both Jewish Israeli and Palestinian peace activists alike:\n\n> Video provided by the Center for Jewish Nonviolence showed a masked settler shoving and swinging his fists at two activists from the group in a dusty field at night. The activists rush back to their car. “Get in, get in!” one shouts, and they duck inside as the thuds of rocks being thrown can be heard. “Car window was broken,” the driver says as they drive off.\n\nThe Israeli military has refused to comment or provide any information about Ballal’s whereabouts.\n\nEdit: [This](https://www.reddit.com/r/Fauxmoi/s/mBJ3EfPMEc) is purportedly video of the attack from the peace activists’ perspective.",
                "Talk about quite literally hammering home the point of the movie.",
                "Arrested? It’s a fucking kidnapping",
                "Can we stop calling them settlers? They’re invaders.",
                "This is one of the biggest Hollywood stories in the century.",
                "This is HORRIFYING and needs to be on the front page of every news source. Not that everything up til this point hasn’t been horrifying— but the Hollywood element here means this story has the potential to really stick. Please comment and share and talk about this.",
                "“Arrested” reports are saying he was taken from an ambulance and lynched..",
                "How are we not sanctioning these scumbags? This is insane.",
                "I hate when people call them just “settlers”. \n\nThey’re terrorists. They have been purposely terrorizing people and stealing land for decades, thus they are settler terrorists. There is no other way to describe these people.",
                "Lynched and kidnapped is a lil more accurate. Call it what it is."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Allentown City Hall employee charged with planting noose at own desk",
            "external_url": "https://www.cbsnews.com/philadelphia/news/latarsha-brown-allentown-noose-charges/",
            "upvotes": 654,
            "date": "03/25/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/24/bcd710ed-e9b1-4caf-bf81-09dd2d4d8d71/thumbnail/1200x630/912073554a5f85faa4ed7c48ab0825e0/allentown-city-hall.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "Sometimes the demand for hate crimes outweighs the supply",
                "They should be fired for this stunt.",
                "Ah the ole \"Justice for Jussie\" attention play. Haven't seen that tactic in years",
                "Planted by LaTarsha \"Jussie\" Brown",
                "God that letter by a community organizer defending her is atrocious, such grifters",
                "If this was a game of 'Who’s the Worst Person in the Office?' this guy just won by a landslide",
                "I bet if stunts like this got upgraded to felony charges it would stop real quick",
                "They probably fantasize about racial holy wars in their spare time.",
                "Man what is in the water in Pennsylvania? You guys used to be cool.",
                "Lmao OP is in here with like 5 different accounts. \n\nMust be a wet dream for him, waiting years for something like this."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Top US officials appeared to message a journalist Houthi strike plans",
            "external_url": "https://www.bbc.com/news/articles/cy4v3ndg28jo",
            "upvotes": 35456,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/bb93/live/2e633df0-0968-11f0-88b7-5556e7b55c5e.jpg",
            "top_comments": [
                "[removed]",
                "Not appeared, they DID message a journalist by mistake on their group text chain discussing war plans.",
                "\"Any unauthorized release of classified information is a violation of the law and will be treated as such.\"\n\n-Tulsi Gabbard 3/14/25\n\nFor those keeping track that is the day before these events took place and she's on the group chat on question.",
                ">Jeffrey Goldberg, editor-in-chief of The Atlantic, [reported](https://www.theatlantic.com/politics/archive/2025/03/trump-administration-accidentally-texted-me-its-war-plans/682151) on Monday that he was added to a Signal message group which included accounts labelled as White House National Security Adviser Michael Waltz and Vice-President JD Vance.\n\nWhy are updates on military operations being communicated over Signal rather than secure DoD communications?\n\nEdit:  \nAnyone who remotely (and rightfully) criticized Hillary Clinton for using her own Email server should be furious about this news story.",
                "The headline really downplays the absolute fuckery of what happened here. \n\n1) Cabinet level, real-time military operational planning was being done on a commercial messaging platform instead of a secure government IS. \n\n2) They fucking didn't notice a private citizen was sitting in the group chat. \n\n\nThis is an absolutely catastrophic failure of information and operational security that puts previous scandals (Hillary emails, even Trump documents) to shame. This is unauthorized disclosure of the most sensitive government information imaginable. All of these people should be fired if not criminally charged.",
                "From the story in the Atlantic:\n\n>Brian Hughes, the spokesman for the National Security Council, responded two hours later, confirming the veracity of the Signal group. “This appears to be an authentic message chain, and we are reviewing how an inadvertent number was added to the chain,” Hughes wrote. “The thread is a demonstration of the deep and thoughtful policy coordination between senior officials.”\n\nThese assholes were using goddamned emojis.",
                "Jesus fucking Christ. The ineptitude is rampant",
                "Thank you, Trump voters, for enabling these many opportunities to see that your people are as embarrassing behind closed doors as they are publicly. \n\n\nIt's going to take decades to recover from just the past 2 months.  Pretty much an entire term to go.",
                "Old whiskey finger hegseth at it again. To be fair, when you’re that drunk, names just blur together in your phone. ",
                "Wow. I’m stunned that the president of the US, Elon Musk wasn’t added to this amateur hour group chat too. \n\nHe’s probably insulted. "
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "USDA halts delivery of 600,000 pounds of food to Michigan food bank",
            "external_url": "https://www.mlive.com/news/grand-rapids/2025/03/usda-halts-delivery-of-600000-pounds-of-food-to-michigan-food-bank.html?utm_campaign=muskegonchronicle_sf&utm_medium=social&utm_source=facebook",
            "upvotes": 311,
            "date": "03/25/2025",
            "thumbnail": "https://www.mlive.com/resizer/v2/KKKPQW4SY5BGVBJBJ7Z6BZIOO4.jpg?auth=4d01c8b21857dafa22f838c2933218e2bffca6aad56dd67a2e43f48dfcf85f49&width=1280&quality=90",
            "top_comments": [
                "The wilful cruelty of the Trump regime astonishes me. Here in the U.K. we have had right wing governments but this is new territory. Also our worst Trump like Prime Minister only lasted 49 days before being ousted. Mind you she cost us our economy and she killed the queen so there is that.",
                "Can somebody explain to me the idea behind this?  Are they trying to disband food banks?  Is it that they want absolutely zero government aid to the general population because of anti-government ideology?  I don't understand their thinking.",
                "Keeping poor people alive that don’t contribute to society is wasteful spending /s",
                "Ah yes, the old \"fuck you citizens\"",
                "Just for fun. Cruelty to poor people is the point. Especially if they are perceived to be minorities.",
                "After all this there's going to be billions in bailouts paid to farmers affected by these decisions. They're going to end up paying to let the food rot. ",
                "Very Christian of them.",
                "News says have empathy for poor Elon not the actual poor ",
                "They are ballsy to think people with absolutely nothing to lose are not a threat.",
                "Even the Roman emperors knew that you had to give people bread & circuses. Does Trump think starving people will just roll over and die? Because boy is he going to be surprised."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "US consumer confidence tumbles for the 4th straight month as future expectations hit a 12-year low",
            "external_url": "https://apnews.com/article/consumer-confidence-economy-inflation-bd6ece8784efff205e2ab922bcb86958",
            "upvotes": 47,
            "date": "03/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Tariff don't need more time to prove they are not working",
                "This is the Trump effect just not the one he wants you to think about.",
                "Incompetence leads to no confidence.",
                "I've stopped buying anything non-essential because I have no idea how much this shit is gonna cost 6 months from now.",
                "Looks like people are budgeting feelings now too."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "USDA halts delivery of 600,000 pounds of food to Michigan food bank",
            "external_url": "https://www.mlive.com/news/grand-rapids/2025/03/usda-halts-delivery-of-600000-pounds-of-food-to-michigan-food-bank.html?utm_campaign=muskegonchronicle_sf&utm_medium=social&utm_source=facebook",
            "upvotes": 308,
            "date": "03/25/2025",
            "thumbnail": "https://www.mlive.com/resizer/v2/KKKPQW4SY5BGVBJBJ7Z6BZIOO4.jpg?auth=4d01c8b21857dafa22f838c2933218e2bffca6aad56dd67a2e43f48dfcf85f49&width=1280&quality=90",
            "top_comments": [
                "The wilful cruelty of the Trump regime astonishes me. Here in the U.K. we have had right wing governments but this is new territory. Also our worst Trump like Prime Minister only lasted 49 days before being ousted. Mind you she cost us our economy and she killed the queen so there is that.",
                "Can somebody explain to me the idea behind this?  Are they trying to disband food banks?  Is it that they want absolutely zero government aid to the general population because of anti-government ideology?  I don't understand their thinking.",
                "Keeping poor people alive that don’t contribute to society is wasteful spending /s",
                "Ah yes, the old \"fuck you citizens\"",
                "Just for fun. Cruelty to poor people is the point. Especially if they are perceived to be minorities.",
                "After all this there's going to be billions in bailouts paid to farmers affected by these decisions. They're going to end up paying to let the food rot. ",
                "Very Christian of them.",
                "News says have empathy for poor Elon not the actual poor ",
                "They are ballsy to think people with absolutely nothing to lose are not a threat.",
                "Even the Roman emperors knew that you had to give people bread & circuses. Does Trump think starving people will just roll over and die? Because boy is he going to be surprised."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "After living in the US for 35 years and raising 3 citizens, these parents got deported to Colombia. Their kids want them back",
            "external_url": "https://www.cnn.com/2025/03/24/us/colombia-immigrants-deported/index.html",
            "upvotes": 1962,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/88879383-1740868315540319-r.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "From the article: \n\n“Gladys and Nelson came to the United States without authorization in 1989, according to an Immigration and Customs Enforcement statement dated March 14. They had no visas when they arrived, Crooms said, but were granted permission to apply for asylum. The couple was fleeing crime in their native Colombia, according to Crooms and their daughter Stephanie.\n\nIn 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE.“\n\nThey applied for asylum, denied and ordered to come back to Columbia. \n\nWhen people applied for asylum they issued temporary SS number and work permit. \nHow did they legally worked in US for 30 years without valid SS number?",
                "Damn, I would be devastated if something like that happens to my parents. I hope the best for them.",
                "As shitty as it is, this isn’t a current administration caused problem. They were told 25 years ago they had to leave.",
                "*\"In 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE*\n\n*...*\n\n*The Gonzalezes did not plan to leave the United States after the order was issued, according to Crooms, who said the couple’s attorney at the time misled them that the order could be appealed and possibly lead to eventual legalization.*\n\n*...*\n\n*The couple’s deportation officer “had not pushed for them to depart until 2018,” leveling with them that it was time to leave the country if their status couldn’t be legalized, Crooms said.\"*\n\nSeems pretty reasonable to me they needed to be deported, they've been told so since 2000, and again in 2018. Just not in handcuffs.",
                "They lost their hearings and were ordered to leave and failed to do so…this one isn’t the hill to die on",
                "\n\n“Gladys and Nelson came to the United States without authorization in 1989\n\nIn 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order.”\n\nSo they entered illegally 36 years ago. Where ordered to leave 25 years ago and chose not to. I would say the US government was more then fair and consideret before deportation. They thought they were above the law. Their children can blame them not the US government.",
                "The headline implies that their parents were suddenly, unexpectedly deported.  \nBut in reality\n\n>In 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE.\n\n  \nSo they've been on notice for over TWENTY years.   \nDon't cry for me, Argentina. I mean, Columbia.",
                "The news would be that the government allowed them to be illegal 35 years. Not that they were finally deported.",
                "So, they overstayed by 25 years?\n\n>**In 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order**, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE.",
                "Entered illegally, informed to leave, didn't do it.\n\nWhat should happen?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Consumer confidence plummets to lowest level since January 2021",
            "external_url": "https://www.cnn.com/2025/03/25/economy/us-consumer-confidence-march-recession/index.html",
            "upvotes": 664,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2199175993-20250325122218314.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Since our president is actively sabotaging our economy, it's no wonder consumer confidence is tanking.",
                "I’ve cut back my spending since my grocery bill is so high. I’m nervous about how all of these government layoffs and cancelled contracts will affect the economy.",
                "Maybe that's cause idiots are in charge. But I dunno just spitballin'.",
                "Finally, America is great again. 🦅🇺🇸",
                "Consumer confidence plummets to lowest level since last time Trump was in office.",
                "We are so great, you guys.",
                "I'm still confused as fuck why my fellow countrymen voted for this, but congratulations on getting what you wanted.",
                "*If* I buy anything beyond what I need to literally survive, so just \"for fun,\" it's going to be at a thrift store or an antique store. Not at a big-box or at the online behemoth store whose CEO actively supports this administration.\n\nI've completely cut out frivolous shopping of any kind and totally changed my financial habits since January 20th. I also cancelled all streaming services. I'm fucking done supporting rampant capitalism, and I feel just great about it. I'm enjoying the things I already have.",
                "Well, yeah. Inflation was already bad enough before all this mess. Now tariffs AND countless people suddenly losing their jobs? What is there possibly to be confident about as a consumer?",
                "Picking up right where he left off."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "United Airlines flight to China diverted to San Francisco after pilot forgets passport",
            "external_url": "https://www.nbcnews.com/news/us-news/united-airlines-flight-china-diverted-san-francisco-pilot-forgets-pass-rcna197942",
            "upvotes": 2302,
            "date": "03/25/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250325-united-plane-mb-1302-69636d.jpg",
            "top_comments": [
                "Imagine the pilot saying 'We'll be turning back… my bad, y'all.'",
                "How was he even allowed to board in the first place? Don’t they check passport at departure?\n\nI know there are crew lanes; I meant don’t they check at crew lanes?",
                "I have (sad and hilarious) nightmares about doing this.",
                "If the pilot just stayed on the plane when they landed, would it even matter? I suppose it's probably pretty unlikely that the pilot would be taking the same plane back, but in the event that they were, would they HAVE to even get off the plane once it landed and go through customs? ",
                "~~If the destination were in EU, that's 600 euros per ticket.~~\n\nEDIT: United is not an EU registered airline so you are fucked either way. Sorry for the misinformation.",
                "Article does NOT mention whether the pilot or airline were immediately transparent with their 100-300 customers who were just massively inconvenienced. \n\n\nHumans make human errors. Fine. I'm a lot more forgiving if they own up to them and apologize up front. ",
                "Would've been funny if they'd just had the pilot not deboard in China, and come back with nobody the wiser. I'm sure that would've required a new flight crew for the be trip, but it still would've been sneaky.",
                "In usual cases, one's wife may kill you. In this case, every passenger, the crew, and corporate will want to kill you. Either way, just crash in front of the customs desk at the Chinese airport, and enjoy your new legendary status in United Lore. \n\nI hope the chucklefuck brought his other IDs to allow himself back into the US. And I hope he meets customs racial standards to boot.",
                "So how long were those people on the last plane",
                "Do passengers get their money back as well as compensation for their lost time/trip?"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Allentown City Hall employee charged with planting noose at own desk",
            "external_url": "https://www.cbsnews.com/philadelphia/news/latarsha-brown-allentown-noose-charges/",
            "upvotes": 656,
            "date": "03/25/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/24/bcd710ed-e9b1-4caf-bf81-09dd2d4d8d71/thumbnail/1200x630/912073554a5f85faa4ed7c48ab0825e0/allentown-city-hall.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "Sometimes the demand for hate crimes outweighs the supply",
                "They should be fired for this stunt.",
                "Ah the ole \"Justice for Jussie\" attention play. Haven't seen that tactic in years",
                "Planted by LaTarsha \"Jussie\" Brown",
                "God that letter by a community organizer defending her is atrocious, such grifters",
                "If this was a game of 'Who’s the Worst Person in the Office?' this guy just won by a landslide",
                "I bet if stunts like this got upgraded to felony charges it would stop real quick",
                "They probably fantasize about racial holy wars in their spare time.",
                "Man what is in the water in Pennsylvania? You guys used to be cool.",
                "Lmao OP is in here with like 5 different accounts. \n\nMust be a wet dream for him, waiting years for something like this."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Japan court orders controversial ‘Moonies’ church to disband",
            "external_url": "https://www.bbc.com/news/articles/cge1lr7225yo.amp",
            "upvotes": 5092,
            "date": "03/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/6c21/live/093e3620-0949-11f0-bdd3-f7314caa23ee.jpg",
            "top_comments": [
                "That assassin flat out achieved his objectives. Crazy.",
                "Americans might not be aware, but the Unification Church has leveraged its Japanese influence to control something like 80% of the sushi market in the US via a company called True World Foods.",
                "God, I haven't heard about  the moonies for decades.\n\nI thought they already disbanded.",
                "The order handed down by a Tokyo district court will strip the church of its tax-exempt status and require it to liquidate its assets, but it will still be allowed to operate in Japan.\n\nSo it's not really disbanded.",
                "fucking do it. tired of these ponzi schemes disguised as churches skirting the law because \"we don't want to be religiously intolerant\"",
                "Not so fun fact: The majority of the Unification Church's global revenue came from Japan and they diverted lots of funds to North Korea, which may or may not have went to North Korea's nuclear development and development of intercontinental ballistic missiles.",
                "A friend grew up in that cult.  The stories are fucking made of nightmares.",
                "This year is also the 30th anniversary of Omu Shinrikyo’s Sarin gas attack .",
                "Do Happy University and Soka Gakkai next.\n\nMaybe even Nippon Kaigi.",
                "No more Shooreh Pippi…"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "US Postal Service chief DeJoy steps down",
            "external_url": "https://www.reuters.com/world/us/us-postal-chief-dejoy-stepping-down-immediately-2025-03-24/",
            "upvotes": 17869,
            "date": "03/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Next week it'll probably be announced he's won a contract to operate most USPS services at a premium markup.",
                "May he live out the rest of his days in utter disgrace. What a legacy of malice and public disservice he leaves. ",
                "Woulda been good news 4 years ago",
                "The perception that the Post Office loses money versus say *costs* money, is really annoying. Does the military cost or lose money? Does infrastructure cost or lose money? It's a service we need and it comes at a price and it's worth it.",
                "the absolute right-wing, corporate, capitalist fetishization implicit in this article's framing of the story is so frustrating. it's journalistic malpractice.\n   \n> the money-losing U.S. Postal Service\n   \n> the agency that has lost more than $100 billion since 2007\n   \n> cutting forecast cumulative losses over a decade to $80 billion from $160 billion\n    \n> USPS, an agency with 635,000 employees that lost $9.5 billion last year\n    \n**IT'S NOT A FUCKING BUSINESS.** It's a public fucking service! It **costs** money, it does not **lose** money. \n    \nDoes Reuters list 4 times per article about the US military about how much money it \"loses?\" About how much money the Department of Homeland Security \"loses\" every year? What about how much oil and gas subsidies \"lose\" the US? Or how much corporate tax write offs \"lose\" the American people? Medicare? Fire departments? Public utilities? Federal highways? ICE?\n   \nOf course they fucking don't - because that wouldn't be right-wing propaganda. It's not just about the facts, it's about the framing and how those facts are told.\n   \nJesus Christ.",
                "Someone worse incoming? Or is his leadership no longer needed?",
                "making way for next commissioner, Kyle Rittenhouse",
                "Republicans are locking in all future elections by eliminating the reliability of mail-in-voting.  \n\nWill you vote by mail in the next election, knowing that your vote will now be handled by a privatized mail company owned by a Republican billionaire?",
                "Reuters is usually better than this. No mention of the fact that the only reason the post office loses money is because Congress made it so it must fund retirement for workers so far into the future that it covers workers not even born yet. It didn’t need DeJoy’s restructuring- it needed to be let off the hook.",
                "This can only mean someone even worse than DeJoy is going to take over and/or completely dismantle it."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "World’s first case of bird flu in sheep detected in England",
            "external_url": "https://www.theguardian.com/world/2025/mar/24/bird-flu-detected-sheep-first-time-england-world-risk-public",
            "upvotes": 956,
            "date": "03/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6bae7f4ef0c46d553c1e4535131d87ee1edc6b69/0_124_5212_3128/master/5212.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3d679075330b452aa6e611c6e424327f",
            "top_comments": [
                "Well this is certainly ba-ah-ah-ad news.",
                "This is in fact a very bad thing.",
                "We should check in on England in 28 days huh?",
                "Someone better warn the Welsh.",
                "when it's pigs, i'd be ready for the worst to come tbh",
                "It’s really only a matter of time before we get hit with something bad. 😬",
                "That's Scotland and Wales done for, then.",
                "Ok, so our next pandemic will be a global bird flu which will mean that toilet paper hoarding is simply going to get replaced by egg hoarding, and all products containing eggs will see a price increase that will be permanent after it's all over (\"*cuz why let a good cri$i$ go to waste*\" - The business community).",
                "Is the sheep gonna be ok",
                "New Zealand very nervous right now"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Samsung CEO Han Jong-Hee dies at 63",
            "external_url": "https://www.cnn.com/2025/03/24/tech/samsung-co-ceo-han-jong-hee-death-intl-hnk/index.html",
            "upvotes": 10451,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2192184336.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Another article gives slightly more information on cause. \n\n>  South Korean tech giant Samsung Electronics said on Tuesday that its co-chief executive officer Han Jong-hee has died from cardiac arrest. Han was 63.",
                "My brother works at Samsung Electronics in Korea and posted this morning on our family group chat. He said the guy apparently collapsed at his daughter's wedding after drinking heavily. He was a known heavy drinker within the Samsung circle. He would mix beer with hard liquor and one-shot those despite health concerns.",
                "This is samsung electronics, a subsidiary. The wider group is controlled by Lee Jae-Yong (the family)",
                "To quote Pusha T “ask Steve Jobs, wealth don’t buy health.”",
                "He collapsed during his daughter's wedding reception. I just watched an ER show and the cardiologist said people get confused about the difference between a heart attack and cardiac arrest. A heart attack people are not completely unconscious and they have pain in their chest or arm. A cardiac arrest is when you collapse because your heart has stopped and is likely just quivering. Most people survive a heart attack unless they go into cardiac arrest. In cardiac arrest less than 10% of people survive even with intensive treatment.",
                "Absolutely no information in the article except that he died - interesting\n\n63 is young…was he sick?",
                "Yep, this is the drop dead zone for men. ",
                "[deleted]",
                "Huh, didn't even know he was sick.",
                "Samsung rotates their CEOs every couple of years. They'll just move on"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "USDA halts delivery of 600,000 pounds of food to Michigan food bank",
            "external_url": "https://www.mlive.com/news/grand-rapids/2025/03/usda-halts-delivery-of-600000-pounds-of-food-to-michigan-food-bank.html?utm_campaign=muskegonchronicle_sf&utm_medium=social&utm_source=facebook",
            "upvotes": 303,
            "date": "03/25/2025",
            "thumbnail": "https://www.mlive.com/resizer/v2/KKKPQW4SY5BGVBJBJ7Z6BZIOO4.jpg?auth=4d01c8b21857dafa22f838c2933218e2bffca6aad56dd67a2e43f48dfcf85f49&width=1280&quality=90",
            "top_comments": [
                "The wilful cruelty of the Trump regime astonishes me. Here in the U.K. we have had right wing governments but this is new territory. Also our worst Trump like Prime Minister only lasted 49 days before being ousted. Mind you she cost us our economy and she killed the queen so there is that.",
                "Can somebody explain to me the idea behind this?  Are they trying to disband food banks?  Is it that they want absolutely zero government aid to the general population because of anti-government ideology?  I don't understand their thinking.",
                "Keeping poor people alive that don’t contribute to society is wasteful spending /s",
                "Ah yes, the old \"fuck you citizens\"",
                "Just for fun. Cruelty to poor people is the point. Especially if they are perceived to be minorities.",
                "After all this there's going to be billions in bailouts paid to farmers affected by these decisions. They're going to end up paying to let the food rot. ",
                "Very Christian of them.",
                "News says have empathy for poor Elon not the actual poor ",
                "They are ballsy to think people with absolutely nothing to lose are not a threat.",
                "Even the Roman emperors knew that you had to give people bread & circuses. Does Trump think starving people will just roll over and die? Because boy is he going to be surprised."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "After living in the US for 35 years and raising 3 citizens, these parents got deported to Colombia. Their kids want them back",
            "external_url": "https://www.cnn.com/2025/03/24/us/colombia-immigrants-deported/index.html",
            "upvotes": 1969,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/88879383-1740868315540319-r.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "From the article: \n\n“Gladys and Nelson came to the United States without authorization in 1989, according to an Immigration and Customs Enforcement statement dated March 14. They had no visas when they arrived, Crooms said, but were granted permission to apply for asylum. The couple was fleeing crime in their native Colombia, according to Crooms and their daughter Stephanie.\n\nIn 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE.“\n\nThey applied for asylum, denied and ordered to come back to Columbia. \n\nWhen people applied for asylum they issued temporary SS number and work permit. \nHow did they legally worked in US for 30 years without valid SS number?",
                "Damn, I would be devastated if something like that happens to my parents. I hope the best for them.",
                "As shitty as it is, this isn’t a current administration caused problem. They were told 25 years ago they had to leave.",
                "*\"In 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE*\n\n*...*\n\n*The Gonzalezes did not plan to leave the United States after the order was issued, according to Crooms, who said the couple’s attorney at the time misled them that the order could be appealed and possibly lead to eventual legalization.*\n\n*...*\n\n*The couple’s deportation officer “had not pushed for them to depart until 2018,” leveling with them that it was time to leave the country if their status couldn’t be legalized, Crooms said.\"*\n\nSeems pretty reasonable to me they needed to be deported, they've been told so since 2000, and again in 2018. Just not in handcuffs.",
                "They lost their hearings and were ordered to leave and failed to do so…this one isn’t the hill to die on",
                "\n\n“Gladys and Nelson came to the United States without authorization in 1989\n\nIn 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order.”\n\nSo they entered illegally 36 years ago. Where ordered to leave 25 years ago and chose not to. I would say the US government was more then fair and consideret before deportation. They thought they were above the law. Their children can blame them not the US government.",
                "The headline implies that their parents were suddenly, unexpectedly deported.  \nBut in reality\n\n>In 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE.\n\n  \nSo they've been on notice for over TWENTY years.   \nDon't cry for me, Argentina. I mean, Columbia.",
                "The news would be that the government allowed them to be illegal 35 years. Not that they were finally deported.",
                "So, they overstayed by 25 years?\n\n>**In 2000, the immigration court found no legal reason that would allow Gladys and Nelson to stay in the United States and they were issued a voluntary departure order**, which gives people a certain amount of time to leave the country at their own expense to avoid a deportation order, according to ICE.",
                "Entered illegally, informed to leave, didn't do it.\n\nWhat should happen?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Consumer confidence plummets to lowest level since January 2021",
            "external_url": "https://www.cnn.com/2025/03/25/economy/us-consumer-confidence-march-recession/index.html",
            "upvotes": 660,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2199175993-20250325122218314.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Since our president is actively sabotaging our economy, it's no wonder consumer confidence is tanking.",
                "I’ve cut back my spending since my grocery bill is so high. I’m nervous about how all of these government layoffs and cancelled contracts will affect the economy.",
                "Maybe that's cause idiots are in charge. But I dunno just spitballin'.",
                "Finally, America is great again. 🦅🇺🇸",
                "Consumer confidence plummets to lowest level since last time Trump was in office.",
                "We are so great, you guys.",
                "I'm still confused as fuck why my fellow countrymen voted for this, but congratulations on getting what you wanted.",
                "*If* I buy anything beyond what I need to literally survive, so just \"for fun,\" it's going to be at a thrift store or an antique store. Not at a big-box or at the online behemoth store whose CEO actively supports this administration.\n\nI've completely cut out frivolous shopping of any kind and totally changed my financial habits since January 20th. I also cancelled all streaming services. I'm fucking done supporting rampant capitalism, and I feel just great about it. I'm enjoying the things I already have.",
                "Well, yeah. Inflation was already bad enough before all this mess. Now tariffs AND countless people suddenly losing their jobs? What is there possibly to be confident about as a consumer?",
                "Picking up right where he left off."
            ],
            "aggregate_sentiment": 95.0
        },
        {
            "category": "RISING",
            "title": "United Airlines flight to China diverted to San Francisco after pilot forgets passport",
            "external_url": "https://www.nbcnews.com/news/us-news/united-airlines-flight-china-diverted-san-francisco-pilot-forgets-pass-rcna197942",
            "upvotes": 2303,
            "date": "03/25/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250325-united-plane-mb-1302-69636d.jpg",
            "top_comments": [
                "Imagine the pilot saying 'We'll be turning back… my bad, y'all.'",
                "How was he even allowed to board in the first place? Don’t they check passport at departure?\n\nI know there are crew lanes; I meant don’t they check at crew lanes?",
                "I have (sad and hilarious) nightmares about doing this.",
                "If the pilot just stayed on the plane when they landed, would it even matter? I suppose it's probably pretty unlikely that the pilot would be taking the same plane back, but in the event that they were, would they HAVE to even get off the plane once it landed and go through customs? ",
                "~~If the destination were in EU, that's 600 euros per ticket.~~\n\nEDIT: United is not an EU registered airline so you are fucked either way. Sorry for the misinformation.",
                "Article does NOT mention whether the pilot or airline were immediately transparent with their 100-300 customers who were just massively inconvenienced. \n\n\nHumans make human errors. Fine. I'm a lot more forgiving if they own up to them and apologize up front. ",
                "Would've been funny if they'd just had the pilot not deboard in China, and come back with nobody the wiser. I'm sure that would've required a new flight crew for the be trip, but it still would've been sneaky.",
                "In usual cases, one's wife may kill you. In this case, every passenger, the crew, and corporate will want to kill you. Either way, just crash in front of the customs desk at the Chinese airport, and enjoy your new legendary status in United Lore. \n\nI hope the chucklefuck brought his other IDs to allow himself back into the US. And I hope he meets customs racial standards to boot.",
                "So how long were those people on the last plane",
                "Do passengers get their money back as well as compensation for their lost time/trip?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Japan court orders controversial ‘Moonies’ church to disband",
            "external_url": "https://www.bbc.com/news/articles/cge1lr7225yo.amp",
            "upvotes": 5093,
            "date": "03/25/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/6c21/live/093e3620-0949-11f0-bdd3-f7314caa23ee.jpg",
            "top_comments": [
                "That assassin flat out achieved his objectives. Crazy.",
                "Americans might not be aware, but the Unification Church has leveraged its Japanese influence to control something like 80% of the sushi market in the US via a company called True World Foods.",
                "God, I haven't heard about  the moonies for decades.\n\nI thought they already disbanded.",
                "The order handed down by a Tokyo district court will strip the church of its tax-exempt status and require it to liquidate its assets, but it will still be allowed to operate in Japan.\n\nSo it's not really disbanded.",
                "fucking do it. tired of these ponzi schemes disguised as churches skirting the law because \"we don't want to be religiously intolerant\"",
                "Not so fun fact: The majority of the Unification Church's global revenue came from Japan and they diverted lots of funds to North Korea, which may or may not have went to North Korea's nuclear development and development of intercontinental ballistic missiles.",
                "A friend grew up in that cult.  The stories are fucking made of nightmares.",
                "This year is also the 30th anniversary of Omu Shinrikyo’s Sarin gas attack .",
                "Do Happy University and Soka Gakkai next.\n\nMaybe even Nippon Kaigi.",
                "No more Shooreh Pippi…"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Allentown City Hall employee charged with planting noose at own desk",
            "external_url": "https://www.cbsnews.com/philadelphia/news/latarsha-brown-allentown-noose-charges/",
            "upvotes": 652,
            "date": "03/25/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/24/bcd710ed-e9b1-4caf-bf81-09dd2d4d8d71/thumbnail/1200x630/912073554a5f85faa4ed7c48ab0825e0/allentown-city-hall.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "Sometimes the demand for hate crimes outweighs the supply",
                "They should be fired for this stunt.",
                "Ah the ole \"Justice for Jussie\" attention play. Haven't seen that tactic in years",
                "Planted by LaTarsha \"Jussie\" Brown",
                "God that letter by a community organizer defending her is atrocious, such grifters",
                "If this was a game of 'Who’s the Worst Person in the Office?' this guy just won by a landslide",
                "I bet if stunts like this got upgraded to felony charges it would stop real quick",
                "They probably fantasize about racial holy wars in their spare time.",
                "Man what is in the water in Pennsylvania? You guys used to be cool.",
                "Lmao OP is in here with like 5 different accounts. \n\nMust be a wet dream for him, waiting years for something like this."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "US Postal Service chief DeJoy steps down",
            "external_url": "https://www.reuters.com/world/us/us-postal-chief-dejoy-stepping-down-immediately-2025-03-24/",
            "upvotes": 17867,
            "date": "03/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Next week it'll probably be announced he's won a contract to operate most USPS services at a premium markup.",
                "May he live out the rest of his days in utter disgrace. What a legacy of malice and public disservice he leaves. ",
                "Woulda been good news 4 years ago",
                "The perception that the Post Office loses money versus say *costs* money, is really annoying. Does the military cost or lose money? Does infrastructure cost or lose money? It's a service we need and it comes at a price and it's worth it.",
                "the absolute right-wing, corporate, capitalist fetishization implicit in this article's framing of the story is so frustrating. it's journalistic malpractice.\n   \n> the money-losing U.S. Postal Service\n   \n> the agency that has lost more than $100 billion since 2007\n   \n> cutting forecast cumulative losses over a decade to $80 billion from $160 billion\n    \n> USPS, an agency with 635,000 employees that lost $9.5 billion last year\n    \n**IT'S NOT A FUCKING BUSINESS.** It's a public fucking service! It **costs** money, it does not **lose** money. \n    \nDoes Reuters list 4 times per article about the US military about how much money it \"loses?\" About how much money the Department of Homeland Security \"loses\" every year? What about how much oil and gas subsidies \"lose\" the US? Or how much corporate tax write offs \"lose\" the American people? Medicare? Fire departments? Public utilities? Federal highways? ICE?\n   \nOf course they fucking don't - because that wouldn't be right-wing propaganda. It's not just about the facts, it's about the framing and how those facts are told.\n   \nJesus Christ.",
                "Someone worse incoming? Or is his leadership no longer needed?",
                "making way for next commissioner, Kyle Rittenhouse",
                "Republicans are locking in all future elections by eliminating the reliability of mail-in-voting.  \n\nWill you vote by mail in the next election, knowing that your vote will now be handled by a privatized mail company owned by a Republican billionaire?",
                "Reuters is usually better than this. No mention of the fact that the only reason the post office loses money is because Congress made it so it must fund retirement for workers so far into the future that it covers workers not even born yet. It didn’t need DeJoy’s restructuring- it needed to be let off the hook.",
                "This can only mean someone even worse than DeJoy is going to take over and/or completely dismantle it."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Samsung CEO Han Jong-Hee dies at 63",
            "external_url": "https://www.cnn.com/2025/03/24/tech/samsung-co-ceo-han-jong-hee-death-intl-hnk/index.html",
            "upvotes": 10455,
            "date": "03/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2192184336.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Another article gives slightly more information on cause. \n\n>  South Korean tech giant Samsung Electronics said on Tuesday that its co-chief executive officer Han Jong-hee has died from cardiac arrest. Han was 63.",
                "My brother works at Samsung Electronics in Korea and posted this morning on our family group chat. He said the guy apparently collapsed at his daughter's wedding after drinking heavily. He was a known heavy drinker within the Samsung circle. He would mix beer with hard liquor and one-shot those despite health concerns.",
                "This is samsung electronics, a subsidiary. The wider group is controlled by Lee Jae-Yong (the family)",
                "To quote Pusha T “ask Steve Jobs, wealth don’t buy health.”",
                "He collapsed during his daughter's wedding reception. I just watched an ER show and the cardiologist said people get confused about the difference between a heart attack and cardiac arrest. A heart attack people are not completely unconscious and they have pain in their chest or arm. A cardiac arrest is when you collapse because your heart has stopped and is likely just quivering. Most people survive a heart attack unless they go into cardiac arrest. In cardiac arrest less than 10% of people survive even with intensive treatment.",
                "Absolutely no information in the article except that he died - interesting\n\n63 is young…was he sick?",
                "Yep, this is the drop dead zone for men. ",
                "[deleted]",
                "Huh, didn't even know he was sick.",
                "Samsung rotates their CEOs every couple of years. They'll just move on"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Oscar-winning Palestinian director attacked by Israeli settlers and arrested",
            "external_url": "https://www.theguardian.com/world/2025/mar/24/oscar-winning-palestinian-director-attacked-by-israeli-settlers-and-arrested",
            "upvotes": 17359,
            "date": "03/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1c062253020fbc7665681aec4d4423d7d450f595/0_247_1365_819/master/1365.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=94da34fd8ec7e1b54b4756a49420ead3",
            "top_comments": [
                "To clarify, he was apparently attacked by Israeli settlers at his home and was subsequently detained and disappeared by the Israeli military. \n\nHis Israeli co-director stated that the attack by the settlers left Ballal bleeding from the head. When an ambulance arrived for him, Israeli soldiers prevented medics from treating him, pulled him out of the ambulance, blindfolded him, forced him and another attack victim into a car, and drove away.\n\n[The Associated Press](https://apnews.com/article/no-other-land-oscar-israel-palestinians-084c63f33e748a3279646759e9b705c2) is reporting that they have received verified video showing part of the attack, which targeted both Jewish Israeli and Palestinian peace activists alike:\n\n> Video provided by the Center for Jewish Nonviolence showed a masked settler shoving and swinging his fists at two activists from the group in a dusty field at night. The activists rush back to their car. “Get in, get in!” one shouts, and they duck inside as the thuds of rocks being thrown can be heard. “Car window was broken,” the driver says as they drive off.\n\nThe Israeli military has refused to comment or provide any information about Ballal’s whereabouts.\n\nEdit: [This](https://www.reddit.com/r/Fauxmoi/s/mBJ3EfPMEc) is purportedly video of the attack from the peace activists’ perspective.",
                "Talk about quite literally hammering home the point of the movie.",
                "Arrested? It’s a fucking kidnapping",
                "Can we stop calling them settlers? They’re invaders.",
                "This is one of the biggest Hollywood stories in the century.",
                "This is HORRIFYING and needs to be on the front page of every news source. Not that everything up til this point hasn’t been horrifying— but the Hollywood element here means this story has the potential to really stick. Please comment and share and talk about this.",
                "“Arrested” reports are saying he was taken from an ambulance and lynched..",
                "How are we not sanctioning these scumbags? This is insane.",
                "I hate when people call them just “settlers”. \n\nThey’re terrorists. They have been purposely terrorizing people and stealing land for decades, thus they are settler terrorists. There is no other way to describe these people.",
                "Lynched and kidnapped is a lil more accurate. Call it what it is."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "Top US officials appeared to message a journalist Houthi strike plans",
            "external_url": "https://www.bbc.com/news/articles/cy4v3ndg28jo",
            "upvotes": 35451,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/bb93/live/2e633df0-0968-11f0-88b7-5556e7b55c5e.jpg",
            "top_comments": [
                "[removed]",
                "Not appeared, they DID message a journalist by mistake on their group text chain discussing war plans.",
                "\"Any unauthorized release of classified information is a violation of the law and will be treated as such.\"\n\n-Tulsi Gabbard 3/14/25\n\nFor those keeping track that is the day before these events took place and she's on the group chat on question.",
                ">Jeffrey Goldberg, editor-in-chief of The Atlantic, [reported](https://www.theatlantic.com/politics/archive/2025/03/trump-administration-accidentally-texted-me-its-war-plans/682151) on Monday that he was added to a Signal message group which included accounts labelled as White House National Security Adviser Michael Waltz and Vice-President JD Vance.\n\nWhy are updates on military operations being communicated over Signal rather than secure DoD communications?\n\nEdit:  \nAnyone who remotely (and rightfully) criticized Hillary Clinton for using her own Email server should be furious about this news story.",
                "The headline really downplays the absolute fuckery of what happened here. \n\n1) Cabinet level, real-time military operational planning was being done on a commercial messaging platform instead of a secure government IS. \n\n2) They fucking didn't notice a private citizen was sitting in the group chat. \n\n\nThis is an absolutely catastrophic failure of information and operational security that puts previous scandals (Hillary emails, even Trump documents) to shame. This is unauthorized disclosure of the most sensitive government information imaginable. All of these people should be fired if not criminally charged.",
                "From the story in the Atlantic:\n\n>Brian Hughes, the spokesman for the National Security Council, responded two hours later, confirming the veracity of the Signal group. “This appears to be an authentic message chain, and we are reviewing how an inadvertent number was added to the chain,” Hughes wrote. “The thread is a demonstration of the deep and thoughtful policy coordination between senior officials.”\n\nThese assholes were using goddamned emojis.",
                "Jesus fucking Christ. The ineptitude is rampant",
                "Thank you, Trump voters, for enabling these many opportunities to see that your people are as embarrassing behind closed doors as they are publicly. \n\n\nIt's going to take decades to recover from just the past 2 months.  Pretty much an entire term to go.",
                "Old whiskey finger hegseth at it again. To be fair, when you’re that drunk, names just blur together in your phone. ",
                "Wow. I’m stunned that the president of the US, Elon Musk wasn’t added to this amateur hour group chat too. \n\nHe’s probably insulted. "
            ],
            "aggregate_sentiment": 32.0
        }
    ],
    "last_updated": "03/25/2025 16:09:17 UTC"
}