{
    "posts": [
        {
            "category": "HOT",
            "title": "US employers cut more jobs last month than any February since 2009",
            "external_url": "https://www.cnn.com/2025/03/06/economy/us-jobs-report-february-preview/index.html?utm_medium=social&amp;utm_source=igCNN&amp;utm_content=2025-03-06T12%3A59%3A28",
            "upvotes": 5082,
            "date": "03/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2203083579.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "That includes Musk and Trump firing tons of federal employees. \n\nTrump recession sucks.",
                "The Trumpcession is pulling into station.",
                "Republicans SUCK. Each time they are in power they ruin the economy.",
                "It will take a full two months to feel the real effects of trump's compromised positions. Consumer spending (2/3's of the US economy) will fall off a cliff right in time for spring retail stock and inventory positioning. Things are going to grind to a halt and companies will be back in a 2021/2 position and cash-poor/inventory-heavy. It's going to be a disgusting economy for a long time.",
                "inb4 \"And here's why this is Biden's fault even though there have been dramatic changes to both actual government policy and the perception of it since November, and especially since January.\"",
                "So much winning, right?\n\nJust like they view the COVID deaths as a high score to beat, conservatives view the 2008 crash as a high score of economic damage - but they'll beat that one soon, too.\n\nNobody hates America like conservative fake patriots.",
                "How is this saving the government money or in anyway efficient? Won't all these laid off workers apply for unemployment and other social safety programs?",
                "Tomorrow's job report is almost certainly going to be bad news for Republicans, though I fully expect them to continue to blame Biden for it.",
                "And we're just getting warmed up!",
                "Hey, remember last time around when all the MAGAs were blaming the unemployment rate on Democrats and COVID restrictions?\n\nHow are things going now?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Six people arrested in Romania for treason over alleged negotiations with Russian agents to leave NATO",
            "external_url": "https://www.g4media.ro/six-people-arrested-in-romania-for-treason-over-alleged-negotiations-with-russian-agents-to-leave-nato.html",
            "upvotes": 8015,
            "date": "03/06/2025",
            "thumbnail": "https://cdn.g4media.ro/wp-content/uploads/2022/01/Radu-Theodoru.jpg",
            "top_comments": [
                "Romania seemingly not that nostalgic about the \"good\" old days.",
                "Hey, look a country that doesn’t suck off Putin. I remember when America was like that.",
                "Good job Romania, keep fighting for freedom.",
                "For the life of me, I would never understand why the Russian government focus on improving their own country instead of bringing down others to their level. The largest country in the world and the richest in natural resources.",
                "How does Russia have so much pull on so many? Are this many people willing to sell out for a few bucks?\n\n\nNevermind, I don’t think I want to know…",
                "Give us 5hrs until the 🍊man will get angry about it.",
                "It gets funnier the more you read it:\n\n\n&gt;\tAmong the suspects is Radu Theodoru, a retired Romanian general, aged 101, known for his violently antisemitic publications",
                "Republicans, tell us again Trump isn't under Russian influence as he keeps taking those undocumented calls direct from Putin, violating the presidential records act. And calling to leave NATO, what a coincidence.",
                "Romanians are the type to drag dictators out into the street, give them a quick “trial” and kill them. Good for them.",
                "101 years old. Why are all these old fucks insane? Why do they still hold influence?\n\nI'm beginning to see a disturbing pattern"
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "HOT",
            "title": "‘Read this email immediately’: CDC tells about 180 fired employees to come back to work",
            "external_url": "https://apnews.com/article/cdc-reinstatements-c1f0b33d677e5a02a4df1210b82ca930",
            "upvotes": 19978,
            "date": "03/06/2025",
            "thumbnail": "https://dims.apnews.com/dims4/default/977c96f/2147483647/strip/true/crop/3300x1856+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2Ff3%2Fc28219f311c09b7e59b5e82de64f%2Fcb1cfaf434544ae0bb7daf1919f6a315",
            "top_comments": [
                "You mean emails in accounts they were locked out of?",
                "Ladies and Gentlemen, the Department of Government Efficiency.",
                "&gt; “You should return to duty under your previous work schedule,” it said. “We apologize for any disruption that this may have caused.”\n\n**MAY** have caused?  Do you think firing people, then asking them to come back two weeks later MIGHT have caused some disruption?  Like, you're not certain?",
                "What a shit show this administration is",
                "&gt; You’re fired. You’re hired. No more remote working. Write me an email and tell me what you do. Actually just kidding you don’t have to, but also if you don’t, You’re fired. Ok You’re fired. Wait, please come back. \n\nThe Department of Government Efficiency ladies and gentlemen",
                "\"Tells\"?\n\nYou fired them. You *ask*.",
                "CDC *begs* fired employees to come back to work. FTFY",
                "Why?  Why would you go back to work?  You know maybe next week, for no reason whatsoever, you might just get fired again.  Go find a more stable job elsewhere.  I hear China is hiring.",
                "You know how much loyalty you owe an employer that terminated you on a whim?\n\nNot an ounce.",
                "\"Return to work? Termination rescinded?\" I don't think so.\n\n\"I was Terminated. now you want to re-hire me. This will require a re-negotiation of my salary. I have not seen a fair cost of living increase in years. \" - is what each and every VICTIM OF DOGE should say."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Amazon Boycott Begins Friday, Includes Whole Foods, Prime, Twitch",
            "external_url": "https://www.cnet.com/tech/economic-blackout-asks-you-to-boycott-amazon-for-a-week/",
            "upvotes": 9233,
            "date": "03/06/2025",
            "thumbnail": "https://www.cnet.com/a/img/resize/54cc0d7481c3b4ba6cd1b5d7865f11c43feb1e75/hub/2024/09/30/ab904444-01d1-4d43-b94b-8d091f7ef01e/amazon-box-foreground.jpg?auto=webp&fit=crop&height=675&width=1200",
            "top_comments": [
                "I hope people who are just beginning the boycotts realize they can just remove these out of their lives as they become used to living without them. Why go back? Don't.",
                "Jokes on them , I'm broke and can't afford it anyway",
                "Great time for people in the US to curve their over consumption habits in preparation for all the tariffs\n.",
                "Reddit uses AWS\n\nhttps://www.datacenterdynamics.com/en/news/reddit-uses-aws-and-google-cloud-plans-to-spend-at-least-385m-on-cloud-by-september-2026/",
                "Why cant we boycott things all at the same time",
                "Havent had prime for 2-3 years now and it hasnt made my life harder at all.\n\nMaybe bought a handful of things in that time  when it wasn't offered elsewhere but that is pretty much it. The other stores (costco) always come in clutch.\n\nTheir shipping back then was also frustrating... I'd buy books back then that arrived in a thin plastic mailer all bent out of shape. Which was weird cause of how amazon began. Target did sooo much better maintaining the book's condition.\n\nTheir physical media often arrived dented or broken, their quality of CS dropped etc etc.\n\nThey also somehow made whole foods worse.\n\n  \nNo the $35 for free shipping prevents me from impulse buys :)\n\n  \nAnd after the last few stunts of Jeff I always try elsewhere first.",
                "I would like to remind anyone not cancelling their prime account to go use your twitch prime on a creator, any creator. It forces Amazon/twitch to pay your chosen creator out of their own pocket on a monthly basis, and is one of Twitch’s biggest loss items",
                "Remember when people said they weren't going to use Netflix after the price hike (and for the password sharing thing) and the company actually saw positive growth? It's hard to take these things seriously. I'm curious if an actual boycott of a \"TBTF\" business has ever had a modicum of success. ",
                "i saw someone say 40 day target boycott and honestly people still don't seem to get it. if you live somewhere that you have another option, take it. 40 days is literally nothing. \n\nblack americans were boycotting busses for a full fucking year, if you have the ability, go to your local latino markets, asian markets, go in with a neighbor and get a costco membership if you have to ( you can have 2 people on one membership, 1 owner and a secondary member) \n\n(ps before anyone starts yelling about \"some of us its far/don't have transport/can't afford it\" then did it seem like i was talking to you when i said \"if you have the means\"?)",
                "What’s everyone’s alternative besides Costco? I don’t live anywhere near a Costco."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Jack Daniel's maker says Canada taking bottles off shelves 'worse than tariffs'",
            "external_url": "https://www.bbc.com/news/articles/cn0422zzpw8o",
            "upvotes": 1315,
            "date": "03/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d82c/live/440a81d0-fa7d-11ef-8ae1-1f8b4aca4e93.jpg",
            "top_comments": [
                "\"it's worse because it affects me\" is basically the conservative maxim.",
                "As an American I 100% support this. Not only because Trump is a jackass, but because Jack Daniel’s Old No. 7 is horse piss and the fact that it is synonymous with American whiskey is a tragedy.",
                "Whatever their complaints are, I can guarantee threats of annexation are worse.\n\nGo cry in your piss whiskey.",
                "'Brown-Forman boss Lawson Whiting said the Canadian response was \"disproportionate\" to the 25% levies on Canadian goods imposed by the Trump administration.  \n...  \nNevertheless, Mr Whiting said Canada makes up only 1% of Brown-Forman's total sales, so the firm can withstand the hit.'\n\nSo the guy is complaining that the Canadian response is disproportionate because it will affect 1% of it's sale instead of 0.25% while the States tries to tank the entire Canadian economy. Cry me a fucking river.",
                "Fuck off. Go fire your president",
                "Maybe Jack Daniels maker should start using their voice to decry the insanity of Trump's tariffs, fucking pathetic Republican cunt.",
                "We removed US alcohol from our shops because your government initiated a trade war with the intent of crippling our economy and annexing our country as \"the 51st state.' All y'all are not our friends and we do not feel a shred of sympathy for you.\n\nTime to act like a real country, America. This tin pot dictator look isn't a good one.",
                "Oh no, actions have consequences?!?!",
                "“But Kamala is worse” ~ them, probably",
                "Guess what Jack.  Those customers are NEVER coming back.\n\nCanadian whiskey is plentiful.  And blue states, like Washington State, have many fine distilleries making fabulous bourbon and rye."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "House Speaker Mike Johnson's chief of staff arrested on DUI charge after Trump speech",
            "external_url": "https://www.nbcnews.com/politics/congress/speaker-mike-johnson-chief-staff-arrested-dui-charge-trump-speech-rcna194986",
            "upvotes": 23449,
            "date": "03/05/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250303-mike-johnson-vl-1116a-90e2c1.jpg",
            "top_comments": [
                "These DUI hires, I tell ya",
                "That’ll be an interesting “what did you do this week” bullet",
                "Is there any way to FOIA the body cam footage? I bet this guy tried the ' No, you can't. I work for-\" defense.",
                "&gt;A Johnson spokesman said the speaker is standing by his chief of staff and \"has full faith and confidence\" in him.\n\n\nmy man you cannot be this spineless to your blundering henchmen",
                "I guarantee that if it has be the chief of staff for a Democrat the GOP would have been calling on said Democrat to resign for having such poor judgement in who they employed...",
                "I’d be a heavy drinker too if I sold out my country and values.",
                "The party of family values, everyone",
                "My only question - celebrating or drowning his sorrows?",
                "*No one* should be driving drunk. There's no -- zero -- excuse for that with ride shares and taxis existing, and there being a huge crowd there, some of whom would undoubtedly have given him a ride just for the asking if he was at the speech. Heck, I'd give an opposing party member a ride to keep them and others safe. \n\nThat said, he is not the only person who wanted to have a few too many after Trump's performance.",
                "How much do you want to bet he dropped the \"Do you know who I am?\""
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Political poll news site 538 to close amid larger shuttering across ABC and Disney",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/05/abc-news-538-shut-down",
            "upvotes": 13210,
            "date": "03/05/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6c1a8889b7ac4bae2cadb7e884b80cb6ee9948d5/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8e202632038d7d38a3df642de6fd4c07",
            "top_comments": [
                "&gt;The broader media landscape has been hit with mass layoffs seemingly nonstop for months. Last month, MSNBC announced a massive shakeup at the network that included letting go of Joy Reid and her production team, as well as no longer using the Spanish-language network Telemundo.\n\nSetting aside any questions about former 538 head Nate Silver, it sucks to lose a valuable source for political polling and data analysis.  I hope the talented people there find new work.",
                "Wait but what about Galen Druke??? HE’S MY BOY",
                "How am I going to get my hopes up only to be woefully disappointed now?!",
                "Is the podcast getting axed also?",
                "I stopped obsessing over horserace polling after 2016 but still a shame. I liked their podcast and articles.",
                "Truth Social to soon come out with polling data that always shows Trump favored by 99%",
                "Coincidentally, they chose to shutter 538 the day after it started showing that Trump had negative approval in the aggregate.",
                "Nate Silver was removed over a year ago. Didn't really make sense to try to keep using his branding without him there.",
                "I don't give a shit about polls, but there's been a weird sudden shutdown of media. They weren't nice to Trump last time, now they're immediately handing him settlement money and are crickets quiet about his madness and ineptitude. Something is rotten.",
                "You don’t need an election monitoring site if you no longer plan on having elections."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "China says it is ready for 'any type of war' with US",
            "external_url": "https://www.bbc.co.uk/news/articles/c4gmd3g2nzqo.amp",
            "upvotes": 5868,
            "date": "03/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/00c6/live/68e23460-f9d5-11ef-8c03-7dfdbeeb2526.jpg",
            "top_comments": [
                "\"Older men declare war. But it is youth that must fight and die.\" \n-Herbert Hoover ",
                "\"Trump will scare dictators off with his strength\" - MAGA during the 2024 election season",
                "Break dancing followed by a rap battle?",
                "Just great stuff you love to see, and I haven't been to the grocery store but I must assume eggs have gone down in price",
                "If China declared war on the USA, Trump would ask what’s in it for him, and leave for Russia.",
                "Well good thing we found the most incompetent people running all aspects of the government then.",
                "Well, they might be right since the USA just essentially told all their allies to fuck off... They might not have any help.",
                "I think a lot of people do not understand the way trade wars can become or contribute to real wars. \n\nSarah Paine, I believe she said that the US oil embargo of Japan was the real starting point of the pacific conflict in WW2. She’s a top flight historian all over YouTube now and she’s a great lecturer. \n\nYou start waving swords, people will start planning bad outcomes.",
                "Can we please not go to war?  We need to restore that concept to an amendment to the Constitution that said war gets put to a national vote and the people that vote for it immediately get put into a draft.",
                "The US is eager to toss Europe, Canada, and Mexico under the bus so the US can lose a war to China while Russia gives us a thumbs up and laughs at the US with China. \n\nWe’re a bull tricked into charging a wall."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Three friends were found dead last year after watching a Chiefs game. Now, 2 men face charges in the case",
            "external_url": "https://www.cnn.com/2025/03/06/us/kansas-city-deaths-chiefs-fans-hnk?cid=external-feeds_iluminar_yahoo",
            "upvotes": 629,
            "date": "03/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/240125172228-kc-chiefs-fans-deaths-1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Wow, it took a year to get the evidence to arrest the guy everyone thought did it the second they heard he lived in the house for a couple days with three corpses in his backyard?",
                "Great police work, man.  Takes them a year to get charges on this?  Good lord.  You never know if stuff has been laced with something.  Regardless, how do you not know that there are 3 dead bodies in your backyard for 2 days?",
                "“Uh, I didn’t know there were dead people in my back yard.”\n\nRight.\n\nNow for everyone eviscerating the police, you don’t understand the criminal justice system. If you rush into charging someone, you risk going to court unprepared. Because if you charge, you have a set amount of time before you have to go to court. If you go to court unprepared, you risk losing the case and these jackasses walk. Toxicology takes time. You have to interview witnesses. There’s a LOT to consider. You wait until you believe your case is bulletproof, or at least your chance of winning is maxed out, then you charge.\n\nJust as a fraud investigator, I see a shit ton of cases where “that’s motherfucker is obviously guilty,” and the case drags on before charges are brought. I’ve worked on stuff that’s literally gone on for five years. It’s not usually on the police. The AGs or AUSAs that don’t want to take on a case where there’s a higher chance of losing.\n\nThe other side of this is that it’s almost certainly going to get pled down to something like reckless endangerment or whatever and these guys will do two years or something. They charged the highest thing they could upfront to get pressure and a headline.",
                "Doing cocaine to watch a football game is not something I honestly ever considered.",
                "Wait so the dude is being charged because his coke was tainted resulting in three of their deaths?",
                "Can’t tell you how many episodes of forensic files there are where the police just suck so bad at their jobs that it takes decades and one half decent detective to solve a case.",
                "I still don't understand how/why they all died outside.",
                "I have to say, if 3 people go out of their way to buy drugs that are known to be dangerous and overdose, I don’t think that should be considered murder for those who supplied the drugs. They should get charged with selling drugs, sure.",
                "[removed]",
                "They don’t have the evidence for this case it’ll go no where"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "South Korea: Fifteen hurt after fighter jets drop bombs due to human error",
            "external_url": "https://www.bbc.com/news/articles/c2ernge8193o.amp",
            "upvotes": 339,
            "date": "03/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/216e/live/e439c260-fa46-11ef-86ff-f583a2c90fa2.jpg",
            "top_comments": [
                "Every now and then the lyrics to 99 Red Balloons feel a bit too relevant again.",
                "&gt;The incident involving the Air Force KF-16 aircraft, in the city of Pocheon near North Korea, was part of routine drills held by the South to maintain combat readiness against potential attacks from the North.\n\nReads like the military equivalent of shooting yourself at the firing range.",
                "- Pilot 2: Soooo what are you thinking about? You've been so distant lately. \n\n\n- Pilot 1: Dude, drop it. \n\n\n- Pilot 2: Why?? I care and somethings up. \n\n\n- Pilot 1: Dude I said fucking drop it!\n\n\n- Pilot 3: Wait why are we dropping it?? \n\n\n- Pilot 2: He said to drop it! \n\n\n- Pilot 1: Drop it? \n\n\n- Pilot 3: Drops ordinance",
                "Redirect those to Ukraine and drop them on some Russians",
                "When you call cleared hot instead of continue dry"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Jack Daniel's maker says Canada taking bottles off shelves 'worse than tariffs'",
            "external_url": "https://www.bbc.com/news/articles/cn0422zzpw8o",
            "upvotes": 1311,
            "date": "03/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d82c/live/440a81d0-fa7d-11ef-8ae1-1f8b4aca4e93.jpg",
            "top_comments": [
                "\"it's worse because it affects me\" is basically the conservative maxim.",
                "As an American I 100% support this. Not only because Trump is a jackass, but because Jack Daniel’s Old No. 7 is horse piss and the fact that it is synonymous with American whiskey is a tragedy.",
                "Whatever their complaints are, I can guarantee threats of annexation are worse.\n\nGo cry in your piss whiskey.",
                "'Brown-Forman boss Lawson Whiting said the Canadian response was \"disproportionate\" to the 25% levies on Canadian goods imposed by the Trump administration.  \n...  \nNevertheless, Mr Whiting said Canada makes up only 1% of Brown-Forman's total sales, so the firm can withstand the hit.'\n\nSo the guy is complaining that the Canadian response is disproportionate because it will affect 1% of it's sale instead of 0.25% while the States tries to tank the entire Canadian economy. Cry me a fucking river.",
                "Fuck off. Go fire your president",
                "Maybe Jack Daniels maker should start using their voice to decry the insanity of Trump's tariffs, fucking pathetic Republican cunt.",
                "We removed US alcohol from our shops because your government initiated a trade war with the intent of crippling our economy and annexing our country as \"the 51st state.' All y'all are not our friends and we do not feel a shred of sympathy for you.\n\nTime to act like a real country, America. This tin pot dictator look isn't a good one.",
                "Oh no, actions have consequences?!?!",
                "“But Kamala is worse” ~ them, probably",
                "Guess what Jack.  Those customers are NEVER coming back.\n\nCanadian whiskey is plentiful.  And blue states, like Washington State, have many fine distilleries making fabulous bourbon and rye."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US employers cut more jobs last month than any February since 2009",
            "external_url": "https://www.cnn.com/2025/03/06/economy/us-jobs-report-february-preview/index.html?utm_medium=social&amp;utm_source=igCNN&amp;utm_content=2025-03-06T12%3A59%3A28",
            "upvotes": 5076,
            "date": "03/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2203083579.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "That includes Musk and Trump firing tons of federal employees. \n\nTrump recession sucks.",
                "The Trumpcession is pulling into station.",
                "Republicans SUCK. Each time they are in power they ruin the economy.",
                "It will take a full two months to feel the real effects of trump's compromised positions. Consumer spending (2/3's of the US economy) will fall off a cliff right in time for spring retail stock and inventory positioning. Things are going to grind to a halt and companies will be back in a 2021/2 position and cash-poor/inventory-heavy. It's going to be a disgusting economy for a long time.",
                "inb4 \"And here's why this is Biden's fault even though there have been dramatic changes to both actual government policy and the perception of it since November, and especially since January.\"",
                "So much winning, right?\n\nJust like they view the COVID deaths as a high score to beat, conservatives view the 2008 crash as a high score of economic damage - but they'll beat that one soon, too.\n\nNobody hates America like conservative fake patriots.",
                "How is this saving the government money or in anyway efficient? Won't all these laid off workers apply for unemployment and other social safety programs?",
                "Tomorrow's job report is almost certainly going to be bad news for Republicans, though I fully expect them to continue to blame Biden for it.",
                "And we're just getting warmed up!",
                "Hey, remember last time around when all the MAGAs were blaming the unemployment rate on Democrats and COVID restrictions?\n\nHow are things going now?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "South Korea: Fifteen hurt after fighter jets drop bombs due to human error",
            "external_url": "https://www.bbc.com/news/articles/c2ernge8193o.amp",
            "upvotes": 345,
            "date": "03/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/216e/live/e439c260-fa46-11ef-86ff-f583a2c90fa2.jpg",
            "top_comments": [
                "Every now and then the lyrics to 99 Red Balloons feel a bit too relevant again.",
                "&gt;The incident involving the Air Force KF-16 aircraft, in the city of Pocheon near North Korea, was part of routine drills held by the South to maintain combat readiness against potential attacks from the North.\n\nReads like the military equivalent of shooting yourself at the firing range.",
                "- Pilot 2: Soooo what are you thinking about? You've been so distant lately. \n\n\n- Pilot 1: Dude, drop it. \n\n\n- Pilot 2: Why?? I care and somethings up. \n\n\n- Pilot 1: Dude I said fucking drop it!\n\n\n- Pilot 3: Wait why are we dropping it?? \n\n\n- Pilot 2: He said to drop it! \n\n\n- Pilot 1: Drop it? \n\n\n- Pilot 3: Drops ordinance",
                "Redirect those to Ukraine and drop them on some Russians",
                "When you call cleared hot instead of continue dry"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Three friends were found dead last year after watching a Chiefs game. Now, 2 men face charges in the case",
            "external_url": "https://www.cnn.com/2025/03/06/us/kansas-city-deaths-chiefs-fans-hnk?cid=external-feeds_iluminar_yahoo",
            "upvotes": 626,
            "date": "03/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/240125172228-kc-chiefs-fans-deaths-1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Wow, it took a year to get the evidence to arrest the guy everyone thought did it the second they heard he lived in the house for a couple days with three corpses in his backyard?",
                "Great police work, man.  Takes them a year to get charges on this?  Good lord.  You never know if stuff has been laced with something.  Regardless, how do you not know that there are 3 dead bodies in your backyard for 2 days?",
                "“Uh, I didn’t know there were dead people in my back yard.”\n\nRight.\n\nNow for everyone eviscerating the police, you don’t understand the criminal justice system. If you rush into charging someone, you risk going to court unprepared. Because if you charge, you have a set amount of time before you have to go to court. If you go to court unprepared, you risk losing the case and these jackasses walk. Toxicology takes time. You have to interview witnesses. There’s a LOT to consider. You wait until you believe your case is bulletproof, or at least your chance of winning is maxed out, then you charge.\n\nJust as a fraud investigator, I see a shit ton of cases where “that’s motherfucker is obviously guilty,” and the case drags on before charges are brought. I’ve worked on stuff that’s literally gone on for five years. It’s not usually on the police. The AGs or AUSAs that don’t want to take on a case where there’s a higher chance of losing.\n\nThe other side of this is that it’s almost certainly going to get pled down to something like reckless endangerment or whatever and these guys will do two years or something. They charged the highest thing they could upfront to get pressure and a headline.",
                "Doing cocaine to watch a football game is not something I honestly ever considered.",
                "Wait so the dude is being charged because his coke was tainted resulting in three of their deaths?",
                "Can’t tell you how many episodes of forensic files there are where the police just suck so bad at their jobs that it takes decades and one half decent detective to solve a case.",
                "I still don't understand how/why they all died outside.",
                "I have to say, if 3 people go out of their way to buy drugs that are known to be dangerous and overdose, I don’t think that should be considered murder for those who supplied the drugs. They should get charged with selling drugs, sure.",
                "[removed]",
                "They don’t have the evidence for this case it’ll go no where"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Six people arrested in Romania for treason over alleged negotiations with Russian agents to leave NATO",
            "external_url": "https://www.g4media.ro/six-people-arrested-in-romania-for-treason-over-alleged-negotiations-with-russian-agents-to-leave-nato.html",
            "upvotes": 8016,
            "date": "03/06/2025",
            "thumbnail": "https://cdn.g4media.ro/wp-content/uploads/2022/01/Radu-Theodoru.jpg",
            "top_comments": [
                "Romania seemingly not that nostalgic about the \"good\" old days.",
                "Hey, look a country that doesn’t suck off Putin. I remember when America was like that.",
                "Good job Romania, keep fighting for freedom.",
                "For the life of me, I would never understand why the Russian government focus on improving their own country instead of bringing down others to their level. The largest country in the world and the richest in natural resources.",
                "How does Russia have so much pull on so many? Are this many people willing to sell out for a few bucks?\n\n\nNevermind, I don’t think I want to know…",
                "Give us 5hrs until the 🍊man will get angry about it.",
                "It gets funnier the more you read it:\n\n\n&gt;\tAmong the suspects is Radu Theodoru, a retired Romanian general, aged 101, known for his violently antisemitic publications",
                "Republicans, tell us again Trump isn't under Russian influence as he keeps taking those undocumented calls direct from Putin, violating the presidential records act. And calling to leave NATO, what a coincidence.",
                "Romanians are the type to drag dictators out into the street, give them a quick “trial” and kill them. Good for them.",
                "101 years old. Why are all these old fucks insane? Why do they still hold influence?\n\nI'm beginning to see a disturbing pattern"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Amazon Boycott Begins Friday, Includes Whole Foods, Prime, Twitch",
            "external_url": "https://www.cnet.com/tech/economic-blackout-asks-you-to-boycott-amazon-for-a-week/",
            "upvotes": 9233,
            "date": "03/06/2025",
            "thumbnail": "https://www.cnet.com/a/img/resize/54cc0d7481c3b4ba6cd1b5d7865f11c43feb1e75/hub/2024/09/30/ab904444-01d1-4d43-b94b-8d091f7ef01e/amazon-box-foreground.jpg?auto=webp&fit=crop&height=675&width=1200",
            "top_comments": [
                "I hope people who are just beginning the boycotts realize they can just remove these out of their lives as they become used to living without them. Why go back? Don't.",
                "Jokes on them , I'm broke and can't afford it anyway",
                "Great time for people in the US to curve their over consumption habits in preparation for all the tariffs\n.",
                "Reddit uses AWS\n\nhttps://www.datacenterdynamics.com/en/news/reddit-uses-aws-and-google-cloud-plans-to-spend-at-least-385m-on-cloud-by-september-2026/",
                "Why cant we boycott things all at the same time",
                "Havent had prime for 2-3 years now and it hasnt made my life harder at all.\n\nMaybe bought a handful of things in that time  when it wasn't offered elsewhere but that is pretty much it. The other stores (costco) always come in clutch.\n\nTheir shipping back then was also frustrating... I'd buy books back then that arrived in a thin plastic mailer all bent out of shape. Which was weird cause of how amazon began. Target did sooo much better maintaining the book's condition.\n\nTheir physical media often arrived dented or broken, their quality of CS dropped etc etc.\n\nThey also somehow made whole foods worse.\n\n  \nNo the $35 for free shipping prevents me from impulse buys :)\n\n  \nAnd after the last few stunts of Jeff I always try elsewhere first.",
                "I would like to remind anyone not cancelling their prime account to go use your twitch prime on a creator, any creator. It forces Amazon/twitch to pay your chosen creator out of their own pocket on a monthly basis, and is one of Twitch’s biggest loss items",
                "Remember when people said they weren't going to use Netflix after the price hike (and for the password sharing thing) and the company actually saw positive growth? It's hard to take these things seriously. I'm curious if an actual boycott of a \"TBTF\" business has ever had a modicum of success. ",
                "i saw someone say 40 day target boycott and honestly people still don't seem to get it. if you live somewhere that you have another option, take it. 40 days is literally nothing. \n\nblack americans were boycotting busses for a full fucking year, if you have the ability, go to your local latino markets, asian markets, go in with a neighbor and get a costco membership if you have to ( you can have 2 people on one membership, 1 owner and a secondary member) \n\n(ps before anyone starts yelling about \"some of us its far/don't have transport/can't afford it\" then did it seem like i was talking to you when i said \"if you have the means\"?)",
                "What’s everyone’s alternative besides Costco? I don’t live anywhere near a Costco."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "NEW",
            "title": "‘Read this email immediately’: CDC tells about 180 fired employees to come back to work",
            "external_url": "https://apnews.com/article/cdc-reinstatements-c1f0b33d677e5a02a4df1210b82ca930",
            "upvotes": 19980,
            "date": "03/06/2025",
            "thumbnail": "https://dims.apnews.com/dims4/default/977c96f/2147483647/strip/true/crop/3300x1856+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2Ff3%2Fc28219f311c09b7e59b5e82de64f%2Fcb1cfaf434544ae0bb7daf1919f6a315",
            "top_comments": [
                "You mean emails in accounts they were locked out of?",
                "Ladies and Gentlemen, the Department of Government Efficiency.",
                "&gt; “You should return to duty under your previous work schedule,” it said. “We apologize for any disruption that this may have caused.”\n\n**MAY** have caused?  Do you think firing people, then asking them to come back two weeks later MIGHT have caused some disruption?  Like, you're not certain?",
                "What a shit show this administration is",
                "&gt; You’re fired. You’re hired. No more remote working. Write me an email and tell me what you do. Actually just kidding you don’t have to, but also if you don’t, You’re fired. Ok You’re fired. Wait, please come back. \n\nThe Department of Government Efficiency ladies and gentlemen",
                "\"Tells\"?\n\nYou fired them. You *ask*.",
                "CDC *begs* fired employees to come back to work. FTFY",
                "Why?  Why would you go back to work?  You know maybe next week, for no reason whatsoever, you might just get fired again.  Go find a more stable job elsewhere.  I hear China is hiring.",
                "You know how much loyalty you owe an employer that terminated you on a whim?\n\nNot an ounce.",
                "\"Return to work? Termination rescinded?\" I don't think so.\n\n\"I was Terminated. now you want to re-hire me. This will require a re-negotiation of my salary. I have not seen a fair cost of living increase in years. \" - is what each and every VICTIM OF DOGE should say."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "China says it is ready for 'any type of war' with US",
            "external_url": "https://www.bbc.co.uk/news/articles/c4gmd3g2nzqo.amp",
            "upvotes": 5874,
            "date": "03/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/00c6/live/68e23460-f9d5-11ef-8c03-7dfdbeeb2526.jpg",
            "top_comments": [
                "\"Older men declare war. But it is youth that must fight and die.\" \n-Herbert Hoover ",
                "\"Trump will scare dictators off with his strength\" - MAGA during the 2024 election season",
                "Break dancing followed by a rap battle?",
                "Just great stuff you love to see, and I haven't been to the grocery store but I must assume eggs have gone down in price",
                "If China declared war on the USA, Trump would ask what’s in it for him, and leave for Russia.",
                "Well good thing we found the most incompetent people running all aspects of the government then.",
                "Well, they might be right since the USA just essentially told all their allies to fuck off... They might not have any help.",
                "I think a lot of people do not understand the way trade wars can become or contribute to real wars. \n\nSarah Paine, I believe she said that the US oil embargo of Japan was the real starting point of the pacific conflict in WW2. She’s a top flight historian all over YouTube now and she’s a great lecturer. \n\nYou start waving swords, people will start planning bad outcomes.",
                "Can we please not go to war?  We need to restore that concept to an amendment to the Constitution that said war gets put to a national vote and the people that vote for it immediately get put into a draft.",
                "The US is eager to toss Europe, Canada, and Mexico under the bus so the US can lose a war to China while Russia gives us a thumbs up and laughs at the US with China. \n\nWe’re a bull tricked into charging a wall."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "Boy kidnapped by mother for 7 years found in Colorado: Police",
            "external_url": "https://abcnews.go.com/US/boy-kidnapped-mother-7-years-found-colorado-police/story?id=119487753",
            "upvotes": 892,
            "date": "03/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c102dada-d793-44df-b147-8d89a4594f9f/rabia-khalid-main-ht-jt-250305_1741212848697_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "That’s kinda how I grew up. Except my mom married a jarhead and hid me in Hawai‘i. I didn’t find out until early adulthood.",
                "Whoa, that’s a happy ending, nice. But what’s up with her current husband, \n\n“The other adult was identified as 42-year-old Elliot Blake Bourgeois, who is Khalid’s husband, but not the boy’s father. Both Khalid and Bourgeois were arrested and charged with second degree kidnapping, forgery, identity theft, providing false information to authorities and trespassing, the sheriff’s department said.”\n\nElliott Blake Bourgeois looks like someone stole his Pokémon characters.",
                "This whole story is in an episode of Unsolved Mysteries on Netflix. This woman is definitely the “bad guy.” She was unhinged from the beginning, failed to show up to a custody hearing and disappeared with the son. The father has been looking for him for 7 years.",
                "I wish I could hear the child pov on events.\n\nGrateful with his dad for rescue, or bitter at his dad for destroying his mom's life?",
                "These are the type of people who live in Douglas County, CO. Fuck Douglas County CO",
                "She kinda resembles Ashley Judd. *Kinda*.",
                "Kinda like what happened to some ppl in my life. The kids are super fucked up now, but their c*nt is/was happy.",
                "I wonder how something like this is resolved. It sounds like both the boy and girl were well taken care of, and now the son will be taken away from the only parent he knows, and given to his father. Divorce custody hearings are so unfair, it should really start at 50/50 so no one feels like they have to flee to protect their children.",
                "That's not kidnapping or newsworthy"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Political poll news site 538 to close amid larger shuttering across ABC and Disney",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/05/abc-news-538-shut-down",
            "upvotes": 13211,
            "date": "03/05/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6c1a8889b7ac4bae2cadb7e884b80cb6ee9948d5/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8e202632038d7d38a3df642de6fd4c07",
            "top_comments": [
                "&gt;The broader media landscape has been hit with mass layoffs seemingly nonstop for months. Last month, MSNBC announced a massive shakeup at the network that included letting go of Joy Reid and her production team, as well as no longer using the Spanish-language network Telemundo.\n\nSetting aside any questions about former 538 head Nate Silver, it sucks to lose a valuable source for political polling and data analysis.  I hope the talented people there find new work.",
                "Wait but what about Galen Druke??? HE’S MY BOY",
                "How am I going to get my hopes up only to be woefully disappointed now?!",
                "Is the podcast getting axed also?",
                "I stopped obsessing over horserace polling after 2016 but still a shame. I liked their podcast and articles.",
                "Truth Social to soon come out with polling data that always shows Trump favored by 99%",
                "Coincidentally, they chose to shutter 538 the day after it started showing that Trump had negative approval in the aggregate.",
                "Nate Silver was removed over a year ago. Didn't really make sense to try to keep using his branding without him there.",
                "I don't give a shit about polls, but there's been a weird sudden shutdown of media. They weren't nice to Trump last time, now they're immediately handing him settlement money and are crickets quiet about his madness and ineptitude. Something is rotten.",
                "You don’t need an election monitoring site if you no longer plan on having elections."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Jack Daniel's maker says Canada taking bottles off shelves 'worse than tariffs'",
            "external_url": "https://www.bbc.com/news/articles/cn0422zzpw8o",
            "upvotes": 1323,
            "date": "03/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d82c/live/440a81d0-fa7d-11ef-8ae1-1f8b4aca4e93.jpg",
            "top_comments": [
                "\"it's worse because it affects me\" is basically the conservative maxim.",
                "As an American I 100% support this. Not only because Trump is a jackass, but because Jack Daniel’s Old No. 7 is horse piss and the fact that it is synonymous with American whiskey is a tragedy.",
                "Whatever their complaints are, I can guarantee threats of annexation are worse.\n\nGo cry in your piss whiskey.",
                "'Brown-Forman boss Lawson Whiting said the Canadian response was \"disproportionate\" to the 25% levies on Canadian goods imposed by the Trump administration.  \n...  \nNevertheless, Mr Whiting said Canada makes up only 1% of Brown-Forman's total sales, so the firm can withstand the hit.'\n\nSo the guy is complaining that the Canadian response is disproportionate because it will affect 1% of it's sale instead of 0.25% while the States tries to tank the entire Canadian economy. Cry me a fucking river.",
                "Fuck off. Go fire your president",
                "Maybe Jack Daniels maker should start using their voice to decry the insanity of Trump's tariffs, fucking pathetic Republican cunt.",
                "We removed US alcohol from our shops because your government initiated a trade war with the intent of crippling our economy and annexing our country as \"the 51st state.' All y'all are not our friends and we do not feel a shred of sympathy for you.\n\nTime to act like a real country, America. This tin pot dictator look isn't a good one.",
                "Oh no, actions have consequences?!?!",
                "“But Kamala is worse” ~ them, probably",
                "Guess what Jack.  Those customers are NEVER coming back.\n\nCanadian whiskey is plentiful.  And blue states, like Washington State, have many fine distilleries making fabulous bourbon and rye."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US employers cut more jobs last month than any February since 2009",
            "external_url": "https://www.cnn.com/2025/03/06/economy/us-jobs-report-february-preview/index.html?utm_medium=social&amp;utm_source=igCNN&amp;utm_content=2025-03-06T12%3A59%3A28",
            "upvotes": 5093,
            "date": "03/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2203083579.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "That includes Musk and Trump firing tons of federal employees. \n\nTrump recession sucks.",
                "The Trumpcession is pulling into station.",
                "Republicans SUCK. Each time they are in power they ruin the economy.",
                "It will take a full two months to feel the real effects of trump's compromised positions. Consumer spending (2/3's of the US economy) will fall off a cliff right in time for spring retail stock and inventory positioning. Things are going to grind to a halt and companies will be back in a 2021/2 position and cash-poor/inventory-heavy. It's going to be a disgusting economy for a long time.",
                "inb4 \"And here's why this is Biden's fault even though there have been dramatic changes to both actual government policy and the perception of it since November, and especially since January.\"",
                "So much winning, right?\n\nJust like they view the COVID deaths as a high score to beat, conservatives view the 2008 crash as a high score of economic damage - but they'll beat that one soon, too.\n\nNobody hates America like conservative fake patriots.",
                "How is this saving the government money or in anyway efficient? Won't all these laid off workers apply for unemployment and other social safety programs?",
                "Tomorrow's job report is almost certainly going to be bad news for Republicans, though I fully expect them to continue to blame Biden for it.",
                "And we're just getting warmed up!",
                "Hey, remember last time around when all the MAGAs were blaming the unemployment rate on Democrats and COVID restrictions?\n\nHow are things going now?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Six people arrested in Romania for treason over alleged negotiations with Russian agents to leave NATO",
            "external_url": "https://www.g4media.ro/six-people-arrested-in-romania-for-treason-over-alleged-negotiations-with-russian-agents-to-leave-nato.html",
            "upvotes": 8025,
            "date": "03/06/2025",
            "thumbnail": "https://cdn.g4media.ro/wp-content/uploads/2022/01/Radu-Theodoru.jpg",
            "top_comments": [
                "Romania seemingly not that nostalgic about the \"good\" old days.",
                "Hey, look a country that doesn’t suck off Putin. I remember when America was like that.",
                "Good job Romania, keep fighting for freedom.",
                "For the life of me, I would never understand why the Russian government focus on improving their own country instead of bringing down others to their level. The largest country in the world and the richest in natural resources.",
                "How does Russia have so much pull on so many? Are this many people willing to sell out for a few bucks?\n\n\nNevermind, I don’t think I want to know…",
                "Give us 5hrs until the 🍊man will get angry about it.",
                "It gets funnier the more you read it:\n\n\n&gt;\tAmong the suspects is Radu Theodoru, a retired Romanian general, aged 101, known for his violently antisemitic publications",
                "Republicans, tell us again Trump isn't under Russian influence as he keeps taking those undocumented calls direct from Putin, violating the presidential records act. And calling to leave NATO, what a coincidence.",
                "Romanians are the type to drag dictators out into the street, give them a quick “trial” and kill them. Good for them.",
                "101 years old. Why are all these old fucks insane? Why do they still hold influence?\n\nI'm beginning to see a disturbing pattern"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "‘Read this email immediately’: CDC tells about 180 fired employees to come back to work",
            "external_url": "https://apnews.com/article/cdc-reinstatements-c1f0b33d677e5a02a4df1210b82ca930",
            "upvotes": 19992,
            "date": "03/06/2025",
            "thumbnail": "https://dims.apnews.com/dims4/default/977c96f/2147483647/strip/true/crop/3300x1856+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2Ff3%2Fc28219f311c09b7e59b5e82de64f%2Fcb1cfaf434544ae0bb7daf1919f6a315",
            "top_comments": [
                "You mean emails in accounts they were locked out of?",
                "Ladies and Gentlemen, the Department of Government Efficiency.",
                "&gt; “You should return to duty under your previous work schedule,” it said. “We apologize for any disruption that this may have caused.”\n\n**MAY** have caused?  Do you think firing people, then asking them to come back two weeks later MIGHT have caused some disruption?  Like, you're not certain?",
                "What a shit show this administration is",
                "&gt; You’re fired. You’re hired. No more remote working. Write me an email and tell me what you do. Actually just kidding you don’t have to, but also if you don’t, You’re fired. Ok You’re fired. Wait, please come back. \n\nThe Department of Government Efficiency ladies and gentlemen",
                "\"Tells\"?\n\nYou fired them. You *ask*.",
                "CDC *begs* fired employees to come back to work. FTFY",
                "Why?  Why would you go back to work?  You know maybe next week, for no reason whatsoever, you might just get fired again.  Go find a more stable job elsewhere.  I hear China is hiring.",
                "You know how much loyalty you owe an employer that terminated you on a whim?\n\nNot an ounce.",
                "\"Return to work? Termination rescinded?\" I don't think so.\n\n\"I was Terminated. now you want to re-hire me. This will require a re-negotiation of my salary. I have not seen a fair cost of living increase in years. \" - is what each and every VICTIM OF DOGE should say."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Amazon Boycott Begins Friday, Includes Whole Foods, Prime, Twitch",
            "external_url": "https://www.cnet.com/tech/economic-blackout-asks-you-to-boycott-amazon-for-a-week/",
            "upvotes": 9232,
            "date": "03/06/2025",
            "thumbnail": "https://www.cnet.com/a/img/resize/54cc0d7481c3b4ba6cd1b5d7865f11c43feb1e75/hub/2024/09/30/ab904444-01d1-4d43-b94b-8d091f7ef01e/amazon-box-foreground.jpg?auto=webp&fit=crop&height=675&width=1200",
            "top_comments": [
                "I hope people who are just beginning the boycotts realize they can just remove these out of their lives as they become used to living without them. Why go back? Don't.",
                "Jokes on them , I'm broke and can't afford it anyway",
                "Great time for people in the US to curve their over consumption habits in preparation for all the tariffs\n.",
                "Reddit uses AWS\n\nhttps://www.datacenterdynamics.com/en/news/reddit-uses-aws-and-google-cloud-plans-to-spend-at-least-385m-on-cloud-by-september-2026/",
                "Why cant we boycott things all at the same time",
                "Havent had prime for 2-3 years now and it hasnt made my life harder at all.\n\nMaybe bought a handful of things in that time  when it wasn't offered elsewhere but that is pretty much it. The other stores (costco) always come in clutch.\n\nTheir shipping back then was also frustrating... I'd buy books back then that arrived in a thin plastic mailer all bent out of shape. Which was weird cause of how amazon began. Target did sooo much better maintaining the book's condition.\n\nTheir physical media often arrived dented or broken, their quality of CS dropped etc etc.\n\nThey also somehow made whole foods worse.\n\n  \nNo the $35 for free shipping prevents me from impulse buys :)\n\n  \nAnd after the last few stunts of Jeff I always try elsewhere first.",
                "I would like to remind anyone not cancelling their prime account to go use your twitch prime on a creator, any creator. It forces Amazon/twitch to pay your chosen creator out of their own pocket on a monthly basis, and is one of Twitch’s biggest loss items",
                "Remember when people said they weren't going to use Netflix after the price hike (and for the password sharing thing) and the company actually saw positive growth? It's hard to take these things seriously. I'm curious if an actual boycott of a \"TBTF\" business has ever had a modicum of success. ",
                "i saw someone say 40 day target boycott and honestly people still don't seem to get it. if you live somewhere that you have another option, take it. 40 days is literally nothing. \n\nblack americans were boycotting busses for a full fucking year, if you have the ability, go to your local latino markets, asian markets, go in with a neighbor and get a costco membership if you have to ( you can have 2 people on one membership, 1 owner and a secondary member) \n\n(ps before anyone starts yelling about \"some of us its far/don't have transport/can't afford it\" then did it seem like i was talking to you when i said \"if you have the means\"?)",
                "What’s everyone’s alternative besides Costco? I don’t live anywhere near a Costco."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "House Speaker Mike Johnson's chief of staff arrested on DUI charge after Trump speech",
            "external_url": "https://www.nbcnews.com/politics/congress/speaker-mike-johnson-chief-staff-arrested-dui-charge-trump-speech-rcna194986",
            "upvotes": 23452,
            "date": "03/05/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250303-mike-johnson-vl-1116a-90e2c1.jpg",
            "top_comments": [
                "These DUI hires, I tell ya",
                "That’ll be an interesting “what did you do this week” bullet",
                "Is there any way to FOIA the body cam footage? I bet this guy tried the ' No, you can't. I work for-\" defense.",
                "&gt;A Johnson spokesman said the speaker is standing by his chief of staff and \"has full faith and confidence\" in him.\n\n\nmy man you cannot be this spineless to your blundering henchmen",
                "I guarantee that if it has be the chief of staff for a Democrat the GOP would have been calling on said Democrat to resign for having such poor judgement in who they employed...",
                "I’d be a heavy drinker too if I sold out my country and values.",
                "The party of family values, everyone",
                "My only question - celebrating or drowning his sorrows?",
                "*No one* should be driving drunk. There's no -- zero -- excuse for that with ride shares and taxis existing, and there being a huge crowd there, some of whom would undoubtedly have given him a ride just for the asking if he was at the speech. Heck, I'd give an opposing party member a ride to keep them and others safe. \n\nThat said, he is not the only person who wanted to have a few too many after Trump's performance.",
                "How much do you want to bet he dropped the \"Do you know who I am?\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Political poll news site 538 to close amid larger shuttering across ABC and Disney",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/05/abc-news-538-shut-down",
            "upvotes": 13213,
            "date": "03/05/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6c1a8889b7ac4bae2cadb7e884b80cb6ee9948d5/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8e202632038d7d38a3df642de6fd4c07",
            "top_comments": [
                "&gt;The broader media landscape has been hit with mass layoffs seemingly nonstop for months. Last month, MSNBC announced a massive shakeup at the network that included letting go of Joy Reid and her production team, as well as no longer using the Spanish-language network Telemundo.\n\nSetting aside any questions about former 538 head Nate Silver, it sucks to lose a valuable source for political polling and data analysis.  I hope the talented people there find new work.",
                "Wait but what about Galen Druke??? HE’S MY BOY",
                "How am I going to get my hopes up only to be woefully disappointed now?!",
                "Is the podcast getting axed also?",
                "I stopped obsessing over horserace polling after 2016 but still a shame. I liked their podcast and articles.",
                "Truth Social to soon come out with polling data that always shows Trump favored by 99%",
                "Coincidentally, they chose to shutter 538 the day after it started showing that Trump had negative approval in the aggregate.",
                "Nate Silver was removed over a year ago. Didn't really make sense to try to keep using his branding without him there.",
                "I don't give a shit about polls, but there's been a weird sudden shutdown of media. They weren't nice to Trump last time, now they're immediately handing him settlement money and are crickets quiet about his madness and ineptitude. Something is rotten.",
                "You don’t need an election monitoring site if you no longer plan on having elections."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "China says it is ready for 'any type of war' with US",
            "external_url": "https://www.bbc.co.uk/news/articles/c4gmd3g2nzqo.amp",
            "upvotes": 5874,
            "date": "03/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/00c6/live/68e23460-f9d5-11ef-8c03-7dfdbeeb2526.jpg",
            "top_comments": [
                "\"Older men declare war. But it is youth that must fight and die.\" \n-Herbert Hoover ",
                "\"Trump will scare dictators off with his strength\" - MAGA during the 2024 election season",
                "Break dancing followed by a rap battle?",
                "Just great stuff you love to see, and I haven't been to the grocery store but I must assume eggs have gone down in price",
                "If China declared war on the USA, Trump would ask what’s in it for him, and leave for Russia.",
                "Well good thing we found the most incompetent people running all aspects of the government then.",
                "Well, they might be right since the USA just essentially told all their allies to fuck off... They might not have any help.",
                "I think a lot of people do not understand the way trade wars can become or contribute to real wars. \n\nSarah Paine, I believe she said that the US oil embargo of Japan was the real starting point of the pacific conflict in WW2. She’s a top flight historian all over YouTube now and she’s a great lecturer. \n\nYou start waving swords, people will start planning bad outcomes.",
                "Can we please not go to war?  We need to restore that concept to an amendment to the Constitution that said war gets put to a national vote and the people that vote for it immediately get put into a draft.",
                "The US is eager to toss Europe, Canada, and Mexico under the bus so the US can lose a war to China while Russia gives us a thumbs up and laughs at the US with China. \n\nWe’re a bull tricked into charging a wall."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Three friends were found dead last year after watching a Chiefs game. Now, 2 men face charges in the case",
            "external_url": "https://www.cnn.com/2025/03/06/us/kansas-city-deaths-chiefs-fans-hnk?cid=external-feeds_iluminar_yahoo",
            "upvotes": 625,
            "date": "03/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/240125172228-kc-chiefs-fans-deaths-1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Wow, it took a year to get the evidence to arrest the guy everyone thought did it the second they heard he lived in the house for a couple days with three corpses in his backyard?",
                "Great police work, man.  Takes them a year to get charges on this?  Good lord.  You never know if stuff has been laced with something.  Regardless, how do you not know that there are 3 dead bodies in your backyard for 2 days?",
                "“Uh, I didn’t know there were dead people in my back yard.”\n\nRight.\n\nNow for everyone eviscerating the police, you don’t understand the criminal justice system. If you rush into charging someone, you risk going to court unprepared. Because if you charge, you have a set amount of time before you have to go to court. If you go to court unprepared, you risk losing the case and these jackasses walk. Toxicology takes time. You have to interview witnesses. There’s a LOT to consider. You wait until you believe your case is bulletproof, or at least your chance of winning is maxed out, then you charge.\n\nJust as a fraud investigator, I see a shit ton of cases where “that’s motherfucker is obviously guilty,” and the case drags on before charges are brought. I’ve worked on stuff that’s literally gone on for five years. It’s not usually on the police. The AGs or AUSAs that don’t want to take on a case where there’s a higher chance of losing.\n\nThe other side of this is that it’s almost certainly going to get pled down to something like reckless endangerment or whatever and these guys will do two years or something. They charged the highest thing they could upfront to get pressure and a headline.",
                "Doing cocaine to watch a football game is not something I honestly ever considered.",
                "Wait so the dude is being charged because his coke was tainted resulting in three of their deaths?",
                "Can’t tell you how many episodes of forensic files there are where the police just suck so bad at their jobs that it takes decades and one half decent detective to solve a case.",
                "I still don't understand how/why they all died outside.",
                "I have to say, if 3 people go out of their way to buy drugs that are known to be dangerous and overdose, I don’t think that should be considered murder for those who supplied the drugs. They should get charged with selling drugs, sure.",
                "[removed]",
                "They don’t have the evidence for this case it’ll go no where"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "South Korea: Fifteen hurt after fighter jets drop bombs due to human error",
            "external_url": "https://www.bbc.com/news/articles/c2ernge8193o.amp",
            "upvotes": 343,
            "date": "03/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/216e/live/e439c260-fa46-11ef-86ff-f583a2c90fa2.jpg",
            "top_comments": [
                "Every now and then the lyrics to 99 Red Balloons feel a bit too relevant again.",
                "&gt;The incident involving the Air Force KF-16 aircraft, in the city of Pocheon near North Korea, was part of routine drills held by the South to maintain combat readiness against potential attacks from the North.\n\nReads like the military equivalent of shooting yourself at the firing range.",
                "- Pilot 2: Soooo what are you thinking about? You've been so distant lately. \n\n\n- Pilot 1: Dude, drop it. \n\n\n- Pilot 2: Why?? I care and somethings up. \n\n\n- Pilot 1: Dude I said fucking drop it!\n\n\n- Pilot 3: Wait why are we dropping it?? \n\n\n- Pilot 2: He said to drop it! \n\n\n- Pilot 1: Drop it? \n\n\n- Pilot 3: Drops ordinance",
                "Redirect those to Ukraine and drop them on some Russians",
                "When you call cleared hot instead of continue dry"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "03/06/2025 15:34:13 UTC"
}