{
    "posts": [
        {
            "category": "HOT",
            "title": "French actor Gerard Depardieu found guilty of sexually assaulting two women",
            "external_url": "https://news.sky.com/story/gerard-depardieu-found-guilty-of-sexual-assault-13367002",
            "upvotes": 1533,
            "date": "05/13/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-gerard-depardieu-trial_6867262.jpg?20250326091431",
            "top_comments": [
                "This man is such a disgusting, vile pig.",
                "Reminder: multiple French celebrities said he shouldn't face trial because he made some great films.\n\n[https://variety.com/2023/film/news/french-stars-defend-gerard-depardieu-open-letter-1235850631/](https://variety.com/2023/film/news/french-stars-defend-gerard-depardieu-open-letter-1235850631/)\n\nMacron himself said this only last December:\n\n>\"I’ll say it as France’s president but also as a citizen, he makes France proud.\"",
                "Noooo...he just looks and sounds like the person you'd most expect. \n\nPlus he did some real weird shit with his daughter on vacation once. Pretended to be her lover. What a creep.",
                "Away from the court, Ms Diebolt told Sky News that, after years of being tolerated due to his fame, Depardieu was finally being held accountable for his actions.\n\n\"These women were put in danger,\" she said. \"This is about a line of offences that he committed over many years that were tolerated by the world of cinema because it was Gerard Depardieu.\n\n\"Because the financial benefits he brings to the industry are so substantial. He did make some excellent films, but all men are equal before the law.\n\n\"Nobody warned Amelie about Depardieu's behaviour, so his words and actions came as a terrible surprise for her. She still has traumatic flashbacks.\"\n\nDepardieu's reputation is now in tatters, and there may be more allegations to come.\n\nDiebolt told Sky News that around 20 other women have said that they were attacked by the actor.\n\nAnd we already know that Depardieu will stand trial again later this year, this time charged with raping the actress Charlotte Arnould.\n\nMs Arnould has accused Depardieu, a friend of her parents, of raping her at his mansion in Paris",
                "What a giant fucking turd.",
                "Isnt he a roomate with Steven \"The Whale\" Seagal in Russia?",
                "Another putin's friend is a scam, what a coincidence.",
                "That sentence is a disgrace",
                "Never liked this dude. Always had a creepy vibe.",
                "In Russia he will get a medal for that, as Russian occupants do"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Episcopal Church refuses to resettle white Afrikaners, citing moral opposition",
            "external_url": "https://www.npr.org/2025/05/12/g-s1-65988/episcopal-church-white-afrikaners-ends-partnership-u-s-government",
            "upvotes": 9095,
            "date": "05/12/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8640x4860+0+450/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbe%2F34%2F1b1627bb47cabd2e3be01911d780%2Fap25079502278892.jpg",
            "top_comments": [
                "Last week I'm agreeing with a Pope and this week I'm with an Episcopal church.  Weird couple of weeks as an atheist.",
                "It is refreshing to see some Christians actually following their faith.",
                "It's outrageous our tax dollars were spent to bring these people here.  What a waste of resources.",
                "Trump isn't hiding who and what he is.",
                "Episcopalians do what Republicans can't.",
                "> Q: There are many people who fit the criteria of fleeing persecution. Afghans for example. But they're being denied refugee status. So why such an exception for the Afrikaners?\n\n> TRUMP ADMIN OFFICIAL: One of the criteria is making sure they can be assimilated easily into our country\n\nIt’s just racism. That’s it. \n\nSource: https://bsky.app/profile/atrupar.com/post/3loym4e3uts23",
                "The Episcopal Church is not a part of the evangelical wing of Christian denominations. They are on the progress side and emphasizes helping the needy and bringing people together to do good. I have a friend who's a priest in the church and as an atheist I respect her work very much.",
                "Bringing white south afrikaners here is just trump DEI policies benefiting people who historically benefited from racism, and largely still do.\nAnd don't the white people in South Africa still own the majority of the land in South Africa? Land they stole from the ancestors the people that the trump administration is trying to paint as viEurope.\n\n MAYBE the European South afrikaners should go back to europe.",
                "neither are the Lutherans but that's just cuz they got all their resettlement funding yanked week 1",
                "how are white South Africans refugees?"
            ],
            "aggregate_sentiment": 13.0
        },
        {
            "category": "HOT",
            "title": "Taliban adds chess to ever-growing list of things banned in Afghanistan",
            "external_url": "https://globalnews.ca/news/11175560/taliban-chess-banned-afghanistan/",
            "upvotes": 4811,
            "date": "05/12/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/05/GettyImages-1241640843.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "Someone high up in the Taliban lost a game to one of the kids they were molesting.",
                "Robin Williams had a joke that went like:\n\nYou can’t bomb the Taliban back to the Stone Age because they’ll go, “Oh! Upgrade!”",
                "just outlaw thinking and get it over with. ",
                "Some dude lost to a woman in chess, huh",
                "It’s wild that they banned chess, especially considering how deep its roots are in the Islamic world. \n\nWhile the game originated in India (as chaturanga), it was the Islamic Golden Age that helped spread and refine it across the Middle East, North Africa, and eventually into Europe. Scholars, caliphs, and poets all engaged with chess—not just as entertainment, but as a symbol of intellect and strategy. There are even surviving manuscripts from medieval Islamic scholars analyzing chess theory. In some courts, being good at chess was a mark of education and refinement. \n\nBanning it under the idea that it’s “un-Islamic” is completely ahistorical—it’s like banning algebra because it’s not “aligned with sharia,” even though al-jabr (algebra) literally came from Muslim mathematicians.",
                "Some of the other things recently banned in Afghanistan, as mentioned in the article:  \n\n\n>The move to ban chess comes just months after the Taliban banned free fighting, such as mixed martial arts, saying it was not aligned with sharia (Islamic law) and was too “violent.” The banning of MMA followed a 2021 law that prohibited “face-punching.”\n\n>Last October, the Taliban issued a decree that [prohibits women from praying aloud](https://globalnews.ca/news/10841150/taliban-women-morality-laws-praying-voices/) or reciting the Qur’an in each other’s presence. Two months earlier, in August 2024, they issued laws [making it mandatory](https://globalnews.ca/news/10712505/taliban-bans-womens-voices-faces-laws/) for women to veil their entire bodies, including their faces, at all times in public. Women were also forbidden from singing, reciting and reading aloud in public, as a woman’s voice is deemed “intimate” and should not be heard.\n\n>Women are already excluded from education after sixth grade, many public spaces and most jobs. They are also prohibited from looking at men they are not related to by blood or marriage.",
                "When you are so fkn miserable you have to make sure everyone is else too.",
                "That's just fucking embarrassing for the Taliban",
                "Why are they even bothered to be alive they seem to want to ban everything I don't get why they continue to exist.",
                "Chess involves forward thinking, strategy, and trying to figure out your opponents next move. Of course they wouldn't want that."
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "HOT",
            "title": "Olympic gold medalist, NCAA champion wrestler arrested in prostitution sting",
            "external_url": "https://www.pennlive.com/sports/2025/05/olympic-gold-medalist-ncaa-champion-wrestler-arrested-in-prostitution-sting.html",
            "upvotes": 8098,
            "date": "05/12/2025",
            "thumbnail": "https://www.pennlive.com/resizer/v2/LOD43AX2ZBAAJJ2YFZLUHRX77U.jpg?auth=c9155d8d33782c20a9b1aa1c78e2b7adfc9a3bd2c2c3387432ea8a312e510033&width=1280&quality=90",
            "top_comments": [
                "> According to the news station, Snyder allegedly started calling and texting about an ad for prostitution. He is accused of meeting at a hotel with an undercover officer, exchanging cash and requesting a sexual act.\n\nWow, great job everyone. You caught him! Resources well spent. Another violent criminal off the streets. \n\nNow if you’ll excuse me, I’m off to watch another video on pornhub where this exact scenario is legal as long as it’s filmed!",
                "He just tried to pay money for a prostitute. I’m sure a problem for his wife and a problem for his Christian camp affiliations but not a problem for me",
                "Damn even an Olympic champion can’t get laid naturally. Guess I’ll just stick to my left hand",
                "Doesn't sound like anything worth taxpayer money or publication. Only unfortunate detail:\n\n>Kyle Snyder is married to former Syracuse soccer player Maddie Pack Snyder.   \n\nAnd one I'm ambivalent about:\n \n> Snyder also holds a summer camp at Messiah University -- a private Christian School in Mechanicsburg, Pennsylvania. The camp is slated to be held June 20-23.",
                "Consensual sex with a grown adult? FOR SHAME",
                "Probably just wanted to practice some new holds",
                "Shoulda used campaign funds to pay for it then it would have been legal apparently?",
                "Prostitution is a human inevitability. The concept is a constant throughout human history and developed in multiple, separate, and exclusive civilizations. \n\nIt will never stop. It will never go away. \n\nLegalize it and allow these individuals to be treated like any other business. Cut the shit.",
                "Instead of catching adults having sex with each other for money, they should focus on catching adults who mess with children",
                "I feel so much safer now, good job cops."
            ],
            "aggregate_sentiment": 68.0
        },
        {
            "category": "HOT",
            "title": "UnitedHealth suspends annual forecast, CEO Andrew Witty steps down",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/unitedhealth-ceo-andrew-witty-steps-down-2025-05-13/",
            "upvotes": 391,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "My company recently moved insurance from Blue Cross/Blue Shield over to this hot mess. Man, when I tell ya…absolutely *dog shit* insurance company. We went from pretty good coverage to them nickel and diming over everything. Would strongly advise to stay away from UnitedHealth.",
                "In simple terms, my rates are going up, big time",
                "I hope UnitedHealth continues to go under. Awful company. Their denial rate is 2x that of the industry average. Total scam of a company",
                "I never buy personal reasons.  Had a few people leave my company like that.  One cared way too much and it showed as she was doing her two weeks.  She finally told us it was a silent layoff.  Our boss left for personal reasons with no job at the same time.  \n\nShit is going sideways after the shooting and this guy either wasnt doing what he needed/asked to do or he just fucked it all up and the board said time to go.  \n\nHe could have something personal too.  He’s human.  But with the other stuff.  Seems like board asked him to leave.",
                "Sounds like fall out from the lawsuit. Good thing stockholders get taken care of. God forbid someone does anything to prevent another CEO being killed. All about those dollar bills.",
                "Sorry we weren’t able to completely screw over our customers to enrich our shareholders. Edit: a word",
                "[Understanding the Change Healthcare Breach and Its Impact on Security Compliance](https://hyperproof.io/resource/understanding-the-change-healthcare-breach/)\n\nIn short, quite possibly the largest healthcare data breach in history occurred under his watch.",
                "I hope they’re all terrified. These monsters deserve to feel unsafe. They willingly murder people by withholding services. It’s beyond ridiculous and it has to change.",
                "CEO worried he might be next?",
                "Once your on that little piece of land in Nantucket I suppose you're gonna take off than fancy looking health insurance CEO uniform huh? Yeah that's what I thought, that I can't abide"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Federal judge won’t block Trump’s plan to use IRS data to track down undocumented migrants",
            "external_url": "https://www.cnn.com/2025/05/12/politics/judge-wont-block-irs-data-sharing-track-undocumented-migrants",
            "upvotes": 3127,
            "date": "05/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-20t181645z-962444936-rc2hycat9wtc-rtrmadp-3-usa-trump-irs.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Literally telling immigrants to not pay taxes.",
                "But wait, one of their big things is \"immigrants don't pay taxes.\" Why would there be records at the IRS?",
                "This is very likely to get overturned on appeal by the DC Circuit if it makes it to non-Trump judges, both Republican and Democrat judges. The privacy laws of the tax code are pretty damn solid in what can be disclosed.",
                "Trump et al. said undocumented immigrants don't pay taxes. Just another con.",
                "I did taxes. If the axiom of \"the IRS doesn't care how you get money as long as you pay them\" no longer holds true, then shit's gonna crumble.",
                "You mean someone's paying them to work?",
                "So they are going to forgo $96 BILLION in taxes to maybe deport a few thousand TAX-PAYING undocumented workers? A few of whom might be accused criminal activity? \n\nGreat. Sounds very fiscally responsible. ",
                "They are tracking us ALL down",
                "To be clear, this will prevent immigrants from paying any form of taxes which in turn will mean even less money into Social Security which they are net payers to because they can't take anything out.",
                "And for some reasons we can't see his tax records."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Georgia become second US state to shield maker of Roundup weed killer from some cancer claims",
            "external_url": "https://apnews.com/article/bayer-roundup-weed-killer-pesticides-cancer-lawsuits-02020b62e2c0affbeccf464677fec871",
            "upvotes": 13208,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "FYI, the other state is North Dakota",
                ">Bayer insists glyphosate is safe. But it has stopped using the ingredient in its residential version of Roundup and has set aside $16 billion to settle cases. It continues to use glyphosate in its agricultural version of Roundup but has warned that it might have to stop doing so if the legal costs keep mounting.\n\nDoesn't sound like it's safe to me.",
                "We don't need to be giving giant companies shields like that. We also don't need a jury deciding what causes cancer when the scientific results aren't there.",
                "Georgia is also the state where prosecutors have absolute immunity. If they lie or break the law to convict you, they face no consequences whatsoever and cannot be sued for their misconduct. I feel terrible for people stuck there with MTG",
                "Bayer is the beneficiary. Bayer is not a farmer. \n\n> The new law “demonstrates that Georgia stands with its farmers, who work tirelessly to produce safe and affordable food,” said Brian Naber, president of Bayer’s crop sciences in North America, Australia and New Zealand.",
                "As a Georgian, this tracks for Kemp. \n\nThis verdict on the heels of the golf course study last week is insane.  It showed a huge increase in Parkinson’s in people living or working in close proximity to golf courses. Perhaps chemicals sprayed onto grass year round isn’t ideal…",
                "Georgia becomes second state to give Monsanto immunity.",
                "In the landscaping business we thought we knew that when Roundup was banned in France, the bees came back.  But when I went to go look that up all I could find was clouds and clouds of professionally planted disinformation.\n\nSo I still believe it.",
                "Why is everybody freaking out over unsubstantiated dubious cancer claims rather than the widespread ecosystem damage that's well known and understood? Like if you're going to hate it please learn to hate it for the right reasons.",
                "Save corporations from responsibility."
            ],
            "aggregate_sentiment": 63.0
        },
        {
            "category": "HOT",
            "title": "Possible anchoring failure leaves 3 climbers dead in Washington state",
            "external_url": "https://www.cnn.com/2025/05/12/us/north-cascades-climbers-death",
            "upvotes": 1322,
            "date": "05/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/496263129-1102854608546908-5906308397723621896-n.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "*Article Text:*\n\nThree people died and one other person was able to free themself during a climbing accident in Washington state, authorities said Monday.\n\nAuthorities responded to the scene Sunday as the victims had fallen “while descending a steep gully” in the North Cascades, the Okanogan County Sheriff’s Office said. Authorities said they believe a part of their anchoring system failed.\n\n“Three individuals were confirmed deceased at the accident site. The fourth member of the party self-extricated and contacted law enforcement,” the Okanogan County Sheriff’s Office said of the four climbers from Renton.\n\nThose killed were ages 36, 47 and 63, according to the office.\n\n“The presumed cause of the accident is an anchor failure while rappelling, with more investigation still ongoing,” the sheriff’s office added.\n\nThe climbers were in the area of North Early Winters Spire when the accident occurred, authorities said. The site is about 16 miles west of Mazama.",
                "*A fourth climber sustained internal bleeding and a traumatic brain injury in the fall, but survived. He walked back to the trailhead just east of Washington Pass and drove to Newhalem, where he used a pay phone to call 911 at about 11:30 a.m. Sunday.*\n\nImagine if all 4 lived through the failure, and none could walk to the trailhead and then drive to the pay phone. Actually, it's possible one or two were still alive but died because of no cell coverage in the mountains.",
                "Damn a rap anchor failed. Scary shit",
                "Not experienced with ropes in the mountains. Wouldn’t only one person be on the rope at a time? And I suppose a belayer maybe also somehow attached to the failure. \n\nBut then how could 3 of them have died because of an anchor failure?",
                "Damn, that sucks.\n\nJust goes to show that any mountain can be deadly if your luck or preparation are bad enough. Safety in mountaineering is nothing to take lightly.",
                "Any details of the mountain/route?  The only one in that area I’m familiar with is Shuksan.",
                "Rock climbing isn’t all that dangerous until it is, and then it’s usually fatal. Repelling even more so.",
                "If anyone wants to know more about these types of accidents, the American Alpine Club publishes annual books analyzing climbing accidents in North America (and has done so since the 40s). They interview survivors, rescuers, and bystanders for each year’s “most teachable” accidents, creating a complete picture of exactly what went wrong and how death or injury could have been prevented. \n\nEdit: AAP now has a searchable accident archive. \n\nThis is an accident report of a different fatal rap equipment failure: https://publications.americanalpineclub.org/articles/13201216635\n\nIf you search “fatal rappel” there are many more.\nhttps://publications.americanalpineclub.org/",
                "They got one final thrill they were seeking",
                "So these people risks their lives to have some fun? They should think about their families before doing that. I suppose that are their lives and it is their prerogative to take as much risks as they want."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "NSW police continued to justify festival strip-searches using drug dogs despite knowing 30% hit-rate, court hears",
            "external_url": "https://www.theguardian.com/australia-news/2025/may/13/nsw-police-music-festival-strip-search-class-action-drug-dog-justification-ntwnfb",
            "upvotes": 192,
            "date": "05/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f5b03845e24e3f093425d322abc6e2b4072225d7/318_0_5600_4480/master/5600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=dfef822b87d5aa50d0773c6bb48cd107",
            "top_comments": [
                "Police in Sydney routinely conduct invasive strip searches at music festivals. These are completely naked searches where guys are told to lift their balls, girls are told to lift their boobs, attendees are told to squat and cough, bend over etc. Most of these strip searches don’t find any drugs, and you’ve got reports of innocent people being left completely distraught after this has happened to them. NSW Police are currently facing a class action over this. So far around 3000 people have signed up. A trial for that class action began last week. \n\nFor background: In 2001, New South Wales (state in Australia, Sydney is the capital) introduced a law giving police the power to deploy drug detection dogs at certain public locations, namely at major events such as music festivals, train stations and at venues that serve alcohol, such as pubs and clubs. These dogs are notoriously unreliable, and there are reports on social media of handlers forcing their dogs to sit in front people in order to have them searched.\n\nIt's just crazy. You can turn up to a train station in Sydney and there’ll be a dozen officers standing around watching while a dog is sniffing commuters. Same deal at pubs. You can be having a beer and all of a sudden the police will burst in and block off all the exits so a dog can be brought round to sniff everyone. They used to do this every weekend picking clubs and pubs at random. \n\nMusic festivals are the worst. The police have drug detection dogs at every music festival in Sydney. At these events, they’ll have a fenced off compound setup with makeshift structures such as tents or ticket booths where people stopped by the dogs are taken to be searched. Some people are lucky enough to get away with a pat down, but in many cases, festival attendees have been ordered to strip completely naked and bend over, squat etc. to have their bodies examined for drugs. At any given event, they’ll strip search dozens of people like this. Total gestapo stuff and it’s still happening today.",
                "How are Australians ok with something like this? People do tons of drugs at American music festivals and we seem to be doing fine.",
                "Being strip searched is a major violation. It's insane that you can just be an ordinary person doing nothing wrong and police can make you strip based on the an alert from a dog that they know is usually wrong. And for what? They're usually not even looking for major drug operations. Just people with drugs, probably mostly for their own personal use. I'm way more concerned about sex crimes than drug use, and in this case, the police are committing them. Or they would be, if the law didn't give them a special exception.",
                "If the people are going to put up with being strip searched like they're actual felons than unfortunately, it's going to keep continuing. This means both in the people you elect, and the actions you do. For many boycotting/protesting the venues that do this matters far less than seeing the big show done by a band they've made a huge part of their own self-identity.\n\nOf course this politics and involves the government, but if people stop showing up to the biggest venues in the city in protest to this, the venue owners will go to local politicians and push serious money to get it changed.\n\nEverything is politics, even music festivals, and your own attendance to them.",
                "I lived in Sydney 20 years ago and it was frightening how the police behaved. Sitting in a pub in the afternoon and having a gang of armed police in militaristic uniforms go from table to table with an alsatian sniffing everybody while the cops glare at you like they're trying their best to catch you out or bait you into challenging them so they can beat you down... it's grim, man. Proper police state behaviour. You quickly learn to hate seeing police in the streets, which is very different from my experience in the UK.",
                "Put mousetrap in butthole.",
                "Stop attending these events.  If the promoters lose money something will change.",
                "And the courts will still allow it. Just like their saliva tests. 0 fucks given on the harm these barbaric laws they keep passing because the cops. \n\nLooks like the Aussie court system has some soul searching to do. They'll never do it though, they'll just keep going round and round this oppressive spiral. See ya in hell lol.",
                "What happens if beyond complying by emptying your pockets and allowing them to check them; you refuse to remove your clothing? \n\nAnd related: \nWhat are the laws for filming police in public?",
                "Fuck Australia. Cops basically sexually assaulting folks who just want to party? "
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "HOT",
            "title": "Argentina's top court finds 80 boxes of Nazi materials in its basement",
            "external_url": "https://www.reuters.com/world/americas/argentinas-top-court-finds-80-boxes-nazi-materials-its-basement-2025-05-12/",
            "upvotes": 1395,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They were just holding it for a friend",
                "\"Argentina's top court finds 80 boxes of Nazi materials in its basement\" in a later part of the announcement, \"It was immediately requested by the current US administration to be sent to the White House.\"",
                "For the people who need a TLDR:\n\nThese materials were confiscated during WWII. The government found these among materials coming in to the German Embassy. The authorities of Argentina were worried that this material might effect their neutrality so they put it in lockup.\n\nWhen they locked these up they had searched the boxes, and among the items found postcards, propaganda material, and other items that appeared to be geared towards spreading Nazi ideology in Argentina.\n\nSo yeah, overall, just a bunch of historical materials that were impounded and the owners never got them back because it was intended to promote fascism.",
                "We find the spread of Nazi propaganda all over the world these days just not usually the tangible results of it.",
                "[removed]",
                "I like how surprised everyone is acting when Argentina had a Fascist government allied with Nazi Germany.",
                "It’s Argentina I’m not surprised at all",
                "> Argentina remained neutral in World War II until 1944, when it broke relations with Axis powers. The South American country declared war on Germany and Japan the following year.\n\nWhy not wait until 1946 guys",
                "Well, it’s no wonder that it took 80yrs. We’ve since learned that important secret documents should be stored in bathrooms.",
                "BREAKING: Fork Found In Kitchen"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "victim of the longest miscarriage of justice involving a living prisoner in British legal history has just been cleared after 38 years in prison",
            "external_url": "https://www.bbc.com/news/articles/ce809e3gd1xo",
            "upvotes": 9,
            "date": "05/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0030/live/8db616d0-0006-11f0-8482-95fc1747d814.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US will fast-track Utah uranium mine permit",
            "external_url": "https://www.reuters.com/sustainability/us-will-fast-track-utah-uranium-mine-permit-2025-05-12/?utm_source=chatgpt.com",
            "upvotes": 10,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They were sloppy with uranium mines in the middle of the 20th century and it ended up poisoning a lot of Navajo communities. This is a recipe for disaster.",
                "It’s essentially important for us to develop rare earth minerals."
            ],
            "aggregate_sentiment": 75.0
        },
        {
            "category": "NEW",
            "title": "UnitedHealth suspends annual forecast, CEO Andrew Witty steps down",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/unitedhealth-ceo-andrew-witty-steps-down-2025-05-13/",
            "upvotes": 390,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "My company recently moved insurance from Blue Cross/Blue Shield over to this hot mess. Man, when I tell ya…absolutely *dog shit* insurance company. We went from pretty good coverage to them nickel and diming over everything. Would strongly advise to stay away from UnitedHealth.",
                "In simple terms, my rates are going up, big time",
                "I hope UnitedHealth continues to go under. Awful company. Their denial rate is 2x that of the industry average. Total scam of a company",
                "I never buy personal reasons.  Had a few people leave my company like that.  One cared way too much and it showed as she was doing her two weeks.  She finally told us it was a silent layoff.  Our boss left for personal reasons with no job at the same time.  \n\nShit is going sideways after the shooting and this guy either wasnt doing what he needed/asked to do or he just fucked it all up and the board said time to go.  \n\nHe could have something personal too.  He’s human.  But with the other stuff.  Seems like board asked him to leave.",
                "Sounds like fall out from the lawsuit. Good thing stockholders get taken care of. God forbid someone does anything to prevent another CEO being killed. All about those dollar bills.",
                "Sorry we weren’t able to completely screw over our customers to enrich our shareholders. Edit: a word",
                "[Understanding the Change Healthcare Breach and Its Impact on Security Compliance](https://hyperproof.io/resource/understanding-the-change-healthcare-breach/)\n\nIn short, quite possibly the largest healthcare data breach in history occurred under his watch.",
                "I hope they’re all terrified. These monsters deserve to feel unsafe. They willingly murder people by withholding services. It’s beyond ridiculous and it has to change.",
                "CEO worried he might be next?",
                "Once your on that little piece of land in Nantucket I suppose you're gonna take off than fancy looking health insurance CEO uniform huh? Yeah that's what I thought, that I can't abide"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "NSW police continued to justify festival strip-searches using drug dogs despite knowing 30% hit-rate, court hears",
            "external_url": "https://www.theguardian.com/australia-news/2025/may/13/nsw-police-music-festival-strip-search-class-action-drug-dog-justification-ntwnfb",
            "upvotes": 193,
            "date": "05/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f5b03845e24e3f093425d322abc6e2b4072225d7/318_0_5600_4480/master/5600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=dfef822b87d5aa50d0773c6bb48cd107",
            "top_comments": [
                "Police in Sydney routinely conduct invasive strip searches at music festivals. These are completely naked searches where guys are told to lift their balls, girls are told to lift their boobs, attendees are told to squat and cough, bend over etc. Most of these strip searches don’t find any drugs, and you’ve got reports of innocent people being left completely distraught after this has happened to them. NSW Police are currently facing a class action over this. So far around 3000 people have signed up. A trial for that class action began last week. \n\nFor background: In 2001, New South Wales (state in Australia, Sydney is the capital) introduced a law giving police the power to deploy drug detection dogs at certain public locations, namely at major events such as music festivals, train stations and at venues that serve alcohol, such as pubs and clubs. These dogs are notoriously unreliable, and there are reports on social media of handlers forcing their dogs to sit in front people in order to have them searched.\n\nIt's just crazy. You can turn up to a train station in Sydney and there’ll be a dozen officers standing around watching while a dog is sniffing commuters. Same deal at pubs. You can be having a beer and all of a sudden the police will burst in and block off all the exits so a dog can be brought round to sniff everyone. They used to do this every weekend picking clubs and pubs at random. \n\nMusic festivals are the worst. The police have drug detection dogs at every music festival in Sydney. At these events, they’ll have a fenced off compound setup with makeshift structures such as tents or ticket booths where people stopped by the dogs are taken to be searched. Some people are lucky enough to get away with a pat down, but in many cases, festival attendees have been ordered to strip completely naked and bend over, squat etc. to have their bodies examined for drugs. At any given event, they’ll strip search dozens of people like this. Total gestapo stuff and it’s still happening today.",
                "How are Australians ok with something like this? People do tons of drugs at American music festivals and we seem to be doing fine.",
                "Being strip searched is a major violation. It's insane that you can just be an ordinary person doing nothing wrong and police can make you strip based on the an alert from a dog that they know is usually wrong. And for what? They're usually not even looking for major drug operations. Just people with drugs, probably mostly for their own personal use. I'm way more concerned about sex crimes than drug use, and in this case, the police are committing them. Or they would be, if the law didn't give them a special exception.",
                "If the people are going to put up with being strip searched like they're actual felons than unfortunately, it's going to keep continuing. This means both in the people you elect, and the actions you do. For many boycotting/protesting the venues that do this matters far less than seeing the big show done by a band they've made a huge part of their own self-identity.\n\nOf course this politics and involves the government, but if people stop showing up to the biggest venues in the city in protest to this, the venue owners will go to local politicians and push serious money to get it changed.\n\nEverything is politics, even music festivals, and your own attendance to them.",
                "I lived in Sydney 20 years ago and it was frightening how the police behaved. Sitting in a pub in the afternoon and having a gang of armed police in militaristic uniforms go from table to table with an alsatian sniffing everybody while the cops glare at you like they're trying their best to catch you out or bait you into challenging them so they can beat you down... it's grim, man. Proper police state behaviour. You quickly learn to hate seeing police in the streets, which is very different from my experience in the UK.",
                "Put mousetrap in butthole.",
                "Stop attending these events.  If the promoters lose money something will change.",
                "And the courts will still allow it. Just like their saliva tests. 0 fucks given on the harm these barbaric laws they keep passing because the cops. \n\nLooks like the Aussie court system has some soul searching to do. They'll never do it though, they'll just keep going round and round this oppressive spiral. See ya in hell lol.",
                "What happens if beyond complying by emptying your pockets and allowing them to check them; you refuse to remove your clothing? \n\nAnd related: \nWhat are the laws for filming police in public?",
                "Fuck Australia. Cops basically sexually assaulting folks who just want to party? "
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "French actor Gerard Depardieu found guilty of sexually assaulting two women",
            "external_url": "https://news.sky.com/story/gerard-depardieu-found-guilty-of-sexual-assault-13367002",
            "upvotes": 1537,
            "date": "05/13/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-gerard-depardieu-trial_6867262.jpg?20250326091431",
            "top_comments": [
                "This man is such a disgusting, vile pig.",
                "Reminder: multiple French celebrities said he shouldn't face trial because he made some great films.\n\n[https://variety.com/2023/film/news/french-stars-defend-gerard-depardieu-open-letter-1235850631/](https://variety.com/2023/film/news/french-stars-defend-gerard-depardieu-open-letter-1235850631/)\n\nMacron himself said this only last December:\n\n>\"I’ll say it as France’s president but also as a citizen, he makes France proud.\"",
                "Noooo...he just looks and sounds like the person you'd most expect. \n\nPlus he did some real weird shit with his daughter on vacation once. Pretended to be her lover. What a creep.",
                "Away from the court, Ms Diebolt told Sky News that, after years of being tolerated due to his fame, Depardieu was finally being held accountable for his actions.\n\n\"These women were put in danger,\" she said. \"This is about a line of offences that he committed over many years that were tolerated by the world of cinema because it was Gerard Depardieu.\n\n\"Because the financial benefits he brings to the industry are so substantial. He did make some excellent films, but all men are equal before the law.\n\n\"Nobody warned Amelie about Depardieu's behaviour, so his words and actions came as a terrible surprise for her. She still has traumatic flashbacks.\"\n\nDepardieu's reputation is now in tatters, and there may be more allegations to come.\n\nDiebolt told Sky News that around 20 other women have said that they were attacked by the actor.\n\nAnd we already know that Depardieu will stand trial again later this year, this time charged with raping the actress Charlotte Arnould.\n\nMs Arnould has accused Depardieu, a friend of her parents, of raping her at his mansion in Paris",
                "What a giant fucking turd.",
                "Isnt he a roomate with Steven \"The Whale\" Seagal in Russia?",
                "Another putin's friend is a scam, what a coincidence.",
                "That sentence is a disgrace",
                "Never liked this dude. Always had a creepy vibe.",
                "In Russia he will get a medal for that, as Russian occupants do"
            ],
            "aggregate_sentiment": 70.0
        },
        {
            "category": "NEW",
            "title": "Rapper Tory Lanez recovering after being ‘stabbed 14 times’ as he serves time for Megan Thee Stallion shooting",
            "external_url": "https://www.cnn.com/2025/05/12/entertainment/rapper-tory-lanez-attacked-prison",
            "upvotes": 290,
            "date": "05/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap22358034499572.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Did they use a toothpick or something?",
                "Article by Lisa Respers France\n\n>Tory Lanez is “deeply thankful to God” and thanking his supporters after he was attacked Monday at a California prison where he’s serving a [10-year sentence](https://www.cnn.com/2023/08/08/entertainment/tory-lanez-sentence-megan-thee-stallion) for shooting hip-hop star [Megan Thee Stallion](https://www.cnn.com/2023/04/18/entertainment/megan-thee-stallion-tory-lanez-essay) in the feet.\n\n>A post on his verified social media on Monday shared that Lanez, who was born Daystar Peterson, was “stabbed 14 times- including 7 wounds to his back, 4 to his torso, 2 to the back of his head, and 1 to the left side of his face.”\n\n>“Both of his lungs collapsed, and he was placed on a breathing apparatus,” the post read. “He is now breathing on his own.”\n\n>According to the post, “Despite being in pain, he is talking normally, in good spirits, and deeply thankful to God that he is pulling through.”\n\n>“He also wants to thank everyone for their continued prayers and support,” the post concluded.\n\n>CNN has reached out to reps for Lanez for comment.\n\n>The [Associated Press](https://apnews.com/article/tory-lanez-attacked-prison-megan-thee-stallion-53ada101c5a14dfc5b1c16049f14bbaf) reported that the Canadian artist was attacked at a housing unit at the California Correctional Institution in Tehachapi at about 7:20 a.m. according to Pedro Calderon Michel, spokesman for the state Department of Corrections and Rehabilitation.\n\n>Staff immediately gave Lanez medical aid and called 911, and he was taken to an outside hospital, Michel said. The prison’s investigative unit and the Kern County District Attorney’s Office are investigating, he said.\n\n>In December 2022, [a Los Angeles jury found Lanez guilty of three charges](https://www.cnn.com/2023/08/08/entertainment/tory-lanez-sentence-megan-thee-stallion) related to the July 2020 shooting of fellow rapper Megan Thee Stallion whose legal name is Megan Pete.\n\n>She testified during the trial that she and Lanez had left a party at Kylie Jenner’s Hollywood Hills home in July 2020 when Lanez fired a gun at the back of her feet and ordered her to dance. She said the shooting occurred after they argued and she exited the SUV in which they had been traveling.\n\n>“Every day I think of others across the world who are victims of violence and survive. It is truly the most powerless feeling, especially when you question whether the justice system can truly protect you,” she said in a statement which LA County District Attorney George Gascón read at a press conference following Lanez’s conviction. “Fortunately, the district attorney’s office fought for me. I’m incredibly grateful to them and the jury for the attention to the evidence and siding with the truth. But if it can happen to me, imagine those who lack the resources and support systems to help them.”\n\n>Lanez has insisted on his innocence and his lawyers appealed his conviction. In May 2023 a judge denied a motion for him to receive a new trial. The star’s legal team had argued that some of the evidence presented had wrongly been admitted into the trial.",
                "CNN covering this story like it’s ground shaking is the real story.\nAnytime Trump gets closer to breaking the democracy in America. This is what becomes breaking news.",
                "Now that he has a better idea of what pain is maybe he'll be less likely to inflict it on others?",
                "[removed]",
                "Well, now he knows what Meghan went through. I wonder if his attackers were Meghan Thee Stallion fans.",
                "And who cares about that piece of sh information?",
                "[deleted]",
                "Spot the r/fauxmoi posters in the comments, they love celebrating violence against black men"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Train service disrupted in Baltimore due to large warehouse fire",
            "external_url": "https://www.cnn.com/2025/05/13/us/fire-baltimore-mattress-warehouse-halts-trains-hnk",
            "upvotes": 120,
            "date": "05/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21619045-245138-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Was it another container ship?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Possible anchoring failure leaves 3 climbers dead in Washington state",
            "external_url": "https://www.cnn.com/2025/05/12/us/north-cascades-climbers-death",
            "upvotes": 1325,
            "date": "05/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/496263129-1102854608546908-5906308397723621896-n.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "*Article Text:*\n\nThree people died and one other person was able to free themself during a climbing accident in Washington state, authorities said Monday.\n\nAuthorities responded to the scene Sunday as the victims had fallen “while descending a steep gully” in the North Cascades, the Okanogan County Sheriff’s Office said. Authorities said they believe a part of their anchoring system failed.\n\n“Three individuals were confirmed deceased at the accident site. The fourth member of the party self-extricated and contacted law enforcement,” the Okanogan County Sheriff’s Office said of the four climbers from Renton.\n\nThose killed were ages 36, 47 and 63, according to the office.\n\n“The presumed cause of the accident is an anchor failure while rappelling, with more investigation still ongoing,” the sheriff’s office added.\n\nThe climbers were in the area of North Early Winters Spire when the accident occurred, authorities said. The site is about 16 miles west of Mazama.",
                "*A fourth climber sustained internal bleeding and a traumatic brain injury in the fall, but survived. He walked back to the trailhead just east of Washington Pass and drove to Newhalem, where he used a pay phone to call 911 at about 11:30 a.m. Sunday.*\n\nImagine if all 4 lived through the failure, and none could walk to the trailhead and then drive to the pay phone. Actually, it's possible one or two were still alive but died because of no cell coverage in the mountains.",
                "Damn a rap anchor failed. Scary shit",
                "Not experienced with ropes in the mountains. Wouldn’t only one person be on the rope at a time? And I suppose a belayer maybe also somehow attached to the failure. \n\nBut then how could 3 of them have died because of an anchor failure?",
                "Damn, that sucks.\n\nJust goes to show that any mountain can be deadly if your luck or preparation are bad enough. Safety in mountaineering is nothing to take lightly.",
                "Any details of the mountain/route?  The only one in that area I’m familiar with is Shuksan.",
                "Rock climbing isn’t all that dangerous until it is, and then it’s usually fatal. Repelling even more so.",
                "If anyone wants to know more about these types of accidents, the American Alpine Club publishes annual books analyzing climbing accidents in North America (and has done so since the 40s). They interview survivors, rescuers, and bystanders for each year’s “most teachable” accidents, creating a complete picture of exactly what went wrong and how death or injury could have been prevented. \n\nEdit: AAP now has a searchable accident archive. \n\nThis is an accident report of a different fatal rap equipment failure: https://publications.americanalpineclub.org/articles/13201216635\n\nIf you search “fatal rappel” there are many more.\nhttps://publications.americanalpineclub.org/",
                "They got one final thrill they were seeking",
                "So these people risks their lives to have some fun? They should think about their families before doing that. I suppose that are their lives and it is their prerogative to take as much risks as they want."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Federal judge won’t block Trump’s plan to use IRS data to track down undocumented migrants",
            "external_url": "https://www.cnn.com/2025/05/12/politics/judge-wont-block-irs-data-sharing-track-undocumented-migrants",
            "upvotes": 3123,
            "date": "05/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-20t181645z-962444936-rc2hycat9wtc-rtrmadp-3-usa-trump-irs.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Literally telling immigrants to not pay taxes.",
                "But wait, one of their big things is \"immigrants don't pay taxes.\" Why would there be records at the IRS?",
                "This is very likely to get overturned on appeal by the DC Circuit if it makes it to non-Trump judges, both Republican and Democrat judges. The privacy laws of the tax code are pretty damn solid in what can be disclosed.",
                "Trump et al. said undocumented immigrants don't pay taxes. Just another con.",
                "I did taxes. If the axiom of \"the IRS doesn't care how you get money as long as you pay them\" no longer holds true, then shit's gonna crumble.",
                "You mean someone's paying them to work?",
                "So they are going to forgo $96 BILLION in taxes to maybe deport a few thousand TAX-PAYING undocumented workers? A few of whom might be accused criminal activity? \n\nGreat. Sounds very fiscally responsible. ",
                "They are tracking us ALL down",
                "To be clear, this will prevent immigrants from paying any form of taxes which in turn will mean even less money into Social Security which they are net payers to because they can't take anything out.",
                "And for some reasons we can't see his tax records."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Argentina's top court finds 80 boxes of Nazi materials in its basement",
            "external_url": "https://www.reuters.com/world/americas/argentinas-top-court-finds-80-boxes-nazi-materials-its-basement-2025-05-12/",
            "upvotes": 1395,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They were just holding it for a friend",
                "\"Argentina's top court finds 80 boxes of Nazi materials in its basement\" in a later part of the announcement, \"It was immediately requested by the current US administration to be sent to the White House.\"",
                "For the people who need a TLDR:\n\nThese materials were confiscated during WWII. The government found these among materials coming in to the German Embassy. The authorities of Argentina were worried that this material might effect their neutrality so they put it in lockup.\n\nWhen they locked these up they had searched the boxes, and among the items found postcards, propaganda material, and other items that appeared to be geared towards spreading Nazi ideology in Argentina.\n\nSo yeah, overall, just a bunch of historical materials that were impounded and the owners never got them back because it was intended to promote fascism.",
                "We find the spread of Nazi propaganda all over the world these days just not usually the tangible results of it.",
                "[removed]",
                "I like how surprised everyone is acting when Argentina had a Fascist government allied with Nazi Germany.",
                "It’s Argentina I’m not surprised at all",
                "> Argentina remained neutral in World War II until 1944, when it broke relations with Axis powers. The South American country declared war on Germany and Japan the following year.\n\nWhy not wait until 1946 guys",
                "Well, it’s no wonder that it took 80yrs. We’ve since learned that important secret documents should be stored in bathrooms.",
                "BREAKING: Fork Found In Kitchen"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "UnitedHealth suspends annual forecast, CEO Andrew Witty steps down",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/unitedhealth-ceo-andrew-witty-steps-down-2025-05-13/",
            "upvotes": 388,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "My company recently moved insurance from Blue Cross/Blue Shield over to this hot mess. Man, when I tell ya…absolutely *dog shit* insurance company. We went from pretty good coverage to them nickel and diming over everything. Would strongly advise to stay away from UnitedHealth.",
                "In simple terms, my rates are going up, big time",
                "I hope UnitedHealth continues to go under. Awful company. Their denial rate is 2x that of the industry average. Total scam of a company",
                "I never buy personal reasons.  Had a few people leave my company like that.  One cared way too much and it showed as she was doing her two weeks.  She finally told us it was a silent layoff.  Our boss left for personal reasons with no job at the same time.  \n\nShit is going sideways after the shooting and this guy either wasnt doing what he needed/asked to do or he just fucked it all up and the board said time to go.  \n\nHe could have something personal too.  He’s human.  But with the other stuff.  Seems like board asked him to leave.",
                "Sounds like fall out from the lawsuit. Good thing stockholders get taken care of. God forbid someone does anything to prevent another CEO being killed. All about those dollar bills.",
                "Sorry we weren’t able to completely screw over our customers to enrich our shareholders. Edit: a word",
                "[Understanding the Change Healthcare Breach and Its Impact on Security Compliance](https://hyperproof.io/resource/understanding-the-change-healthcare-breach/)\n\nIn short, quite possibly the largest healthcare data breach in history occurred under his watch.",
                "I hope they’re all terrified. These monsters deserve to feel unsafe. They willingly murder people by withholding services. It’s beyond ridiculous and it has to change.",
                "CEO worried he might be next?",
                "Once your on that little piece of land in Nantucket I suppose you're gonna take off than fancy looking health insurance CEO uniform huh? Yeah that's what I thought, that I can't abide"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "French actor Gerard Depardieu found guilty of sexually assaulting two women",
            "external_url": "https://news.sky.com/story/gerard-depardieu-found-guilty-of-sexual-assault-13367002",
            "upvotes": 1536,
            "date": "05/13/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-gerard-depardieu-trial_6867262.jpg?20250326091431",
            "top_comments": [
                "This man is such a disgusting, vile pig.",
                "Reminder: multiple French celebrities said he shouldn't face trial because he made some great films.\n\n[https://variety.com/2023/film/news/french-stars-defend-gerard-depardieu-open-letter-1235850631/](https://variety.com/2023/film/news/french-stars-defend-gerard-depardieu-open-letter-1235850631/)\n\nMacron himself said this only last December:\n\n>\"I’ll say it as France’s president but also as a citizen, he makes France proud.\"",
                "Noooo...he just looks and sounds like the person you'd most expect. \n\nPlus he did some real weird shit with his daughter on vacation once. Pretended to be her lover. What a creep.",
                "Away from the court, Ms Diebolt told Sky News that, after years of being tolerated due to his fame, Depardieu was finally being held accountable for his actions.\n\n\"These women were put in danger,\" she said. \"This is about a line of offences that he committed over many years that were tolerated by the world of cinema because it was Gerard Depardieu.\n\n\"Because the financial benefits he brings to the industry are so substantial. He did make some excellent films, but all men are equal before the law.\n\n\"Nobody warned Amelie about Depardieu's behaviour, so his words and actions came as a terrible surprise for her. She still has traumatic flashbacks.\"\n\nDepardieu's reputation is now in tatters, and there may be more allegations to come.\n\nDiebolt told Sky News that around 20 other women have said that they were attacked by the actor.\n\nAnd we already know that Depardieu will stand trial again later this year, this time charged with raping the actress Charlotte Arnould.\n\nMs Arnould has accused Depardieu, a friend of her parents, of raping her at his mansion in Paris",
                "What a giant fucking turd.",
                "Isnt he a roomate with Steven \"The Whale\" Seagal in Russia?",
                "Another putin's friend is a scam, what a coincidence.",
                "That sentence is a disgrace",
                "Never liked this dude. Always had a creepy vibe.",
                "In Russia he will get a medal for that, as Russian occupants do"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "NSW police continued to justify festival strip-searches using drug dogs despite knowing 30% hit-rate, court hears",
            "external_url": "https://www.theguardian.com/australia-news/2025/may/13/nsw-police-music-festival-strip-search-class-action-drug-dog-justification-ntwnfb",
            "upvotes": 194,
            "date": "05/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f5b03845e24e3f093425d322abc6e2b4072225d7/318_0_5600_4480/master/5600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=dfef822b87d5aa50d0773c6bb48cd107",
            "top_comments": [
                "Police in Sydney routinely conduct invasive strip searches at music festivals. These are completely naked searches where guys are told to lift their balls, girls are told to lift their boobs, attendees are told to squat and cough, bend over etc. Most of these strip searches don’t find any drugs, and you’ve got reports of innocent people being left completely distraught after this has happened to them. NSW Police are currently facing a class action over this. So far around 3000 people have signed up. A trial for that class action began last week. \n\nFor background: In 2001, New South Wales (state in Australia, Sydney is the capital) introduced a law giving police the power to deploy drug detection dogs at certain public locations, namely at major events such as music festivals, train stations and at venues that serve alcohol, such as pubs and clubs. These dogs are notoriously unreliable, and there are reports on social media of handlers forcing their dogs to sit in front people in order to have them searched.\n\nIt's just crazy. You can turn up to a train station in Sydney and there’ll be a dozen officers standing around watching while a dog is sniffing commuters. Same deal at pubs. You can be having a beer and all of a sudden the police will burst in and block off all the exits so a dog can be brought round to sniff everyone. They used to do this every weekend picking clubs and pubs at random. \n\nMusic festivals are the worst. The police have drug detection dogs at every music festival in Sydney. At these events, they’ll have a fenced off compound setup with makeshift structures such as tents or ticket booths where people stopped by the dogs are taken to be searched. Some people are lucky enough to get away with a pat down, but in many cases, festival attendees have been ordered to strip completely naked and bend over, squat etc. to have their bodies examined for drugs. At any given event, they’ll strip search dozens of people like this. Total gestapo stuff and it’s still happening today.",
                "How are Australians ok with something like this? People do tons of drugs at American music festivals and we seem to be doing fine.",
                "Being strip searched is a major violation. It's insane that you can just be an ordinary person doing nothing wrong and police can make you strip based on the an alert from a dog that they know is usually wrong. And for what? They're usually not even looking for major drug operations. Just people with drugs, probably mostly for their own personal use. I'm way more concerned about sex crimes than drug use, and in this case, the police are committing them. Or they would be, if the law didn't give them a special exception.",
                "If the people are going to put up with being strip searched like they're actual felons than unfortunately, it's going to keep continuing. This means both in the people you elect, and the actions you do. For many boycotting/protesting the venues that do this matters far less than seeing the big show done by a band they've made a huge part of their own self-identity.\n\nOf course this politics and involves the government, but if people stop showing up to the biggest venues in the city in protest to this, the venue owners will go to local politicians and push serious money to get it changed.\n\nEverything is politics, even music festivals, and your own attendance to them.",
                "I lived in Sydney 20 years ago and it was frightening how the police behaved. Sitting in a pub in the afternoon and having a gang of armed police in militaristic uniforms go from table to table with an alsatian sniffing everybody while the cops glare at you like they're trying their best to catch you out or bait you into challenging them so they can beat you down... it's grim, man. Proper police state behaviour. You quickly learn to hate seeing police in the streets, which is very different from my experience in the UK.",
                "Put mousetrap in butthole.",
                "Stop attending these events.  If the promoters lose money something will change.",
                "And the courts will still allow it. Just like their saliva tests. 0 fucks given on the harm these barbaric laws they keep passing because the cops. \n\nLooks like the Aussie court system has some soul searching to do. They'll never do it though, they'll just keep going round and round this oppressive spiral. See ya in hell lol.",
                "What happens if beyond complying by emptying your pockets and allowing them to check them; you refuse to remove your clothing? \n\nAnd related: \nWhat are the laws for filming police in public?",
                "Fuck Australia. Cops basically sexually assaulting folks who just want to party? "
            ],
            "aggregate_sentiment": 43.0
        },
        {
            "category": "RISING",
            "title": "Rapper Tory Lanez recovering after being ‘stabbed 14 times’ as he serves time for Megan Thee Stallion shooting",
            "external_url": "https://www.cnn.com/2025/05/12/entertainment/rapper-tory-lanez-attacked-prison",
            "upvotes": 298,
            "date": "05/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap22358034499572.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Did they use a toothpick or something?",
                "Article by Lisa Respers France\n\n>Tory Lanez is “deeply thankful to God” and thanking his supporters after he was attacked Monday at a California prison where he’s serving a [10-year sentence](https://www.cnn.com/2023/08/08/entertainment/tory-lanez-sentence-megan-thee-stallion) for shooting hip-hop star [Megan Thee Stallion](https://www.cnn.com/2023/04/18/entertainment/megan-thee-stallion-tory-lanez-essay) in the feet.\n\n>A post on his verified social media on Monday shared that Lanez, who was born Daystar Peterson, was “stabbed 14 times- including 7 wounds to his back, 4 to his torso, 2 to the back of his head, and 1 to the left side of his face.”\n\n>“Both of his lungs collapsed, and he was placed on a breathing apparatus,” the post read. “He is now breathing on his own.”\n\n>According to the post, “Despite being in pain, he is talking normally, in good spirits, and deeply thankful to God that he is pulling through.”\n\n>“He also wants to thank everyone for their continued prayers and support,” the post concluded.\n\n>CNN has reached out to reps for Lanez for comment.\n\n>The [Associated Press](https://apnews.com/article/tory-lanez-attacked-prison-megan-thee-stallion-53ada101c5a14dfc5b1c16049f14bbaf) reported that the Canadian artist was attacked at a housing unit at the California Correctional Institution in Tehachapi at about 7:20 a.m. according to Pedro Calderon Michel, spokesman for the state Department of Corrections and Rehabilitation.\n\n>Staff immediately gave Lanez medical aid and called 911, and he was taken to an outside hospital, Michel said. The prison’s investigative unit and the Kern County District Attorney’s Office are investigating, he said.\n\n>In December 2022, [a Los Angeles jury found Lanez guilty of three charges](https://www.cnn.com/2023/08/08/entertainment/tory-lanez-sentence-megan-thee-stallion) related to the July 2020 shooting of fellow rapper Megan Thee Stallion whose legal name is Megan Pete.\n\n>She testified during the trial that she and Lanez had left a party at Kylie Jenner’s Hollywood Hills home in July 2020 when Lanez fired a gun at the back of her feet and ordered her to dance. She said the shooting occurred after they argued and she exited the SUV in which they had been traveling.\n\n>“Every day I think of others across the world who are victims of violence and survive. It is truly the most powerless feeling, especially when you question whether the justice system can truly protect you,” she said in a statement which LA County District Attorney George Gascón read at a press conference following Lanez’s conviction. “Fortunately, the district attorney’s office fought for me. I’m incredibly grateful to them and the jury for the attention to the evidence and siding with the truth. But if it can happen to me, imagine those who lack the resources and support systems to help them.”\n\n>Lanez has insisted on his innocence and his lawyers appealed his conviction. In May 2023 a judge denied a motion for him to receive a new trial. The star’s legal team had argued that some of the evidence presented had wrongly been admitted into the trial.",
                "CNN covering this story like it’s ground shaking is the real story.\nAnytime Trump gets closer to breaking the democracy in America. This is what becomes breaking news.",
                "Now that he has a better idea of what pain is maybe he'll be less likely to inflict it on others?",
                "[removed]",
                "Well, now he knows what Meghan went through. I wonder if his attackers were Meghan Thee Stallion fans.",
                "And who cares about that piece of sh information?",
                "[deleted]",
                "Spot the r/fauxmoi posters in the comments, they love celebrating violence against black men"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Possible anchoring failure leaves 3 climbers dead in Washington state",
            "external_url": "https://www.cnn.com/2025/05/12/us/north-cascades-climbers-death",
            "upvotes": 1322,
            "date": "05/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/496263129-1102854608546908-5906308397723621896-n.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "*Article Text:*\n\nThree people died and one other person was able to free themself during a climbing accident in Washington state, authorities said Monday.\n\nAuthorities responded to the scene Sunday as the victims had fallen “while descending a steep gully” in the North Cascades, the Okanogan County Sheriff’s Office said. Authorities said they believe a part of their anchoring system failed.\n\n“Three individuals were confirmed deceased at the accident site. The fourth member of the party self-extricated and contacted law enforcement,” the Okanogan County Sheriff’s Office said of the four climbers from Renton.\n\nThose killed were ages 36, 47 and 63, according to the office.\n\n“The presumed cause of the accident is an anchor failure while rappelling, with more investigation still ongoing,” the sheriff’s office added.\n\nThe climbers were in the area of North Early Winters Spire when the accident occurred, authorities said. The site is about 16 miles west of Mazama.",
                "*A fourth climber sustained internal bleeding and a traumatic brain injury in the fall, but survived. He walked back to the trailhead just east of Washington Pass and drove to Newhalem, where he used a pay phone to call 911 at about 11:30 a.m. Sunday.*\n\nImagine if all 4 lived through the failure, and none could walk to the trailhead and then drive to the pay phone. Actually, it's possible one or two were still alive but died because of no cell coverage in the mountains.",
                "Damn a rap anchor failed. Scary shit",
                "Not experienced with ropes in the mountains. Wouldn’t only one person be on the rope at a time? And I suppose a belayer maybe also somehow attached to the failure. \n\nBut then how could 3 of them have died because of an anchor failure?",
                "Damn, that sucks.\n\nJust goes to show that any mountain can be deadly if your luck or preparation are bad enough. Safety in mountaineering is nothing to take lightly.",
                "Any details of the mountain/route?  The only one in that area I’m familiar with is Shuksan.",
                "Rock climbing isn’t all that dangerous until it is, and then it’s usually fatal. Repelling even more so.",
                "If anyone wants to know more about these types of accidents, the American Alpine Club publishes annual books analyzing climbing accidents in North America (and has done so since the 40s). They interview survivors, rescuers, and bystanders for each year’s “most teachable” accidents, creating a complete picture of exactly what went wrong and how death or injury could have been prevented. \n\nEdit: AAP now has a searchable accident archive. \n\nThis is an accident report of a different fatal rap equipment failure: https://publications.americanalpineclub.org/articles/13201216635\n\nIf you search “fatal rappel” there are many more.\nhttps://publications.americanalpineclub.org/",
                "They got one final thrill they were seeking",
                "So these people risks their lives to have some fun? They should think about their families before doing that. I suppose that are their lives and it is their prerogative to take as much risks as they want."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Episcopal Church refuses to resettle white Afrikaners, citing moral opposition",
            "external_url": "https://www.npr.org/2025/05/12/g-s1-65988/episcopal-church-white-afrikaners-ends-partnership-u-s-government",
            "upvotes": 9100,
            "date": "05/12/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8640x4860+0+450/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbe%2F34%2F1b1627bb47cabd2e3be01911d780%2Fap25079502278892.jpg",
            "top_comments": [
                "Last week I'm agreeing with a Pope and this week I'm with an Episcopal church.  Weird couple of weeks as an atheist.",
                "It is refreshing to see some Christians actually following their faith.",
                "It's outrageous our tax dollars were spent to bring these people here.  What a waste of resources.",
                "Trump isn't hiding who and what he is.",
                "Episcopalians do what Republicans can't.",
                "> Q: There are many people who fit the criteria of fleeing persecution. Afghans for example. But they're being denied refugee status. So why such an exception for the Afrikaners?\n\n> TRUMP ADMIN OFFICIAL: One of the criteria is making sure they can be assimilated easily into our country\n\nIt’s just racism. That’s it. \n\nSource: https://bsky.app/profile/atrupar.com/post/3loym4e3uts23",
                "The Episcopal Church is not a part of the evangelical wing of Christian denominations. They are on the progress side and emphasizes helping the needy and bringing people together to do good. I have a friend who's a priest in the church and as an atheist I respect her work very much.",
                "Bringing white south afrikaners here is just trump DEI policies benefiting people who historically benefited from racism, and largely still do.\nAnd don't the white people in South Africa still own the majority of the land in South Africa? Land they stole from the ancestors the people that the trump administration is trying to paint as viEurope.\n\n MAYBE the European South afrikaners should go back to europe.",
                "neither are the Lutherans but that's just cuz they got all their resettlement funding yanked week 1",
                "how are white South Africans refugees?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Taliban adds chess to ever-growing list of things banned in Afghanistan",
            "external_url": "https://globalnews.ca/news/11175560/taliban-chess-banned-afghanistan/",
            "upvotes": 4814,
            "date": "05/12/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/05/GettyImages-1241640843.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "Someone high up in the Taliban lost a game to one of the kids they were molesting.",
                "Robin Williams had a joke that went like:\n\nYou can’t bomb the Taliban back to the Stone Age because they’ll go, “Oh! Upgrade!”",
                "just outlaw thinking and get it over with. ",
                "Some dude lost to a woman in chess, huh",
                "It’s wild that they banned chess, especially considering how deep its roots are in the Islamic world. \n\nWhile the game originated in India (as chaturanga), it was the Islamic Golden Age that helped spread and refine it across the Middle East, North Africa, and eventually into Europe. Scholars, caliphs, and poets all engaged with chess—not just as entertainment, but as a symbol of intellect and strategy. There are even surviving manuscripts from medieval Islamic scholars analyzing chess theory. In some courts, being good at chess was a mark of education and refinement. \n\nBanning it under the idea that it’s “un-Islamic” is completely ahistorical—it’s like banning algebra because it’s not “aligned with sharia,” even though al-jabr (algebra) literally came from Muslim mathematicians.",
                "Some of the other things recently banned in Afghanistan, as mentioned in the article:  \n\n\n>The move to ban chess comes just months after the Taliban banned free fighting, such as mixed martial arts, saying it was not aligned with sharia (Islamic law) and was too “violent.” The banning of MMA followed a 2021 law that prohibited “face-punching.”\n\n>Last October, the Taliban issued a decree that [prohibits women from praying aloud](https://globalnews.ca/news/10841150/taliban-women-morality-laws-praying-voices/) or reciting the Qur’an in each other’s presence. Two months earlier, in August 2024, they issued laws [making it mandatory](https://globalnews.ca/news/10712505/taliban-bans-womens-voices-faces-laws/) for women to veil their entire bodies, including their faces, at all times in public. Women were also forbidden from singing, reciting and reading aloud in public, as a woman’s voice is deemed “intimate” and should not be heard.\n\n>Women are already excluded from education after sixth grade, many public spaces and most jobs. They are also prohibited from looking at men they are not related to by blood or marriage.",
                "When you are so fkn miserable you have to make sure everyone is else too.",
                "That's just fucking embarrassing for the Taliban",
                "Why are they even bothered to be alive they seem to want to ban everything I don't get why they continue to exist.",
                "Chess involves forward thinking, strategy, and trying to figure out your opponents next move. Of course they wouldn't want that."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Olympic gold medalist, NCAA champion wrestler arrested in prostitution sting",
            "external_url": "https://www.pennlive.com/sports/2025/05/olympic-gold-medalist-ncaa-champion-wrestler-arrested-in-prostitution-sting.html",
            "upvotes": 8093,
            "date": "05/12/2025",
            "thumbnail": "https://www.pennlive.com/resizer/v2/LOD43AX2ZBAAJJ2YFZLUHRX77U.jpg?auth=c9155d8d33782c20a9b1aa1c78e2b7adfc9a3bd2c2c3387432ea8a312e510033&width=1280&quality=90",
            "top_comments": [
                "> According to the news station, Snyder allegedly started calling and texting about an ad for prostitution. He is accused of meeting at a hotel with an undercover officer, exchanging cash and requesting a sexual act.\n\nWow, great job everyone. You caught him! Resources well spent. Another violent criminal off the streets. \n\nNow if you’ll excuse me, I’m off to watch another video on pornhub where this exact scenario is legal as long as it’s filmed!",
                "He just tried to pay money for a prostitute. I’m sure a problem for his wife and a problem for his Christian camp affiliations but not a problem for me",
                "Damn even an Olympic champion can’t get laid naturally. Guess I’ll just stick to my left hand",
                "Doesn't sound like anything worth taxpayer money or publication. Only unfortunate detail:\n\n>Kyle Snyder is married to former Syracuse soccer player Maddie Pack Snyder.   \n\nAnd one I'm ambivalent about:\n \n> Snyder also holds a summer camp at Messiah University -- a private Christian School in Mechanicsburg, Pennsylvania. The camp is slated to be held June 20-23.",
                "Consensual sex with a grown adult? FOR SHAME",
                "Probably just wanted to practice some new holds",
                "Shoulda used campaign funds to pay for it then it would have been legal apparently?",
                "Prostitution is a human inevitability. The concept is a constant throughout human history and developed in multiple, separate, and exclusive civilizations. \n\nIt will never stop. It will never go away. \n\nLegalize it and allow these individuals to be treated like any other business. Cut the shit.",
                "Instead of catching adults having sex with each other for money, they should focus on catching adults who mess with children",
                "I feel so much safer now, good job cops."
            ],
            "aggregate_sentiment": 25.0
        },
        {
            "category": "RISING",
            "title": "Federal judge won’t block Trump’s plan to use IRS data to track down undocumented migrants",
            "external_url": "https://www.cnn.com/2025/05/12/politics/judge-wont-block-irs-data-sharing-track-undocumented-migrants",
            "upvotes": 3122,
            "date": "05/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-20t181645z-962444936-rc2hycat9wtc-rtrmadp-3-usa-trump-irs.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Literally telling immigrants to not pay taxes.",
                "But wait, one of their big things is \"immigrants don't pay taxes.\" Why would there be records at the IRS?",
                "This is very likely to get overturned on appeal by the DC Circuit if it makes it to non-Trump judges, both Republican and Democrat judges. The privacy laws of the tax code are pretty damn solid in what can be disclosed.",
                "Trump et al. said undocumented immigrants don't pay taxes. Just another con.",
                "I did taxes. If the axiom of \"the IRS doesn't care how you get money as long as you pay them\" no longer holds true, then shit's gonna crumble.",
                "You mean someone's paying them to work?",
                "So they are going to forgo $96 BILLION in taxes to maybe deport a few thousand TAX-PAYING undocumented workers? A few of whom might be accused criminal activity? \n\nGreat. Sounds very fiscally responsible. ",
                "They are tracking us ALL down",
                "To be clear, this will prevent immigrants from paying any form of taxes which in turn will mean even less money into Social Security which they are net payers to because they can't take anything out.",
                "And for some reasons we can't see his tax records."
            ],
            "aggregate_sentiment": 35.0
        },
        {
            "category": "RISING",
            "title": "Georgia become second US state to shield maker of Roundup weed killer from some cancer claims",
            "external_url": "https://apnews.com/article/bayer-roundup-weed-killer-pesticides-cancer-lawsuits-02020b62e2c0affbeccf464677fec871",
            "upvotes": 13207,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "FYI, the other state is North Dakota",
                ">Bayer insists glyphosate is safe. But it has stopped using the ingredient in its residential version of Roundup and has set aside $16 billion to settle cases. It continues to use glyphosate in its agricultural version of Roundup but has warned that it might have to stop doing so if the legal costs keep mounting.\n\nDoesn't sound like it's safe to me.",
                "We don't need to be giving giant companies shields like that. We also don't need a jury deciding what causes cancer when the scientific results aren't there.",
                "Georgia is also the state where prosecutors have absolute immunity. If they lie or break the law to convict you, they face no consequences whatsoever and cannot be sued for their misconduct. I feel terrible for people stuck there with MTG",
                "Bayer is the beneficiary. Bayer is not a farmer. \n\n> The new law “demonstrates that Georgia stands with its farmers, who work tirelessly to produce safe and affordable food,” said Brian Naber, president of Bayer’s crop sciences in North America, Australia and New Zealand.",
                "As a Georgian, this tracks for Kemp. \n\nThis verdict on the heels of the golf course study last week is insane.  It showed a huge increase in Parkinson’s in people living or working in close proximity to golf courses. Perhaps chemicals sprayed onto grass year round isn’t ideal…",
                "Georgia becomes second state to give Monsanto immunity.",
                "In the landscaping business we thought we knew that when Roundup was banned in France, the bees came back.  But when I went to go look that up all I could find was clouds and clouds of professionally planted disinformation.\n\nSo I still believe it.",
                "Why is everybody freaking out over unsubstantiated dubious cancer claims rather than the widespread ecosystem damage that's well known and understood? Like if you're going to hate it please learn to hate it for the right reasons.",
                "Save corporations from responsibility."
            ],
            "aggregate_sentiment": 24.0
        }
    ],
    "last_updated": "05/13/2025 12:17:31 UTC"
}