{
    "posts": [
        {
            "category": "HOT",
            "title": "California the 1st state to sue Trump administration over tariffs",
            "external_url": "https://www.cbc.ca/news/world/california-newsom-trump-tariffs-1.7511493",
            "upvotes": 5332,
            "date": "04/16/2025",
            "thumbnail": "https://i.cbc.ca/1.7511588.1744814544!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_1180/usa-trump.JPG?im=Resize%3D620",
            "top_comments": [
                "Makes a lot of sense. Out of the 50 states, California has the largest economy — the tariffs would significantly impact the golden state",
                "Here's to hoping he gets a preliminary injunction. The Supreme Court will side with Trump in the end, but not if Republicans finally grow a spine and help pass a bill that limits Trump's powers.",
                "I don't think this lawsuit will go anywhere, and will probably be thrown out since tariffs are an international issue with the federal government, not with states.\n\nBut more power to him to try.",
                "What use is a lawsuit to someone who doesn’t even have to obey the Supreme Court?",
                "Sue his ass for everything at this point",
                "Till now this president has done nothing good for America. But he has done a lot for Russia",
                "I like this lawsuit. I think California has standing. That said I think this is the wrong venue. The US has the US Court of International Trade to handle this dispute. I hope I'm wrong but I suspect they will be told to refile in the Trade court rather then Northern District.",
                "This won’t go anywhere. Trump is above the law.\n\nThis was always the obvious danger. The one and only _real_ check on the executive branch is impeachment followed by removal from office, and the Republicans already made it clear there are literally no circumstances under which they would do that.\n\nWithout the real risk of removal from office, everything - even following court orders - is just a norm/convention.",
                "LETS GO Washington, Oregon, Illinois... get on board with this.",
                "As ashamed as I am to be American these days, I'm proud to be a Californian."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "U.K. Top Court Says Trans Women Are Not Legally Women Under Equality Act",
            "external_url": "https://www.nytimes.com/2025/04/16/world/europe/uk-supreme-court-woman-definition-trans.html?unlocked_article_code=1.AE8.cfzk.pIrpb0-Czz4_&smid=url-share",
            "upvotes": 10527,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> However, he added: “We counsel against reading this judgment as a triumph of one or more groups in our society at the expense of another, it is not.” He said the ruling “does not cause disadvantage to trans people” because they have protections under anti-discrimination and equality laws.\n\n>Lord Hodge began his remarks by acknowledging the national conversation about transgender rights and protections, and described trans people as a “vulnerable and often harassed minority,” while noting that women had fought for centuries for equal rights.\n\n>He added: “It is not the task of this court to make policy on how the interests of these groups should be protected” but “to ascertain the meaning of the legislation which Parliament has enacted.”\n\n  \n   \n   \nSo yeah they’re just interpreting something, it doesn’t mean the Act can’t be changed.",
                "I find it interesting and revealing that the debate is *always* over the definition of \"woman\" and never the definition of \"man\".",
                "For the Americans: Watch how many anti-trans comments pop up, then remember:  \n\n- A teacher in Florida was fired for using a 17 year olds preferred name.\n- Republican lawmakers in Arkansas want to ban children from getting haircuts that “don’t match their gender”\n- A cis woman was fired from her job at Walmart because a male customer followed her into the bathroom and accused her of being trans, all because she happed to be tall for a woman. \n\nAll of this has happened in the last month in America. Normalizing trans hatred will lead to a destruction of all our civil rights. People should be free to dress how they please without fear of being targeted by our government.",
                "> However, he added: “We counsel against reading this judgment as a triumph of one or more groups in our society at the expense of another, it is not.” \n\nTOO LATE, it is already here. \n\nWe will be flooded with \"the great vitory of the common sense\" from thousands and thousands of news site, propagandas, and pundits. \n\nAnd there will be counter fire from opposite position.",
                "This will age as well as what the UK did to Alan Turing.",
                "Someone once said. \"Let it be\". Nowadays some people just won't let it be. Sad times.",
                "Massive blow to feminism. This ruling will be used to persecute women of all presentations and genders. Cisgendered women who don’t fit into the narrow box of “woman” will be harassed and oppressed double fold.",
                "When are we going to properly talk about sex v gender.   They are being exchanged so readily with little understanding. I recall a man on LBC happily declaring there are only two genders because you are born that way. 🤔",
                "TERF Island TERFing not even surprised 🤷🏽‍♀️",
                "Even biology says that sex isn't binary. \n\nI swear, Canada is one of the few English-speaking countries hanging on for dear life against right-wing takeover. Decades of right-wing/neoliberal policies and austerity have made England a hollow shell of its former self and impoverished it outside of London. Starmer is supposed to be a labour politician, but he's doing things like decreasing support for disabled people. Mind you, I'm not sitting on my high horse here in Canada. We were (and still could be pending the election) dangerously close to following the same right-wing path if Trump didn't expose it for the load of shit that it actually is."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "JPMorgan Chase sues more customers who allegedly stole cash in 'infinite money glitch'",
            "external_url": "https://www.cnbc.com/2025/04/16/jpmorgan-chase-infinite-money-glitch-bank-lawsuits.html",
            "upvotes": 4467,
            "date": "04/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108065444-1732060726356-gettyimages-2185023708-AFP_36MW3R2.jpeg?v=1732060988&w=1920&h=1080",
            "top_comments": [
                "> JPMorgan is also considering pushing back against the bankruptcy filings of alleged “infinite money” fraudsters.\nIn one of the bank’s motions made this week in bankruptcy court in Grand Rapids, Michigan, the company asked a judge for more time to object to the customer’s attempt to discharge his or her debts.\n\nIt is amazing that people have screwed up their lives and finances for YEARS over a trend they saw online. A ChexSystems blacklist is not a fun thing to deal with.",
                "I mean, if you don’t prosecute every single one of them then some idiot on TikTok will double down and say that this actually worked, and he faced no consequences, and the whole thing will start over again.",
                "I used to work at a bank. It’s amazing how much check fraud is out there and how susceptible young people are to going through with it. \n\nIt’s usually teenagers that get in trouble. Older people give them a bad check to deposit and promise the kids a share of it. Then the adults get 75% or whatever and the kid winds up being on the hook for the whole thing when it bounces. \n\nIt was pretty sad",
                "With everything going on right now, I had forgotten that a bunch of people had committed check fraud while thinking it was a real world \"infinite money glitch.\" As much as I dislike Chase, I'm glad I got reminded, I needed a smile today.",
                "Check Fraud. They committed check fraud.",
                "Fraud not Glitch but what do I know.",
                "It's wild to me that people thought the bank wouldn't go after them.",
                "I still think it’s dumb that the people that did this refer to it as a “glitch”. \n\nBut what else to expect from these people when they use the funds to buy something stupid like a Gucci wallet. It gives me strong PPP loan without a business vibes. ",
                "“Infinite money glitch” aka fraud",
                "Of all the institutions to mess with, these bozos chose JP Morgan Chase. Zero sympathies."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Protester tased by police at Marjorie Taylor Greene's Georgia town hall",
            "external_url": "https://apnews.com/video/demonstrator-apprehended-during-congresswoman-marjorie-taylor-greenes-georgia-town-hall-34521ef711774381acc3e94863a6d371",
            "upvotes": 3949,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "My favorite part is that she reportedly said something along the lines that she doesn't tolerate heckling at her town halls.\n\nThis is after all she has ever done is heckle, scream, and rant conspiracy theories for the last 4 years during Biden's administration. The hypocrisy is palpable.",
                "MtG and Boebert screeched like howler monkeys and heckled Biden during his state of the union address. This is rich coming from this hypocritical cu*t. ",
                "I take it she should have been tased at Biden’s SotU address? 🤔",
                "\"sit and listen\"  \nLady, this is a town hall, not a re-education camp.",
                "So she was removing anybody who stood up and disagreed with her? And they'd get tased if they didn't listen? Party of free speech, everybody.",
                "Of course it would be at a MTG event...",
                "I guess she didn’t want to listen to her constituents concerns.  And this coming from one the best hecklers in the party.",
                "Just a reminder that when public figures respond to questions from the public with violence, it is a sure sign of weakness, not of strength.",
                "Can’t fucken wait for her reckoning. Insider trader would be a great take down. \n\nLock her up. \n\nJust an awful human being and a horrible American and “patriot”",
                "Here's how you combat this: \n\nFind your fellow heckler. Establish an order. Only one heckler at a time. Don't stand up. \n\nWhen approached by authorities, quickly volunteer to leave with no resistance. \n\nAs one heckler gets all the attention from the authorities and is escorted from the room, the other starts up. This will delay the response to the 2nd heckler. \n\nStay seated. Why? Because eventually, the authorities won't be able to identify who's heckling, or will heckle next.   It also makes you less of a threat. Supporters of the crook will aim to accuse the hecklers in their midst, creating confusion. \n\nContinue until governance is improved."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Missing toddler who walked 7 miles alone through Arizona wilderness led to safety by rancher's dog",
            "external_url": "https://www.nbcnews.com/news/us-news/missing-toddler-walked-7-miles-alone-arizona-wilderness-led-safety-ran-rcna201479?utm_source=firefox-newtab-en-us",
            "upvotes": 1152,
            "date": "04/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250416-kid-rescue-ch-0514-b0f001.jpg",
            "top_comments": [
                "\n\"I got in my truck to go to town and I see Buford walking down the side of the fence with a little blond kid with him. I had heard about the missing child this morning, so I knew it was him.\"\n\n\nBuford, (best name ever), probably only walked with him about a mile, but the dog did find him.",
                "I hope Buford got a nice treat for being a good boy.",
                "the goodest of good boys.",
                "Cause dogs are awesome. ",
                "I have a Pyrenees mix (Buford is a full Pyr) and they are one of the smartest and self-sufficient dog breeds.  They can make decisions on their own and I can believe the doggo worked out that the kid shouldn't have been there and that the best thing to do was to lead him home, like a sheep.  They are also hard headed and stubborn, because they believe they are smarter than we are...",
                "Buford finds small human, herds him to safety. Dogs are the best.",
                "7 miles for a 2 year old!",
                "It followed me home, dad, can I keep him?",
                "Great to read a positive story with a good ending",
                "I mean two year old went seven miles over rugged land with probably no trails in 16 hours? Told the rancher he was under a tree so he was not moving the whole time. Few adults could walk 16 hours straight in any event. It seems almost impossible. I wonder if the facts are mixed up a bit. But Buford is the best! All in a days work right?"
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "HOT",
            "title": "The State Department closes the office that flags disinformation from Russia, China and Iran",
            "external_url": "https://apnews.com/article/rubio-disinformation-russia-china-iran-d53d00551a0a57f3114431c624db0b0f?utm_source=reddit&utm_medium=share",
            "upvotes": 1008,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The only flag the State Department cares about now is the white flag to keep bending over for Russia. This country used to know how to handle traitors.",
                "Wonder if anyone on the Right will hear about this.",
                "I would be surprised but I'm not.",
                "Pointless anyway. Didn’t flag Trump‘s blatant Russian propaganda at all",
                "..and Palm Beach County Florida..",
                "cant say theyve been working hard anyway for the past oh... 10 years?...",
                "Yes they're clicking their hobnail boots together wishing away any kind of entity that points out disinformation. Think about it it's in their own best interest to normalize disinformation these are the stepping Stones of authoritarian government. There is a video on YouTube called don't be a sucker from the end of world War II put out by the army people might want to watch.",
                "At some point the middle manager should realize he's the only one with sense and just stop listening to his seniors.",
                "The government also shut down the department that verifies federal data before it is published.  So much winning.",
                "totally not compromised, nope"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Rapper Lil Nas X hospitalized after experiencing partial facial paralysis",
            "external_url": "https://www.denver7.com/entertainment/celebrity/rapper-lil-nas-x-hospitalized-after-experiencing-partial-facial-paralysis",
            "upvotes": 1767,
            "date": "04/16/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/3be5c82/2147483647/strip/true/crop/3371x1770+0+235/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F9c%2F21%2F2645e6684de2b4cc55920fb0d407%2Fap24173716356680.jpg",
            "top_comments": [
                "> The video shows him in a hospital bed, attempting to smile. \"This is me doing a full smile right now by the way,\" he said, as only half his face can be seen smiling.\n\"I can't even laugh right,\" he added.\n\nI hope he makes a full recovery. Suddenly experiencing paralysis in any part of your body has to be deeply frightening.",
                "Bells palsey is surprisingly common. Most often caused due to stress. I had it happen to me in my early 20s.  Had to take steroids for about a month and everything was fine. ",
                "I had partial facial paralysis last year, turned out it was lyme disease. Check for ticks y'all, it's no joke",
                "Can be any number of issues.  Hopefully something easily treatable and resolved.  Facial paralysis is absolutely frightening though.",
                "This happened to me with hemiplegic migraines on and off for a while and hasn’t happened again for a few years now - incredibly scary. I hope his resolves quickly and is a (relatively) minor issue as well",
                "PSA for everyone that a very rare, benign brain tumour called an **acoustic neuroma** or **vestibular schwannoma** would also potentially be on the differential with unilateral facial drooping like this. It's not always Bell's palsy or a stroke or Lyme disease.\n\nUnilateral facial drooping is absolutely *not* the only symptom of this type of tumour, but if accompanied by gradual hearing loss, suspicion is stronger. Celebrities affected by AN/VS have included:\n\n* Singer/rapper Tionne \"T-Boz\" Watkins of TLC;\n* Actor Mark Ruffalo;\n* Comedian/artist Vic Reeves;\n* Actor Tara Subkoff.\n\nMark, Vic and Tara have all been left with almost total or complete single-sided deafness following surgical resection, plus nerve damage and/or facial drooping. I'm unsure about any complications experienced by T-Boz, but she was initially refused surgery due to the potential complications associated with her sickle cell disease.\n\nPeople who carry the *neurofibromatosis type II* (NF2) genetic mutation are especially susceptible to benign tumours of the brain and spinal cord, as well as peripheral nerves, including acoustic neuromas.",
                "Hope he recovers",
                "Had this happen to a friend. The doctors didn’t know what caused it. He regained full use after a couple of months.",
                "Ouch! I had bells palsy twice. \nIt's  been years, but my face still feels weak on the right side.",
                "Might be a palsy or something. It's scary when your body suddenly goes haywire for no clear reason."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Colossal squid filmed by scientists for first time in ocean",
            "external_url": "https://www.bbc.com/news/articles/c99pg13yv32o",
            "upvotes": 1536,
            "date": "04/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2bb2/live/f2155750-1ad0-11f0-8a1e-3ff815141b98.jpg",
            "top_comments": [
                "Excerpt from Lewis Adams, BBC News - Essex:\n\nA colossal squid has been filmed in its natural environment for the first time since the species was discovered 100 years ago.\n\nThe 30cm-long (11.8in) juvenile was caught on camera at a depth of 600m (1,968ft), near the South Sandwich Islands in the south Atlantic Ocean.\n\nA team of scientists, led by a University of Essex academic, recorded the footage in March during a 35-day quest to find new marine life.\n\nExperts believe colossal squid can grow up to 7m (23ft) in length and weigh up to 500kg (1,100lb) - making them the heaviest invertebrate on the planet.\n\nThe mollusc was discovered on the 100-year anniversary of it first being identified and named.",
                "What a wee little sea monster. This is actually really amazing footage.",
                "Can grow up to 23 feet and weigh as much as 1,100 pounds. Jesus. lol.",
                "Francine did it first",
                "Hey, malacologist here for anyone confused- “colossal squid” is the animal’s common name (like “blue whale” or “human”), rather than a description of this particular animal. Adult colossal squid are the largest known molluscs (and in fact the largest known invertebrate), at least by weight, but how big they can really get isn’t really known.\n\nColossal Squid are deep-sea animals, and due to not needing air they rarely, if ever come close to the surface- the youngest animals usually live deeper than 500m down, and adults are even larger. Before now, the vast majority of colossal squids found have been dead- IiRC the animal was first described from beaks found in Sperm Whale stomachs, and a few animals have been found since. In the last few decades they have been filmed, but the ones we’ve seen before now have been pulled up by fishing nets- there’s quite a famous video of one that was dragged up while holding on to a Patagonian Toothfish it had caught. Even larger juveniles are *huge,* and the aforementioned squid was still massive. Caught specimens also tend to shrink significantly after death, which makes them difficult to measure.\n\nThey’re often compared with the Giant Squid, but they aren’t closely related. Giant squid might possibly get *longer*, but Colossal Squid are much bulkier/heavier.\n\nFilming one in its natural habitat is such a big deal because it’s our first chance to see how they behave “normally.” The animal is very poorly known as a result of how difficult it is to observe them (for reference, my area for most of my adult life (so far) was studying squid, I had a special interest in Colossal squid, and *I* barely know anything about them). I’d argue they’re probably one of the most enigmatic animals out there. \n\nI think they’re also often suggested to be the inspiration behind The Kraken, although I’d personally argue depictions of that particular mythological beast always seem to be more like Octopuses (which can still get pretty large, but not to this degree).\n\nHope that explains a bit why people are so excited about this!",
                "# Detecting multiple leviathan class lifeforms in the region. Are you certain whatever you're doing is worth it?",
                "Colossal squid filmed for the first time.\n\n*Actually read the article*, the 30cm squid.\n\n*deception*",
                "Francine found this like 17 years ago",
                "Marine scientists really fucked up by finding a big ass squid and naming it the Giant Squid only to almost immediately find an even bigger squid.\n\nWhat happens if we find a bigger squid than the colossal? Is that going to be the Mega Squid? Gargantuan Squid? Titan Squid? \n\nI say we revert the squid taxonomy to Baby Shark conventions - Baby Squid, Mommy Squid, Daddy Squid, etc.",
                "What is this? A colossal squid for ants???"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "HOT",
            "title": "Powell indicates tariffs could pose a challenge for the Fed between controlling inflation and boosting growth",
            "external_url": "https://www.cnbc.com/2025/04/16/powell-indicates-tariffs-could-pose-a-two-pronged-policy-challenge-for-the-fed-.html",
            "upvotes": 712,
            "date": "04/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118631-1742416270572-gettyimages-2205916763-_d1_2564_gcp4rfzx.jpeg?v=1742416478&w=1920&h=1080",
            "top_comments": [
                "Powell is trying, extremely hard, to get it through the Trump admins thick, idiot skulls that the are risking stagflation, a true doomsday scenario for the US economy, without saying that outright and causing a mass panic.",
                "It takes a special kind of idiot to cause stagflation.",
                "How long until Trump tries to have Powell sent to El Salvador?",
                "Shit, I could've told you that",
                "You ain't ever defeating the legendary Tariff Otaku when he wakes up from his nap for more Tariffs.\n\nTrump's entire world view is Zero Sum and genuinely believes that Trade Deficits are us mailing cash to other countries so he believes that all trade is bad and it should stop, There are no \"deals\" to be made because the Tariffs themselves are the endgoal.",
                "Well no shit, it’s the natural result of the recent [fiscal ventriloquism](https://open.substack.com/pub/guidance404/p/fiscal-ventriloquism-and-trade-war) we’re seeing play out in real time.",
                "In other news. Water is wet.",
                "Donald WANTS inflation. \n\nHe WANTS a devaluation of the Dollar to make it more competitive for selling items abroad.",
                "Inflation and stagnation. I suppose they did want to bring back the days of Reagan.",
                "Well, of course. Stagflation tends to do that and is a special kind of economic hell."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "United Airlines flight sees engine fire after takeoff due to apparent rabbit strike",
            "external_url": "https://abcnews.go.com/US/united-airlines-flight-rabbit-strike-engine-fire/story?id=120873872",
            "upvotes": 290,
            "date": "04/16/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/40beca1b-1551-4a00-a966-77cce1203bbc/rabbit-1-ht-er-250416_1744821466140_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Flying rabbits! What next? Pigs?",
                "So Easter is cancelled this year?",
                "Perhaps it would help if we ran away some more.",
                "sounds like an early draft of Donnie Darko",
                "Ok, which one of you sucked the Easter Bunny into the engine?",
                "Was this at O'hare by any chance? I'll get my coat..",
                "\"...It's only a fracking rabbit!!!!.....\"\n\n\"RUN AWAY, RUN AWAY\"",
                "I think I know how it happened:\n\n[The rabbit in question](https://www.reddit.com/r/Rabbits/comments/4ryx3d/a_rabbit_doing_a_monumentally_long_ski_jump_or/)",
                "Put the bunny back in the box",
                "First penguins are causing helicopter crashes, now rabbits are sabotaging planes?  I think the animals are angry at us."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Trump DOJ files civil suit against Maine in standoff over transgender athletes in women's sports",
            "external_url": "https://abcnews.go.com/Politics/trump-doj-files-civil-suit-maine-standoff-transgender/story?id=120858499",
            "upvotes": 112,
            "date": "04/16/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e40d78d8-6d5c-40b0-bee6-8741ad03ff28/pam-bondi-1-rt-gmh-250416_1744807252714_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "There are TWO openly transgender athletes in Maine.  Estimates of around 100 nationally.  This shit is so ridiculous.  How much time, effort, money, and hatred, can they spew over such a miniscule number of people?",
                "There’s the “state’s rights” party we all know.",
                "States rights! States rights! States rights!\n\nWhat a bunch of two-faced, lying dirtbags the GOP are. States rights! But only if you're not gay or trans or trying to read anything that we might consider gay or trans, or getting married to other gays or trans, or teaching your children about gay or trans... The list of exclusions and provisos for \"states rights!\" goes on and fucking on.",
                "Time to whip the bigots into a frenzy to distract from them from the cratering economy.",
                "Trump says states have the authority and autonomy to decide abortion issues, but not transgender issues.",
                "Can't Maine just do what Trump does, and ignore court orders?",
                "Like this administration knows anything about civil rights.",
                "What standing does the federal government have in such a suit?",
                "\"State's rights\" indeed.\n\nFor the record, the number of bills prohibiting trans players actually outnumbers the trans players themselves. And this whole ridiculous thing - which should have been addressed by the individual sporting organizations in the first place, if needed to be addressed at all - as become this hotbutton topic despite the low number of players in question, and despite the complete lack of data or information backing up any of the concerns Republicans claim to have about this situation.",
                "what standing do they have here?  They literally aren't an impacted party."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Police stun 2 demonstrators at Rep. Marjorie Taylor Greene's town hall.",
            "external_url": "https://www.nbcnews.com/politics/congress/police-tase-2-demonstrators-marjorie-taylor-greene-town-hall-acworth-rcna201457",
            "upvotes": 79,
            "date": "04/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250415-marjorie-taylor-greene-ac-1002p-fe8a04.jpg",
            "top_comments": [
                "She's still holding town halls???"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "United Airlines flight sees engine fire after takeoff due to apparent rabbit strike",
            "external_url": "https://abcnews.go.com/US/united-airlines-flight-rabbit-strike-engine-fire/story?id=120873872",
            "upvotes": 291,
            "date": "04/16/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/40beca1b-1551-4a00-a966-77cce1203bbc/rabbit-1-ht-er-250416_1744821466140_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Flying rabbits! What next? Pigs?",
                "So Easter is cancelled this year?",
                "Perhaps it would help if we ran away some more.",
                "sounds like an early draft of Donnie Darko",
                "Ok, which one of you sucked the Easter Bunny into the engine?",
                "Was this at O'hare by any chance? I'll get my coat..",
                "\"...It's only a fracking rabbit!!!!.....\"\n\n\"RUN AWAY, RUN AWAY\"",
                "I think I know how it happened:\n\n[The rabbit in question](https://www.reddit.com/r/Rabbits/comments/4ryx3d/a_rabbit_doing_a_monumentally_long_ski_jump_or/)",
                "Put the bunny back in the box",
                "First penguins are causing helicopter crashes, now rabbits are sabotaging planes?  I think the animals are angry at us."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "The State Department closes the office that flags disinformation from Russia, China and Iran",
            "external_url": "https://apnews.com/article/rubio-disinformation-russia-china-iran-d53d00551a0a57f3114431c624db0b0f?utm_source=reddit&utm_medium=share",
            "upvotes": 1009,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The only flag the State Department cares about now is the white flag to keep bending over for Russia. This country used to know how to handle traitors.",
                "Wonder if anyone on the Right will hear about this.",
                "I would be surprised but I'm not.",
                "Pointless anyway. Didn’t flag Trump‘s blatant Russian propaganda at all",
                "..and Palm Beach County Florida..",
                "cant say theyve been working hard anyway for the past oh... 10 years?...",
                "Yes they're clicking their hobnail boots together wishing away any kind of entity that points out disinformation. Think about it it's in their own best interest to normalize disinformation these are the stepping Stones of authoritarian government. There is a video on YouTube called don't be a sucker from the end of world War II put out by the army people might want to watch.",
                "At some point the middle manager should realize he's the only one with sense and just stop listening to his seniors.",
                "The government also shut down the department that verifies federal data before it is published.  So much winning.",
                "totally not compromised, nope"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Missing toddler who walked 7 miles alone through Arizona wilderness led to safety by rancher's dog",
            "external_url": "https://www.nbcnews.com/news/us-news/missing-toddler-walked-7-miles-alone-arizona-wilderness-led-safety-ran-rcna201479?utm_source=firefox-newtab-en-us",
            "upvotes": 1148,
            "date": "04/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250416-kid-rescue-ch-0514-b0f001.jpg",
            "top_comments": [
                "\n\"I got in my truck to go to town and I see Buford walking down the side of the fence with a little blond kid with him. I had heard about the missing child this morning, so I knew it was him.\"\n\n\nBuford, (best name ever), probably only walked with him about a mile, but the dog did find him.",
                "I hope Buford got a nice treat for being a good boy.",
                "the goodest of good boys.",
                "Cause dogs are awesome. ",
                "I have a Pyrenees mix (Buford is a full Pyr) and they are one of the smartest and self-sufficient dog breeds.  They can make decisions on their own and I can believe the doggo worked out that the kid shouldn't have been there and that the best thing to do was to lead him home, like a sheep.  They are also hard headed and stubborn, because they believe they are smarter than we are...",
                "Buford finds small human, herds him to safety. Dogs are the best.",
                "7 miles for a 2 year old!",
                "It followed me home, dad, can I keep him?",
                "Great to read a positive story with a good ending",
                "I mean two year old went seven miles over rugged land with probably no trails in 16 hours? Told the rancher he was under a tree so he was not moving the whole time. Few adults could walk 16 hours straight in any event. It seems almost impossible. I wonder if the facts are mixed up a bit. But Buford is the best! All in a days work right?"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "NEW",
            "title": "Powell indicates tariffs could pose a challenge for the Fed between controlling inflation and boosting growth",
            "external_url": "https://www.cnbc.com/2025/04/16/powell-indicates-tariffs-could-pose-a-two-pronged-policy-challenge-for-the-fed-.html",
            "upvotes": 710,
            "date": "04/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118631-1742416270572-gettyimages-2205916763-_d1_2564_gcp4rfzx.jpeg?v=1742416478&w=1920&h=1080",
            "top_comments": [
                "Powell is trying, extremely hard, to get it through the Trump admins thick, idiot skulls that the are risking stagflation, a true doomsday scenario for the US economy, without saying that outright and causing a mass panic.",
                "It takes a special kind of idiot to cause stagflation.",
                "How long until Trump tries to have Powell sent to El Salvador?",
                "Shit, I could've told you that",
                "You ain't ever defeating the legendary Tariff Otaku when he wakes up from his nap for more Tariffs.\n\nTrump's entire world view is Zero Sum and genuinely believes that Trade Deficits are us mailing cash to other countries so he believes that all trade is bad and it should stop, There are no \"deals\" to be made because the Tariffs themselves are the endgoal.",
                "Well no shit, it’s the natural result of the recent [fiscal ventriloquism](https://open.substack.com/pub/guidance404/p/fiscal-ventriloquism-and-trade-war) we’re seeing play out in real time.",
                "In other news. Water is wet.",
                "Donald WANTS inflation. \n\nHe WANTS a devaluation of the Dollar to make it more competitive for selling items abroad.",
                "Inflation and stagnation. I suppose they did want to bring back the days of Reagan.",
                "Well, of course. Stagflation tends to do that and is a special kind of economic hell."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "California the 1st state to sue Trump administration over tariffs",
            "external_url": "https://www.cbc.ca/news/world/california-newsom-trump-tariffs-1.7511493",
            "upvotes": 5342,
            "date": "04/16/2025",
            "thumbnail": "https://i.cbc.ca/1.7511588.1744814544!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_1180/usa-trump.JPG?im=Resize%3D620",
            "top_comments": [
                "Makes a lot of sense. Out of the 50 states, California has the largest economy — the tariffs would significantly impact the golden state",
                "Here's to hoping he gets a preliminary injunction. The Supreme Court will side with Trump in the end, but not if Republicans finally grow a spine and help pass a bill that limits Trump's powers.",
                "I don't think this lawsuit will go anywhere, and will probably be thrown out since tariffs are an international issue with the federal government, not with states.\n\nBut more power to him to try.",
                "What use is a lawsuit to someone who doesn’t even have to obey the Supreme Court?",
                "Sue his ass for everything at this point",
                "Till now this president has done nothing good for America. But he has done a lot for Russia",
                "I like this lawsuit. I think California has standing. That said I think this is the wrong venue. The US has the US Court of International Trade to handle this dispute. I hope I'm wrong but I suspect they will be told to refile in the Trade court rather then Northern District.",
                "This won’t go anywhere. Trump is above the law.\n\nThis was always the obvious danger. The one and only _real_ check on the executive branch is impeachment followed by removal from office, and the Republicans already made it clear there are literally no circumstances under which they would do that.\n\nWithout the real risk of removal from office, everything - even following court orders - is just a norm/convention.",
                "LETS GO Washington, Oregon, Illinois... get on board with this.",
                "As ashamed as I am to be American these days, I'm proud to be a Californian."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "NEW",
            "title": "EU tightens asylum rules with list of 7 safe countries",
            "external_url": "https://dw.com/en/eu-tightens-asylum-rules-with-list-of-7-safe-countries/a-72261352",
            "upvotes": 185,
            "date": "04/16/2025",
            "thumbnail": "https://static.dw.com/image/68608932_6.jpg",
            "top_comments": [
                "ARTICLE:\n\nThe European Union on Wednesday published a list of seven countries that it considers “safe,” as member states seek to speed up migrant returns.\n\nThe list includes Kosovo, Bangladesh, Colombia, Egypt, India, Morocco and Tunisia.\n\nWHAT DOES THIS MEAN FOR ASYLUM CLAIMS?\n\nThe expanded list means EU member states will process applications from the countries deemed safe using an accelerated procedure because they have a low chance of success.\n\n“Many member states are facing a significant backlog of asylum applications, so anything we can do now to support faster asylum decisions is essential,” said Magnus Brunner, the EU’s commissioner for migration.\n\nAlthough the EU presented a similar list in 2015, the plan was abandoned due to heated debates over whether or not to include Turkey.\n\nWHY IS THE CHANGE BEING MADE NOW?\n\nBrussels is under mounting pressure to crack down on irregular arrivals and ramp up deportations, as hard-right parties ride a wave of anti-migrant sentiment across Europe.\n\nHawks including Sweden, Italy, Denmark and the Netherlands in October demanded fast-tracked legislation to boost returns — and urged the Commission to act swiftly.\n\nItalian Interior Minister Matteo Piantedosi said the change “constitutes a success for the Italian government, which has always worked both at a bilateral and multilateral level to obtain the revision of the regulation.”",
                "India assassinated political dissidents in Canada! But the EU thinks they won't do it in their own country?!\n\nEgypt openly arrests political opposition!",
                "Wait if I understood this correctly they now want asylum seekers back? Huh?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Rapper Lil Nas X hospitalized after experiencing partial facial paralysis",
            "external_url": "https://www.denver7.com/entertainment/celebrity/rapper-lil-nas-x-hospitalized-after-experiencing-partial-facial-paralysis",
            "upvotes": 1774,
            "date": "04/16/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/3be5c82/2147483647/strip/true/crop/3371x1770+0+235/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F9c%2F21%2F2645e6684de2b4cc55920fb0d407%2Fap24173716356680.jpg",
            "top_comments": [
                "> The video shows him in a hospital bed, attempting to smile. \"This is me doing a full smile right now by the way,\" he said, as only half his face can be seen smiling.\n\"I can't even laugh right,\" he added.\n\nI hope he makes a full recovery. Suddenly experiencing paralysis in any part of your body has to be deeply frightening.",
                "Bells palsey is surprisingly common. Most often caused due to stress. I had it happen to me in my early 20s.  Had to take steroids for about a month and everything was fine. ",
                "I had partial facial paralysis last year, turned out it was lyme disease. Check for ticks y'all, it's no joke",
                "Can be any number of issues.  Hopefully something easily treatable and resolved.  Facial paralysis is absolutely frightening though.",
                "This happened to me with hemiplegic migraines on and off for a while and hasn’t happened again for a few years now - incredibly scary. I hope his resolves quickly and is a (relatively) minor issue as well",
                "PSA for everyone that a very rare, benign brain tumour called an **acoustic neuroma** or **vestibular schwannoma** would also potentially be on the differential with unilateral facial drooping like this. It's not always Bell's palsy or a stroke or Lyme disease.\n\nUnilateral facial drooping is absolutely *not* the only symptom of this type of tumour, but if accompanied by gradual hearing loss, suspicion is stronger. Celebrities affected by AN/VS have included:\n\n* Singer/rapper Tionne \"T-Boz\" Watkins of TLC;\n* Actor Mark Ruffalo;\n* Comedian/artist Vic Reeves;\n* Actor Tara Subkoff.\n\nMark, Vic and Tara have all been left with almost total or complete single-sided deafness following surgical resection, plus nerve damage and/or facial drooping. I'm unsure about any complications experienced by T-Boz, but she was initially refused surgery due to the potential complications associated with her sickle cell disease.\n\nPeople who carry the *neurofibromatosis type II* (NF2) genetic mutation are especially susceptible to benign tumours of the brain and spinal cord, as well as peripheral nerves, including acoustic neuromas.",
                "Hope he recovers",
                "Had this happen to a friend. The doctors didn’t know what caused it. He regained full use after a couple of months.",
                "Ouch! I had bells palsy twice. \nIt's  been years, but my face still feels weak on the right side.",
                "Might be a palsy or something. It's scary when your body suddenly goes haywire for no clear reason."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Colossal squid filmed by scientists for first time in ocean",
            "external_url": "https://www.bbc.com/news/articles/c99pg13yv32o",
            "upvotes": 1539,
            "date": "04/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2bb2/live/f2155750-1ad0-11f0-8a1e-3ff815141b98.jpg",
            "top_comments": [
                "Excerpt from Lewis Adams, BBC News - Essex:\n\nA colossal squid has been filmed in its natural environment for the first time since the species was discovered 100 years ago.\n\nThe 30cm-long (11.8in) juvenile was caught on camera at a depth of 600m (1,968ft), near the South Sandwich Islands in the south Atlantic Ocean.\n\nA team of scientists, led by a University of Essex academic, recorded the footage in March during a 35-day quest to find new marine life.\n\nExperts believe colossal squid can grow up to 7m (23ft) in length and weigh up to 500kg (1,100lb) - making them the heaviest invertebrate on the planet.\n\nThe mollusc was discovered on the 100-year anniversary of it first being identified and named.",
                "What a wee little sea monster. This is actually really amazing footage.",
                "Can grow up to 23 feet and weigh as much as 1,100 pounds. Jesus. lol.",
                "Francine did it first",
                "Hey, malacologist here for anyone confused- “colossal squid” is the animal’s common name (like “blue whale” or “human”), rather than a description of this particular animal. Adult colossal squid are the largest known molluscs (and in fact the largest known invertebrate), at least by weight, but how big they can really get isn’t really known.\n\nColossal Squid are deep-sea animals, and due to not needing air they rarely, if ever come close to the surface- the youngest animals usually live deeper than 500m down, and adults are even larger. Before now, the vast majority of colossal squids found have been dead- IiRC the animal was first described from beaks found in Sperm Whale stomachs, and a few animals have been found since. In the last few decades they have been filmed, but the ones we’ve seen before now have been pulled up by fishing nets- there’s quite a famous video of one that was dragged up while holding on to a Patagonian Toothfish it had caught. Even larger juveniles are *huge,* and the aforementioned squid was still massive. Caught specimens also tend to shrink significantly after death, which makes them difficult to measure.\n\nThey’re often compared with the Giant Squid, but they aren’t closely related. Giant squid might possibly get *longer*, but Colossal Squid are much bulkier/heavier.\n\nFilming one in its natural habitat is such a big deal because it’s our first chance to see how they behave “normally.” The animal is very poorly known as a result of how difficult it is to observe them (for reference, my area for most of my adult life (so far) was studying squid, I had a special interest in Colossal squid, and *I* barely know anything about them). I’d argue they’re probably one of the most enigmatic animals out there. \n\nI think they’re also often suggested to be the inspiration behind The Kraken, although I’d personally argue depictions of that particular mythological beast always seem to be more like Octopuses (which can still get pretty large, but not to this degree).\n\nHope that explains a bit why people are so excited about this!",
                "# Detecting multiple leviathan class lifeforms in the region. Are you certain whatever you're doing is worth it?",
                "Colossal squid filmed for the first time.\n\n*Actually read the article*, the 30cm squid.\n\n*deception*",
                "Francine found this like 17 years ago",
                "Marine scientists really fucked up by finding a big ass squid and naming it the Giant Squid only to almost immediately find an even bigger squid.\n\nWhat happens if we find a bigger squid than the colossal? Is that going to be the Mega Squid? Gargantuan Squid? Titan Squid? \n\nI say we revert the squid taxonomy to Baby Shark conventions - Baby Squid, Mommy Squid, Daddy Squid, etc.",
                "What is this? A colossal squid for ants???"
            ],
            "aggregate_sentiment": 87.0
        },
        {
            "category": "RISING",
            "title": "California the 1st state to sue Trump administration over tariffs",
            "external_url": "https://www.cbc.ca/news/world/california-newsom-trump-tariffs-1.7511493",
            "upvotes": 5369,
            "date": "04/16/2025",
            "thumbnail": "https://i.cbc.ca/1.7511588.1744814544!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_1180/usa-trump.JPG?im=Resize%3D620",
            "top_comments": [
                "Makes a lot of sense. Out of the 50 states, California has the largest economy — the tariffs would significantly impact the golden state",
                "Here's to hoping he gets a preliminary injunction. The Supreme Court will side with Trump in the end, but not if Republicans finally grow a spine and help pass a bill that limits Trump's powers.",
                "I don't think this lawsuit will go anywhere, and will probably be thrown out since tariffs are an international issue with the federal government, not with states.\n\nBut more power to him to try.",
                "What use is a lawsuit to someone who doesn’t even have to obey the Supreme Court?",
                "Sue his ass for everything at this point",
                "Till now this president has done nothing good for America. But he has done a lot for Russia",
                "I like this lawsuit. I think California has standing. That said I think this is the wrong venue. The US has the US Court of International Trade to handle this dispute. I hope I'm wrong but I suspect they will be told to refile in the Trade court rather then Northern District.",
                "This won’t go anywhere. Trump is above the law.\n\nThis was always the obvious danger. The one and only _real_ check on the executive branch is impeachment followed by removal from office, and the Republicans already made it clear there are literally no circumstances under which they would do that.\n\nWithout the real risk of removal from office, everything - even following court orders - is just a norm/convention.",
                "LETS GO Washington, Oregon, Illinois... get on board with this.",
                "As ashamed as I am to be American these days, I'm proud to be a Californian."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "The State Department closes the office that flags disinformation from Russia, China and Iran",
            "external_url": "https://apnews.com/article/rubio-disinformation-russia-china-iran-d53d00551a0a57f3114431c624db0b0f?utm_source=reddit&utm_medium=share",
            "upvotes": 1014,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The only flag the State Department cares about now is the white flag to keep bending over for Russia. This country used to know how to handle traitors.",
                "Wonder if anyone on the Right will hear about this.",
                "I would be surprised but I'm not.",
                "Pointless anyway. Didn’t flag Trump‘s blatant Russian propaganda at all",
                "..and Palm Beach County Florida..",
                "cant say theyve been working hard anyway for the past oh... 10 years?...",
                "Yes they're clicking their hobnail boots together wishing away any kind of entity that points out disinformation. Think about it it's in their own best interest to normalize disinformation these are the stepping Stones of authoritarian government. There is a video on YouTube called don't be a sucker from the end of world War II put out by the army people might want to watch.",
                "At some point the middle manager should realize he's the only one with sense and just stop listening to his seniors.",
                "The government also shut down the department that verifies federal data before it is published.  So much winning.",
                "totally not compromised, nope"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Missing toddler who walked 7 miles alone through Arizona wilderness led to safety by rancher's dog",
            "external_url": "https://www.nbcnews.com/news/us-news/missing-toddler-walked-7-miles-alone-arizona-wilderness-led-safety-ran-rcna201479?utm_source=firefox-newtab-en-us",
            "upvotes": 1152,
            "date": "04/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250416-kid-rescue-ch-0514-b0f001.jpg",
            "top_comments": [
                "\n\"I got in my truck to go to town and I see Buford walking down the side of the fence with a little blond kid with him. I had heard about the missing child this morning, so I knew it was him.\"\n\n\nBuford, (best name ever), probably only walked with him about a mile, but the dog did find him.",
                "I hope Buford got a nice treat for being a good boy.",
                "the goodest of good boys.",
                "Cause dogs are awesome. ",
                "I have a Pyrenees mix (Buford is a full Pyr) and they are one of the smartest and self-sufficient dog breeds.  They can make decisions on their own and I can believe the doggo worked out that the kid shouldn't have been there and that the best thing to do was to lead him home, like a sheep.  They are also hard headed and stubborn, because they believe they are smarter than we are...",
                "Buford finds small human, herds him to safety. Dogs are the best.",
                "7 miles for a 2 year old!",
                "It followed me home, dad, can I keep him?",
                "Great to read a positive story with a good ending",
                "I mean two year old went seven miles over rugged land with probably no trails in 16 hours? Told the rancher he was under a tree so he was not moving the whole time. Few adults could walk 16 hours straight in any event. It seems almost impossible. I wonder if the facts are mixed up a bit. But Buford is the best! All in a days work right?"
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "United Airlines flight sees engine fire after takeoff due to apparent rabbit strike",
            "external_url": "https://abcnews.go.com/US/united-airlines-flight-rabbit-strike-engine-fire/story?id=120873872",
            "upvotes": 289,
            "date": "04/16/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/40beca1b-1551-4a00-a966-77cce1203bbc/rabbit-1-ht-er-250416_1744821466140_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Flying rabbits! What next? Pigs?",
                "So Easter is cancelled this year?",
                "Perhaps it would help if we ran away some more.",
                "sounds like an early draft of Donnie Darko",
                "Ok, which one of you sucked the Easter Bunny into the engine?",
                "Was this at O'hare by any chance? I'll get my coat..",
                "\"...It's only a fracking rabbit!!!!.....\"\n\n\"RUN AWAY, RUN AWAY\"",
                "I think I know how it happened:\n\n[The rabbit in question](https://www.reddit.com/r/Rabbits/comments/4ryx3d/a_rabbit_doing_a_monumentally_long_ski_jump_or/)",
                "Put the bunny back in the box",
                "First penguins are causing helicopter crashes, now rabbits are sabotaging planes?  I think the animals are angry at us."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Powell indicates tariffs could pose a challenge for the Fed between controlling inflation and boosting growth",
            "external_url": "https://www.cnbc.com/2025/04/16/powell-indicates-tariffs-could-pose-a-two-pronged-policy-challenge-for-the-fed-.html",
            "upvotes": 713,
            "date": "04/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118631-1742416270572-gettyimages-2205916763-_d1_2564_gcp4rfzx.jpeg?v=1742416478&w=1920&h=1080",
            "top_comments": [
                "Powell is trying, extremely hard, to get it through the Trump admins thick, idiot skulls that the are risking stagflation, a true doomsday scenario for the US economy, without saying that outright and causing a mass panic.",
                "It takes a special kind of idiot to cause stagflation.",
                "How long until Trump tries to have Powell sent to El Salvador?",
                "Shit, I could've told you that",
                "You ain't ever defeating the legendary Tariff Otaku when he wakes up from his nap for more Tariffs.\n\nTrump's entire world view is Zero Sum and genuinely believes that Trade Deficits are us mailing cash to other countries so he believes that all trade is bad and it should stop, There are no \"deals\" to be made because the Tariffs themselves are the endgoal.",
                "Well no shit, it’s the natural result of the recent [fiscal ventriloquism](https://open.substack.com/pub/guidance404/p/fiscal-ventriloquism-and-trade-war) we’re seeing play out in real time.",
                "In other news. Water is wet.",
                "Donald WANTS inflation. \n\nHe WANTS a devaluation of the Dollar to make it more competitive for selling items abroad.",
                "Inflation and stagnation. I suppose they did want to bring back the days of Reagan.",
                "Well, of course. Stagflation tends to do that and is a special kind of economic hell."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Rapper Lil Nas X hospitalized after experiencing partial facial paralysis",
            "external_url": "https://www.denver7.com/entertainment/celebrity/rapper-lil-nas-x-hospitalized-after-experiencing-partial-facial-paralysis",
            "upvotes": 1778,
            "date": "04/16/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/3be5c82/2147483647/strip/true/crop/3371x1770+0+235/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F9c%2F21%2F2645e6684de2b4cc55920fb0d407%2Fap24173716356680.jpg",
            "top_comments": [
                "> The video shows him in a hospital bed, attempting to smile. \"This is me doing a full smile right now by the way,\" he said, as only half his face can be seen smiling.\n\"I can't even laugh right,\" he added.\n\nI hope he makes a full recovery. Suddenly experiencing paralysis in any part of your body has to be deeply frightening.",
                "Bells palsey is surprisingly common. Most often caused due to stress. I had it happen to me in my early 20s.  Had to take steroids for about a month and everything was fine. ",
                "I had partial facial paralysis last year, turned out it was lyme disease. Check for ticks y'all, it's no joke",
                "Can be any number of issues.  Hopefully something easily treatable and resolved.  Facial paralysis is absolutely frightening though.",
                "This happened to me with hemiplegic migraines on and off for a while and hasn’t happened again for a few years now - incredibly scary. I hope his resolves quickly and is a (relatively) minor issue as well",
                "PSA for everyone that a very rare, benign brain tumour called an **acoustic neuroma** or **vestibular schwannoma** would also potentially be on the differential with unilateral facial drooping like this. It's not always Bell's palsy or a stroke or Lyme disease.\n\nUnilateral facial drooping is absolutely *not* the only symptom of this type of tumour, but if accompanied by gradual hearing loss, suspicion is stronger. Celebrities affected by AN/VS have included:\n\n* Singer/rapper Tionne \"T-Boz\" Watkins of TLC;\n* Actor Mark Ruffalo;\n* Comedian/artist Vic Reeves;\n* Actor Tara Subkoff.\n\nMark, Vic and Tara have all been left with almost total or complete single-sided deafness following surgical resection, plus nerve damage and/or facial drooping. I'm unsure about any complications experienced by T-Boz, but she was initially refused surgery due to the potential complications associated with her sickle cell disease.\n\nPeople who carry the *neurofibromatosis type II* (NF2) genetic mutation are especially susceptible to benign tumours of the brain and spinal cord, as well as peripheral nerves, including acoustic neuromas.",
                "Hope he recovers",
                "Had this happen to a friend. The doctors didn’t know what caused it. He regained full use after a couple of months.",
                "Ouch! I had bells palsy twice. \nIt's  been years, but my face still feels weak on the right side.",
                "Might be a palsy or something. It's scary when your body suddenly goes haywire for no clear reason."
            ],
            "aggregate_sentiment": 70.0
        },
        {
            "category": "RISING",
            "title": "Protester tased by police at Marjorie Taylor Greene's Georgia town hall",
            "external_url": "https://apnews.com/video/demonstrator-apprehended-during-congresswoman-marjorie-taylor-greenes-georgia-town-hall-34521ef711774381acc3e94863a6d371",
            "upvotes": 3952,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "My favorite part is that she reportedly said something along the lines that she doesn't tolerate heckling at her town halls.\n\nThis is after all she has ever done is heckle, scream, and rant conspiracy theories for the last 4 years during Biden's administration. The hypocrisy is palpable.",
                "MtG and Boebert screeched like howler monkeys and heckled Biden during his state of the union address. This is rich coming from this hypocritical cu*t. ",
                "I take it she should have been tased at Biden’s SotU address? 🤔",
                "\"sit and listen\"  \nLady, this is a town hall, not a re-education camp.",
                "So she was removing anybody who stood up and disagreed with her? And they'd get tased if they didn't listen? Party of free speech, everybody.",
                "Of course it would be at a MTG event...",
                "I guess she didn’t want to listen to her constituents concerns.  And this coming from one the best hecklers in the party.",
                "Just a reminder that when public figures respond to questions from the public with violence, it is a sure sign of weakness, not of strength.",
                "Can’t fucken wait for her reckoning. Insider trader would be a great take down. \n\nLock her up. \n\nJust an awful human being and a horrible American and “patriot”",
                "Here's how you combat this: \n\nFind your fellow heckler. Establish an order. Only one heckler at a time. Don't stand up. \n\nWhen approached by authorities, quickly volunteer to leave with no resistance. \n\nAs one heckler gets all the attention from the authorities and is escorted from the room, the other starts up. This will delay the response to the 2nd heckler. \n\nStay seated. Why? Because eventually, the authorities won't be able to identify who's heckling, or will heckle next.   It also makes you less of a threat. Supporters of the crook will aim to accuse the hecklers in their midst, creating confusion. \n\nContinue until governance is improved."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "JPMorgan Chase sues more customers who allegedly stole cash in 'infinite money glitch'",
            "external_url": "https://www.cnbc.com/2025/04/16/jpmorgan-chase-infinite-money-glitch-bank-lawsuits.html",
            "upvotes": 4466,
            "date": "04/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108065444-1732060726356-gettyimages-2185023708-AFP_36MW3R2.jpeg?v=1732060988&w=1920&h=1080",
            "top_comments": [
                "> JPMorgan is also considering pushing back against the bankruptcy filings of alleged “infinite money” fraudsters.\nIn one of the bank’s motions made this week in bankruptcy court in Grand Rapids, Michigan, the company asked a judge for more time to object to the customer’s attempt to discharge his or her debts.\n\nIt is amazing that people have screwed up their lives and finances for YEARS over a trend they saw online. A ChexSystems blacklist is not a fun thing to deal with.",
                "I mean, if you don’t prosecute every single one of them then some idiot on TikTok will double down and say that this actually worked, and he faced no consequences, and the whole thing will start over again.",
                "I used to work at a bank. It’s amazing how much check fraud is out there and how susceptible young people are to going through with it. \n\nIt’s usually teenagers that get in trouble. Older people give them a bad check to deposit and promise the kids a share of it. Then the adults get 75% or whatever and the kid winds up being on the hook for the whole thing when it bounces. \n\nIt was pretty sad",
                "With everything going on right now, I had forgotten that a bunch of people had committed check fraud while thinking it was a real world \"infinite money glitch.\" As much as I dislike Chase, I'm glad I got reminded, I needed a smile today.",
                "Check Fraud. They committed check fraud.",
                "Fraud not Glitch but what do I know.",
                "It's wild to me that people thought the bank wouldn't go after them.",
                "I still think it’s dumb that the people that did this refer to it as a “glitch”. \n\nBut what else to expect from these people when they use the funds to buy something stupid like a Gucci wallet. It gives me strong PPP loan without a business vibes. ",
                "“Infinite money glitch” aka fraud",
                "Of all the institutions to mess with, these bozos chose JP Morgan Chase. Zero sympathies."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Colossal squid filmed by scientists for first time in ocean",
            "external_url": "https://www.bbc.com/news/articles/c99pg13yv32o",
            "upvotes": 1543,
            "date": "04/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2bb2/live/f2155750-1ad0-11f0-8a1e-3ff815141b98.jpg",
            "top_comments": [
                "Excerpt from Lewis Adams, BBC News - Essex:\n\nA colossal squid has been filmed in its natural environment for the first time since the species was discovered 100 years ago.\n\nThe 30cm-long (11.8in) juvenile was caught on camera at a depth of 600m (1,968ft), near the South Sandwich Islands in the south Atlantic Ocean.\n\nA team of scientists, led by a University of Essex academic, recorded the footage in March during a 35-day quest to find new marine life.\n\nExperts believe colossal squid can grow up to 7m (23ft) in length and weigh up to 500kg (1,100lb) - making them the heaviest invertebrate on the planet.\n\nThe mollusc was discovered on the 100-year anniversary of it first being identified and named.",
                "What a wee little sea monster. This is actually really amazing footage.",
                "Can grow up to 23 feet and weigh as much as 1,100 pounds. Jesus. lol.",
                "Francine did it first",
                "Hey, malacologist here for anyone confused- “colossal squid” is the animal’s common name (like “blue whale” or “human”), rather than a description of this particular animal. Adult colossal squid are the largest known molluscs (and in fact the largest known invertebrate), at least by weight, but how big they can really get isn’t really known.\n\nColossal Squid are deep-sea animals, and due to not needing air they rarely, if ever come close to the surface- the youngest animals usually live deeper than 500m down, and adults are even larger. Before now, the vast majority of colossal squids found have been dead- IiRC the animal was first described from beaks found in Sperm Whale stomachs, and a few animals have been found since. In the last few decades they have been filmed, but the ones we’ve seen before now have been pulled up by fishing nets- there’s quite a famous video of one that was dragged up while holding on to a Patagonian Toothfish it had caught. Even larger juveniles are *huge,* and the aforementioned squid was still massive. Caught specimens also tend to shrink significantly after death, which makes them difficult to measure.\n\nThey’re often compared with the Giant Squid, but they aren’t closely related. Giant squid might possibly get *longer*, but Colossal Squid are much bulkier/heavier.\n\nFilming one in its natural habitat is such a big deal because it’s our first chance to see how they behave “normally.” The animal is very poorly known as a result of how difficult it is to observe them (for reference, my area for most of my adult life (so far) was studying squid, I had a special interest in Colossal squid, and *I* barely know anything about them). I’d argue they’re probably one of the most enigmatic animals out there. \n\nI think they’re also often suggested to be the inspiration behind The Kraken, although I’d personally argue depictions of that particular mythological beast always seem to be more like Octopuses (which can still get pretty large, but not to this degree).\n\nHope that explains a bit why people are so excited about this!",
                "# Detecting multiple leviathan class lifeforms in the region. Are you certain whatever you're doing is worth it?",
                "Colossal squid filmed for the first time.\n\n*Actually read the article*, the 30cm squid.\n\n*deception*",
                "Francine found this like 17 years ago",
                "Marine scientists really fucked up by finding a big ass squid and naming it the Giant Squid only to almost immediately find an even bigger squid.\n\nWhat happens if we find a bigger squid than the colossal? Is that going to be the Mega Squid? Gargantuan Squid? Titan Squid? \n\nI say we revert the squid taxonomy to Baby Shark conventions - Baby Squid, Mommy Squid, Daddy Squid, etc.",
                "What is this? A colossal squid for ants???"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Google sued for £5bn in UK over allegations of shutting out rivals",
            "external_url": "https://www.theguardian.com/technology/2025/apr/16/google-sued-for-5bn-in-uk-over-allegations-of-shutting-out-rivals",
            "upvotes": 553,
            "date": "04/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/892020dae5da3666bf6ee7a6e7c3cdb4d6b310ba/0_0_2124_1274/master/2124.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a43d6e9310c555b9c85327be466bab79",
            "top_comments": [
                "Google anti-competitive!?  Say it ain't so!!!",
                "It's going to have to be the UK/Europe to sue them. We know the US won't do it.",
                "I get it. But also, if I have a bunch of related products that work together I'm gonna try to get my customers to use them. I won't stop them from using anyone else's products, but I wouldn't place a competitors product ahead of mine.\n\n>contracted phone makers to pre-install the Google search app and Chrome browser on Android devices and paid Apple to make it the default search engine on iPhones, with the intention of shutting out competition.\n\nPaying Apple to make Google the default search I'm sure had nothing to do with search and everything to do with ads.\n\nApple only has a large market share in the US. Does Microsoft still make a phone? Android and iOS is basically it. It's hard for one of two options to not be a monopoly.",
                "I think this is the point of the article (but I may be mistaken) : it’s either iOS or Android because Google crushed the rivals; otherwise, you’d have more options."
            ],
            "aggregate_sentiment": 42.0
        }
    ],
    "last_updated": "04/16/2025 20:10:13 UTC"
}