{
    "posts": [
        {
            "category": "HOT",
            "title": "U.S.-citizen family 'traumatized' after ICE raided their Oklahoma home in search of someone else",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-family-traumatized-ice-raid-rcna203700",
            "upvotes": 21205,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-ice-agent-ch-0916-f8729f.jpg",
            "top_comments": [
                "OKLAHOMA CITY (KFOR) — A woman says her family’s fresh start in Oklahoma turned into a nightmare after federal immigration agents raided their home, **taking their phones, laptops, and life savings** – even though they were not the suspects the agents were looking for.\n\nThe agents had a search warrant for the home, but **the suspects listed on the warrant do not live in the house**.\n\nThe woman who actually lives in the house had just moved to Oklahoma City from Maryland with her family about two weeks earlier..\n\n\"I said you took my phone. We have no money. I just moved here,” the mother said. “I have to feed my children. I’m going to need gas money. I need to be able to get around. Like, how do you just leave me like this? Like an abandoned dog.”\n\nShe said the agents ordered her and her daughters to step outside, even though it was raining and they barely were given time to put on clothes.\n\n“**They wanted me to change in front of all of them, in between all of them**,” she said. “My husband has not even seen my daughter in her undergarments — her own dad, because it’s respectful. **You have her out there, a minor, in her underwear,**” the woman told KFOR.\n\n“One of them said, ‘I know it was a little rough this morning,’” she said. “It was so denigrating. That you do all of this to a family, to women, your fellow citizens. And it was a little rough? You literally traumatized me and my daughters for life. We’re going to have to go get help or get over this somehow.”\n\nBefore the agents left, the mother asked when could the family get their belongings back and they said **it could be days or even months,** KFOR reported.\n\nEdit: Other news sources clarified that **20 men** broke into the house in the middle of the night while they were sleeping. So 20 men surrounded this woman and her three young daughters, dragged them out into the rain in their underwear, and made them change clothes in front of them. If there was any justice in this  country they would be up on charges of sexual exploitation of minors.\n\n2nd Edit: The ~~agents~~ stasi thugs wouldn't even leave a business card or phone number they could call to find out how to get their electronics and life savings back. The ~~agents~~ thieves refused to even tell them which government agency or department would be storing their property.",
                "I wonder if that was a real warrant or one of those ICE administrative warrants? Those should be illegal. If police can make their own warrants, that defeats the whole purpose.",
                "More purposeful domestic terrorism - not incompetence - from maga ICE.",
                "They probably broke a bunch of their stuff too.",
                "The more commonplace this becomes the more commonplace it will be for other countries to compare us to the Russians. Is that what Republicans want?",
                "Has Oklahomas senators or ag commented on this or do they support it?",
                "How long will it be until non-government thugs decide to do the same thing? It seems to be a huge opportunity for anyone with no morals, and we have seen how many of those are out there. How would anyone know they weren't from the government?",
                "Not just a raid. This was full on sexual assault and theft. ICE goons deserve to be prosecuted at the Hague like the Nazis they are based on. Instead the US will allow them to do as they please, just like they did with the nazis. Disgusting. I am sad to be american.",
                "Law enforcement needs to be held accountable\n\nEven if you could agree with what ICE is trying to do, any law enforcement agency should be heavily penalized for raiding the wrong goddamn house!\n\nLike are you fucking serious? Somebody easily could have been killed. These are not our best folks.",
                "Must have been an ICE office field trip or something since this was just law enforcement doing their three favorite things: abusing power, stealing, and looking at undressed minors."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "$800,000 in dimes spills onto North Texas highway",
            "external_url": "https://www.fox4news.com/news/truckload-dimes-spills-onto-wise-county-highway",
            "upvotes": 5099,
            "date": "04/30/2025",
            "thumbnail": "https://images.foxtv.com/static.fox4news.com/www.fox4news.com/content/uploads/2025/04/1280/720/dimes.jpg?ve=1&tl=1",
            "top_comments": [
                "_\"Somebody's gotta go back and get a shitload of dimes!\"_",
                "The nearby coinstar is going to be a hotspot for a few days.",
                "I would have liked to hear the sound of the spill.",
                "Good that road needed a major change",
                "Picking up one per second is $360/hr",
                "This feels like the start of a probability question.",
                "Someone’s paying everyone’s toll on the Le Petomane Thruway.",
                "It sounds like one of \"greed\" dreams I used to have when I was down and out.  I'd be grasping for the dimes and then wake up....",
                "Le Petomane Thruway? Now what'll that asshole think of next?",
                "Is this the real life? Is this just fantasy?\n\nWhy is a literal truckload of dimes being transported? Where were they going? To what end? Who needs so many dimes? I have a fairly vivid imagination. I cannot imagine a scenario, based in reality, in which a lorry full of dimes would be required.\n\nAnyone have any good, plausible ideas?"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Middle schooler records himself harassing 5-year-old with ethnic slurs",
            "external_url": "https://www.nbcwashington.com/news/local/northern-virginia/middle-schooler-records-himself-harassing-5-year-old-with-ethnic-slurs/3899952/",
            "upvotes": 16837,
            "date": "04/30/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/04/39225742009-1080pnbcstations.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The 5-year-old went to the door to his house, pleading, “No! Don’t hurt me! Don’t hurt me!”\n\nHe then ran along the porch crying out for other children to help him – “Don’t do it! Save me! Save me!” No one stepped in, and laughter is heard in the background.\n\nThe harassment continued.\n\n“Are you having dumplings for dinner?” the middle schooler asked.\n\nAfter two minutes, the 5-year-old boy’s mother opened the door, and her son ran inside.",
                "As a middle school teacher, sadly I am not suprised.\n\nI teach lots of terrific students, but I'm also exposed to ones that are underparented, undersupervised, and have little ability to function in a civil society.\n\nWe need to find a way to implement consequences for these actions that not only show that we take it seriously, but help the person try to move out of the mindset that lead to this behavior.  Counseling, community service, etc..  Unfortunately, we tend to either do nothing, or incarcerate them once it escalates to violence. Nothing to stop it before that point.",
                "5... pre-k / kindergarten age. This middle school was at least twice their age. Shame on them, and shame on their parents.",
                "What’s up with middle schoolers and being the worst people possible?",
                "Five year olds are literally, and I mean *literally*, just living their best lives. Sure, they have trouble with emotional control sometimes and have meltdowns, but that also means they’re kind when none of us would be kind, they’re happy when none of us would be happy, they’re friendly when none of us would be friendly, they’re inquisitive and funny and compassionate and…just insert all the traits we as adults say we strive for. \n\nSo to see a five year old have this kind of malicious fear deliberately inflicted on them… \n\nI would be hunting the parents down. And I mean that in a predatory sense.",
                "seeing that poor child running to his door and putting the towel over his face is so fucking sad. those middle school kids deserve the worst, they know better than to bully a fucking toddler less than half their age. as someone from the area, these types of middle schoolers grow up into the shittiest and most entitled high schoolers who have never faced consequences",
                "Wow, my heart breaks for the little boy and his parents. But especially the little boy.\n\nCrazy thing is this school says it’s not their problem and police are being silent.\n\nThe community is going to demand justice and this won’t go quietly until people feel the middle schooler(s) are punished justly.\n\nIf this happened to my child, it would take everything in my power to not be vindictive. I don’t think I could remain peaceful.",
                "I wish all hell on the parents who raised that middle school bastard. \n\nI was a middle schooler. I raised middle schoolers. This is not normal and no talk of hormones will make me believe it is.",
                "Very few things make me as angry as seeing bullying like this.  I was bullied as a child and even did some myself when I was young and trying to sort out my way.  I always feel bad about my part, and wish I could go back and apologize to those I hurt.",
                "Genius kid-must have learned it from the parents"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "US and Ukraine sign minerals deal that solidifies investment in Kyiv’s defense against Russia administration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/us-ukraine-minerals-deal-russia",
            "upvotes": 2238,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ac061853d45f740b3b609756c2c36ce1604d153c/0_203_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=21fa8cde98ce0947d6a960f809fae006",
            "top_comments": [
                "*The US and* [*Kyiv*](https://www.theguardian.com/world/ukraine) *have signed an agreement to share profits and royalties from the future sale of Ukrainian minerals and rare earths, sealing a deal that Donald Trump has said will provide an economic incentive for the US to continue to invest in Ukraine’s defense and its reconstruction after he brokers a peace deal with Russia.*\n\nI've read tens of articles on \"the mineral deal\" but never seen a single reference to what the minerals are how they will be mined. Thus, I really wonder how real the projected \"profits and royalties\" to be shared by the two countries. I think most of all this is just political show.  But maybe now we'll see just how real the minerals are. For starters, what are they exactly??",
                "Trump: “So… where are the minerals?”\n\nZelensky: “Over there, there, and there”\n\nTrump: “Wait.. the area is filled with angry Russian army!”\n\nZelensky: “Feel free to kick them out. It’s all yours!”",
                "Making a deal with the devil isn't good but sometimes necessary.",
                "He is going to betray you like the Kurds.",
                "Congrats to Ukraine for being able to close the deal they've been working on for 6 months. Sounds like they got most of what they were looking for.",
                "I think it's overall a good thing. It's a step in the process to bring this stalemate to an end, and a bone to throw to those who question western support for Ukraine. \n\nIt also gives Trump a much clearer reason to support Ukraine. A lot of the territory these minerals are under is currently occupied by Russia. It would be foolish to think that all of it will come back under the control of Ukraine, but now there is a clear reason to support Ukraine in taking back some of it. \n\nUnfortunately for Ukraine, this does equate to a loss of some level of sovereignty. There was never a scenario where a less developed country in the cross-hairs of both Europe and Russia maintained maximal sovereignty though.",
                "Zelenskyy is smart, he knows the next president will waive it.",
                "*Income and contributions to the fund would not be taxed in the US or Ukraine, she said, “to make investments yield the greatest results” and technology transfer and development were a “key” part of the agreement.*\n\nSo no public return, just total extraction of wealth by investors?",
                "Turns out “sign this deal or I’ll let that guy murder you” is a pretty persuasive argument…",
                "That's the look of a man who just signed a deal with the devil. He knows it's evil, but he has no other choice. The USA playing both these countries is just beyond wicked. It's like a little kid playing with his two favorite toy figures in the bathtub. Smashing them together and then crying when one of them breaks and getting a new toy just to shush him. Pathetic that these people dare call themselves adults."
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "HOT",
            "title": "Supreme Court hears arguments over publicly funded Catholic charter school in Oklahoma",
            "external_url": "https://apnews.com/article/supreme-court-religious-catholic-charter-school-oklahoma-983ed57aabeae53e4b58367c5021f5e1",
            "upvotes": 10923,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This one’s gonna suck. They love their private schools being funded by state tax dollars. This is gonna be a big blow to public education…",
                ">Justice Amy Coney Barrett recused herself without explanation. Barrett previously taught law at Notre Dame and is close friends with Notre Dame law professor Nicole Garnett, a leading proponent of publicly funded religious charter schools.\n\nWow a justice doing something right for a change.",
                " If this is allowed, red states are only going to fund religious schools.  Prepare for a complete backslide into the middle ages.",
                "I know someone in Ohio who makes about $250,000 household income that gets free tuition and PUBLIC SCHOOL bus transportation with a voucher program for their three kids. Shit like this already happens.",
                "We don’t want religious schools.\n\nTeach science, not “god’s word” (which is actually man’s word from 3000 years ago and edits ever since).",
                "How did this even make it to scotus? This is an obvious \"F*** no\"",
                "It’s not a real catholic school a real\nCatholic school wouldn’t need public funding.  It’s a for profit school gaining public money from under the guise of religious education",
                "Honestly, props to Coney Barrett for recusing herself.",
                "I hope The Church of Satan starts a charter school.",
                "Republicans are fake patriots"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Invasive Chinese crab that can scale walls spotted for 1st time in US Pacific Northwest",
            "external_url": "https://www.denver7.com/us-news/weird/invasive-chinese-crab-that-can-scale-walls-spotted-for-1st-time-in-us-pacific-northwest",
            "upvotes": 3103,
            "date": "04/30/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/07edff2/2147483647/strip/true/crop/500x263+0+36/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fb5%2Fe5%2Fa0756c304cae8652c5666823a8b6%2Fshutterstock-149549846.jpg",
            "top_comments": [
                "Please tell me they taste good with garlic butter and I'll join the eradication squad.",
                "Thankfully the PNW has excellent resources for marine life management.",
                "Slap a 25% tariff on them.",
                ">\"While this is a rare event in Oregon, mitten crabs caused significant infrastructure and ecological damage in and around San Francisco Bay when the population was at its height in the late 1990s,\" the ODFW said in a statement. \"So, it is important to correctly identify this species and report it to your local ODFW office with the location found.\n\nChinese mitten crab sounds like an adorable name for a crab.",
                "Build higher walls to keep out the crabs! And make them pay for it!!! ",
                "\\*Sigh\n\nGet my cracker and some butter.",
                "Can we attack its weak point for massive damage?",
                "Guys, this is not a problem. You guys have no idea how much that costs in China and how much it costs here to buy.\n\nIf anyone see’s them in abundance, catch them and call a Chinese restaurant. You can sell them for at least $20-30 each.",
                "Time to bust out the garlic and butter.\n\n\nMaybe some black bean sauce crab?",
                "I mean if they taste good I can strip a steamed crab down to the meat in about 2 minutes."
            ],
            "aggregate_sentiment": 70.0
        },
        {
            "category": "HOT",
            "title": "Federal judge in Vermont orders release of Columbia student Mohsen Mahdawi",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/mohsen-mahdawi-released-immigration-detention",
            "upvotes": 7035,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7128145d98ae03c483a557284594d0e9089104ba/0_0_3769_2261/master/3769.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4a5217dac0e17adb2b1b93b9c49660b0",
            "top_comments": [
                "[He’s been released](https://abcnews.go.com/US/lawyers-columbia-student-detained-ice-seek-release-case/story?id=121317902)\n\nI honestly think that contempt threat scared them straight, at least for now",
                "Hence why they try and relocate these people to Louisiana etc immediately to avoid these more liberal federal judges.",
                "> In new court filings submitted on Monday, the justice department included a two-page letter from Marco Rubio, the US secretary of state, saying that Mahdawi’s activities and presence in the US “undermines US policy to combat antisemitism” according to NPR, and that his activities could “potentially undermine the peace process underway in the Middle East”.\n\nWhat fucking peace process? Trump boasted about turning Gaza into a Trump resort. He quite literally supported the idea of a genocide because it was \"good business\".\n\n> Judge Crawford noted at Wednesday's hearing that Mahdawi received letters of support from over 90 community members, including members of the Jewish community, \"who have in a consistent pattern described him as peaceful.\"\n\nI bet they'll claim that those aren't real Jews or something. I fucking hate this administration.",
                "It's important to realise he's been released but that the removal proceedings continue; he's just not in prison while they do so.",
                "How cute, a judicial order? That’s a crime against trump now, so jail for the judge and the order goes in the special filing cabinet for corporate memos 🗑️",
                "Tomorrow we will see this judge arrested",
                "Request: where are we in the timeline in the Garcia case anyway? Wasn't there a deadline yesterday?",
                "Good! Now free Mahmoud Kahlil.\n\nI’m Jewish. I’d rather have these two men as neighbors than any of the chuds on my block.",
                "Thank goodness. I am worried for the safety of the judge, but this was absolutely needed.",
                "For the next one when they drag their feet, just send out all the New England States national guards to extract. See how they like them apples......"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Accused serial cat killer in Santa Ana out of jail",
            "external_url": "https://www.nbclosangeles.com/news/local/accused-serial-cat-killer-santa-ana-out-of-jail/3688302/",
            "upvotes": 505,
            "date": "05/01/2025",
            "thumbnail": "https://media.nbclosangeles.com/2025/04/cat-killer.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "I hate that this coward’s hiding his face and they don’t show his mugshot\n\nHappy they show it here though: https://ktla.com/news/california/santa-ana-pd-condemns-unruly-vigil-after-alleged-cat-killer-released-on-bail/",
                "You gotta seriously be lacking so many things to torture critters like that.\n\nNo empathy, sympathy, remorse, or guilt.",
                "Man, an angry mob sounds great right now",
                "Future serial killer.  Also,  did he not watch Don't Fuck With Cats on Netflix?",
                "He'll bump into a crazy cat lover sooner or later. Wish it happens sooner.",
                "Why was bail allowed if there a multiple witnesses",
                "Seriously though Is there a way that animal shelters can do background checks or something so that way he can't adopt a cat. I really need this person to not be able to come into contact with cats. It's soo sad to think about",
                "I never understand when this kind of things happen. Really disgusting.",
                "[removed]",
                "The cops are more concerned with his safety than anything else. Why is his life more important than the animals he killed?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "11 high schoolers ordered to surrender after lacrosse team hazing in upstate New York",
            "external_url": "https://www.nbcnews.com/news/us-news/high-schoolers-lacrosse-team-hazing-rcna203662",
            "upvotes": 2921,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-westhill-high-school-vl-909a-2fe878.jpg",
            "top_comments": [
                "This is a huge deal for CNY. In a lot of areas of the country Lacrosse is considered a prep-school sport for wealthy kids. In Syracuse metro area it's ingrained in the entire culture. The cancellation of the season can mean the difference for some of these seniors being offered D1 scholarships and being lucky to have a D3 team willing to take them on as walk on's after pulling this shit. Bunch of fucking idiots and they absolutely deserve full punishment.",
                "One victim reported that he went to a lacrosse game and then McDonald's with upperclassmen. But the evening took a turn when he said he was taken to a remote wooded area in the county after the driver of the vehicle pretended to be lost.\n\n“At some point by prearrangement, people came out of the woods all dressed in black. They were armed with what appeared to be at least one handgun and at least one knife,” Fitzpatrick said. “The individual had a pillowcase placed over his head, he was tied up and placed in the trunk of a car.”\n\nThe district attorney said he saw videotape of the incident.\n\n“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,”",
                "No one should receive scholarships after participating in hazing",
                "Hazing usually doesn't involve a loaded firearm...",
                "Geez. When I was in high school, the “hazing” for the band only involved getting water balloons and shaving cream thrown at you.",
                "Senior year of high school, 5 or 6 lacrosse players were expelled for hazing a younger player. My understanding is teabagging and some violating acts with lacross sticks is what happened. Still don’t understand how they were not charged with anything but that was 20+ years ago",
                "*“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,” Fitzpatrick added*\n\nThis almost would have been the least of my worries, given the horrible scenes he had just endured. As in leave me alone anywhere--even on the moon, anything but  what your threatening arms and masks implied.",
                "They will lose their scholarships and join a fraternity instead where they will get to do all of this and more while their “brothers” cheer them on. The fact that fraternities are still a thing is mind blowing to me. I dropped as soon as I got to know the guys and realized that they were some of the dumbest sociopaths at the school.",
                "Hazing is making the pledges dress up in tutus and do interpretive dance in the quad or chucking balloons full of ketchup at them. It does not involve brandishing lethal weapons in a secluded forest. These idiots should all be charged with felony crimes, and the judge should order the lacrosse program shut down for a year. \"But they're just kids!\" They showed up with pistol. Pistols are for killing people. Fuck these \"kids\".",
                "We still have hazing incidents?  WTF? They get what they deserve."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Visa wants to give artificial intelligence 'agents' your credit card",
            "external_url": "https://apnews.com/article/ai-artificial-intelligence-5dfa1da145689e7951a181e2253ab349",
            "upvotes": 1196,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Ideas by someone who’s never used a chatbot before”",
                "Yet another AI thing I don’t want and that won’t ever function correctly anyway.",
                "\\*reads article\\* This sounds incredibly useless.",
                "What people want: robot that folds clothes, empties dishwasher, gives them more free time.\n\nWhat tech makes: robot that you pay to shop for you.\n\nWhat's next, a robot that lists it all on Buy Nothing before it even gets back to the house?",
                "I fail to see how this will work. “Buy me a sweater” OK, here’s the sweatshop that bought the Google Ad space to appear in the recommended/shop results for a sweater. Congrats on your latest purchase that won’t survive the wash.",
                "Like hell I'm gonna use an AI to book travel; even if I trusted that it had the capacity to find the best deal, the bank would just end up making deals with various hotels and airlines to have it prioritize them regardless of price. Wherever there's extra profit to be made, companies will try to squeeze it out of you.",
                "\"Credit card company thinks they could make more money if credit card transactions didn't require the consent or awareness of the account holder\"",
                "Fuck all credit card companies",
                "Unless someone is going to give me an AI that will make money for me there is absolutely no way I am going to let AI spend my money without supervision and if I'm supervising/checking I may as well just do it all to begin with.",
                "It does your grocery shopping for you?  Ha, so instead of incessant advertising trying to get you to choose such-and-such brand, they can just pay whoever runs the AI to decide you want their brand and cut out the human influencing part.  \n\nA new age of marketing is upon us.  I wonder what kind of euphemistic name that'll have."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Accused serial cat killer in Santa Ana out of jail",
            "external_url": "https://www.nbclosangeles.com/news/local/accused-serial-cat-killer-santa-ana-out-of-jail/3688302/",
            "upvotes": 505,
            "date": "05/01/2025",
            "thumbnail": "https://media.nbclosangeles.com/2025/04/cat-killer.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "I hate that this coward’s hiding his face and they don’t show his mugshot\n\nHappy they show it here though: https://ktla.com/news/california/santa-ana-pd-condemns-unruly-vigil-after-alleged-cat-killer-released-on-bail/",
                "You gotta seriously be lacking so many things to torture critters like that.\n\nNo empathy, sympathy, remorse, or guilt.",
                "Man, an angry mob sounds great right now",
                "Future serial killer.  Also,  did he not watch Don't Fuck With Cats on Netflix?",
                "He'll bump into a crazy cat lover sooner or later. Wish it happens sooner.",
                "Why was bail allowed if there a multiple witnesses",
                "Seriously though Is there a way that animal shelters can do background checks or something so that way he can't adopt a cat. I really need this person to not be able to come into contact with cats. It's soo sad to think about",
                "I never understand when this kind of things happen. Really disgusting.",
                "[removed]",
                "The cops are more concerned with his safety than anything else. Why is his life more important than the animals he killed?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "US and Ukraine sign minerals deal that solidifies investment in Kyiv’s defense against Russia administration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/us-ukraine-minerals-deal-russia",
            "upvotes": 2239,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ac061853d45f740b3b609756c2c36ce1604d153c/0_203_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=21fa8cde98ce0947d6a960f809fae006",
            "top_comments": [
                "*The US and* [*Kyiv*](https://www.theguardian.com/world/ukraine) *have signed an agreement to share profits and royalties from the future sale of Ukrainian minerals and rare earths, sealing a deal that Donald Trump has said will provide an economic incentive for the US to continue to invest in Ukraine’s defense and its reconstruction after he brokers a peace deal with Russia.*\n\nI've read tens of articles on \"the mineral deal\" but never seen a single reference to what the minerals are how they will be mined. Thus, I really wonder how real the projected \"profits and royalties\" to be shared by the two countries. I think most of all this is just political show.  But maybe now we'll see just how real the minerals are. For starters, what are they exactly??",
                "Trump: “So… where are the minerals?”\n\nZelensky: “Over there, there, and there”\n\nTrump: “Wait.. the area is filled with angry Russian army!”\n\nZelensky: “Feel free to kick them out. It’s all yours!”",
                "Making a deal with the devil isn't good but sometimes necessary.",
                "He is going to betray you like the Kurds.",
                "Congrats to Ukraine for being able to close the deal they've been working on for 6 months. Sounds like they got most of what they were looking for.",
                "I think it's overall a good thing. It's a step in the process to bring this stalemate to an end, and a bone to throw to those who question western support for Ukraine. \n\nIt also gives Trump a much clearer reason to support Ukraine. A lot of the territory these minerals are under is currently occupied by Russia. It would be foolish to think that all of it will come back under the control of Ukraine, but now there is a clear reason to support Ukraine in taking back some of it. \n\nUnfortunately for Ukraine, this does equate to a loss of some level of sovereignty. There was never a scenario where a less developed country in the cross-hairs of both Europe and Russia maintained maximal sovereignty though.",
                "Zelenskyy is smart, he knows the next president will waive it.",
                "*Income and contributions to the fund would not be taxed in the US or Ukraine, she said, “to make investments yield the greatest results” and technology transfer and development were a “key” part of the agreement.*\n\nSo no public return, just total extraction of wealth by investors?",
                "Turns out “sign this deal or I’ll let that guy murder you” is a pretty persuasive argument…",
                "That's the look of a man who just signed a deal with the devil. He knows it's evil, but he has no other choice. The USA playing both these countries is just beyond wicked. It's like a little kid playing with his two favorite toy figures in the bathtub. Smashing them together and then crying when one of them breaks and getting a new toy just to shush him. Pathetic that these people dare call themselves adults."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "$800,000 in dimes spills onto North Texas highway",
            "external_url": "https://www.fox4news.com/news/truckload-dimes-spills-onto-wise-county-highway",
            "upvotes": 5110,
            "date": "04/30/2025",
            "thumbnail": "https://images.foxtv.com/static.fox4news.com/www.fox4news.com/content/uploads/2025/04/1280/720/dimes.jpg?ve=1&tl=1",
            "top_comments": [
                "_\"Somebody's gotta go back and get a shitload of dimes!\"_",
                "The nearby coinstar is going to be a hotspot for a few days.",
                "I would have liked to hear the sound of the spill.",
                "Good that road needed a major change",
                "Picking up one per second is $360/hr",
                "This feels like the start of a probability question.",
                "Someone’s paying everyone’s toll on the Le Petomane Thruway.",
                "It sounds like one of \"greed\" dreams I used to have when I was down and out.  I'd be grasping for the dimes and then wake up....",
                "Le Petomane Thruway? Now what'll that asshole think of next?",
                "Is this the real life? Is this just fantasy?\n\nWhy is a literal truckload of dimes being transported? Where were they going? To what end? Who needs so many dimes? I have a fairly vivid imagination. I cannot imagine a scenario, based in reality, in which a lorry full of dimes would be required.\n\nAnyone have any good, plausible ideas?"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "Visa wants to give artificial intelligence 'agents' your credit card",
            "external_url": "https://apnews.com/article/ai-artificial-intelligence-5dfa1da145689e7951a181e2253ab349",
            "upvotes": 1199,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Ideas by someone who’s never used a chatbot before”",
                "Yet another AI thing I don’t want and that won’t ever function correctly anyway.",
                "\\*reads article\\* This sounds incredibly useless.",
                "What people want: robot that folds clothes, empties dishwasher, gives them more free time.\n\nWhat tech makes: robot that you pay to shop for you.\n\nWhat's next, a robot that lists it all on Buy Nothing before it even gets back to the house?",
                "I fail to see how this will work. “Buy me a sweater” OK, here’s the sweatshop that bought the Google Ad space to appear in the recommended/shop results for a sweater. Congrats on your latest purchase that won’t survive the wash.",
                "Like hell I'm gonna use an AI to book travel; even if I trusted that it had the capacity to find the best deal, the bank would just end up making deals with various hotels and airlines to have it prioritize them regardless of price. Wherever there's extra profit to be made, companies will try to squeeze it out of you.",
                "\"Credit card company thinks they could make more money if credit card transactions didn't require the consent or awareness of the account holder\"",
                "Fuck all credit card companies",
                "Unless someone is going to give me an AI that will make money for me there is absolutely no way I am going to let AI spend my money without supervision and if I'm supervising/checking I may as well just do it all to begin with.",
                "It does your grocery shopping for you?  Ha, so instead of incessant advertising trying to get you to choose such-and-such brand, they can just pay whoever runs the AI to decide you want their brand and cut out the human influencing part.  \n\nA new age of marketing is upon us.  I wonder what kind of euphemistic name that'll have."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Invasive Chinese crab that can scale walls spotted for 1st time in US Pacific Northwest",
            "external_url": "https://www.denver7.com/us-news/weird/invasive-chinese-crab-that-can-scale-walls-spotted-for-1st-time-in-us-pacific-northwest",
            "upvotes": 3106,
            "date": "04/30/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/07edff2/2147483647/strip/true/crop/500x263+0+36/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fb5%2Fe5%2Fa0756c304cae8652c5666823a8b6%2Fshutterstock-149549846.jpg",
            "top_comments": [
                "Please tell me they taste good with garlic butter and I'll join the eradication squad.",
                "Thankfully the PNW has excellent resources for marine life management.",
                "Slap a 25% tariff on them.",
                ">\"While this is a rare event in Oregon, mitten crabs caused significant infrastructure and ecological damage in and around San Francisco Bay when the population was at its height in the late 1990s,\" the ODFW said in a statement. \"So, it is important to correctly identify this species and report it to your local ODFW office with the location found.\n\nChinese mitten crab sounds like an adorable name for a crab.",
                "Build higher walls to keep out the crabs! And make them pay for it!!! ",
                "\\*Sigh\n\nGet my cracker and some butter.",
                "Can we attack its weak point for massive damage?",
                "Guys, this is not a problem. You guys have no idea how much that costs in China and how much it costs here to buy.\n\nIf anyone see’s them in abundance, catch them and call a Chinese restaurant. You can sell them for at least $20-30 each.",
                "Time to bust out the garlic and butter.\n\n\nMaybe some black bean sauce crab?",
                "I mean if they taste good I can strip a steamed crab down to the meat in about 2 minutes."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "U.S.-citizen family 'traumatized' after ICE raided their Oklahoma home in search of someone else",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-family-traumatized-ice-raid-rcna203700",
            "upvotes": 21209,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-ice-agent-ch-0916-f8729f.jpg",
            "top_comments": [
                "OKLAHOMA CITY (KFOR) — A woman says her family’s fresh start in Oklahoma turned into a nightmare after federal immigration agents raided their home, **taking their phones, laptops, and life savings** – even though they were not the suspects the agents were looking for.\n\nThe agents had a search warrant for the home, but **the suspects listed on the warrant do not live in the house**.\n\nThe woman who actually lives in the house had just moved to Oklahoma City from Maryland with her family about two weeks earlier..\n\n\"I said you took my phone. We have no money. I just moved here,” the mother said. “I have to feed my children. I’m going to need gas money. I need to be able to get around. Like, how do you just leave me like this? Like an abandoned dog.”\n\nShe said the agents ordered her and her daughters to step outside, even though it was raining and they barely were given time to put on clothes.\n\n“**They wanted me to change in front of all of them, in between all of them**,” she said. “My husband has not even seen my daughter in her undergarments — her own dad, because it’s respectful. **You have her out there, a minor, in her underwear,**” the woman told KFOR.\n\n“One of them said, ‘I know it was a little rough this morning,’” she said. “It was so denigrating. That you do all of this to a family, to women, your fellow citizens. And it was a little rough? You literally traumatized me and my daughters for life. We’re going to have to go get help or get over this somehow.”\n\nBefore the agents left, the mother asked when could the family get their belongings back and they said **it could be days or even months,** KFOR reported.\n\nEdit: Other news sources clarified that **20 men** broke into the house in the middle of the night while they were sleeping. So 20 men surrounded this woman and her three young daughters, dragged them out into the rain in their underwear, and made them change clothes in front of them. If there was any justice in this  country they would be up on charges of sexual exploitation of minors.\n\n2nd Edit: The ~~agents~~ stasi thugs wouldn't even leave a business card or phone number they could call to find out how to get their electronics and life savings back. The ~~agents~~ thieves refused to even tell them which government agency or department would be storing their property.",
                "I wonder if that was a real warrant or one of those ICE administrative warrants? Those should be illegal. If police can make their own warrants, that defeats the whole purpose.",
                "More purposeful domestic terrorism - not incompetence - from maga ICE.",
                "They probably broke a bunch of their stuff too.",
                "The more commonplace this becomes the more commonplace it will be for other countries to compare us to the Russians. Is that what Republicans want?",
                "Has Oklahomas senators or ag commented on this or do they support it?",
                "How long will it be until non-government thugs decide to do the same thing? It seems to be a huge opportunity for anyone with no morals, and we have seen how many of those are out there. How would anyone know they weren't from the government?",
                "Not just a raid. This was full on sexual assault and theft. ICE goons deserve to be prosecuted at the Hague like the Nazis they are based on. Instead the US will allow them to do as they please, just like they did with the nazis. Disgusting. I am sad to be american.",
                "Law enforcement needs to be held accountable\n\nEven if you could agree with what ICE is trying to do, any law enforcement agency should be heavily penalized for raiding the wrong goddamn house!\n\nLike are you fucking serious? Somebody easily could have been killed. These are not our best folks.",
                "Must have been an ICE office field trip or something since this was just law enforcement doing their three favorite things: abusing power, stealing, and looking at undressed minors."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Middle schooler records himself harassing 5-year-old with ethnic slurs",
            "external_url": "https://www.nbcwashington.com/news/local/northern-virginia/middle-schooler-records-himself-harassing-5-year-old-with-ethnic-slurs/3899952/",
            "upvotes": 16838,
            "date": "04/30/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/04/39225742009-1080pnbcstations.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The 5-year-old went to the door to his house, pleading, “No! Don’t hurt me! Don’t hurt me!”\n\nHe then ran along the porch crying out for other children to help him – “Don’t do it! Save me! Save me!” No one stepped in, and laughter is heard in the background.\n\nThe harassment continued.\n\n“Are you having dumplings for dinner?” the middle schooler asked.\n\nAfter two minutes, the 5-year-old boy’s mother opened the door, and her son ran inside.",
                "As a middle school teacher, sadly I am not suprised.\n\nI teach lots of terrific students, but I'm also exposed to ones that are underparented, undersupervised, and have little ability to function in a civil society.\n\nWe need to find a way to implement consequences for these actions that not only show that we take it seriously, but help the person try to move out of the mindset that lead to this behavior.  Counseling, community service, etc..  Unfortunately, we tend to either do nothing, or incarcerate them once it escalates to violence. Nothing to stop it before that point.",
                "5... pre-k / kindergarten age. This middle school was at least twice their age. Shame on them, and shame on their parents.",
                "What’s up with middle schoolers and being the worst people possible?",
                "Five year olds are literally, and I mean *literally*, just living their best lives. Sure, they have trouble with emotional control sometimes and have meltdowns, but that also means they’re kind when none of us would be kind, they’re happy when none of us would be happy, they’re friendly when none of us would be friendly, they’re inquisitive and funny and compassionate and…just insert all the traits we as adults say we strive for. \n\nSo to see a five year old have this kind of malicious fear deliberately inflicted on them… \n\nI would be hunting the parents down. And I mean that in a predatory sense.",
                "seeing that poor child running to his door and putting the towel over his face is so fucking sad. those middle school kids deserve the worst, they know better than to bully a fucking toddler less than half their age. as someone from the area, these types of middle schoolers grow up into the shittiest and most entitled high schoolers who have never faced consequences",
                "Wow, my heart breaks for the little boy and his parents. But especially the little boy.\n\nCrazy thing is this school says it’s not their problem and police are being silent.\n\nThe community is going to demand justice and this won’t go quietly until people feel the middle schooler(s) are punished justly.\n\nIf this happened to my child, it would take everything in my power to not be vindictive. I don’t think I could remain peaceful.",
                "I wish all hell on the parents who raised that middle school bastard. \n\nI was a middle schooler. I raised middle schoolers. This is not normal and no talk of hormones will make me believe it is.",
                "Very few things make me as angry as seeing bullying like this.  I was bullied as a child and even did some myself when I was young and trying to sort out my way.  I always feel bad about my part, and wish I could go back and apologize to those I hurt.",
                "Genius kid-must have learned it from the parents"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "11 high schoolers ordered to surrender after lacrosse team hazing in upstate New York",
            "external_url": "https://www.nbcnews.com/news/us-news/high-schoolers-lacrosse-team-hazing-rcna203662",
            "upvotes": 2918,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-westhill-high-school-vl-909a-2fe878.jpg",
            "top_comments": [
                "This is a huge deal for CNY. In a lot of areas of the country Lacrosse is considered a prep-school sport for wealthy kids. In Syracuse metro area it's ingrained in the entire culture. The cancellation of the season can mean the difference for some of these seniors being offered D1 scholarships and being lucky to have a D3 team willing to take them on as walk on's after pulling this shit. Bunch of fucking idiots and they absolutely deserve full punishment.",
                "One victim reported that he went to a lacrosse game and then McDonald's with upperclassmen. But the evening took a turn when he said he was taken to a remote wooded area in the county after the driver of the vehicle pretended to be lost.\n\n“At some point by prearrangement, people came out of the woods all dressed in black. They were armed with what appeared to be at least one handgun and at least one knife,” Fitzpatrick said. “The individual had a pillowcase placed over his head, he was tied up and placed in the trunk of a car.”\n\nThe district attorney said he saw videotape of the incident.\n\n“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,”",
                "No one should receive scholarships after participating in hazing",
                "Hazing usually doesn't involve a loaded firearm...",
                "Geez. When I was in high school, the “hazing” for the band only involved getting water balloons and shaving cream thrown at you.",
                "Senior year of high school, 5 or 6 lacrosse players were expelled for hazing a younger player. My understanding is teabagging and some violating acts with lacross sticks is what happened. Still don’t understand how they were not charged with anything but that was 20+ years ago",
                "*“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,” Fitzpatrick added*\n\nThis almost would have been the least of my worries, given the horrible scenes he had just endured. As in leave me alone anywhere--even on the moon, anything but  what your threatening arms and masks implied.",
                "They will lose their scholarships and join a fraternity instead where they will get to do all of this and more while their “brothers” cheer them on. The fact that fraternities are still a thing is mind blowing to me. I dropped as soon as I got to know the guys and realized that they were some of the dumbest sociopaths at the school.",
                "Hazing is making the pledges dress up in tutus and do interpretive dance in the quad or chucking balloons full of ketchup at them. It does not involve brandishing lethal weapons in a secluded forest. These idiots should all be charged with felony crimes, and the judge should order the lacrosse program shut down for a year. \"But they're just kids!\" They showed up with pistol. Pistols are for killing people. Fuck these \"kids\".",
                "We still have hazing incidents?  WTF? They get what they deserve."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Federal judge in Vermont orders release of Columbia student Mohsen Mahdawi",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/mohsen-mahdawi-released-immigration-detention",
            "upvotes": 7031,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7128145d98ae03c483a557284594d0e9089104ba/0_0_3769_2261/master/3769.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4a5217dac0e17adb2b1b93b9c49660b0",
            "top_comments": [
                "[He’s been released](https://abcnews.go.com/US/lawyers-columbia-student-detained-ice-seek-release-case/story?id=121317902)\n\nI honestly think that contempt threat scared them straight, at least for now",
                "Hence why they try and relocate these people to Louisiana etc immediately to avoid these more liberal federal judges.",
                "> In new court filings submitted on Monday, the justice department included a two-page letter from Marco Rubio, the US secretary of state, saying that Mahdawi’s activities and presence in the US “undermines US policy to combat antisemitism” according to NPR, and that his activities could “potentially undermine the peace process underway in the Middle East”.\n\nWhat fucking peace process? Trump boasted about turning Gaza into a Trump resort. He quite literally supported the idea of a genocide because it was \"good business\".\n\n> Judge Crawford noted at Wednesday's hearing that Mahdawi received letters of support from over 90 community members, including members of the Jewish community, \"who have in a consistent pattern described him as peaceful.\"\n\nI bet they'll claim that those aren't real Jews or something. I fucking hate this administration.",
                "It's important to realise he's been released but that the removal proceedings continue; he's just not in prison while they do so.",
                "How cute, a judicial order? That’s a crime against trump now, so jail for the judge and the order goes in the special filing cabinet for corporate memos 🗑️",
                "Tomorrow we will see this judge arrested",
                "Request: where are we in the timeline in the Garcia case anyway? Wasn't there a deadline yesterday?",
                "Good! Now free Mahmoud Kahlil.\n\nI’m Jewish. I’d rather have these two men as neighbors than any of the chuds on my block.",
                "Thank goodness. I am worried for the safety of the judge, but this was absolutely needed.",
                "For the next one when they drag their feet, just send out all the New England States national guards to extract. See how they like them apples......"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Supreme Court hears arguments over publicly funded Catholic charter school in Oklahoma",
            "external_url": "https://apnews.com/article/supreme-court-religious-catholic-charter-school-oklahoma-983ed57aabeae53e4b58367c5021f5e1",
            "upvotes": 10918,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This one’s gonna suck. They love their private schools being funded by state tax dollars. This is gonna be a big blow to public education…",
                ">Justice Amy Coney Barrett recused herself without explanation. Barrett previously taught law at Notre Dame and is close friends with Notre Dame law professor Nicole Garnett, a leading proponent of publicly funded religious charter schools.\n\nWow a justice doing something right for a change.",
                " If this is allowed, red states are only going to fund religious schools.  Prepare for a complete backslide into the middle ages.",
                "I know someone in Ohio who makes about $250,000 household income that gets free tuition and PUBLIC SCHOOL bus transportation with a voucher program for their three kids. Shit like this already happens.",
                "We don’t want religious schools.\n\nTeach science, not “god’s word” (which is actually man’s word from 3000 years ago and edits ever since).",
                "How did this even make it to scotus? This is an obvious \"F*** no\"",
                "It’s not a real catholic school a real\nCatholic school wouldn’t need public funding.  It’s a for profit school gaining public money from under the guise of religious education",
                "Honestly, props to Coney Barrett for recusing herself.",
                "I hope The Church of Satan starts a charter school.",
                "Republicans are fake patriots"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Accused serial cat killer in Santa Ana out of jail",
            "external_url": "https://www.nbclosangeles.com/news/local/accused-serial-cat-killer-santa-ana-out-of-jail/3688302/",
            "upvotes": 504,
            "date": "05/01/2025",
            "thumbnail": "https://media.nbclosangeles.com/2025/04/cat-killer.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "I hate that this coward’s hiding his face and they don’t show his mugshot\n\nHappy they show it here though: https://ktla.com/news/california/santa-ana-pd-condemns-unruly-vigil-after-alleged-cat-killer-released-on-bail/",
                "You gotta seriously be lacking so many things to torture critters like that.\n\nNo empathy, sympathy, remorse, or guilt.",
                "Man, an angry mob sounds great right now",
                "Future serial killer.  Also,  did he not watch Don't Fuck With Cats on Netflix?",
                "He'll bump into a crazy cat lover sooner or later. Wish it happens sooner.",
                "Why was bail allowed if there a multiple witnesses",
                "Seriously though Is there a way that animal shelters can do background checks or something so that way he can't adopt a cat. I really need this person to not be able to come into contact with cats. It's soo sad to think about",
                "I never understand when this kind of things happen. Really disgusting.",
                "[removed]",
                "The cops are more concerned with his safety than anything else. Why is his life more important than the animals he killed?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "U.S.-citizen family 'traumatized' after ICE raided their Oklahoma home in search of someone else",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-family-traumatized-ice-raid-rcna203700",
            "upvotes": 21209,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-ice-agent-ch-0916-f8729f.jpg",
            "top_comments": [
                "OKLAHOMA CITY (KFOR) — A woman says her family’s fresh start in Oklahoma turned into a nightmare after federal immigration agents raided their home, **taking their phones, laptops, and life savings** – even though they were not the suspects the agents were looking for.\n\nThe agents had a search warrant for the home, but **the suspects listed on the warrant do not live in the house**.\n\nThe woman who actually lives in the house had just moved to Oklahoma City from Maryland with her family about two weeks earlier..\n\n\"I said you took my phone. We have no money. I just moved here,” the mother said. “I have to feed my children. I’m going to need gas money. I need to be able to get around. Like, how do you just leave me like this? Like an abandoned dog.”\n\nShe said the agents ordered her and her daughters to step outside, even though it was raining and they barely were given time to put on clothes.\n\n“**They wanted me to change in front of all of them, in between all of them**,” she said. “My husband has not even seen my daughter in her undergarments — her own dad, because it’s respectful. **You have her out there, a minor, in her underwear,**” the woman told KFOR.\n\n“One of them said, ‘I know it was a little rough this morning,’” she said. “It was so denigrating. That you do all of this to a family, to women, your fellow citizens. And it was a little rough? You literally traumatized me and my daughters for life. We’re going to have to go get help or get over this somehow.”\n\nBefore the agents left, the mother asked when could the family get their belongings back and they said **it could be days or even months,** KFOR reported.\n\nEdit: Other news sources clarified that **20 men** broke into the house in the middle of the night while they were sleeping. So 20 men surrounded this woman and her three young daughters, dragged them out into the rain in their underwear, and made them change clothes in front of them. If there was any justice in this  country they would be up on charges of sexual exploitation of minors.\n\n2nd Edit: The ~~agents~~ stasi thugs wouldn't even leave a business card or phone number they could call to find out how to get their electronics and life savings back. The ~~agents~~ thieves refused to even tell them which government agency or department would be storing their property.",
                "I wonder if that was a real warrant or one of those ICE administrative warrants? Those should be illegal. If police can make their own warrants, that defeats the whole purpose.",
                "More purposeful domestic terrorism - not incompetence - from maga ICE.",
                "They probably broke a bunch of their stuff too.",
                "The more commonplace this becomes the more commonplace it will be for other countries to compare us to the Russians. Is that what Republicans want?",
                "Has Oklahomas senators or ag commented on this or do they support it?",
                "How long will it be until non-government thugs decide to do the same thing? It seems to be a huge opportunity for anyone with no morals, and we have seen how many of those are out there. How would anyone know they weren't from the government?",
                "Not just a raid. This was full on sexual assault and theft. ICE goons deserve to be prosecuted at the Hague like the Nazis they are based on. Instead the US will allow them to do as they please, just like they did with the nazis. Disgusting. I am sad to be american.",
                "Law enforcement needs to be held accountable\n\nEven if you could agree with what ICE is trying to do, any law enforcement agency should be heavily penalized for raiding the wrong goddamn house!\n\nLike are you fucking serious? Somebody easily could have been killed. These are not our best folks.",
                "Must have been an ICE office field trip or something since this was just law enforcement doing their three favorite things: abusing power, stealing, and looking at undressed minors."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "$800,000 in dimes spills onto North Texas highway",
            "external_url": "https://www.fox4news.com/news/truckload-dimes-spills-onto-wise-county-highway",
            "upvotes": 5103,
            "date": "04/30/2025",
            "thumbnail": "https://images.foxtv.com/static.fox4news.com/www.fox4news.com/content/uploads/2025/04/1280/720/dimes.jpg?ve=1&tl=1",
            "top_comments": [
                "_\"Somebody's gotta go back and get a shitload of dimes!\"_",
                "The nearby coinstar is going to be a hotspot for a few days.",
                "I would have liked to hear the sound of the spill.",
                "Good that road needed a major change",
                "Picking up one per second is $360/hr",
                "This feels like the start of a probability question.",
                "Someone’s paying everyone’s toll on the Le Petomane Thruway.",
                "It sounds like one of \"greed\" dreams I used to have when I was down and out.  I'd be grasping for the dimes and then wake up....",
                "Le Petomane Thruway? Now what'll that asshole think of next?",
                "Is this the real life? Is this just fantasy?\n\nWhy is a literal truckload of dimes being transported? Where were they going? To what end? Who needs so many dimes? I have a fairly vivid imagination. I cannot imagine a scenario, based in reality, in which a lorry full of dimes would be required.\n\nAnyone have any good, plausible ideas?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Middle schooler records himself harassing 5-year-old with ethnic slurs",
            "external_url": "https://www.nbcwashington.com/news/local/northern-virginia/middle-schooler-records-himself-harassing-5-year-old-with-ethnic-slurs/3899952/",
            "upvotes": 16832,
            "date": "04/30/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/04/39225742009-1080pnbcstations.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The 5-year-old went to the door to his house, pleading, “No! Don’t hurt me! Don’t hurt me!”\n\nHe then ran along the porch crying out for other children to help him – “Don’t do it! Save me! Save me!” No one stepped in, and laughter is heard in the background.\n\nThe harassment continued.\n\n“Are you having dumplings for dinner?” the middle schooler asked.\n\nAfter two minutes, the 5-year-old boy’s mother opened the door, and her son ran inside.",
                "As a middle school teacher, sadly I am not suprised.\n\nI teach lots of terrific students, but I'm also exposed to ones that are underparented, undersupervised, and have little ability to function in a civil society.\n\nWe need to find a way to implement consequences for these actions that not only show that we take it seriously, but help the person try to move out of the mindset that lead to this behavior.  Counseling, community service, etc..  Unfortunately, we tend to either do nothing, or incarcerate them once it escalates to violence. Nothing to stop it before that point.",
                "5... pre-k / kindergarten age. This middle school was at least twice their age. Shame on them, and shame on their parents.",
                "What’s up with middle schoolers and being the worst people possible?",
                "Five year olds are literally, and I mean *literally*, just living their best lives. Sure, they have trouble with emotional control sometimes and have meltdowns, but that also means they’re kind when none of us would be kind, they’re happy when none of us would be happy, they’re friendly when none of us would be friendly, they’re inquisitive and funny and compassionate and…just insert all the traits we as adults say we strive for. \n\nSo to see a five year old have this kind of malicious fear deliberately inflicted on them… \n\nI would be hunting the parents down. And I mean that in a predatory sense.",
                "seeing that poor child running to his door and putting the towel over his face is so fucking sad. those middle school kids deserve the worst, they know better than to bully a fucking toddler less than half their age. as someone from the area, these types of middle schoolers grow up into the shittiest and most entitled high schoolers who have never faced consequences",
                "Wow, my heart breaks for the little boy and his parents. But especially the little boy.\n\nCrazy thing is this school says it’s not their problem and police are being silent.\n\nThe community is going to demand justice and this won’t go quietly until people feel the middle schooler(s) are punished justly.\n\nIf this happened to my child, it would take everything in my power to not be vindictive. I don’t think I could remain peaceful.",
                "I wish all hell on the parents who raised that middle school bastard. \n\nI was a middle schooler. I raised middle schoolers. This is not normal and no talk of hormones will make me believe it is.",
                "Very few things make me as angry as seeing bullying like this.  I was bullied as a child and even did some myself when I was young and trying to sort out my way.  I always feel bad about my part, and wish I could go back and apologize to those I hurt.",
                "Genius kid-must have learned it from the parents"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "US and Ukraine sign minerals deal that solidifies investment in Kyiv’s defense against Russia administration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/us-ukraine-minerals-deal-russia",
            "upvotes": 2240,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ac061853d45f740b3b609756c2c36ce1604d153c/0_203_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=21fa8cde98ce0947d6a960f809fae006",
            "top_comments": [
                "*The US and* [*Kyiv*](https://www.theguardian.com/world/ukraine) *have signed an agreement to share profits and royalties from the future sale of Ukrainian minerals and rare earths, sealing a deal that Donald Trump has said will provide an economic incentive for the US to continue to invest in Ukraine’s defense and its reconstruction after he brokers a peace deal with Russia.*\n\nI've read tens of articles on \"the mineral deal\" but never seen a single reference to what the minerals are how they will be mined. Thus, I really wonder how real the projected \"profits and royalties\" to be shared by the two countries. I think most of all this is just political show.  But maybe now we'll see just how real the minerals are. For starters, what are they exactly??",
                "Trump: “So… where are the minerals?”\n\nZelensky: “Over there, there, and there”\n\nTrump: “Wait.. the area is filled with angry Russian army!”\n\nZelensky: “Feel free to kick them out. It’s all yours!”",
                "Making a deal with the devil isn't good but sometimes necessary.",
                "He is going to betray you like the Kurds.",
                "Congrats to Ukraine for being able to close the deal they've been working on for 6 months. Sounds like they got most of what they were looking for.",
                "I think it's overall a good thing. It's a step in the process to bring this stalemate to an end, and a bone to throw to those who question western support for Ukraine. \n\nIt also gives Trump a much clearer reason to support Ukraine. A lot of the territory these minerals are under is currently occupied by Russia. It would be foolish to think that all of it will come back under the control of Ukraine, but now there is a clear reason to support Ukraine in taking back some of it. \n\nUnfortunately for Ukraine, this does equate to a loss of some level of sovereignty. There was never a scenario where a less developed country in the cross-hairs of both Europe and Russia maintained maximal sovereignty though.",
                "Zelenskyy is smart, he knows the next president will waive it.",
                "*Income and contributions to the fund would not be taxed in the US or Ukraine, she said, “to make investments yield the greatest results” and technology transfer and development were a “key” part of the agreement.*\n\nSo no public return, just total extraction of wealth by investors?",
                "Turns out “sign this deal or I’ll let that guy murder you” is a pretty persuasive argument…",
                "That's the look of a man who just signed a deal with the devil. He knows it's evil, but he has no other choice. The USA playing both these countries is just beyond wicked. It's like a little kid playing with his two favorite toy figures in the bathtub. Smashing them together and then crying when one of them breaks and getting a new toy just to shush him. Pathetic that these people dare call themselves adults."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court hears arguments over publicly funded Catholic charter school in Oklahoma",
            "external_url": "https://apnews.com/article/supreme-court-religious-catholic-charter-school-oklahoma-983ed57aabeae53e4b58367c5021f5e1",
            "upvotes": 10931,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This one’s gonna suck. They love their private schools being funded by state tax dollars. This is gonna be a big blow to public education…",
                ">Justice Amy Coney Barrett recused herself without explanation. Barrett previously taught law at Notre Dame and is close friends with Notre Dame law professor Nicole Garnett, a leading proponent of publicly funded religious charter schools.\n\nWow a justice doing something right for a change.",
                " If this is allowed, red states are only going to fund religious schools.  Prepare for a complete backslide into the middle ages.",
                "I know someone in Ohio who makes about $250,000 household income that gets free tuition and PUBLIC SCHOOL bus transportation with a voucher program for their three kids. Shit like this already happens.",
                "We don’t want religious schools.\n\nTeach science, not “god’s word” (which is actually man’s word from 3000 years ago and edits ever since).",
                "How did this even make it to scotus? This is an obvious \"F*** no\"",
                "It’s not a real catholic school a real\nCatholic school wouldn’t need public funding.  It’s a for profit school gaining public money from under the guise of religious education",
                "Honestly, props to Coney Barrett for recusing herself.",
                "I hope The Church of Satan starts a charter school.",
                "Republicans are fake patriots"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Invasive Chinese crab that can scale walls spotted for 1st time in US Pacific Northwest",
            "external_url": "https://www.denver7.com/us-news/weird/invasive-chinese-crab-that-can-scale-walls-spotted-for-1st-time-in-us-pacific-northwest",
            "upvotes": 3101,
            "date": "04/30/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/07edff2/2147483647/strip/true/crop/500x263+0+36/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fb5%2Fe5%2Fa0756c304cae8652c5666823a8b6%2Fshutterstock-149549846.jpg",
            "top_comments": [
                "Please tell me they taste good with garlic butter and I'll join the eradication squad.",
                "Thankfully the PNW has excellent resources for marine life management.",
                "Slap a 25% tariff on them.",
                ">\"While this is a rare event in Oregon, mitten crabs caused significant infrastructure and ecological damage in and around San Francisco Bay when the population was at its height in the late 1990s,\" the ODFW said in a statement. \"So, it is important to correctly identify this species and report it to your local ODFW office with the location found.\n\nChinese mitten crab sounds like an adorable name for a crab.",
                "Build higher walls to keep out the crabs! And make them pay for it!!! ",
                "\\*Sigh\n\nGet my cracker and some butter.",
                "Can we attack its weak point for massive damage?",
                "Guys, this is not a problem. You guys have no idea how much that costs in China and how much it costs here to buy.\n\nIf anyone see’s them in abundance, catch them and call a Chinese restaurant. You can sell them for at least $20-30 each.",
                "Time to bust out the garlic and butter.\n\n\nMaybe some black bean sauce crab?",
                "I mean if they taste good I can strip a steamed crab down to the meat in about 2 minutes."
            ],
            "aggregate_sentiment": 70.0
        },
        {
            "category": "RISING",
            "title": "Federal judge in Vermont orders release of Columbia student Mohsen Mahdawi",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/mohsen-mahdawi-released-immigration-detention",
            "upvotes": 7041,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7128145d98ae03c483a557284594d0e9089104ba/0_0_3769_2261/master/3769.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4a5217dac0e17adb2b1b93b9c49660b0",
            "top_comments": [
                "[He’s been released](https://abcnews.go.com/US/lawyers-columbia-student-detained-ice-seek-release-case/story?id=121317902)\n\nI honestly think that contempt threat scared them straight, at least for now",
                "Hence why they try and relocate these people to Louisiana etc immediately to avoid these more liberal federal judges.",
                "> In new court filings submitted on Monday, the justice department included a two-page letter from Marco Rubio, the US secretary of state, saying that Mahdawi’s activities and presence in the US “undermines US policy to combat antisemitism” according to NPR, and that his activities could “potentially undermine the peace process underway in the Middle East”.\n\nWhat fucking peace process? Trump boasted about turning Gaza into a Trump resort. He quite literally supported the idea of a genocide because it was \"good business\".\n\n> Judge Crawford noted at Wednesday's hearing that Mahdawi received letters of support from over 90 community members, including members of the Jewish community, \"who have in a consistent pattern described him as peaceful.\"\n\nI bet they'll claim that those aren't real Jews or something. I fucking hate this administration.",
                "It's important to realise he's been released but that the removal proceedings continue; he's just not in prison while they do so.",
                "How cute, a judicial order? That’s a crime against trump now, so jail for the judge and the order goes in the special filing cabinet for corporate memos 🗑️",
                "Tomorrow we will see this judge arrested",
                "Request: where are we in the timeline in the Garcia case anyway? Wasn't there a deadline yesterday?",
                "Good! Now free Mahmoud Kahlil.\n\nI’m Jewish. I’d rather have these two men as neighbors than any of the chuds on my block.",
                "Thank goodness. I am worried for the safety of the judge, but this was absolutely needed.",
                "For the next one when they drag their feet, just send out all the New England States national guards to extract. See how they like them apples......"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "11 high schoolers ordered to surrender after lacrosse team hazing in upstate New York",
            "external_url": "https://www.nbcnews.com/news/us-news/high-schoolers-lacrosse-team-hazing-rcna203662",
            "upvotes": 2917,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-westhill-high-school-vl-909a-2fe878.jpg",
            "top_comments": [
                "This is a huge deal for CNY. In a lot of areas of the country Lacrosse is considered a prep-school sport for wealthy kids. In Syracuse metro area it's ingrained in the entire culture. The cancellation of the season can mean the difference for some of these seniors being offered D1 scholarships and being lucky to have a D3 team willing to take them on as walk on's after pulling this shit. Bunch of fucking idiots and they absolutely deserve full punishment.",
                "One victim reported that he went to a lacrosse game and then McDonald's with upperclassmen. But the evening took a turn when he said he was taken to a remote wooded area in the county after the driver of the vehicle pretended to be lost.\n\n“At some point by prearrangement, people came out of the woods all dressed in black. They were armed with what appeared to be at least one handgun and at least one knife,” Fitzpatrick said. “The individual had a pillowcase placed over his head, he was tied up and placed in the trunk of a car.”\n\nThe district attorney said he saw videotape of the incident.\n\n“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,”",
                "No one should receive scholarships after participating in hazing",
                "Hazing usually doesn't involve a loaded firearm...",
                "Geez. When I was in high school, the “hazing” for the band only involved getting water balloons and shaving cream thrown at you.",
                "Senior year of high school, 5 or 6 lacrosse players were expelled for hazing a younger player. My understanding is teabagging and some violating acts with lacross sticks is what happened. Still don’t understand how they were not charged with anything but that was 20+ years ago",
                "*“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,” Fitzpatrick added*\n\nThis almost would have been the least of my worries, given the horrible scenes he had just endured. As in leave me alone anywhere--even on the moon, anything but  what your threatening arms and masks implied.",
                "They will lose their scholarships and join a fraternity instead where they will get to do all of this and more while their “brothers” cheer them on. The fact that fraternities are still a thing is mind blowing to me. I dropped as soon as I got to know the guys and realized that they were some of the dumbest sociopaths at the school.",
                "Hazing is making the pledges dress up in tutus and do interpretive dance in the quad or chucking balloons full of ketchup at them. It does not involve brandishing lethal weapons in a secluded forest. These idiots should all be charged with felony crimes, and the judge should order the lacrosse program shut down for a year. \"But they're just kids!\" They showed up with pistol. Pistols are for killing people. Fuck these \"kids\".",
                "We still have hazing incidents?  WTF? They get what they deserve."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Visa wants to give artificial intelligence 'agents' your credit card",
            "external_url": "https://apnews.com/article/ai-artificial-intelligence-5dfa1da145689e7951a181e2253ab349",
            "upvotes": 1198,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Ideas by someone who’s never used a chatbot before”",
                "Yet another AI thing I don’t want and that won’t ever function correctly anyway.",
                "\\*reads article\\* This sounds incredibly useless.",
                "What people want: robot that folds clothes, empties dishwasher, gives them more free time.\n\nWhat tech makes: robot that you pay to shop for you.\n\nWhat's next, a robot that lists it all on Buy Nothing before it even gets back to the house?",
                "I fail to see how this will work. “Buy me a sweater” OK, here’s the sweatshop that bought the Google Ad space to appear in the recommended/shop results for a sweater. Congrats on your latest purchase that won’t survive the wash.",
                "Like hell I'm gonna use an AI to book travel; even if I trusted that it had the capacity to find the best deal, the bank would just end up making deals with various hotels and airlines to have it prioritize them regardless of price. Wherever there's extra profit to be made, companies will try to squeeze it out of you.",
                "\"Credit card company thinks they could make more money if credit card transactions didn't require the consent or awareness of the account holder\"",
                "Fuck all credit card companies",
                "Unless someone is going to give me an AI that will make money for me there is absolutely no way I am going to let AI spend my money without supervision and if I'm supervising/checking I may as well just do it all to begin with.",
                "It does your grocery shopping for you?  Ha, so instead of incessant advertising trying to get you to choose such-and-such brand, they can just pay whoever runs the AI to decide you want their brand and cut out the human influencing part.  \n\nA new age of marketing is upon us.  I wonder what kind of euphemistic name that'll have."
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "05/01/2025 12:15:43 UTC"
}