{
    "posts": [
        {
            "category": "HOT",
            "title": "Anti-Vaxx Mom Whose Daughter Died From Measles Says Disease 'Wasn't That Bad'",
            "external_url": "https://www.latintimes.com/anti-vaxx-mom-whose-daughter-died-measles-says-disease-wasnt-that-bad-578871",
            "upvotes": 4165,
            "date": "03/21/2025",
            "thumbnail": "https://d.latintimes.com/en/full/571807/measles-texas.jpg",
            "top_comments": [
                "\"Wasn't that bad\"?\n\nIf dead children isn't that bad, what the fuck *IS* that bad?!",
                "How is this not considered child endangerment and neglect?",
                ">they argued that if measles patients had access to untested treatments, the MMR vaccines would be entirely unnecessary\n\nOf course we need untested treatments because the tested and safe prevention is the problem.",
                "When there is scientific proof that a medical treatment can save lives, and you still decide against, you should be held accountable. Regardless of their religious beliefs, these parents killed their child and should be convicted. This was a preventable death.",
                "Had some absolute idiot on another thread arguing that a parents opinion on their child's medical care is as valuable as a doctors and like just no, giving birth does not magically imbue you with extra knowledge or critical thinking skills.",
                "God this country fucking sucks right now.",
                "It’s beyond sad when political bias and an almost religious favour towards conspiracy theory makes you belittle even the death of your own child.",
                "Again, Anti vaxxers don't love their children & should not have them",
                "# 'Wasn't That Bad'\n\nfor me",
                "If it wasn't that bad, she wouldn't have died."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "HOT",
            "title": "People named in JFK assassination documents are not happy their personal information was released",
            "external_url": "https://apnews.com/article/jfk-assassination-files-personal-information-5609ccd6e106c5b30ee6b6cca3a30e3c",
            "upvotes": 8883,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Interesting that the JFK documents were insufficiently redacted, while the Epstein documents were redacted to the point of uselessness.",
                "The problem is the social security numbers of these living individuals were not redacted.",
                "So the only thing new was that we all know Digenova's SS number. Cool.",
                ">“It should not have happened,” diGenova said in a phone interview Thursday. “I think it’s the result of incompetent people doing the reviewing. I don’t believe it had anything to do with rushing the process. The people who reviewed these documents did not do their job.”\n\nYeah i can definitely see incompetent people involved in this and a lot else going on rn",
                "It's crazy that these people will get new SSNs, meanwhile pretty much every American's SSN has been leaked as part of a data breach at some point recently. It's beyond time for a more modern system. ",
                "So, no new info except for the stuff that was correctly and competently redacted in the past to protect people that absolutely deserved to be shielded from having their private info thrown to the conspiracy theorist wolves.\n\nNo surprise at all to any of that.",
                "can you imagine having to get a new social security number in yours 70s lol and with the current state of that department under this admin right now",
                "Has anything knew or interesting come from this document release? I think it was just red meat to keep people's attention away from the Epstein diaries.",
                "Leavitt doesn’t understand the difference between proactively and reactively.",
                "Lol they're going to help those affected by monitoring their credit.  Thats like a free pizza coupon for finding a hair in your delivered papa John's."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Judge bars Musk's DOGE team from Social Security records in scathing ruling",
            "external_url": "https://www.cnbc.com/2025/03/20/judge-bars-musks-doge-team-from-social-security-records.html?utm_source=flipboard&utm_content=user%2FCNBC",
            "upvotes": 48956,
            "date": "03/20/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118453-1742406884122-gettyimages-2205899441-4m7a5252_j0ib0j01.jpeg?v=1742406923&w=1920&h=1080",
            "top_comments": [
                "\"Hollander, noting the affiliates of DOGE have kept their identities hidden, wrote, “ironically, the identity of these DOGE affiliates has been concealed because defendants are concerned that the disclosure of even  their names would expose them to harassment and thus invade their privacy.”\n\nA-fucking-men",
                "*Judge Ellen Lipton Hollander in a* [*scathing ruling*](https://storage.courtlistener.com/recap/gov.uscourts.mdd.577321/gov.uscourts.mdd.577321.49.0.pdf) *accused* [*DOGE*](https://www.cnbc.com/2025/02/07/elon-musk-doge-racist-treasury-x-staff.html) *of launching a “fishing expedition” at the Social Security agency and failing to provide any reason why it needed to access vast swaths of Americans’ personal and private data.*\n\nHurrah!!  She attacked DOGE for insisting on the total secrecy and privacy of their operatives while granting zilch such recognition of the tens of millions personal records they demand access to.",
                "Throw the book at these little mid 20s shits. They shouldn’t be anywhere near the government.",
                "\"Are you tired of winning?\" has turned into \"Can we win once?\"",
                "They don't even have the names of the people who had access to said data. And it's a TRO.",
                "That only works with administrations that follow the law",
                "Social Security is sacred grounds. They’ve already stopped phone support which will create havoc for the elderly. Touching benefits will be the poison pill that may finally cure the cancer running throughout the current administration. I hope but not holding my breath.",
                "They're getting ready to start pillaging social security. Lots of grandparents and disabled people are going to get branded frauds so billionaires can upgrade the helipads and moonpools on their yachts",
                "Before someone says “ThEy’lL jUsT iGnOrE the oRdErS” - note that the administration has been forced to follow orders then whined about it.  They aren’t as all powerful as they like to portray they are \n\nThey know while republicans are feckless and have placed their balls squarely in President Elon’s hands for safe keeping - they can only be pushed so far. \n\nThere’s a lot do resist. A lot of nonsense this administration is doing to enrich themselves and a lot of cleanup we have to do. \n\nCelebrate the win. Highlight if and when the administration ignores the law and keep fighting.\n\nEdit: added some clarifying text.",
                "So what happens when he ignores the law?  So far, no one has been held accountable for their illegal activities. \n\nWho actually stops this madness?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Musk Set to Get Access to Top-Secret U.S. Plan for Potential War With China",
            "external_url": "https://www.nytimes.com/2025/03/20/us/politics/musk-pentagon-briefing-china-war-plan.html?unlocked_article_code=1.5k4.SRAZ.aIZGK_LvUkAE&smid=nytcore-android-share",
            "upvotes": 6514,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Just a friendly reminder that Musk has total access to and control of the federal government only because he gave Trump 250 million dollars. This is what extra-national oligarchy looks like. ",
                "This is just getting more insane with each new day ….",
                "Just to hammer home, there is absolutely *no* chance that Elon could pass a background check for clearance because of his drug use.",
                "What the actual fuck?",
                "God damn, are our military leaders a bunch of spineless fucks too? This is going to get American soldiers fucking **killed**.",
                "Why does this un-elected dude get nearly limitless access to the government? It’s crazy.",
                "Remember when Hillary sent an email from a non-secure server? Yeah I think this is far worse.",
                "He really did buy the presidency didn’t he?\n\nThis is pure insanity. Can’t wait for all the conservatives to tell us why it’s great some unelected billionaire is now working with the Pentagon on secret war plans.",
                "the thing i'm shocked about the most, is that each successive outrage is exponentially more shocking and outrageous than the previous high, usually days between.",
                "Such a massive conflict of interest. In addition to Elon Musk’s own business interests in China, his mother, Maye Musk, regularly visits China for business opportunities and advertising, and is an [ambassador to some Chinese mattress company](https://www.nbcnews.com/news/world/china-elon-musk-maye-musk-rcna182118): \n\n“For [Maye] Musk, that means appearing on magazine covers and lots of opportunities to endorse products. She has walked the runway for Chinese apparel brand JNBY and appeared at an event in Shanghai this year for the sportswear brand Fila.\n\nShe is also a global brand ambassador for Chinese mattress brand AISE Baobao, attending a store opening in Shanghai this month, and has appeared in smartphone advertisements for Chinese consumer electronics manufacturer Oppo.”"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Trump signs executive order to dismantle the Education Department",
            "external_url": "https://www.nbcnews.com/politics/white-house/trump-signs-executive-order-dismantle-education-department-white-house-rcna197251",
            "upvotes": 34340,
            "date": "03/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250320-donald-trump-linda-mcmahon-vl-1056a-273d79.jpg",
            "top_comments": [
                "(He technically cannot do this but that hasn’t stopped him yet)",
                "I remember when the right were outraged by Obama’s executive orders so much so that they began referring to him as Chairman Obama. \n\nAnd what do you hear now? Crickets.",
                "I didn't realize the president could just run the nation with executive orders",
                "The senators and the states THINK they will still get funding for education things but with no federal department telling em how to spend it. I somehow doubt it",
                "Speed running societal collapse to *own the libs*",
                "They want your children working.",
                "Educated populace is difficult to manipulate.",
                "Very sad day for America.  Trump can't do much without Congress here, but Republicans seem to be pretty much on board with closing the whole thing down.\n\nI wonder if they realize that school curriculum is already controlled at a state level?",
                "Apr 3, 2016 — We won with poorly educated. “I love the poorly educated,” the Republican presidential front-runner boasted after coasting to a decisive victory.",
                "[removed]"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "In latest blow to Tesla, regulators recall nearly all Cybertrucks",
            "external_url": "https://apnews.com/article/cybertruck-recall-tesla-elon-musk-nhtsa-8c517e21aa1119d74b9db39f6aca01b7",
            "upvotes": 1075,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In totally unrelated news. DOGE will visit the National Highway Traffic Safety Administration next week.",
                ">The National Highway Traffic Safety Administration’s recall, which covers more than 46,000 Cybertrucks, warned that an exterior panel that runs along the left and right side of the windshield can detach while driving, creating a dangerous road hazard for other drivers, increasing the risk of a crash.\n\nBest truck ever!\n\nWhoever had 'Another Cybertruck Recall' on their bingo board, mark your spot! 8 and counting!",
                "Lot of people are going to make some well-earned snarky comments about the truck overall, but the danger of this specific hazard should be taken 100% seriously.\n\nThose from the Midwest may remember what happened to the Willis family back in 1994. An 18\" piece of steel fell off the mudflap assembly of a truck on the freeway and shortly thereafter got caught underneath the Willis' minivan, puncturing their gas tank, instantly engulfing the vehicle in a fireball, and killing six of their children. The parents barely made it out alive and were in critical condition for some time after.\n\nSeveral years later there was finally a $100M settlement, but that's not worth much to a family that lost six of their own.\n\nHunks of metal flying off on the freeway is no joke. It can be catastrophic in truly the most horrifying way possible.",
                "Regulators!  Mount up.",
                "I am shocked... that there are regulators in the US that allowed the cybertruck to be released in the first place.",
                "Regulators are illegal now",
                "Ok, so we know which organisation DOGE will be busting down the door of next week",
                "You mean they're hideously stupid looking, run like shit, *and* they fall apart on the road? \n\nNo wonder our carnival barker in chief want to make owning one compulsory",
                "It's fucking surreal how \"conflict of interest\" works (or does not) in fascist US right now.",
                "The recall will be fixed\n\n\nBut the damage done "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Tesla owners are trading in their EVs at record levels, Edmunds says",
            "external_url": "https://www.cnbc.com/2025/03/20/tesla-owners-are-trading-in-their-evs-at-record-levels-edmunds-says.html",
            "upvotes": 593,
            "date": "03/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108114358-1741726193117-gettyimages-2203994536-AFP_36ZN8YB.jpeg?v=1742510993&w=1920&h=1080",
            "top_comments": [
                "Poorly ran company without leadership or any quality control standards on their products. Actively dangerous auto driver system linked to dozens of deaths. \n\nNo idea why anyone would want to own a Tesla right now. They’re like BlackBerry. They’re product is only popular because it was first, not because it’s the best. ",
                "I had one of the first 600 Tesla Model Ys. With taxes, etc., it came out to a pretty penny (north of $60k). It was a fun, engaging car and whoo boy that acceleration was bonkers.\n\nThen the reality set in. I kept trying to push through the inconveniences but damned if they didn’t add up quickly. To whit:\n\n1.) A software update meant to improve the positional accuracy of the map bricked - get this - the A/C system. In the summer. It was literally a guessing game whether the A/C would turn on when I got in the car. Persisted for about 3 months before a patch was rolled out.\n\n2.) The vaunted heat pump quit twice, once in winter (as we were moving across the country). Only a threat of litigation got the service center to replace the unit. Replacing it took the service center nearly a week.\n\n3.) A simple windshield replacement was needed after a rock caused a crack that started spreading. I scheduled service (soonest I could get a spot was 4 weeks out) which got delayed an additional whole month because “Our glass guy is sick,” and yet another whole month because “We don’t have glass.”\n\n4.) At 4 years of ownership, it was found that elements of the sub-frame were developing soon-to-be catastrophic cracks. No, I didn’t rally race it. Yes, I was religious about washing road salt off of it in wintertime. The upper control arm bushing was also “shredded” according to Firestone.\n\nAfter #4 happened, I drove to a dealership that literal same day and traded it in.",
                "We traded ours in, it was completely paid off (and was bought before Elon went completely asshole), we originally planned to just keep it because selling it doesn’t do anything to Tesla to get rid of it, since they already had the money.\n\nbut when they charged an outrageous $200 per issue to diagnose and didn’t even fix the issue with the GPS we felt it was time and switched to a different EV.",
                "Like 5% of my local carvana/whatever listing are Teslas, which is wild because the number of Tesla I see on the road is not nearly 1/20. Tells you how negative the demand is for these things.",
                "I saw a 22 long range with 4K tax for 19500. Had 45k miles on it.",
                "I used to really admire Tesla, and I saw Elon Musk as someone who stood apart; a visionary who consistently backed himself and put his money where his mouth was.\n\nLike him, I have high-functioning autism. I thought I understood where he was coming from. In many ways, I’m brilliant, but in others, painfully unaware. Enough people have told me that my particular quirks can rub others the wrong way. Over time, I’ve learned that I thrive as a second-in-command, not as a leader. And I’ve come to accept that I should avoid making public statements.\n\nI was seriously considering buying a Tesla. That’s no longer on the table. As a Canadian, watching my country’s sovereignty questioned by the U.S. President with Elon standing in full support.  My decision is firm. It’s a hard no, squared.",
                "Your Tesla purchase indirectly funded the dismantling of the Department of Education and cuts to Medicaid.  Elon used the money he made off those cars to buy the government and pass these policies.  ",
                "The people I know who bought Teslas were well off yuppies, liberal and who cared about the environment (mean that in the best way possible).  Teslas are not cheap and the people who bought them did so instead of something like a BMW or Range Rover.  I myself was considering one before I went for a BMW.  \n\nTesla was like the Apple brand of the car world. \n\nAnd Elon just antagonized that entire base.  Those same folks are embarrassed by their purchase now. ",
                "I believe it. My spouse who doesnt pay attention to this stuff and doesn’t know much context said that she’s been seeing much less Teslas on the road lately",
                "If they continued to buy them after the whole steering wheels falling off recall, it's probably safe to say that trading them in is one of the best decisions they've ever made."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Detentions of European tourists at US borders spark fears of traveling to America",
            "external_url": "https://apnews.com/article/border-tourists-german-canadian-detention-immigration-408cd27338e8065268fabc835f8b0c34",
            "upvotes": 1076,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They are hosting a world cup and an Olympics under this government lol",
                "\"spent 16 days locked up before being allowed to fly home to Germany.\"\n\nWtf",
                "Add tourism to the list of things Trump is destroying",
                "weeks of solitary confinement and deportation detention due to misunderstandings? \n\nno, thanks",
                "People traveling here on official business should probably receive hazardous duty pay.",
                "They should all go to Canada instead!",
                "Fuck travelling to America\n\nNeither I nor my family is going near there again for a long time.",
                "The World Cup in 2026 is gonna have dismal attendance. Why come to the US to support your national team? Tourists aren’t going to want to spend thousands of dollars to risk being detained by Customs or perhaps ICE.",
                "Basically America is a no fly currently as far as work is acting after one of our guys nearly got caught up in this.\n\nThis is going to be very very bad for international businesses in America now because means anything that needs to be done in person has to happen basically everywhere but America \n\nThe situation is snowballing so fast hell i know personally a few people have cancelled holidays purely over this because their extremely worried what would happen. By the end of the year American is going to be completely isolated",
                "His voters don’t care. Most of them don’t follow the news and if they do the response to 90% of the shit is „good. Fuck ’em.“"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "A month-old girl is pulled from the rubble in Gaza after an airstrike killed her parents",
            "external_url": "https://apnews.com/article/gaza-airstrike-baby-girl-rescued-parents-killed-7b0d1daec3dd229c3556182b9ce56e26",
            "upvotes": 1342,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Poor precious little soul deserves so much more than this",
                "You know I don't understand how this shit happens and people don't expect the child to join hamas or another organization when they grow up.",
                "We're witnessing a genocide in 2025. Humans ain't shit, we need a reset.",
                "My baby just turned one month this past Tuesday. I couldn’t even imagine. This makes me sick. She and the rest of Gaza deserve better.",
                "Everyone knows this conflict won't be \"won\" militarily.  It never has been.  It never will be.\n\nAnyone who uses the phrase \"Total Victory\" is a devilish liar - or worse.\n\nBombing children living in tents under occupation, no water, no electricity, no sanitation or medical facilities -- makes the COWARDLY criminal perpetrators toxic to the world:\n\nMadness is: preferring to take the blood of caged-in women and children to winning the  safe return of your own surviving citizens.\n\nTrump's \"support\" is Encouragement-By-FELON.  That won't protect ANYONE from criminal responsibility  -- JUST ASK his long list of toadies.\n\nTake a look around.  Trump ONLY supports criminals.  Israel should stop touting his support as some kind of blessing.  It always ends the same for Trump, and this DEVIL's on his way to an even bigger FAILure than last time.",
                "Fuck Benjamin Netanyahu.",
                "Only animals punish civilians like this.",
                "Don't be fooled! That's a deadly Hamas fighter, I bet that baby has a gun stashed away underneath its clothes!\n\n\n*obvious /s for anyone not understanding the joke*",
                "She was Hamas everyone is antisemitic",
                "And the world's just letting it happen. I guess if the people are brown the world doesn't care but if they're white there's global outrage."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Man deported to El Salvador under Alien Enemies Act because of soccer logo tattoo: Attorney",
            "external_url": "https://abcnews.go.com/Politics/man-deported-el-salvador-alien-enemies-act-soccer-logo-tattoo-attorney/story?id=119983892",
            "upvotes": 20569,
            "date": "03/20/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c53e7039-52fc-4319-8f04-c7c14e03e5e3/salvador-deported-10-rt-gmh-250316_1742166305552_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "People still don’t realize how serious this is and that’s a problem.",
                "Its exactly as bad as you might suspect it is.",
                "In addition to the tattoo they said that 🤟 was a gang sign jfc",
                "I recommend watching this short [youtube documentary about CECOT,](https://www.youtube.com/watch?v=BV7Q0zYDO9I) a Mega Prison in El Salvador that the US is now sending people to without Due Process. Any of us could end up there without trial if an ICE agent takes action against you, migrant or citizen.",
                "I saw a news yesterday where a mother from Venezuela recognized his son from El Salvador video being given a haircut, he was moved without any trial or process, just packed in the plane to CECOT, this is horrible.",
                "I am not visiting the US anytime soon, if you don't even have a right for a trial, before you get shipped of to a Camp",
                "Labeling every one as a Gang member terrorist doesn't make it legal, because that is the same name they use for all their opposition.",
                "The private prison he's being held in is CECOT, a private prison that was massively overcrowded BEFORE Trump shipped hundreds of immigrants there without trial.",
                "This is crazy. He’s not from El Salvador nor has any ties to El Salvador and they just arrested and shipped an innocent soccer player/coach there.",
                "Seems like a violation of the First Amendment. Also, how does everyone feel about [Latin or Greek tattoos](https://nypost.com/2024/11/13/us-news/all-of-secretary-of-defense-nominee-pete-hegseths-tattoos/)?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Two convicted in murder-for-hire plot of US-Iranian journalist",
            "external_url": "https://www.bbc.co.uk/news/articles/ckg80kgyjl0o",
            "upvotes": 25,
            "date": "03/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/090d/live/21e97d60-05f2-11f0-a5a2-c3248894afb7.jpg",
            "top_comments": [
                "They failed. She is still alive. The article doesn't say how close they got."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Tesla owners are trading in their EVs at record levels, Edmunds says",
            "external_url": "https://www.cnbc.com/2025/03/20/tesla-owners-are-trading-in-their-evs-at-record-levels-edmunds-says.html",
            "upvotes": 593,
            "date": "03/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108114358-1741726193117-gettyimages-2203994536-AFP_36ZN8YB.jpeg?v=1742510993&w=1920&h=1080",
            "top_comments": [
                "Poorly ran company without leadership or any quality control standards on their products. Actively dangerous auto driver system linked to dozens of deaths. \n\nNo idea why anyone would want to own a Tesla right now. They’re like BlackBerry. They’re product is only popular because it was first, not because it’s the best. ",
                "I had one of the first 600 Tesla Model Ys. With taxes, etc., it came out to a pretty penny (north of $60k). It was a fun, engaging car and whoo boy that acceleration was bonkers.\n\nThen the reality set in. I kept trying to push through the inconveniences but damned if they didn’t add up quickly. To whit:\n\n1.) A software update meant to improve the positional accuracy of the map bricked - get this - the A/C system. In the summer. It was literally a guessing game whether the A/C would turn on when I got in the car. Persisted for about 3 months before a patch was rolled out.\n\n2.) The vaunted heat pump quit twice, once in winter (as we were moving across the country). Only a threat of litigation got the service center to replace the unit. Replacing it took the service center nearly a week.\n\n3.) A simple windshield replacement was needed after a rock caused a crack that started spreading. I scheduled service (soonest I could get a spot was 4 weeks out) which got delayed an additional whole month because “Our glass guy is sick,” and yet another whole month because “We don’t have glass.”\n\n4.) At 4 years of ownership, it was found that elements of the sub-frame were developing soon-to-be catastrophic cracks. No, I didn’t rally race it. Yes, I was religious about washing road salt off of it in wintertime. The upper control arm bushing was also “shredded” according to Firestone.\n\nAfter #4 happened, I drove to a dealership that literal same day and traded it in.",
                "We traded ours in, it was completely paid off (and was bought before Elon went completely asshole), we originally planned to just keep it because selling it doesn’t do anything to Tesla to get rid of it, since they already had the money.\n\nbut when they charged an outrageous $200 per issue to diagnose and didn’t even fix the issue with the GPS we felt it was time and switched to a different EV.",
                "Like 5% of my local carvana/whatever listing are Teslas, which is wild because the number of Tesla I see on the road is not nearly 1/20. Tells you how negative the demand is for these things.",
                "I saw a 22 long range with 4K tax for 19500. Had 45k miles on it.",
                "I used to really admire Tesla, and I saw Elon Musk as someone who stood apart; a visionary who consistently backed himself and put his money where his mouth was.\n\nLike him, I have high-functioning autism. I thought I understood where he was coming from. In many ways, I’m brilliant, but in others, painfully unaware. Enough people have told me that my particular quirks can rub others the wrong way. Over time, I’ve learned that I thrive as a second-in-command, not as a leader. And I’ve come to accept that I should avoid making public statements.\n\nI was seriously considering buying a Tesla. That’s no longer on the table. As a Canadian, watching my country’s sovereignty questioned by the U.S. President with Elon standing in full support.  My decision is firm. It’s a hard no, squared.",
                "Your Tesla purchase indirectly funded the dismantling of the Department of Education and cuts to Medicaid.  Elon used the money he made off those cars to buy the government and pass these policies.  ",
                "The people I know who bought Teslas were well off yuppies, liberal and who cared about the environment (mean that in the best way possible).  Teslas are not cheap and the people who bought them did so instead of something like a BMW or Range Rover.  I myself was considering one before I went for a BMW.  \n\nTesla was like the Apple brand of the car world. \n\nAnd Elon just antagonized that entire base.  Those same folks are embarrassed by their purchase now. ",
                "I believe it. My spouse who doesnt pay attention to this stuff and doesn’t know much context said that she’s been seeing much less Teslas on the road lately",
                "If they continued to buy them after the whole steering wheels falling off recall, it's probably safe to say that trading them in is one of the best decisions they've ever made."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Germany votes for historic boost to defence and infrastructure spending",
            "external_url": "https://www.bbc.com/news/articles/c62z6gljv2yo",
            "upvotes": 79,
            "date": "03/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0b1b/live/350d13d0-0411-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "Just needs the presidents signature now. (In theory he can deny it if he sees grounds for a violation of the constitution)",
                "Good for them. With the US becoming the enemy of the world they are probably going to need it.",
                "... please don't let the afd win the next election. We finally have a chance to let the German army become the best in the world AND be the good guys. I can't handle germany joining the axis with the US this time."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Anti-Vaxx Mom Whose Daughter Died From Measles Says Disease 'Wasn't That Bad'",
            "external_url": "https://www.latintimes.com/anti-vaxx-mom-whose-daughter-died-measles-says-disease-wasnt-that-bad-578871",
            "upvotes": 4198,
            "date": "03/21/2025",
            "thumbnail": "https://d.latintimes.com/en/full/571807/measles-texas.jpg",
            "top_comments": [
                "\"Wasn't that bad\"?\n\nIf dead children isn't that bad, what the fuck *IS* that bad?!",
                "How is this not considered child endangerment and neglect?",
                ">they argued that if measles patients had access to untested treatments, the MMR vaccines would be entirely unnecessary\n\nOf course we need untested treatments because the tested and safe prevention is the problem.",
                "When there is scientific proof that a medical treatment can save lives, and you still decide against, you should be held accountable. Regardless of their religious beliefs, these parents killed their child and should be convicted. This was a preventable death.",
                "Had some absolute idiot on another thread arguing that a parents opinion on their child's medical care is as valuable as a doctors and like just no, giving birth does not magically imbue you with extra knowledge or critical thinking skills.",
                "God this country fucking sucks right now.",
                "It’s beyond sad when political bias and an almost religious favour towards conspiracy theory makes you belittle even the death of your own child.",
                "Again, Anti vaxxers don't love their children & should not have them",
                "# 'Wasn't That Bad'\n\nfor me",
                "If it wasn't that bad, she wouldn't have died."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Halifax musicians say U.S. traffic stop led to drug search, questions about allegiance",
            "external_url": "https://www.cbc.ca/news/canada/nova-scotia/halifax-musicians-pulled-over-asked-canada-or-us-1.7488950",
            "upvotes": 145,
            "date": "03/21/2025",
            "thumbnail": "https://i.cbc.ca/1.7489337.1742511045!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/cassie-and-maggie-macdonald.jpg?im=Resize%3D620",
            "top_comments": [
                "Canadians should not be going to the US, it's in the process of becoming a fascist nation. The next time you go you could find yourself disappeared, I'm only exaggerating a little.",
                "The world is quickly discovering that these United States of ‘Murica are indeed a shithole country to be avoided at all costs",
                "The USA is no longer safe to visit for anyone.",
                "Ah yes, the ol’ ‘probably cause’",
                "If a cop asked for my fucking allegiance I think I would escalate my charges to aggravated assault",
                "I'd like to see the body cam footage"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "In latest blow to Tesla, regulators recall nearly all Cybertrucks",
            "external_url": "https://apnews.com/article/cybertruck-recall-tesla-elon-musk-nhtsa-8c517e21aa1119d74b9db39f6aca01b7",
            "upvotes": 1075,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In totally unrelated news. DOGE will visit the National Highway Traffic Safety Administration next week.",
                ">The National Highway Traffic Safety Administration’s recall, which covers more than 46,000 Cybertrucks, warned that an exterior panel that runs along the left and right side of the windshield can detach while driving, creating a dangerous road hazard for other drivers, increasing the risk of a crash.\n\nBest truck ever!\n\nWhoever had 'Another Cybertruck Recall' on their bingo board, mark your spot! 8 and counting!",
                "Lot of people are going to make some well-earned snarky comments about the truck overall, but the danger of this specific hazard should be taken 100% seriously.\n\nThose from the Midwest may remember what happened to the Willis family back in 1994. An 18\" piece of steel fell off the mudflap assembly of a truck on the freeway and shortly thereafter got caught underneath the Willis' minivan, puncturing their gas tank, instantly engulfing the vehicle in a fireball, and killing six of their children. The parents barely made it out alive and were in critical condition for some time after.\n\nSeveral years later there was finally a $100M settlement, but that's not worth much to a family that lost six of their own.\n\nHunks of metal flying off on the freeway is no joke. It can be catastrophic in truly the most horrifying way possible.",
                "Regulators!  Mount up.",
                "I am shocked... that there are regulators in the US that allowed the cybertruck to be released in the first place.",
                "Regulators are illegal now",
                "Ok, so we know which organisation DOGE will be busting down the door of next week",
                "You mean they're hideously stupid looking, run like shit, *and* they fall apart on the road? \n\nNo wonder our carnival barker in chief want to make owning one compulsory",
                "It's fucking surreal how \"conflict of interest\" works (or does not) in fascist US right now.",
                "The recall will be fixed\n\n\nBut the damage done "
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Detentions of European tourists at US borders spark fears of traveling to America",
            "external_url": "https://apnews.com/article/border-tourists-german-canadian-detention-immigration-408cd27338e8065268fabc835f8b0c34",
            "upvotes": 1077,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They are hosting a world cup and an Olympics under this government lol",
                "\"spent 16 days locked up before being allowed to fly home to Germany.\"\n\nWtf",
                "Add tourism to the list of things Trump is destroying",
                "weeks of solitary confinement and deportation detention due to misunderstandings? \n\nno, thanks",
                "People traveling here on official business should probably receive hazardous duty pay.",
                "They should all go to Canada instead!",
                "Fuck travelling to America\n\nNeither I nor my family is going near there again for a long time.",
                "The World Cup in 2026 is gonna have dismal attendance. Why come to the US to support your national team? Tourists aren’t going to want to spend thousands of dollars to risk being detained by Customs or perhaps ICE.",
                "Basically America is a no fly currently as far as work is acting after one of our guys nearly got caught up in this.\n\nThis is going to be very very bad for international businesses in America now because means anything that needs to be done in person has to happen basically everywhere but America \n\nThe situation is snowballing so fast hell i know personally a few people have cancelled holidays purely over this because their extremely worried what would happen. By the end of the year American is going to be completely isolated",
                "His voters don’t care. Most of them don’t follow the news and if they do the response to 90% of the shit is „good. Fuck ’em.“"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Families of deported Venezuelans are distraught their loved ones were sent to El Salvador",
            "external_url": "https://www.nbcnews.com/news/us-news/families-deported-venezuelans-are-distraught-loved-ones-sent-el-salvad-rcna196950",
            "upvotes": 253,
            "date": "03/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250317-el-salvador-deportations-mn-0910-777d7a.jpg",
            "top_comments": [
                "Imagine living in a country where government officials can be held accountable for their dumbass decisions.\n\nCan't be me.",
                "\"Venezuela proves socialism never works.\"\n\"So you'll give the ones that flee a good experience with capitalism, right? Right?\"",
                "This administration's governing is chaotic and irresponsible at times"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Boy accused of killing elderly man while girl filmed attack ‘can’t keep track’ of murder trial lies, court hears",
            "external_url": "https://news.sky.com/story/boy-accused-of-killing-elderly-man-while-girl-filmed-attack-cant-keep-track-of-murder-trial-lies-court-hears-13332698",
            "upvotes": 158,
            "date": "03/21/2025",
            "thumbnail": "https://e3.365dm.com/25/02/1600x900/skynews-bhim-kohli-leicester_6842418.jpg?20250228162305",
            "top_comments": [
                "What the heck is a “slider”?   The article mentions the man being struck with a slider. But I am unfamiliar with this usage/definition.",
                "He's gonna be wearing some sliders in lockup"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "A month-old girl is pulled from the rubble in Gaza after an airstrike killed her parents",
            "external_url": "https://apnews.com/article/gaza-airstrike-baby-girl-rescued-parents-killed-7b0d1daec3dd229c3556182b9ce56e26",
            "upvotes": 1346,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Poor precious little soul deserves so much more than this",
                "You know I don't understand how this shit happens and people don't expect the child to join hamas or another organization when they grow up.",
                "We're witnessing a genocide in 2025. Humans ain't shit, we need a reset.",
                "My baby just turned one month this past Tuesday. I couldn’t even imagine. This makes me sick. She and the rest of Gaza deserve better.",
                "Everyone knows this conflict won't be \"won\" militarily.  It never has been.  It never will be.\n\nAnyone who uses the phrase \"Total Victory\" is a devilish liar - or worse.\n\nBombing children living in tents under occupation, no water, no electricity, no sanitation or medical facilities -- makes the COWARDLY criminal perpetrators toxic to the world:\n\nMadness is: preferring to take the blood of caged-in women and children to winning the  safe return of your own surviving citizens.\n\nTrump's \"support\" is Encouragement-By-FELON.  That won't protect ANYONE from criminal responsibility  -- JUST ASK his long list of toadies.\n\nTake a look around.  Trump ONLY supports criminals.  Israel should stop touting his support as some kind of blessing.  It always ends the same for Trump, and this DEVIL's on his way to an even bigger FAILure than last time.",
                "Fuck Benjamin Netanyahu.",
                "Only animals punish civilians like this.",
                "Don't be fooled! That's a deadly Hamas fighter, I bet that baby has a gun stashed away underneath its clothes!\n\n\n*obvious /s for anyone not understanding the joke*",
                "She was Hamas everyone is antisemitic",
                "And the world's just letting it happen. I guess if the people are brown the world doesn't care but if they're white there's global outrage."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Tesla owners are trading in their EVs at record levels, Edmunds says",
            "external_url": "https://www.cnbc.com/2025/03/20/tesla-owners-are-trading-in-their-evs-at-record-levels-edmunds-says.html",
            "upvotes": 593,
            "date": "03/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108114358-1741726193117-gettyimages-2203994536-AFP_36ZN8YB.jpeg?v=1742510993&w=1920&h=1080",
            "top_comments": [
                "Poorly ran company without leadership or any quality control standards on their products. Actively dangerous auto driver system linked to dozens of deaths. \n\nNo idea why anyone would want to own a Tesla right now. They’re like BlackBerry. They’re product is only popular because it was first, not because it’s the best. ",
                "I had one of the first 600 Tesla Model Ys. With taxes, etc., it came out to a pretty penny (north of $60k). It was a fun, engaging car and whoo boy that acceleration was bonkers.\n\nThen the reality set in. I kept trying to push through the inconveniences but damned if they didn’t add up quickly. To whit:\n\n1.) A software update meant to improve the positional accuracy of the map bricked - get this - the A/C system. In the summer. It was literally a guessing game whether the A/C would turn on when I got in the car. Persisted for about 3 months before a patch was rolled out.\n\n2.) The vaunted heat pump quit twice, once in winter (as we were moving across the country). Only a threat of litigation got the service center to replace the unit. Replacing it took the service center nearly a week.\n\n3.) A simple windshield replacement was needed after a rock caused a crack that started spreading. I scheduled service (soonest I could get a spot was 4 weeks out) which got delayed an additional whole month because “Our glass guy is sick,” and yet another whole month because “We don’t have glass.”\n\n4.) At 4 years of ownership, it was found that elements of the sub-frame were developing soon-to-be catastrophic cracks. No, I didn’t rally race it. Yes, I was religious about washing road salt off of it in wintertime. The upper control arm bushing was also “shredded” according to Firestone.\n\nAfter #4 happened, I drove to a dealership that literal same day and traded it in.",
                "We traded ours in, it was completely paid off (and was bought before Elon went completely asshole), we originally planned to just keep it because selling it doesn’t do anything to Tesla to get rid of it, since they already had the money.\n\nbut when they charged an outrageous $200 per issue to diagnose and didn’t even fix the issue with the GPS we felt it was time and switched to a different EV.",
                "Like 5% of my local carvana/whatever listing are Teslas, which is wild because the number of Tesla I see on the road is not nearly 1/20. Tells you how negative the demand is for these things.",
                "I saw a 22 long range with 4K tax for 19500. Had 45k miles on it.",
                "I used to really admire Tesla, and I saw Elon Musk as someone who stood apart; a visionary who consistently backed himself and put his money where his mouth was.\n\nLike him, I have high-functioning autism. I thought I understood where he was coming from. In many ways, I’m brilliant, but in others, painfully unaware. Enough people have told me that my particular quirks can rub others the wrong way. Over time, I’ve learned that I thrive as a second-in-command, not as a leader. And I’ve come to accept that I should avoid making public statements.\n\nI was seriously considering buying a Tesla. That’s no longer on the table. As a Canadian, watching my country’s sovereignty questioned by the U.S. President with Elon standing in full support.  My decision is firm. It’s a hard no, squared.",
                "Your Tesla purchase indirectly funded the dismantling of the Department of Education and cuts to Medicaid.  Elon used the money he made off those cars to buy the government and pass these policies.  ",
                "The people I know who bought Teslas were well off yuppies, liberal and who cared about the environment (mean that in the best way possible).  Teslas are not cheap and the people who bought them did so instead of something like a BMW or Range Rover.  I myself was considering one before I went for a BMW.  \n\nTesla was like the Apple brand of the car world. \n\nAnd Elon just antagonized that entire base.  Those same folks are embarrassed by their purchase now. ",
                "I believe it. My spouse who doesnt pay attention to this stuff and doesn’t know much context said that she’s been seeing much less Teslas on the road lately",
                "If they continued to buy them after the whole steering wheels falling off recall, it's probably safe to say that trading them in is one of the best decisions they've ever made."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "In latest blow to Tesla, regulators recall nearly all Cybertrucks",
            "external_url": "https://apnews.com/article/cybertruck-recall-tesla-elon-musk-nhtsa-8c517e21aa1119d74b9db39f6aca01b7",
            "upvotes": 1086,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In totally unrelated news. DOGE will visit the National Highway Traffic Safety Administration next week.",
                ">The National Highway Traffic Safety Administration’s recall, which covers more than 46,000 Cybertrucks, warned that an exterior panel that runs along the left and right side of the windshield can detach while driving, creating a dangerous road hazard for other drivers, increasing the risk of a crash.\n\nBest truck ever!\n\nWhoever had 'Another Cybertruck Recall' on their bingo board, mark your spot! 8 and counting!",
                "Lot of people are going to make some well-earned snarky comments about the truck overall, but the danger of this specific hazard should be taken 100% seriously.\n\nThose from the Midwest may remember what happened to the Willis family back in 1994. An 18\" piece of steel fell off the mudflap assembly of a truck on the freeway and shortly thereafter got caught underneath the Willis' minivan, puncturing their gas tank, instantly engulfing the vehicle in a fireball, and killing six of their children. The parents barely made it out alive and were in critical condition for some time after.\n\nSeveral years later there was finally a $100M settlement, but that's not worth much to a family that lost six of their own.\n\nHunks of metal flying off on the freeway is no joke. It can be catastrophic in truly the most horrifying way possible.",
                "Regulators!  Mount up.",
                "I am shocked... that there are regulators in the US that allowed the cybertruck to be released in the first place.",
                "Regulators are illegal now",
                "Ok, so we know which organisation DOGE will be busting down the door of next week",
                "You mean they're hideously stupid looking, run like shit, *and* they fall apart on the road? \n\nNo wonder our carnival barker in chief want to make owning one compulsory",
                "It's fucking surreal how \"conflict of interest\" works (or does not) in fascist US right now.",
                "The recall will be fixed\n\n\nBut the damage done "
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Anti-Vaxx Mom Whose Daughter Died From Measles Says Disease 'Wasn't That Bad'",
            "external_url": "https://www.latintimes.com/anti-vaxx-mom-whose-daughter-died-measles-says-disease-wasnt-that-bad-578871",
            "upvotes": 4168,
            "date": "03/21/2025",
            "thumbnail": "https://d.latintimes.com/en/full/571807/measles-texas.jpg",
            "top_comments": [
                "\"Wasn't that bad\"?\n\nIf dead children isn't that bad, what the fuck *IS* that bad?!",
                "How is this not considered child endangerment and neglect?",
                ">they argued that if measles patients had access to untested treatments, the MMR vaccines would be entirely unnecessary\n\nOf course we need untested treatments because the tested and safe prevention is the problem.",
                "When there is scientific proof that a medical treatment can save lives, and you still decide against, you should be held accountable. Regardless of their religious beliefs, these parents killed their child and should be convicted. This was a preventable death.",
                "Had some absolute idiot on another thread arguing that a parents opinion on their child's medical care is as valuable as a doctors and like just no, giving birth does not magically imbue you with extra knowledge or critical thinking skills.",
                "God this country fucking sucks right now.",
                "It’s beyond sad when political bias and an almost religious favour towards conspiracy theory makes you belittle even the death of your own child.",
                "Again, Anti vaxxers don't love their children & should not have them",
                "# 'Wasn't That Bad'\n\nfor me",
                "If it wasn't that bad, she wouldn't have died."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Detentions of European tourists at US borders spark fears of traveling to America",
            "external_url": "https://apnews.com/article/border-tourists-german-canadian-detention-immigration-408cd27338e8065268fabc835f8b0c34",
            "upvotes": 1076,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They are hosting a world cup and an Olympics under this government lol",
                "\"spent 16 days locked up before being allowed to fly home to Germany.\"\n\nWtf",
                "Add tourism to the list of things Trump is destroying",
                "weeks of solitary confinement and deportation detention due to misunderstandings? \n\nno, thanks",
                "People traveling here on official business should probably receive hazardous duty pay.",
                "They should all go to Canada instead!",
                "Fuck travelling to America\n\nNeither I nor my family is going near there again for a long time.",
                "The World Cup in 2026 is gonna have dismal attendance. Why come to the US to support your national team? Tourists aren’t going to want to spend thousands of dollars to risk being detained by Customs or perhaps ICE.",
                "Basically America is a no fly currently as far as work is acting after one of our guys nearly got caught up in this.\n\nThis is going to be very very bad for international businesses in America now because means anything that needs to be done in person has to happen basically everywhere but America \n\nThe situation is snowballing so fast hell i know personally a few people have cancelled holidays purely over this because their extremely worried what would happen. By the end of the year American is going to be completely isolated",
                "His voters don’t care. Most of them don’t follow the news and if they do the response to 90% of the shit is „good. Fuck ’em.“"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "A month-old girl is pulled from the rubble in Gaza after an airstrike killed her parents",
            "external_url": "https://apnews.com/article/gaza-airstrike-baby-girl-rescued-parents-killed-7b0d1daec3dd229c3556182b9ce56e26",
            "upvotes": 1344,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Poor precious little soul deserves so much more than this",
                "You know I don't understand how this shit happens and people don't expect the child to join hamas or another organization when they grow up.",
                "We're witnessing a genocide in 2025. Humans ain't shit, we need a reset.",
                "My baby just turned one month this past Tuesday. I couldn’t even imagine. This makes me sick. She and the rest of Gaza deserve better.",
                "Everyone knows this conflict won't be \"won\" militarily.  It never has been.  It never will be.\n\nAnyone who uses the phrase \"Total Victory\" is a devilish liar - or worse.\n\nBombing children living in tents under occupation, no water, no electricity, no sanitation or medical facilities -- makes the COWARDLY criminal perpetrators toxic to the world:\n\nMadness is: preferring to take the blood of caged-in women and children to winning the  safe return of your own surviving citizens.\n\nTrump's \"support\" is Encouragement-By-FELON.  That won't protect ANYONE from criminal responsibility  -- JUST ASK his long list of toadies.\n\nTake a look around.  Trump ONLY supports criminals.  Israel should stop touting his support as some kind of blessing.  It always ends the same for Trump, and this DEVIL's on his way to an even bigger FAILure than last time.",
                "Fuck Benjamin Netanyahu.",
                "Only animals punish civilians like this.",
                "Don't be fooled! That's a deadly Hamas fighter, I bet that baby has a gun stashed away underneath its clothes!\n\n\n*obvious /s for anyone not understanding the joke*",
                "She was Hamas everyone is antisemitic",
                "And the world's just letting it happen. I guess if the people are brown the world doesn't care but if they're white there's global outrage."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "Families of deported Venezuelans are distraught their loved ones were sent to El Salvador",
            "external_url": "https://www.nbcnews.com/news/us-news/families-deported-venezuelans-are-distraught-loved-ones-sent-el-salvad-rcna196950",
            "upvotes": 260,
            "date": "03/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250317-el-salvador-deportations-mn-0910-777d7a.jpg",
            "top_comments": [
                "Imagine living in a country where government officials can be held accountable for their dumbass decisions.\n\nCan't be me.",
                "\"Venezuela proves socialism never works.\"\n\"So you'll give the ones that flee a good experience with capitalism, right? Right?\"",
                "This administration's governing is chaotic and irresponsible at times"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Norwegian man files complaint against ChatGPT for falsely saying he killed his sons",
            "external_url": "https://www.abc.net.au/news/2025-03-21/norwegian-man-files-complaint-chatgpt-false-claims-killed-sons/105080604",
            "upvotes": 521,
            "date": "03/21/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/6d0a4fee09332a2919340a019cd2893a?impolicy=wcms_watermark_news&cropH=2440&cropW=4338&xPos=0&yPos=226&width=862&height=485&imformat=generic",
            "top_comments": [
                "in the future instead of fighting ai spam calls, you'll be fighting ai fake stories about you based on real info it scrapes on you. but its already now... so its only going to get worse.",
                "This is up there with [\"the sun spoke to me and told me to not release my Kickstarter board game\" ](https://youtu.be/v4qzqGXsqSE?si=eHISOYyFXk7hZ0Df)",
                "One for the growing field of…robo-law?",
                "And yet I keep being downvoted when I tell people to stop using ChatGPT as a source of information.",
                "Openai should be liable for slander lawsuits."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Heathrow Airport closes due to major power outage caused by substation fire",
            "external_url": "https://www.abc.net.au/news/2025-03-21/heathrow-airport-closes-after-power-outage-substation-fire/105081908?utm_source=abc_news_app&utm_medium=content_shared&utm_campaign=abc_news_app&utm_content=link",
            "upvotes": 211,
            "date": "03/21/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/9dcb113b3ab8ac35628d50e87fb21b92?impolicy=wcms_watermark_news&cropH=665&cropW=1182&xPos=0&yPos=105&width=862&height=485&imformat=generic",
            "top_comments": [
                "I was about to leave for the airport when my neighbor knocked on my door at 4:30am and told me about the fire.",
                "shutting an entire airport is crazy",
                "Flying is frustrating enough nowadays, now this on top.",
                "I blame Putin (with unsubstantiated claims).",
                "Wait, don't Airports have emergency generators for at least the essentials? (ATC, Runway lights, and security)",
                "That's crazy. Though Heathrow is already one of the worst airports to have a layover in, so this may be a blessing in disguise.",
                "Very odd that a substation caught fire like that. Never heard of it happening before,coincidentally happens to supply the uks busiest airport.\n\nSilver foil hat time…",
                "Terrific...supposed to fly there this weekend .",
                "This better be over by Monday when I fly back to the uk"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Musk Set to Get Access to Top-Secret U.S. Plan for Potential War With China",
            "external_url": "https://www.nytimes.com/2025/03/20/us/politics/musk-pentagon-briefing-china-war-plan.html?unlocked_article_code=1.5k4.SRAZ.aIZGK_LvUkAE&smid=nytcore-android-share",
            "upvotes": 6516,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Just a friendly reminder that Musk has total access to and control of the federal government only because he gave Trump 250 million dollars. This is what extra-national oligarchy looks like. ",
                "This is just getting more insane with each new day ….",
                "Just to hammer home, there is absolutely *no* chance that Elon could pass a background check for clearance because of his drug use.",
                "What the actual fuck?",
                "Why does this un-elected dude get nearly limitless access to the government? It’s crazy.",
                "God damn, are our military leaders a bunch of spineless fucks too? This is going to get American soldiers fucking **killed**.",
                "Remember when Hillary sent an email from a non-secure server? Yeah I think this is far worse.",
                "He really did buy the presidency didn’t he?\n\nThis is pure insanity. Can’t wait for all the conservatives to tell us why it’s great some unelected billionaire is now working with the Pentagon on secret war plans.",
                "the thing i'm shocked about the most, is that each successive outrage is exponentially more shocking and outrageous than the previous high, usually days between.",
                "Such a massive conflict of interest. In addition to Elon Musk’s own business interests in China, his mother, Maye Musk, regularly visits China for business opportunities and advertising, and is an [ambassador to some Chinese mattress company](https://www.nbcnews.com/news/world/china-elon-musk-maye-musk-rcna182118): \n\n“For [Maye] Musk, that means appearing on magazine covers and lots of opportunities to endorse products. She has walked the runway for Chinese apparel brand JNBY and appeared at an event in Shanghai this year for the sportswear brand Fila.\n\nShe is also a global brand ambassador for Chinese mattress brand AISE Baobao, attending a store opening in Shanghai this month, and has appeared in smartphone advertisements for Chinese consumer electronics manufacturer Oppo.”"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "People named in JFK assassination documents are not happy their personal information was released",
            "external_url": "https://apnews.com/article/jfk-assassination-files-personal-information-5609ccd6e106c5b30ee6b6cca3a30e3c",
            "upvotes": 8881,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Interesting that the JFK documents were insufficiently redacted, while the Epstein documents were redacted to the point of uselessness.",
                "The problem is the social security numbers of these living individuals were not redacted.",
                "So the only thing new was that we all know Digenova's SS number. Cool.",
                ">“It should not have happened,” diGenova said in a phone interview Thursday. “I think it’s the result of incompetent people doing the reviewing. I don’t believe it had anything to do with rushing the process. The people who reviewed these documents did not do their job.”\n\nYeah i can definitely see incompetent people involved in this and a lot else going on rn",
                "It's crazy that these people will get new SSNs, meanwhile pretty much every American's SSN has been leaked as part of a data breach at some point recently. It's beyond time for a more modern system. ",
                "So, no new info except for the stuff that was correctly and competently redacted in the past to protect people that absolutely deserved to be shielded from having their private info thrown to the conspiracy theorist wolves.\n\nNo surprise at all to any of that.",
                "can you imagine having to get a new social security number in yours 70s lol and with the current state of that department under this admin right now",
                "Has anything knew or interesting come from this document release? I think it was just red meat to keep people's attention away from the Epstein diaries.",
                "Leavitt doesn’t understand the difference between proactively and reactively.",
                "Lol they're going to help those affected by monitoring their credit.  Thats like a free pizza coupon for finding a hair in your delivered papa John's."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "03/21/2025 12:15:19 UTC"
}