{
    "posts": [
        {
            "category": "HOT",
            "title": "US Senator Van Hollen says he met wrongly deported man in El Salvador",
            "external_url": "https://www.reuters.com/world/americas/us-senator-van-hollen-says-he-met-wrongly-deported-man-el-salvador-2025-04-18/",
            "upvotes": 16291,
            "date": "04/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"I look forward to providing a full update upon my return.\" \n\nAKA\n\nI ain't saying shit until I'm out of El Salvador and they can't keep me here.",
                "This should be a message to all the other Dems in Congress - you can accomplish more than you think by *just trying* - and while this is just the start, it's encouraging to see him alive. We wouldn't have gotten that if this man hadn't said fuck it and put his money where his mouth is. I applaud you, sir.",
                "Van Hollen’s dad was a career state department official and ambassador to Sri Lanka and the Maldives. His mom was the chief of the CIA bureau for South Asia. I would say growing up in a family like that you learn a thing or two and how to handle things like this.",
                "Well I guess I’m eating crow.  I was certain he would be dead",
                "Good on him for showing up. I hope something can be done, for all of our sakes. Garcia deserves due process, like every person does.",
                "Senator Van Hollen is a true patriot and a real American. WELL DONE.",
                "This is the best headline i've seen in a long time,  which is crazy because its not event that great of headline with him still in jail/detained.",
                "Van Hollen is an ACTUAL democratic representative. He did what he was supposed to do for his constituent. Nobody else in congress can say the same.",
                "It's a relief there's proof of life",
                "WELL DONE, SENTATOR VON HOLLEN!\n\nJesus Christ, all this work to confirm a legal resident wasn't murdered by the State. NOT OK."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "US FDA suspends food safety quality checks after staff cuts",
            "external_url": "https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/",
            "upvotes": 18466,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is going to kill people. \n\nGuaranteed.",
                "“ The program will be suspended at least through September 30 and means the agency will be unable to do planned quality control work around lab testing for the parasite Cyclospora in spinach or the pesticide glyphosate in barley, among other tests, the email says…\n\nThe FDA in early April suspended an effort to improve its testing for bird flu in milk, cheese and pet food, as a result of staff cuts.“",
                "Stuff like that is basically going to made any food created in the US unsellable to any place in the world with a food standard.",
                "Poison themselves to own the libs.",
                "Upton Sinclair is rolling in his grave.",
                "Food safety checks + fluoride + vaccines + deportations = huge decrease of the population in the next years",
                "Oh good I was hoping I would get worms in 2025",
                "Ummm… do republicans not eat food?",
                "Wtf are my taxes even for anymore?",
                "It's almost like they could have watched Brexit unfold, and then UK food exports plummet when they fail EU standards. But that would involve observing reality objectively, a lot to ask for."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Luigi Mangione indicted on federal charges for CEO killing",
            "external_url": "https://abcnews.go.com/US/luigi-mangione-indicted-federal-charges-ceo-killing/story?id=120928265",
            "upvotes": 7662,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/931a7c11-69d1-4946-aa45-634183daf09e/luigi-1-rt-er-250411_1744399799486_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "This is going to be a shitshow.",
                "how fitting today UNH drops 22%",
                "Is it normal for this stuff to be federal in the US?",
                "Any updates from his lawyers they were finally given discovery?? For the longest time his team kept giving PSAs that law enforcement refuses to share discovery. His team should investigate McDonalds and their kiosks with facial recognition, too!",
                "And the 20 year old that murdered 2 and injured 6 at fsu today? Think it’ll be the same? Are we deporting them? Thought the deal was deport “homegrown” criminals now.",
                "They're totally going to end up deporting him to El Salvador. Calling it.",
                "Maybe they’ll try to put a jury together, full of CEOs and executives. I bet they’re terrified of jury nullification.",
                "Jury nullification. Keep repeating it.",
                "I hope his defense team subpoenas shady Mayor Adam's,  Given the slimey way he was arrested and statements made to the media.",
                "If someone smuggles him a MAGA hat and fakes some pro J6 posts written by him, he will guarantee himself a presidential pardon and the support of law-enforcement."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "U.S.-born man held for ICE under Florida’s new anti-immigration law • Oklahoma Voice",
            "external_url": "https://oklahomavoice.com/2025/04/17/u-s-born-man-held-for-ice-under-floridas-new-anti-immigration-law/",
            "upvotes": 10840,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Yeah. Yesterday I was posting about them going after US citizens and people were all \"well acshually\"... but that was yesterday and today is today.\n\nNo American of any origin, race, or gender should consider themselves safe.",
                "Did we all forget about the Japanese-American concentration camps in the United States?   It happened before.  It can happen again.",
                "First they deport the Illegals.  \n\nThen the undesirables.\n\nThen the Protestors.\n\nThen the dissenters.\n\nThen they will come for you.",
                "> Based on her inspection of his birth certificate and Social Security card, Riggans said she found no probable cause for the charge. However, the state prosecutor insisted the court lacked jurisdiction over Lopez-Gomez’s release because U.S. Immigration and Customs Enforcement had formally asked the jail to hold him.\n\nHe is an American born in Georgia, picked up on spurious charges using a bullshit law, violating his constitutional rights, and ICE simply asked and now they can hold him indefinitely.\n\nThat's a pretty clear violation of Article 4 (Privileges and Immunities). This is bullshit.",
                "The officials who arrested him deserve no “benefit of the doubt” here. He needs to be released immediately, with an apology and an opportunity to pursue a settlement. ICE needs to be defunded. ",
                "On top of this, [Sebastian Gorka, aka the man in charge of creating and executing Trump's domestic terrorism policy, said today that anyone advocating for Abrego Garcia can be charged with aiding and abetting terrorism](https://www.independent.co.uk/news/world/americas/us-politics/sebastian-gorka-kilmar-abrego-garcia-activists-b2735153.html).\n\nOh, and [there's a good chance Martial Law will be declared on Sunday or Monday](https://www.citizen-times.com/story/news/local/2025/04/16/what-is-the-insurrection-act-of-1807-will-trump-declare-martial-law/83121238007/).\n\nThe First Amendment is dead, and speaking out against the regime will get you arrested and disappeared, natural born citizen or no. The United States is now officially a Fascist Dictatorship.",
                "Hey look it’s the thing everyone said he wouldn’t do. Wonder how the Latinos for Trump are feeling right now.",
                "This is profiling. He was born in the United States. He is only being detained because he doesn't speak English.",
                "People keep using the term \"deported\". I don't mean to sound pedantic but it doesn't really do justice to what's happening. \n\nA lot of these \"deportations\" are more akin to human trafficking.",
                "He's just going to deport criminals. Why are you protecting criminals?\n\nWell, actually, anyone who entered illegally is technically a criminal so yes all illegal aliens should be deported. \n\nThat guy was following the legal process and had an open asylum case plus a non-deportation order but this other judge said he's MS-13 so he should be deported. \n\nOK, sure that person had a Green Card and they were here legally but they said mean things about our ally so they should be deported. \n\nInterested to see how the cult will spin this one. How are you gonna move the goalpost this time MAGA?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "A deadly E. coli outbreak hit 15 states, but the FDA chose not to publicize it | NBC News",
            "external_url": "https://www.nbcnews.com/news/us-news/ecoli-bacteria-lettuce-outbreak-rcna200236",
            "upvotes": 3574,
            "date": "04/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250426-e-coli-outbreak-lr-579595.jpg",
            "top_comments": [
                "I got sick with food poisoning (salmonella) and because my state has (or at least had) a robust health department, it was traced to a particular restaurant.\n\nWhether or not the restaurant was negligent, or just had the bad luck of having some food that was spoiled, I have no idea. But the health department folks researched it  traced it. Amazing work. This is work that takes having adequate staffing. \n\nI don't know if this will happen anymore in my state. But I am very appreciative of the staff at the Dept of Health who helped me and told them as much that they were rock stars.",
                "It literally never lists the 15 states in the entire article.",
                "Beginning to sound a lot like Fahrenheit 451, isn't it?",
                "“If we stop testing right now, we’d have very few cases, if any.”",
                "Note this discovery is in conjunction with the US FDA cuts wccording to reuter [https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/](https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/)\n\nHighly concerning to US food safety, and wont make it easier for the US to export their agricultural products overseas.\nEdit: this occured last year supposedly and was never reported, things are likely far worse now",
                "Yes, America is failing its citizens to allow for corporate greed",
                "TLDR: the states (cases per state) are AR (2), CO (1), IL (7), IN (8),KS (1), KY (1), MO (50), MT (1), ND (2), NE (3), OH (8), PA (1), SD (1), TN (1), WI (2)",
                "Chose not to?  Or weren't allowed to?  I seem to remember an executive order or two gagging the CDC a while back.",
                "Probably because DOGE fired the people who normally publicize these things.",
                "**Censorship by omission**"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Active shooter reported on Florida State University campus",
            "external_url": "https://www.cnn.com/2025/04/17/us/florida-state-university-active-shooter/index.html",
            "upvotes": 23452,
            "date": "04/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21552290-116331-746-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> Suspect in custody\n1:05 p.m. – A Tallahassee police spokesperson confirmed that one person is in custody but could not confirm any deaths. There were, however, \"multiple injuries.\"\n\nA live update on another article.",
                "Shooter in custody according to CNN.",
                "6 patients, 1 in critical condition, the rest in serious condition \n\nhttps://www.tallahassee.com/story/news/local/2025/04/17/active-shooter-reported-at-fsu-shelter-in-place-alert-sent-out/83139928007/\n\nEdit: as of 2p  law enforcement has not confirmed any deaths\n\n\nEdit 2: as of 2:32, NBC reporting one dead, 6 injured\n\n\nhttps://www.nbcnews.com/news/us-news/live-blog/florida-state-university-active-shooter-rcna201756\n\nEdit 3: 4:35p according to press conference, 2 dead (not students), 5 injured, they have ID'd the shooter, 20 yo son of sheriff deputy, I did not catch the name, he had access to one of her weapons which was found at the scene",
                "CNN says the suspect used his mom's gun, and that the suspect's mom was a sheriff deputy.",
                "Reminder that FSU had a similar event back in 2014 when a gunmen went into the library and started shooting kids.",
                "Yesterday was 18 years since the Virginia Tech shooting 😢",
                "Sad to think some of these kids are graduates of Stoneman, and most likely experienced their second school shooting of their life. Unreal and awful.",
                "His IG just got taken down, was already private, all I saw was the Bio. Bio was just a quote from Jeremiah: \"You are my war club, my weapon for battle— with you I shatter nations, with you I destroy kingdoms\"",
                "Actually briefly forgot about mass shootings at schools. Sigh.",
                "I live right off campus. My friend is in the midst of it right now. Horrifying situation. Seems like there are some injured, possibly dead. Really really sad and just hoping it’s over soon. We get alerts pretty consistently and there has yet to be an all clear. "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "2 Defense Department officials, including senior adviser to Pete Hegseth, put on leave amid leak investigation",
            "external_url": "https://www.cbsnews.com/news/dan-caldwell-pentagon-leak-investigation-on-leave/",
            "upvotes": 25838,
            "date": "04/17/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/15/37068e63-d5d8-44de-a1f5-d962712cccf3/thumbnail/1200x630/18120fcbb01fc5c0cb9650e2ab0af4fe/gettyimages-2203658198.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                ">A source familiar says Caldwell is accused of sharing classified documents with reporters.\n\nOh, is that a problem for Hegseth now?",
                "Such a mess. 0 Professionalism",
                "What about Hegseth? Shouldn't he be on leave too?",
                "WHISKEY LEAKS\nRemember: Trump only hires the best. ",
                "Damn, I got excited when I misread \"including Pete hegseth\"... then I remembered he's already at the top of that chain",
                "Every top official on that chat knew it was illegal to use for classified information. All of them, including the VP, needs to be impeached, removed from office, and prosecuted.",
                "This DEI-less experiment seems to be a disaster.  Can we go back to being really good at things again?",
                "Imagine being the one in the chat, leaking information, and then it's your assistant that gets suspended...Much accountability, much wow.",
                "It's three of them now. https://www.politico.com/news/2025/04/16/pentagon-official-suspended-leak-investigation-00293473",
                "Just over 3 months in and this administration is a shitshow. Totally expected but hey at least we are Making America Great Again lol  /s"
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "HOT",
            "title": "Hamas says it is ready to release all remaining hostages for an end to Gaza war",
            "external_url": "https://www.reuters.com/world/middle-east/hamas-is-ready-release-all-remaining-hostages-return-an-end-gaza-war-hamas-gaza-2025-04-17/",
            "upvotes": 4023,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "How many are still alive?",
                "Haven't they said this before, then continued to pile on additional conditions or delayed the release?",
                "I don't see Israel stopping for anything at this point; they've clearly decided that they're going to \"solve\" the Palestinian situation once and for all.",
                "I'll believe it when I see it.",
                "Hamas also needs to disarm.\n\nPalastine needs to form some type of union with the goal of building a nation. If their only goal is to destroy Isreal, they will only get destruction in return.",
                ">Instead, Hayya said Hamas was ready to immediately engage in “comprehensive package negotiations” to release all remaining hostages in its custody in return for an end to the Gaza war, the release of Palestinians jailed by Israel, and the reconstruction of Gaza.\n\nAh, another day, another delusional “offer” from Hamas. Good thing they can count on their Reddit supporters to only read the headlines.",
                "\"Instead, Hayya said Hamas was ready to immediately engage in \"comprehensive package negotiations\" to release all remaining hostages in its custody in return for an end to the Gaza war, the release of Palestinians jailed by Israel, and the reconstruction of Gaza.\"\n\nlol the delusion",
                "Hamas needs to cease to exist for anything to go forward.",
                "Oh yeah. After all of Gaza is in ruins… now they are willing. Perfect negotiating skills right there",
                "Hamas needs to vacate Gaza.  Iran needs to stop funding them and the other state sponsored terrorist groups.  Why would Israel negotiate with terrorists?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "FSU shooting latest: 2 dead, 6 injured; 20-year-old suspect in custody",
            "external_url": "https://abcnews.go.com/US/active-shooter-reported-florida-state-university-fsu-alert/story?id=120911309",
            "upvotes": 3482,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e3506d3e-63c6-451e-8d02-9562dd438499/fsu-shooting-mo_1744921382783_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The son of a local sheriff's deputy allegedly opened fire near the Student Union at Florida State University in Tallahassee on Thursday, killing two people and injuring six others, authorities said.\n\nThe suspect -- 20-year-old Phoenix Ikner, a current FSU student -- was shot by responders and has been hospitalized, police said. He was taken into custody with non-life-threatening injuries, multiple law enforcement officials told ABC News.\n\nIkner is the son of a current Leon County sheriff's deputy, according to Sheriff Walter McNeil. He had access to one of his mother's personal weapons, which was one of the weapons found at the scene, the sheriff said. It appeared Ikner had a handgun and a shotgun with him, police said.\n\nThe suspect's mother has been a deputy with the department for more than 18 years and \"her service to this community has been exceptional,\" McNeil said.\n\nThe suspect was also a \"long-standing member\" of the Leon County Sheriff's Office's Youth Advisory Council, McNeil said.\n\nHe was \"engaged in a number of training programs that we have,\" the sheriff said, adding, \"Not a surprise to us that he had access to weapons.\"...",
                ">The suspect in the FSU shooting espoused white supremacist views and was removed from a political club, the group's president, Reid Seybold, said.\n\n>Seybold said he was part of a club with the suspect at Tallahassee State College, where they both attended before transferring to FSU. He was president of a club called \"political round table,\" where the suspect was asked not to return after repeated issues with the suspect's rhetoric.\n\n>\"Basically our only rule was no Nazis — colloquially speaking — and he espoused so much white supremacist rhetoric, and far-right rhetoric as well, to the point where we had to exercise that role,\" Seybold said.\n\nhttps://www.nbcnews.com/news/us-news/live-blog/florida-state-university-active-shooter-rcna201756",
                "So will he be called a domestic-terrorist because of his previous statements made towards people of a certain political party?  \n\n  \nSurely they will come down hard on him right?",
                "FSU shooter quoted in January about anti Trump protesters at FSU:  “These people are usually pretty entertaining, usually not for good reasons,” Phoenix Ikner, a political science major, said. “I think it’s a little too late, he’s \\[Trump\\] already going to be inaugurated on Jan. 20 and there’s not really much you can do unless you outright revolt, and I don’t think anyone wants that.” \n\n[https://www.fsunews.com/story/news/2025/01/19/sds-holds-march-down-legacy-walk-to-protest-trumps-agendatallahassee-sds-protests-trump-agenda-and-f/77756710007/](https://www.fsunews.com/story/news/2025/01/19/sds-holds-march-down-legacy-walk-to-protest-trumps-agendatallahassee-sds-protests-trump-agenda-and-f/77756710007/)",
                ">The suspect was also a \"long-standing member\" of the Leon County Sheriff's Office's Youth Advisory Council, McNeil said.\n\nIt seems like Leon County Sheriff's Office's is directly working under the satan's guidance.",
                "Hoping his mother’s failure to secure her personal firearms is scrutinized thoroughly",
                "To El Salvador you go… right?",
                "Well at least the 10 ncaa trans athletes in this country are being kept in check",
                "Yet another white, republican terrorist.",
                "Well at least we're rounding up immigrants to stop this nonsense."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "HOT",
            "title": "Florida State gunman used deputy mom’s former service weapon to kill 2 and wound 6, authorities say",
            "external_url": "https://apnews.com/article/florida-state-university-shooter-alert-bf66a24ea91959697c7138089b2ef6fb",
            "upvotes": 1654,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*“He has been steeped in the Leon County Sheriff’s Office family, engaged in a number of training programs that we have,” McNeil said. “So it’s not a surprise to us that he had access to weapons.”*\n\nBut I bet a bit of a surprise as to what he did with that access to weapons--or maybe not at all.",
                "Mom should be held culpable.",
                "Hmm ...\n\nGOPers will blame mental health and behave like nothing big or traumatizing has happened, hate to say but gun violence has been normalized by GOP.",
                "WAIT this is the perfect moment. Time to prove you’re deporting the bad Americans",
                "A person that allows another person access to their guns should be prosecuted as an assessory when the weapon is used to commit a crime.",
                "The real story is that he is maga.",
                "Of all the people who should be shipped off to CECOT without trial this guy is of the true worst of the worst. Something tells me he'll get his multi-year due process though.",
                "Republicans trying not to talk shit about the liburhal media challenge: IMPOSSIBLE \n\nhttps://imgur.com/a/VNdo1aq",
                "Well, he's either going to be sent to an El Salvadorian concentration camp, or be made into the next Homeland Security Secretary. Given that he's a white male Republican whose expressed anger towards Democrats, I'll assume the latter.",
                "That articles shows a lot of photos of students hanging around outside during an active shooting. \n\nIf you’re ever anywhere where this is happening, get inside anywhere and lock the door until you get word about an all clear."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Kilmar Abrego Garcia meets with Maryland senator in El Salvador, weeks after mistaken deportation",
            "external_url": "https://www.cbsnews.com/news/maryland-sen-van-hollen-meets-with-mistakenly-deported-kilmar-abrego-garcia-in-el-salvador/",
            "upvotes": 902,
            "date": "04/18/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/18/7c3a9c5a-b900-45da-9527-01a08aea501a/thumbnail/1200x630/416c08752514a8de3edc7683f8bc6445/garcia2.png?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Can we stop calling it \"mistaken deportation\"? This was not a mistake.",
                "Feels like they gave him a hat to cover his shaved head and dressed him up in bright colours to give the perception that he's just hanging out, having a great time. If he's fine and not in a torture prison, just send him home. What do they get out of keeping him there?",
                "I am relieved to hear he is alive. Now he needs to come home.",
                "Finally some good news. It’s not much but it’s *something*.",
                "Nothing \"mistaken\" about this.",
                "He’s not dead? That’s wonderful news!",
                "Bukele's post\n\n[https://x.com/nayibbukele/status/1913035243918864742](https://x.com/nayibbukele/status/1913035243918864742)",
                "“an illegal alien MS-13 terrorist”\n\nLol he really used every buzzword he could think of to try and convince people this wasn’t a mistake",
                "Well at least he is alive I guess",
                "So happy I was wrong about him being dead."
            ],
            "aggregate_sentiment": 70.0
        },
        {
            "category": "NEW",
            "title": "Trump administration announces fees on Chinese ships docking at U.S. ports",
            "external_url": "https://www.cnbc.com/2025/04/17/trump-administration-announces-fees-on-chinese-ships-docking-at-us-ports.html",
            "upvotes": 357,
            "date": "04/18/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108132371-1744750747440-gettyimages-2210460440-jr_11302_2mfwszjy.jpeg?v=1744750835&w=1920&h=1080",
            "top_comments": [
                "Wait. So they want to charge a fee where every time a Chinese BUILT ship comes into a US port we tax it? Not even a who owns it fee, but simply where the ship was built even if it’s owned by a US company. \n\nYeah, that’s going to go over well. Where the fuck do we even do commercial shipbuilding anymore? This is just going to make prices go up even more because it’s now a tax on shipping that’s going to be passed on to consumers.",
                "Every second it just gets dumber.  Impeach this guy please. ",
                "Trump’s just mad at China because they were able to build a wall. A Great Wall",
                "He is doing everything he can to tank the US dollar.",
                "I work in this industry. most vessels nowadays are manufactured in China. the USA does not have enough vessels to satisfy their supply needs, this will kill much of the north american shipping industry dead in the water.",
                "USA has become a hostile nation to be avoided in all ways trade and tourism . \n\nThe fallout of this dumbfuckery will last for decades .",
                "This is crazy. No one will want to trade with the US",
                "I am willing to bet all these fees are not going to the ship building industry and into someone else's coffers.",
                "Does anyone in the Whitehouse have a basic understanding of economics or international trade? Are they wanting to start a war with China without any provocation? Is this new tax because Xi won't answer the phone? The USA economy is going to be in ruins before anything is done to stop the madness.",
                "Basically, Trump wants world economy to fail. He will then say or retract the imposed tarrif and such rules to bo claim he saved the economy. Creat a problem to seam like fixing it."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "US Senator Van Hollen says he met wrongly deported man in El Salvador",
            "external_url": "https://www.reuters.com/world/americas/us-senator-van-hollen-says-he-met-wrongly-deported-man-el-salvador-2025-04-18/",
            "upvotes": 16310,
            "date": "04/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"I look forward to providing a full update upon my return.\" \n\nAKA\n\nI ain't saying shit until I'm out of El Salvador and they can't keep me here.",
                "This should be a message to all the other Dems in Congress - you can accomplish more than you think by *just trying* - and while this is just the start, it's encouraging to see him alive. We wouldn't have gotten that if this man hadn't said fuck it and put his money where his mouth is. I applaud you, sir.",
                "Van Hollen’s dad was a career state department official and ambassador to Sri Lanka and the Maldives. His mom was the chief of the CIA bureau for South Asia. I would say growing up in a family like that you learn a thing or two and how to handle things like this.",
                "Well I guess I’m eating crow.  I was certain he would be dead",
                "Good on him for showing up. I hope something can be done, for all of our sakes. Garcia deserves due process, like every person does.",
                "Senator Van Hollen is a true patriot and a real American. WELL DONE.",
                "This is the best headline i've seen in a long time,  which is crazy because its not event that great of headline with him still in jail/detained.",
                "Van Hollen is an ACTUAL democratic representative. He did what he was supposed to do for his constituent. Nobody else in congress can say the same.",
                "It's a relief there's proof of life",
                "WELL DONE, SENTATOR VON HOLLEN!\n\nJesus Christ, all this work to confirm a legal resident wasn't murdered by the State. NOT OK."
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "NEW",
            "title": "A deadly E. coli outbreak hit 15 states, but the FDA chose not to publicize it | NBC News",
            "external_url": "https://www.nbcnews.com/news/us-news/ecoli-bacteria-lettuce-outbreak-rcna200236",
            "upvotes": 3583,
            "date": "04/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250426-e-coli-outbreak-lr-579595.jpg",
            "top_comments": [
                "I got sick with food poisoning (salmonella) and because my state has (or at least had) a robust health department, it was traced to a particular restaurant.\n\nWhether or not the restaurant was negligent, or just had the bad luck of having some food that was spoiled, I have no idea. But the health department folks researched it  traced it. Amazing work. This is work that takes having adequate staffing. \n\nI don't know if this will happen anymore in my state. But I am very appreciative of the staff at the Dept of Health who helped me and told them as much that they were rock stars.",
                "It literally never lists the 15 states in the entire article.",
                "Beginning to sound a lot like Fahrenheit 451, isn't it?",
                "“If we stop testing right now, we’d have very few cases, if any.”",
                "Note this discovery is in conjunction with the US FDA cuts wccording to reuter [https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/](https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/)\n\nHighly concerning to US food safety, and wont make it easier for the US to export their agricultural products overseas.\nEdit: this occured last year supposedly and was never reported, things are likely far worse now",
                "Yes, America is failing its citizens to allow for corporate greed",
                "TLDR: the states (cases per state) are AR (2), CO (1), IL (7), IN (8),KS (1), KY (1), MO (50), MT (1), ND (2), NE (3), OH (8), PA (1), SD (1), TN (1), WI (2)",
                "Chose not to?  Or weren't allowed to?  I seem to remember an executive order or two gagging the CDC a while back.",
                "Probably because DOGE fired the people who normally publicize these things.",
                "**Censorship by omission**"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Impose a pipeline on Indigenous nations? Not so fast, say Indigenous rights lawyers | CBC News",
            "external_url": "https://www.cbc.ca/news/indigenous/leaders-french-debate-indigenous-pipelines-1.7513421?__vfz=medium%3Dsharebar",
            "upvotes": 230,
            "date": "04/18/2025",
            "thumbnail": "https://i.cbc.ca/1.7512471.1744846333!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/fedelxn-debates-20250416.jpg?im=Resize%3D620",
            "top_comments": [
                "*\"You cannot impose. As a leader of the federal government, you have constitutional obligations. It's well developed under Canadian law that you have to respect Indigenous rights.\"*\n\nThis is a critical part of Canadian law, but.... but the manufacturing of consent has happened...  how many times?  And many related to pipelines from the north to parts south and east.",
                "I hate pipelines but also think giving indigenous groups a veto over national infrastructure is ridiculous."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Florida State gunman used deputy mom’s former service weapon to kill 2 and wound 6, authorities say",
            "external_url": "https://apnews.com/article/florida-state-university-shooter-alert-bf66a24ea91959697c7138089b2ef6fb",
            "upvotes": 1661,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*“He has been steeped in the Leon County Sheriff’s Office family, engaged in a number of training programs that we have,” McNeil said. “So it’s not a surprise to us that he had access to weapons.”*\n\nBut I bet a bit of a surprise as to what he did with that access to weapons--or maybe not at all.",
                "Mom should be held culpable.",
                "Hmm ...\n\nGOPers will blame mental health and behave like nothing big or traumatizing has happened, hate to say but gun violence has been normalized by GOP.",
                "WAIT this is the perfect moment. Time to prove you’re deporting the bad Americans",
                "A person that allows another person access to their guns should be prosecuted as an assessory when the weapon is used to commit a crime.",
                "The real story is that he is maga.",
                "Of all the people who should be shipped off to CECOT without trial this guy is of the true worst of the worst. Something tells me he'll get his multi-year due process though.",
                "Republicans trying not to talk shit about the liburhal media challenge: IMPOSSIBLE \n\nhttps://imgur.com/a/VNdo1aq",
                "Well, he's either going to be sent to an El Salvadorian concentration camp, or be made into the next Homeland Security Secretary. Given that he's a white male Republican whose expressed anger towards Democrats, I'll assume the latter.",
                "That articles shows a lot of photos of students hanging around outside during an active shooting. \n\nIf you’re ever anywhere where this is happening, get inside anywhere and lock the door until you get word about an all clear."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "American citizen hijacks small plane in Belize, 3 injured",
            "external_url": "https://abcnews.go.com/International/american-citizen-hijacks-small-plane-belize-3-injured/story?id=120916154",
            "upvotes": 230,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/26df2c2b-0032-4b7f-b673-0cafd853ce3c/belize-plane-04-ht-jt-250417_1744916656230_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Filibusters (in the original sense) coming back into fashion?? \n\n> ... a mercenary who travelled illegally in an organized group **from the United States to a country in Central America** or the Spanish West Indies in the mid-19th century seeking economic and political benefits through **armed force.**\n\nhttps://en.wiktionary.org/wiki/filibuster#Noun",
                "\"hijacked a small plane at knifepoint \"\n\n\"The hijacker was fatally shot in the chest by a passenger who had a licensed firearm\"\n\nWell, that is what happen when you bring a knife to a gun fight. A rare case when the day is saved by the good guy with a gun.",
                "Not sending their best.",
                "I have flown as a passenger on that flight four times. I have passed through their security, how did the good guy’s gun get in the cabin?",
                "Reminds me of this book I read that talked about how common skyjacking was in 70s. There’s just something about wanting a plane to fly you to a third world country when you jump off the deep end.",
                "When the United States sends its people, they're not sending their best. They're sending people that have lots of problems, and they're bringing those problems with us. They're bringing drugs. They're bringing crime. They're plane hijackers. And some, I assume, are good people.",
                "US airlines have become so unsafe under Trump’s FAA that terrorists have to go to other countries just to hijack a plane."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Luigi Mangione indicted on federal charges for CEO killing",
            "external_url": "https://abcnews.go.com/US/luigi-mangione-indicted-federal-charges-ceo-killing/story?id=120928265",
            "upvotes": 7665,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/931a7c11-69d1-4946-aa45-634183daf09e/luigi-1-rt-er-250411_1744399799486_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "This is going to be a shitshow.",
                "how fitting today UNH drops 22%",
                "Is it normal for this stuff to be federal in the US?",
                "Any updates from his lawyers they were finally given discovery?? For the longest time his team kept giving PSAs that law enforcement refuses to share discovery. His team should investigate McDonalds and their kiosks with facial recognition, too!",
                "And the 20 year old that murdered 2 and injured 6 at fsu today? Think it’ll be the same? Are we deporting them? Thought the deal was deport “homegrown” criminals now.",
                "They're totally going to end up deporting him to El Salvador. Calling it.",
                "Maybe they’ll try to put a jury together, full of CEOs and executives. I bet they’re terrified of jury nullification.",
                "Jury nullification. Keep repeating it.",
                "I hope his defense team subpoenas shady Mayor Adam's,  Given the slimey way he was arrested and statements made to the media.",
                "If someone smuggles him a MAGA hat and fakes some pro J6 posts written by him, he will guarantee himself a presidential pardon and the support of law-enforcement."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "FSU shooting latest: 2 dead, 6 injured; 20-year-old suspect in custody",
            "external_url": "https://abcnews.go.com/US/active-shooter-reported-florida-state-university-fsu-alert/story?id=120911309",
            "upvotes": 3474,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e3506d3e-63c6-451e-8d02-9562dd438499/fsu-shooting-mo_1744921382783_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The son of a local sheriff's deputy allegedly opened fire near the Student Union at Florida State University in Tallahassee on Thursday, killing two people and injuring six others, authorities said.\n\nThe suspect -- 20-year-old Phoenix Ikner, a current FSU student -- was shot by responders and has been hospitalized, police said. He was taken into custody with non-life-threatening injuries, multiple law enforcement officials told ABC News.\n\nIkner is the son of a current Leon County sheriff's deputy, according to Sheriff Walter McNeil. He had access to one of his mother's personal weapons, which was one of the weapons found at the scene, the sheriff said. It appeared Ikner had a handgun and a shotgun with him, police said.\n\nThe suspect's mother has been a deputy with the department for more than 18 years and \"her service to this community has been exceptional,\" McNeil said.\n\nThe suspect was also a \"long-standing member\" of the Leon County Sheriff's Office's Youth Advisory Council, McNeil said.\n\nHe was \"engaged in a number of training programs that we have,\" the sheriff said, adding, \"Not a surprise to us that he had access to weapons.\"...",
                ">The suspect in the FSU shooting espoused white supremacist views and was removed from a political club, the group's president, Reid Seybold, said.\n\n>Seybold said he was part of a club with the suspect at Tallahassee State College, where they both attended before transferring to FSU. He was president of a club called \"political round table,\" where the suspect was asked not to return after repeated issues with the suspect's rhetoric.\n\n>\"Basically our only rule was no Nazis — colloquially speaking — and he espoused so much white supremacist rhetoric, and far-right rhetoric as well, to the point where we had to exercise that role,\" Seybold said.\n\nhttps://www.nbcnews.com/news/us-news/live-blog/florida-state-university-active-shooter-rcna201756",
                "So will he be called a domestic-terrorist because of his previous statements made towards people of a certain political party?  \n\n  \nSurely they will come down hard on him right?",
                "FSU shooter quoted in January about anti Trump protesters at FSU:  “These people are usually pretty entertaining, usually not for good reasons,” Phoenix Ikner, a political science major, said. “I think it’s a little too late, he’s \\[Trump\\] already going to be inaugurated on Jan. 20 and there’s not really much you can do unless you outright revolt, and I don’t think anyone wants that.” \n\n[https://www.fsunews.com/story/news/2025/01/19/sds-holds-march-down-legacy-walk-to-protest-trumps-agendatallahassee-sds-protests-trump-agenda-and-f/77756710007/](https://www.fsunews.com/story/news/2025/01/19/sds-holds-march-down-legacy-walk-to-protest-trumps-agendatallahassee-sds-protests-trump-agenda-and-f/77756710007/)",
                ">The suspect was also a \"long-standing member\" of the Leon County Sheriff's Office's Youth Advisory Council, McNeil said.\n\nIt seems like Leon County Sheriff's Office's is directly working under the satan's guidance.",
                "Hoping his mother’s failure to secure her personal firearms is scrutinized thoroughly",
                "To El Salvador you go… right?",
                "Well at least the 10 ncaa trans athletes in this country are being kept in check",
                "Yet another white, republican terrorist.",
                "Well at least we're rounding up immigrants to stop this nonsense."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "NEW",
            "title": "Hamas says it is ready to release all remaining hostages for an end to Gaza war",
            "external_url": "https://www.reuters.com/world/middle-east/hamas-is-ready-release-all-remaining-hostages-return-an-end-gaza-war-hamas-gaza-2025-04-17/",
            "upvotes": 4019,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "How many are still alive?",
                "Haven't they said this before, then continued to pile on additional conditions or delayed the release?",
                "I don't see Israel stopping for anything at this point; they've clearly decided that they're going to \"solve\" the Palestinian situation once and for all.",
                "I'll believe it when I see it.",
                "Hamas also needs to disarm.\n\nPalastine needs to form some type of union with the goal of building a nation. If their only goal is to destroy Isreal, they will only get destruction in return.",
                ">Instead, Hayya said Hamas was ready to immediately engage in “comprehensive package negotiations” to release all remaining hostages in its custody in return for an end to the Gaza war, the release of Palestinians jailed by Israel, and the reconstruction of Gaza.\n\nAh, another day, another delusional “offer” from Hamas. Good thing they can count on their Reddit supporters to only read the headlines.",
                "\"Instead, Hayya said Hamas was ready to immediately engage in \"comprehensive package negotiations\" to release all remaining hostages in its custody in return for an end to the Gaza war, the release of Palestinians jailed by Israel, and the reconstruction of Gaza.\"\n\nlol the delusion",
                "Hamas needs to cease to exist for anything to go forward.",
                "Oh yeah. After all of Gaza is in ruins… now they are willing. Perfect negotiating skills right there",
                "Hamas needs to vacate Gaza.  Iran needs to stop funding them and the other state sponsored terrorist groups.  Why would Israel negotiate with terrorists?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Kilmar Abrego Garcia meets with Maryland senator in El Salvador, weeks after mistaken deportation",
            "external_url": "https://www.cbsnews.com/news/maryland-sen-van-hollen-meets-with-mistakenly-deported-kilmar-abrego-garcia-in-el-salvador/",
            "upvotes": 899,
            "date": "04/18/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/18/7c3a9c5a-b900-45da-9527-01a08aea501a/thumbnail/1200x630/416c08752514a8de3edc7683f8bc6445/garcia2.png?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Can we stop calling it \"mistaken deportation\"? This was not a mistake.",
                "Feels like they gave him a hat to cover his shaved head and dressed him up in bright colours to give the perception that he's just hanging out, having a great time. If he's fine and not in a torture prison, just send him home. What do they get out of keeping him there?",
                "I am relieved to hear he is alive. Now he needs to come home.",
                "Finally some good news. It’s not much but it’s *something*.",
                "Nothing \"mistaken\" about this.",
                "He’s not dead? That’s wonderful news!",
                "Bukele's post\n\n[https://x.com/nayibbukele/status/1913035243918864742](https://x.com/nayibbukele/status/1913035243918864742)",
                "“an illegal alien MS-13 terrorist”\n\nLol he really used every buzzword he could think of to try and convince people this wasn’t a mistake",
                "Well at least he is alive I guess",
                "So happy I was wrong about him being dead."
            ],
            "aggregate_sentiment": 70.0
        },
        {
            "category": "RISING",
            "title": "US Senator Van Hollen says he met wrongly deported man in El Salvador",
            "external_url": "https://www.reuters.com/world/americas/us-senator-van-hollen-says-he-met-wrongly-deported-man-el-salvador-2025-04-18/",
            "upvotes": 16289,
            "date": "04/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"I look forward to providing a full update upon my return.\" \n\nAKA\n\nI ain't saying shit until I'm out of El Salvador and they can't keep me here.",
                "This should be a message to all the other Dems in Congress - you can accomplish more than you think by *just trying* - and while this is just the start, it's encouraging to see him alive. We wouldn't have gotten that if this man hadn't said fuck it and put his money where his mouth is. I applaud you, sir.",
                "Van Hollen’s dad was a career state department official and ambassador to Sri Lanka and the Maldives. His mom was the chief of the CIA bureau for South Asia. I would say growing up in a family like that you learn a thing or two and how to handle things like this.",
                "Well I guess I’m eating crow.  I was certain he would be dead",
                "Good on him for showing up. I hope something can be done, for all of our sakes. Garcia deserves due process, like every person does.",
                "Senator Van Hollen is a true patriot and a real American. WELL DONE.",
                "This is the best headline i've seen in a long time,  which is crazy because its not event that great of headline with him still in jail/detained.",
                "Van Hollen is an ACTUAL democratic representative. He did what he was supposed to do for his constituent. Nobody else in congress can say the same.",
                "It's a relief there's proof of life",
                "WELL DONE, SENTATOR VON HOLLEN!\n\nJesus Christ, all this work to confirm a legal resident wasn't murdered by the State. NOT OK."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "A deadly E. coli outbreak hit 15 states, but the FDA chose not to publicize it | NBC News",
            "external_url": "https://www.nbcnews.com/news/us-news/ecoli-bacteria-lettuce-outbreak-rcna200236",
            "upvotes": 3582,
            "date": "04/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250426-e-coli-outbreak-lr-579595.jpg",
            "top_comments": [
                "I got sick with food poisoning (salmonella) and because my state has (or at least had) a robust health department, it was traced to a particular restaurant.\n\nWhether or not the restaurant was negligent, or just had the bad luck of having some food that was spoiled, I have no idea. But the health department folks researched it  traced it. Amazing work. This is work that takes having adequate staffing. \n\nI don't know if this will happen anymore in my state. But I am very appreciative of the staff at the Dept of Health who helped me and told them as much that they were rock stars.",
                "It literally never lists the 15 states in the entire article.",
                "Beginning to sound a lot like Fahrenheit 451, isn't it?",
                "“If we stop testing right now, we’d have very few cases, if any.”",
                "Note this discovery is in conjunction with the US FDA cuts wccording to reuter [https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/](https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/)\n\nHighly concerning to US food safety, and wont make it easier for the US to export their agricultural products overseas.\nEdit: this occured last year supposedly and was never reported, things are likely far worse now",
                "Yes, America is failing its citizens to allow for corporate greed",
                "TLDR: the states (cases per state) are AR (2), CO (1), IL (7), IN (8),KS (1), KY (1), MO (50), MT (1), ND (2), NE (3), OH (8), PA (1), SD (1), TN (1), WI (2)",
                "Chose not to?  Or weren't allowed to?  I seem to remember an executive order or two gagging the CDC a while back.",
                "Probably because DOGE fired the people who normally publicize these things.",
                "**Censorship by omission**"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "U.S.-born man held for ICE under Florida’s new anti-immigration law • Oklahoma Voice",
            "external_url": "https://oklahomavoice.com/2025/04/17/u-s-born-man-held-for-ice-under-floridas-new-anti-immigration-law/",
            "upvotes": 10835,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Yeah. Yesterday I was posting about them going after US citizens and people were all \"well acshually\"... but that was yesterday and today is today.\n\nNo American of any origin, race, or gender should consider themselves safe.",
                "Did we all forget about the Japanese-American concentration camps in the United States?   It happened before.  It can happen again.",
                "First they deport the Illegals.  \n\nThen the undesirables.\n\nThen the Protestors.\n\nThen the dissenters.\n\nThen they will come for you.",
                "> Based on her inspection of his birth certificate and Social Security card, Riggans said she found no probable cause for the charge. However, the state prosecutor insisted the court lacked jurisdiction over Lopez-Gomez’s release because U.S. Immigration and Customs Enforcement had formally asked the jail to hold him.\n\nHe is an American born in Georgia, picked up on spurious charges using a bullshit law, violating his constitutional rights, and ICE simply asked and now they can hold him indefinitely.\n\nThat's a pretty clear violation of Article 4 (Privileges and Immunities). This is bullshit.",
                "The officials who arrested him deserve no “benefit of the doubt” here. He needs to be released immediately, with an apology and an opportunity to pursue a settlement. ICE needs to be defunded. ",
                "On top of this, [Sebastian Gorka, aka the man in charge of creating and executing Trump's domestic terrorism policy, said today that anyone advocating for Abrego Garcia can be charged with aiding and abetting terrorism](https://www.independent.co.uk/news/world/americas/us-politics/sebastian-gorka-kilmar-abrego-garcia-activists-b2735153.html).\n\nOh, and [there's a good chance Martial Law will be declared on Sunday or Monday](https://www.citizen-times.com/story/news/local/2025/04/16/what-is-the-insurrection-act-of-1807-will-trump-declare-martial-law/83121238007/).\n\nThe First Amendment is dead, and speaking out against the regime will get you arrested and disappeared, natural born citizen or no. The United States is now officially a Fascist Dictatorship.",
                "Hey look it’s the thing everyone said he wouldn’t do. Wonder how the Latinos for Trump are feeling right now.",
                "This is profiling. He was born in the United States. He is only being detained because he doesn't speak English.",
                "People keep using the term \"deported\". I don't mean to sound pedantic but it doesn't really do justice to what's happening. \n\nA lot of these \"deportations\" are more akin to human trafficking.",
                "He's just going to deport criminals. Why are you protecting criminals?\n\nWell, actually, anyone who entered illegally is technically a criminal so yes all illegal aliens should be deported. \n\nThat guy was following the legal process and had an open asylum case plus a non-deportation order but this other judge said he's MS-13 so he should be deported. \n\nOK, sure that person had a Green Card and they were here legally but they said mean things about our ally so they should be deported. \n\nInterested to see how the cult will spin this one. How are you gonna move the goalpost this time MAGA?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Impose a pipeline on Indigenous nations? Not so fast, say Indigenous rights lawyers | CBC News",
            "external_url": "https://www.cbc.ca/news/indigenous/leaders-french-debate-indigenous-pipelines-1.7513421?__vfz=medium%3Dsharebar",
            "upvotes": 230,
            "date": "04/18/2025",
            "thumbnail": "https://i.cbc.ca/1.7512471.1744846333!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/fedelxn-debates-20250416.jpg?im=Resize%3D620",
            "top_comments": [
                "*\"You cannot impose. As a leader of the federal government, you have constitutional obligations. It's well developed under Canadian law that you have to respect Indigenous rights.\"*\n\nThis is a critical part of Canadian law, but.... but the manufacturing of consent has happened...  how many times?  And many related to pipelines from the north to parts south and east.",
                "I hate pipelines but also think giving indigenous groups a veto over national infrastructure is ridiculous."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Florida State gunman used deputy mom’s former service weapon to kill 2 and wound 6, authorities say",
            "external_url": "https://apnews.com/article/florida-state-university-shooter-alert-bf66a24ea91959697c7138089b2ef6fb",
            "upvotes": 1660,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*“He has been steeped in the Leon County Sheriff’s Office family, engaged in a number of training programs that we have,” McNeil said. “So it’s not a surprise to us that he had access to weapons.”*\n\nBut I bet a bit of a surprise as to what he did with that access to weapons--or maybe not at all.",
                "Mom should be held culpable.",
                "Hmm ...\n\nGOPers will blame mental health and behave like nothing big or traumatizing has happened, hate to say but gun violence has been normalized by GOP.",
                "WAIT this is the perfect moment. Time to prove you’re deporting the bad Americans",
                "A person that allows another person access to their guns should be prosecuted as an assessory when the weapon is used to commit a crime.",
                "The real story is that he is maga.",
                "Of all the people who should be shipped off to CECOT without trial this guy is of the true worst of the worst. Something tells me he'll get his multi-year due process though.",
                "Republicans trying not to talk shit about the liburhal media challenge: IMPOSSIBLE \n\nhttps://imgur.com/a/VNdo1aq",
                "Well, he's either going to be sent to an El Salvadorian concentration camp, or be made into the next Homeland Security Secretary. Given that he's a white male Republican whose expressed anger towards Democrats, I'll assume the latter.",
                "That articles shows a lot of photos of students hanging around outside during an active shooting. \n\nIf you’re ever anywhere where this is happening, get inside anywhere and lock the door until you get word about an all clear."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Trump administration announces fees on Chinese ships docking at U.S. ports",
            "external_url": "https://www.cnbc.com/2025/04/17/trump-administration-announces-fees-on-chinese-ships-docking-at-us-ports.html",
            "upvotes": 354,
            "date": "04/18/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108132371-1744750747440-gettyimages-2210460440-jr_11302_2mfwszjy.jpeg?v=1744750835&w=1920&h=1080",
            "top_comments": [
                "Wait. So they want to charge a fee where every time a Chinese BUILT ship comes into a US port we tax it? Not even a who owns it fee, but simply where the ship was built even if it’s owned by a US company. \n\nYeah, that’s going to go over well. Where the fuck do we even do commercial shipbuilding anymore? This is just going to make prices go up even more because it’s now a tax on shipping that’s going to be passed on to consumers.",
                "Every second it just gets dumber.  Impeach this guy please. ",
                "Trump’s just mad at China because they were able to build a wall. A Great Wall",
                "He is doing everything he can to tank the US dollar.",
                "I work in this industry. most vessels nowadays are manufactured in China. the USA does not have enough vessels to satisfy their supply needs, this will kill much of the north american shipping industry dead in the water.",
                "USA has become a hostile nation to be avoided in all ways trade and tourism . \n\nThe fallout of this dumbfuckery will last for decades .",
                "This is crazy. No one will want to trade with the US",
                "I am willing to bet all these fees are not going to the ship building industry and into someone else's coffers.",
                "Does anyone in the Whitehouse have a basic understanding of economics or international trade? Are they wanting to start a war with China without any provocation? Is this new tax because Xi won't answer the phone? The USA economy is going to be in ruins before anything is done to stop the madness.",
                "Basically, Trump wants world economy to fail. He will then say or retract the imposed tarrif and such rules to bo claim he saved the economy. Creat a problem to seam like fixing it."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Luigi Mangione indicted on federal charges for CEO killing",
            "external_url": "https://abcnews.go.com/US/luigi-mangione-indicted-federal-charges-ceo-killing/story?id=120928265",
            "upvotes": 7655,
            "date": "04/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/931a7c11-69d1-4946-aa45-634183daf09e/luigi-1-rt-er-250411_1744399799486_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "This is going to be a shitshow.",
                "how fitting today UNH drops 22%",
                "Is it normal for this stuff to be federal in the US?",
                "Any updates from his lawyers they were finally given discovery?? For the longest time his team kept giving PSAs that law enforcement refuses to share discovery. His team should investigate McDonalds and their kiosks with facial recognition, too!",
                "And the 20 year old that murdered 2 and injured 6 at fsu today? Think it’ll be the same? Are we deporting them? Thought the deal was deport “homegrown” criminals now.",
                "They're totally going to end up deporting him to El Salvador. Calling it.",
                "Maybe they’ll try to put a jury together, full of CEOs and executives. I bet they’re terrified of jury nullification.",
                "Jury nullification. Keep repeating it.",
                "I hope his defense team subpoenas shady Mayor Adam's,  Given the slimey way he was arrested and statements made to the media.",
                "If someone smuggles him a MAGA hat and fakes some pro J6 posts written by him, he will guarantee himself a presidential pardon and the support of law-enforcement."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "US FDA suspends food safety quality checks after staff cuts",
            "external_url": "https://www.reuters.com/world/us/us-fda-suspends-food-safety-quality-checks-after-staff-cuts-2025-04-17/",
            "upvotes": 18454,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is going to kill people. \n\nGuaranteed.",
                "“ The program will be suspended at least through September 30 and means the agency will be unable to do planned quality control work around lab testing for the parasite Cyclospora in spinach or the pesticide glyphosate in barley, among other tests, the email says…\n\nThe FDA in early April suspended an effort to improve its testing for bird flu in milk, cheese and pet food, as a result of staff cuts.“",
                "Stuff like that is basically going to made any food created in the US unsellable to any place in the world with a food standard.",
                "Poison themselves to own the libs.",
                "Upton Sinclair is rolling in his grave.",
                "Food safety checks + fluoride + vaccines + deportations = huge decrease of the population in the next years",
                "Oh good I was hoping I would get worms in 2025",
                "Ummm… do republicans not eat food?",
                "Wtf are my taxes even for anymore?",
                "It's almost like they could have watched Brexit unfold, and then UK food exports plummet when they fail EU standards. But that would involve observing reality objectively, a lot to ask for."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "MSU faculty join call for Big Ten 'mutual defense compact' against Trump administration",
            "external_url": "https://statenews.com/article/2025/04/msu-faculty-join-call-for-big-ten-mutual-defense-compact-against-trump-administration",
            "upvotes": 3283,
            "date": "04/17/2025",
            "thumbnail": "https://snworksceo.imgix.net/tsn/7ddde056-78e8-407a-8e1e-6c586c9b4ec9.sized-1000x1000.jpg?w=800&dpr=2&ar=16%3A9&fit=crop&crop=faces",
            "top_comments": [
                "Good. All colleges and universities should stand firm together (except may Liberty University). The legal defense will be the same for all of them.",
                "For those wondering why an athletics conference would care so much, keep in mind that the big ten's members are all highly invested in research, with all being AAU members (except Nebraska, who was a member but lost status).",
                "Just a reminder that while Harvard is getting all the headlines and people are grousing about their endowment, the NIH grant impoundments will affect virtually all universities including those without the resources to challenge the government in court.\n\nMoves like this are great.",
                "United we stand, divided we fall.  We are either all in against tyranny or we are slowly conquered one at a time.",
                "I go to OSU. We fully support this idea",
                "Fucking wild that universities need to form defensive alliances to defend themselves from the president of the united states.",
                "Note this is just the faculty senate and not the administration, ie the employees who wouldn’t interact with governmental officials and not senior leadership who would interact with state and federal officials.",
                "It's got to be the Big Ten because they certainly aren't getting the SEC.",
                "U. of M. graduate here, and I endorse this.",
                "Ashame the U of M already rolled over and showed its bloated belly."
            ],
            "aggregate_sentiment": 12.0
        }
    ],
    "last_updated": "04/18/2025 04:10:57 UTC"
}