{
    "posts": [
        {
            "category": "HOT",
            "title": "NY county clerk refuses to file Texas' fine for doctor accused of prescribing abortion pills",
            "external_url": "https://apnews.com/article/abortion-pills-lawsuit-texas-new-york-carpenter-e97d5c38d9429083d03c2a7b385cbbfd",
            "upvotes": 14246,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And this sets up the fight they're looking for over NY's shield law, as well as whether they can punish someone in another state that engaged in behavior based in and legal in that state.\n\nIf they win that fight it will be a disaster, but particularly for trans health care and abortion in the short term.",
                ">“New York is shredding the Constitution to hide lawbreakers from justice, and it must end,” Paxton said on X. \n\nOh, New York is the one shredding the constitution, is it?",
                "Wait, didn't they try this shit with the fugitive slave act? Wasn't there a war sometime after that?",
                "Ken Paxton is a crook who used his position as Texas AG to evade securities fraud charges. ",
                "Well kudos to this person. Putting your job on the line for your principles is courageous. America is going to need a lot more of this.",
                "Just wait till Texas has a snatch squad or “bounty hunter” grab her and bring to Texas. Sure it would be illegal, but who’s going to stop them these days.? I’m sure a New York judge would issue an order for her to be brought back, which would swiftly be ignored.",
                ">Republican Texas State Attorney General Ken Paxton said he was outraged by the refusal and signaled he would take action.\n\nFunny, you don't seem to mind it when Trump ignores a court ruling.  And the ones he's ignoring are even valid!",
                "Ken Paxton should be in jail.",
                "Good on them, fuck Texas!",
                "That county clerk is a hero."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Judge orders Trump administration to preserve Signal chat on Yemen strikes",
            "external_url": "https://abcnews.go.com/US/judge-holds-hearing-administrations-signal-app/story?id=120229350",
            "upvotes": 7682,
            "date": "03/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e844e726-deae-4aeb-b402-caceb8c47841/pete-hegseth-1-ht-gmh-250325_1742909596131_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Serious question, WTF is going to happen if they don't? I mean, they've already broken the law, disobeyed the Scotus... And... No repercussions.",
                "Jeffrey Goldberg has the chat in case the admin, er, \"loses\" it.",
                "Already deleted.\n\nI'll eat my own ass on camera if I'm wrong.",
                "This will go over well",
                "They might want to think about going with their usual approach of deleting everything and lying.  I'm pretty sure a certain editor in chief will be very happy to share the complete chat with anyone who asks.  Then again, it apparently never occurred to them that if they lied about it he might drop the receipts, so I guess we'll see what happens.",
                "The only thing that can stop Trump is congress. And the current one is complicit. \n\nSo, if you want to establish a working system of checks and balances again then do not vote for the republican congressman that is supposed to be serving your district/state. They no longer work for you.",
                "Honestly I’m more afraid of what other things they’ve discussed/are still discussing in Signal that can’t be requested by FOIA.",
                "Official communications by US Government employees is already REQUIRED to be preserved. Which is why WE DONT USE FUCKING SIGNAL IN THE FIRST PLACE. \n\nIn the immortal words of Jim Carrey, STOP BREAKING THE LAW, ASSHOLES!!!",
                "but judge, we set the chat to self-delete....",
                "They're not going to do it, and it will be yet another flagrant violation of the judicial authority. Consternation will be had by people who could do something about it. Add it to the flaming pile."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Exclusive: FDA staff struggle to meet product review deadlines after DOGE layoffs",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/fda-staff-struggle-meet-product-review-deadlines-after-doge-layoffs-2025-03-27/",
            "upvotes": 5660,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This isn't a bug, it's a feature.\n\n1. Fire all the staff so they can't get their reviews and approvals done in a timely manner.  \n2. Publicly complain that the FDA approvals are taking too long and regulations are too onerous.  \n3. Remove regulations.",
                "3500 FDA employees will be laid off. This is in addition to those already let go",
                "Going back to when America was great and milk producers put formaldehyde in milk to extend the shelf life. Before the FDA all we could do was to plead with the companies to please stop killing kids.\n\nhttps://www.smithsonianmag.com/science-nature/19th-century-fight-bacteria-ridden-milk-embalming-fluid-180970473/",
                "I am a medical device auditor.  I can remember a time when a [483](https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/inspection-references/fda-form-483-frequently-asked-questions) was something to be feared by corporate executives.  Defending companies from the FDA was a career path. Now, it's barely even heard of.\n\nThe FDA was barely surviving as it was.  They were a good organization that [helped a lot of people](https://www.fda.gov/about-fda/fda-history-exhibits/frances-oldham-kelsey-medical-reviewer-famous-averting-public-health-tragedy).  But medical devices and especially pharmaceuticals went the way of Boeing back in [2017](https://en.wikipedia.org/wiki/Executive_Order_13771).  With his [newest deregulation efforts](https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-launches-massive-10-to-1-deregulation-initiative/#:~:text=In%20his%20first%20term%2C%20President,for%20everyone%20new%20regulation%20issued.), it really is gone.  This is just another nail in the coffin.  Hopefully we can rebuild someday.",
                "1. Break government\n\n2. Claim government doesn't work\n\n3. Abandon regulatory agencies, privatize program administration.\n\nEnjoy Russia-West.",
                "Think about it this way......\n\nA health inspector isn't necessarily efficient for a business. But we need them to maintain food safety. It's not fraud, it's not a Kabal of deep state food molesters. It's a necessary protection. \n\nBut if everything is looked at through the lens of business and not country. Well, the health inspector can be made to look \"fraudulent\".",
                "I work at a medical device manufacturer and the documentation and safety guidelines are all targeted at FDA requirements. Audits at the facility are a huge deal, and any pushback on following process gets over ridden because the consequences of a failed audit are not worth the risk. I don't think most companies are going to backslide on purpose but when the watchdog isn't there it becomes much much easier.",
                "The plan to Make America Shittier is working.",
                "Get ready for more food borne illness!",
                "I really hate republicans."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Measles case confirmed in person who rode Amtrak train to Washington, D.C., health officials say",
            "external_url": "https://www.cbsnews.com/news/measles-case-confirmed-dc-amtrak-passenger-train-union-station-health-officials/",
            "upvotes": 3819,
            "date": "03/27/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2021/07/14/23986ecc-2f39-4b9f-b257-396da71421b8/thumbnail/1200x630/f3dc1c1d2ba998f1aaafabd7333f28cb/GettyImages-1232126765.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Sure glad that I got a simple injection when I was a child that protects me from getting it",
                "For context, the average person with covid will infect about 3 people.\n\n\nThe average person with measles will infect 12.  It is wildly infectious, and it can kill kids.\n\n\nThere is a reason we worked so hard to get rid of it.",
                "Dude, just drink cod liver oil until you turn yellow and your liver quits",
                "Non responder.\nWe all have neighbors that are non responders to vaccinations.\nThat’s another part of the population that is at risk when people don’t vaccinate.\nPlease vaccinate to protect all of us.",
                "We still have health officials?",
                "It would be poetic justice if RFK Jr gets it.",
                "Even though I got my vax as a kid, I am TERRIFIED of catching it. It's, what, a 3% chance of getting it? However, with how it basically resets your immune system, it'd easily kill me. I'm chronically ill with multiple autoimmune disorders, I'm going full lock down if it's spotted in AZ",
                ">Before becoming contagious, the individual with measles had flown from Minnesota into Reagan National Airport, a spokesperson for the D.C. Health Department told CBS News. Neither the identity nor a description of the individual has been released, but the spokesperson said they were vaccinated against measles.\n\nWell that's scary in multiple ways.  Vaccination isn't 100% and immunity can fade with time, which is why a bunch of anti-vaxxers deciding they're going to make their arrogance everyone else's problem is such a bad scenario.",
                "RFK says vitamins fix that. So free vitamins for everyone",
                "Every state needs to just ban people from texas"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Yale professor who studies fascism fleeing US to work in Canada",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/26/yale-professor-fascism-canada?CMP=Share_AndroidApp_Other",
            "upvotes": 44549,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4ca5fca8e505ad4e446eed6c79a9a958f0d89e2f/0_72_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1b62264f6b12cd17697d55043a02c080",
            "top_comments": [
                "\"Out here, nobody knows where I am, and I’m believed to be away on a trip. Here are brewing economically and politically dark times, so I’m happy to be able to get away from everything.\" \n\n-Einstein hiding in Northern Germany in 1922, eleven years before he renounced his German citizenship following Hitlers rise to chancellor.",
                "The vast majority of U.S. residents cannot leave. They either lack the resources or no one would be willing to take them on due to factors such as age, education, and others reasons. Protected is our freedom to travel, and essentially to leave has been our right. However, with a passport costing $250 and roughly 60% of Americans being a single paycheck away from homelessness, the majority have no freedom to travel or leave.  Trickle-down only worked for billionaires. The middle class has been significantly eroded over the past few decades. We are now stuck with our makings.",
                "A poignant quote from the article:  \"Social media posts spread on Wednesday, noting the alarm sounded by a scholar of fascism leaving the country over its political climate. Nikole Hannah-Jones, the journalist and creator of the 1619 Project,[wrote](https://bsky.app/profile/nhannahjones.bsky.social/post/3llakwvszts2c) on the social media platform Bluesky: “When scholars of authoritarianism and fascism leave US universities because of the deteriorating political situation here, we should really worry.”",
                "He'll be back when he has to do his fieldwork.",
                "I use his video to teach my G10 students about fascism (I teach history at an American school in Taipei, Taiwan). The Trump Administration has ticked just about every single box he listed. \n\nHere's the video if you haven't seen it: https://youtu.be/CpCKkWMbmXU?si=NaQGVkXHwpxsENZE",
                "If only there had been a literal decade of warnings for people to pay attention to…",
                "\"Those who do not learn from history are doomed to repeat it\"\n\nThis is simply an example of the inverse being true.",
                "Professor here at a large American university that has been named as one of the 60 targets of the administration for whatever bullshit they don't like. Most of us cannot leave. Many of us are staying and fighting in whatever ways we can. They may come for all of us who are politically outspoken eventually. While Stanley is doing what is best for him, I am proud of my colleagues staying and resisting right now. Still, I am really, really scared -- especially for our international students and colleagues.",
                "Fleeing from Germany to France vibes.",
                "We're hostages tied to a chair while children with loaded guns are running around.  I hate it here"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "A DHS staffer faces serious punishment for accidentally adding a reporter to a group email",
            "external_url": "https://www.nbcnews.com/politics/national-security/dhs-staffer-faces-serious-punishment-accidentally-adding-reporter-grou-rcna198233",
            "upvotes": 4580,
            "date": "03/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-11/241105-dhs-seal-wc-1420-227213.jpg",
            "top_comments": [
                "\"But unlike Waltz and Hegseth, who both remain in their jobs, the career DHS employee was put on administrative leave and told late last week that the agency intends to revoke her security clearance, the officials said. \"\n\nThis is what happens to low level staff and the email was not even classified. Go figure.",
                "If somenpne in uniform had done what hegseth and the rest did, they'd be in jail.",
                "You can’t make this shit up.",
                ".... what about the jerks in charge who were breaking the law by using Signal in the first place?",
                "I see they found a female, non-partisan, career, low-level employee to throw under their wildly swerving bus. Fucking pieces of shit.",
                "If Republicans didn't have double standards, then they wouldn't have any standards at all.",
                "\"Different spanks for different ranks.\"",
                "So they are going with the blame the coffee boy again..\n\n  \nRepublicans can never own their own mistakes they are the party of \"the other guy did it\"..",
                "Did she consider lying through her teeth to keep her job? Seems to work just fine.",
                "\"We will hold you to standards that we will not hold our leaders to\""
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Amazon Is Canceling a Major Alexa Privacy Feature on March 28: Should You Worry?",
            "external_url": "https://www.cnet.com/home/security/amazon-is-canceling-this-alexa-privacy-feature-on-march-28-should-you-worry/",
            "upvotes": 1873,
            "date": "03/28/2025",
            "thumbnail": "https://www.cnet.com/a/img/resize/e96a94cc497a0c79571c56582862da7657342872/hub/2025/03/20/5d2afd3b-c532-43c5-9f58-f6447aaeebba/gettyimages-1279899369.jpg?auto=webp&fit=crop&height=675&width=1200",
            "top_comments": [
                "Almost amazing how the service industry has become more about consumers servicing companies than companies serving customers.",
                "From the article: \n\"As Amazon readies the huge AI upgrade to Alexa called Alexa Plus, the retail juggernaut has revealed a disturbing change in its privacy policies. Beginning on March 28th, users of Echo smart speakers and Echo Show displays won't be able to block their devices from sending all voice recordings to Amazon for analysis.\n\n\nKeeping voice recordings local is an important privacy feature for any voice assistant, and removing it raises serious questions about what Amazon is listening to. And even if you didn't know about these privacy settings before, I bet you're worried about voice assistant privacy in general: Our CNET Survey found over 70% of people have privacy concerns about adding more AI to home voice assistants -- and now we're seeing those fears in action.\"",
                "*Starting March 28, Amazon will be removing the \"Do not send voice recordings\" option, which means all recorded voice commands will be automatically sent to Amazon for processing and analysis.*\n\nThis is utterly outrageous.  And should be absolutely illegal.",
                "Does it not somehow manage to run afoul of any anti-wire tapping laws? Seems like it would. \n\nGuests in your home did not sign the agreement for both party consent states. \n\nOr would it only be the device owner in trouble and not Amazon?",
                "I use mine to turn on a couple of lights and for alarms. I guess I'll need to find another solution. It now makes zero sense to invest in anyone's ecosphere. You get everything setup, it does what you want, they change the terms of service, and it no longer does what you want.",
                "I'm worried shitless, constantly, every single day. This changes nothing.",
                "I don’t trust Siri or Alexa. ",
                "I’m not worried. Every time Alexa would come on when it heard its name on my television and tried to communicate, I shut her down. Now Alexa lives in a drawer in my closet with a charging cable wrapped around her neck.",
                "That cunt and her friend hey Google are never allowed in my house.",
                "No. Because I didn't let Alexa in my house to begin with. Fuck bezos. "
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "'Chaos': UAW Local 600 reacts to Cleveland-Cliffs Dearborn Works layoffs",
            "external_url": "https://www.wxyz.com/news/chaos-uaw-local-600-reacts-to-cleveland-cliffs-dearborn-works-layoffs",
            "upvotes": 943,
            "date": "03/28/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/c8a3bdc/2147483647/strip/true/crop/1274x669+0+21/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fb2%2F29%2F74c399b04509815752607f4e9afd%2Fscreenshot-2025-03-26-at-6-02-46-pm.png",
            "top_comments": [
                "Well, employees can thank their UAW leadership who was literally praising Trump’s tariffs yesterday",
                "Lmao at least that trans boogeyman can’t play sports",
                "Enjoy your Golden Age. You voted for this.",
                "Didn’t they vote for this?",
                "Dumbshits voted for this.",
                "I did a documentary about the folks of dearborn and they're quite right wing, so they too can suck it.",
                "Isn't this what UAW rooted for?",
                "Will *Shawn fucking Fain* stop gloating about and\npraising Trump now? My jaw was on the floor when he put out a statement recently (like within the last week!) thanking Trump for “ending the era of NAFTA”. Fuck. That. ",
                "Leopards eating faces say what…..",
                "I feel like this is just the beginning… Just sad, really. Why did people vote for this individual? Now your livelihood is in jeopardy"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "US honeybee deaths hit record high as scientists scramble to find main cause",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/25/honeybees-deaths-record-high",
            "upvotes": 30514,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ddbb4889fe4a8b0686f7bdaf1b74cc7a365ba0df/0_200_3000_1799/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2e9dd540a3f847f4f714379735a3b6bf",
            "top_comments": [
                "Stop using weed killer. It's toxic to them and destroys their main food sources.",
                "Half of America thinking climate change and environmental science is woke might have something to do with it.",
                "Well there’s the whole saturate the country in pesticides and glyphosate to start…",
                "> Commercial beekeepers have reported losing more than 60% of their colonies, on average, over the winter, according to an ongoing Project Apis m. survey that covers more than two-thirds of America’s managed bees.\n\nThe average winter loss used to be 10-20% until colony collapse began. They pollinate half our crops. This should freak everyone out.",
                "neonicitinoids by agra biotech firms for crop pesticides- banned elsewhere, not in usa.",
                "Nothing will change without strict regulations on pesticides. It's not just agriculture sterilizing the countryside. Any idiot with a credit card can buy a barrel of poison and sterilize not just their yard but everything downwind and downstream of it for miles. \n\nWe thought we fixed everything by banning DDT, but that first Silent Spring was just the beginning. We're about to lose even more birds and wildlife in our world as insect populations continue to collapse.",
                "It's us. \"Us\" is the main cause",
                "We live in the city, we have a nice backyard garden, we don't use any pesticides, weed killers, bottled nutrients, etc for approximately 14 years. The bees have made a home here. Every year when they swarm its seems another groups attempts to set up camp here. I do believe they can tell when you don't use harmful chemicals around your property",
                "Scientists aren't scrambling to find the main cause, the people just don't like the answer.",
                "People dousing their lawns in chemicals every year to kill dandelions which are one of the earliest sources of food in the spring for honey bees. All for the vanity lawn."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Republican controlled Congress removes funding for protecting California coast",
            "external_url": "https://www.sfgate.com/bayarea/article/california-coastal-bluff-funding-20242812.php",
            "upvotes": 5393,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Every day there's less and less reason to pay federal taxes. \n\n  \nThe state needs to wake up and give us the option to divert the funds to them to actually provide the services being stolen from us.",
                "Seems to me like Congress isn't really thinking of America's best interests how long until we can't call ourselves the United States if we literally don't unite on everything and or anything?",
                "If Democrats get back into power, I fully support ceasing federal funds to red states. I mean, that’s the game now right?",
                "Ok so California should stop paying federal taxes.",
                "Imagine being in an elected position charged with protecting, serving, and benefiting our country and deciding to do dumb shit like this day in and day out.\n\nThese people are incompetent in the best case scenarios... Everyone in our country should be demanding these people's heads at this point.  The damage they're doing is immeasurable.",
                "Nobody is more effectively antiAmerican than the GOP",
                "And California needs to protect the coast to avoid \"Trump CaliBeach Blast costal lenght Resort and Casino\"",
                "Shit like this is why I think we will live to see secessionist movements sprout up and grow. \n\nIn fascist America blue states are nothing but slushfunds and whipping boy societies for our rural red apartheid overlords. \n\nThe west coast and New England made America wealthy and influential. Now jealous spiteful backwater and flyover states want to punish us relentlessly for tolerating LGBTQ people and being sane and secular. \n\nEventually the question will be why the fuck are we still in this union? We get nothing but grief from it. The president they assign to lord over us just wants to hurt and insult us. Our tax dollars go out to them but we get nothing but insane policy and punishment.\n\nWhen the cost of existing in this union exceeds the benefit by such an enormous amount people will start looking for the door. Fighting for freedom is often preferable to suffering forever.",
                "Time for Cali to become independent and create a new government, something like a Republic, call it the \"New California Republic\", yeah, sounds nice, NCR for short.",
                "To give some context for folks from other countries:\n\nOrange County California has a population of \\~3,186,000 and size of 792.8 square miles (2,051 sq kilometers)\n\nThe state of Montana has a population of about 1,132,800 and size of 147,040 square miles (380,800 sq kilometers)  \n\n\nIt could be its own state."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Earthquake hit Myanmar, trap plenty pipo for Thailand - BBC News Pidgin",
            "external_url": "https://www.bbc.com/pidgin/articles/c1kjkmye440o.amp",
            "upvotes": 4,
            "date": "03/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_pidgin/6a94/live/e2b92d80-0bb8-11f0-ba12-8d27eb561761.png",
            "top_comments": [
                "Sad. 43 construction workers in that one building"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "EC spokesperson: EU closely following the situation in Serbia",
            "external_url": "https://n1info.rs/english/news/ec-spokesperson-eu-closely-following-the-situation-in-serbia/",
            "upvotes": 23,
            "date": "03/28/2025",
            "thumbnail": "https://n1info.rs/wp-content/uploads/2025/03/27/1743101779-zastave.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Strong 7.7-magnitude earthquake strikes Myanmar, with tremors felt in neighbouring Thailand",
            "external_url": "https://www.theguardian.com/world/2025/mar/28/myanmar-earthquake-thailand-magnitude-thailand-tremors-bangkok",
            "upvotes": 294,
            "date": "03/28/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/719c4a4f8feea472a4490cf018a6742aec6a537b/0_0_5245_3147/master/5245.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c0a3567dc7fdda54252a051579f1707b",
            "top_comments": [
                "I am burmese and I am pretty sure 3 happened in 30 minutes, the earthquakes happened in the centre, I live in Yangon which is about 350 miles away and it still shook very hard here, Sagaing Bridge which is a very long bridge collapsed, also in the centre, the 2nd most populous city in the country mandalay, there were so many buildings collapsed.",
                "This is really bad, the infrastructure won’t be up to a quake that big. It’ll be a few days before we’ll see the effects of this. Another brutal blow for Myanmar.",
                "Got evacuated in Bangkok and at least one construction building collapsed. It won’t be nice to read about casualties and more destruction in Myanmar :(",
                "I just hope the damage is not too big and people are safe.\n\n\nI don't know the building codes in Myanmar and Thailand but I hope that they account for such strong earthquakes.",
                "can someone explain why, although the earthquake centre is in Myanmar, why every time it's mentioned Bangkok is the main focal point and only one being talked about?\n\nIs Myanmar pretty closed off?",
                "[removed]",
                "This looks really bad, [USGS](https://earthquake.usgs.gov/earthquakes/eventpage/us7000pn9s/pager) is painting a really grim picture on potential casualties. Epicenter is right next to the second largest city in Myanmar. The people there has already gone through way too much in recent years.",
                "I felt the earthquake in Yangon and it wasn't as bad as what happened in Mandalay.Entire buildings collapsed,roadway destroyed ,and power lines fell.Many are still trapped in the ruble.It seems the earthquake originated at the center of Myanmar according to our local news sources.",
                "The footage of the high rise under construction collapsing in Bangkok is crazy, and that was \"Light Shaking\" from this quake according to USGS.",
                "Have a friend there and no one can contact him"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "A pig’s head and decapitated rats: a new era of intimidation dawns for journalists in Indonesia",
            "external_url": "https://www.theguardian.com/world/2025/mar/28/intimidation-journalists-indonesia-pig-heads-rats",
            "upvotes": 95,
            "date": "03/28/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/32d624d8b06a59746f5674ce5c7a0e6447dc9e1a/0_119_5000_3002/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0dbc10b73eda83f6ed1ee24804a69bf3",
            "top_comments": [
                "You will see that start in the USA",
                "Honesty I’m almost impressed someone found a pig’s head in the most populous Muslim country on earth, that takes some dedication"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Federal agents try detaining healthcare contractor at DC public elementary school",
            "external_url": "https://wjla.com/news/local/federal-agents-dc-elemntary-school-homeland-security-hsi-cooke-dcps-immigration-enforcement-action-healthcare-contractor-student-faculty-safety-protest-resources-tools-support?fbclid=IwZXh0bgNhZW0CMTEAAR3QaTS3flLirFY6KpeS3I0wMmRlwpWr0glpTMKH6wjNtpS3nYRWLhFAFQs_aem_J7kkE8Cvwo9brWgbdN0BBA",
            "upvotes": 297,
            "date": "03/28/2025",
            "thumbnail": "https://wjla.com/resources/media2/16x9/751/986/0x62/90/93159f21-9e2d-4d9a-868a-fe2d34c8fece-HSIatschool.jpg",
            "top_comments": [
                "Covering their faces should be illegal. Law enforcement should never be anonymous. If it is, they're not enforcing the law.",
                "So they didn’t have warrants?",
                "It's interesting that the enforcers wear masks, but their bosses don't. Makes me wonder if there would be fewer enforcers if they were unmasked somehow. Or if we'd just make them proudly unmask because that's how not-sees eventually adapt to scorn.",
                "Anyone else wondering when someone is gonna go half cocked and shoot an ICE agent?",
                "Eventually we will see the same situation as in V for Vendetta play out. People will arm and protect themselves against kidnappers who refuse to identify themselves. Since there is no way to distinguish between officials and gang members in this context and human trafficking is a real thing, expect to see a lot of self defense and shootouts. The administration wants this outcome explicitly so they can be be even more violent.",
                "Just training the parents and the students for OMON raids.",
                "Did they just keep the door locked?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Man arrested in Las Vegas Tesla arson facing federal charges",
            "external_url": "https://abcnews.go.com/US/man-arrested-after-setting-teslas-fire-las-vegas/story?id=120220369",
            "upvotes": 549,
            "date": "03/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5856050-9297-4c9c-9319-b15cf7789567/tesla-damage-suspect-ht-jt-250327_1743108280909_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "… why? Arson isnt federal…",
                "All cars matter!\n\nBest thing i ever got from reddit. And I hope it catches on. This whole thing is absurd.",
                "Violently attacking our nation's capitol to overthrow an election = \"freedom fighters\"\n\nSetting fire to a few cars that already have a [rep for self-immolation](https://www.nbcnews.com/business/business-news/tesla-car-battery-fire-needed-6000-gallons-water-to-extinguish-rcna68153) = \"dangerous terrorists\" \n\nRepublicans believe it's important to set standards; either double or very *very* low",
                "So when are you going to arrest all the people on Epstein's list? You're not? What a surprise!",
                "Trump sold the richest man in the world our federal gov't to be used as his personal police force. The level of cronyism and corruption is staggering.",
                "If you look at the conservative subreddit, the only posts up are about Tesla vandalism. It's the only thing they are allowed to talk about in America right now 🤐",
                "[removed]",
                "Insane that we've gotten to the point where people are justifying dangerous acts of terrorism due to political reasons. This country is fucked",
                "I hate people with molotov cocktails. They always make everything worse.",
                "I hope he has a great lawyer. You can't terrorize an inanimate object."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "'Chaos': UAW Local 600 reacts to Cleveland-Cliffs Dearborn Works layoffs",
            "external_url": "https://www.wxyz.com/news/chaos-uaw-local-600-reacts-to-cleveland-cliffs-dearborn-works-layoffs",
            "upvotes": 950,
            "date": "03/28/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/c8a3bdc/2147483647/strip/true/crop/1274x669+0+21/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fb2%2F29%2F74c399b04509815752607f4e9afd%2Fscreenshot-2025-03-26-at-6-02-46-pm.png",
            "top_comments": [
                "Well, employees can thank their UAW leadership who was literally praising Trump’s tariffs yesterday",
                "Lmao at least that trans boogeyman can’t play sports",
                "Enjoy your Golden Age. You voted for this.",
                "Didn’t they vote for this?",
                "Dumbshits voted for this.",
                "I did a documentary about the folks of dearborn and they're quite right wing, so they too can suck it.",
                "Isn't this what UAW rooted for?",
                "Will *Shawn fucking Fain* stop gloating about and\npraising Trump now? My jaw was on the floor when he put out a statement recently (like within the last week!) thanking Trump for “ending the era of NAFTA”. Fuck. That. ",
                "Leopards eating faces say what…..",
                "I feel like this is just the beginning… Just sad, really. Why did people vote for this individual? Now your livelihood is in jeopardy"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "The ‘world’s most famous amphibian’ will deliver commencement speech at the University of Maryland",
            "external_url": "https://www.cnn.com/2025/03/27/us/kermit-the-frog-commencement-speaker-maryland/index.html?Date=20250328&Profile=cnn&utm_content=1743127500&utm_medium=social&utm_source=instagram",
            "upvotes": 509,
            "date": "03/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap96051901017.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "For a split second I was like \"... Mark Zuckerberg?\"",
                "He could give the most serious speech ever and it would still be funny to watch",
                "He's been doing better for himself after he got out of that abusive relationship with Miss Piggy and got his new girlfriend.\n\nThough i am sure Miss Piggy got half.",
                "\"It's not easy being green, but at least I'm not orange.\"",
                "Wait, it's not the Geiko mascot?",
                "Meanwhile, decades ago, I got an old man telling me we’ll be in rocking chairs in no time and our time will come in the end.",
                "What world or timeline do we live in where a puppet of all things delivers a commencement speech for achieving academic education? \n\nEspecially from one that had a failed relationship that ended in 2015.",
                "At least this puppet has morals and a kind heart.\n\n\n\n\n… ie  trump is a Russian puppet if I wasn’t clear 😂. … and I’m not American but I assumed people of that status perform these commencement things",
                "Mr Toad's wild speech?",
                "“I’m Mr Frog. This is my show. I eat the bug.” is what I’m hoping he says"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Amazon Is Canceling a Major Alexa Privacy Feature on March 28: Should You Worry?",
            "external_url": "https://www.cnet.com/home/security/amazon-is-canceling-this-alexa-privacy-feature-on-march-28-should-you-worry/",
            "upvotes": 1875,
            "date": "03/28/2025",
            "thumbnail": "https://www.cnet.com/a/img/resize/e96a94cc497a0c79571c56582862da7657342872/hub/2025/03/20/5d2afd3b-c532-43c5-9f58-f6447aaeebba/gettyimages-1279899369.jpg?auto=webp&fit=crop&height=675&width=1200",
            "top_comments": [
                "Almost amazing how the service industry has become more about consumers servicing companies than companies serving customers.",
                "From the article: \n\"As Amazon readies the huge AI upgrade to Alexa called Alexa Plus, the retail juggernaut has revealed a disturbing change in its privacy policies. Beginning on March 28th, users of Echo smart speakers and Echo Show displays won't be able to block their devices from sending all voice recordings to Amazon for analysis.\n\n\nKeeping voice recordings local is an important privacy feature for any voice assistant, and removing it raises serious questions about what Amazon is listening to. And even if you didn't know about these privacy settings before, I bet you're worried about voice assistant privacy in general: Our CNET Survey found over 70% of people have privacy concerns about adding more AI to home voice assistants -- and now we're seeing those fears in action.\"",
                "*Starting March 28, Amazon will be removing the \"Do not send voice recordings\" option, which means all recorded voice commands will be automatically sent to Amazon for processing and analysis.*\n\nThis is utterly outrageous.  And should be absolutely illegal.",
                "Does it not somehow manage to run afoul of any anti-wire tapping laws? Seems like it would. \n\nGuests in your home did not sign the agreement for both party consent states. \n\nOr would it only be the device owner in trouble and not Amazon?",
                "I use mine to turn on a couple of lights and for alarms. I guess I'll need to find another solution. It now makes zero sense to invest in anyone's ecosphere. You get everything setup, it does what you want, they change the terms of service, and it no longer does what you want.",
                "I'm worried shitless, constantly, every single day. This changes nothing.",
                "I don’t trust Siri or Alexa. ",
                "I’m not worried. Every time Alexa would come on when it heard its name on my television and tried to communicate, I shut her down. Now Alexa lives in a drawer in my closet with a charging cable wrapped around her neck.",
                "That cunt and her friend hey Google are never allowed in my house.",
                "No. Because I didn't let Alexa in my house to begin with. Fuck bezos. "
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "NEW",
            "title": "Stellantis offers buyouts to UAW employees at more than 20 sites in Detroit and Toledo",
            "external_url": "https://www.freep.com/story/money/cars/chrysler/2025/03/20/stellantis-buyouts-detroit-toledo-mopar/82580225007/",
            "upvotes": 295,
            "date": "03/27/2025",
            "thumbnail": "https://www.freep.com/gcdn/authoring/authoring-images/2024/02/13/PDTF/72588836007-img-stellantis-011921-03-1.JPG?crop=2399,1350,x0,y240&width=2399&height=1350&format=pjpg&auto=webp",
            "top_comments": [
                "Those tariffs are really helping to bring back jobs apparently...",
                "When only rich people can afford to buy cars there will be a lot more layoffs and less buyouts. That's what Trump's tariffs will do.",
                "Just a reminder that Sean O'Brien helped elect Trump.",
                "*\"Stellantis continues to review its operations to improve efficiency and protect its competitiveness in a very dynamic market\".*\n\n\"very dynamic market\"=a disruptive market within which capitalism can't function--efficiently or at all. (courtesy of current Admin.)",
                "But MAGA folks keep telling me Stellantis is going to open more plants thanks to Trump. Now I'm confused. /s",
                "Stellantis was already in trouble before this.\n\nPrivate equity running a company into the ground.  Then craters when market conditions turn foul",
                "Grab your ankles union boys.  You get what you voted for.",
                "America, the new Cuba with most everyone driving \"vintage\" cars for the foreseeable future.",
                "Wait, I thought the UAW was going after Tesla to unionize.",
                "All the car production has been shifting to Mexico."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Federal agents try detaining healthcare contractor at DC public elementary school",
            "external_url": "https://wjla.com/news/local/federal-agents-dc-elemntary-school-homeland-security-hsi-cooke-dcps-immigration-enforcement-action-healthcare-contractor-student-faculty-safety-protest-resources-tools-support?fbclid=IwZXh0bgNhZW0CMTEAAR3QaTS3flLirFY6KpeS3I0wMmRlwpWr0glpTMKH6wjNtpS3nYRWLhFAFQs_aem_J7kkE8Cvwo9brWgbdN0BBA",
            "upvotes": 301,
            "date": "03/28/2025",
            "thumbnail": "https://wjla.com/resources/media2/16x9/751/986/0x62/90/93159f21-9e2d-4d9a-868a-fe2d34c8fece-HSIatschool.jpg",
            "top_comments": [
                "Covering their faces should be illegal. Law enforcement should never be anonymous. If it is, they're not enforcing the law.",
                "So they didn’t have warrants?",
                "It's interesting that the enforcers wear masks, but their bosses don't. Makes me wonder if there would be fewer enforcers if they were unmasked somehow. Or if we'd just make them proudly unmask because that's how not-sees eventually adapt to scorn.",
                "Anyone else wondering when someone is gonna go half cocked and shoot an ICE agent?",
                "Eventually we will see the same situation as in V for Vendetta play out. People will arm and protect themselves against kidnappers who refuse to identify themselves. Since there is no way to distinguish between officials and gang members in this context and human trafficking is a real thing, expect to see a lot of self defense and shootouts. The administration wants this outcome explicitly so they can be be even more violent.",
                "Just training the parents and the students for OMON raids.",
                "Did they just keep the door locked?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Strong 7.7-magnitude earthquake strikes Myanmar, with tremors felt in neighbouring Thailand",
            "external_url": "https://www.theguardian.com/world/2025/mar/28/myanmar-earthquake-thailand-magnitude-thailand-tremors-bangkok",
            "upvotes": 291,
            "date": "03/28/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/719c4a4f8feea472a4490cf018a6742aec6a537b/0_0_5245_3147/master/5245.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c0a3567dc7fdda54252a051579f1707b",
            "top_comments": [
                "I am burmese and I am pretty sure 3 happened in 30 minutes, the earthquakes happened in the centre, I live in Yangon which is about 350 miles away and it still shook very hard here, Sagaing Bridge which is a very long bridge collapsed, also in the centre, the 2nd most populous city in the country mandalay, there were so many buildings collapsed.",
                "This is really bad, the infrastructure won’t be up to a quake that big. It’ll be a few days before we’ll see the effects of this. Another brutal blow for Myanmar.",
                "Got evacuated in Bangkok and at least one construction building collapsed. It won’t be nice to read about casualties and more destruction in Myanmar :(",
                "I just hope the damage is not too big and people are safe.\n\n\nI don't know the building codes in Myanmar and Thailand but I hope that they account for such strong earthquakes.",
                "can someone explain why, although the earthquake centre is in Myanmar, why every time it's mentioned Bangkok is the main focal point and only one being talked about?\n\nIs Myanmar pretty closed off?",
                "[removed]",
                "This looks really bad, [USGS](https://earthquake.usgs.gov/earthquakes/eventpage/us7000pn9s/pager) is painting a really grim picture on potential casualties. Epicenter is right next to the second largest city in Myanmar. The people there has already gone through way too much in recent years.",
                "I felt the earthquake in Yangon and it wasn't as bad as what happened in Mandalay.Entire buildings collapsed,roadway destroyed ,and power lines fell.Many are still trapped in the ruble.It seems the earthquake originated at the center of Myanmar according to our local news sources.",
                "The footage of the high rise under construction collapsing in Bangkok is crazy, and that was \"Light Shaking\" from this quake according to USGS.",
                "Have a friend there and no one can contact him"
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "RISING",
            "title": "The ‘world’s most famous amphibian’ will deliver commencement speech at the University of Maryland",
            "external_url": "https://www.cnn.com/2025/03/27/us/kermit-the-frog-commencement-speaker-maryland/index.html?Date=20250328&Profile=cnn&utm_content=1743127500&utm_medium=social&utm_source=instagram",
            "upvotes": 514,
            "date": "03/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap96051901017.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "For a split second I was like \"... Mark Zuckerberg?\"",
                "He could give the most serious speech ever and it would still be funny to watch",
                "He's been doing better for himself after he got out of that abusive relationship with Miss Piggy and got his new girlfriend.\n\nThough i am sure Miss Piggy got half.",
                "\"It's not easy being green, but at least I'm not orange.\"",
                "Wait, it's not the Geiko mascot?",
                "Meanwhile, decades ago, I got an old man telling me we’ll be in rocking chairs in no time and our time will come in the end.",
                "What world or timeline do we live in where a puppet of all things delivers a commencement speech for achieving academic education? \n\nEspecially from one that had a failed relationship that ended in 2015.",
                "At least this puppet has morals and a kind heart.\n\n\n\n\n… ie  trump is a Russian puppet if I wasn’t clear 😂. … and I’m not American but I assumed people of that status perform these commencement things",
                "Mr Toad's wild speech?",
                "“I’m Mr Frog. This is my show. I eat the bug.” is what I’m hoping he says"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "'Chaos': UAW Local 600 reacts to Cleveland-Cliffs Dearborn Works layoffs",
            "external_url": "https://www.wxyz.com/news/chaos-uaw-local-600-reacts-to-cleveland-cliffs-dearborn-works-layoffs",
            "upvotes": 940,
            "date": "03/28/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/c8a3bdc/2147483647/strip/true/crop/1274x669+0+21/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fb2%2F29%2F74c399b04509815752607f4e9afd%2Fscreenshot-2025-03-26-at-6-02-46-pm.png",
            "top_comments": [
                "Well, employees can thank their UAW leadership who was literally praising Trump’s tariffs yesterday",
                "Lmao at least that trans boogeyman can’t play sports",
                "Enjoy your Golden Age. You voted for this.",
                "Didn’t they vote for this?",
                "Dumbshits voted for this.",
                "I did a documentary about the folks of dearborn and they're quite right wing, so they too can suck it.",
                "Isn't this what UAW rooted for?",
                "Will *Shawn fucking Fain* stop gloating about and\npraising Trump now? My jaw was on the floor when he put out a statement recently (like within the last week!) thanking Trump for “ending the era of NAFTA”. Fuck. That. ",
                "Leopards eating faces say what…..",
                "I feel like this is just the beginning… Just sad, really. Why did people vote for this individual? Now your livelihood is in jeopardy"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Man arrested in Las Vegas Tesla arson facing federal charges",
            "external_url": "https://abcnews.go.com/US/man-arrested-after-setting-teslas-fire-las-vegas/story?id=120220369",
            "upvotes": 547,
            "date": "03/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5856050-9297-4c9c-9319-b15cf7789567/tesla-damage-suspect-ht-jt-250327_1743108280909_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "… why? Arson isnt federal…",
                "All cars matter!\n\nBest thing i ever got from reddit. And I hope it catches on. This whole thing is absurd.",
                "Violently attacking our nation's capitol to overthrow an election = \"freedom fighters\"\n\nSetting fire to a few cars that already have a [rep for self-immolation](https://www.nbcnews.com/business/business-news/tesla-car-battery-fire-needed-6000-gallons-water-to-extinguish-rcna68153) = \"dangerous terrorists\" \n\nRepublicans believe it's important to set standards; either double or very *very* low",
                "So when are you going to arrest all the people on Epstein's list? You're not? What a surprise!",
                "Trump sold the richest man in the world our federal gov't to be used as his personal police force. The level of cronyism and corruption is staggering.",
                "If you look at the conservative subreddit, the only posts up are about Tesla vandalism. It's the only thing they are allowed to talk about in America right now 🤐",
                "[removed]",
                "Insane that we've gotten to the point where people are justifying dangerous acts of terrorism due to political reasons. This country is fucked",
                "I hate people with molotov cocktails. They always make everything worse.",
                "I hope he has a great lawyer. You can't terrorize an inanimate object."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Amazon Is Canceling a Major Alexa Privacy Feature on March 28: Should You Worry?",
            "external_url": "https://www.cnet.com/home/security/amazon-is-canceling-this-alexa-privacy-feature-on-march-28-should-you-worry/",
            "upvotes": 1875,
            "date": "03/28/2025",
            "thumbnail": "https://www.cnet.com/a/img/resize/e96a94cc497a0c79571c56582862da7657342872/hub/2025/03/20/5d2afd3b-c532-43c5-9f58-f6447aaeebba/gettyimages-1279899369.jpg?auto=webp&fit=crop&height=675&width=1200",
            "top_comments": [
                "Almost amazing how the service industry has become more about consumers servicing companies than companies serving customers.",
                "From the article: \n\"As Amazon readies the huge AI upgrade to Alexa called Alexa Plus, the retail juggernaut has revealed a disturbing change in its privacy policies. Beginning on March 28th, users of Echo smart speakers and Echo Show displays won't be able to block their devices from sending all voice recordings to Amazon for analysis.\n\n\nKeeping voice recordings local is an important privacy feature for any voice assistant, and removing it raises serious questions about what Amazon is listening to. And even if you didn't know about these privacy settings before, I bet you're worried about voice assistant privacy in general: Our CNET Survey found over 70% of people have privacy concerns about adding more AI to home voice assistants -- and now we're seeing those fears in action.\"",
                "*Starting March 28, Amazon will be removing the \"Do not send voice recordings\" option, which means all recorded voice commands will be automatically sent to Amazon for processing and analysis.*\n\nThis is utterly outrageous.  And should be absolutely illegal.",
                "Does it not somehow manage to run afoul of any anti-wire tapping laws? Seems like it would. \n\nGuests in your home did not sign the agreement for both party consent states. \n\nOr would it only be the device owner in trouble and not Amazon?",
                "I use mine to turn on a couple of lights and for alarms. I guess I'll need to find another solution. It now makes zero sense to invest in anyone's ecosphere. You get everything setup, it does what you want, they change the terms of service, and it no longer does what you want.",
                "I'm worried shitless, constantly, every single day. This changes nothing.",
                "I don’t trust Siri or Alexa. ",
                "I’m not worried. Every time Alexa would come on when it heard its name on my television and tried to communicate, I shut her down. Now Alexa lives in a drawer in my closet with a charging cable wrapped around her neck.",
                "That cunt and her friend hey Google are never allowed in my house.",
                "No. Because I didn't let Alexa in my house to begin with. Fuck bezos. "
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "NY county clerk refuses to file Texas' fine for doctor accused of prescribing abortion pills",
            "external_url": "https://apnews.com/article/abortion-pills-lawsuit-texas-new-york-carpenter-e97d5c38d9429083d03c2a7b385cbbfd",
            "upvotes": 14233,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And this sets up the fight they're looking for over NY's shield law, as well as whether they can punish someone in another state that engaged in behavior based in and legal in that state.\n\nIf they win that fight it will be a disaster, but particularly for trans health care and abortion in the short term.",
                ">“New York is shredding the Constitution to hide lawbreakers from justice, and it must end,” Paxton said on X. \n\nOh, New York is the one shredding the constitution, is it?",
                "Wait, didn't they try this shit with the fugitive slave act? Wasn't there a war sometime after that?",
                "Ken Paxton is a crook who used his position as Texas AG to evade securities fraud charges. ",
                "Well kudos to this person. Putting your job on the line for your principles is courageous. America is going to need a lot more of this.",
                "Just wait till Texas has a snatch squad or “bounty hunter” grab her and bring to Texas. Sure it would be illegal, but who’s going to stop them these days.? I’m sure a New York judge would issue an order for her to be brought back, which would swiftly be ignored.",
                ">Republican Texas State Attorney General Ken Paxton said he was outraged by the refusal and signaled he would take action.\n\nFunny, you don't seem to mind it when Trump ignores a court ruling.  And the ones he's ignoring are even valid!",
                "Ken Paxton should be in jail.",
                "Good on them, fuck Texas!",
                "That county clerk is a hero."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Judge orders Trump administration to preserve Signal chat on Yemen strikes",
            "external_url": "https://abcnews.go.com/US/judge-holds-hearing-administrations-signal-app/story?id=120229350",
            "upvotes": 7682,
            "date": "03/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/e844e726-deae-4aeb-b402-caceb8c47841/pete-hegseth-1-ht-gmh-250325_1742909596131_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Serious question, WTF is going to happen if they don't? I mean, they've already broken the law, disobeyed the Scotus... And... No repercussions.",
                "Jeffrey Goldberg has the chat in case the admin, er, \"loses\" it.",
                "Already deleted.\n\nI'll eat my own ass on camera if I'm wrong.",
                "This will go over well",
                "They might want to think about going with their usual approach of deleting everything and lying.  I'm pretty sure a certain editor in chief will be very happy to share the complete chat with anyone who asks.  Then again, it apparently never occurred to them that if they lied about it he might drop the receipts, so I guess we'll see what happens.",
                "The only thing that can stop Trump is congress. And the current one is complicit. \n\nSo, if you want to establish a working system of checks and balances again then do not vote for the republican congressman that is supposed to be serving your district/state. They no longer work for you.",
                "Honestly I’m more afraid of what other things they’ve discussed/are still discussing in Signal that can’t be requested by FOIA.",
                "Official communications by US Government employees is already REQUIRED to be preserved. Which is why WE DONT USE FUCKING SIGNAL IN THE FIRST PLACE. \n\nIn the immortal words of Jim Carrey, STOP BREAKING THE LAW, ASSHOLES!!!",
                "but judge, we set the chat to self-delete....",
                "They're not going to do it, and it will be yet another flagrant violation of the judicial authority. Consternation will be had by people who could do something about it. Add it to the flaming pile."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Exclusive: FDA staff struggle to meet product review deadlines after DOGE layoffs",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/fda-staff-struggle-meet-product-review-deadlines-after-doge-layoffs-2025-03-27/",
            "upvotes": 5662,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This isn't a bug, it's a feature.\n\n1. Fire all the staff so they can't get their reviews and approvals done in a timely manner.  \n2. Publicly complain that the FDA approvals are taking too long and regulations are too onerous.  \n3. Remove regulations.",
                "3500 FDA employees will be laid off. This is in addition to those already let go",
                "Going back to when America was great and milk producers put formaldehyde in milk to extend the shelf life. Before the FDA all we could do was to plead with the companies to please stop killing kids.\n\nhttps://www.smithsonianmag.com/science-nature/19th-century-fight-bacteria-ridden-milk-embalming-fluid-180970473/",
                "I am a medical device auditor.  I can remember a time when a [483](https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/inspection-references/fda-form-483-frequently-asked-questions) was something to be feared by corporate executives.  Defending companies from the FDA was a career path. Now, it's barely even heard of.\n\nThe FDA was barely surviving as it was.  They were a good organization that [helped a lot of people](https://www.fda.gov/about-fda/fda-history-exhibits/frances-oldham-kelsey-medical-reviewer-famous-averting-public-health-tragedy).  But medical devices and especially pharmaceuticals went the way of Boeing back in [2017](https://en.wikipedia.org/wiki/Executive_Order_13771).  With his [newest deregulation efforts](https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-launches-massive-10-to-1-deregulation-initiative/#:~:text=In%20his%20first%20term%2C%20President,for%20everyone%20new%20regulation%20issued.), it really is gone.  This is just another nail in the coffin.  Hopefully we can rebuild someday.",
                "1. Break government\n\n2. Claim government doesn't work\n\n3. Abandon regulatory agencies, privatize program administration.\n\nEnjoy Russia-West.",
                "Think about it this way......\n\nA health inspector isn't necessarily efficient for a business. But we need them to maintain food safety. It's not fraud, it's not a Kabal of deep state food molesters. It's a necessary protection. \n\nBut if everything is looked at through the lens of business and not country. Well, the health inspector can be made to look \"fraudulent\".",
                "I work at a medical device manufacturer and the documentation and safety guidelines are all targeted at FDA requirements. Audits at the facility are a huge deal, and any pushback on following process gets over ridden because the consequences of a failed audit are not worth the risk. I don't think most companies are going to backslide on purpose but when the watchdog isn't there it becomes much much easier.",
                "The plan to Make America Shittier is working.",
                "Get ready for more food borne illness!",
                "I really hate republicans."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Measles case confirmed in person who rode Amtrak train to Washington, D.C., health officials say",
            "external_url": "https://www.cbsnews.com/news/measles-case-confirmed-dc-amtrak-passenger-train-union-station-health-officials/",
            "upvotes": 3833,
            "date": "03/27/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2021/07/14/23986ecc-2f39-4b9f-b257-396da71421b8/thumbnail/1200x630/f3dc1c1d2ba998f1aaafabd7333f28cb/GettyImages-1232126765.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Sure glad that I got a simple injection when I was a child that protects me from getting it",
                "For context, the average person with covid will infect about 3 people.\n\n\nThe average person with measles will infect 12.  It is wildly infectious, and it can kill kids.\n\n\nThere is a reason we worked so hard to get rid of it.",
                "Dude, just drink cod liver oil until you turn yellow and your liver quits",
                "Non responder.\nWe all have neighbors that are non responders to vaccinations.\nThat’s another part of the population that is at risk when people don’t vaccinate.\nPlease vaccinate to protect all of us.",
                "We still have health officials?",
                "It would be poetic justice if RFK Jr gets it.",
                "Even though I got my vax as a kid, I am TERRIFIED of catching it. It's, what, a 3% chance of getting it? However, with how it basically resets your immune system, it'd easily kill me. I'm chronically ill with multiple autoimmune disorders, I'm going full lock down if it's spotted in AZ",
                ">Before becoming contagious, the individual with measles had flown from Minnesota into Reagan National Airport, a spokesperson for the D.C. Health Department told CBS News. Neither the identity nor a description of the individual has been released, but the spokesperson said they were vaccinated against measles.\n\nWell that's scary in multiple ways.  Vaccination isn't 100% and immunity can fade with time, which is why a bunch of anti-vaxxers deciding they're going to make their arrogance everyone else's problem is such a bad scenario.",
                "RFK says vitamins fix that. So free vitamins for everyone",
                "Every state needs to just ban people from texas"
            ],
            "aggregate_sentiment": 62.0
        }
    ],
    "last_updated": "03/28/2025 12:15:17 UTC"
}