{
    "posts": [
        {
            "category": "HOT",
            "title": "US IRS chief to quit over deal to share data with immigration officials, report says",
            "external_url": "https://www.reuters.com/world/us/us-irs-chief-quit-over-deal-share-data-with-immigration-officials-report-says-2025-04-08/",
            "upvotes": 3216,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Illegal attempts to access IRS data was an article of impeachment against Nixon ",
                "Remember when trump sued the irs to prevent them from sharing his tax returns with congress and it took years and went all the way to the Supreme Court?",
                "Don't worry. Her position will be filled by a DOGE high schooler ASAP.",
                "Why would the IRS have data on illegal immigrants, MAGA? I thought illegal immigrants didn't pay taxes, MAGA? If they're paying taxes, why do they need to go, MAGA?",
                "Is this legal? Oh wait, nvm.",
                "Wait, illegal immigrants don't contribute anything. How does the IRS have their data? - some maga guy probably",
                "We just keep losing more and more talent due to this administration’s actions. I’m no fan of paying taxes. And the IIRS certainly needs some work. But we can’t function this way.",
                "The more of these people quit, the more open positions they can put anyone into. At the same time, I totally get quitting. You’re not about to make me do something absolutely batshit crazy.",
                "That's the sort of thing you don't *quit* over. Stick around, drag it out, and make it their problem!",
                "No worries, they’ll just keep on putting in someone who doesn’t care about the rule of law. Not that hard to find. Kudos to this third person who quit over this very concerning weaponization of tax information.\n\nWhy should your ordinary citizen submit anything to the IRS, if the IRS is now showing it’s not private? Because what this means is that the IRS will now provide your personal information (and nobody knows that more than the IRS), to whatever authority asks for it.\n\nThe only reason this voluntary tax disclosure of very private information to the IRS has lasted as long as it had is because people have trusted that this info will be used by the IRS for tax purposes only, not to be given out freely to ICE or whoever says they need it for unprecedented purposes."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "'Time for you to abandon the United States': Asylum seekers who used app being told to leave",
            "external_url": "https://www.cbc.ca/news/world/us-migration-app-removals-1.7504556",
            "upvotes": 3985,
            "date": "04/08/2025",
            "thumbnail": "https://i.cbc.ca/1.7504565.1744118021!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/trump-immigration.jpg?im=Resize%3D620",
            "top_comments": [
                "I was told by someone that I was making a “big deal” over the Mass Deportations Now signs at his rallies.",
                "The asylum seeker issue is proof that Republicans do not actually support legal immigration. They think that being an \"illegal immigrant\" is an innate quality, closely tied to your ethnicity and the color of your skin, not simply the lack of immigration paperwork.\n\nSeeking asylum in the US is legal. You may disagree with the law, but these people were following the law. They are not illegal immigrants. They are legal immigrants following a process that you don't like. The same was true of the Haitian immigrants that JD Vance made up those disgusting lies about. It has always been racism and xenophobia.",
                "... US abandons refugees. Abdicates global leadership. Shoots self in face with tariff cannon. Genius. ",
                ">Time for you to abandon the United States\n\nGood advice for everyone, honestly.",
                "\"Time for you to abandon the United States\" -- Now, there's a piece of advice I can get behind. I'd only apply it to literally everyone in the world rather than only people with a skin color that isn't white.",
                "1883: \"Give me your tired, your poor,\nYour huddled masses yearning to breathe free.\"\n\n2025: Screw you.",
                "And Trump is going \"those losers from insane asylums are being told to go...\"",
                "900,000 is an astounding number of people being asked to leave the country.",
                " Soon we will be the asylum seekers lul",
                "Trying to make a better life and end up in fucking El Salvador."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Brussels police arrest US State Secretary Rubio's bodyguard",
            "external_url": "https://www.brusselstimes.com/brussels/1526014/brussels-police-arrest-us-state-secretary-rubios-bodyguard-tbtb",
            "upvotes": 21795,
            "date": "04/08/2025",
            "thumbnail": "https://api.brusselstimes.com/wp-content/uploads/2025/04/ad995448-belgaimage-116320348-1024x683.jpg",
            "top_comments": [
                ">Two sources with direct knowledge of the situation told the Washington Examiner that the agent in question was \"behaving erratically\" and \"became irate\" when hotel staff refused to reopen the bar beyond its normal hours, the US media reports.\n\nAnd here I thought it was going to be about some professional disagreement that got out of hand.",
                "These guys are so used to getting away with breaking the law in the USA.\n\nThey take that mindset and ego to other places in the world and get arrested. \n\nGlad there is still integrity elsewhere.",
                "Needed some liquor at 3:00 a.m. just to live with himself.",
                "The party of “law and order” strikes again.",
                "“I have diplomatic immunity!”\n\n>It’s just been revoked.",
                "Violence. Rape. Alcohol. Child Porn. Tinder. Greed. Threats. Abuse. \n\nThe party of Christianity needs to stop “protecting the world from the evil libs” and start looking at what they are supporting.",
                "These cavemen have a lot of trouble hearing the word NO.",
                "Wait I thought Pete Hegseth ran the Pentagon not a security detail???",
                "Since he's not a resident they should ship him to El Salvador",
                "Was this a \"merit\" hire? Because this shit show of administration keeps showing they aren't hiring the best people in the slightest."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "US Justice Dept disbands crypto enforcement team, citing Trump order",
            "external_url": "https://www.reuters.com/world/us/us-justice-dept-disbands-cryptocurrency-enforcement-unit-2025-04-08/",
            "upvotes": 10892,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Can't have people looking into crypto scams when the President and his family are the ones running the crypto scams.",
                "I'm guessing the SBF pardon will be coming on Friday at around 7 PM.",
                "What is the point of congress anymore? Trump seems to have the power to do everything himself.",
                "He certainly likes dismantling consumer protection agencies.",
                "It's things like this that will cause the Great Depression to repeat.\n\nThe SEC was created to regulate stock to ensure people didn't do stupid things to buy overpriced stock.\n\nInstead, we're going to have people spending their life savings on meme coins, only to have it get magically wiped out.\n\nCombine that with tariffs and the inevitable ecological disasters that won't be properly responded to... and you have the Great Depression.",
                "New trump shitcoin launching in 3… 2…",
                "\"US Justice Department disbands fraud enforcement team, citing Trump order\".",
                "Trump can't have his grifting being investigated.",
                "How long before Trump EOs the entire Treasury into crypto?",
                "You're safe to assume all crypto is a scam. \n\nIt's funny to me that the same people who want to bring back sweatshop manufacturing also push crypto."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Chinese soldiers captured fighting alongside Russians in Ukraine, says Zelenskyy",
            "external_url": "https://www.abc.net.au/news/2025-04-08/zelenskyy-claims-army-has-captured-chinese-soldiers-in-ukraine/105153948?utm_source=abc_news_app&utm_medium=content_shared&utm_campaign=abc_news_app&utm_content=other",
            "upvotes": 21704,
            "date": "04/08/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/34cd7307c49584a150f2bad7aae83273?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=200&width=862&height=485&imformat=generic",
            "top_comments": [
                "There have been Chinese mercenaries in Ukraine since the start of the war, that’s nothing new. I even saw a PLA veteran filming and doing some sort of video blog on his Chinese social media account.",
                "It’s Chinese mercs enlisting to the Russian army. Not actual Chinese soldiers",
                "so it's like, soldiers born in china, not *chinese soldiers*. that's important.",
                "Big difference between capturing Chinese citizens and capturing Chinese soldiers.\n\nAs stated (several paragraphs deep) in the article, citizens from all over the world have gallavanted off to Ukraine to fight.\n\nShame on ABC for that headline.",
                "It's nothing new,several russian PMCs and military units have been hiring chinese mercenaries since the beginning of the war,some have even fought in the [Pyatnashka Brigade](https://en.wikipedia.org/wiki/Pyatnashka_Brigade)",
                "I mean there have been fighters from many nations on both sides for a while now",
                "It is illegal to desert your post in the army in all countries pretty much. Chinese citizens not soldiers obviously.",
                "Regardless of the nature of the situation, this announcement is clearly a ploy to appeal to the US, given they’ve announced that China is the only foe they care about.",
                "Brits and americans are fighting at Ukrainian side..",
                "Article feels a bit racist, saying how it’s embarrassing for China if these mercenaries. How about all the mercenaries of other nationalities??"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Keystone Pipeline ruptures in North Dakota",
            "external_url": "https://apnews.com/article/keystone-oil-pipeline-north-dakota-spill-36e86142566763a5464e1dd132eede56",
            "upvotes": 2978,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sounds like the worker who shut it down quickly should get a raise, could have been way worse.",
                "*“I don’t think it’s going to be that huge,” Suess said.*\n\nThat line is too tired to be true.",
                "I wonder who could have seen this coming.  Like.....who could've known?  Why weren't there protests over this risk?",
                "Oh wait, wait. They promised us it would NEVR leak. What's up with that.",
                "Is this the pipeline that for four years, MAGA folks claimed  Biden shut down, causing a rise in gas prices?  Of course it was actually a future expansion project that he stopped, but they never let facts get in the way. Drill baby drill!",
                "FEMA is on their way with their best people right? ",
                "> In December 2022, nearly 13,000 barrels of oil spilled from Keystone’s line in Kansas into a creek traversing a pasture. An engineering consulting firm said the bend in the pipeline at the site had been “overstressed” since being installed in 2010, likely because of construction activity altering the land around the pipe.\n\nRepublican response: Let's roll back regulations even further so that this can happen more often, yay!",
                "Thankfully, the EPA's 2 remaining staff will be onsite in a few months.",
                "Whoa, remind me again why the expansion of the XL pipeline was shut down? Oh this exact reason?",
                "Near north Dakotas only natural waterfall. Shame"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Keystone Pipeline ruptures near Fort Ransom",
            "external_url": "https://www.kvrr.com/2025/04/08/keystone-pipeline-ruptures-near-fort-ransom/",
            "upvotes": 4302,
            "date": "04/08/2025",
            "thumbnail": "https://wpcdn.us-midwest-1.vip.tn-cloud.net/www.kvrr.com/content/uploads/2018/06/KEYSTONE-STILL-jpg.jpg",
            "top_comments": [
                "Literally nobody could have seen this coming /s",
                "Good thing that Republicans are okay with oil pollution, this area couldn't be more Red.",
                "This is from a story in 2012\n\n\"Even after causing more than a dozen spills in 2011 from its newest tar sands pipeline — including a six story “geyser” of crude — Canadian energy developer TransCanada claimed its planned Keystone XL pipeline would “exceed” safety standards.\n\nBut according to a new investigation of TransCanada’s development plans, the company does not plan to use advanced spill prevention technologies on a section of pipeline that would cross an underground reservoir providing nearly 30 percent of America’s irrigation water.\n\nInsideClimate Newsreported this week that TransCanada would only use standard leak detection technologies across a 19-mile stretch of the pristine Ogallala Aquifer, making bigger leaks more likely.\"\n\n  \nWe were told these pipelines were leakproof which led to the idea it doesnt need monitoring. Remember when gigantic corporations say \"Regulations are killing their buisness\" theyre saying spending money on technology to prevent problems lowers profits.",
                "Funny how the oil disasters always happens right after the price of oil goes below $60.",
                "Shutdown in two minutes is the only good thing about this.",
                "They must’ve used the same kind of glue that Tesla used to attach the body panels to the cyber truck",
                "Wow, exactly the thing protesters were saying was going to happen fucking happened",
                "Shocking how much the Keystone pipeline and it's surrounding terrain looks like the Trans-Alaska Pipeline",
                "So, I worked the Natural Gas pipeline for a while, and know a bit about hiw these things are supposed to be protected. I know a specialist will be brought in to determine the cause of the rupture, and I'd be very curious about the results. \n\nFor the record, 11 years isn't really enough time for any rust to drill through that steel, and the coating is supposed to last 40 years. I've seen badly applied stuff that started to fail after 10 years. My money's on welding failure.",
                "It's not \"if\" a pipeline will leak, it's \"when.\" Americans don't care about the \"when\" as long as it's not in their backyard."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Musk's DOGE using AI to snoop on U.S. federal workers, sources say",
            "external_url": "https://www.reuters.com/technology/artificial-intelligence/musks-doge-using-ai-snoop-us-federal-workers-sources-say-2025-04-08/",
            "upvotes": 6869,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Big Brother is watching.\n\nIsn't this exactly the kind of thing that conservatives worried about? The government monitoring you?\n\nWhat do trump supporters have to say about this? My guess is they will deny it or say if you're not doing anything wrong why worry about it.",
                "I think it goes, or at least is going to go, far beyond federal workers.\n\nhttps://www.upi.com/Voices/2025/03/06/DOGE-government-data-danger/2551741269965/",
                "This is **not** your standard company snooping to check you’re at your desk!\n\n> Trump administration officials have told some U.S. government employees that Elon Musk’s DOGE team of technologists is using artificial intelligence to **surveil at least one federal agency’s communications for hostility to President Donald Trump and his agenda**, said two people with knowledge of the matter.\n\n> At the Environmental Protection Agency, for instance, some EPA managers were told by Trump appointees that Musk’s team is **rolling out AI to monitor workers, including looking for language in communications considered hostile to Trump or Musk**, the two people said.\n\nSummary:\n\n> - DOGE uses AI to monitor communications for anti-Trump sentiment, sources say\n> - DOGE’s use of Signal app raises data security and transparency concerns\n> - Musk’s DOGE team accused of bypassing vetting processes, operating in secrecy\n\nYes, ‘sources say’. This is Reuters, I can guarantee they’ve vetted those sources.",
                "I hear Signal is now an approved messaging app for discussing special plans. Maybe federal workers could look into a Signal chat group to escape DOGE's Big Brother.",
                "Very normal events happening in a very normal country.",
                "Realistically, Trump+Musk now easily have access to the tools to dox every poster here.",
                "Someday soon grok is going to reveal itself as a mole and blow this whole thing wide open",
                "Seems like an easy win in a wrongful termination lawsuit since federal employees can't be discriminated against based on beliefs. \n\nThese guys are so dumb actually making this policy. It's the most un-American stuff ever.\n\nCan you imagine Harris doing this to conservatives? It's all the stuff they accused the democrats of doing but way worse. Remember, \"liberal hive mind\"? These Maga morons are all about projection.",
                "Musk is so pathetic. I've never seen a billionaire fail in nearly every aspect of life.",
                "How much is too fucking far??\n\nGoogle fucking docs for government work...\n\nMore delete-after Signal shit...\n\n“Be careful what you say, what you type and what you do,”\n\nWhat's next, thought crimes?\n\nRemember when Obama wore a tan suit??\n\nFucking christ, every single fucking day, day after day after day after day - more fucking batshit crazy looney tunes shit.\n\nGovernment loaded with cowards and on-the-take yes-men. Not enough good ones to stand up and put an end to all this shit. God fucking cursed America, if you believe in that sort of thing.\n\nFor perspective, as bad as this is, remember we're actively funding a full-scale genocide on top of all this other horseshit.\n\nNoah get the boat."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "Ontario's measles outbreak is so big, even New York health officials are taking notice",
            "external_url": "https://www.cbc.ca/news/canada/toronto/new-york-state-department-of-health-measles-travel-advisory-ontario-1.7504085",
            "upvotes": 2654,
            "date": "04/08/2025",
            "thumbnail": "https://i.cbc.ca/1.5343106.1708113693!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/measles-virus.jpg?im=Resize%3D620",
            "top_comments": [
                "This outbreak in southwestern Ontario, like the Texas outbreak, is concentrated in a very conservative group of Mennonites. It's been ongoing since October.",
                "Im going to guess that most of them are unvaccinated",
                "\"Measles can be a serious disease,' N.Y. official says\"\n\n\nWe carry computers in our pockets. Information has never been easier to access and verify.\n\n\nDumb mother fuckers always seem to find a way.",
                "Disease doesn't care about borders",
                "The fact that Ontario’s measles outbreak has drawn concern from New York health officials highlights just how interconnected our public health systems truly are. Measles is a preventable disease, and its resurgence points to dangerous gaps in vaccination coverage and public trust. This isn’t just a local issue — it’s a cross-border wake-up call for stronger immunization strategies and coordinated public health responses.",
                "Clearly vaccines need to be actually required.  Weird religious sects shouldn’t be able to opt out of them.",
                "Can we just isolate them, send them supplies/medicine and let them ask god to deal with it?",
                "Hey!!! We here in the US have the market cornered on stupid, Canada!! Don’t try and steal our thunder!!",
                "We are all inter-connected.  \n\nAbolishing vaccines aid to other poor countries would affect Americans as well.",
                "I think it goes to show you how many people are actually on unvaccinated"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Tariffs on China set to rise to at least 104% on Wednesday, White House says",
            "external_url": "https://edition.cnn.com/2025/04/08/business/trump-china-tariff/index.html",
            "upvotes": 2929,
            "date": "04/08/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25098577604664.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "we’re at “ban all direct trade with China” territory now",
                "Is this thread going to stay up? This has been posted a few times and keeps getting deleted. Let me ask this one more time: \n\nWhy is there no actual plan from the White House to actually spur new factories in the US? Why is the CHIP Act being dismantled? Where is the effort to actually do anything other than random tariff announcements that feel like they are being shot from the hip? If they were serious, there would be something like the CHIP act for all kinds of on-shoring manufacturing opportunities. They also need to address the US steel industry, rare earth metals (not by invading Greenland, lol), and so many other things.",
                "This is the end of my career and industry.  It's now more cost effective for us to abandon product in china than it is to import it and distribute at a massive loss.\n\nWe're all probably going to lose our jobs.",
                "* October 2024 - [Trump’s Tariffs Could Push S&P 500 Down 10% Next Year, UBS Says](https://www.forbes.com/sites/dereksaul/2024/10/10/trumps-tariffs-could-push-sp-500-down-10-next-year-ubs-says/)\n* September 2024 - [These 5 parts of the stock market are most at risk if Trump wins the election and implements wide-reaching tariffs, Barclays says](https://markets.businessinsider.com/news/stocks/trump-tariff-trade-policy-stock-market-outlook-risk-election-china-2024-9) \n* May 2024 - [Trump’s new trade war would cost middle-class families at least $1,700 a year, report warns](https://www.cnn.com/2024/05/21/business/trump-trade-war-tariffs-china/index.html)\n* December 2023 - [Tariffs Are for Losers](https://www.wsj.com/opinion/tariffs-are-for-losers-global-economy-protectionism-trade-jake-sullivan-hawley-585c4175)\n* September 2023 - [Pence trashes Trump’s tax plan, says 10% tariff would ‘increase inflation at the worst possible time’](https://www.cnbc.com/2023/09/21/pence-trashes-trump-tax-plan-says-tariffs-would-worsen-inflation.html)",
                "The fallout from this will be felt decades from now.",
                "Mr Trump and the Republicans are hell bent of crashing the economy, increasing the prices of everything exponentially, and making the life of the working class Americans worse. Sad.",
                "Those MAGA hats and tshirts are going to be expensive.",
                "By mid-may the layoffs will be hitting if movement doesn't occur by then. At this point best to save as much as you can since it will be hard to say he will be effected directly, or by knock on effects as consumers cut back.",
                "Trump has to make everybody his enemy before he negotiates. He is a child.",
                "Is America winning yet?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Central Tibetan Administration Holds Press Conference to Address Suspicious Death of Tulku Hungkar Dorje",
            "external_url": "https://tibet.net/central-tibetan-administration-holds-press-conference-to-address-suspicious-death-of-tulku-hungkar-dorje/",
            "upvotes": 24,
            "date": "04/08/2025",
            "thumbnail": "https://tibet.net/wp-content/uploads/2025/04/DSC_5920.jpg",
            "top_comments": [
                "The CCP is toxic for China and the rest of the world.\n\nHarvard International Review\n\n[](https://hir.harvard.edu/mountains-of-resistance-the-past-and-present-of-tibets-quest-for-independence/)\n\n# [Mountains of Resistance: The Past and Present of Tibet's Quest for ...](https://hir.harvard.edu/mountains-of-resistance-the-past-and-present-of-tibets-quest-for-independence/)\n\nNov 6, 2024**A leader in exile. Children forced into cultural assimilation. A barrage of failed protests. For more than 50 years, China, a global superpower with a population over 400 times that of Tibet, has occupied this small region. Since 1950, Tibet and China have lived in an uneasy balance. However,**"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Rise in asylum seekers crossing into Quebec as U.S. revokes status of thousands of migrants | CBC News",
            "external_url": "https://www.cbc.ca/news/canada/montreal/rise-asylum-seekers-quebec-1.7505027?__vfz=medium%3Dsharebar",
            "upvotes": 106,
            "date": "04/08/2025",
            "thumbnail": "https://i.cbc.ca/1.7470147.1740675995!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/quebec-border-crossing-to-receive-100-m-makeover-to-improve-traffic-flow-security-image-1.jpg?im=Resize%3D620",
            "top_comments": [
                "Better get the USA to spend a billion dollars on border control.",
                "I can smell the taxpayer dollars burning from here",
                "Build a wall, Canada. America will pay for it with your tariffs.",
                "Canada: there's no crisis at our southern border!",
                "As a Canadian-Quebecer... we don't want them here. \n\nWe already have a BIG problem with immigration, it should not be our concern what happens to them south of the border, especially with the actual economic turmoil.\n\nI do hope that our next government is tough on this, but no candidate show anything related to that.",
                "*The rise in asylum claims drew reaction on the federal campaign trail Tuesday, with Liberal Leader Mark Carney saying it's not acceptable that people leave the U.S. to claim asylum in Canada. That position is in stark contrast to that of his predecessor, Justin Trudeau.*\n\nI'm sure this position is in response to the pressure T is bringing on with his lets-make-a-deal tariffs. Very similar to the arm-twisting of the NYC mayor.",
                "All of our crisis’s going brrrr",
                "PSA: Canadian cats and dogs will be fine"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Near-collision investigation reveals Reagan National Airport controllers failed to stop flights during military flyover",
            "external_url": "https://www.cnn.com/2025/04/08/politics/reagan-national-airport-near-collision-investigation-military-flyover/index.html",
            "upvotes": 32,
            "date": "04/08/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2197594739.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "White House Must Allow The Associated Press Full Access to Trump, Judge Rules",
            "external_url": "https://www.nytimes.com/2025/04/08/us/politics/trump-ap-oval-office-access.html?unlocked_article_code=1.-E4.2tYW.dCYLg2tPldXB&smid=url-share",
            "upvotes": 341,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "SCOTUS injunction in 3... 2... 1...",
                "And we know how well this administration abides to judgements.",
                "“Under the First Amendment, if the government opens its doors to some journalists — be it to the Oval Office, the East Room, or elsewhere — it cannot then shut those doors to other journalists because of their viewpoints,” he wrote. “The Constitution requires no less.”\n\nCompletely agree with the reasoning of the ruling. \n\nBut what are the requirements to be in the press corps? Can just anyone/any outlet say, \"hey, I'm the press, so you've gotta let me in?\"",
                "That's ok, SCOTUS will edit the constitution to accomodate him.  Again.",
                "Sure,  White House will just conveniently \"forget\" to instruct guards let AP in and in the mean time will file an appeal with SCOTUS (anyway).",
                "\"Full access to Trump\" - that does not sound like a win.",
                "They’re working to dismantle every Right and Freedom one at a time! STOP THEM!!",
                "So far there's only been one question on every ruling like this:\n\n\"...and if we don't?\"",
                "trump always listens to judges.... right?",
                "Cool. What will you do to make him abide by the ruling? Nothing again? Cool cool cool."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US IRS chief to quit over deal to share data with immigration officials, report says",
            "external_url": "https://www.reuters.com/world/us/us-irs-chief-quit-over-deal-share-data-with-immigration-officials-report-says-2025-04-08/",
            "upvotes": 3209,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Illegal attempts to access IRS data was an article of impeachment against Nixon ",
                "Remember when trump sued the irs to prevent them from sharing his tax returns with congress and it took years and went all the way to the Supreme Court?",
                "Don't worry. Her position will be filled by a DOGE high schooler ASAP.",
                "Why would the IRS have data on illegal immigrants, MAGA? I thought illegal immigrants didn't pay taxes, MAGA? If they're paying taxes, why do they need to go, MAGA?",
                "Is this legal? Oh wait, nvm.",
                "Wait, illegal immigrants don't contribute anything. How does the IRS have their data? - some maga guy probably",
                "We just keep losing more and more talent due to this administration’s actions. I’m no fan of paying taxes. And the IIRS certainly needs some work. But we can’t function this way.",
                "The more of these people quit, the more open positions they can put anyone into. At the same time, I totally get quitting. You’re not about to make me do something absolutely batshit crazy.",
                "That's the sort of thing you don't *quit* over. Stick around, drag it out, and make it their problem!",
                "No worries, they’ll just keep on putting in someone who doesn’t care about the rule of law. Not that hard to find. Kudos to this third person who quit over this very concerning weaponization of tax information.\n\nWhy should your ordinary citizen submit anything to the IRS, if the IRS is now showing it’s not private? Because what this means is that the IRS will now provide your personal information (and nobody knows that more than the IRS), to whatever authority asks for it.\n\nThe only reason this voluntary tax disclosure of very private information to the IRS has lasted as long as it had is because people have trusted that this info will be used by the IRS for tax purposes only, not to be given out freely to ICE or whoever says they need it for unprecedented purposes."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "AP wins reinstatement to White House events after judge rules government can’t bar its journalists",
            "external_url": "https://apnews.com/article/trump-ap-media-court-white-house-events-access-f346a0efe87c1dec4d6f90e6041abd09",
            "upvotes": 1130,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> \"Under the First Amendment, if the Government opens its doors to some journalists—be it to the Oval Office, the East Room, or elsewhere—it cannot then shut those doors to other journalists because of their viewpoints,” McFadden wrote. “The Constitution requires no less.”\n\nThe question is will this administration respect the ruling. They don't seem to have any respect for checks and balances, even though they're a cornerstone of our Constitution.",
                "> U.S. District Judge Trevor N. McFadden, an appointee of President Donald Trump, ruled that the government can’t retaliate against the AP’s decision not to follow the president’s executive order to rename the Gulf of Mexico. The decision handed the AP a major victory at a time the White House has been challenging the press on several levels. \n\nGood.  This was an absurd move by the Trump administration.",
                "Freedom of the Press !\n\nI wonder how may question Ms Leave-it will take from the AP...",
                "Good. Now to the press corps and media - stop being afraid and start challenging this dimwits. Don't just ask questions assuming they have grade 2 intelligence (they don't) and they not ask what the hell they are talking about? Question them, challenge them. Call out the lies, the disrespect, the abuse, the ignorance - be the public that is demanding these clowns be called out for their stupid antics.",
                "I want them to ask follow up questions. Questions like, “Do you have actual proof of that?”  and “What specifically does that mean?”\n\nI’d take it from the AP or any others that follow Bill Burr’s advice.",
                "Seems like an impeachable offense, we don’t have kings",
                "So basically they’ll appeal it, lose the appeal, and then will send it to SCOTUS, who will come up with some batshit crazy reason to continue to bar the AP. \n\nThere, saved us all some time.",
                "Everyone should go read about the judge who made this ruling. He’s made some extremely questionable decisions that almost exclusively favored the Trump administration and his supporters. Even he is shutting down one of many of the  Trump administrations’ ridiculously unconstitutional attacks on the press.",
                "…. Until it gets to the Supreme Court and they’ll say “welllllll in this administration they can.”",
                "There's not a snowman's chance in hell that this will be followed."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "'Time for you to abandon the United States': Asylum seekers who used app being told to leave",
            "external_url": "https://www.cbc.ca/news/world/us-migration-app-removals-1.7504556",
            "upvotes": 3978,
            "date": "04/08/2025",
            "thumbnail": "https://i.cbc.ca/1.7504565.1744118021!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/trump-immigration.jpg?im=Resize%3D620",
            "top_comments": [
                "I was told by someone that I was making a “big deal” over the Mass Deportations Now signs at his rallies.",
                "The asylum seeker issue is proof that Republicans do not actually support legal immigration. They think that being an \"illegal immigrant\" is an innate quality, closely tied to your ethnicity and the color of your skin, not simply the lack of immigration paperwork.\n\nSeeking asylum in the US is legal. You may disagree with the law, but these people were following the law. They are not illegal immigrants. They are legal immigrants following a process that you don't like. The same was true of the Haitian immigrants that JD Vance made up those disgusting lies about. It has always been racism and xenophobia.",
                "... US abandons refugees. Abdicates global leadership. Shoots self in face with tariff cannon. Genius. ",
                ">Time for you to abandon the United States\n\nGood advice for everyone, honestly.",
                "\"Time for you to abandon the United States\" -- Now, there's a piece of advice I can get behind. I'd only apply it to literally everyone in the world rather than only people with a skin color that isn't white.",
                "1883: \"Give me your tired, your poor,\nYour huddled masses yearning to breathe free.\"\n\n2025: Screw you.",
                "And Trump is going \"those losers from insane asylums are being told to go...\"",
                "900,000 is an astounding number of people being asked to leave the country.",
                " Soon we will be the asylum seekers lul",
                "Trying to make a better life and end up in fucking El Salvador."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "DOJ ends crypto enforcement team, shifts focus to terrorism and fraud",
            "external_url": "https://www.cnbc.com/2025/04/08/doj-ends-crypto-enforcement-team-shifts-focus-to-terrorism-and-fraud.html",
            "upvotes": 54,
            "date": "04/08/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108115803-1741898075735-gettyimages-1242591657-1174649-na-pol-0818-dc-building-mugs-kkn-30626.jpeg?v=1744124601&w=1920&h=1080",
            "top_comments": [
                "Donnie gets to run memecoin scams… perfectly legal, perfectly cool",
                "Well we know where the next unreported fraud will be.",
                "The irony of shifting to fraud 😂",
                "They already work for Trump, terrorism and fraud are a given",
                "Ian Freeman needs a pardon."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "At least 44 people dead after roof collapse at Dominican Republic nightclub",
            "external_url": "https://www.theguardian.com/world/2025/apr/08/roof-collapse-jet-set-santo-domingo-dominican-republic-nightclub",
            "upvotes": 310,
            "date": "04/08/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/79b03f34449ac6a3b56796dc8e259dd27e8baa67/0_82_1280_768/master/1280.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8bda5850f1e1b759a8a7f687cc0774b6",
            "top_comments": [
                "Article says 58 now…. Damn 😔",
                "Headline has updated to 58 dead",
                "*It’s unclear how often government officials inspect buildings in the Dominican Republic and when the last inspection was done at Jet Set, if ever. (AP)*\n\nI guess the Jet Set hosted these famous merengue parties every Moday which all the big names in the arts and politics attended. Rescue efforts are intense and in progress for those trapped under the collapsed roof.",
                "Just a horrible way for people's lives to end.",
                "This is absolutely horrific. My heart goes out to all of them.",
                "Looks like Rubby Perez didn't make it. A legendary voice gone far too soon, among many others.",
                "“Dozens of people gathered at the National Institute of Forensic Pathology, which projected pictures of the victims so their loved ones could identify them”"
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "NEW",
            "title": "Keystone Pipeline ruptures in North Dakota",
            "external_url": "https://apnews.com/article/keystone-oil-pipeline-north-dakota-spill-36e86142566763a5464e1dd132eede56",
            "upvotes": 2976,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sounds like the worker who shut it down quickly should get a raise, could have been way worse.",
                "*“I don’t think it’s going to be that huge,” Suess said.*\n\nThat line is too tired to be true.",
                "I wonder who could have seen this coming.  Like.....who could've known?  Why weren't there protests over this risk?",
                "Oh wait, wait. They promised us it would NEVR leak. What's up with that.",
                "Is this the pipeline that for four years, MAGA folks claimed  Biden shut down, causing a rise in gas prices?  Of course it was actually a future expansion project that he stopped, but they never let facts get in the way. Drill baby drill!",
                "FEMA is on their way with their best people right? ",
                "> In December 2022, nearly 13,000 barrels of oil spilled from Keystone’s line in Kansas into a creek traversing a pasture. An engineering consulting firm said the bend in the pipeline at the site had been “overstressed” since being installed in 2010, likely because of construction activity altering the land around the pipe.\n\nRepublican response: Let's roll back regulations even further so that this can happen more often, yay!",
                "Thankfully, the EPA's 2 remaining staff will be onsite in a few months.",
                "Whoa, remind me again why the expansion of the XL pipeline was shut down? Oh this exact reason?",
                "Near north Dakotas only natural waterfall. Shame"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "White House Must Allow The Associated Press Full Access to Trump, Judge Rules",
            "external_url": "https://www.nytimes.com/2025/04/08/us/politics/trump-ap-oval-office-access.html?unlocked_article_code=1.-E4.2tYW.dCYLg2tPldXB&smid=url-share",
            "upvotes": 342,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "SCOTUS injunction in 3... 2... 1...",
                "And we know how well this administration abides to judgements.",
                "“Under the First Amendment, if the government opens its doors to some journalists — be it to the Oval Office, the East Room, or elsewhere — it cannot then shut those doors to other journalists because of their viewpoints,” he wrote. “The Constitution requires no less.”\n\nCompletely agree with the reasoning of the ruling. \n\nBut what are the requirements to be in the press corps? Can just anyone/any outlet say, \"hey, I'm the press, so you've gotta let me in?\"",
                "That's ok, SCOTUS will edit the constitution to accomodate him.  Again.",
                "Sure,  White House will just conveniently \"forget\" to instruct guards let AP in and in the mean time will file an appeal with SCOTUS (anyway).",
                "\"Full access to Trump\" - that does not sound like a win.",
                "They’re working to dismantle every Right and Freedom one at a time! STOP THEM!!",
                "So far there's only been one question on every ruling like this:\n\n\"...and if we don't?\"",
                "trump always listens to judges.... right?",
                "Cool. What will you do to make him abide by the ruling? Nothing again? Cool cool cool."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "AP wins reinstatement to White House events after judge rules government can’t bar its journalists",
            "external_url": "https://apnews.com/article/trump-ap-media-court-white-house-events-access-f346a0efe87c1dec4d6f90e6041abd09",
            "upvotes": 1135,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> \"Under the First Amendment, if the Government opens its doors to some journalists—be it to the Oval Office, the East Room, or elsewhere—it cannot then shut those doors to other journalists because of their viewpoints,” McFadden wrote. “The Constitution requires no less.”\n\nThe question is will this administration respect the ruling. They don't seem to have any respect for checks and balances, even though they're a cornerstone of our Constitution.",
                "> U.S. District Judge Trevor N. McFadden, an appointee of President Donald Trump, ruled that the government can’t retaliate against the AP’s decision not to follow the president’s executive order to rename the Gulf of Mexico. The decision handed the AP a major victory at a time the White House has been challenging the press on several levels. \n\nGood.  This was an absurd move by the Trump administration.",
                "Freedom of the Press !\n\nI wonder how may question Ms Leave-it will take from the AP...",
                "Good. Now to the press corps and media - stop being afraid and start challenging this dimwits. Don't just ask questions assuming they have grade 2 intelligence (they don't) and they not ask what the hell they are talking about? Question them, challenge them. Call out the lies, the disrespect, the abuse, the ignorance - be the public that is demanding these clowns be called out for their stupid antics.",
                "I want them to ask follow up questions. Questions like, “Do you have actual proof of that?”  and “What specifically does that mean?”\n\nI’d take it from the AP or any others that follow Bill Burr’s advice.",
                "Seems like an impeachable offense, we don’t have kings",
                "So basically they’ll appeal it, lose the appeal, and then will send it to SCOTUS, who will come up with some batshit crazy reason to continue to bar the AP. \n\nThere, saved us all some time.",
                "Everyone should go read about the judge who made this ruling. He’s made some extremely questionable decisions that almost exclusively favored the Trump administration and his supporters. Even he is shutting down one of many of the  Trump administrations’ ridiculously unconstitutional attacks on the press.",
                "…. Until it gets to the Supreme Court and they’ll say “welllllll in this administration they can.”",
                "There's not a snowman's chance in hell that this will be followed."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "US IRS chief to quit over deal to share data with immigration officials, report says",
            "external_url": "https://www.reuters.com/world/us/us-irs-chief-quit-over-deal-share-data-with-immigration-officials-report-says-2025-04-08/",
            "upvotes": 3223,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Illegal attempts to access IRS data was an article of impeachment against Nixon ",
                "Remember when trump sued the irs to prevent them from sharing his tax returns with congress and it took years and went all the way to the Supreme Court?",
                "Don't worry. Her position will be filled by a DOGE high schooler ASAP.",
                "Why would the IRS have data on illegal immigrants, MAGA? I thought illegal immigrants didn't pay taxes, MAGA? If they're paying taxes, why do they need to go, MAGA?",
                "Is this legal? Oh wait, nvm.",
                "Wait, illegal immigrants don't contribute anything. How does the IRS have their data? - some maga guy probably",
                "We just keep losing more and more talent due to this administration’s actions. I’m no fan of paying taxes. And the IIRS certainly needs some work. But we can’t function this way.",
                "The more of these people quit, the more open positions they can put anyone into. At the same time, I totally get quitting. You’re not about to make me do something absolutely batshit crazy.",
                "That's the sort of thing you don't *quit* over. Stick around, drag it out, and make it their problem!",
                "No worries, they’ll just keep on putting in someone who doesn’t care about the rule of law. Not that hard to find. Kudos to this third person who quit over this very concerning weaponization of tax information.\n\nWhy should your ordinary citizen submit anything to the IRS, if the IRS is now showing it’s not private? Because what this means is that the IRS will now provide your personal information (and nobody knows that more than the IRS), to whatever authority asks for it.\n\nThe only reason this voluntary tax disclosure of very private information to the IRS has lasted as long as it had is because people have trusted that this info will be used by the IRS for tax purposes only, not to be given out freely to ICE or whoever says they need it for unprecedented purposes."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "'Time for you to abandon the United States': Asylum seekers who used app being told to leave",
            "external_url": "https://www.cbc.ca/news/world/us-migration-app-removals-1.7504556",
            "upvotes": 3983,
            "date": "04/08/2025",
            "thumbnail": "https://i.cbc.ca/1.7504565.1744118021!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/trump-immigration.jpg?im=Resize%3D620",
            "top_comments": [
                "I was told by someone that I was making a “big deal” over the Mass Deportations Now signs at his rallies.",
                "The asylum seeker issue is proof that Republicans do not actually support legal immigration. They think that being an \"illegal immigrant\" is an innate quality, closely tied to your ethnicity and the color of your skin, not simply the lack of immigration paperwork.\n\nSeeking asylum in the US is legal. You may disagree with the law, but these people were following the law. They are not illegal immigrants. They are legal immigrants following a process that you don't like. The same was true of the Haitian immigrants that JD Vance made up those disgusting lies about. It has always been racism and xenophobia.",
                "... US abandons refugees. Abdicates global leadership. Shoots self in face with tariff cannon. Genius. ",
                ">Time for you to abandon the United States\n\nGood advice for everyone, honestly.",
                "\"Time for you to abandon the United States\" -- Now, there's a piece of advice I can get behind. I'd only apply it to literally everyone in the world rather than only people with a skin color that isn't white.",
                "1883: \"Give me your tired, your poor,\nYour huddled masses yearning to breathe free.\"\n\n2025: Screw you.",
                "And Trump is going \"those losers from insane asylums are being told to go...\"",
                "900,000 is an astounding number of people being asked to leave the country.",
                " Soon we will be the asylum seekers lul",
                "Trying to make a better life and end up in fucking El Salvador."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Keystone Pipeline ruptures in North Dakota",
            "external_url": "https://apnews.com/article/keystone-oil-pipeline-north-dakota-spill-36e86142566763a5464e1dd132eede56",
            "upvotes": 2978,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sounds like the worker who shut it down quickly should get a raise, could have been way worse.",
                "*“I don’t think it’s going to be that huge,” Suess said.*\n\nThat line is too tired to be true.",
                "I wonder who could have seen this coming.  Like.....who could've known?  Why weren't there protests over this risk?",
                "Oh wait, wait. They promised us it would NEVR leak. What's up with that.",
                "Is this the pipeline that for four years, MAGA folks claimed  Biden shut down, causing a rise in gas prices?  Of course it was actually a future expansion project that he stopped, but they never let facts get in the way. Drill baby drill!",
                "FEMA is on their way with their best people right? ",
                "> In December 2022, nearly 13,000 barrels of oil spilled from Keystone’s line in Kansas into a creek traversing a pasture. An engineering consulting firm said the bend in the pipeline at the site had been “overstressed” since being installed in 2010, likely because of construction activity altering the land around the pipe.\n\nRepublican response: Let's roll back regulations even further so that this can happen more often, yay!",
                "Thankfully, the EPA's 2 remaining staff will be onsite in a few months.",
                "Whoa, remind me again why the expansion of the XL pipeline was shut down? Oh this exact reason?",
                "Near north Dakotas only natural waterfall. Shame"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Ontario's measles outbreak is so big, even New York health officials are taking notice",
            "external_url": "https://www.cbc.ca/news/canada/toronto/new-york-state-department-of-health-measles-travel-advisory-ontario-1.7504085",
            "upvotes": 2652,
            "date": "04/08/2025",
            "thumbnail": "https://i.cbc.ca/1.5343106.1708113693!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/measles-virus.jpg?im=Resize%3D620",
            "top_comments": [
                "This outbreak in southwestern Ontario, like the Texas outbreak, is concentrated in a very conservative group of Mennonites. It's been ongoing since October.",
                "Im going to guess that most of them are unvaccinated",
                "\"Measles can be a serious disease,' N.Y. official says\"\n\n\nWe carry computers in our pockets. Information has never been easier to access and verify.\n\n\nDumb mother fuckers always seem to find a way.",
                "Disease doesn't care about borders",
                "The fact that Ontario’s measles outbreak has drawn concern from New York health officials highlights just how interconnected our public health systems truly are. Measles is a preventable disease, and its resurgence points to dangerous gaps in vaccination coverage and public trust. This isn’t just a local issue — it’s a cross-border wake-up call for stronger immunization strategies and coordinated public health responses.",
                "Clearly vaccines need to be actually required.  Weird religious sects shouldn’t be able to opt out of them.",
                "Can we just isolate them, send them supplies/medicine and let them ask god to deal with it?",
                "Hey!!! We here in the US have the market cornered on stupid, Canada!! Don’t try and steal our thunder!!",
                "We are all inter-connected.  \n\nAbolishing vaccines aid to other poor countries would affect Americans as well.",
                "I think it goes to show you how many people are actually on unvaccinated"
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "RISING",
            "title": "At least 44 people dead after roof collapse at Dominican Republic nightclub",
            "external_url": "https://www.theguardian.com/world/2025/apr/08/roof-collapse-jet-set-santo-domingo-dominican-republic-nightclub",
            "upvotes": 307,
            "date": "04/08/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/79b03f34449ac6a3b56796dc8e259dd27e8baa67/0_82_1280_768/master/1280.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8bda5850f1e1b759a8a7f687cc0774b6",
            "top_comments": [
                "Article says 58 now…. Damn 😔",
                "Headline has updated to 58 dead",
                "*It’s unclear how often government officials inspect buildings in the Dominican Republic and when the last inspection was done at Jet Set, if ever. (AP)*\n\nI guess the Jet Set hosted these famous merengue parties every Moday which all the big names in the arts and politics attended. Rescue efforts are intense and in progress for those trapped under the collapsed roof.",
                "Just a horrible way for people's lives to end.",
                "This is absolutely horrific. My heart goes out to all of them.",
                "Looks like Rubby Perez didn't make it. A legendary voice gone far too soon, among many others.",
                "“Dozens of people gathered at the National Institute of Forensic Pathology, which projected pictures of the victims so their loved ones could identify them”"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Cases in Texas measles outbreak surpass 500",
            "external_url": "https://abcnews.go.com/Health/measles-cases-texas-outbreak-surpass-500-24-new/story?id=120588600",
            "upvotes": 1554,
            "date": "04/08/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5c0b432-75a4-415d-ba52-ce0606bcc4a2/measles-testing-sign-gty-jt-250311_1741733337889_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "This update adds 24 cases to the number of reported cases in Texas associated with the outbreak. Friday's update added 59 cases. Last Tuesday's update added 22 cases. The previous Friday’s update added 78 cases.\n\nOne new hospitalization (up to 57 from 56) was reported. Two deaths have now been reported in Texas.",
                "I firmly believe RFK has become a meat suit for his brain worm overlords, trying to get rid of dewormer and vaccines world wide, then one day, the worms will rule the mother fucking world. ",
                "Like covid, the way they will fix this is to stop publishing numbers.\n\n:(\n\nedit: trump morons, not ABC..",
                "New Mexico and Oklahoma have not yet posted updates today. Kansas, which has also had cases associated with the Texas outbreak, updates on Wednesdays.\n\nETA: Oklahoma is reporting no new cases. They only update on Tuesdays so that means none for the past week. They have had 10 cases total.\n\nETA 2: New Mexico is reporting 2 new cases. That is an increase to 56 cases from 54.\n\nETA 3: Kansas is currently at 24 cases that have been reported to be likely associated with the Texas outbreak.",
                "They really need to give numbers of how many were unvaxxed with each update. Nothing proves the efficacy of vaccines more than this.",
                "Amazing in the year 2025!",
                "While I am sure we know the answer are the majority of the infected vaccinated or Unvaccinated?",
                "Darwin loves red hats!",
                "If you want to remain healthy, get every vaccine you could possibly need, especially if you’re 65 and older. Just got my second MMR shot just in case. Let the true believer anti-vaxxers learn science lessons the hard way. Stay safe, folks!",
                "Texas is now the cautionary tale for what happens when anti-vax politics override public health. Measles was *eliminated*in 2000 — and now we’re burying kids again because “freedom” apparently includes the freedom to ignore science and kill your neighbors."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court halts a judge’s order to reinstate federal probationary workers",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-pauses-judges-order-reinstate-federal-probationary-worke-rcna197840?taid=67f54b6f2263bc0001301365",
            "upvotes": 2298,
            "date": "04/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250324-donald-trump-ew-250p-8e2284.jpg",
            "top_comments": [
                "The administration argued that the agencies made the decision to fire these employees “by themselves”, which I find strange because every single instance of these happening they say they were following either an executive order OR Trump’s agenda. Like that should have been the easiest thing to call bullshit on…",
                "I can't imagine the rollercoaster these employees are going through",
                "What sucks is many \"probationary\" employees are just employees who have been promoted. So they aren't new, and they may actually have a lot of necessary experience. And sometimes those employees invested in themselves by paying to get certificates and degrees to make themselves better assets worthy of promotion.",
                "FWIW they ruled here on lack of standing as this case was brought by non profit groups. There are other cases brought by the affected employees and unions that are still ongoing.",
                "They're 100% going to say he can rewrite the Constitution via Executive Order.",
                "It’s amazing how corrupt this administration is right now.",
                "And now we see why McConnell was willing to shell out so much political capital to buy the supreme court",
                "I love how they keep giving unsigned orders. \n\nIt's almost like they're afraid that the public might hold them accountable in ways that aren't particularly pleasant or life prolonging.",
                "The Supreme Court of United States are there to cooperate with the terrorist Donald Trump.\n\nThat is how a mafia organization works.",
                "Of course they do. The SCOTUS signs off on _everything_ the Trump admin does."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "US Justice Dept disbands crypto enforcement team, citing Trump order",
            "external_url": "https://www.reuters.com/world/us/us-justice-dept-disbands-cryptocurrency-enforcement-unit-2025-04-08/",
            "upvotes": 10881,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Can't have people looking into crypto scams when the President and his family are the ones running the crypto scams.",
                "I'm guessing the SBF pardon will be coming on Friday at around 7 PM.",
                "What is the point of congress anymore? Trump seems to have the power to do everything himself.",
                "He certainly likes dismantling consumer protection agencies.",
                "It's things like this that will cause the Great Depression to repeat.\n\nThe SEC was created to regulate stock to ensure people didn't do stupid things to buy overpriced stock.\n\nInstead, we're going to have people spending their life savings on meme coins, only to have it get magically wiped out.\n\nCombine that with tariffs and the inevitable ecological disasters that won't be properly responded to... and you have the Great Depression.",
                "New trump shitcoin launching in 3… 2…",
                "\"US Justice Department disbands fraud enforcement team, citing Trump order\".",
                "Trump can't have his grifting being investigated.",
                "How long before Trump EOs the entire Treasury into crypto?",
                "You're safe to assume all crypto is a scam. \n\nIt's funny to me that the same people who want to bring back sweatshop manufacturing also push crypto."
            ],
            "aggregate_sentiment": 12.0
        }
    ],
    "last_updated": "04/09/2025 00:41:11 UTC"
}