{
    "posts": [
        {
            "category": "HOT",
            "title": "Mob chased Brooklyn woman after mistaking her for protester at speech by Israeli security minister",
            "external_url": "https://apnews.com/article/itamar-bengvir-brooklyn-mob-woman-chased-090da170e8800307c54e2520320f6a2c",
            "upvotes": 12223,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Absolutely nuts \n\n> NEW YORK (AP) — A Brooklyn woman said she feared for her life as she was chased, kicked, spit at and pelted with objects by a mob of Orthodox Jewish men who mistook her as a participant in a protest against Israel’s far-right security minister.\n\n-\n\n> The woman, a neighborhood resident in her 30s, told The Associated Press she learned of the protest after hearing police helicopters over her apartment. She walked over to investigate around 10:30 p.m. but by then the protest had mostly disbursed. Not wanting to be filmed, she covered her face with a scarf.\n\n>“As soon as I pulled up my scarf, a group of 100 men came over immediately and encircled me,” said the woman, who spoke to the AP on the condition of anonymity because she feared for her safety.\n\n>‘I had nowhere to go’\n\n>“They were shouting at me, threatening to rape me, chanting ‘death to Arabs.’ I thought the police would protect me from the mob, but they did nothing to intervene,” she said.\n\n>As the chants grew in intensity, a lone police officer tried to escort her to safety. They were followed for blocks by hundreds of men and boys jeering in Hebrew and English.\n\n>Video shows two of the men kicking her in the back, another hurling a traffic cone into her head and a fourth pushing a trash can into her.\n\n>“This is America,” one of the men can be heard saying. “We got Israel. We got an Army now.”\n\n>At one point, she and the police officer were nearly cornered against a building, the video shows.\n\n>“I felt sheer terror,” the woman recalled. “I realized at that point that I couldn’t lead this mob of men to my home. I had nowhere to go. I didn’t know what to do. I was just terrified.”",
                "Remember that time in LA on miami beach with the shooting when both thought the other side were palestinians",
                "Not a single arrest has been made as far as I know. This country is a fucking shithole.",
                "Ah yes, the pro-first amendment right of...harassing a lady because of racism",
                "Holy shit after all of that she was just an innocent bystander? Imagine if that cop wasn’t there.",
                "They saw a lone woman and zeroed in on her. Shows them for what they are...women hating bastards.\n\nFortunately that cop did what he should do, protected her. Shame there weren't other cops to assist.",
                "Now picture that happening the other way around. You´d never hear the end of it, and dozens of people would have been arrested by now.",
                "What they engaged in is unequivocally terrorism. Mob behavior has no place in a civilized society.",
                "Remember when a violent pro-Israeli mob attacked UCLA student protesters with weapons, tear gas and fireworks while police just stood back for hours?  Nothing happened then either... well, Biden condemned the pro-Palestinian protesters the following day but that was it.\n\nIt's absolutely nuts how biased this shit is. If the roles were reversed, it would be called domestic terrorism and the national guard would be activated.",
                "The fuck is going on over there?? \n\nIf jail time isn't in all their futures then something is deeply wrong."
            ],
            "aggregate_sentiment": 32.0
        },
        {
            "category": "HOT",
            "title": "3 children who are US citizens — including one with cancer — deported with their mothers, lawyers and advocacy groups say",
            "external_url": "https://edition.cnn.com/2025/04/27/us/children-us-citizens-deported-honduras/index.html",
            "upvotes": 18338,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25021729089144.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I do not understand these american headlines, \"US citizens\" are deported? Deported where if they are US CITIZENS? English is not my first language, so am I just dumb? Or?",
                "So I got a question. If the parents aren’t citizens and get deported are they just supposed to leave the kids here? Or do they get deported with the parents.",
                "\"The father then moved to give provisional custody of his two daughters to his sister-in-law, a US citizen who lives in Baton Rouge, and the mandate was notarized in Louisiana, the documents say.\"\n\nIs the father himself not a us citizen? If he is then why try to pass guardianship to his sister in law?",
                "> “If ICE can do this to these mothers and these children, if ICE can do this to students on college campuses … none of us are safe from this kind of lawlessness,” she said.\n\nUnchecked power WILL come to bite us in the ass later",
                "Remember this when they're asking for mercy",
                "Atleast they sent them with their mothers unlike last time where they just took them away and then didn't even keep track after deporting the parents. They argued in court against providing children with soap and toothpaste. Evil.",
                "Not deported. Kicked out illegally",
                "Everyone involved in deporting a small child who has stage 4 cancer…good luck with the karma that’s going to inevitably smack your ass down.",
                "Mind you the father - a citizen - as well as the court have a suspicion that ICE falsified the records and the mother didn't leave willingly with the child.",
                "I'm sure this thread is full of lots of insightful and nuanced conversation about immigration.\n\n*checks thread*\n\nOh no."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Military incursion imminent according to Pakistan",
            "external_url": "https://www.reuters.com/world/pakistan-defence-minister-says-military-incursion-by-india-is-imminent-2025-04-28/",
            "upvotes": 1423,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Asif said Pakistan was on high alert and that it would only use its arsenal of nuclear weapons if \"there is a direct threat to our existence\"\n\nI was not expecting them to talk about the possibility of using them, thats even more terrifying",
                "There is no two countries more prepared to not nuke each other.",
                "Hopefully it'll be just some isolated border skirmish but we have no idea how wide a flashpoint can spread at this point. I'm actually more concerned about the water rights fight. That one can be an existential battle and with nukes on both sides, it's going to be a nail biter.",
                "The headline has been updated for clarity:\n\n>Pakistan defence minister says military incursion **by India** is imminent\n\n(just in case anyone thought the Pakistan defence minister was announcing attack plans)",
                "Who would have thought this would happen.  2025 is definitely going into the history book as a very effed up year and we are only in april.",
                "This decade fucking sucks.",
                "From the Article: \n\n>ISLAMABAD, April 28 (Reuters) - Pakistan's defence minister said on Monday that a military incursion by neighbouring India was imminent in the aftermath of a deadly militant attack on tourists in Kashmir last week, as tensions rise between the two nuclear-armed nations.......\n\nOddly, the fact that this is the same defense minister who candidly admitted on SkyNews recently to Pakistan being a terror-hub for over 30 years, makes it slightly more credible that there will be a reprisal for the terrorist attack in India. \n\nUnless of course, the terrorist hub is eliminated within Pakistan, and the indicted parties extradited for trials.\n\nHard sell. But, better than war, with high chance of falling nukes.",
                "Now if this escalates into a full blown conflict that's really going to put a dent in Apple's plans to shift it's iPhone manufacturing to India.",
                "Will nothing happen again?",
                "They did not need much\nhttps://youtu.be/p-iNWaBZ3-w?si=ARE0sSsJ8sV36Z6A"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Large parts of Spain and Portugal hit by power outage",
            "external_url": "https://news.sky.com/story/large-parts-of-spain-and-portugal-hit-by-power-outage-13357374",
            "upvotes": 1945,
            "date": "04/28/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-madrid-outage-power_6899771.jpg?20250428130329",
            "top_comments": [
                "I confirm from Spain that light and Internet is coming back. It was great going back to 1900 xD",
                "I knew something was up when 10 out of 16 people in my online lobby simultaneously had a disconnect and didn't come back",
                "In Portugal at least it’s the entire country (continental) as far as it’s being reported. All major cities all out of power. Cell service was out for 10min after the outage but it’s back now, even if a bit iffy. \nI’ve read a lot of conflicting reports, some say it’s also affecting Germany, France, Poland and Greece.. but can’t find anything from those countrie’s press to confirm it\n\nEdit: Euronews confirming parts of France also affected.\n\nEdit2: Portuguese governament considers the possibility of it being a result of a cyberattack\n\nEdit3: No reports from Germany, Poland or Greece as previously stated. For some reason Portuguese media insisted on that but backtracked now.\n\nEdit4: islands were not affected",
                "Portugal is on total blackout. How is Spain and other countries?",
                "At the Lisbon airport and power appears to have come back on now. Although rental car kiosks are still offline.",
                "If that was a cyber attack, it would make it a frightening test run.",
                "Hopefully the backup generators kicked in quickly in hospitals. Probably scary anyway - hopefully all backup systems were/are properly maintained.",
                "What caused that terrible incident?",
                "Just highlights our worrying over reliance on such a fragile system, hope shit gets sorted ASAP! 🙏🏼",
                "Are there any maps on which parts were affected?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Suspect arrested in Homeland Security Secretary Noem’s purse theft",
            "external_url": "https://apnews.com/article/kristi-noem-homeland-security-robbed-suspect-arrest-874c3933f1d59873c0225d737d3dae5a",
            "upvotes": 1454,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Didn’t she say that anyone carrying over $1,500 cash was a drug dealer?",
                "I have questions....\n\n* Who carries $3K cash in their purse\n* Who puts a Gucci purse with $3K on the floor in a restaurant\n* How can  a masked man get close enough without the secret service noticing\n\n\"this happens all the time to people\"",
                "If you believe for even one second that an illegal immigrant stole her purse, I have a bridge to sell you.",
                "\"There was no indication of criminal charges being filed against the suspect as of Sunday\"  \nNo charges? I am pretty sure if he really took the purse, they would be filling charges to the fullest extent of the law. I guess since they say that he is an illegal alien, that would give him the due process they want to skip!",
                "I’ve never seen the police care so much about recovering a working girls purse. ",
                "Convenient that the perp who somehow stole her purse while Secret Service was present was “illegal”.  I’m calling Shenanigans on this fake ass story.",
                "Despite the perp's background or history...our fucking HOMELAND SECURITY secretary couldn't even keep her purse secure inside a posh restaurant.\n\nAbsolutely on-brand for this Administration.",
                "Exactly how did an illegal immigrant get access to an upscale restaurant, then get close enough to the Director of Homeland Security, and finally close enough to snatch the purse that was near enough to her body that she could have been stabbed in the throat? Does her Secret Service want her dead?",
                "If you can't manage your bag at a restaurant, you can manage a country.",
                "Lemme guess; it was an undocumented immigrant that somehow snuck past her security, and grabbed the purse without anyone seeing."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Shooting at North Carolina university leaves 1 dead, 6 injured",
            "external_url": "https://edition.cnn.com/2025/04/27/us/ecsu-shooting-nc-elizabeth-city/index.html",
            "upvotes": 2813,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/screen-shot-2025-04-27-at-5-26-08-pm.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Just a daily thing now. I can’t remember any of them anymore due to the high volume",
                "Start calling them American blood offerings at this point.",
                "Uvalde went like 70% for Trump. This shit will NEVER change until the constitution is changed",
                "Why is there zero information on the actual shooting?",
                "[removed]",
                "And the rest of the world doesn’t have this nonstop problem that the USA has why??? 🤷‍♂️",
                "Again?\n\nThats how many shootings since Columbine and no sensible gun laws?",
                "Guess it’s getting warmer out. Time for our yearly summer sacrifice.",
                "Are we great again, again, yet?",
                "I remember my school shooting. It was two years ago. I don’t think anyone remembers which one it was. That’s a sad reality."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "All Joann Fabric and Craft store locations to close by end of May",
            "external_url": "https://www.live5news.com/2025/04/28/all-joann-fabric-craft-store-locations-close-by-end-may/",
            "upvotes": 659,
            "date": "04/28/2025",
            "thumbnail": "https://gray-wcsc-prod.gtv-cdn.com/resizer/v2/XK46E4Z7JZE4ZKDB3NCY4BZIZA.jpg?auth=9d580f4daf716e14a5c7f9f6fbe3aaa51561aba9e16d90e63e3dcde6b189560f&width=1200&height=600&smart=true",
            "top_comments": [
                "Private equity ruins yet another business.",
                "Bye Joann's, you were my go to fabric and notions store. Now where am I supposed to go?",
                "When billionaires destroy to create monopoly everything comes from Amazon.",
                "Their going out of business prices were worse then some stores normal prices",
                "Reading they got Toys R Us’ed. Bought specifically so they can be bankrupted and their assets sold off.",
                "Man, I used to enjoy going there with my mom.",
                "Are there any craft stores that aren’t super Christian now?",
                "Still mourning the loss of AC Moore.\n\nPS- Michaels sucks. Wish there was a better alternative.",
                "This is a terrible day for America, and therefore, the world.",
                "I always felt Joann and Micheal’s should have gotten together. Seemed a destined relationship built on love, arts and crafts. I can only assume they met, and maybe didn’t click. But my guess is they were in-love, but stayed with their original partners because of their undying loyalty. Such is life. Who knows, maybe later in life they find each other again, this time single, and able to craft the last days of their lives together. Now that’s art!"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "Man allegedly hid marijuana in Easter eggs across the city, posted clues to social media",
            "external_url": "https://local12.com/news/offbeat/easter-egg-marijuana-scavenger-hunt-hints-online-eggs-weed-pot-facebook-social-media-hint-picture-pictures-hid-hidden-police-search-investigation-five-drug-drugs-narcotics-dealer-selling-sell-park-parks-city-around-across?fbclid=IwZXh0bgNhZW0CMTEAAR4yYc8DWrYX0bIgzKbIsg1XPl84PybdrKUGKvLNoCTot1cmS4UyJ6dUCqDB9A_aem_x9AL9gaNBCFh-kY10ab7kw",
            "upvotes": 28969,
            "date": "04/27/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/1920/986/center/90/34125fb8-3b75-40d0-b8b0-d1f0e60e0986-weedscavengerhunt.png",
            "top_comments": [
                "When Easter lands on 4/20, this man had a calling and knew what to do.",
                "Paranoid people have been getting it wrong. There aren't any drugs in the Halloween candy, they're in the Easter eggs!",
                "God forbid men have hobbies.",
                "One of the weed shops near me does this, but they hide plastic eggs with tickets redeemable for prerolls and such at their store.  Seems like a slightly less questionable way to go about it.",
                "Where was he when I was a teen?",
                "The riddler if he was cool",
                "Bro was tripping posting on FB in TX..should have just put the clues on r/treecaching...",
                "Give this man a key the city",
                "\"In total, officers said they recovered over a quarter of an ounce of marijuana.\"\n\nBet it was 8 grams. 2g per egg. Doesn't sound as good as a quarter ounce for rage bait though.",
                "We've got pedophiles and fascists running our country right now, and *this* is what our judicial system is punishing? \n\nFuck that."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "1 dead in mass casualty event after boat crashes into Clearwater Ferry in Florida",
            "external_url": "https://abcnews.go.com/US/1-dead-mass-casualty-event-after-boat-crashes/story?id=121228624",
            "upvotes": 458,
            "date": "04/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/51ad0ff9-c73e-4df1-b8bd-c88816e7c300/ferry-crash-mo_1745854564230_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">\"The boat that fled the scene has been identified by another law enforcement agency,\" Clearwater PD said. However, further details about the second vessel involved in the incident have not yet been made available.\n\nFled the scene? I've never heard of a nautical hit and run outside of combat. Hope they catch them.",
                "Casualty means injuries and deaths.",
                "Not trying to start something, just an actual question. How is 1 dead considered a mass casualty?",
                "How can it be mass casualty and 1 person dead?",
                "It’s not a mass casualty event if only one person died. Just saying. \n\nEdit- I’m a dummy , and wrong. ",
                "Mass casualty and 1 dead... isnt that an oxymoron?",
                "Does the author not understand what a “mass casualty event” is?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "[CNN] Conclave to elect Pope Francis’ successor set to start on May 7, Vatican source says",
            "external_url": "https://www.cnn.com/2025/04/28/europe/conclave-start-date-intl/index.html",
            "upvotes": 623,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-28t101618z-1483844028-rc2w6ea31ehm-rtrmadp-3-pope-succession-cardinals.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Which country does Ralph Fiennes represent? 🤔 ",
                "Mel Kiper gonna Ave another meltdown ?",
                "*NFL Draft tone plays*\n\n“With the first pick of the 2025 Papal Draft, the Vatican picks…Shadeur Sanders!”",
                "It’s a shame this isn’t televised.  Make it like Eurovision",
                "As with US jury duty there will be some guys stretching it out solely for the free lunches.",
                "How does one drink for this? Is it like the Kentucky Derby where we all make hats?",
                "Who is going to run the Papal and vatican until then?",
                "Bong rips shall ensue. Hence the smoke.",
                "I have a feeling the next pope is gonna be super conservative. ",
                "Do they use Highlander rules? Is Vance going to be pope now?"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "Fired Disney employee gets 3 years in prison for hacking and changing menus",
            "external_url": "https://www.ctvnews.ca/world/article/fired-disney-employee-gets-3-years-in-prison-for-hacking-and-changing-menus/",
            "upvotes": 183,
            "date": "04/28/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/QPQ5PUNPPREEVD2MOCJTUA6D3I.JPG?smart=true&auth=89fb147e1a6f29198705ff74a468e89e29a1845510f4182eddfe4bd610a9777d&width=1200&height=630",
            "top_comments": [
                ">Scheuer hacked into Disney’s menu creation servers multiple times to manipulate and disrupt the menus, such as changing prices and adding profane language. He then made changes to the menus that “threatened public health and safety,” the complaint said, including altering allergen information to indicate certain menu items with peanuts were peanut-free, posing a fatal risk to individuals with peanut allergies.\n\nThis dude sounds like a massive edgelord.",
                "The price changing & general digital vandalism doesn’t seem that bad, but changing the allergens is just cruel (and certainly prison-worthy)",
                "I thought that 3 years was probably way out of proportion to what was done. Then I saw that they were removing allergen information, which could potentially kill people. So yeah, fuck this guy.",
                "Buzzed for Lightyears Grain Alcohol Cocktail.\n\n  \nBut seriously, don't ever screw around with allergens - dead kids don't wash away, ever.",
                "I've never considered giving someone pain of inconvenience by making intentionally false login attempts on their accounts.\n\nLook, I'm normally not that kind of person, but once in a while something comes up and that might be the exact level of petty I need.",
                "Fucking with the megacorp, bring it on.\n\nFucking with the small people who need their jobs there, massive shit move.\n\nAltering allergen information that could cost people their lives, fuck that guy.",
                "He could've killed someone with the allergen stunt. Give him ten years",
                "Memorizing passwords isn't hacking.",
                "Wow, this is wild. I actually worked at Disney a few years back, and the company definitely takes its policies very seriously, especially when it comes to employee behavior and ethics. While I was there, I remember being told about the strict code of conduct and the zero-tolerance stance on things like theft, fraud, or any kind of misconduct. It seemed pretty over the top at times, but seeing stories like this makes me realize how real and serious their enforcement is. I never thought someone would go to prison for something related to the company, though, but I guess it just shows how far they’re willing to go to protect their brand and assets.\n\nHonestly, this whole situation makes me feel kind of conflicted. On one hand, I can see how someone in a position of desperation or frustration might act irrationally, but on the other hand, stealing from a company as big as Disney doesn’t seem like a smart decision at all. I wonder what led this person to make that choice—whether it was a sense of entitlement or if they just didn’t think the consequences would be that severe. Either way, it’s crazy to think that a single bad decision can end up costing so much more than expected, especially when it's something as large-scale as Disney."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "All Joann Fabric and Craft store locations to close by end of May",
            "external_url": "https://www.live5news.com/2025/04/28/all-joann-fabric-craft-store-locations-close-by-end-may/",
            "upvotes": 663,
            "date": "04/28/2025",
            "thumbnail": "https://gray-wcsc-prod.gtv-cdn.com/resizer/v2/XK46E4Z7JZE4ZKDB3NCY4BZIZA.jpg?auth=9d580f4daf716e14a5c7f9f6fbe3aaa51561aba9e16d90e63e3dcde6b189560f&width=1200&height=600&smart=true",
            "top_comments": [
                "Private equity ruins yet another business.",
                "Bye Joann's, you were my go to fabric and notions store. Now where am I supposed to go?",
                "When billionaires destroy to create monopoly everything comes from Amazon.",
                "Their going out of business prices were worse then some stores normal prices",
                "Reading they got Toys R Us’ed. Bought specifically so they can be bankrupted and their assets sold off.",
                "Man, I used to enjoy going there with my mom.",
                "Are there any craft stores that aren’t super Christian now?",
                "Still mourning the loss of AC Moore.\n\nPS- Michaels sucks. Wish there was a better alternative.",
                "This is a terrible day for America, and therefore, the world.",
                "I always felt Joann and Micheal’s should have gotten together. Seemed a destined relationship built on love, arts and crafts. I can only assume they met, and maybe didn’t click. But my guess is they were in-love, but stayed with their original partners because of their undying loyalty. Such is life. Who knows, maybe later in life they find each other again, this time single, and able to craft the last days of their lives together. Now that’s art!"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Military incursion imminent according to Pakistan",
            "external_url": "https://www.reuters.com/world/pakistan-defence-minister-says-military-incursion-by-india-is-imminent-2025-04-28/",
            "upvotes": 1425,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Asif said Pakistan was on high alert and that it would only use its arsenal of nuclear weapons if \"there is a direct threat to our existence\"\n\nI was not expecting them to talk about the possibility of using them, thats even more terrifying",
                "There is no two countries more prepared to not nuke each other.",
                "Hopefully it'll be just some isolated border skirmish but we have no idea how wide a flashpoint can spread at this point. I'm actually more concerned about the water rights fight. That one can be an existential battle and with nukes on both sides, it's going to be a nail biter.",
                "The headline has been updated for clarity:\n\n>Pakistan defence minister says military incursion **by India** is imminent\n\n(just in case anyone thought the Pakistan defence minister was announcing attack plans)",
                "Who would have thought this would happen.  2025 is definitely going into the history book as a very effed up year and we are only in april.",
                "This decade fucking sucks.",
                "From the Article: \n\n>ISLAMABAD, April 28 (Reuters) - Pakistan's defence minister said on Monday that a military incursion by neighbouring India was imminent in the aftermath of a deadly militant attack on tourists in Kashmir last week, as tensions rise between the two nuclear-armed nations.......\n\nOddly, the fact that this is the same defense minister who candidly admitted on SkyNews recently to Pakistan being a terror-hub for over 30 years, makes it slightly more credible that there will be a reprisal for the terrorist attack in India. \n\nUnless of course, the terrorist hub is eliminated within Pakistan, and the indicted parties extradited for trials.\n\nHard sell. But, better than war, with high chance of falling nukes.",
                "Now if this escalates into a full blown conflict that's really going to put a dent in Apple's plans to shift it's iPhone manufacturing to India.",
                "Will nothing happen again?",
                "They did not need much\nhttps://youtu.be/p-iNWaBZ3-w?si=ARE0sSsJ8sV36Z6A"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "1 dead in mass casualty event after boat crashes into Clearwater Ferry in Florida",
            "external_url": "https://abcnews.go.com/US/1-dead-mass-casualty-event-after-boat-crashes/story?id=121228624",
            "upvotes": 458,
            "date": "04/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/51ad0ff9-c73e-4df1-b8bd-c88816e7c300/ferry-crash-mo_1745854564230_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">\"The boat that fled the scene has been identified by another law enforcement agency,\" Clearwater PD said. However, further details about the second vessel involved in the incident have not yet been made available.\n\nFled the scene? I've never heard of a nautical hit and run outside of combat. Hope they catch them.",
                "Casualty means injuries and deaths.",
                "Not trying to start something, just an actual question. How is 1 dead considered a mass casualty?",
                "How can it be mass casualty and 1 person dead?",
                "It’s not a mass casualty event if only one person died. Just saying. \n\nEdit- I’m a dummy , and wrong. ",
                "Mass casualty and 1 dead... isnt that an oxymoron?",
                "Does the author not understand what a “mass casualty event” is?"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Russia declares a ceasefire in Ukraine on May 8-10 for WWII Victory Day",
            "external_url": "https://www.ctvnews.ca/world/russia-ukraine-war/article/putin-declares-3-day-may-ceasefire-to-mark-80-years-since-world-war-two-victory/",
            "upvotes": 480,
            "date": "04/28/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/22AAO7EPNFVKCOCKKVHELYQC6Q.jpg?smart=true&auth=0608258ac555185dd8cf1d8c67126a4505fc20dc0f5b125fe7dded3ce850cc32&width=1200&height=630",
            "top_comments": [
                "I’m sure Russia won’t violate that.",
                "A ceasefire is a two sided agreement and cannot be declared by only one side.",
                "Russia declares a 3-day \"Please don't shoot at us while we strategically reposition\" ceasefire.",
                "Translation: \"We'll attack on May 8-10\"",
                "So May 8-10 he plans to bomb the shit out of Kyiv",
                "How about they declare that they are backing out and no longer attacking the Ukraine instead?",
                "Russia’s ceasefire declarations are about as useful as Trump executive orders..",
                "20 $ says they stage a very public attack on themselves to boost recruitment.",
                "This is 100% how you tell for certain russia is the sole aggressor here. They didn't ask or request or negotiate for a cease fire. They just declared it.",
                "A ceasefire so Putin can have his damn parade unhindered. I hope Zelenskyy ignores it."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Suspect arrested in Homeland Security Secretary Noem’s purse theft",
            "external_url": "https://apnews.com/article/kristi-noem-homeland-security-robbed-suspect-arrest-874c3933f1d59873c0225d737d3dae5a",
            "upvotes": 1461,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Didn’t she say that anyone carrying over $1,500 cash was a drug dealer?",
                "I have questions....\n\n* Who carries $3K cash in their purse\n* Who puts a Gucci purse with $3K on the floor in a restaurant\n* How can  a masked man get close enough without the secret service noticing\n\n\"this happens all the time to people\"",
                "If you believe for even one second that an illegal immigrant stole her purse, I have a bridge to sell you.",
                "\"There was no indication of criminal charges being filed against the suspect as of Sunday\"  \nNo charges? I am pretty sure if he really took the purse, they would be filling charges to the fullest extent of the law. I guess since they say that he is an illegal alien, that would give him the due process they want to skip!",
                "I’ve never seen the police care so much about recovering a working girls purse. ",
                "Convenient that the perp who somehow stole her purse while Secret Service was present was “illegal”.  I’m calling Shenanigans on this fake ass story.",
                "Despite the perp's background or history...our fucking HOMELAND SECURITY secretary couldn't even keep her purse secure inside a posh restaurant.\n\nAbsolutely on-brand for this Administration.",
                "Exactly how did an illegal immigrant get access to an upscale restaurant, then get close enough to the Director of Homeland Security, and finally close enough to snatch the purse that was near enough to her body that she could have been stabbed in the throat? Does her Secret Service want her dead?",
                "If you can't manage your bag at a restaurant, you can manage a country.",
                "Lemme guess; it was an undocumented immigrant that somehow snuck past her security, and grabbed the purse without anyone seeing."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Large parts of Spain and Portugal hit by power outage",
            "external_url": "https://news.sky.com/story/large-parts-of-spain-and-portugal-hit-by-power-outage-13357374",
            "upvotes": 1945,
            "date": "04/28/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-madrid-outage-power_6899771.jpg?20250428130329",
            "top_comments": [
                "I confirm from Spain that light and Internet is coming back. It was great going back to 1900 xD",
                "I knew something was up when 10 out of 16 people in my online lobby simultaneously had a disconnect and didn't come back",
                "In Portugal at least it’s the entire country (continental) as far as it’s being reported. All major cities all out of power. Cell service was out for 10min after the outage but it’s back now, even if a bit iffy. \nI’ve read a lot of conflicting reports, some say it’s also affecting Germany, France, Poland and Greece.. but can’t find anything from those countrie’s press to confirm it\n\nEdit: Euronews confirming parts of France also affected.\n\nEdit2: Portuguese governament considers the possibility of it being a result of a cyberattack\n\nEdit3: No reports from Germany, Poland or Greece as previously stated. For some reason Portuguese media insisted on that but backtracked now.\n\nEdit4: islands were not affected",
                "Portugal is on total blackout. How is Spain and other countries?",
                "At the Lisbon airport and power appears to have come back on now. Although rental car kiosks are still offline.",
                "If that was a cyber attack, it would make it a frightening test run.",
                "Hopefully the backup generators kicked in quickly in hospitals. Probably scary anyway - hopefully all backup systems were/are properly maintained.",
                "What caused that terrible incident?",
                "Just highlights our worrying over reliance on such a fragile system, hope shit gets sorted ASAP! 🙏🏼",
                "Are there any maps on which parts were affected?"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "[CNN] Conclave to elect Pope Francis’ successor set to start on May 7, Vatican source says",
            "external_url": "https://www.cnn.com/2025/04/28/europe/conclave-start-date-intl/index.html",
            "upvotes": 627,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-28t101618z-1483844028-rc2w6ea31ehm-rtrmadp-3-pope-succession-cardinals.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Which country does Ralph Fiennes represent? 🤔 ",
                "Mel Kiper gonna Ave another meltdown ?",
                "*NFL Draft tone plays*\n\n“With the first pick of the 2025 Papal Draft, the Vatican picks…Shadeur Sanders!”",
                "It’s a shame this isn’t televised.  Make it like Eurovision",
                "As with US jury duty there will be some guys stretching it out solely for the free lunches.",
                "How does one drink for this? Is it like the Kentucky Derby where we all make hats?",
                "Who is going to run the Papal and vatican until then?",
                "Bong rips shall ensue. Hence the smoke.",
                "I have a feeling the next pope is gonna be super conservative. ",
                "Do they use Highlander rules? Is Vance going to be pope now?"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Dozens of African migrants killed in US strike on Yemen, Houthis say",
            "external_url": "https://www.bbc.com/news/articles/c9qw274w72vo",
            "upvotes": 888,
            "date": "04/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4e43/live/54aedf50-23fd-11f0-9060-674316cb3a1f.jpg",
            "top_comments": [
                "It's true, Hegseth air dropped me the plans",
                "Terrible. Given the Houthi's attitudes towards African migrants I am guessing these people were enslaved there. I wish wealthy countries would attempt to rescue people in these situations instead of bombing them.",
                "Don't believe anything the Houthis say.",
                "[removed]",
                "They are probably counting this as a bonus.",
                "[removed]",
                "“Preemptive Deportation”-Karoline Leavitt",
                "[removed]"
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "NEW",
            "title": "Mob chased Brooklyn woman after mistaking her for protester at speech by Israeli security minister",
            "external_url": "https://apnews.com/article/itamar-bengvir-brooklyn-mob-woman-chased-090da170e8800307c54e2520320f6a2c",
            "upvotes": 12223,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Absolutely nuts \n\n> NEW YORK (AP) — A Brooklyn woman said she feared for her life as she was chased, kicked, spit at and pelted with objects by a mob of Orthodox Jewish men who mistook her as a participant in a protest against Israel’s far-right security minister.\n\n-\n\n> The woman, a neighborhood resident in her 30s, told The Associated Press she learned of the protest after hearing police helicopters over her apartment. She walked over to investigate around 10:30 p.m. but by then the protest had mostly disbursed. Not wanting to be filmed, she covered her face with a scarf.\n\n>“As soon as I pulled up my scarf, a group of 100 men came over immediately and encircled me,” said the woman, who spoke to the AP on the condition of anonymity because she feared for her safety.\n\n>‘I had nowhere to go’\n\n>“They were shouting at me, threatening to rape me, chanting ‘death to Arabs.’ I thought the police would protect me from the mob, but they did nothing to intervene,” she said.\n\n>As the chants grew in intensity, a lone police officer tried to escort her to safety. They were followed for blocks by hundreds of men and boys jeering in Hebrew and English.\n\n>Video shows two of the men kicking her in the back, another hurling a traffic cone into her head and a fourth pushing a trash can into her.\n\n>“This is America,” one of the men can be heard saying. “We got Israel. We got an Army now.”\n\n>At one point, she and the police officer were nearly cornered against a building, the video shows.\n\n>“I felt sheer terror,” the woman recalled. “I realized at that point that I couldn’t lead this mob of men to my home. I had nowhere to go. I didn’t know what to do. I was just terrified.”",
                "Remember that time in LA on miami beach with the shooting when both thought the other side were palestinians",
                "Not a single arrest has been made as far as I know. This country is a fucking shithole.",
                "Ah yes, the pro-first amendment right of...harassing a lady because of racism",
                "Holy shit after all of that she was just an innocent bystander? Imagine if that cop wasn’t there.",
                "They saw a lone woman and zeroed in on her. Shows them for what they are...women hating bastards.\n\nFortunately that cop did what he should do, protected her. Shame there weren't other cops to assist.",
                "Now picture that happening the other way around. You´d never hear the end of it, and dozens of people would have been arrested by now.",
                "What they engaged in is unequivocally terrorism. Mob behavior has no place in a civilized society.",
                "Remember when a violent pro-Israeli mob attacked UCLA student protesters with weapons, tear gas and fireworks while police just stood back for hours?  Nothing happened then either... well, Biden condemned the pro-Palestinian protesters the following day but that was it.\n\nIt's absolutely nuts how biased this shit is. If the roles were reversed, it would be called domestic terrorism and the national guard would be activated.",
                "The fuck is going on over there?? \n\nIf jail time isn't in all their futures then something is deeply wrong."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "All Joann Fabric and Craft store locations to close by end of May",
            "external_url": "https://www.live5news.com/2025/04/28/all-joann-fabric-craft-store-locations-close-by-end-may/",
            "upvotes": 658,
            "date": "04/28/2025",
            "thumbnail": "https://gray-wcsc-prod.gtv-cdn.com/resizer/v2/XK46E4Z7JZE4ZKDB3NCY4BZIZA.jpg?auth=9d580f4daf716e14a5c7f9f6fbe3aaa51561aba9e16d90e63e3dcde6b189560f&width=1200&height=600&smart=true",
            "top_comments": [
                "Private equity ruins yet another business.",
                "Bye Joann's, you were my go to fabric and notions store. Now where am I supposed to go?",
                "When billionaires destroy to create monopoly everything comes from Amazon.",
                "Their going out of business prices were worse then some stores normal prices",
                "Reading they got Toys R Us’ed. Bought specifically so they can be bankrupted and their assets sold off.",
                "Man, I used to enjoy going there with my mom.",
                "Are there any craft stores that aren’t super Christian now?",
                "Still mourning the loss of AC Moore.\n\nPS- Michaels sucks. Wish there was a better alternative.",
                "This is a terrible day for America, and therefore, the world.",
                "I always felt Joann and Micheal’s should have gotten together. Seemed a destined relationship built on love, arts and crafts. I can only assume they met, and maybe didn’t click. But my guess is they were in-love, but stayed with their original partners because of their undying loyalty. Such is life. Who knows, maybe later in life they find each other again, this time single, and able to craft the last days of their lives together. Now that’s art!"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Military incursion imminent according to Pakistan",
            "external_url": "https://www.reuters.com/world/pakistan-defence-minister-says-military-incursion-by-india-is-imminent-2025-04-28/",
            "upvotes": 1428,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Asif said Pakistan was on high alert and that it would only use its arsenal of nuclear weapons if \"there is a direct threat to our existence\"\n\nI was not expecting them to talk about the possibility of using them, thats even more terrifying",
                "There is no two countries more prepared to not nuke each other.",
                "Hopefully it'll be just some isolated border skirmish but we have no idea how wide a flashpoint can spread at this point. I'm actually more concerned about the water rights fight. That one can be an existential battle and with nukes on both sides, it's going to be a nail biter.",
                "The headline has been updated for clarity:\n\n>Pakistan defence minister says military incursion **by India** is imminent\n\n(just in case anyone thought the Pakistan defence minister was announcing attack plans)",
                "Who would have thought this would happen.  2025 is definitely going into the history book as a very effed up year and we are only in april.",
                "This decade fucking sucks.",
                "From the Article: \n\n>ISLAMABAD, April 28 (Reuters) - Pakistan's defence minister said on Monday that a military incursion by neighbouring India was imminent in the aftermath of a deadly militant attack on tourists in Kashmir last week, as tensions rise between the two nuclear-armed nations.......\n\nOddly, the fact that this is the same defense minister who candidly admitted on SkyNews recently to Pakistan being a terror-hub for over 30 years, makes it slightly more credible that there will be a reprisal for the terrorist attack in India. \n\nUnless of course, the terrorist hub is eliminated within Pakistan, and the indicted parties extradited for trials.\n\nHard sell. But, better than war, with high chance of falling nukes.",
                "Now if this escalates into a full blown conflict that's really going to put a dent in Apple's plans to shift it's iPhone manufacturing to India.",
                "Will nothing happen again?",
                "They did not need much\nhttps://youtu.be/p-iNWaBZ3-w?si=ARE0sSsJ8sV36Z6A"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "[CNN] Conclave to elect Pope Francis’ successor set to start on May 7, Vatican source says",
            "external_url": "https://www.cnn.com/2025/04/28/europe/conclave-start-date-intl/index.html",
            "upvotes": 627,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-28t101618z-1483844028-rc2w6ea31ehm-rtrmadp-3-pope-succession-cardinals.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Which country does Ralph Fiennes represent? 🤔 ",
                "Mel Kiper gonna Ave another meltdown ?",
                "*NFL Draft tone plays*\n\n“With the first pick of the 2025 Papal Draft, the Vatican picks…Shadeur Sanders!”",
                "It’s a shame this isn’t televised.  Make it like Eurovision",
                "As with US jury duty there will be some guys stretching it out solely for the free lunches.",
                "How does one drink for this? Is it like the Kentucky Derby where we all make hats?",
                "Who is going to run the Papal and vatican until then?",
                "Bong rips shall ensue. Hence the smoke.",
                "I have a feeling the next pope is gonna be super conservative. ",
                "Do they use Highlander rules? Is Vance going to be pope now?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Large parts of Spain and Portugal hit by power outage",
            "external_url": "https://news.sky.com/story/large-parts-of-spain-and-portugal-hit-by-power-outage-13357374",
            "upvotes": 1953,
            "date": "04/28/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-madrid-outage-power_6899771.jpg?20250428130329",
            "top_comments": [
                "I confirm from Spain that light and Internet is coming back. It was great going back to 1900 xD",
                "I knew something was up when 10 out of 16 people in my online lobby simultaneously had a disconnect and didn't come back",
                "In Portugal at least it’s the entire country (continental) as far as it’s being reported. All major cities all out of power. Cell service was out for 10min after the outage but it’s back now, even if a bit iffy. \nI’ve read a lot of conflicting reports, some say it’s also affecting Germany, France, Poland and Greece.. but can’t find anything from those countrie’s press to confirm it\n\nEdit: Euronews confirming parts of France also affected.\n\nEdit2: Portuguese governament considers the possibility of it being a result of a cyberattack\n\nEdit3: No reports from Germany, Poland or Greece as previously stated. For some reason Portuguese media insisted on that but backtracked now.\n\nEdit4: islands were not affected",
                "Portugal is on total blackout. How is Spain and other countries?",
                "At the Lisbon airport and power appears to have come back on now. Although rental car kiosks are still offline.",
                "If that was a cyber attack, it would make it a frightening test run.",
                "Hopefully the backup generators kicked in quickly in hospitals. Probably scary anyway - hopefully all backup systems were/are properly maintained.",
                "What caused that terrible incident?",
                "Just highlights our worrying over reliance on such a fragile system, hope shit gets sorted ASAP! 🙏🏼",
                "Are there any maps on which parts were affected?"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Suspect arrested in Homeland Security Secretary Noem’s purse theft",
            "external_url": "https://apnews.com/article/kristi-noem-homeland-security-robbed-suspect-arrest-874c3933f1d59873c0225d737d3dae5a",
            "upvotes": 1460,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Didn’t she say that anyone carrying over $1,500 cash was a drug dealer?",
                "I have questions....\n\n* Who carries $3K cash in their purse\n* Who puts a Gucci purse with $3K on the floor in a restaurant\n* How can  a masked man get close enough without the secret service noticing\n\n\"this happens all the time to people\"",
                "If you believe for even one second that an illegal immigrant stole her purse, I have a bridge to sell you.",
                "\"There was no indication of criminal charges being filed against the suspect as of Sunday\"  \nNo charges? I am pretty sure if he really took the purse, they would be filling charges to the fullest extent of the law. I guess since they say that he is an illegal alien, that would give him the due process they want to skip!",
                "I’ve never seen the police care so much about recovering a working girls purse. ",
                "Convenient that the perp who somehow stole her purse while Secret Service was present was “illegal”.  I’m calling Shenanigans on this fake ass story.",
                "Despite the perp's background or history...our fucking HOMELAND SECURITY secretary couldn't even keep her purse secure inside a posh restaurant.\n\nAbsolutely on-brand for this Administration.",
                "Exactly how did an illegal immigrant get access to an upscale restaurant, then get close enough to the Director of Homeland Security, and finally close enough to snatch the purse that was near enough to her body that she could have been stabbed in the throat? Does her Secret Service want her dead?",
                "If you can't manage your bag at a restaurant, you can manage a country.",
                "Lemme guess; it was an undocumented immigrant that somehow snuck past her security, and grabbed the purse without anyone seeing."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "1 dead in mass casualty event after boat crashes into Clearwater Ferry in Florida",
            "external_url": "https://abcnews.go.com/US/1-dead-mass-casualty-event-after-boat-crashes/story?id=121228624",
            "upvotes": 463,
            "date": "04/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/51ad0ff9-c73e-4df1-b8bd-c88816e7c300/ferry-crash-mo_1745854564230_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">\"The boat that fled the scene has been identified by another law enforcement agency,\" Clearwater PD said. However, further details about the second vessel involved in the incident have not yet been made available.\n\nFled the scene? I've never heard of a nautical hit and run outside of combat. Hope they catch them.",
                "Casualty means injuries and deaths.",
                "Not trying to start something, just an actual question. How is 1 dead considered a mass casualty?",
                "How can it be mass casualty and 1 person dead?",
                "It’s not a mass casualty event if only one person died. Just saying. \n\nEdit- I’m a dummy , and wrong. ",
                "Mass casualty and 1 dead... isnt that an oxymoron?",
                "Does the author not understand what a “mass casualty event” is?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Mob chased Brooklyn woman after mistaking her for protester at speech by Israeli security minister",
            "external_url": "https://apnews.com/article/itamar-bengvir-brooklyn-mob-woman-chased-090da170e8800307c54e2520320f6a2c",
            "upvotes": 12220,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Absolutely nuts \n\n> NEW YORK (AP) — A Brooklyn woman said she feared for her life as she was chased, kicked, spit at and pelted with objects by a mob of Orthodox Jewish men who mistook her as a participant in a protest against Israel’s far-right security minister.\n\n-\n\n> The woman, a neighborhood resident in her 30s, told The Associated Press she learned of the protest after hearing police helicopters over her apartment. She walked over to investigate around 10:30 p.m. but by then the protest had mostly disbursed. Not wanting to be filmed, she covered her face with a scarf.\n\n>“As soon as I pulled up my scarf, a group of 100 men came over immediately and encircled me,” said the woman, who spoke to the AP on the condition of anonymity because she feared for her safety.\n\n>‘I had nowhere to go’\n\n>“They were shouting at me, threatening to rape me, chanting ‘death to Arabs.’ I thought the police would protect me from the mob, but they did nothing to intervene,” she said.\n\n>As the chants grew in intensity, a lone police officer tried to escort her to safety. They were followed for blocks by hundreds of men and boys jeering in Hebrew and English.\n\n>Video shows two of the men kicking her in the back, another hurling a traffic cone into her head and a fourth pushing a trash can into her.\n\n>“This is America,” one of the men can be heard saying. “We got Israel. We got an Army now.”\n\n>At one point, she and the police officer were nearly cornered against a building, the video shows.\n\n>“I felt sheer terror,” the woman recalled. “I realized at that point that I couldn’t lead this mob of men to my home. I had nowhere to go. I didn’t know what to do. I was just terrified.”",
                "Remember that time in LA on miami beach with the shooting when both thought the other side were palestinians",
                "Not a single arrest has been made as far as I know. This country is a fucking shithole.",
                "Ah yes, the pro-first amendment right of...harassing a lady because of racism",
                "Holy shit after all of that she was just an innocent bystander? Imagine if that cop wasn’t there.",
                "They saw a lone woman and zeroed in on her. Shows them for what they are...women hating bastards.\n\nFortunately that cop did what he should do, protected her. Shame there weren't other cops to assist.",
                "Now picture that happening the other way around. You´d never hear the end of it, and dozens of people would have been arrested by now.",
                "What they engaged in is unequivocally terrorism. Mob behavior has no place in a civilized society.",
                "Remember when a violent pro-Israeli mob attacked UCLA student protesters with weapons, tear gas and fireworks while police just stood back for hours?  Nothing happened then either... well, Biden condemned the pro-Palestinian protesters the following day but that was it.\n\nIt's absolutely nuts how biased this shit is. If the roles were reversed, it would be called domestic terrorism and the national guard would be activated.",
                "The fuck is going on over there?? \n\nIf jail time isn't in all their futures then something is deeply wrong."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "Russia declares a ceasefire in Ukraine on May 8-10 for WWII Victory Day",
            "external_url": "https://www.ctvnews.ca/world/russia-ukraine-war/article/putin-declares-3-day-may-ceasefire-to-mark-80-years-since-world-war-two-victory/",
            "upvotes": 484,
            "date": "04/28/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/22AAO7EPNFVKCOCKKVHELYQC6Q.jpg?smart=true&auth=0608258ac555185dd8cf1d8c67126a4505fc20dc0f5b125fe7dded3ce850cc32&width=1200&height=630",
            "top_comments": [
                "I’m sure Russia won’t violate that.",
                "A ceasefire is a two sided agreement and cannot be declared by only one side.",
                "Russia declares a 3-day \"Please don't shoot at us while we strategically reposition\" ceasefire.",
                "Translation: \"We'll attack on May 8-10\"",
                "So May 8-10 he plans to bomb the shit out of Kyiv",
                "How about they declare that they are backing out and no longer attacking the Ukraine instead?",
                "Russia’s ceasefire declarations are about as useful as Trump executive orders..",
                "20 $ says they stage a very public attack on themselves to boost recruitment.",
                "This is 100% how you tell for certain russia is the sole aggressor here. They didn't ask or request or negotiate for a cease fire. They just declared it.",
                "A ceasefire so Putin can have his damn parade unhindered. I hope Zelenskyy ignores it."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Dozens of African migrants killed in US strike on Yemen, Houthis say",
            "external_url": "https://www.bbc.com/news/articles/c9qw274w72vo",
            "upvotes": 889,
            "date": "04/28/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4e43/live/54aedf50-23fd-11f0-9060-674316cb3a1f.jpg",
            "top_comments": [
                "It's true, Hegseth air dropped me the plans",
                "Terrible. Given the Houthi's attitudes towards African migrants I am guessing these people were enslaved there. I wish wealthy countries would attempt to rescue people in these situations instead of bombing them.",
                "Don't believe anything the Houthis say.",
                "[removed]",
                "They are probably counting this as a bonus.",
                "[removed]",
                "“Preemptive Deportation”-Karoline Leavitt",
                "[removed]"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Shooting at North Carolina university leaves 1 dead, 6 injured",
            "external_url": "https://edition.cnn.com/2025/04/27/us/ecsu-shooting-nc-elizabeth-city/index.html",
            "upvotes": 2810,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/screen-shot-2025-04-27-at-5-26-08-pm.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Just a daily thing now. I can’t remember any of them anymore due to the high volume",
                "Start calling them American blood offerings at this point.",
                "Uvalde went like 70% for Trump. This shit will NEVER change until the constitution is changed",
                "Why is there zero information on the actual shooting?",
                "[removed]",
                "And the rest of the world doesn’t have this nonstop problem that the USA has why??? 🤷‍♂️",
                "Again?\n\nThats how many shootings since Columbine and no sensible gun laws?",
                "Guess it’s getting warmer out. Time for our yearly summer sacrifice.",
                "Are we great again, again, yet?",
                "I remember my school shooting. It was two years ago. I don’t think anyone remembers which one it was. That’s a sad reality."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/28/2025 16:10:40 UTC"
}