{
    "posts": [
        {
            "category": "HOT",
            "title": "US IRS planning to rescind Harvard's tax-exempt status",
            "external_url": "https://www.reuters.com/world/us/us-irs-planning-rescind-harvards-tax-exempt-status-cnn-reports-2025-04-16/",
            "upvotes": 19538,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is going to be drawn out in court for a long time. Harvard isn't likely to back down.",
                "Isn't it illegal for the president to get the IRS to do that?\n\n\"Prohibition on executive branch influence over taxpayer audits and other investigations\"\n\n[Stated here](https://www.law.cornell.edu/uscode/text/26/7217)",
                "All is fair then when the shoe is on the other foot...every church that participated in preaching about voting (at all for anyone) should lose their tax exempt status too",
                "That's great! That means the next time we have a democratic president in we can just start pulling the tax exempt status of churches right? Just whomever we don't like?",
                "Remember when conservatives cried persecution because the IRS showed extra scrutiny to conservative groups based on keyword usage? (The IRS also did the same for liberal groups as well but conservatives just ignored that since it didn't support their worldview)",
                "How about megachurches next?",
                "Harvard may know some lawyers who can represent them in court.",
                "\"The essence of fascism is to make laws forbidding everything and then enforce them selectively against your enemies.\" - John Lescroart, A Plague of Secrets.",
                "Oh, good.  The dollar is collapsing, U.S. bonds are becoming more unstable and disfavored globally every day, stock market volatility is off the charts with every indication that the bottom is going to fall out, the FED chairman just cautioned that Trump's tariffs are putting the country on track for devastating stagflation ... and instead of dealing with any of this the White House is hyper-focused on abusing the power of the federal government to exact petty retributions against perceived political enemies.  Any Trump supporters want to defend this daily shitshow?",
                "I hope Harvard doesn't blink, here. Stand up for yourselves. Stand up for all of us."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Trump administration plans to end the IRS Direct File program for free tax filing, AP sources say",
            "external_url": "https://apnews.com/article/irs-direct-file-tax-returns-free-trump-4bb0bca02fab9b3d06ae6f45ac67b7ab",
            "upvotes": 27393,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*\"Republican lawmakers and commercial tax preparation companies complained it was a waste of taxpayer money\"*  \n\nThe places that are making money from filing taxes and selling peoples information are saying it's a waste of taxpayer money.   As a taxpayer I disagree with them.",
                "“We want the worst for everyone!”\n\n“We are just plain evil”",
                "What if I just don't do my taxes correctly like him?",
                "> The program developed during Joe Biden’s presidency was credited by users with making tax filing easy, fast and economical. But Republican lawmakers and commercial tax preparation companies complained it was a waste of taxpayer money because free filing programs already exist, although they are hard to use.\n\nPeople who like this software: users\n\nPeople who don’t: Republican lawmakers and tax preparation software companies (TurboTax)\n\nPick a side, folks.",
                "MAGA : Let's remove DirectFile, which people like and makes sense.\n\nMAGA : Let's not go after TurboTax though, which is outright scamming us.",
                "Every decision, the benefit of our enemies.",
                "I filed my taxes with this in less than 30 minutes and got my return in less than week. Obviously its a terrible inefficient program that needs to go. /s",
                "It cost $100 to file taxes under H&R Block services. That is insane when the IRS already has our information! It’s ridiculous.",
                "I wonder how much Intuit and H&R Block paid for this. It doesn't help anyone but them to get rid of this service.",
                "Been using freetaxusa"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "California the 1st state to sue Trump administration over tariffs",
            "external_url": "https://www.cbc.ca/news/world/california-newsom-trump-tariffs-1.7511493",
            "upvotes": 26356,
            "date": "04/16/2025",
            "thumbnail": "https://i.cbc.ca/1.7511588.1744814544!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_1180/usa-trump.JPG?im=Resize%3D620",
            "top_comments": [
                "Makes a lot of sense. Out of the 50 states, California has the largest economy — the tariffs would significantly impact the golden state",
                "Here's to hoping he gets a preliminary injunction. The Supreme Court will side with Trump in the end, but not if Republicans finally grow a spine and help pass a bill that limits Trump's powers.",
                "LETS GO Washington, Oregon, Illinois... get on board with this.",
                "California is getting specifically targeted/fucked by Trump. National parks, tourism, trade, agriculture (the water thing). \n\nMakes me want to not pay my federal taxes. Not like anyone works at the IRS anymore.",
                "As ashamed as I am to be American these days, I'm proud to be a Californian.",
                "Sue his ass for everything at this point",
                "Proud to live in California. Just watched Newsom’s news conference on it. Really good points made. \n\n“President can’t do unlawful things.” Damn right.\n\nETA: Some of the people here don’t know the history of what happens when Cali sues Trump. \n\nCalifornia has brought over 100 lawsuits against Trump—a majority being during Trump 1.0. 15 so far for Trump 2.0. And in many of those, gains have been made. Lawsuits can work and do work. So it’s not a waste of time for them to be doing this. If anything they’ve fired the first shot, other states will hopefully follow.",
                "Looks like California is tired of subsidizing red states…",
                "The thing I'm worried about is Trump losing and just saying \"No, the tariffs remain.\"\n\nThe SCOTUS needs to force him to comply, it seems, and they haven't done that yet.",
                "Why doesn't Newsom just hold a presser and call Trump a huge cunt? "
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Congestion pricing is working': MTA says tolls keeping 82k drivers a day out of Manhattan",
            "external_url": "https://gothamist.com/news/congestion-pricing-is-working-mta-says-tolls-keeping-82k-drivers-a-day-out-of-manhattan?utm_source=sfmc&utm_medium=nypr-email&utm_campaign=Gothamist+Daily+Newsletter&utm_term=https%3a%2f%2fgothamist.com%2fnews%2fcongestion-pricing-is-working-mta-says-tolls-keeping-82k-drivers-a-day-out-of-manhattan&utm_id=437122&sfmc_id=53418894&utm_content=2025414&nypr_member=True",
            "upvotes": 2968,
            "date": "04/17/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/349119/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "Wait…What happened to “congestion pricing is dead. Long live the king!”?",
                "I was just in the city the other week and the amount of cars was WAY down. It was noticable. But you know what? The town was still busy as hell and taxis, subways and busses were moving right along. The people that needed or wanted to be there were there.",
                "For me driving in Manhattan was enough to keep me from driving in Manhattan. What a nightmare.",
                "Wait, it's working? I assume Trump will immediately try to end it.",
                "The Trump administration literally just wants to undo everything good, it's fucking disgusting",
                "I was pissed when I heard about this being implemented, being an out-of-towner going to NYC is already an expensive affair with all the tolled highways, bridges and tunnels. But it was the first time ever that I was able to drive into Manhattan and not feel like I was suffocating in traffic. I was even able to find free parking on like 48th st. Nuts.\n\nThis has my full support.",
                "As a person who drives a car (and isn't made of money), I hate the idea of congestion pricing.\n\nAs a person who hates traffic and doesn't like pollution, I love the idea of congestion pricing.\n\nI've got mixed feelings about it, but if it works it works I suppose?",
                "I just hope that the MTA uses this money wisely.",
                "Ongoing case: [https://www.courtlistener.com/docket/69652290/metropolitan-transportation-authority-v-duffy/](https://www.courtlistener.com/docket/69652290/metropolitan-transportation-authority-v-duffy/)\n\nOne of at least 195 against this administration ... [https://www.justsecurity.org/107087/tracker-litigation-legal-challenges-trump-administration/](https://www.justsecurity.org/107087/tracker-litigation-legal-challenges-trump-administration/)",
                "In this thread: People who either dont live in NYC or have never been clutching their pearls worried about this \"affecting the working classs\""
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "Harvard researchers say they might have to lay off workers and euthanize research animals due to funding freeze",
            "external_url": "https://www.wxow.com/news/national/harvard-researchers-say-they-might-have-to-lay-off-workers-and-euthanize-research-animals-due/article_90bd9ea0-e8f5-55d4-ab2d-8c96b6e85915.html",
            "upvotes": 2491,
            "date": "04/16/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/wxow.com/content/tncms/assets/v3/editorial/3/63/3639369c-7d7d-5b2e-b34b-dbabc632507b/68002f01b8ab8.image.jpg?crop=1600%2C840%2C0%2C113&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "If they have to euthanize animals I vote they do it right in front of the White House, make it known this is something Trump is forcing them to do, make it public",
                "The science and learning don't matter. Only hate.... Welcome to Trump's America",
                "The shit stain country gets shit stainier every day",
                "Lots of people here clearly don't know how endowments work.",
                "i will take the animals :(",
                "Wait, why is euthanizing the first solution?",
                "Harvard has $52 Billion to fight Trump but not enough to maintain researcher employment and protect science assets?",
                "Have the Heritage Foundation bail them out they’re behind all of this.",
                "I mean Havard has a $53 BILLION endowment. I think they can keep this open until trump is out of the white house.",
                "Give us money or the dog gets it."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Missing toddler who walked 7 miles alone through Arizona wilderness led to safety by rancher's dog",
            "external_url": "https://www.nbcnews.com/news/us-news/missing-toddler-walked-7-miles-alone-arizona-wilderness-led-safety-ran-rcna201479?utm_source=firefox-newtab-en-us",
            "upvotes": 5061,
            "date": "04/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250416-arizona-toddler-dog-ch-1033-58c02e.jpg",
            "top_comments": [
                "\n\"I got in my truck to go to town and I see Buford walking down the side of the fence with a little blond kid with him. I had heard about the missing child this morning, so I knew it was him.\"\n\n\nBuford, (best name ever), probably only walked with him about a mile, but the dog did find him.",
                "I hope Buford got a nice treat for being a good boy.",
                "the goodest of good boys.",
                "7 miles for a 2 year old!",
                "Cause dogs are awesome. ",
                "I have a Pyrenees mix (Buford is a full Pyr) and they are one of the smartest and self-sufficient dog breeds.  They can make decisions on their own and I can believe the doggo worked out that the kid shouldn't have been there and that the best thing to do was to lead him home, like a sheep.  They are also hard headed and stubborn, because they believe they are smarter than we are...",
                "It followed me home, dad, can I keep him?",
                "If you watch the video...\n\nRancher: \"Buford... come on...\"\n\nBuford: \"Nah\".\n\n:)\n\nDogs are fucking magical.",
                "I really needed to read a good news story like this.  So happy for the family.  Buford is a good boy.",
                "What were the parents doing and how did he leave his home around 5pm. Either way glad he is safe but what was his parents/guardians doing"
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "HOT",
            "title": "The State Department closes the office that flags disinformation from Russia, China and Iran",
            "external_url": "https://apnews.com/article/rubio-disinformation-russia-china-iran-d53d00551a0a57f3114431c624db0b0f?utm_source=reddit&utm_medium=share",
            "upvotes": 3553,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The only flag the State Department cares about now is the white flag to keep bending over for Russia. This country used to know how to handle traitors.",
                "And you think Russia, China, and Iran will slow down their operations to try shit on us right now? \n\nTrump is dragging us all down.",
                "Everything is going according to plan:\n\n[Ruble Is Top Performing Currency as US Trade War Hits Dollar](https://www.bloomberg.com/news/articles/2025-04-15/ruble-surges-as-best-performing-global-currency-outpacing-gold)",
                "..and Palm Beach County Florida..",
                "I would be surprised but I'm not.",
                "Wonder if anyone on the Right will hear about this.",
                "Mentioned in a related Politico article. On it it links a letter written by Republicans on the House foreign affairs committee condemning the GEC: \n\n\n*For that reason, we had hoped the GEC could carry out its responsibilities while unimpeachably observing the First Amendment, which gives Americans the right to receive foreign propaganda.*\n\nThey are actively arguing that foreign propaganda should be allowed.\n\nhttps://foreignaffairs.house.gov/press-release/mccaul-mast-issa-send-letter-expressing-concerns-with-gec-reauthorization/",
                "cant say theyve been working hard anyway for the past oh... 10 years?...",
                "Yes they're clicking their hobnail boots together wishing away any kind of entity that points out disinformation. Think about it it's in their own best interest to normalize disinformation these are the stepping Stones of authoritarian government. There is a video on YouTube called don't be a sucker from the end of world War II put out by the army people might want to watch.",
                "Pointless anyway. Didn’t flag Trump‘s blatant Russian propaganda at all"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Michelle Trachtenberg died from diabetes complications, medical examiner says",
            "external_url": "https://www.bbc.com/news/articles/cdrg6e2xgj6o",
            "upvotes": 1079,
            "date": "04/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/38bb/live/e0d42320-1b09-11f0-8a1e-3ff815141b98.jpg",
            "top_comments": [
                "She recently had a liver transplant. Liver transplant patients can develop diabetes mellitus as a common post surgical complication. She probably didn't know she had it. Poor Michelle. It's tragic.",
                "I forgot she died and get to be sad all over again",
                ">Officials did not perform a post-mortem examination, but said toxicology tests determined Trachtenberg's cause of death.\n\n  \nI'm not diabetic, and I'm not a doctor, so what would a toxicology report reveal that would lead to this diagnosis?  Was her blood sugar super high or something?",
                "Diabetes has become so commonplace people forget it can absolutely be a complicated and difficult disease for some people. People really seem to consider it a minor illness and it’s really not.",
                "*An unnamed source told NBC News the actress had received a liver transplant before her death. The exact timing or reasoning of the operation is unclear.*\n\nI would guess that the cause of her death is related to this skimpy info.  I can't imagine a toxicology report would that helpful in determining her death unless it were a drug overdose or the like.",
                "Rest in peace, Michelle 💜",
                "Either diabetic keto acidosis (high blood sugar) that came on unknowingly and fast, or possibly a hypoglycemic episode while sleeping seems like.\n\nI am diabetic and have gone through both. DKA undiagnosed and ignored can render you unconscious and dead within hours. A hypo episode could have triggered her passing out and seizing, or simply happened in her sleep. Diabetes/uncontrolled blood sugar is VERY dangerous especially for someone undiagnosed/new to having it.",
                "Damn, she died of beaties."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "JPMorgan Chase sues more customers who allegedly stole cash in 'infinite money glitch'",
            "external_url": "https://www.cnbc.com/2025/04/16/jpmorgan-chase-infinite-money-glitch-bank-lawsuits.html",
            "upvotes": 6709,
            "date": "04/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108065444-1732060726356-gettyimages-2185023708-AFP_36MW3R2.jpeg?v=1732060988&w=1920&h=1080",
            "top_comments": [
                "> JPMorgan is also considering pushing back against the bankruptcy filings of alleged “infinite money” fraudsters.\nIn one of the bank’s motions made this week in bankruptcy court in Grand Rapids, Michigan, the company asked a judge for more time to object to the customer’s attempt to discharge his or her debts.\n\nIt is amazing that people have screwed up their lives and finances for YEARS over a trend they saw online. A ChexSystems blacklist is not a fun thing to deal with.",
                "Check Fraud. They committed check fraud.",
                "I used to work at a bank. It’s amazing how much check fraud is out there and how susceptible young people are to going through with it. \n\nIt’s usually teenagers that get in trouble. Older people give them a bad check to deposit and promise the kids a share of it. Then the adults get 75% or whatever and the kid winds up being on the hook for the whole thing when it bounces. \n\nIt was pretty sad",
                "I mean, if you don’t prosecute every single one of them then some idiot on TikTok will double down and say that this actually worked, and he faced no consequences, and the whole thing will start over again.",
                "With everything going on right now, I had forgotten that a bunch of people had committed check fraud while thinking it was a real world \"infinite money glitch.\" As much as I dislike Chase, I'm glad I got reminded, I needed a smile today.",
                "It's wild to me that people thought the bank wouldn't go after them.",
                "Next time someone tells you about an \"amazing new TikTok hack\" it's probably just crime.",
                "You mean customers who videod themselves doing crimes ?",
                "The “infinite money glitch” sounds like plain old check fraud…",
                "So stupid, you have an account with chase, they have all your information on file. Unless you plan on going off grid forever, otherwise they will find you."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "U.K. Top Court Says Trans Women Are Not Legally Women Under Equality Act",
            "external_url": "https://www.nytimes.com/2025/04/16/world/europe/uk-supreme-court-woman-definition-trans.html?unlocked_article_code=1.AE8.cfzk.pIrpb0-Czz4_&smid=url-share",
            "upvotes": 12839,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> However, he added: “We counsel against reading this judgment as a triumph of one or more groups in our society at the expense of another, it is not.” He said the ruling “does not cause disadvantage to trans people” because they have protections under anti-discrimination and equality laws.\n\n>Lord Hodge began his remarks by acknowledging the national conversation about transgender rights and protections, and described trans people as a “vulnerable and often harassed minority,” while noting that women had fought for centuries for equal rights.\n\n>He added: “It is not the task of this court to make policy on how the interests of these groups should be protected” but “to ascertain the meaning of the legislation which Parliament has enacted.”\n\n  \n   \n   \nSo yeah they’re just interpreting something, it doesn’t mean the Act can’t be changed.",
                "I find it interesting and revealing that the debate is *always* over the definition of \"woman\" and never the definition of \"man\".",
                "For the Americans: Watch how many anti-trans comments pop up, then remember:  \n\n- A teacher in Florida was fired for using a 17 year olds preferred name.\n- Republican lawmakers in Arkansas want to ban children from getting haircuts that “don’t match their gender”\n- A cis woman was fired from her job at Walmart because a male customer followed her into the bathroom and accused her of being trans, all because she happed to be tall for a woman. \n\nAll of this has happened in the last month in America. Normalizing trans hatred will lead to a destruction of all our civil rights. People should be free to dress how they please without fear of being targeted by our government.",
                "> However, he added: “We counsel against reading this judgment as a triumph of one or more groups in our society at the expense of another, it is not.” \n\nTOO LATE, it is already here. \n\nWe will be flooded with \"the great vitory of the common sense\" from thousands and thousands of news site, propagandas, and pundits. \n\nAnd there will be counter fire from opposite position.",
                "This will age as well as what the UK did to Alan Turing.",
                "Someone once said. \"Let it be\". Nowadays some people just won't let it be. Sad times.",
                "When are we going to properly talk about sex v gender.   They are being exchanged so readily with little understanding. I recall a man on LBC happily declaring there are only two genders because you are born that way. 🤔",
                "Massive blow to feminism. This ruling will be used to persecute women of all presentations and genders. Cisgendered women who don’t fit into the narrow box of “woman” will be harassed and oppressed double fold.",
                "Even biology says that sex isn't binary. \n\nI swear, Canada is one of the few English-speaking countries hanging on for dear life against right-wing takeover. Decades of right-wing/neoliberal policies and austerity have made England a hollow shell of its former self and impoverished it outside of London. Starmer is supposed to be a labour politician, but he's doing things like decreasing support for disabled people. Mind you, I'm not sitting on my high horse here in Canada. We were (and still could be pending the election) dangerously close to following the same right-wing path if Trump didn't expose it for the load of shit that it actually is.",
                "TERF Island TERFing not even surprised 🤷🏽‍♀️"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Russian IP access federal databases: DOGE breach sparks cybersecurity crisis as Russian IP tries to access Federal Labor Systems, Senate receives urgent complain - The Economic Times",
            "external_url": "https://m.economictimes.com/news/international/us/doge-breach-sparks-cybersecurity-crisis-as-russian-ip-tries-to-access-federal-labor-systems-senate-receives-urgent-complain/articleshow/120350816.cms",
            "upvotes": 29,
            "date": "04/17/2025",
            "thumbnail": "https://img.etimg.com/thumb/msid-120350858,width-1200,height-630,imgsize-105970,overlay-economictimes/articleshow.jpg",
            "top_comments": [
                "I’m sure republicans are very concerned…"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Judge scraps US rule capping credit card late fees at $8",
            "external_url": "https://www.reuters.com/business/finance/judge-scraps-us-rule-capping-credit-card-late-fees-8-2025-04-15/",
            "upvotes": 117,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Just in time for the upcoming recession.",
                "Call me shocked..  let's tank the markets and let banks raise late fees...",
                "Judge Pittman in Fort Worth.\n\nA Trump appointee. Natch.",
                "You Americans always say \"we need guns when the government is coming for us.\"\n\nBruh, every branch of government is coming for your poor ass now.\n\nI am more curious to see some jackass defending the ruling of scraping the cap though.",
                "Are we even going to get a reach around at some point from these Republican dicks? ",
                "Do you think we could start some movement where we just all stop using our credit cards and/or aggressively pay them off as much as possible? IDK, man, I'm out of ideas at this point...",
                "Any and every action possible to fuck over people who are struggling with money.",
                "“A federal judge in Texas” is going to be on our tombstone",
                "Republicans are pure evil. Next they destroy Medicare. Then social security.  ",
                "[https://apnews.com/article/consumer-financial-protection-bureau-lawsuit-fees-6a2e6b913aec0bdfc0d13c7ad329c5c8](https://apnews.com/article/consumer-financial-protection-bureau-lawsuit-fees-6a2e6b913aec0bdfc0d13c7ad329c5c8) Non paywall (I think)."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Arkansas SB 486, a Far-Reaching Anti-Trans \"Bathroom Bounty\" Bill, Heads To The Governor's Desk",
            "external_url": "https://whatyoucandotohelp.org/news/arkansas-sb-486-a-far-reaching-bathroom-bounty-bill-heads-to-the-governor-s-desk/",
            "upvotes": 65,
            "date": "04/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It would be hypocritical of him to sign it.",
                "Everyone go yell at the governor",
                "My boycott of Arkansas will continue. Having never stepped foot in that state… the most they’ll ever see of me is, I’ll drive through or fly over. If I stop, it will be to fill up, or I’ve broken down - much like that state.",
                "It’s not my country but it is kind of sad how a once great country has descended into acrimony over who pees where."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Trade war fallout: Cancellations of Chinese freight ships begin as bookings plummet",
            "external_url": "https://www.cnbc.com/2025/04/16/trade-war-fallout-china-freight-ship-decline-begins-orders-plummet.html",
            "upvotes": 191,
            "date": "04/17/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108084402-1736447375007-gettyimages-2191474671-vcg111538748527.jpeg?v=1744819797&w=1920&h=1080",
            "top_comments": [
                "This is the fault of congress. Trump spent four years with a congress that obeyed his every command and now he and his team just assumed that other nations would bow down also. But, unlike our spineless congress, other nations are not going to destroy themselves just to appease a bully. \n\nUnfortunately, it’s the people of America that will suffer.",
                "We have to be winning now, right?",
                "A total of 80 blank, or canceled, sailings out of China have been recorded by freight company HLS Group. It wrote in a recent note to clients that with the trade war between China and the U.S. leading to a demand plummet, carriers have started to suspend or adjust transpacific services.\n\nThe impact of the diminished freight container traffic to North America will be significant for many links in the economy and supply chain, including the ports and logistics companies moving the freight. If each sailing was carrying 8,000 to 10,000 TEUs (twenty-foot equivalent units), that would equal a decline in freight traffic of between 640,000-800,000 containers, and lead to decreased crane operations at the ports, lower fees that could be collected, and declines in container pick-ups and transports by trucks, rails, and to warehouses for storage.\n\nThe World Trade Organization warned on Wednesday that the outlook for global trade has “deteriorated sharply” in the wake of Trump’s tariffs plan. JB Hunt shares hit their lowest level since November 2020 after commentary during the trucking company’s earnings call about the uncertainty from tariffs.",
                "Glad those longshoremen went on strike and had their union boss cozy up with Trump during the election.",
                "[deleted]",
                "Im in construction and there is a lot of disruption right now in the construction industry with these tariffs. Not even to mention the mass deportations and flat out threats of rendition of Hispanic workers. \n\nTrump is really screwing the pooch.",
                "This can’t be right, China were gonna have to pay all those tariffs and it was gonna make the US a whole bunch of money….  /s"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Telescope finds promising hints of life on distant planet",
            "external_url": "https://www.bbc.co.uk/news/articles/c39jj9vkr34o",
            "upvotes": 18,
            "date": "04/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0b0e/live/6fd33320-16b1-11f0-b1b3-7358f8d35a35.jpg",
            "top_comments": [
                "Guess they need to make an addition to the tariff list",
                "\"Life on distant planet scared earth found thier hints\".",
                "“Quick turn off the lights! They’ll go away”\n\n-life forms on the other planet",
                "Can I move there? I volunteer",
                "Maybe we can ship our illegal immigrants there, too!",
                "Nice, some new destiny to manifest",
                "This is amazing! Can’t believe it"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Salvadoran fugitive convicted in deadly attack of Maryland hiker",
            "external_url": "https://www.cnn.com/2025/04/14/us/rachel-morin-maryland-attacker-convicted",
            "upvotes": 0,
            "date": "04/17/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/shutterstock-editorial-15239350d.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "A tragedy but to be clear, nothing to do with Abrego Garcia despite the Trump administration trying to link the two",
                "This person has had more due process than those we have sent to El Salvador. Keep that in mind.",
                "So actual due process for a criminal; but no due process for someone who is not?",
                "What country this man hails from is of no consequence at all because he could be from any country in the world, and any state in the US, and any county in the US.  A vicious criminal has been caught, tried, and found guilty.  End of news account.",
                "Two pardoned by the felon 1/6ers are being charged with child molestation. How come we don’t hear anything about that by the right wing.",
                "Oh. That makes it okay about that innocent guy then.",
                "You know if we fixed our immigration system where it was easy to get a visa we would reduce the number of people crossing illegally into the country by a large enough amount that we would have more than enough enforcement there to stop the few criminals that would be trying to cross without being checked."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Israel kills dozens in latest Gaza attacks as 500,000 forcibly displaced",
            "external_url": "https://www.aljazeera.com/news/liveblog/2025/4/17/live-israel-kills-dozens-in-new-gaza-attacks-as-500000-forcibly-displaced",
            "upvotes": 315,
            "date": "04/17/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/04/AA-20250416-37647614-37647606-ISRAELI_ATTACKS_ON_GAZA_CONTINUE-1744856463_858511-1744856663.jpg?resize=1200%2C630&quality=80",
            "top_comments": [
                "Ridiculous this is not only being brushed under the rug, but being supported by our governments. Where do they expect these people to go? What about their property, possessions, lives? Disgusting. We're already reaching for the stars and Pandora's box yet we continue to throw stones at one another. Greed and people trying to make a grey world black and white is going to be the end of humanity, and frankly good riddance if this is what we plan to continue doing.",
                "this is getting a worse everday. saw on the news they are running out of food and water in the hospital too.",
                "Israel on point to seeing how many people they can kill before 5he world takes notice",
                "What’s the end game here they just kill everyone ?",
                "I understand how extreme Hamas is and the widespread support it's had in Gaza at different times, but this is no different than the ethnic cleansing of Native Americans by the United States. You can't rationalize this away.\n\nIt's no wonder that historical revisionists like Donald Trump are so defensive of Israel - they want Americans to believe that \"might makes right\" both in the past and in the present.",
                "this is so heartbreaking 💔",
                "....But but internet and Twitter told me in October/November that Kamala would have been worse for Gaza",
                "Nothing going on here just self defense don't be anti-semetic/hamas supporter now move along\n\nEdit: /s"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Michelle Trachtenberg died from diabetes complications, medical examiner says",
            "external_url": "https://www.bbc.com/news/articles/cdrg6e2xgj6o",
            "upvotes": 1071,
            "date": "04/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/38bb/live/e0d42320-1b09-11f0-8a1e-3ff815141b98.jpg",
            "top_comments": [
                "She recently had a liver transplant. Liver transplant patients can develop diabetes mellitus as a common post surgical complication. She probably didn't know she had it. Poor Michelle. It's tragic.",
                "I forgot she died and get to be sad all over again",
                ">Officials did not perform a post-mortem examination, but said toxicology tests determined Trachtenberg's cause of death.\n\n  \nI'm not diabetic, and I'm not a doctor, so what would a toxicology report reveal that would lead to this diagnosis?  Was her blood sugar super high or something?",
                "Diabetes has become so commonplace people forget it can absolutely be a complicated and difficult disease for some people. People really seem to consider it a minor illness and it’s really not.",
                "*An unnamed source told NBC News the actress had received a liver transplant before her death. The exact timing or reasoning of the operation is unclear.*\n\nI would guess that the cause of her death is related to this skimpy info.  I can't imagine a toxicology report would that helpful in determining her death unless it were a drug overdose or the like.",
                "Rest in peace, Michelle 💜",
                "Either diabetic keto acidosis (high blood sugar) that came on unknowingly and fast, or possibly a hypoglycemic episode while sleeping seems like.\n\nI am diabetic and have gone through both. DKA undiagnosed and ignored can render you unconscious and dead within hours. A hypo episode could have triggered her passing out and seizing, or simply happened in her sleep. Diabetes/uncontrolled blood sugar is VERY dangerous especially for someone undiagnosed/new to having it.",
                "Damn, she died of beaties."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Congestion pricing is working': MTA says tolls keeping 82k drivers a day out of Manhattan",
            "external_url": "https://gothamist.com/news/congestion-pricing-is-working-mta-says-tolls-keeping-82k-drivers-a-day-out-of-manhattan?utm_source=sfmc&utm_medium=nypr-email&utm_campaign=Gothamist+Daily+Newsletter&utm_term=https%3a%2f%2fgothamist.com%2fnews%2fcongestion-pricing-is-working-mta-says-tolls-keeping-82k-drivers-a-day-out-of-manhattan&utm_id=437122&sfmc_id=53418894&utm_content=2025414&nypr_member=True",
            "upvotes": 2970,
            "date": "04/17/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/349119/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "Wait…What happened to “congestion pricing is dead. Long live the king!”?",
                "I was just in the city the other week and the amount of cars was WAY down. It was noticable. But you know what? The town was still busy as hell and taxis, subways and busses were moving right along. The people that needed or wanted to be there were there.",
                "For me driving in Manhattan was enough to keep me from driving in Manhattan. What a nightmare.",
                "Wait, it's working? I assume Trump will immediately try to end it.",
                "The Trump administration literally just wants to undo everything good, it's fucking disgusting",
                "I was pissed when I heard about this being implemented, being an out-of-towner going to NYC is already an expensive affair with all the tolled highways, bridges and tunnels. But it was the first time ever that I was able to drive into Manhattan and not feel like I was suffocating in traffic. I was even able to find free parking on like 48th st. Nuts.\n\nThis has my full support.",
                "As a person who drives a car (and isn't made of money), I hate the idea of congestion pricing.\n\nAs a person who hates traffic and doesn't like pollution, I love the idea of congestion pricing.\n\nI've got mixed feelings about it, but if it works it works I suppose?",
                "I just hope that the MTA uses this money wisely.",
                "Ongoing case: [https://www.courtlistener.com/docket/69652290/metropolitan-transportation-authority-v-duffy/](https://www.courtlistener.com/docket/69652290/metropolitan-transportation-authority-v-duffy/)\n\nOne of at least 195 against this administration ... [https://www.justsecurity.org/107087/tracker-litigation-legal-challenges-trump-administration/](https://www.justsecurity.org/107087/tracker-litigation-legal-challenges-trump-administration/)",
                "In this thread: People who either dont live in NYC or have never been clutching their pearls worried about this \"affecting the working classs\""
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "The mysterious firing of a Chinese professor has Asian students on edge: ‘Brings chills to our spines’ | US politics",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/16/chinese-professor-bloomington-indiana",
            "upvotes": 378,
            "date": "04/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1f8bce05a03c92aabccc3a21e478ecf518909baf/0_246_7375_4427/master/7375.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=fcb63289f5d9b7c401a45cc5c4a31b57",
            "top_comments": [
                "*“What is particularly troubling in this case is that Indiana University fired him and his wife without due process, presuming guilt instead of innocence,” Chen says.*\n\nYeah, and fired by email on the very day DHS operatives swooped down upon the campus. No wonder Chinese students are living in fear, and are readying to leave the US on a moment's notice.",
                "US is inevitably going to create a second [Qian Xuesen \\(Tsien Hsue-shen\\)](https://www.galcit.caltech.edu/about/legends-of-galcit/qian-xuesen-tsien-hsue-shen).\n\nFor those out of the loop, China's nuclear program, missile program, and space program only exist because the US accused Dr. Qian of being a communist spy and deported him to China."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Israel kills dozens in latest Gaza attacks as 500,000 forcibly displaced",
            "external_url": "https://www.aljazeera.com/news/liveblog/2025/4/17/live-israel-kills-dozens-in-new-gaza-attacks-as-500000-forcibly-displaced",
            "upvotes": 314,
            "date": "04/17/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/04/AA-20250416-37647614-37647606-ISRAELI_ATTACKS_ON_GAZA_CONTINUE-1744856463_858511-1744856663.jpg?resize=1200%2C630&quality=80",
            "top_comments": [
                "Ridiculous this is not only being brushed under the rug, but being supported by our governments. Where do they expect these people to go? What about their property, possessions, lives? Disgusting. We're already reaching for the stars and Pandora's box yet we continue to throw stones at one another. Greed and people trying to make a grey world black and white is going to be the end of humanity, and frankly good riddance if this is what we plan to continue doing.",
                "this is getting a worse everday. saw on the news they are running out of food and water in the hospital too.",
                "Israel on point to seeing how many people they can kill before 5he world takes notice",
                "What’s the end game here they just kill everyone ?",
                "I understand how extreme Hamas is and the widespread support it's had in Gaza at different times, but this is no different than the ethnic cleansing of Native Americans by the United States. You can't rationalize this away.\n\nIt's no wonder that historical revisionists like Donald Trump are so defensive of Israel - they want Americans to believe that \"might makes right\" both in the past and in the present.",
                "this is so heartbreaking 💔",
                "....But but internet and Twitter told me in October/November that Kamala would have been worse for Gaza",
                "Nothing going on here just self defense don't be anti-semetic/hamas supporter now move along\n\nEdit: /s"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Congestion pricing is working': MTA says tolls keeping 82k drivers a day out of Manhattan",
            "external_url": "https://gothamist.com/news/congestion-pricing-is-working-mta-says-tolls-keeping-82k-drivers-a-day-out-of-manhattan?utm_source=sfmc&utm_medium=nypr-email&utm_campaign=Gothamist+Daily+Newsletter&utm_term=https%3a%2f%2fgothamist.com%2fnews%2fcongestion-pricing-is-working-mta-says-tolls-keeping-82k-drivers-a-day-out-of-manhattan&utm_id=437122&sfmc_id=53418894&utm_content=2025414&nypr_member=True",
            "upvotes": 2965,
            "date": "04/17/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/349119/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "Wait…What happened to “congestion pricing is dead. Long live the king!”?",
                "I was just in the city the other week and the amount of cars was WAY down. It was noticable. But you know what? The town was still busy as hell and taxis, subways and busses were moving right along. The people that needed or wanted to be there were there.",
                "For me driving in Manhattan was enough to keep me from driving in Manhattan. What a nightmare.",
                "Wait, it's working? I assume Trump will immediately try to end it.",
                "The Trump administration literally just wants to undo everything good, it's fucking disgusting",
                "I was pissed when I heard about this being implemented, being an out-of-towner going to NYC is already an expensive affair with all the tolled highways, bridges and tunnels. But it was the first time ever that I was able to drive into Manhattan and not feel like I was suffocating in traffic. I was even able to find free parking on like 48th st. Nuts.\n\nThis has my full support.",
                "As a person who drives a car (and isn't made of money), I hate the idea of congestion pricing.\n\nAs a person who hates traffic and doesn't like pollution, I love the idea of congestion pricing.\n\nI've got mixed feelings about it, but if it works it works I suppose?",
                "I just hope that the MTA uses this money wisely.",
                "Ongoing case: [https://www.courtlistener.com/docket/69652290/metropolitan-transportation-authority-v-duffy/](https://www.courtlistener.com/docket/69652290/metropolitan-transportation-authority-v-duffy/)\n\nOne of at least 195 against this administration ... [https://www.justsecurity.org/107087/tracker-litigation-legal-challenges-trump-administration/](https://www.justsecurity.org/107087/tracker-litigation-legal-challenges-trump-administration/)",
                "In this thread: People who either dont live in NYC or have never been clutching their pearls worried about this \"affecting the working classs\""
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Harvard researchers say they might have to lay off workers and euthanize research animals due to funding freeze",
            "external_url": "https://www.wxow.com/news/national/harvard-researchers-say-they-might-have-to-lay-off-workers-and-euthanize-research-animals-due/article_90bd9ea0-e8f5-55d4-ab2d-8c96b6e85915.html",
            "upvotes": 2492,
            "date": "04/16/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/wxow.com/content/tncms/assets/v3/editorial/3/63/3639369c-7d7d-5b2e-b34b-dbabc632507b/68002f01b8ab8.image.jpg?crop=1600%2C840%2C0%2C113&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "If they have to euthanize animals I vote they do it right in front of the White House, make it known this is something Trump is forcing them to do, make it public",
                "The science and learning don't matter. Only hate.... Welcome to Trump's America",
                "The shit stain country gets shit stainier every day",
                "Lots of people here clearly don't know how endowments work.",
                "i will take the animals :(",
                "Wait, why is euthanizing the first solution?",
                "Harvard has $52 Billion to fight Trump but not enough to maintain researcher employment and protect science assets?",
                "Have the Heritage Foundation bail them out they’re behind all of this.",
                "I mean Havard has a $53 BILLION endowment. I think they can keep this open until trump is out of the white house.",
                "Give us money or the dog gets it."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "The mysterious firing of a Chinese professor has Asian students on edge: ‘Brings chills to our spines’ | US politics",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/16/chinese-professor-bloomington-indiana",
            "upvotes": 377,
            "date": "04/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1f8bce05a03c92aabccc3a21e478ecf518909baf/0_246_7375_4427/master/7375.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=fcb63289f5d9b7c401a45cc5c4a31b57",
            "top_comments": [
                "*“What is particularly troubling in this case is that Indiana University fired him and his wife without due process, presuming guilt instead of innocence,” Chen says.*\n\nYeah, and fired by email on the very day DHS operatives swooped down upon the campus. No wonder Chinese students are living in fear, and are readying to leave the US on a moment's notice.",
                "US is inevitably going to create a second [Qian Xuesen \\(Tsien Hsue-shen\\)](https://www.galcit.caltech.edu/about/legends-of-galcit/qian-xuesen-tsien-hsue-shen).\n\nFor those out of the loop, China's nuclear program, missile program, and space program only exist because the US accused Dr. Qian of being a communist spy and deported him to China."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "The State Department closes the office that flags disinformation from Russia, China and Iran",
            "external_url": "https://apnews.com/article/rubio-disinformation-russia-china-iran-d53d00551a0a57f3114431c624db0b0f?utm_source=reddit&utm_medium=share",
            "upvotes": 3559,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The only flag the State Department cares about now is the white flag to keep bending over for Russia. This country used to know how to handle traitors.",
                "And you think Russia, China, and Iran will slow down their operations to try shit on us right now? \n\nTrump is dragging us all down.",
                "Everything is going according to plan:\n\n[Ruble Is Top Performing Currency as US Trade War Hits Dollar](https://www.bloomberg.com/news/articles/2025-04-15/ruble-surges-as-best-performing-global-currency-outpacing-gold)",
                "..and Palm Beach County Florida..",
                "I would be surprised but I'm not.",
                "Wonder if anyone on the Right will hear about this.",
                "Mentioned in a related Politico article. On it it links a letter written by Republicans on the House foreign affairs committee condemning the GEC: \n\n\n*For that reason, we had hoped the GEC could carry out its responsibilities while unimpeachably observing the First Amendment, which gives Americans the right to receive foreign propaganda.*\n\nThey are actively arguing that foreign propaganda should be allowed.\n\nhttps://foreignaffairs.house.gov/press-release/mccaul-mast-issa-send-letter-expressing-concerns-with-gec-reauthorization/",
                "cant say theyve been working hard anyway for the past oh... 10 years?...",
                "Yes they're clicking their hobnail boots together wishing away any kind of entity that points out disinformation. Think about it it's in their own best interest to normalize disinformation these are the stepping Stones of authoritarian government. There is a video on YouTube called don't be a sucker from the end of world War II put out by the army people might want to watch.",
                "Pointless anyway. Didn’t flag Trump‘s blatant Russian propaganda at all"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Michelle Trachtenberg died from diabetes complications, medical examiner says",
            "external_url": "https://www.bbc.com/news/articles/cdrg6e2xgj6o",
            "upvotes": 1075,
            "date": "04/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/38bb/live/e0d42320-1b09-11f0-8a1e-3ff815141b98.jpg",
            "top_comments": [
                "She recently had a liver transplant. Liver transplant patients can develop diabetes mellitus as a common post surgical complication. She probably didn't know she had it. Poor Michelle. It's tragic.",
                "I forgot she died and get to be sad all over again",
                ">Officials did not perform a post-mortem examination, but said toxicology tests determined Trachtenberg's cause of death.\n\n  \nI'm not diabetic, and I'm not a doctor, so what would a toxicology report reveal that would lead to this diagnosis?  Was her blood sugar super high or something?",
                "Diabetes has become so commonplace people forget it can absolutely be a complicated and difficult disease for some people. People really seem to consider it a minor illness and it’s really not.",
                "*An unnamed source told NBC News the actress had received a liver transplant before her death. The exact timing or reasoning of the operation is unclear.*\n\nI would guess that the cause of her death is related to this skimpy info.  I can't imagine a toxicology report would that helpful in determining her death unless it were a drug overdose or the like.",
                "Rest in peace, Michelle 💜",
                "Either diabetic keto acidosis (high blood sugar) that came on unknowingly and fast, or possibly a hypoglycemic episode while sleeping seems like.\n\nI am diabetic and have gone through both. DKA undiagnosed and ignored can render you unconscious and dead within hours. A hypo episode could have triggered her passing out and seizing, or simply happened in her sleep. Diabetes/uncontrolled blood sugar is VERY dangerous especially for someone undiagnosed/new to having it.",
                "Damn, she died of beaties."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "US IRS planning to rescind Harvard's tax-exempt status",
            "external_url": "https://www.reuters.com/world/us/us-irs-planning-rescind-harvards-tax-exempt-status-cnn-reports-2025-04-16/",
            "upvotes": 19545,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is going to be drawn out in court for a long time. Harvard isn't likely to back down.",
                "Isn't it illegal for the president to get the IRS to do that?\n\n\"Prohibition on executive branch influence over taxpayer audits and other investigations\"\n\n[Stated here](https://www.law.cornell.edu/uscode/text/26/7217)",
                "All is fair then when the shoe is on the other foot...every church that participated in preaching about voting (at all for anyone) should lose their tax exempt status too",
                "That's great! That means the next time we have a democratic president in we can just start pulling the tax exempt status of churches right? Just whomever we don't like?",
                "Remember when conservatives cried persecution because the IRS showed extra scrutiny to conservative groups based on keyword usage? (The IRS also did the same for liberal groups as well but conservatives just ignored that since it didn't support their worldview)",
                "How about megachurches next?",
                "Harvard may know some lawyers who can represent them in court.",
                "\"The essence of fascism is to make laws forbidding everything and then enforce them selectively against your enemies.\" - John Lescroart, A Plague of Secrets.",
                "Oh, good.  The dollar is collapsing, U.S. bonds are becoming more unstable and disfavored globally every day, stock market volatility is off the charts with every indication that the bottom is going to fall out, the FED chairman just cautioned that Trump's tariffs are putting the country on track for devastating stagflation ... and instead of dealing with any of this the White House is hyper-focused on abusing the power of the federal government to exact petty retributions against perceived political enemies.  Any Trump supporters want to defend this daily shitshow?",
                "I hope Harvard doesn't blink, here. Stand up for yourselves. Stand up for all of us."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Puerto Rico goes completely dark after another island-wide power outage",
            "external_url": "https://www.nbcnews.com/news/us-news/puerto-rico-goes-completely-dark-another-island-wide-power-outage-rcna201643",
            "upvotes": 260,
            "date": "04/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-12/123124-puerto-rico-power-outage-vl-851a-6e98cf.jpg",
            "top_comments": [
                "Something tells me they won't even get paper towels this time",
                "Hope this won’t impact medical supplies too badly, the supply chain was already in bad shape",
                "Finally something Trump can help with.  /s",
                "It's time for Trump to yeet a 3-pointer with a pack of toilet paper again /s",
                "Can’t wait to see what President Krasnov throws at them this time…",
                "Instead of calling his good friend, the president of Puerto Rico, he'll try to impose tariffs and deport every human off the island.",
                "Let's make the Puerto Rico the 11th province or 4th territory. We'll treat them better than the US does\n\nEdit bad math",
                "Maybe Trumpty Dumpty can go over and throw lightbulbs at them."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Missing toddler who walked 7 miles alone through Arizona wilderness led to safety by rancher's dog",
            "external_url": "https://www.nbcnews.com/news/us-news/missing-toddler-walked-7-miles-alone-arizona-wilderness-led-safety-ran-rcna201479?utm_source=firefox-newtab-en-us",
            "upvotes": 5054,
            "date": "04/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250416-arizona-toddler-dog-ch-1033-58c02e.jpg",
            "top_comments": [
                "\n\"I got in my truck to go to town and I see Buford walking down the side of the fence with a little blond kid with him. I had heard about the missing child this morning, so I knew it was him.\"\n\n\nBuford, (best name ever), probably only walked with him about a mile, but the dog did find him.",
                "I hope Buford got a nice treat for being a good boy.",
                "the goodest of good boys.",
                "7 miles for a 2 year old!",
                "Cause dogs are awesome. ",
                "I have a Pyrenees mix (Buford is a full Pyr) and they are one of the smartest and self-sufficient dog breeds.  They can make decisions on their own and I can believe the doggo worked out that the kid shouldn't have been there and that the best thing to do was to lead him home, like a sheep.  They are also hard headed and stubborn, because they believe they are smarter than we are...",
                "It followed me home, dad, can I keep him?",
                "If you watch the video...\n\nRancher: \"Buford... come on...\"\n\nBuford: \"Nah\".\n\n:)\n\nDogs are fucking magical.",
                "I really needed to read a good news story like this.  So happy for the family.  Buford is a good boy.",
                "What were the parents doing and how did he leave his home around 5pm. Either way glad he is safe but what was his parents/guardians doing"
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "Island-wide blackout hits Puerto Rico as residents prepare for Easter weekend",
            "external_url": "https://www.cnn.com/2025/04/16/us/puerto-rico-island-wide-blackout-easter-weekend?cid=ios_app",
            "upvotes": 546,
            "date": "04/16/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25106695668333.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Trump wants to expand the USA and yet they can’t provide electricity to a USA territory? What kind of banana republic the USA is becoming",
                "San Juan, Puerto Rico (AP) — An island-wide blackout hit Puerto Rico on Wednesday as the largely Catholic residents of the U.S. territory prepared to celebrate the Easter weekend, officials said.\n\nAll 1.4 million clients on the island were without power, Hugo Sorrentini, spokesman for Luma Energy, which oversees the transmission and distribution of power, told The Associated Press. “The entire island is without generation,” he said.\n\nMeanwhile, at least 78,000 clients were without water, with officials warning that power likely won’t be fully restored for another 48 to 72 hours.",
                "Paper towels incoming...",
                "And they don't have an obvious reason? Going to be a stressful couple days. People were probably doing a lot of food prep at the very least, too.",
                "I just had a call with my parents and at least for now they have cell signal but water was starting to go out already.  They have solar so gas is no issue for them BUT gas stations already have hour long lines since it caught folks off guard during the regular rush hour",
                "Puerto Rico built up a robust electrical grid that was owned by the public but was sold off to a business to be “more efficient”. After it was privatized prices increased while the quality went down drastically. This situation sucks and happens all the time.",
                "Major infrastructure (hotels, airport, some markets/restaurants) have sufficient generators to keep going but there's definitely a shift here",
                "So what's the roof top solar panel industry like down there?",
                "What did Puerto Rico say that Trump didn’t like?",
                "Such a giant shit hole"
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "04/17/2025 04:11:12 UTC"
}