{
    "posts": [
        {
            "category": "HOT",
            "title": "A South African woman is sentenced to life in prison for selling her young daughter",
            "external_url": "https://abcnews.go.com/International/wireStory/south-african-woman-sentenced-life-prison-selling-young-122303628",
            "upvotes": 2624,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/30d842bd-9b9e-49d8-ac03-9b827ebc32b8/wirestory_fd8f218344b7d5757a669fc5c23cc4c6_16x9.jpg?w=1600",
            "top_comments": [
                "A woman testified during the trial that Smith had told her she and the two men had sold Joshlin for around $1,000 to a traditional healer who wanted the child for her body parts.",
                "In South Africa, it is called \"Muti\".\n\nWitchdoctors are unfortunately still a thing in rural parts.",
                "So uhhh where's Joshlin? Where is this \"healer?\"",
                "She was 6 years old. Six years spent growing, developing a personality and being at the mercy of and surely loving her mother. Her mother who then sold her for $1000. Beyond cruel. Unimaginable. And still not found a year later. I really hope her suffering was short. There aren’t words for this type of cruelty towards a child.",
                "I'm speechless a parent would do that to their own child. \n\nJust horrifying that someone would sell a child to be murdered. \n\nI have three little girls 5 is the oldest. When I tell them monsters aren't real, I'm lying. They are real, they just don't look like what they expect.",
                "I followed the entire case through CapeTalk's coverage - and I 100% agree with the court - the judge was extremely sympathetic to the defendant and state - and he held the trial in the community multi-purpose centre, ensuring the community feels part of the trial as well.\n\n\nThe NPA did really good work here.\n\nUnfortunately Joshlin is dead - I am 99% sure of this, since albino kids are highly sought after for their organs and skin.\n\nThe boyfriend and friend's friend are absolute trash, and the lady who ratted on them are trash as well for not coming forward earlier. Fuck them.\n\nJoshlin's grandmother fought tooth and nail to get custody of Joshlin and her siblings before this happened, but the social services failed spectacularly - the grandma said that Joshlin's mother made their lives hell and abused and neglected all the kids - but still she retained custody for some ungodly reason.\n\nThis is a failure of state and a testament to the fact that South Africa do not care about their children - every day there's a story of a child found raped and murdered under some bush, and still nothing is being done by the government.",
                "This literally made my stomach turn. Wtaf?!",
                "I saw a documentary about albinos being killed for ritualistic purposes. This one dude was like let them try me, all the while swinging two machetes around…. Wild stuff",
                "As a South African I’m disgusted by this woman’s actions and how she played to courts and society in the beginning. \n\nKarma will not be kind to her. \n\nThe community needs to find the muti doctors and do kangaroo court with them as the police are not effective.",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Stocks climb after a court blocks many of Trump's tariffs, as Nvidia leads tech stocks higher again",
            "external_url": "https://apnews.com/article/stocks-markets-bonds-tariffs-trump-e9b612f1c8f4f338f24f609373075095",
            "upvotes": 1147,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is it a good sign for your economic policy when the markets drop on implementation and jump on rollback?",
                "The Dow Jones is actually down slightly. Investors are exhausted.",
                "\"The more you buy, the more you save\" - Jensen Huang, Nvidia CEO",
                "Boy who cried wolf, eaten by wolves.",
                "When you taco it's hard to claim it's an emergency to impose tariffs.",
                "Clearly it's time to take the keys from grandpa, he can't be trusted with the car.  \n\nAnd sadly not one Republican will see it as cause for concern that the economy functions better with their dementia and hate fueled god emperor having less power.",
                "It’s going down or not really that surging cause Trump is going to court to keep the tariffs in place.\n\nI hate when people post stock market articles like this before it closes. Makes sense after the bell rings but not during cause anything could happen for the 8 hours it’s open for public trading.",
                "This gives Trump an out on only some of his tariffs. Which were not popular. \n\nAdditionally, lots of Trump cronies made money playing stocks with the chaos. \n\nTACO man’s damage is never done tho.\n\nEDIT -We’re to were.",
                "And Doe174 will claim credit for any rise, even if it is because his policies are stopped.  \n\nAnd the gullible simpletons of MAGA will believe it.",
                "From the article:\n//\nNEW YORK (AP) — Stocks worldwide are rising on Thursday after a U.S. court blocked many of President Donald Trump’s sweeping tariffs, though the gains got less strong as trading progressed from Asia to New York.\n\nThe S&P 500 was 0.7% higher in early trading, and it pulled within 3.5% of its all-time high set earlier this year. It had dropped roughly 20% below the mark last month, when fears were at their worst about whether Trump’s trade war would drive the economy into a recession.\n\nThe Dow Jones Industrial Average was up 60 points, or 0.1%, as of 9:35 a.m. Eastern time, and the Nasdaq composite was 1.3% higher.\n\nThe gains were even bigger in Asia, where markets had the first chance to react to the ruling issued late on Wednesday by the U.S. Court of International Trade in New York. It said that the 1977 International Emergency Economic Powers Act that Trump cited for ordering massive increases in taxes on imports worldwide does not authorize the use of tariffs.\n\n*The White House immediately appealed, and the long-term outcome of legal disputes over tariffs remains uncertain. The court’s ruling also affects only some of Trump’s tariffs, not those on foreign steel, aluminum and autos, which were invoked under a different law.*\n//"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Israel announces major expansion of settlements in occupied West Bank",
            "external_url": "https://www.bbc.com/news/articles/c1j5954edlno",
            "upvotes": 1200,
            "date": "05/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/321e/live/0cfc3ea0-3c85-11f0-af00-f94ff1cabcc0.jpg",
            "top_comments": [
                "When Russia does it it's an invasion. When Israel does it it's a \"settlement\".",
                "More illegal expansion, if only people knew this was coming for years.  Oh, wait…",
                "Apparently you can rename ethnic cleansing \"settlement\" and get away with it scot-free",
                "[If I don't steal it, someone else is gonna steal it](https://youtu.be/KNqozQ8uaV8?si)",
                "to the surprise of absolutely no one.",
                "I'm sure this will make Israel safer and will result in no action taken by Palestinians and their sympathizers. Fortunately we know that Israel is an incredibly moral country whose one and only concern is counter-terrorism and keeping the population safe from the inherently evil Palestinians in a completely reasonable manner where every casualty taken by Palestinians is their fault.\n\nThat's what the WorldNews sub tells me anyway!",
                "They're really trying to eliminate any pathways towards peace.",
                "Let's not sanitize the facts, shall we?\n\n\"Isreal announces major expansion to invasion of West Bank and theft of Palestinian homes and belongings\" is much more accurate.",
                "Anyone else hearing Echoes of Lebensraum in this policy?",
                "\"Settlement\" \n\nThat's an invasion. That there paving the way for with genocide and mass displacement."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Judge to order DHS and State Department to not make any changes to Harvard's student visa program indefinitely",
            "external_url": "https://www.cnn.com/us/live-news/harvard-graduation-international-student-ban-hearing-05-29-25#cmb9hkpgk00053b60yqd9fea4",
            "upvotes": 730,
            "date": "05/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2217503072.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "These rulings and how they are enforced will define the future of the country",
                "Trump is just mad his kid was rejected by Harvard.",
                "Judges provide the ultimate law when they agree and are politically charged suggestions when they don't. \n\nThey're merely a tool for control for this admin, not a guide on what they can/can't do.",
                "Gotta love how the conservative position to \"no, you can't just make orders and declarations like a king, there are laws you need to follow to get what you want to achieve\" is screeching about a Judicial Coup and demanding that every action immediately be referred to SCOTUS regardless of whether or not there's a question of constitutionality in place like they're the backstop pet court for any of the dumb shit a judge stops Trump from doing.",
                "Since when does anyone in this administration believe the judge has any authority. \nI get the real vibes of “You ain’t the boss of me”",
                "Baron wasn’t smart enough to get in to Harvard so now the whole university has to suffer."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US cancels more than $700 million funding for Moderna bird flu vaccine",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-cancels-more-700-million-funding-moderna-bird-flu-vaccine-2025-05-28/",
            "upvotes": 28860,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "How does the Executive Branch keep cancelling Congressionally-appropriated funds with no consequences?",
                "Really don’t get how they can just decide to not pay things already contracted",
                "> Moderna in January was awarded $590 million by the Biden administration to advance the development of its bird flu vaccine, and support the expansion of clinical studies for up to five additional subtypes of pandemic influenza\n\nCancelled by the Trump administration just 4 months later.",
                "The pharmaceutical industry will respond with - checks notes - massive donations to current and future Republicans, including Trump.",
                "Dumb bastards.  An ounce of prevention is worth a pound of cure.",
                "Is this going to bring down the price of chicken?",
                "Why is the Trump administration so pro-bird flu?",
                "Then when there's another bird flu epidemic Maga is going to be scratching their heads and bend over backwards not to blame trump",
                "Known pandemic mass murderer makes it so he can kill again. More at 11.",
                "in other news, the next pandemic is highly predicted to be the bird flu."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Elon Musk bids farewell to White House but says Doge will continue",
            "external_url": "https://www.bbc.com/news/articles/cz9y4exj822o",
            "upvotes": 6456,
            "date": "05/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4149/live/bb4c3ee0-3c28-11f0-af00-f94ff1cabcc0.jpg",
            "top_comments": [
                "Is this why he disabled community notes?",
                "To whatever extent \"leaving\" counts when you still have your aides appointed to the highest levels of government agencies",
                "The amount of times I’ve seen rich people come into an organization, fuck things completely up, fire the people who were trying to save them, ruin lives and walk away like they just won the superbowl is too damn high.",
                "Yeah but only because he has to, his status as a “special government employee” grants him only 130 days before he needs to leave and his time is up. This has to happen, it’s not voluntary.\n\nI would be surprised if this is the last Elon has to do with this administration. It’s a presidency he bought and paid for, after all.\n\nIn the meantime, fuck Tesla, fuck SpaceX, fuck X, and fuck Donald Trump.",
                "Does that mean Big Balls is in charge now?",
                "[removed]",
                "Look at this clown trying to save face:\n\n*The BBC understands that the White House will begin \"offboarding\" Musk as a special government employee on Wednesday night.\nMusk's exit comes after he said he was \"disappointed\" with Trump's budget, which proposes multi-trillion dollar tax breaks and a boost to defence spending.\nThe SpaceX and Tesla boss said in an interview with BBC's US partner CBS that the bill would increase the federal deficit, adding that he thought it \"undermines the work\" being done at Doge.*",
                "Timescale on Trump claiming he didn't know him?",
                "Don’t let up on his businesses, he stole our information, got his government contracts, he got what he needed and is trying to walk away. Don’t let up.",
                "This fuckin schmuck will be back for midterms writing checks and pressuring people, fuck these stories about him leaving, theyre cover for his damaging actions that help weaken our country and our social safety net. Fuck billionaires, take their money now."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Russian troops massing in north, says Ukraine after drone offensive",
            "external_url": "https://www.thetimes.com/world/russia-ukraine-war/article/drone-attack-strike-news-rfjqt2f67?utm_source=substack&utm_medium=email",
            "upvotes": 594,
            "date": "05/29/2025",
            "thumbnail": "https://www.thetimes.com/imageserver/image/%2Fcf08e2b2-90d2-419a-aced-156e6ca03d44.gif?crop=800%2C450%2C0%2C0&resize=1200",
            "top_comments": [
                "Good time for some HIMARS hors d’oevres",
                "Actual Russian troops, or more north Koreans?  I'd say prisoners and dissidents but I'm sure they have all been sent to the meat grinder already.",
                "Ukraine attacking weapons and weapon parts facilities. \"No deaths or injuries were reported.\"\n\nMeanwhile Russia attacking population centers, power plants, civil infrastructure and shelters.",
                "I expected this to happen earlier. Russia needs to break the stalemate for political reasons and the longer the war progresses the less likely such an offensive is likely to succeed so I expect them to do a summer offensive which will very likely fail and cost the Russians huge losses in return for tiny amounts of gained ground.\n\nOn the other hand Ukraine cannot attack either without significantly more western aid."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Federal trade court blocks Trump from imposing sweeping tariffs under emergency powers law",
            "external_url": "https://apnews.com/article/trump-tariffs-trade-court-0392dbd59f548e49ad4f64254ae3f94a",
            "upvotes": 9460,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "...and here is the kicker;\n\n>The court’s ruling also means that **the government may have to pay back duties it has already collected**. “Anybody that has had to pay tariffs so far will be able to get them refunded,” said Ilya Somin, a professor of law at George Mason University\n\n[https://www.politico.com/news/2025/05/28/federal-court-strikes-down-trumps-april-2-tariffs-00373843](https://www.politico.com/news/2025/05/28/federal-court-strikes-down-trumps-april-2-tariffs-00373843)",
                "Between this and being called TACO, it’s going to be a long night of tweeting.",
                ".......and there we have it folks.\n\nMarkets will be so green tomorrow..!",
                "\"The Congress shall have Power To lay and collect Taxes, Duties, Imposts and Excises, to pay the Debts and provide for the common Defence and general Welfare of the United States; but all Duties, Imposts and Excises shall be uniform throughout the United States; . . .\"\n\n\nArtI.S8.C1.1.1 of the United States Constitution \n\n\n\nMy #1 issue with almost everything that Trump does is not that I think it's wrong (which I almost always do) but that it's clearly against the law. If he had operated within the bounds of the law and worked with congress to pass a law setting tariffs, then boom the tariffs go into effect and theres no judge ruling that congress doesn't have that power, and democrats have way less of a leg to stand on. Deal with it, win the next election, right?\n\n\n\n\n\nIt's the same thing with all the doge stuff, or eliminating the dept of education, or mass deportations. All of these goals could 100% be achieved if the law was followed. But Trump is an authoritarian piece of shit and doesn't believe that the law applies to him.",
                "The fact it took this long for a ruling is a problem.",
                "tonight's twitter storm will be Hilarious",
                "Turns out if you're a TACO-ing, it pretty much ruins any chance you have for claiming the tariffs are necessary.",
                "Is this going to stop him from issuing tariffs? Like does this court order have merit and it will actually stop the orange monster from continuing this path of self destruction?",
                "Just the latest round of TACO Don's pump 'n dump scheme. SCOTUS will overturn this to cause the next downturn.",
                "Finally some good fucking news"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US judge allows states' lawsuit against DOGE to proceed",
            "external_url": "https://www.reuters.com/world/us/us-judge-allows-states-lawsuit-against-doge-proceed-2025-05-27/",
            "upvotes": 13679,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I won't be surprised if the eventual accounting shows that Elon Musk cost the United States, in law suits for illegal firings, broken contracts, and all the other nonsense \"DOGE\" has done, a great deal more than any imagined \"savings\".",
                "Hope something comes out of it, not expecting much.",
                "Impeach the judge request incoming and another truth social rant post.",
                "This whole fiasco is going to cost us so much.",
                "The judge is Tanya Chutkan, whom Trump escaped in the J6 case in Washington, with Jack Smith of DOJ prosecuting. She is an Obama nominee. \n\nJudge Chutkan is a Black woman who was born in Kingston, Jamaica and came here at 17. She is a tough, competent jurist, a former public defender. In a 2021 ruling, she said \"Presidents are not kings, and Plaintiff is not President.” \n\nMusk has no immunity, and he has no privilege to withhold documents or other evidence. He has committed crimes, and if he is deposed, he will take the Fifth. \n\nHugely important case with massive resources from Blue State AG's Office. DOJ is investigating Letitia James, the NY AG who beat Trump in his NY civil fraud case.",
                "Something something taco.",
                "The story of how Elon Musk of all people worked his way into Donald Trump's inner circle is going to be an excellent Netflix series in 2035.  Truely frightening times we live in.",
                "I would like to see lawsuits directly against Musk.  Since he was not a government employee, and there were no official duties, he should be personally liable.",
                "What is worrying to me, is that the current ~~Administration~~ gangsters are restraining [the freedom of many law firms](https://www.theguardian.com/us-news/2025/apr/02/trump-law-firm-executive-order) and ensuring millions of dollars of free law services flow towards the Federal government.",
                "Meanwhile my dipshit state created it’s own “DOGE”."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "\"I’m not a criminal’: Military wife detained, deported at Honolulu airport",
            "external_url": "https://www.hawaiinewsnow.com/2025/05/24/im-not-criminal-australian-woman-recounts-detention-experience-while-trying-visit-us-military-spouse-hawaii/?fbclid=IwY2xjawKkVUdleHRuA2FlbQIxMQABHordgmoKzV2MVhiQfVIIoEXXefpvq910XuO2hUdxPtIIF9pInkRUkBmECSCr_aem_HeGqd9GxlHAyRWPk63rhvA",
            "upvotes": 9476,
            "date": "05/28/2025",
            "thumbnail": "https://gray-khnl-prod.gtv-cdn.com/resizer/v2/FXDTVUNGCNC3POGLPA5BBNWGGE.JPEG?auth=20d68e119c5835c6ea99f936965c428ad59380f540cd4049245bb92f4cac11a3&width=1200&height=600&smart=true",
            "top_comments": [
                "> U.S. Customs and Border Protection told HNN they are working on a statement for this story.\n\nThis signals that they know they fucked up.\n\nOtherwise they would reply that they don’t comment on individual matters or on matters before a judge (or something similar).\n\n\nMaybe this will be the first chip to fall and get the military to start pushing back.",
                "This is just stupid and horrible. The simple thing to do, even if you want to deny her entry, is just let her buy a ticket, even on her own dime, and return home.\n\nShe is an Australian who have NOT even entered into the US yet. Being at the border asking for permission to enter is not a crime and not grounds for detention.\n\nIf you really want to turn back people (and not that I support that, but let's say that is legal), there is ALREADY a waiting area behind the counter. Just make sure there are airline representatives there to let them buy tickets to get out of there ASAP. I am sure most of them want to be out of the US and never come back right that second.",
                "Why can’t they just let the person change their flights and go back home? Why is the sexual assault and night in prison required?",
                "> The official checking their passports “went from completely composed to just yelling at the top of his lungs, telling my mother to go stand at the back of the line and to excuse my language, ‘shut up,’” Saroukos recalled.\n\n>“So I automatically started crying because that was my first response,” she said.\n\n>Saroukos said they were then taken to a holding room, their bags and phones were searched, and they were asked a slew of questions — everything from her work as a former police officer to whether her tattoos were gang-related to her marriage to an American.\n\n>“When I did say that I was married to somebody in the U.S. Army, the officers laughed at me. They thought it was quite comical. I don’t know whether they thought I was telling the truth or not,” she said.\n\n>“They kept telling me that I had too many clothes in my suitcase. So because of that, they assumed that I was going to overstay my visa,” she said.\n\n>Saroukos was subject to more screening. Her fingerprints and a DNA swab of her mouth were taken.\n\n>Meanwhile, her mother was free to go.\n\n>Saroukos said her heart sank when officials told her she would be declined entry to the U.S. and deported back to Australia the next day.\n\n>“[The officer] said ‘so basically what is going to happen is we’re going to send you to a prison overnight where you will stay,’” she said. “Not detention center, he said prison, and I automatically just, I started crying again.”\n\n>“Because when you think prison, you think, big time criminals. I don’t know who I’m being housed with,” she said.\n\n>According to Saroukos, border officials told her they would contact her husband on her behalf, but she found out later they didn’t.\n\n>Saroukos said officials conducted a body cavity search, walked her through the airport in handcuffs, and drove her to the Federal Detention Center.\n\n>“They stated, ‘No, you’re not under arrest. You haven’t done anything wrong, and you’ll be facing no criminal charges.’ So I was very confused as to why this was all happening,” she said.\n\n>At the prison, Saroukos was strip searched and detained with women who had been convicted of murder and drug offenses. She shared a cell with a woman from Fiji, who was also denied entry and waiting to be deported.\n\nJust, put yourself in her position for 10 seconds. You’ve done everything right. You’ve followed the laws and procedures. And just because someone decides today’s the day, they take you and your family, berate you, *rape* you, then parade you in front of the entire airport, and send you off to *prison* where you’re sexually harassed again. They cut you off from any means to contact anyone outside. They admit you’ve done no crime, they tell you this to your face. But they’ve kidnapped you, violated you, trampled your rights, and were one plane trip away from having you disappeared forever. Welcome to America.\n\nThis is fascism. This is what authoritarianism looks like. It’s not just happening to illegals or people you don’t like. It is everywhere. It is pervasive. It is growing. And it is not going away on its own.\n\n*It can happen to you.*",
                ">U.S. Customs and Border Protection told HNN they are working on a statement for this story.\n\nTranslation: “we have to come up with some story about how she was smuggling drugs and her husband was an awful serviceman.”",
                "Either their marriage will end, or he will quit the military and move to Australia (or someplace that doesn't strip search military spouses because they are on an ego trip). Fucking embarrassing being an American these days.",
                "Was going to see her husband, packed too many clothes so she got strip searched and cavity searched?  Let me guess, zero consequences.",
                "> Saroukos said officials ***conducted a body cavity search***, walked her through the airport in handcuffs, and drove her to the Federal Detention Center.\n\n# “They stated, ‘No, you’re not under arrest. You haven’t done anything wrong, and you’ll be facing no criminal charges.’ So I was very confused as to why this was all happening,” she said.\n\nAh I see, so they decided \"well we might as well sexually assault her since there aren't any consequences\"\n\nLand of the Free™® brought to you by Blackwater USA!",
                "At least the unhinged fascists are making more enemies in the military. Will make their dictatorship harder to launch.",
                "And they wonder why tourism numbers into the USA are dropping. Sorry, plummeting!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "In riposte to Vance, Germany's Merz says Europe stands for freedom",
            "external_url": "https://www.reuters.com/business/media-telecom/riposte-vance-germanys-merz-says-europe-stands-freedom-2025-05-29/",
            "upvotes": 24,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It looks like both of them define 'freedom' differently."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Judge to order DHS and State Department to not make any changes to Harvard's student visa program indefinitely",
            "external_url": "https://www.cnn.com/us/live-news/harvard-graduation-international-student-ban-hearing-05-29-25#cmb9hkpgk00053b60yqd9fea4",
            "upvotes": 730,
            "date": "05/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2217503072.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "These rulings and how they are enforced will define the future of the country",
                "Trump is just mad his kid was rejected by Harvard.",
                "Judges provide the ultimate law when they agree and are politically charged suggestions when they don't. \n\nThey're merely a tool for control for this admin, not a guide on what they can/can't do.",
                "Gotta love how the conservative position to \"no, you can't just make orders and declarations like a king, there are laws you need to follow to get what you want to achieve\" is screeching about a Judicial Coup and demanding that every action immediately be referred to SCOTUS regardless of whether or not there's a question of constitutionality in place like they're the backstop pet court for any of the dumb shit a judge stops Trump from doing.",
                "Since when does anyone in this administration believe the judge has any authority. \nI get the real vibes of “You ain’t the boss of me”",
                "Baron wasn’t smart enough to get in to Harvard so now the whole university has to suffer."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "A South African woman is sentenced to life in prison for selling her young daughter",
            "external_url": "https://abcnews.go.com/International/wireStory/south-african-woman-sentenced-life-prison-selling-young-122303628",
            "upvotes": 2620,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/30d842bd-9b9e-49d8-ac03-9b827ebc32b8/wirestory_fd8f218344b7d5757a669fc5c23cc4c6_16x9.jpg?w=1600",
            "top_comments": [
                "A woman testified during the trial that Smith had told her she and the two men had sold Joshlin for around $1,000 to a traditional healer who wanted the child for her body parts.",
                "In South Africa, it is called \"Muti\".\n\nWitchdoctors are unfortunately still a thing in rural parts.",
                "So uhhh where's Joshlin? Where is this \"healer?\"",
                "She was 6 years old. Six years spent growing, developing a personality and being at the mercy of and surely loving her mother. Her mother who then sold her for $1000. Beyond cruel. Unimaginable. And still not found a year later. I really hope her suffering was short. There aren’t words for this type of cruelty towards a child.",
                "I'm speechless a parent would do that to their own child. \n\nJust horrifying that someone would sell a child to be murdered. \n\nI have three little girls 5 is the oldest. When I tell them monsters aren't real, I'm lying. They are real, they just don't look like what they expect.",
                "I followed the entire case through CapeTalk's coverage - and I 100% agree with the court - the judge was extremely sympathetic to the defendant and state - and he held the trial in the community multi-purpose centre, ensuring the community feels part of the trial as well.\n\n\nThe NPA did really good work here.\n\nUnfortunately Joshlin is dead - I am 99% sure of this, since albino kids are highly sought after for their organs and skin.\n\nThe boyfriend and friend's friend are absolute trash, and the lady who ratted on them are trash as well for not coming forward earlier. Fuck them.\n\nJoshlin's grandmother fought tooth and nail to get custody of Joshlin and her siblings before this happened, but the social services failed spectacularly - the grandma said that Joshlin's mother made their lives hell and abused and neglected all the kids - but still she retained custody for some ungodly reason.\n\nThis is a failure of state and a testament to the fact that South Africa do not care about their children - every day there's a story of a child found raped and murdered under some bush, and still nothing is being done by the government.",
                "This literally made my stomach turn. Wtaf?!",
                "I saw a documentary about albinos being killed for ritualistic purposes. This one dude was like let them try me, all the while swinging two machetes around…. Wild stuff",
                "As a South African I’m disgusted by this woman’s actions and how she played to courts and society in the beginning. \n\nKarma will not be kind to her. \n\nThe community needs to find the muti doctors and do kangaroo court with them as the police are not effective.",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Stocks climb after a court blocks many of Trump's tariffs, as Nvidia leads tech stocks higher again",
            "external_url": "https://apnews.com/article/stocks-markets-bonds-tariffs-trump-e9b612f1c8f4f338f24f609373075095",
            "upvotes": 1148,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is it a good sign for your economic policy when the markets drop on implementation and jump on rollback?",
                "The Dow Jones is actually down slightly. Investors are exhausted.",
                "\"The more you buy, the more you save\" - Jensen Huang, Nvidia CEO",
                "Boy who cried wolf, eaten by wolves.",
                "When you taco it's hard to claim it's an emergency to impose tariffs.",
                "Clearly it's time to take the keys from grandpa, he can't be trusted with the car.  \n\nAnd sadly not one Republican will see it as cause for concern that the economy functions better with their dementia and hate fueled god emperor having less power.",
                "It’s going down or not really that surging cause Trump is going to court to keep the tariffs in place.\n\nI hate when people post stock market articles like this before it closes. Makes sense after the bell rings but not during cause anything could happen for the 8 hours it’s open for public trading.",
                "This gives Trump an out on only some of his tariffs. Which were not popular. \n\nAdditionally, lots of Trump cronies made money playing stocks with the chaos. \n\nTACO man’s damage is never done tho.\n\nEDIT -We’re to were.",
                "And Doe174 will claim credit for any rise, even if it is because his policies are stopped.  \n\nAnd the gullible simpletons of MAGA will believe it.",
                "From the article:\n//\nNEW YORK (AP) — Stocks worldwide are rising on Thursday after a U.S. court blocked many of President Donald Trump’s sweeping tariffs, though the gains got less strong as trading progressed from Asia to New York.\n\nThe S&P 500 was 0.7% higher in early trading, and it pulled within 3.5% of its all-time high set earlier this year. It had dropped roughly 20% below the mark last month, when fears were at their worst about whether Trump’s trade war would drive the economy into a recession.\n\nThe Dow Jones Industrial Average was up 60 points, or 0.1%, as of 9:35 a.m. Eastern time, and the Nasdaq composite was 1.3% higher.\n\nThe gains were even bigger in Asia, where markets had the first chance to react to the ruling issued late on Wednesday by the U.S. Court of International Trade in New York. It said that the 1977 International Emergency Economic Powers Act that Trump cited for ordering massive increases in taxes on imports worldwide does not authorize the use of tariffs.\n\n*The White House immediately appealed, and the long-term outcome of legal disputes over tariffs remains uncertain. The court’s ruling also affects only some of Trump’s tariffs, not those on foreign steel, aluminum and autos, which were invoked under a different law.*\n//"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Chinese paraglider survives accidental 8,000-metre-high flight above the clouds",
            "external_url": "https://www.theguardian.com/world/2025/may/29/chinese-paraglider-peng-yujiang-survives-8000-metre-high-flight",
            "upvotes": 139,
            "date": "05/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/53ecb3593e95de18d52afba47cf44129caded54c/336_155_1156_925/master/1156.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e76e797c406469e9e27331792d624aca",
            "top_comments": [
                "“Gu Zhimin posted a flight video without permission, which had a bad impact,” the report said. “He was grounded for six months and asked to write a report to deeply reflect on the negative impact of his behaviour.”\n\nPeng responded “not a problem, shit make it a year,I’m cool with that.” (My thoughts on his response)",
                "was…was the first part of the video in the article ai generated??",
                "**\"Relevant authorities are currently investigating potential regulatory violations related.\"**",
                "I thought this was debunked as a hoax? I really have no idea than some TikTok’s I’ve seen so grain of salt type deal. Genuinely curious though! Wild story.",
                "Any pros understand the gear? Almost looks like he was prepared to encounter such conditions. Plus ground.support with radio?",
                "I’ve already seen this same story line on Netflix."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Russian troops massing in north, says Ukraine after drone offensive",
            "external_url": "https://www.thetimes.com/world/russia-ukraine-war/article/drone-attack-strike-news-rfjqt2f67?utm_source=substack&utm_medium=email",
            "upvotes": 594,
            "date": "05/29/2025",
            "thumbnail": "https://www.thetimes.com/imageserver/image/%2Fcf08e2b2-90d2-419a-aced-156e6ca03d44.gif?crop=800%2C450%2C0%2C0&resize=1200",
            "top_comments": [
                "Good time for some HIMARS hors d’oevres",
                "Actual Russian troops, or more north Koreans?  I'd say prisoners and dissidents but I'm sure they have all been sent to the meat grinder already.",
                "Ukraine attacking weapons and weapon parts facilities. \"No deaths or injuries were reported.\"\n\nMeanwhile Russia attacking population centers, power plants, civil infrastructure and shelters.",
                "I expected this to happen earlier. Russia needs to break the stalemate for political reasons and the longer the war progresses the less likely such an offensive is likely to succeed so I expect them to do a summer offensive which will very likely fail and cost the Russians huge losses in return for tiny amounts of gained ground.\n\nOn the other hand Ukraine cannot attack either without significantly more western aid."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US weekly jobless claims rise more than expected as labor market eases",
            "external_url": "https://www.reuters.com/world/us/us-weekly-jobless-claims-rise-more-than-expected-labor-market-eases-2025-05-29/",
            "upvotes": 235,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "President Deals will fix it soon im sure. Lol",
                "It's happening. \n\n[https://theeconomiccollapseblog.com/the-middle-class-is-collapsing-nearly-1-out-of-every-4-americans-is-now-functionally-unemployed/](https://theeconomiccollapseblog.com/the-middle-class-is-collapsing-nearly-1-out-of-every-4-americans-is-now-functionally-unemployed/)",
                "Capitalism is devouring what is left of society. It requires infinite growth, and when it runs out of things to own, it starts absorbing public goods like the post office. We have a society that works for capitalism instead of capitalism working for society, which is the inevitable late stage of capitalism. There is a reason that the left in the US has been systematically attacked for the last 50 years - so that when capitalism devours all, they can swing the country hard right and keep us all fighting amongst ourselves.",
                "President Taco strikes again.",
                "I guess this is good news for farmers needing seasonal workers."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Israel announces major expansion of settlements in occupied West Bank",
            "external_url": "https://www.bbc.com/news/articles/c1j5954edlno",
            "upvotes": 1194,
            "date": "05/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/321e/live/0cfc3ea0-3c85-11f0-af00-f94ff1cabcc0.jpg",
            "top_comments": [
                "When Russia does it it's an invasion. When Israel does it it's a \"settlement\".",
                "More illegal expansion, if only people knew this was coming for years.  Oh, wait…",
                "Apparently you can rename ethnic cleansing \"settlement\" and get away with it scot-free",
                "[If I don't steal it, someone else is gonna steal it](https://youtu.be/KNqozQ8uaV8?si)",
                "to the surprise of absolutely no one.",
                "I'm sure this will make Israel safer and will result in no action taken by Palestinians and their sympathizers. Fortunately we know that Israel is an incredibly moral country whose one and only concern is counter-terrorism and keeping the population safe from the inherently evil Palestinians in a completely reasonable manner where every casualty taken by Palestinians is their fault.\n\nThat's what the WorldNews sub tells me anyway!",
                "They're really trying to eliminate any pathways towards peace.",
                "Let's not sanitize the facts, shall we?\n\n\"Isreal announces major expansion to invasion of West Bank and theft of Palestinian homes and belongings\" is much more accurate.",
                "Anyone else hearing Echoes of Lebensraum in this policy?",
                "\"Settlement\" \n\nThat's an invasion. That there paving the way for with genocide and mass displacement."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Alpine village largely destroyed after glacier collapse causes 'major catastrophe'",
            "external_url": "https://abcnews.go.com/International/wireStory/rock-slide-hits-swiss-alpine-village-authorities-ordered-122271419",
            "upvotes": 502,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/84c9b957-fd27-4322-88f8-a33f659df28d/wirestory_28e15e240eacb40bcbdb6a8f15d49398_16x9.jpg?w=1600",
            "top_comments": [
                "The article does not cover the scale of this:\n* 90 percent of the village is buried under a mudslide several meters high. 300 people lost their homes.\n* 3 million cubic meters of rock, ice, and debris\n* The landslide area is two kilometers long and up to 200 meters wide\n* Caused an earthquake of magnitude 3.1\n* The river that ran though is now blocked and flooded the remaining houses. Two municipalities that are downstream have now been evacuated.\n\n\nSources: (English) https://www.bluewin.ch/en/news/switzerland/two-further-communities-partially-evacuated-almost-90-percent-of-blatten-buried-under-mudslide-2699647.html (German) https://www.srf.ch/news/schweiz/gletscherabbruch-blatten-letzte-haeuser-in-blatten-ueberflutet-nachbardoerfer-teilevakuiert",
                "The regional government said in a statement that a large chunk of the Birch Glacier located above the village had broken off, causing the landslide which as well as covering the village had also buried the nearby Lonza River bed, raising the possibility of dammed water flows.",
                "Climate crisis doing climate crisis things",
                "The people funding this \"climate change hoax\" are super committed to the bit, aren't they? /s",
                "Canada here. Did we learn anything from the Frank Slide that we can use to offer help?  Other than starting myths about lost gold from bank robberies. ",
                "Some of the first casualties of the billionaires' war against Earth for money.",
                "They'll continue to deny the horrors of man made and exacerbated climate change until they're under water.\n\nAnd then they'll blame the democrats for not being more adamant about explaining it to them.",
                "That is a lot of mountain now in the valley. \nA lot of things happened here that a lot of people don’t believe in.  Gravity and climate change are the easy two. ",
                "Living in the mountain is becoming riskier and riskier, I advise moving down away from mountains."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Pacific Island nations support China's Taiwan claims at high-profile foreign ministers' meeting",
            "external_url": "https://www.abc.net.au/news/2025-05-29/china-wang-yi-pacific-islands-meeting-climate-taiwan/105353012",
            "upvotes": 110,
            "date": "05/29/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/35ed8d86c77df135905889f365fa756e?impolicy=wcms_watermark_news&cropH=2676&cropW=4757&xPos=166&yPos=532&width=862&height=485&imformat=generic",
            "top_comments": [
                "Strange how America seems to be giving up all its soft power and the world is already turning to China to replace them.",
                "So China expands its influence around the globe while Trump shrinks ours.......",
                "Now we'd like to hear about relevant countries that weren't bought by China.",
                "It matters little what these nations think about Taiwan's sovereignty. The only thing that matters is the opinion of the Taiwanese people themselves. They are the ones who shall decide the future of their country."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Judge to order DHS and State Department to not make any changes to Harvard's student visa program indefinitely",
            "external_url": "https://www.cnn.com/us/live-news/harvard-graduation-international-student-ban-hearing-05-29-25#cmb9hkpgk00053b60yqd9fea4",
            "upvotes": 731,
            "date": "05/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2217503072.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "These rulings and how they are enforced will define the future of the country",
                "Trump is just mad his kid was rejected by Harvard.",
                "Judges provide the ultimate law when they agree and are politically charged suggestions when they don't. \n\nThey're merely a tool for control for this admin, not a guide on what they can/can't do.",
                "Gotta love how the conservative position to \"no, you can't just make orders and declarations like a king, there are laws you need to follow to get what you want to achieve\" is screeching about a Judicial Coup and demanding that every action immediately be referred to SCOTUS regardless of whether or not there's a question of constitutionality in place like they're the backstop pet court for any of the dumb shit a judge stops Trump from doing.",
                "Since when does anyone in this administration believe the judge has any authority. \nI get the real vibes of “You ain’t the boss of me”",
                "Baron wasn’t smart enough to get in to Harvard so now the whole university has to suffer."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Stocks climb after a court blocks many of Trump's tariffs, as Nvidia leads tech stocks higher again",
            "external_url": "https://apnews.com/article/stocks-markets-bonds-tariffs-trump-e9b612f1c8f4f338f24f609373075095",
            "upvotes": 1150,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is it a good sign for your economic policy when the markets drop on implementation and jump on rollback?",
                "The Dow Jones is actually down slightly. Investors are exhausted.",
                "\"The more you buy, the more you save\" - Jensen Huang, Nvidia CEO",
                "Boy who cried wolf, eaten by wolves.",
                "When you taco it's hard to claim it's an emergency to impose tariffs.",
                "Clearly it's time to take the keys from grandpa, he can't be trusted with the car.  \n\nAnd sadly not one Republican will see it as cause for concern that the economy functions better with their dementia and hate fueled god emperor having less power.",
                "It’s going down or not really that surging cause Trump is going to court to keep the tariffs in place.\n\nI hate when people post stock market articles like this before it closes. Makes sense after the bell rings but not during cause anything could happen for the 8 hours it’s open for public trading.",
                "This gives Trump an out on only some of his tariffs. Which were not popular. \n\nAdditionally, lots of Trump cronies made money playing stocks with the chaos. \n\nTACO man’s damage is never done tho.\n\nEDIT -We’re to were.",
                "And Doe174 will claim credit for any rise, even if it is because his policies are stopped.  \n\nAnd the gullible simpletons of MAGA will believe it.",
                "From the article:\n//\nNEW YORK (AP) — Stocks worldwide are rising on Thursday after a U.S. court blocked many of President Donald Trump’s sweeping tariffs, though the gains got less strong as trading progressed from Asia to New York.\n\nThe S&P 500 was 0.7% higher in early trading, and it pulled within 3.5% of its all-time high set earlier this year. It had dropped roughly 20% below the mark last month, when fears were at their worst about whether Trump’s trade war would drive the economy into a recession.\n\nThe Dow Jones Industrial Average was up 60 points, or 0.1%, as of 9:35 a.m. Eastern time, and the Nasdaq composite was 1.3% higher.\n\nThe gains were even bigger in Asia, where markets had the first chance to react to the ruling issued late on Wednesday by the U.S. Court of International Trade in New York. It said that the 1977 International Emergency Economic Powers Act that Trump cited for ordering massive increases in taxes on imports worldwide does not authorize the use of tariffs.\n\n*The White House immediately appealed, and the long-term outcome of legal disputes over tariffs remains uncertain. The court’s ruling also affects only some of Trump’s tariffs, not those on foreign steel, aluminum and autos, which were invoked under a different law.*\n//"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Russian troops massing in north, says Ukraine after drone offensive",
            "external_url": "https://www.thetimes.com/world/russia-ukraine-war/article/drone-attack-strike-news-rfjqt2f67?utm_source=substack&utm_medium=email",
            "upvotes": 592,
            "date": "05/29/2025",
            "thumbnail": "https://www.thetimes.com/imageserver/image/%2Fcf08e2b2-90d2-419a-aced-156e6ca03d44.gif?crop=800%2C450%2C0%2C0&resize=1200",
            "top_comments": [
                "Good time for some HIMARS hors d’oevres",
                "Actual Russian troops, or more north Koreans?  I'd say prisoners and dissidents but I'm sure they have all been sent to the meat grinder already.",
                "Ukraine attacking weapons and weapon parts facilities. \"No deaths or injuries were reported.\"\n\nMeanwhile Russia attacking population centers, power plants, civil infrastructure and shelters.",
                "I expected this to happen earlier. Russia needs to break the stalemate for political reasons and the longer the war progresses the less likely such an offensive is likely to succeed so I expect them to do a summer offensive which will very likely fail and cost the Russians huge losses in return for tiny amounts of gained ground.\n\nOn the other hand Ukraine cannot attack either without significantly more western aid."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US weekly jobless claims rise more than expected as labor market eases",
            "external_url": "https://www.reuters.com/world/us/us-weekly-jobless-claims-rise-more-than-expected-labor-market-eases-2025-05-29/",
            "upvotes": 232,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "President Deals will fix it soon im sure. Lol",
                "It's happening. \n\n[https://theeconomiccollapseblog.com/the-middle-class-is-collapsing-nearly-1-out-of-every-4-americans-is-now-functionally-unemployed/](https://theeconomiccollapseblog.com/the-middle-class-is-collapsing-nearly-1-out-of-every-4-americans-is-now-functionally-unemployed/)",
                "Capitalism is devouring what is left of society. It requires infinite growth, and when it runs out of things to own, it starts absorbing public goods like the post office. We have a society that works for capitalism instead of capitalism working for society, which is the inevitable late stage of capitalism. There is a reason that the left in the US has been systematically attacked for the last 50 years - so that when capitalism devours all, they can swing the country hard right and keep us all fighting amongst ourselves.",
                "President Taco strikes again.",
                "I guess this is good news for farmers needing seasonal workers."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "A South African woman is sentenced to life in prison for selling her young daughter",
            "external_url": "https://abcnews.go.com/International/wireStory/south-african-woman-sentenced-life-prison-selling-young-122303628",
            "upvotes": 2620,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/30d842bd-9b9e-49d8-ac03-9b827ebc32b8/wirestory_fd8f218344b7d5757a669fc5c23cc4c6_16x9.jpg?w=1600",
            "top_comments": [
                "A woman testified during the trial that Smith had told her she and the two men had sold Joshlin for around $1,000 to a traditional healer who wanted the child for her body parts.",
                "In South Africa, it is called \"Muti\".\n\nWitchdoctors are unfortunately still a thing in rural parts.",
                "So uhhh where's Joshlin? Where is this \"healer?\"",
                "She was 6 years old. Six years spent growing, developing a personality and being at the mercy of and surely loving her mother. Her mother who then sold her for $1000. Beyond cruel. Unimaginable. And still not found a year later. I really hope her suffering was short. There aren’t words for this type of cruelty towards a child.",
                "I'm speechless a parent would do that to their own child. \n\nJust horrifying that someone would sell a child to be murdered. \n\nI have three little girls 5 is the oldest. When I tell them monsters aren't real, I'm lying. They are real, they just don't look like what they expect.",
                "I followed the entire case through CapeTalk's coverage - and I 100% agree with the court - the judge was extremely sympathetic to the defendant and state - and he held the trial in the community multi-purpose centre, ensuring the community feels part of the trial as well.\n\n\nThe NPA did really good work here.\n\nUnfortunately Joshlin is dead - I am 99% sure of this, since albino kids are highly sought after for their organs and skin.\n\nThe boyfriend and friend's friend are absolute trash, and the lady who ratted on them are trash as well for not coming forward earlier. Fuck them.\n\nJoshlin's grandmother fought tooth and nail to get custody of Joshlin and her siblings before this happened, but the social services failed spectacularly - the grandma said that Joshlin's mother made their lives hell and abused and neglected all the kids - but still she retained custody for some ungodly reason.\n\nThis is a failure of state and a testament to the fact that South Africa do not care about their children - every day there's a story of a child found raped and murdered under some bush, and still nothing is being done by the government.",
                "This literally made my stomach turn. Wtaf?!",
                "I saw a documentary about albinos being killed for ritualistic purposes. This one dude was like let them try me, all the while swinging two machetes around…. Wild stuff",
                "As a South African I’m disgusted by this woman’s actions and how she played to courts and society in the beginning. \n\nKarma will not be kind to her. \n\nThe community needs to find the muti doctors and do kangaroo court with them as the police are not effective.",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Israel announces major expansion of settlements in occupied West Bank",
            "external_url": "https://www.bbc.com/news/articles/c1j5954edlno",
            "upvotes": 1198,
            "date": "05/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/321e/live/0cfc3ea0-3c85-11f0-af00-f94ff1cabcc0.jpg",
            "top_comments": [
                "When Russia does it it's an invasion. When Israel does it it's a \"settlement\".",
                "More illegal expansion, if only people knew this was coming for years.  Oh, wait…",
                "Apparently you can rename ethnic cleansing \"settlement\" and get away with it scot-free",
                "[If I don't steal it, someone else is gonna steal it](https://youtu.be/KNqozQ8uaV8?si)",
                "to the surprise of absolutely no one.",
                "I'm sure this will make Israel safer and will result in no action taken by Palestinians and their sympathizers. Fortunately we know that Israel is an incredibly moral country whose one and only concern is counter-terrorism and keeping the population safe from the inherently evil Palestinians in a completely reasonable manner where every casualty taken by Palestinians is their fault.\n\nThat's what the WorldNews sub tells me anyway!",
                "They're really trying to eliminate any pathways towards peace.",
                "Let's not sanitize the facts, shall we?\n\n\"Isreal announces major expansion to invasion of West Bank and theft of Palestinian homes and belongings\" is much more accurate.",
                "Anyone else hearing Echoes of Lebensraum in this policy?",
                "\"Settlement\" \n\nThat's an invasion. That there paving the way for with genocide and mass displacement."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Alpine village largely destroyed after glacier collapse causes 'major catastrophe'",
            "external_url": "https://abcnews.go.com/International/wireStory/rock-slide-hits-swiss-alpine-village-authorities-ordered-122271419",
            "upvotes": 493,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/84c9b957-fd27-4322-88f8-a33f659df28d/wirestory_28e15e240eacb40bcbdb6a8f15d49398_16x9.jpg?w=1600",
            "top_comments": [
                "The article does not cover the scale of this:\n* 90 percent of the village is buried under a mudslide several meters high. 300 people lost their homes.\n* 3 million cubic meters of rock, ice, and debris\n* The landslide area is two kilometers long and up to 200 meters wide\n* Caused an earthquake of magnitude 3.1\n* The river that ran though is now blocked and flooded the remaining houses. Two municipalities that are downstream have now been evacuated.\n\n\nSources: (English) https://www.bluewin.ch/en/news/switzerland/two-further-communities-partially-evacuated-almost-90-percent-of-blatten-buried-under-mudslide-2699647.html (German) https://www.srf.ch/news/schweiz/gletscherabbruch-blatten-letzte-haeuser-in-blatten-ueberflutet-nachbardoerfer-teilevakuiert",
                "The regional government said in a statement that a large chunk of the Birch Glacier located above the village had broken off, causing the landslide which as well as covering the village had also buried the nearby Lonza River bed, raising the possibility of dammed water flows.",
                "Climate crisis doing climate crisis things",
                "The people funding this \"climate change hoax\" are super committed to the bit, aren't they? /s",
                "Canada here. Did we learn anything from the Frank Slide that we can use to offer help?  Other than starting myths about lost gold from bank robberies. ",
                "Some of the first casualties of the billionaires' war against Earth for money.",
                "They'll continue to deny the horrors of man made and exacerbated climate change until they're under water.\n\nAnd then they'll blame the democrats for not being more adamant about explaining it to them.",
                "That is a lot of mountain now in the valley. \nA lot of things happened here that a lot of people don’t believe in.  Gravity and climate change are the easy two. ",
                "Living in the mountain is becoming riskier and riskier, I advise moving down away from mountains."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US cancels more than $700 million funding for Moderna bird flu vaccine",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-cancels-more-700-million-funding-moderna-bird-flu-vaccine-2025-05-28/",
            "upvotes": 28853,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "How does the Executive Branch keep cancelling Congressionally-appropriated funds with no consequences?",
                "Really don’t get how they can just decide to not pay things already contracted",
                "> Moderna in January was awarded $590 million by the Biden administration to advance the development of its bird flu vaccine, and support the expansion of clinical studies for up to five additional subtypes of pandemic influenza\n\nCancelled by the Trump administration just 4 months later.",
                "The pharmaceutical industry will respond with - checks notes - massive donations to current and future Republicans, including Trump.",
                "Dumb bastards.  An ounce of prevention is worth a pound of cure.",
                "Is this going to bring down the price of chicken?",
                "Why is the Trump administration so pro-bird flu?",
                "Then when there's another bird flu epidemic Maga is going to be scratching their heads and bend over backwards not to blame trump",
                "Known pandemic mass murderer makes it so he can kill again. More at 11.",
                "in other news, the next pandemic is highly predicted to be the bird flu."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Elon Musk bids farewell to White House but says Doge will continue",
            "external_url": "https://www.bbc.com/news/articles/cz9y4exj822o",
            "upvotes": 6462,
            "date": "05/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4149/live/bb4c3ee0-3c28-11f0-af00-f94ff1cabcc0.jpg",
            "top_comments": [
                "Is this why he disabled community notes?",
                "To whatever extent \"leaving\" counts when you still have your aides appointed to the highest levels of government agencies",
                "The amount of times I’ve seen rich people come into an organization, fuck things completely up, fire the people who were trying to save them, ruin lives and walk away like they just won the superbowl is too damn high.",
                "Yeah but only because he has to, his status as a “special government employee” grants him only 130 days before he needs to leave and his time is up. This has to happen, it’s not voluntary.\n\nI would be surprised if this is the last Elon has to do with this administration. It’s a presidency he bought and paid for, after all.\n\nIn the meantime, fuck Tesla, fuck SpaceX, fuck X, and fuck Donald Trump.",
                "Does that mean Big Balls is in charge now?",
                "[removed]",
                "Look at this clown trying to save face:\n\n*The BBC understands that the White House will begin \"offboarding\" Musk as a special government employee on Wednesday night.\nMusk's exit comes after he said he was \"disappointed\" with Trump's budget, which proposes multi-trillion dollar tax breaks and a boost to defence spending.\nThe SpaceX and Tesla boss said in an interview with BBC's US partner CBS that the bill would increase the federal deficit, adding that he thought it \"undermines the work\" being done at Doge.*",
                "Timescale on Trump claiming he didn't know him?",
                "Don’t let up on his businesses, he stole our information, got his government contracts, he got what he needed and is trying to walk away. Don’t let up.",
                "This fuckin schmuck will be back for midterms writing checks and pressuring people, fuck these stories about him leaving, theyre cover for his damaging actions that help weaken our country and our social safety net. Fuck billionaires, take their money now."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Federal trade court blocks Trump from imposing sweeping tariffs under emergency powers law",
            "external_url": "https://apnews.com/article/trump-tariffs-trade-court-0392dbd59f548e49ad4f64254ae3f94a",
            "upvotes": 9457,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "...and here is the kicker;\n\n>The court’s ruling also means that **the government may have to pay back duties it has already collected**. “Anybody that has had to pay tariffs so far will be able to get them refunded,” said Ilya Somin, a professor of law at George Mason University\n\n[https://www.politico.com/news/2025/05/28/federal-court-strikes-down-trumps-april-2-tariffs-00373843](https://www.politico.com/news/2025/05/28/federal-court-strikes-down-trumps-april-2-tariffs-00373843)",
                "Between this and being called TACO, it’s going to be a long night of tweeting.",
                ".......and there we have it folks.\n\nMarkets will be so green tomorrow..!",
                "\"The Congress shall have Power To lay and collect Taxes, Duties, Imposts and Excises, to pay the Debts and provide for the common Defence and general Welfare of the United States; but all Duties, Imposts and Excises shall be uniform throughout the United States; . . .\"\n\n\nArtI.S8.C1.1.1 of the United States Constitution \n\n\n\nMy #1 issue with almost everything that Trump does is not that I think it's wrong (which I almost always do) but that it's clearly against the law. If he had operated within the bounds of the law and worked with congress to pass a law setting tariffs, then boom the tariffs go into effect and theres no judge ruling that congress doesn't have that power, and democrats have way less of a leg to stand on. Deal with it, win the next election, right?\n\n\n\n\n\nIt's the same thing with all the doge stuff, or eliminating the dept of education, or mass deportations. All of these goals could 100% be achieved if the law was followed. But Trump is an authoritarian piece of shit and doesn't believe that the law applies to him.",
                "The fact it took this long for a ruling is a problem.",
                "tonight's twitter storm will be Hilarious",
                "Turns out if you're a TACO-ing, it pretty much ruins any chance you have for claiming the tariffs are necessary.",
                "Is this going to stop him from issuing tariffs? Like does this court order have merit and it will actually stop the orange monster from continuing this path of self destruction?",
                "Just the latest round of TACO Don's pump 'n dump scheme. SCOTUS will overturn this to cause the next downturn.",
                "Finally some good fucking news"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/29/2025 16:10:49 UTC"
}