{
    "posts": [
        {
            "category": "HOT",
            "title": "DHS Mistakenly tells attorney US Citizen to leave the US",
            "external_url": "https://www.nbcboston.com/news/local/massachusetts-immigration-attorney-dhs-parole-termination/3684504/",
            "upvotes": 19721,
            "date": "04/13/2025",
            "thumbnail": "https://media.nbcboston.com/2025/04/dhs-parole-termination-notice-attorney.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "NPR last week interviewed a US attorney who is a US citizen, and he said the Trump administration is targeting US immigration attorneys. He was coming back from vacation and crossed the border checkpoint.That is when border patrol targeted him and detained him, then tried to confiscate his phone. They told him he was on a list for terrorists. He told them he had over ten years of attorney client privilege communications on his phone.  He told them absolutely not in confiscating his phone.  He said there are other immigration attorneys he personally knows that are also being harrassed by ICE and border patrol.\nhttps://www.npr.org/2025/04/09/nx-s1-5357455/attorney-detained-by-immigration-authorities",
                "This isn’t a mistake it’s a trial balloon",
                ">Mistakenly\n\nYeah, I’m sure it was. No veiled threats here, guys.",
                "*CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients.*\n\nYep, totally explains why the American citizen contact was the only one named in the notice. Sure guys, makes total sense.",
                "An immigration attorney….seems suspicious.",
                "It's ridiculous that they think sending an email is adequate for such communication, even if it were legit. \"Oh, it went to your spam, so you didn't see it? Well, it's off to El Salvador for you.\"",
                "What dehumanizing language\n\n “ CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients”",
                "Quick question - where the fuck would a native born US citizen with no connections to any other nation go?",
                "I have a bridge to sell you if you think it was a mistake",
                "Mistakenly telling people to leave. Mistakenly deporting people. Mistakenly firing people. \nMistakenly doing Nazi salutes"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Wisconsin teen allegedly killed parents in extremist plot to assassinate Trump, FBI says",
            "external_url": "https://abcnews.go.com/US/wisconsin-teen-allegedly-killed-parents-extremist-plot-assassinate/story?id=120750496",
            "upvotes": 2749,
            "date": "04/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/434debed-e7fb-439e-8ca2-a049d72f56af/waukesha-shooter-02-ht-jt-250412_1744482092946_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "hearing the story on the news yesterday was wild because each sentence just got weirder than the last 😭\n\n1. killed his parents\n\n2. plots against trump\n\n3. wrote a manifesto discussing plans to take over america\n\n4. loved hitler and wants a new order of neo nazism",
                "They conveniently leave the other half of the headline out. That he wanted to kill Trump to start a race war.",
                ">The sheriff's department issued a search warrant and say they found material on the teen's phone related to \"The Order of Nine Angles,\" which is \"a network of individuals holding new-Nazi racially motivated extremist views,\" according to investigators.\n\nWhy can't we say \"gang\"? If 'a network of individuals' isn't gang or a mob then what is it? Call them an anti-american Nazi gang.",
                "It’s crazy how many of these mass shooters fall into white nationalism rabbit holes. \n\nI watched Frontline’s documentary on Terrorgram, and it’s really scary how effective it is playing out in real time.",
                "These headlines keep leaving of the white supremacist part.",
                "Interesting that all those who have plotted to kill him so far have been fellow right-wingers.",
                "\"Wisconsin NEO-NAZI & WHITE SUPREMACIST killed parents, aspired to assassination and instigate a race war.\"\n\n- Fixed the title for you",
                "Of course the conservative subs are only sharing the headline.",
                "Why did he have to mess with his parents? No focus",
                "Every single time this story is presented the Media refuses to also mention that he is a Neo-Nazi."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "China Halts Critical Exports as Trade War Intensifies",
            "external_url": "https://www.nytimes.com/2025/04/13/business/china-rare-earths-exports.html?unlocked_article_code=1._U4.oI-5.uzRy92ofA0b5&smid=nytcore-android-share",
            "upvotes": 5388,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The metals, and special magnets made with them, can now be shipped out of China only with special export licenses.\n\n>But China has barely started setting up a system for issuing the licenses. That has caused consternation among industry executives that the process could drag on and that current supplies of minerals and products outside of China could run low.\n\nAnd I'm betting they're in no great hurry.",
                "Has Trump tried tariffing 1000%? Maybe that'll do it.",
                "Thanks, as always, Trump. Always finding new and exciting ways to fuck everyone over.",
                "Any entry-level frat boy at a hedgie would be gone by now, and replaced.",
                "trump, playing 1-D chess",
                "They’ll sell it somewhere else.",
                "China probably had always wanted to restrict these exports and now have a very good legitimate reason for doing so. DJT totally played into their hands.",
                "It's almost funny that Trump THINKS he can try to fuck up other countries expecting them to not retaliate.\nUSA doesn't produce everything it consumes. In fact, if every country stopped selling everything to USA, it would crumble. Maybe that should be a plan...",
                "China is beating the felon to a pulp. He’s no match for them and neither are his advisors.",
                ">Does the export control or ban potentially have severe effects in the U.S.? Yes,” he said. Mr. Pickard, leader of the international trade and national security practice at the Buchanan Ingersoll & Rooney law firm, **said a swift resolution of the rare earths issue was necessary because a sustained disruption of exports could hurt China’s reputation as a reliable supplier.**\n\nanyone care to inform Mr Packard that the idiot who started this is to blame rather casting his opinion on China for being a \"reputable supplier\"?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "SSA shifts to X posts for official messaging after cuts to communications staff",
            "external_url": "https://federalnewsnetwork.com/agency-oversight/2025/04/ssa-shifts-to-x-posts-for-official-messaging-after-cuts-to-communications-staff",
            "upvotes": 1683,
            "date": "04/13/2025",
            "thumbnail": "https://federalnewsnetwork.com/wp-content/uploads/2020/11/social-security-administration-office-e1581706167448.jpg",
            "top_comments": [
                "Lots of middle aged people gonna be getting calls from their elderly parents asking wtf is X",
                "And you can’t read messages without an account, thus sharing your private information with and boosting the subscriber count of a social media company privately owned by the person who ordered the change in policy. This country is fucked.",
                "Is this a plan to funnel more older people into a right wing echo chamber?",
                "Absolutely zero conflict of interest with that",
                "Why is a private company, twitter, the official announcement portal of a public benefit? This is silly.",
                "X/Twitter is a failing/failed network that needs to be propped up, so of course Mr Musk was going to demand a forced audience. Just another example of corporate welfare.",
                "Because people over 65 use Twitter so much.",
                "[deleted]",
                "Unless they're seriously trying to get a whole bunch of elderly people to use X for direct communications and such, somebody should just set up a bot to immediately repost any of their X posts to the various non-Nazi networks.",
                "Going to take decades to even start to fix this crap. If ever."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Photojournalist witnesses Venezuelan migrants' arrival in El Salvador: \"They had no idea what was coming\"",
            "external_url": "https://www.cbsnews.com/news/photojournalist-witnesses-venezuelan-migrants-arrival-in-el-salvador-60-minutes/",
            "upvotes": 1345,
            "date": "04/13/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/06/da9c7d4e-5da8-4430-8117-a4fde4f3f90f/thumbnail/1200x630/7daaa28a52c6e0a7bd01b4da3952c547/ot-deporteesphilipholsinger.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "When you thought WWII internment camps weren't bad enough, this administration was sure they could bring us to a new, shameful low point.",
                "Can someone explain to me why El Salvador (the government, not the people,) is taking these people?? Is it JUST money?? Are they trying to be on the administrations good side?? \n\nI am sincerely asking.",
                "There is no way to spin this, this is plain and simple terrorism for someone's pleasure.  This is sick and we will never be able to unsee this abuse of power. The people that instigated this and participate in this atrocity are the ones that belong in prison.",
                "If those Venezuelans committed no crimes against El Salvador, what justification do they have to detain them?\n\nTrump said he had no power over them once they left US jurisdiction; so, the USA is effectively selling slaves again. \n\nSomehow, there should be a class action for the 13th Amendment. No judge sentenced them to indentured servitude for a crime.",
                ">As Holsinger snapped the last few photographs, he felt that he had just watched the Venezuelan men become \"ghosts.\" \n\n>\"They've been stripped of their hair and their clothes… It's like your life just ceased to exist. You're just a person in white clothes now,\" Holsinger said. \n\n>\"And it was a sense of watching people disappear.\"\n\nAs a photography lover, these photos are extraordinary. \n\nAs a human, the above quote is haunting. We are all sitting by and watching people being deported to concentration camps. With absolute zero resistance to it.\n\nCan someone tell me what we can do now? What can we actually do to stop this? Is it too late?",
                "Americans sending innocent people to gulags, not wanting to lose their treats or have the slightest inconvenience. Bread and circuses.. ",
                "Because why they would expect a \"great\" nation like the U.S. to treat them like animals?",
                "It is a concentration camp.\n\n\nSomeone please call it was it is. The guards are literally yelling \"Fast! Fast! Fast\".\n\n\n\nThe guards at the camps during World War II yelled \"Schnell! Schnell! Schnell!\"",
                "Call it for what it is - They're being sent to Republican Death camps.",
                "We are a disgusting nation"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Police: Someone set fire to Pennsylvania governor's residence; no one was injured",
            "external_url": "https://apnews.com/article/josh-shapiro-arson-police-fire-pennsylvania-governor-2d17ec60c48f7d4d15123dda60c88699",
            "upvotes": 3343,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> In a statement, Shapiro, viewed as a potential White House contender for the Democratic Party in 2028, said he and his family woke up at about 2 a.m. to bangs on the door from the Pennsylvania State Police after the fire broke out.\n\nThis could have ended horrifically, and makes me think there was more to this than just a case of arson. I mean, wow.\n\nEDIT: It's occurred to me after speaking with some other redditors that this building would have had on-site security, so not only will someone probably be getting fired, but they were more safe than I initially assumed. \n\nStill, this isn't great.",
                "> The Harrisburg Bureau of Fire was called to the residence and, while they worked to put out the fire, police evacuated Shapiro and his family from the residence safely, Shapiro said.\n\"Thank God no one was injured and the fire was extinguished,” Shapiro said in a statement.\n\nI think the statement: someone tried to kill the Governor and his family is more accurate. So glad he and his loved ones are alright.",
                "It may or may not be coincidence, but Saturday was the first night of Passover.",
                "On Passover weekend, too. I believe he is Jewish.",
                "Happened to a Jewish governor as he and his family were sleeping after celebrating Passover in the evening. First conclusion in my head is hate crime.",
                "US Domestic terrorists are certainly emboldened and have been in the last 10 years. I don’t see an end soon, but hope for one.",
                "Where were the security forces?",
                "I'm sure Barbie Bondi will be on the case with the same zeal as if someone urinated on the tire of a Tesla.\n\n/s",
                "With the way society is today, it could be:\n\n1. QAnon wacko hating a Jewish governor for Passover because of \"jews in power\".\n\n2. Racist variant of the pro-Palestine / anti-Israel supporters who justify hate against all jews, on Passover.\n\n3. Something just sparked, and the security found out late.",
                "First night of Passover for a Jewish governor and his family…\n\n\nThis was definitely a hate crime"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Suspect in custody after overnight fire at Pennsylvania Gov. Josh Shapiro's residence",
            "external_url": "https://www.nbcnews.com/news/us-news/gov-josh-shapiro-residence-arson-investigation-rcna201044",
            "upvotes": 1005,
            "date": "04/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250213-josh-shapiro-lm-1045-122cc2.jpg",
            "top_comments": [
                "Fits the bill of a domestic terrorist.",
                "So this person will be charged federally with domestic terrorism, right? Or is that only if you vandalize a Tesla?",
                "What does he think the governor has to do with foreclosures?",
                "Supposedly angry about his property being seized and auctioned off.  \n\nhttps://www.timesnownews.com/world/us/us-news/was-cody-balmer-upset-with-gov-josh-shapiro-over-property-seizure-court-document-surfaces-article-151411593",
                "I’m sort of relieved that this guy is just your normal run of the mill asshole. I was expecting the worst.",
                "everyone is so quick to attach their pet cause to the reason (the arsonist must be anti-israel, maga, trans, etc.) and it ends up being some dude who has a personal beef. Go figure.",
                "Domestic terrorism. Its funny how Trump supporters do dumb shit that conflicts with what Trump says. One of his own patriots is a pedophile. Another tried to kill a cop. Patriots indeed, colonel sanders.",
                "Will he get pardoned by drumph and get a new job in the PA coal mines that are coming back? So maybe even pay him, as he is now a “patriot”?",
                "Good news. Just so long as all the Teslas are safe tonight.",
                "Add hate crime.  \n\nDone on Passover in the same room as the Seder. \n\nBe sure to hit him with multiple STATE crimes too so Trump can’t pardon him."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "At least 32 people killed in Russian ballistic missile attack on Sumy",
            "external_url": "https://www.bbc.com/news/articles/c4g4262x4x1o",
            "upvotes": 2549,
            "date": "04/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/a817/live/87b50910-18ae-11f0-b1b3-7358f8d35a35.jpg",
            "top_comments": [
                "Russia is a terrorist country.",
                "Longest “One day to end the war” ever.",
                "Cluster munitions fired upon civilians on Palm Sunday. Are there still people in Russia who think this is justified?",
                "And now Donald Treump will give everything a war criminal ask.",
                "Honestly? And I hope some Russian operative reads this. Fuck you Putin. Burn in a future hell.\n\nOf all the days, Palm Sunday.. not that I condone violence on other days, but this is especially evil..",
                "Sure wish neocons like Victoria Nuland never facilitated the Maidan Coup, and that only they, not American taxpayers, were made responsible for the money spent and blood spilled."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Helicopter in fatal New York crash lacked flight recorders, officials say",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/13/helicopter-new-york-crash",
            "upvotes": 2016,
            "date": "04/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/dbea5a7eb88439e5faf969e2db225b3a65afc240/0_203_7701_4623/master/7701.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d754c302a6b984d7e0af88a7110f32a5",
            "top_comments": [
                "From the article:\n> No video or camera recorders have been recovered from the Bell 206 helicopter, the NTSB said in an update late on Saturday – and none of the equipment on it had recorded information that would help the investigation.\n> \n> New York police divers were continuing to search for parts of the helicopter, including the main rotor, gear box, tail rotor and the tail boom, the safety agency said.\n\nI don’t know where a flight recorder would be installed. But nothing in the article concludes that the air craft was without a flight corder prior to the incident. Only that one has not been found.",
                "Well, no shit.  A Bell 206 helicopter [isn't required to have an FDR or voice recorder.](https://www.law.cornell.edu/cfr/text/14/91.609#:~:text=(1)%20No%20person%20may%20operate,8%20hours%20of%20aircraft%20operation).",
                "These helicopters don’t have flight recorders, because they aren’t mandatory for this size of aircraft. \n\nSo maybe it’s time the FAA makes them mandatory.",
                "The vast majority of helicopters operating under part 135 don't have flight recorders. This isn't news.",
                "This isn't news. They're not required for those operations.",
                "Oh come on, don't let your fk up fuel the conspiracy theories",
                "Out of all the thing that suck in this world the news is really trying to get me to care about this",
                ">\"It was also on its eighth tour flight of the day, having already completed seven, according to federal investigators.\"\n\nThe people who were on the seventh flight of the day (the one immediately preceding the fatal flight) must be pretty relieved/amazed at their good fortune. I am sure they will be interviewed as part of the investigation to see if they noticed anything out of the ordinary.",
                "wouldn’t be fitted, wouldn’t be expected. wouldn’t be a surprise.  move on",
                "Not sure how a recorder helps it not fall apart."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "China’s Xi tells Spanish PM that partnership needed, no mention of talks with US",
            "external_url": "https://apnews.com/article/spain-sanchez-china-tariffs-eu-trade-war-edbd71d8359c86fb01f953728527d0a5?utm_source=copy&utm_medium=share",
            "upvotes": 815,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The current US President found a way to make Xi look reasonable and statesmanlike. New achievement unlocked.",
                "*U.S. Treasury Secretary Scott Bessent called out Spain for its move toward China, saying on Tuesday that Spain — or any country that tries to get closer to China — would be “cutting their own throat” because Chinese manufacturers will be looking to dump goods that they can’t sell in the U.S.*\n\nWhile other countries pursue cooperation during this trade chaos, the imperial Bessent talks of \"cutting throats\" and refers to Chinese shipments to Europe as \"dumping.\"",
                "If EU members can't work with the US, they'll work with someone else.",
                "I would say that China is stealing all of the US's soft power, but that would imply that the US didn't abandon their soft power on the side of the road in the middle of nowhere.",
                "Art of the deal! Make everyone angry against you so they make deals behind your back.",
                "Well I mean if the US wants to isolate itself to the degree that it's acting like there really isn't a reason to ever talk to the US for anything other than \"get your airbase out of my country\".",
                "Good Olde Uncle Donnie, busy making America so great, the world is quickly leaving us so far behind, the dust bowl is starting to sound appealing.",
                "EU, Latin America, Canada, Asia joining forces would shut the bully up for good, permanently.",
                "Xi never reached out to Trump.  Trump is literally slapping himself on live TV.  Xi has to do is just sit and watch Trump shoot himself.",
                "I don't like Xi, but at least he doesn't insult the EU on a daily basis. The bar is THAT low nowadays."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Bomb goes off outside Hellenic Train offices in Athens",
            "external_url": "https://www.cnn.com/2025/04/12/europe/bomb-greece-hellenic-train-athens-intl/index.html",
            "upvotes": 187,
            "date": "04/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2209120782.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If it's the one that comes up on Google maps, this wasn't far from the Acropolis Museum and that area in general. Do they know if they bomb was intended to go off when more people would be around?",
                "Terrifying. Sending good energy to everyone there"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Wisconsin teen allegedly killed parents in extremist plot to assassinate Trump, FBI says",
            "external_url": "https://abcnews.go.com/US/wisconsin-teen-allegedly-killed-parents-extremist-plot-assassinate/story?id=120750496",
            "upvotes": 2741,
            "date": "04/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/434debed-e7fb-439e-8ca2-a049d72f56af/waukesha-shooter-02-ht-jt-250412_1744482092946_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "hearing the story on the news yesterday was wild because each sentence just got weirder than the last 😭\n\n1. killed his parents\n\n2. plots against trump\n\n3. wrote a manifesto discussing plans to take over america\n\n4. loved hitler and wants a new order of neo nazism",
                "They conveniently leave the other half of the headline out. That he wanted to kill Trump to start a race war.",
                ">The sheriff's department issued a search warrant and say they found material on the teen's phone related to \"The Order of Nine Angles,\" which is \"a network of individuals holding new-Nazi racially motivated extremist views,\" according to investigators.\n\nWhy can't we say \"gang\"? If 'a network of individuals' isn't gang or a mob then what is it? Call them an anti-american Nazi gang.",
                "It’s crazy how many of these mass shooters fall into white nationalism rabbit holes. \n\nI watched Frontline’s documentary on Terrorgram, and it’s really scary how effective it is playing out in real time.",
                "These headlines keep leaving of the white supremacist part.",
                "Interesting that all those who have plotted to kill him so far have been fellow right-wingers.",
                "\"Wisconsin NEO-NAZI & WHITE SUPREMACIST killed parents, aspired to assassination and instigate a race war.\"\n\n- Fixed the title for you",
                "Of course the conservative subs are only sharing the headline.",
                "Why did he have to mess with his parents? No focus",
                "Every single time this story is presented the Media refuses to also mention that he is a Neo-Nazi."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Suspect in custody after overnight fire at Pennsylvania Gov. Josh Shapiro's residence",
            "external_url": "https://www.nbcnews.com/news/us-news/gov-josh-shapiro-residence-arson-investigation-rcna201044",
            "upvotes": 1004,
            "date": "04/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250213-josh-shapiro-lm-1045-122cc2.jpg",
            "top_comments": [
                "Fits the bill of a domestic terrorist.",
                "So this person will be charged federally with domestic terrorism, right? Or is that only if you vandalize a Tesla?",
                "What does he think the governor has to do with foreclosures?",
                "Supposedly angry about his property being seized and auctioned off.  \n\nhttps://www.timesnownews.com/world/us/us-news/was-cody-balmer-upset-with-gov-josh-shapiro-over-property-seizure-court-document-surfaces-article-151411593",
                "I’m sort of relieved that this guy is just your normal run of the mill asshole. I was expecting the worst.",
                "everyone is so quick to attach their pet cause to the reason (the arsonist must be anti-israel, maga, trans, etc.) and it ends up being some dude who has a personal beef. Go figure.",
                "Domestic terrorism. Its funny how Trump supporters do dumb shit that conflicts with what Trump says. One of his own patriots is a pedophile. Another tried to kill a cop. Patriots indeed, colonel sanders.",
                "Will he get pardoned by drumph and get a new job in the PA coal mines that are coming back? So maybe even pay him, as he is now a “patriot”?",
                "Good news. Just so long as all the Teslas are safe tonight.",
                "Add hate crime.  \n\nDone on Passover in the same room as the Seder. \n\nBe sure to hit him with multiple STATE crimes too so Trump can’t pardon him."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "SSA shifts to X posts for official messaging after cuts to communications staff",
            "external_url": "https://federalnewsnetwork.com/agency-oversight/2025/04/ssa-shifts-to-x-posts-for-official-messaging-after-cuts-to-communications-staff",
            "upvotes": 1684,
            "date": "04/13/2025",
            "thumbnail": "https://federalnewsnetwork.com/wp-content/uploads/2020/11/social-security-administration-office-e1581706167448.jpg",
            "top_comments": [
                "Lots of middle aged people gonna be getting calls from their elderly parents asking wtf is X",
                "And you can’t read messages without an account, thus sharing your private information with and boosting the subscriber count of a social media company privately owned by the person who ordered the change in policy. This country is fucked.",
                "Is this a plan to funnel more older people into a right wing echo chamber?",
                "Absolutely zero conflict of interest with that",
                "Why is a private company, twitter, the official announcement portal of a public benefit? This is silly.",
                "X/Twitter is a failing/failed network that needs to be propped up, so of course Mr Musk was going to demand a forced audience. Just another example of corporate welfare.",
                "Because people over 65 use Twitter so much.",
                "[deleted]",
                "Unless they're seriously trying to get a whole bunch of elderly people to use X for direct communications and such, somebody should just set up a bot to immediately repost any of their X posts to the various non-Nazi networks.",
                "Going to take decades to even start to fix this crap. If ever."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Photojournalist witnesses Venezuelan migrants' arrival in El Salvador: \"They had no idea what was coming\"",
            "external_url": "https://www.cbsnews.com/news/photojournalist-witnesses-venezuelan-migrants-arrival-in-el-salvador-60-minutes/",
            "upvotes": 1349,
            "date": "04/13/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/06/da9c7d4e-5da8-4430-8117-a4fde4f3f90f/thumbnail/1200x630/7daaa28a52c6e0a7bd01b4da3952c547/ot-deporteesphilipholsinger.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "When you thought WWII internment camps weren't bad enough, this administration was sure they could bring us to a new, shameful low point.",
                "Can someone explain to me why El Salvador (the government, not the people,) is taking these people?? Is it JUST money?? Are they trying to be on the administrations good side?? \n\nI am sincerely asking.",
                "There is no way to spin this, this is plain and simple terrorism for someone's pleasure.  This is sick and we will never be able to unsee this abuse of power. The people that instigated this and participate in this atrocity are the ones that belong in prison.",
                "If those Venezuelans committed no crimes against El Salvador, what justification do they have to detain them?\n\nTrump said he had no power over them once they left US jurisdiction; so, the USA is effectively selling slaves again. \n\nSomehow, there should be a class action for the 13th Amendment. No judge sentenced them to indentured servitude for a crime.",
                ">As Holsinger snapped the last few photographs, he felt that he had just watched the Venezuelan men become \"ghosts.\" \n\n>\"They've been stripped of their hair and their clothes… It's like your life just ceased to exist. You're just a person in white clothes now,\" Holsinger said. \n\n>\"And it was a sense of watching people disappear.\"\n\nAs a photography lover, these photos are extraordinary. \n\nAs a human, the above quote is haunting. We are all sitting by and watching people being deported to concentration camps. With absolute zero resistance to it.\n\nCan someone tell me what we can do now? What can we actually do to stop this? Is it too late?",
                "Americans sending innocent people to gulags, not wanting to lose their treats or have the slightest inconvenience. Bread and circuses.. ",
                "Because why they would expect a \"great\" nation like the U.S. to treat them like animals?",
                "It is a concentration camp.\n\n\nSomeone please call it was it is. The guards are literally yelling \"Fast! Fast! Fast\".\n\n\n\nThe guards at the camps during World War II yelled \"Schnell! Schnell! Schnell!\"",
                "Call it for what it is - They're being sent to Republican Death camps.",
                "We are a disgusting nation"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "China Halts Critical Exports as Trade War Intensifies",
            "external_url": "https://www.nytimes.com/2025/04/13/business/china-rare-earths-exports.html?unlocked_article_code=1._U4.oI-5.uzRy92ofA0b5&smid=nytcore-android-share",
            "upvotes": 5391,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The metals, and special magnets made with them, can now be shipped out of China only with special export licenses.\n\n>But China has barely started setting up a system for issuing the licenses. That has caused consternation among industry executives that the process could drag on and that current supplies of minerals and products outside of China could run low.\n\nAnd I'm betting they're in no great hurry.",
                "Has Trump tried tariffing 1000%? Maybe that'll do it.",
                "Thanks, as always, Trump. Always finding new and exciting ways to fuck everyone over.",
                "Any entry-level frat boy at a hedgie would be gone by now, and replaced.",
                "trump, playing 1-D chess",
                "They’ll sell it somewhere else.",
                "China probably had always wanted to restrict these exports and now have a very good legitimate reason for doing so. DJT totally played into their hands.",
                "It's almost funny that Trump THINKS he can try to fuck up other countries expecting them to not retaliate.\nUSA doesn't produce everything it consumes. In fact, if every country stopped selling everything to USA, it would crumble. Maybe that should be a plan...",
                "China is beating the felon to a pulp. He’s no match for them and neither are his advisors.",
                ">Does the export control or ban potentially have severe effects in the U.S.? Yes,” he said. Mr. Pickard, leader of the international trade and national security practice at the Buchanan Ingersoll & Rooney law firm, **said a swift resolution of the rare earths issue was necessary because a sustained disruption of exports could hurt China’s reputation as a reliable supplier.**\n\nanyone care to inform Mr Packard that the idiot who started this is to blame rather casting his opinion on China for being a \"reputable supplier\"?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "China’s Xi tells Spanish PM that partnership needed, no mention of talks with US",
            "external_url": "https://apnews.com/article/spain-sanchez-china-tariffs-eu-trade-war-edbd71d8359c86fb01f953728527d0a5?utm_source=copy&utm_medium=share",
            "upvotes": 814,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The current US President found a way to make Xi look reasonable and statesmanlike. New achievement unlocked.",
                "*U.S. Treasury Secretary Scott Bessent called out Spain for its move toward China, saying on Tuesday that Spain — or any country that tries to get closer to China — would be “cutting their own throat” because Chinese manufacturers will be looking to dump goods that they can’t sell in the U.S.*\n\nWhile other countries pursue cooperation during this trade chaos, the imperial Bessent talks of \"cutting throats\" and refers to Chinese shipments to Europe as \"dumping.\"",
                "If EU members can't work with the US, they'll work with someone else.",
                "I would say that China is stealing all of the US's soft power, but that would imply that the US didn't abandon their soft power on the side of the road in the middle of nowhere.",
                "Art of the deal! Make everyone angry against you so they make deals behind your back.",
                "Well I mean if the US wants to isolate itself to the degree that it's acting like there really isn't a reason to ever talk to the US for anything other than \"get your airbase out of my country\".",
                "Good Olde Uncle Donnie, busy making America so great, the world is quickly leaving us so far behind, the dust bowl is starting to sound appealing.",
                "EU, Latin America, Canada, Asia joining forces would shut the bully up for good, permanently.",
                "Xi never reached out to Trump.  Trump is literally slapping himself on live TV.  Xi has to do is just sit and watch Trump shoot himself.",
                "I don't like Xi, but at least he doesn't insult the EU on a daily basis. The bar is THAT low nowadays."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "NEW",
            "title": "King's College scientists' lab-grown human teeth breakthrough",
            "external_url": "https://www.bbc.com/news/articles/cj9ejj3jzrwo",
            "upvotes": 838,
            "date": "04/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/81f1/live/3ae8ad00-116d-11f0-a3a8-cd0c869b6aeb.jpg",
            "top_comments": [
                "Unfortunately teeth are considered luxury bones depending on where you live. Damaged teeth are an immense source of constant stress, pain, and focus for people with those issues and with Americans mostly living paycheck to paycheck, you can guess how it affects them constantly when coupled with the lower standards for food, further leading to tooth damage.\n\nI hope I live long enough to see this matter, but I feel I'll just see this breakthrough forced into obscurity.",
                "Why is this pop up always there pestering me to REGISTERRRRR",
                "New set of teeth in 24 hours!",
                "What happened to that Japanese treatment that makes a nerve in your gums start to grow a tooth?\n\nWhile terrifying, it did seem like a major thing if factual.",
                "So I can finally have the built-in castanets I’ve always dreamed of?! \n\nMy flamenco routine is gonna be GREAT",
                "We’ll never hear about it again for at least 11 years. For commonality, that is. -THE HS."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "NEW",
            "title": "Police: Someone set fire to Pennsylvania governor's residence; no one was injured",
            "external_url": "https://apnews.com/article/josh-shapiro-arson-police-fire-pennsylvania-governor-2d17ec60c48f7d4d15123dda60c88699",
            "upvotes": 3348,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> In a statement, Shapiro, viewed as a potential White House contender for the Democratic Party in 2028, said he and his family woke up at about 2 a.m. to bangs on the door from the Pennsylvania State Police after the fire broke out.\n\nThis could have ended horrifically, and makes me think there was more to this than just a case of arson. I mean, wow.\n\nEDIT: It's occurred to me after speaking with some other redditors that this building would have had on-site security, so not only will someone probably be getting fired, but they were more safe than I initially assumed. \n\nStill, this isn't great.",
                "> The Harrisburg Bureau of Fire was called to the residence and, while they worked to put out the fire, police evacuated Shapiro and his family from the residence safely, Shapiro said.\n\"Thank God no one was injured and the fire was extinguished,” Shapiro said in a statement.\n\nI think the statement: someone tried to kill the Governor and his family is more accurate. So glad he and his loved ones are alright.",
                "It may or may not be coincidence, but Saturday was the first night of Passover.",
                "On Passover weekend, too. I believe he is Jewish.",
                "Happened to a Jewish governor as he and his family were sleeping after celebrating Passover in the evening. First conclusion in my head is hate crime.",
                "US Domestic terrorists are certainly emboldened and have been in the last 10 years. I don’t see an end soon, but hope for one.",
                "Where were the security forces?",
                "I'm sure Barbie Bondi will be on the case with the same zeal as if someone urinated on the tire of a Tesla.\n\n/s",
                "With the way society is today, it could be:\n\n1. QAnon wacko hating a Jewish governor for Passover because of \"jews in power\".\n\n2. Racist variant of the pro-Palestine / anti-Israel supporters who justify hate against all jews, on Passover.\n\n3. Something just sparked, and the security found out late.",
                "First night of Passover for a Jewish governor and his family…\n\n\nThis was definitely a hate crime"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "DHS Mistakenly tells attorney US Citizen to leave the US",
            "external_url": "https://www.nbcboston.com/news/local/massachusetts-immigration-attorney-dhs-parole-termination/3684504/",
            "upvotes": 19726,
            "date": "04/13/2025",
            "thumbnail": "https://media.nbcboston.com/2025/04/dhs-parole-termination-notice-attorney.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "NPR last week interviewed a US attorney who is a US citizen, and he said the Trump administration is targeting US immigration attorneys. He was coming back from vacation and crossed the border checkpoint.That is when border patrol targeted him and detained him, then tried to confiscate his phone. They told him he was on a list for terrorists. He told them he had over ten years of attorney client privilege communications on his phone.  He told them absolutely not in confiscating his phone.  He said there are other immigration attorneys he personally knows that are also being harrassed by ICE and border patrol.\nhttps://www.npr.org/2025/04/09/nx-s1-5357455/attorney-detained-by-immigration-authorities",
                "This isn’t a mistake it’s a trial balloon",
                ">Mistakenly\n\nYeah, I’m sure it was. No veiled threats here, guys.",
                "*CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients.*\n\nYep, totally explains why the American citizen contact was the only one named in the notice. Sure guys, makes total sense.",
                "An immigration attorney….seems suspicious.",
                "It's ridiculous that they think sending an email is adequate for such communication, even if it were legit. \"Oh, it went to your spam, so you didn't see it? Well, it's off to El Salvador for you.\"",
                "What dehumanizing language\n\n “ CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients”",
                "Quick question - where the fuck would a native born US citizen with no connections to any other nation go?",
                "I have a bridge to sell you if you think it was a mistake",
                "Mistakenly telling people to leave. Mistakenly deporting people. Mistakenly firing people. \nMistakenly doing Nazi salutes"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Wisconsin teen allegedly killed parents in extremist plot to assassinate Trump, FBI says",
            "external_url": "https://abcnews.go.com/US/wisconsin-teen-allegedly-killed-parents-extremist-plot-assassinate/story?id=120750496",
            "upvotes": 2754,
            "date": "04/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/434debed-e7fb-439e-8ca2-a049d72f56af/waukesha-shooter-02-ht-jt-250412_1744482092946_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "hearing the story on the news yesterday was wild because each sentence just got weirder than the last 😭\n\n1. killed his parents\n\n2. plots against trump\n\n3. wrote a manifesto discussing plans to take over america\n\n4. loved hitler and wants a new order of neo nazism",
                "They conveniently leave the other half of the headline out. That he wanted to kill Trump to start a race war.",
                ">The sheriff's department issued a search warrant and say they found material on the teen's phone related to \"The Order of Nine Angles,\" which is \"a network of individuals holding new-Nazi racially motivated extremist views,\" according to investigators.\n\nWhy can't we say \"gang\"? If 'a network of individuals' isn't gang or a mob then what is it? Call them an anti-american Nazi gang.",
                "It’s crazy how many of these mass shooters fall into white nationalism rabbit holes. \n\nI watched Frontline’s documentary on Terrorgram, and it’s really scary how effective it is playing out in real time.",
                "These headlines keep leaving of the white supremacist part.",
                "Interesting that all those who have plotted to kill him so far have been fellow right-wingers.",
                "\"Wisconsin NEO-NAZI & WHITE SUPREMACIST killed parents, aspired to assassination and instigate a race war.\"\n\n- Fixed the title for you",
                "Of course the conservative subs are only sharing the headline.",
                "Why did he have to mess with his parents? No focus",
                "Every single time this story is presented the Media refuses to also mention that he is a Neo-Nazi."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Suspect in custody after overnight fire at Pennsylvania Gov. Josh Shapiro's residence",
            "external_url": "https://www.nbcnews.com/news/us-news/gov-josh-shapiro-residence-arson-investigation-rcna201044",
            "upvotes": 1004,
            "date": "04/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250213-josh-shapiro-lm-1045-122cc2.jpg",
            "top_comments": [
                "Fits the bill of a domestic terrorist.",
                "So this person will be charged federally with domestic terrorism, right? Or is that only if you vandalize a Tesla?",
                "What does he think the governor has to do with foreclosures?",
                "Supposedly angry about his property being seized and auctioned off.  \n\nhttps://www.timesnownews.com/world/us/us-news/was-cody-balmer-upset-with-gov-josh-shapiro-over-property-seizure-court-document-surfaces-article-151411593",
                "I’m sort of relieved that this guy is just your normal run of the mill asshole. I was expecting the worst.",
                "everyone is so quick to attach their pet cause to the reason (the arsonist must be anti-israel, maga, trans, etc.) and it ends up being some dude who has a personal beef. Go figure.",
                "Domestic terrorism. Its funny how Trump supporters do dumb shit that conflicts with what Trump says. One of his own patriots is a pedophile. Another tried to kill a cop. Patriots indeed, colonel sanders.",
                "Will he get pardoned by drumph and get a new job in the PA coal mines that are coming back? So maybe even pay him, as he is now a “patriot”?",
                "Good news. Just so long as all the Teslas are safe tonight.",
                "Add hate crime.  \n\nDone on Passover in the same room as the Seder. \n\nBe sure to hit him with multiple STATE crimes too so Trump can’t pardon him."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Photojournalist witnesses Venezuelan migrants' arrival in El Salvador: \"They had no idea what was coming\"",
            "external_url": "https://www.cbsnews.com/news/photojournalist-witnesses-venezuelan-migrants-arrival-in-el-salvador-60-minutes/",
            "upvotes": 1347,
            "date": "04/13/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/06/da9c7d4e-5da8-4430-8117-a4fde4f3f90f/thumbnail/1200x630/7daaa28a52c6e0a7bd01b4da3952c547/ot-deporteesphilipholsinger.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "When you thought WWII internment camps weren't bad enough, this administration was sure they could bring us to a new, shameful low point.",
                "Can someone explain to me why El Salvador (the government, not the people,) is taking these people?? Is it JUST money?? Are they trying to be on the administrations good side?? \n\nI am sincerely asking.",
                "There is no way to spin this, this is plain and simple terrorism for someone's pleasure.  This is sick and we will never be able to unsee this abuse of power. The people that instigated this and participate in this atrocity are the ones that belong in prison.",
                "If those Venezuelans committed no crimes against El Salvador, what justification do they have to detain them?\n\nTrump said he had no power over them once they left US jurisdiction; so, the USA is effectively selling slaves again. \n\nSomehow, there should be a class action for the 13th Amendment. No judge sentenced them to indentured servitude for a crime.",
                ">As Holsinger snapped the last few photographs, he felt that he had just watched the Venezuelan men become \"ghosts.\" \n\n>\"They've been stripped of their hair and their clothes… It's like your life just ceased to exist. You're just a person in white clothes now,\" Holsinger said. \n\n>\"And it was a sense of watching people disappear.\"\n\nAs a photography lover, these photos are extraordinary. \n\nAs a human, the above quote is haunting. We are all sitting by and watching people being deported to concentration camps. With absolute zero resistance to it.\n\nCan someone tell me what we can do now? What can we actually do to stop this? Is it too late?",
                "Americans sending innocent people to gulags, not wanting to lose their treats or have the slightest inconvenience. Bread and circuses.. ",
                "Because why they would expect a \"great\" nation like the U.S. to treat them like animals?",
                "It is a concentration camp.\n\n\nSomeone please call it was it is. The guards are literally yelling \"Fast! Fast! Fast\".\n\n\n\nThe guards at the camps during World War II yelled \"Schnell! Schnell! Schnell!\"",
                "Call it for what it is - They're being sent to Republican Death camps.",
                "We are a disgusting nation"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "SSA shifts to X posts for official messaging after cuts to communications staff",
            "external_url": "https://federalnewsnetwork.com/agency-oversight/2025/04/ssa-shifts-to-x-posts-for-official-messaging-after-cuts-to-communications-staff",
            "upvotes": 1680,
            "date": "04/13/2025",
            "thumbnail": "https://federalnewsnetwork.com/wp-content/uploads/2020/11/social-security-administration-office-e1581706167448.jpg",
            "top_comments": [
                "Lots of middle aged people gonna be getting calls from their elderly parents asking wtf is X",
                "And you can’t read messages without an account, thus sharing your private information with and boosting the subscriber count of a social media company privately owned by the person who ordered the change in policy. This country is fucked.",
                "Is this a plan to funnel more older people into a right wing echo chamber?",
                "Absolutely zero conflict of interest with that",
                "Why is a private company, twitter, the official announcement portal of a public benefit? This is silly.",
                "X/Twitter is a failing/failed network that needs to be propped up, so of course Mr Musk was going to demand a forced audience. Just another example of corporate welfare.",
                "Because people over 65 use Twitter so much.",
                "[deleted]",
                "Unless they're seriously trying to get a whole bunch of elderly people to use X for direct communications and such, somebody should just set up a bot to immediately repost any of their X posts to the various non-Nazi networks.",
                "Going to take decades to even start to fix this crap. If ever."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "China Halts Critical Exports as Trade War Intensifies",
            "external_url": "https://www.nytimes.com/2025/04/13/business/china-rare-earths-exports.html?unlocked_article_code=1._U4.oI-5.uzRy92ofA0b5&smid=nytcore-android-share",
            "upvotes": 5388,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The metals, and special magnets made with them, can now be shipped out of China only with special export licenses.\n\n>But China has barely started setting up a system for issuing the licenses. That has caused consternation among industry executives that the process could drag on and that current supplies of minerals and products outside of China could run low.\n\nAnd I'm betting they're in no great hurry.",
                "Has Trump tried tariffing 1000%? Maybe that'll do it.",
                "Thanks, as always, Trump. Always finding new and exciting ways to fuck everyone over.",
                "Any entry-level frat boy at a hedgie would be gone by now, and replaced.",
                "trump, playing 1-D chess",
                "They’ll sell it somewhere else.",
                "China probably had always wanted to restrict these exports and now have a very good legitimate reason for doing so. DJT totally played into their hands.",
                "It's almost funny that Trump THINKS he can try to fuck up other countries expecting them to not retaliate.\nUSA doesn't produce everything it consumes. In fact, if every country stopped selling everything to USA, it would crumble. Maybe that should be a plan...",
                "China is beating the felon to a pulp. He’s no match for them and neither are his advisors.",
                ">Does the export control or ban potentially have severe effects in the U.S.? Yes,” he said. Mr. Pickard, leader of the international trade and national security practice at the Buchanan Ingersoll & Rooney law firm, **said a swift resolution of the rare earths issue was necessary because a sustained disruption of exports could hurt China’s reputation as a reliable supplier.**\n\nanyone care to inform Mr Packard that the idiot who started this is to blame rather casting his opinion on China for being a \"reputable supplier\"?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "King's College scientists' lab-grown human teeth breakthrough",
            "external_url": "https://www.bbc.com/news/articles/cj9ejj3jzrwo",
            "upvotes": 842,
            "date": "04/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/81f1/live/3ae8ad00-116d-11f0-a3a8-cd0c869b6aeb.jpg",
            "top_comments": [
                "Unfortunately teeth are considered luxury bones depending on where you live. Damaged teeth are an immense source of constant stress, pain, and focus for people with those issues and with Americans mostly living paycheck to paycheck, you can guess how it affects them constantly when coupled with the lower standards for food, further leading to tooth damage.\n\nI hope I live long enough to see this matter, but I feel I'll just see this breakthrough forced into obscurity.",
                "Why is this pop up always there pestering me to REGISTERRRRR",
                "New set of teeth in 24 hours!",
                "What happened to that Japanese treatment that makes a nerve in your gums start to grow a tooth?\n\nWhile terrifying, it did seem like a major thing if factual.",
                "So I can finally have the built-in castanets I’ve always dreamed of?! \n\nMy flamenco routine is gonna be GREAT",
                "We’ll never hear about it again for at least 11 years. For commonality, that is. -THE HS."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "China’s Xi tells Spanish PM that partnership needed, no mention of talks with US",
            "external_url": "https://apnews.com/article/spain-sanchez-china-tariffs-eu-trade-war-edbd71d8359c86fb01f953728527d0a5?utm_source=copy&utm_medium=share",
            "upvotes": 811,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The current US President found a way to make Xi look reasonable and statesmanlike. New achievement unlocked.",
                "*U.S. Treasury Secretary Scott Bessent called out Spain for its move toward China, saying on Tuesday that Spain — or any country that tries to get closer to China — would be “cutting their own throat” because Chinese manufacturers will be looking to dump goods that they can’t sell in the U.S.*\n\nWhile other countries pursue cooperation during this trade chaos, the imperial Bessent talks of \"cutting throats\" and refers to Chinese shipments to Europe as \"dumping.\"",
                "If EU members can't work with the US, they'll work with someone else.",
                "I would say that China is stealing all of the US's soft power, but that would imply that the US didn't abandon their soft power on the side of the road in the middle of nowhere.",
                "Art of the deal! Make everyone angry against you so they make deals behind your back.",
                "Well I mean if the US wants to isolate itself to the degree that it's acting like there really isn't a reason to ever talk to the US for anything other than \"get your airbase out of my country\".",
                "Good Olde Uncle Donnie, busy making America so great, the world is quickly leaving us so far behind, the dust bowl is starting to sound appealing.",
                "EU, Latin America, Canada, Asia joining forces would shut the bully up for good, permanently.",
                "Xi never reached out to Trump.  Trump is literally slapping himself on live TV.  Xi has to do is just sit and watch Trump shoot himself.",
                "I don't like Xi, but at least he doesn't insult the EU on a daily basis. The bar is THAT low nowadays."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Police: Someone set fire to Pennsylvania governor's residence; no one was injured",
            "external_url": "https://apnews.com/article/josh-shapiro-arson-police-fire-pennsylvania-governor-2d17ec60c48f7d4d15123dda60c88699",
            "upvotes": 3351,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> In a statement, Shapiro, viewed as a potential White House contender for the Democratic Party in 2028, said he and his family woke up at about 2 a.m. to bangs on the door from the Pennsylvania State Police after the fire broke out.\n\nThis could have ended horrifically, and makes me think there was more to this than just a case of arson. I mean, wow.\n\nEDIT: It's occurred to me after speaking with some other redditors that this building would have had on-site security, so not only will someone probably be getting fired, but they were more safe than I initially assumed. \n\nStill, this isn't great.",
                "> The Harrisburg Bureau of Fire was called to the residence and, while they worked to put out the fire, police evacuated Shapiro and his family from the residence safely, Shapiro said.\n\"Thank God no one was injured and the fire was extinguished,” Shapiro said in a statement.\n\nI think the statement: someone tried to kill the Governor and his family is more accurate. So glad he and his loved ones are alright.",
                "It may or may not be coincidence, but Saturday was the first night of Passover.",
                "On Passover weekend, too. I believe he is Jewish.",
                "Happened to a Jewish governor as he and his family were sleeping after celebrating Passover in the evening. First conclusion in my head is hate crime.",
                "US Domestic terrorists are certainly emboldened and have been in the last 10 years. I don’t see an end soon, but hope for one.",
                "Where were the security forces?",
                "I'm sure Barbie Bondi will be on the case with the same zeal as if someone urinated on the tire of a Tesla.\n\n/s",
                "With the way society is today, it could be:\n\n1. QAnon wacko hating a Jewish governor for Passover because of \"jews in power\".\n\n2. Racist variant of the pro-Palestine / anti-Israel supporters who justify hate against all jews, on Passover.\n\n3. Something just sparked, and the security found out late.",
                "First night of Passover for a Jewish governor and his family…\n\n\nThis was definitely a hate crime"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "At least 32 people killed in Russian ballistic missile attack on Sumy",
            "external_url": "https://www.bbc.com/news/articles/c4g4262x4x1o",
            "upvotes": 2550,
            "date": "04/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/a817/live/87b50910-18ae-11f0-b1b3-7358f8d35a35.jpg",
            "top_comments": [
                "Russia is a terrorist country.",
                "Longest “One day to end the war” ever.",
                "Cluster munitions fired upon civilians on Palm Sunday. Are there still people in Russia who think this is justified?",
                "And now Donald Treump will give everything a war criminal ask.",
                "Honestly? And I hope some Russian operative reads this. Fuck you Putin. Burn in a future hell.\n\nOf all the days, Palm Sunday.. not that I condone violence on other days, but this is especially evil..",
                "Sure wish neocons like Victoria Nuland never facilitated the Maidan Coup, and that only they, not American taxpayers, were made responsible for the money spent and blood spilled."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "DHS Mistakenly tells attorney US Citizen to leave the US",
            "external_url": "https://www.nbcboston.com/news/local/massachusetts-immigration-attorney-dhs-parole-termination/3684504/",
            "upvotes": 19728,
            "date": "04/13/2025",
            "thumbnail": "https://media.nbcboston.com/2025/04/dhs-parole-termination-notice-attorney.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "NPR last week interviewed a US attorney who is a US citizen, and he said the Trump administration is targeting US immigration attorneys. He was coming back from vacation and crossed the border checkpoint.That is when border patrol targeted him and detained him, then tried to confiscate his phone. They told him he was on a list for terrorists. He told them he had over ten years of attorney client privilege communications on his phone.  He told them absolutely not in confiscating his phone.  He said there are other immigration attorneys he personally knows that are also being harrassed by ICE and border patrol.\nhttps://www.npr.org/2025/04/09/nx-s1-5357455/attorney-detained-by-immigration-authorities",
                "This isn’t a mistake it’s a trial balloon",
                ">Mistakenly\n\nYeah, I’m sure it was. No veiled threats here, guys.",
                "*CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients.*\n\nYep, totally explains why the American citizen contact was the only one named in the notice. Sure guys, makes total sense.",
                "An immigration attorney….seems suspicious.",
                "It's ridiculous that they think sending an email is adequate for such communication, even if it were legit. \"Oh, it went to your spam, so you didn't see it? Well, it's off to El Salvador for you.\"",
                "What dehumanizing language\n\n “ CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients”",
                "Quick question - where the fuck would a native born US citizen with no connections to any other nation go?",
                "I have a bridge to sell you if you think it was a mistake",
                "Mistakenly telling people to leave. Mistakenly deporting people. Mistakenly firing people. \nMistakenly doing Nazi salutes"
            ],
            "aggregate_sentiment": 45.0
        }
    ],
    "last_updated": "04/14/2025 00:44:20 UTC"
}