{
    "posts": [
        {
            "category": "HOT",
            "title": "RFK Jr. says 20% of health agency layoffs could be mistakes",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-hhs-job-cuts-doge-mistakes/",
            "upvotes": 11789,
            "date": "04/04/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/02/03/2480592f-598f-4a1c-a1b4-a4ba2e37bf84/thumbnail/1200x630/3376b78922c70934a82e9a4e8794fc51/cbsn-fusion-does-rfk-jr-have-enough-support-from-republican-senators-thumbnail.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Is it him or the worm talking? Who made the mistake?",
                "Award for the most incompetent government of all time?",
                "He’s just such a fucking moron. Christ. Like look at this fucking idiocy:\n\n>”Part of the DOGE, we talked about this from the beginning, is we’re going to do 80% cuts, but 20% of those are going to have to be reinstated, because we’ll make mistakes,” Kennedy said, speaking to reporters at a stop in Virginia.\n\n>Kennedy said that the elimination of the Centers for Disease Control and Prevention’s **entire Lead Poisoning Prevention and Surveillance Branch** was among the mistakes.",
                "They fired thousands of employees trying to get a public relations win. Thats it.\n\nPathetic, amateur shit.",
                "The incompetence of this administration is just mind blowing...",
                "These dipshits! That's not how you treat employees. That's how you treat cattle. That's all we are to them.",
                "They're seriously just firing people to fire people. It's the dumbest concept in the world.\n\nIt's fine if it's your tech bro company, but not when it's the goddamn US government that the people of this country rely on.",
                "Everything the current administration does is a mistake",
                "How do you accidentally lay off people?",
                "Rfk is a mistake. Should have been aborted."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "Mehmet Oz confirmed by US Senate to lead Medicare and Medicaid",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/03/mehmet-oz-confirmation-medicare-medicaid",
            "upvotes": 17868,
            "date": "04/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/929fb0a8e383cf00a594c61b34bd66eac77804d6/308_184_4282_2570/master/4282.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=46fa54902ac733c5f57066f59d463592",
            "top_comments": [
                "A [quack](https://en.wikipedia.org/wiki/Medical_claims_on_The_Dr._Oz_Show) leading Medicare and Medicaid. Seems on point for this administration.",
                "And here I thought that they couldn't get any worse than RFK jr.\n\n1. I was wrong.\n\n2. I gotta stop saying that they can't make things worse because they turn that into a challenge.\n\n3. Congressional Republicans should be forced to use RFK jr and Oz as their Primary Care Physicians.",
                "Another grifter. Jesus fuck.",
                "The clown show continues",
                "Rejected by voters but still given power. Typical.",
                "Dr. Phil wasn’t available?",
                "I think I’d prefer nepotism or blatant corruption to just giving jobs to people he has seen on TV.",
                "Another sad day for American health. Dude is a snake oil salesman and con artist who doesn’t know shit about running the department.",
                "Embarassing is the new norm. Yet another greedy amoral charlatan representing America.",
                "Wait til they install Alex Jones as Director of the CIA"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "US NSA director Timothy Haugh fired, Washington Post reports",
            "external_url": "https://www.reuters.com/world/us/us-nsa-director-timothy-haugh-fired-washington-post-reports-2025-04-04/",
            "upvotes": 3591,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wonder if this is related to Laura Loomer's visit to the Oval Office yesterday that led to the firing of three NSC officials.",
                "The director and the No. 2 official at the National Security Agency were ousted from their positions Thursday, according to a defense official and three sources with knowledge of the matter.\n\nIt was not immediately clear why Air Force Gen. Timothy Haugh and his deputy were dismissed, the sources said.",
                "He must have been too competent and not a toady.",
                "Oh, we're changing NSA oversight after a far right meeting with the president.\n\nYeah that sounds safe and in no way concerning.",
                "They have purged most of the military and intelligence agency leadership. Scary stuff. ",
                "Because they were not \"loyal\"? How did this insidious concept creep into the administration vernacular without sounding alarm bells? People have forgotten how democracy works. Everyone isn't supposed to just agree with the President and do whatever he says.",
                "Reading up on him his studies were Russia related.  Can’t have a career intelligence officer that knows the in and out of Russia be the top spy.",
                "He testified at the senate hearing that there were risks to using Signal. When the team cheats but you don't, you get benched for not being a team player.",
                "Folks, this is when these Nazis start investigating and spying on their political enemies and they start falling out of windows and getting bad tea.",
                "I fear corruption. We're taking full 180 on US. I don't know how to feel about the future of humanity."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "South Korea president Yoon Suk Yeol removed from office after impeachment upheld by court",
            "external_url": "https://www.theguardian.com/world/2025/apr/04/south-korea-president-yoon-suk-yeol-impeachment-verdict-results-removal",
            "upvotes": 3306,
            "date": "04/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7e35f53af66efc35b0242cd0d374aed76dba896d/0_260_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c0144373a4894000309d7292281bb0ae",
            "top_comments": [
                "Bastard deserves to be impeached for the clumsy way he tried to seize power and dismantle democracy in Korea. Now we have wait to see if his followers accept things or continue making trouble.",
                "Can we have some of that sweet rule of law and democracy in the US, please?",
                "Unanimous verdict from all 8 justices",
                "Is impeachment trending? I hope so.",
                "The USA is the only first world country WITHOUT Universal healthcare.\n\nThe USA is the only country that allowed a TRAITOR to invade the Oval Office, the People's House.\n\n[https://www.npr.org/2023/07/08/1186508281/peru-prison-ex-presidents](https://www.npr.org/2023/07/08/1186508281/peru-prison-ex-presidents)",
                "*daydreams listfully in American.*\n\nOne day. One day we may have this too.",
                "Someday America may become a developed country with a proper judiciary and rule of law",
                "Man this road was a precarious one, but it's finally over. Even though the judge's proclamation was pretty clear, I was on edge until he finally said the word impeached.",
                "The facts of the case were so clear cut, at least as a bystander. There didn't seem to be much of a defense either on the part of Yoon. \n\nGlad he's impeached. fingers crossed for criminal charges.",
                "South Korea, somewhat a student learned elections process from the U.S., can do this. The teacher can’t. Now It’s time for the U.S. to be the student and learn from Koreans"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "Tariff-related layoffs hit five US auto plants that supply factories in Canada and Mexico",
            "external_url": "https://www.abc12.com/news/tariff-related-layoffs-hit-five-us-auto-plants-that-supply-factories-in-canada-and-mexico/article_6d95d30a-9956-521c-86e2-a62c9b07d3f4.html?fbclid=IwZXh0bgNhZW0CMTEAAR2xPs0qVaSgfUJmdqsaFHK_By3_8B-vrj9GDws297UllzMvWzCnes45dzw_aem_dyNT8yFsAPiIgD3r5Nwnnw",
            "upvotes": 2940,
            "date": "04/03/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/abc12.com/content/tncms/assets/v3/editorial/f/c3/fc353f5d-082e-589f-a506-9db6a3ea043a/67eecd25de0f5.image.jpg?crop=1763%2C926%2C0%2C125&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "This and the tariffs overall are going to hammer so many working class Americans so hard it's ridiculous.\n\nEven more ridiculous is a lot of those folks eagerly voted for Trump as this is going to hit Indiana *hard.*",
                "Congrats to the red states that lost jobs due to a tariff policy based on farcical mathematics devised by an 80yr old man who has not released his college transcript",
                "Guys, I’m starting to think Trump voters aren’t smart. ",
                "So that took what... 11 hours for massive layoffs to occur directly connected to Trumps Recession Plan Tarriffs.",
                "well that worked as planned. Instead of costing 25% more we now get nothing and runaway inflation because of a lack of supply.  Way to crash the economy Trump ya dumb Fuck.",
                " But twump is a bidness man!",
                "And the UAW is supporting these tariffs",
                "Folks, we are in the Golden Showers Age, when billionaires piss on us while laughing at their wealth hoarding.",
                "Leopards going to eat well. Mmmm faces",
                "We were contacted by Vaisala sales reps today to let us know that all sales quotes from the last 6 months are null and void effective immediately and to expect all re-processed or future quotes to be ~15% higher due to tariffs. \n\nListening to some people in the DEEP RED area where I live talk about how bad Trump is for the economy, price of eggs, and stock market crashing. It feels good to hear people actually talking about the issues, but we TOLD YOU this was what Trump was going to do SIX MONTHS AGO!!!"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Man says son was stabbed in the heart at high school track meet, died in twin's arms",
            "external_url": "https://www.nbcdfw.com/news/local/student-stabbed-frisco-track-meet/3806667/",
            "upvotes": 22748,
            "date": "04/03/2025",
            "thumbnail": "https://media.nbcdfw.com/2025/04/jeff-and-austin-metcalf.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                ">Jeff Metcalf spoke with NBC 5 Tuesday afternoon and said his son, Austin Metcalf, was killed when another student armed with a knife got upset after being told he was sitting in the wrong spot.\n\nAh well at least it was over something important 🙄",
                "Similar thing happened last week in town where I live. Two girls fighting and one stabbed in the neck died. Principal and teachers fired, but shitty parent gets to point a finger at the school instead of admitting she raised the kind of kid that would stab someone to death",
                "Fuck. The poor surviving brother.",
                ">I'm not trying to judge\n\nI think it's ok to judge someone who murdered your son.",
                "Absolutely psychotic to murder someone over a mild inconvenience.",
                ">Jeff Metcalf spoke with NBC 5 Tuesday afternoon and said his son, Austin Metcalf, was killed when another student armed with a knife got upset after being told he was sitting in the wrong spot.\n\nThis is what the kid that brings a knife to school in case someone messes with him thinks is someone messing with him.",
                "What a strange headline: His son WAS stabbed at a track meet.",
                "The local rumor is that the murderer told a friend earlier in the day that he wanted to stab someone.",
                "What a loving family he had.. Quoted from the article:\n\n“I’m not trying to judge, but what kind of parents did this child have? What was he taught? He brought a knife to a track meet and he murdered my son by stabbing him in the heart. The guy was in the wrong place and they asked him to move and he bowed up [became angry and aggressive]. This is murder,” Jeff Metcalf said.\n\n“You know what, I already forgive this person. Already. God takes care of things. God is going to take care of me. God is going to take care of my family,” he added.",
                "Dude had a 4.0 GPA. What a waste of life. I hope Karmelo Anthony gets life for this. "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Pentagon’s watchdog to review Hegseth’s use of Signal app to convey plans for Houthi strike",
            "external_url": "https://apnews.com/article/hegseth-signal-messaging-app-attack-plans-f8581bcb447b91d2e7f9cb7809ae0f06",
            "upvotes": 5475,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Tomorrow:  DOGE fires Pentagon staff, cites \"wasteful spending\".",
                "He’ll be fine. They already shifted the blame.",
                "Now that we know Republicans will lie about Democrats \"weaponizing the justice system\" and that Republicans will absolutely weaponize the justice system, I'd like to see a Democratic candidate run on it.\n\nTheir entire campaign could be a laundry list of people like Hegseth who will be rounded up and sent to an El Salvadoran prison on day 1 of the new administration.",
                "Trump appoints himself Pentagon watchdog.",
                "There's a watchdog that hasn't been replaced by Sycophants?",
                "“We’ve reviewed the illegal use of civilian social apps for classified information sharing of active military combat, and found no wrong doing”",
                "Oh boy, I sure am ready for absolutely nothing of consequence to happen to the secretary of drunkenness.",
                "I wouldn't be surprised if it is a made-up examination to say after a few days \"Nope, all easy. It wasn't that bad!\" to sweep the whole issue under the carpet for good...",
                "I mean, is this even a question? He violated federal laws and military regulations and created a massive OPSEC dataspill\n\nHe and everyone on that chat should be fired. ( except the reporter, they get a raise)",
                "Yeah, like that will go anywhere."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "White House fires three NSC staffers after president meets with far-right activist Laura Loomer",
            "external_url": "https://www.cnn.com/2025/04/03/politics/nsc-firings-trump-laura-loomer-meeting/index.html",
            "upvotes": 10724,
            "date": "04/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-2024-09-11t000440z-1209639841-rc2zx9a96h4i-rtrmadp-3-usa-election-debate-arrivals.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Isn't this the woman who was very obviously trying to have an affair with Trump during the campaign? Maybe she even was.",
                "Nothing to see here, just the President's mistress directing national security policy like you'd see in any other normal, functioning democracy.",
                "This was probably just for an oval office blowjob. Probably not related.",
                "And none of the people involved with Signalgate",
                "TFH? Is that an actual picture of her? Or is that an animatronic or wax statue?",
                "He probably gets extra jazzy about getting away in the open with what Bill Clinton lost a portion of his legacy over. And so does anyone intentionally looking the other way.",
                "It’s painful to be reminded of all d-list sycophants Trump had during his campaign. \n\nRFKjr, Keri Lake, Catturd, Comrade Tulsi, Kid Rock, Rob Schneider, Kash Patel, Pete Hegseth, Giuliani , Hulk Hogan, Vince McMahon etc.  \n\nThese guys were on their way out of public consciousness once Trump\nLost.  But enough people sat out the election and now he’s rewarding the absolute worst of humanity by giving them power and influence over the American people for no other reason than “the libs will hate this”. \n\nHearing Laura Loomers name is a reminder that he’s not close to being done getting his revenge on America.  (And no, not only the libs, on the entire country).",
                "she's only 31?! she looks like a refurbished 50 at *best*.",
                "It’s wild how much she turned herself into a goblin",
                "Jigsaw gives T a BJ and as a result he fired people.  What an exciting episode of dumpster fire 2025."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Trump administration sued over Chinese import tariffs",
            "external_url": "https://www.reuters.com/legal/trump-administration-sued-over-chinese-import-tariffs-2025-04-03/",
            "upvotes": 1210,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> New Civil Liberties Alliance, a conservative legal group, on Thursday filed what it said was the first lawsuit seeking to block Donald Trump's tariffs on Chinese imports, saying the U.S. president overstepped his authority.\n\nMaybe conservatives are starting to realize they've created a monster they cannot control.",
                "This is was filed in florida... they arent even allowed to buy property in florida",
                "Arguing that a decades old status quo is suddenly an emergency is implausible. If foreign trade is such an emergency why did trump not tariff it during his first term?\n\nThe courts should absolutely shut this abuse of power down. He has no legal authority to pull these out of his ass like this.",
                "Conservatives want minimal federal government, so it makes sense that they object to this maximal, not thought out blunderbuss of tariffs under a fig leaf of national emergency to be overturned.",
                "Something about leopards and faces….",
                "https://asianews.network/china-japan-south-korea-to-bolster-trade-ties/\n\nIt took the US to bring them together. Will make world a safer place ",
                "This is the time to strengthen EU and China relations while building up our defense.",
                "Once someone think of the cheap Chinese shit",
                "Fuck china"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "U.S. tourist arrested after bringing a handgun into Japan",
            "external_url": "https://www.japantimes.co.jp/news/2025/04/02/japan/crime-legal/us-tourist-gun-japan/",
            "upvotes": 31796,
            "date": "04/03/2025",
            "thumbnail": "https://www.japantimes.co.jp/japantimes/uploads/images/2025/04/02/461123.jpg?v=3.1",
            "top_comments": [
                "My aunt and uncle (ridiculously kind people) borrowed some luggage from a friend of theirs to take on a cruise to the Bahamas. When they were already on the boat they found their friend had forgotten a handgun in one of the bags. They reached out to my dad (an attorney) on what to do with it, he told them to throw it off the side of the boat and not bring it up to anyone. They did not and instead told staff about it. They were detained and the gun was confiscated and not returned to them or the owner and it was a big big hassle. No charges or anything though. To this day my uncle will say “we should’ve just thrown it over the side.” Lmao.",
                "The fact that he alerted someone to the gun will help him. That he tossed three rounds in the trash will not. He’ll probably avoid a jail sentence with hard labor, but the Japanese will put him through the wringer anyway.",
                "Japan has extreme strict gun control laws. They don’t play around. And if you wanted to possess a gun in Japan, one of the process is an interview with the local police and convincing them why you need a gun, and you better have a very good reason.",
                "In 2012, an American tourist visiting a park in Calgary Canada had a conversation with two Canadians he didn't know. He was understandably terrified as he wasn't packing heat.  \n\nSo he wrote a letter to the editor of a local paper. [This was published and hilarity ensued.](https://calgaryherald.com/news/local-news/walt-wawras-nosehillgentlemen-story-a-non-event-but-social-media-loved-it-all-the-same)\n\nEdit: [here is a working link to the letter, credit to u/MixedPotion for digging it up](https://web.archive.org/web/20121019011529/http://www.calgaryherald.com/opinion/letters/nose+hill+park+confrontation+makes+visitors+feel+unsafe/7050028/story.html)",
                "Remember a few years ago when some dipshit brought a gun to Australia and when she was arrested she said it was her god given right under the 2nd Amendment.",
                "One of the safest countries I have ever been to.",
                "I for one am fine with reckless american gun owners getting arrested for doing stupid shit with their guns.",
                "Moron. How do you \"inadvertently\" bring a weapon to another country? At the very least it demonstrates he's not a responsible gun owner and deserves to lose his gun license.",
                "When I was working in Japan, we had a guy who transferred there from the states. The movers in the US packed furniture without checking it and there was a handgun in a nightstand or something. They X-Ray every shipment, so they obviously found it and brought him in for questioning. The Japanese police charged him with about $3000 fine and labor costs to search the rest of his household goods by hand. Also for the cost of destroying the handgun. I think it ended up costing him $10000 that he had to pay to Japan. They almost didn't let him stay, but somehow he convinced them it wasn't deliberate.",
                "how do people \"forget\" where a gun is?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "South Korea’s impeached president is removed from office, four months after declaring martial law | CNN",
            "external_url": "https://edition.cnn.com/2025/04/03/asia/yoon-impeachment-verdict-south-korea-intl-hnk/index.html",
            "upvotes": 432,
            "date": "04/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2198579820.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "And the USA who lectures other countries about how to be a democratic country watch its economy and institutions being slowly degraded and have no guardrails against it. The South Korean president would have succeeded in America.",
                "This is what needs to happen to US",
                "Another example of other countries whose citizens don’t have their heads up their asses",
                "Only four months ago, Jesus, this last four months felt like a year.\n\nThe way the people mobilized and supported democracy was terrific, and I'm so happy that the people are getting listened to.",
                "The most chill of failed coups",
                "we should learn from their example",
                "Make America South Korea",
                "It is interesting that judges can remove a president of his duties there.\n\nAlso the video mentioned that martial law was unconstitutional. I wonder if that is actually written in their constitution or what.\n\nHappy for the Koreans for removing a dictator, wondering if America is going down the same path now with Trump",
                "Funny how every time a President tries to mend ties with Japan, they find a way to discredit them. With the previous one, it was a 'laptop in an abandoned building' that was very conveniently full of shit about her...",
                "South Korean should celebrate with a huge giant orgy that would somve the demography problem at the same time...🤣"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "US NSA director Timothy Haugh fired, Washington Post reports",
            "external_url": "https://www.reuters.com/world/us/us-nsa-director-timothy-haugh-fired-washington-post-reports-2025-04-04/",
            "upvotes": 3590,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wonder if this is related to Laura Loomer's visit to the Oval Office yesterday that led to the firing of three NSC officials.",
                "The director and the No. 2 official at the National Security Agency were ousted from their positions Thursday, according to a defense official and three sources with knowledge of the matter.\n\nIt was not immediately clear why Air Force Gen. Timothy Haugh and his deputy were dismissed, the sources said.",
                "He must have been too competent and not a toady.",
                "Oh, we're changing NSA oversight after a far right meeting with the president.\n\nYeah that sounds safe and in no way concerning.",
                "They have purged most of the military and intelligence agency leadership. Scary stuff. ",
                "Because they were not \"loyal\"? How did this insidious concept creep into the administration vernacular without sounding alarm bells? People have forgotten how democracy works. Everyone isn't supposed to just agree with the President and do whatever he says.",
                "Reading up on him his studies were Russia related.  Can’t have a career intelligence officer that knows the in and out of Russia be the top spy.",
                "He testified at the senate hearing that there were risks to using Signal. When the team cheats but you don't, you get benched for not being a team player.",
                "Folks, this is when these Nazis start investigating and spying on their political enemies and they start falling out of windows and getting bad tea.",
                "I fear corruption. We're taking full 180 on US. I don't know how to feel about the future of humanity."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "South Korea president Yoon Suk Yeol removed from office after impeachment upheld by court",
            "external_url": "https://www.theguardian.com/world/2025/apr/04/south-korea-president-yoon-suk-yeol-impeachment-verdict-results-removal",
            "upvotes": 3298,
            "date": "04/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7e35f53af66efc35b0242cd0d374aed76dba896d/0_260_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c0144373a4894000309d7292281bb0ae",
            "top_comments": [
                "Bastard deserves to be impeached for the clumsy way he tried to seize power and dismantle democracy in Korea. Now we have wait to see if his followers accept things or continue making trouble.",
                "Can we have some of that sweet rule of law and democracy in the US, please?",
                "Unanimous verdict from all 8 justices",
                "Is impeachment trending? I hope so.",
                "The USA is the only first world country WITHOUT Universal healthcare.\n\nThe USA is the only country that allowed a TRAITOR to invade the Oval Office, the People's House.\n\n[https://www.npr.org/2023/07/08/1186508281/peru-prison-ex-presidents](https://www.npr.org/2023/07/08/1186508281/peru-prison-ex-presidents)",
                "*daydreams listfully in American.*\n\nOne day. One day we may have this too.",
                "Someday America may become a developed country with a proper judiciary and rule of law",
                "Man this road was a precarious one, but it's finally over. Even though the judge's proclamation was pretty clear, I was on edge until he finally said the word impeached.",
                "The facts of the case were so clear cut, at least as a bystander. There didn't seem to be much of a defense either on the part of Yoon. \n\nGlad he's impeached. fingers crossed for criminal charges.",
                "South Korea, somewhat a student learned elections process from the U.S., can do this. The teacher can’t. Now It’s time for the U.S. to be the student and learn from Koreans"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Michigan couple released after nearly a month in Mexican prison over payment dispute with timeshare company",
            "external_url": "https://www.cnn.com/2025/04/03/us/michigan-couple-mexico-timeshare-dispute",
            "upvotes": 662,
            "date": "04/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/akeos-1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They signed a contract, used the services, and then lied to their credit card company that the charges were fraudulent to get them removed, then went on social media to brag about how they beat the timeshare company.\n\nI'm glad they aren't in prison, but I hope they will be paying back what they owe.",
                "I really doubt that Mexican prison timeshares will become very popular.",
                "They need to call Chuck McDowell at timeshare exit company",
                ">“President Trump, I know he personally got involved with this and wanted them home, so I give him a lot of credit,” Manly said to CNN Thursday night. “No American should have to endure what these people have endured.\"\n\nSo he cares about these people but not the people in the El Salvador prisons... right...",
                "What Americans must realize is that American laws ended on American borders. Maybe in America it is fine to gloat about your victories against the timeshare company, but it won’t be so in other countries. Maybe in America it’s not common to jail people over civil matters but not in other country.\n\nWe have learned how Americans carried drugs to Russia. Or handguns to Japan. We must really understand that when we step into other country THEIR laws apply and there is nothing you can do to change that. \n\nSo the prisons are like a “hell-hole”? Then DO NOT cause problems on other country!",
                "Trumpers defaulted on their bills and then tried to escape any consequences. Sounds familiar.\n\nAt least they got time in Mexican jail for their trouble.",
                "Timeshares don’t fuck around",
                "I just don't know what to believe in this story.",
                "Maybe I'm old-fashioned, but I always felt it was best never to record or gloat about my crimes. Like just do crime and be quiet.",
                "Both sides sound like aholes"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Trump administration sued over Chinese import tariffs",
            "external_url": "https://www.reuters.com/legal/trump-administration-sued-over-chinese-import-tariffs-2025-04-03/",
            "upvotes": 1217,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> New Civil Liberties Alliance, a conservative legal group, on Thursday filed what it said was the first lawsuit seeking to block Donald Trump's tariffs on Chinese imports, saying the U.S. president overstepped his authority.\n\nMaybe conservatives are starting to realize they've created a monster they cannot control.",
                "This is was filed in florida... they arent even allowed to buy property in florida",
                "Arguing that a decades old status quo is suddenly an emergency is implausible. If foreign trade is such an emergency why did trump not tariff it during his first term?\n\nThe courts should absolutely shut this abuse of power down. He has no legal authority to pull these out of his ass like this.",
                "Conservatives want minimal federal government, so it makes sense that they object to this maximal, not thought out blunderbuss of tariffs under a fig leaf of national emergency to be overturned.",
                "Something about leopards and faces….",
                "https://asianews.network/china-japan-south-korea-to-bolster-trade-ties/\n\nIt took the US to bring them together. Will make world a safer place ",
                "This is the time to strengthen EU and China relations while building up our defense.",
                "Once someone think of the cheap Chinese shit",
                "Fuck china"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "RFK Jr. says 20% of health agency layoffs could be mistakes",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-hhs-job-cuts-doge-mistakes/",
            "upvotes": 11780,
            "date": "04/04/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/02/03/2480592f-598f-4a1c-a1b4-a4ba2e37bf84/thumbnail/1200x630/3376b78922c70934a82e9a4e8794fc51/cbsn-fusion-does-rfk-jr-have-enough-support-from-republican-senators-thumbnail.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Is it him or the worm talking? Who made the mistake?",
                "Award for the most incompetent government of all time?",
                "He’s just such a fucking moron. Christ. Like look at this fucking idiocy:\n\n>”Part of the DOGE, we talked about this from the beginning, is we’re going to do 80% cuts, but 20% of those are going to have to be reinstated, because we’ll make mistakes,” Kennedy said, speaking to reporters at a stop in Virginia.\n\n>Kennedy said that the elimination of the Centers for Disease Control and Prevention’s **entire Lead Poisoning Prevention and Surveillance Branch** was among the mistakes.",
                "They fired thousands of employees trying to get a public relations win. Thats it.\n\nPathetic, amateur shit.",
                "The incompetence of this administration is just mind blowing...",
                "These dipshits! That's not how you treat employees. That's how you treat cattle. That's all we are to them.",
                "They're seriously just firing people to fire people. It's the dumbest concept in the world.\n\nIt's fine if it's your tech bro company, but not when it's the goddamn US government that the people of this country rely on.",
                "Everything the current administration does is a mistake",
                "How do you accidentally lay off people?",
                "Rfk is a mistake. Should have been aborted."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Seven killed as thunderstorms and tornadoes rip through US states",
            "external_url": "https://news.sky.com/story/seven-killed-as-thunderstorms-and-tornadoes-rip-through-us-states-13341376",
            "upvotes": 414,
            "date": "04/04/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-tornado-tennessee-us_6875196.jpg?20250403193805",
            "top_comments": [
                "I came across a tweet yesterday that was replying to someone about the near record breaking amount of tornado watches/warnings issued yesterday and it said:\n\n>Well you know ever since they announced that Trump was canceling leases on NWS buildings it seems like NWS pulled the lever and walked out the building letting the weather run wild. Yes I believe in weather modification.\n\nLike... man.. where would you even start with this claim?",
                "If I were a Christian, I’d say that God is punishing republicans for electing Donald trump, but I’m an atheist ",
                "florida, north carolina, california, arkansas, kentucky, and thailand are all being faced with catastrophic environmental events within the last year. this is outrageous.",
                "Thank God for FEMA. oh, wait, shit.",
                "*A stretch of the Mississippi River around Memphis, where more than 1.3 million people live, is set to bear the brunt.   In total, more than 90 million people have been at risk of severe weather – from Texas to Minnesota and Maine, according to the Oklahoma-based Storm Prediction Centre.*\n\nYup, even Maine--and the northeast.  We had a a crackling thunderstorm here that kept me up half the night. Very unusual for 2 April. Scary stuff.",
                "I’d say that’s just poor tornado management.",
                "Don’t worry. I’m sure Trump will lob a few rolls of toilet paper at them and call it a day. THAT’LL fix everything, right?",
                "But DOGE says we don't need NOAA!",
                "Sure cant wait for FEMA to help out",
                "Oh no has anyone checked in with Trump on his golf trip? He might not have reached the back nine yet."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Tariff-related layoffs hit five US auto plants that supply factories in Canada and Mexico",
            "external_url": "https://www.abc12.com/news/tariff-related-layoffs-hit-five-us-auto-plants-that-supply-factories-in-canada-and-mexico/article_6d95d30a-9956-521c-86e2-a62c9b07d3f4.html?fbclid=IwZXh0bgNhZW0CMTEAAR2xPs0qVaSgfUJmdqsaFHK_By3_8B-vrj9GDws297UllzMvWzCnes45dzw_aem_dyNT8yFsAPiIgD3r5Nwnnw",
            "upvotes": 2945,
            "date": "04/03/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/abc12.com/content/tncms/assets/v3/editorial/f/c3/fc353f5d-082e-589f-a506-9db6a3ea043a/67eecd25de0f5.image.jpg?crop=1763%2C926%2C0%2C125&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "This and the tariffs overall are going to hammer so many working class Americans so hard it's ridiculous.\n\nEven more ridiculous is a lot of those folks eagerly voted for Trump as this is going to hit Indiana *hard.*",
                "Congrats to the red states that lost jobs due to a tariff policy based on farcical mathematics devised by an 80yr old man who has not released his college transcript",
                "Guys, I’m starting to think Trump voters aren’t smart. ",
                "So that took what... 11 hours for massive layoffs to occur directly connected to Trumps Recession Plan Tarriffs.",
                "well that worked as planned. Instead of costing 25% more we now get nothing and runaway inflation because of a lack of supply.  Way to crash the economy Trump ya dumb Fuck.",
                " But twump is a bidness man!",
                "And the UAW is supporting these tariffs",
                "Folks, we are in the Golden Showers Age, when billionaires piss on us while laughing at their wealth hoarding.",
                "Leopards going to eat well. Mmmm faces",
                "We were contacted by Vaisala sales reps today to let us know that all sales quotes from the last 6 months are null and void effective immediately and to expect all re-processed or future quotes to be ~15% higher due to tariffs. \n\nListening to some people in the DEEP RED area where I live talk about how bad Trump is for the economy, price of eggs, and stock market crashing. It feels good to hear people actually talking about the issues, but we TOLD YOU this was what Trump was going to do SIX MONTHS AGO!!!"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Xiaofeng Wang, the cybersecurity professor targeted by FBI, has not been detained",
            "external_url": "https://www.reuters.com/world/us/indiana-university-cybersecurity-professor-has-not-been-arrested-or-detained-2025-04-02/",
            "upvotes": 299,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is a weird story to publish. If he was fired and has his house and another property searched by law enforcement but they also refused to comment. The Trump administration is looking for any negative news story it can put out about immigrants but this is the type of immigrant the US would want. DHS hasn't commented yet and the Wangs seem like they're ready to move on without mentioning what the investigation was possibly about. I associate their lawyer advised them to hush up for a specific reason. We will have to wait & see.",
                "Damn, they broke tenure. Even if they had a good reason, without going through due process, this will ruffle a lot of feathers.\n\nAnd, if everything's on the up and up, why wasn't there due process?",
                "His lawyer’s last name is Covert?\n\nThis such a strange story.",
                "There’s rumors he was looking at electronic voting systems.",
                "I’m assuming this is some SCP type coverup",
                "My bet is he's a spy and they'll trade him for one of ours.",
                "Move along. Nothing to see here. "
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Mehmet Oz confirmed by US Senate to lead Medicare and Medicaid",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/03/mehmet-oz-confirmation-medicare-medicaid",
            "upvotes": 17868,
            "date": "04/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/929fb0a8e383cf00a594c61b34bd66eac77804d6/308_184_4282_2570/master/4282.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=46fa54902ac733c5f57066f59d463592",
            "top_comments": [
                "A [quack](https://en.wikipedia.org/wiki/Medical_claims_on_The_Dr._Oz_Show) leading Medicare and Medicaid. Seems on point for this administration.",
                "And here I thought that they couldn't get any worse than RFK jr.\n\n1. I was wrong.\n\n2. I gotta stop saying that they can't make things worse because they turn that into a challenge.\n\n3. Congressional Republicans should be forced to use RFK jr and Oz as their Primary Care Physicians.",
                "Another grifter. Jesus fuck.",
                "The clown show continues",
                "Rejected by voters but still given power. Typical.",
                "Dr. Phil wasn’t available?",
                "I think I’d prefer nepotism or blatant corruption to just giving jobs to people he has seen on TV.",
                "Another sad day for American health. Dude is a snake oil salesman and con artist who doesn’t know shit about running the department.",
                "Embarassing is the new norm. Yet another greedy amoral charlatan representing America.",
                "Wait til they install Alex Jones as Director of the CIA"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "South Korea president Yoon Suk Yeol removed from office after impeachment upheld by court",
            "external_url": "https://www.theguardian.com/world/2025/apr/04/south-korea-president-yoon-suk-yeol-impeachment-verdict-results-removal",
            "upvotes": 3299,
            "date": "04/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7e35f53af66efc35b0242cd0d374aed76dba896d/0_260_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c0144373a4894000309d7292281bb0ae",
            "top_comments": [
                "Bastard deserves to be impeached for the clumsy way he tried to seize power and dismantle democracy in Korea. Now we have wait to see if his followers accept things or continue making trouble.",
                "Can we have some of that sweet rule of law and democracy in the US, please?",
                "Unanimous verdict from all 8 justices",
                "Is impeachment trending? I hope so.",
                "The USA is the only first world country WITHOUT Universal healthcare.\n\nThe USA is the only country that allowed a TRAITOR to invade the Oval Office, the People's House.\n\n[https://www.npr.org/2023/07/08/1186508281/peru-prison-ex-presidents](https://www.npr.org/2023/07/08/1186508281/peru-prison-ex-presidents)",
                "*daydreams listfully in American.*\n\nOne day. One day we may have this too.",
                "Someday America may become a developed country with a proper judiciary and rule of law",
                "Man this road was a precarious one, but it's finally over. Even though the judge's proclamation was pretty clear, I was on edge until he finally said the word impeached.",
                "The facts of the case were so clear cut, at least as a bystander. There didn't seem to be much of a defense either on the part of Yoon. \n\nGlad he's impeached. fingers crossed for criminal charges.",
                "South Korea, somewhat a student learned elections process from the U.S., can do this. The teacher can’t. Now It’s time for the U.S. to be the student and learn from Koreans"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "South Korea’s impeached president is removed from office, four months after declaring martial law | CNN",
            "external_url": "https://edition.cnn.com/2025/04/03/asia/yoon-impeachment-verdict-south-korea-intl-hnk/index.html",
            "upvotes": 429,
            "date": "04/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2198579820.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "And the USA who lectures other countries about how to be a democratic country watch its economy and institutions being slowly degraded and have no guardrails against it. The South Korean president would have succeeded in America.",
                "This is what needs to happen to US",
                "Another example of other countries whose citizens don’t have their heads up their asses",
                "Only four months ago, Jesus, this last four months felt like a year.\n\nThe way the people mobilized and supported democracy was terrific, and I'm so happy that the people are getting listened to.",
                "The most chill of failed coups",
                "we should learn from their example",
                "Make America South Korea",
                "It is interesting that judges can remove a president of his duties there.\n\nAlso the video mentioned that martial law was unconstitutional. I wonder if that is actually written in their constitution or what.\n\nHappy for the Koreans for removing a dictator, wondering if America is going down the same path now with Trump",
                "Funny how every time a President tries to mend ties with Japan, they find a way to discredit them. With the previous one, it was a 'laptop in an abandoned building' that was very conveniently full of shit about her...",
                "South Korean should celebrate with a huge giant orgy that would somve the demography problem at the same time...🤣"
            ],
            "aggregate_sentiment": 24.0
        },
        {
            "category": "RISING",
            "title": "US NSA director Timothy Haugh fired, Washington Post reports",
            "external_url": "https://www.reuters.com/world/us/us-nsa-director-timothy-haugh-fired-washington-post-reports-2025-04-04/",
            "upvotes": 3588,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wonder if this is related to Laura Loomer's visit to the Oval Office yesterday that led to the firing of three NSC officials.",
                "The director and the No. 2 official at the National Security Agency were ousted from their positions Thursday, according to a defense official and three sources with knowledge of the matter.\n\nIt was not immediately clear why Air Force Gen. Timothy Haugh and his deputy were dismissed, the sources said.",
                "He must have been too competent and not a toady.",
                "Oh, we're changing NSA oversight after a far right meeting with the president.\n\nYeah that sounds safe and in no way concerning.",
                "They have purged most of the military and intelligence agency leadership. Scary stuff. ",
                "Because they were not \"loyal\"? How did this insidious concept creep into the administration vernacular without sounding alarm bells? People have forgotten how democracy works. Everyone isn't supposed to just agree with the President and do whatever he says.",
                "Reading up on him his studies were Russia related.  Can’t have a career intelligence officer that knows the in and out of Russia be the top spy.",
                "He testified at the senate hearing that there were risks to using Signal. When the team cheats but you don't, you get benched for not being a team player.",
                "Folks, this is when these Nazis start investigating and spying on their political enemies and they start falling out of windows and getting bad tea.",
                "I fear corruption. We're taking full 180 on US. I don't know how to feel about the future of humanity."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "RFK Jr. says 20% of health agency layoffs could be mistakes",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-hhs-job-cuts-doge-mistakes/",
            "upvotes": 11784,
            "date": "04/04/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/02/03/2480592f-598f-4a1c-a1b4-a4ba2e37bf84/thumbnail/1200x630/3376b78922c70934a82e9a4e8794fc51/cbsn-fusion-does-rfk-jr-have-enough-support-from-republican-senators-thumbnail.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Is it him or the worm talking? Who made the mistake?",
                "Award for the most incompetent government of all time?",
                "He’s just such a fucking moron. Christ. Like look at this fucking idiocy:\n\n>”Part of the DOGE, we talked about this from the beginning, is we’re going to do 80% cuts, but 20% of those are going to have to be reinstated, because we’ll make mistakes,” Kennedy said, speaking to reporters at a stop in Virginia.\n\n>Kennedy said that the elimination of the Centers for Disease Control and Prevention’s **entire Lead Poisoning Prevention and Surveillance Branch** was among the mistakes.",
                "They fired thousands of employees trying to get a public relations win. Thats it.\n\nPathetic, amateur shit.",
                "The incompetence of this administration is just mind blowing...",
                "These dipshits! That's not how you treat employees. That's how you treat cattle. That's all we are to them.",
                "They're seriously just firing people to fire people. It's the dumbest concept in the world.\n\nIt's fine if it's your tech bro company, but not when it's the goddamn US government that the people of this country rely on.",
                "Everything the current administration does is a mistake",
                "How do you accidentally lay off people?",
                "Rfk is a mistake. Should have been aborted."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Trump administration sued over Chinese import tariffs",
            "external_url": "https://www.reuters.com/legal/trump-administration-sued-over-chinese-import-tariffs-2025-04-03/",
            "upvotes": 1214,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> New Civil Liberties Alliance, a conservative legal group, on Thursday filed what it said was the first lawsuit seeking to block Donald Trump's tariffs on Chinese imports, saying the U.S. president overstepped his authority.\n\nMaybe conservatives are starting to realize they've created a monster they cannot control.",
                "This is was filed in florida... they arent even allowed to buy property in florida",
                "Arguing that a decades old status quo is suddenly an emergency is implausible. If foreign trade is such an emergency why did trump not tariff it during his first term?\n\nThe courts should absolutely shut this abuse of power down. He has no legal authority to pull these out of his ass like this.",
                "Conservatives want minimal federal government, so it makes sense that they object to this maximal, not thought out blunderbuss of tariffs under a fig leaf of national emergency to be overturned.",
                "Something about leopards and faces….",
                "https://asianews.network/china-japan-south-korea-to-bolster-trade-ties/\n\nIt took the US to bring them together. Will make world a safer place ",
                "This is the time to strengthen EU and China relations while building up our defense.",
                "Once someone think of the cheap Chinese shit",
                "Fuck china"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Tariff-related layoffs hit five US auto plants that supply factories in Canada and Mexico",
            "external_url": "https://www.abc12.com/news/tariff-related-layoffs-hit-five-us-auto-plants-that-supply-factories-in-canada-and-mexico/article_6d95d30a-9956-521c-86e2-a62c9b07d3f4.html?fbclid=IwZXh0bgNhZW0CMTEAAR2xPs0qVaSgfUJmdqsaFHK_By3_8B-vrj9GDws297UllzMvWzCnes45dzw_aem_dyNT8yFsAPiIgD3r5Nwnnw",
            "upvotes": 2945,
            "date": "04/03/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/abc12.com/content/tncms/assets/v3/editorial/f/c3/fc353f5d-082e-589f-a506-9db6a3ea043a/67eecd25de0f5.image.jpg?crop=1763%2C926%2C0%2C125&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "This and the tariffs overall are going to hammer so many working class Americans so hard it's ridiculous.\n\nEven more ridiculous is a lot of those folks eagerly voted for Trump as this is going to hit Indiana *hard.*",
                "Congrats to the red states that lost jobs due to a tariff policy based on farcical mathematics devised by an 80yr old man who has not released his college transcript",
                "Guys, I’m starting to think Trump voters aren’t smart. ",
                "So that took what... 11 hours for massive layoffs to occur directly connected to Trumps Recession Plan Tarriffs.",
                "well that worked as planned. Instead of costing 25% more we now get nothing and runaway inflation because of a lack of supply.  Way to crash the economy Trump ya dumb Fuck.",
                " But twump is a bidness man!",
                "And the UAW is supporting these tariffs",
                "Folks, we are in the Golden Showers Age, when billionaires piss on us while laughing at their wealth hoarding.",
                "Leopards going to eat well. Mmmm faces",
                "We were contacted by Vaisala sales reps today to let us know that all sales quotes from the last 6 months are null and void effective immediately and to expect all re-processed or future quotes to be ~15% higher due to tariffs. \n\nListening to some people in the DEEP RED area where I live talk about how bad Trump is for the economy, price of eggs, and stock market crashing. It feels good to hear people actually talking about the issues, but we TOLD YOU this was what Trump was going to do SIX MONTHS AGO!!!"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Michigan couple released after nearly a month in Mexican prison over payment dispute with timeshare company",
            "external_url": "https://www.cnn.com/2025/04/03/us/michigan-couple-mexico-timeshare-dispute",
            "upvotes": 662,
            "date": "04/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/akeos-1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They signed a contract, used the services, and then lied to their credit card company that the charges were fraudulent to get them removed, then went on social media to brag about how they beat the timeshare company.\n\nI'm glad they aren't in prison, but I hope they will be paying back what they owe.",
                "I really doubt that Mexican prison timeshares will become very popular.",
                "They need to call Chuck McDowell at timeshare exit company",
                ">“President Trump, I know he personally got involved with this and wanted them home, so I give him a lot of credit,” Manly said to CNN Thursday night. “No American should have to endure what these people have endured.\"\n\nSo he cares about these people but not the people in the El Salvador prisons... right...",
                "What Americans must realize is that American laws ended on American borders. Maybe in America it is fine to gloat about your victories against the timeshare company, but it won’t be so in other countries. Maybe in America it’s not common to jail people over civil matters but not in other country.\n\nWe have learned how Americans carried drugs to Russia. Or handguns to Japan. We must really understand that when we step into other country THEIR laws apply and there is nothing you can do to change that. \n\nSo the prisons are like a “hell-hole”? Then DO NOT cause problems on other country!",
                "Trumpers defaulted on their bills and then tried to escape any consequences. Sounds familiar.\n\nAt least they got time in Mexican jail for their trouble.",
                "Timeshares don’t fuck around",
                "I just don't know what to believe in this story.",
                "Maybe I'm old-fashioned, but I always felt it was best never to record or gloat about my crimes. Like just do crime and be quiet.",
                "Both sides sound like aholes"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Mehmet Oz confirmed by US Senate to lead Medicare and Medicaid",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/03/mehmet-oz-confirmation-medicare-medicaid",
            "upvotes": 17863,
            "date": "04/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/929fb0a8e383cf00a594c61b34bd66eac77804d6/308_184_4282_2570/master/4282.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=46fa54902ac733c5f57066f59d463592",
            "top_comments": [
                "A [quack](https://en.wikipedia.org/wiki/Medical_claims_on_The_Dr._Oz_Show) leading Medicare and Medicaid. Seems on point for this administration.",
                "And here I thought that they couldn't get any worse than RFK jr.\n\n1. I was wrong.\n\n2. I gotta stop saying that they can't make things worse because they turn that into a challenge.\n\n3. Congressional Republicans should be forced to use RFK jr and Oz as their Primary Care Physicians.",
                "Another grifter. Jesus fuck.",
                "The clown show continues",
                "Rejected by voters but still given power. Typical.",
                "Dr. Phil wasn’t available?",
                "I think I’d prefer nepotism or blatant corruption to just giving jobs to people he has seen on TV.",
                "Another sad day for American health. Dude is a snake oil salesman and con artist who doesn’t know shit about running the department.",
                "Embarassing is the new norm. Yet another greedy amoral charlatan representing America.",
                "Wait til they install Alex Jones as Director of the CIA"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Seven killed as thunderstorms and tornadoes rip through US states",
            "external_url": "https://news.sky.com/story/seven-killed-as-thunderstorms-and-tornadoes-rip-through-us-states-13341376",
            "upvotes": 418,
            "date": "04/04/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-tornado-tennessee-us_6875196.jpg?20250403193805",
            "top_comments": [
                "I came across a tweet yesterday that was replying to someone about the near record breaking amount of tornado watches/warnings issued yesterday and it said:\n\n>Well you know ever since they announced that Trump was canceling leases on NWS buildings it seems like NWS pulled the lever and walked out the building letting the weather run wild. Yes I believe in weather modification.\n\nLike... man.. where would you even start with this claim?",
                "If I were a Christian, I’d say that God is punishing republicans for electing Donald trump, but I’m an atheist ",
                "florida, north carolina, california, arkansas, kentucky, and thailand are all being faced with catastrophic environmental events within the last year. this is outrageous.",
                "Thank God for FEMA. oh, wait, shit.",
                "*A stretch of the Mississippi River around Memphis, where more than 1.3 million people live, is set to bear the brunt.   In total, more than 90 million people have been at risk of severe weather – from Texas to Minnesota and Maine, according to the Oklahoma-based Storm Prediction Centre.*\n\nYup, even Maine--and the northeast.  We had a a crackling thunderstorm here that kept me up half the night. Very unusual for 2 April. Scary stuff.",
                "I’d say that’s just poor tornado management.",
                "Don’t worry. I’m sure Trump will lob a few rolls of toilet paper at them and call it a day. THAT’LL fix everything, right?",
                "But DOGE says we don't need NOAA!",
                "Sure cant wait for FEMA to help out",
                "Oh no has anyone checked in with Trump on his golf trip? He might not have reached the back nine yet."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Xiaofeng Wang, the cybersecurity professor targeted by FBI, has not been detained",
            "external_url": "https://www.reuters.com/world/us/indiana-university-cybersecurity-professor-has-not-been-arrested-or-detained-2025-04-02/",
            "upvotes": 301,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is a weird story to publish. If he was fired and has his house and another property searched by law enforcement but they also refused to comment. The Trump administration is looking for any negative news story it can put out about immigrants but this is the type of immigrant the US would want. DHS hasn't commented yet and the Wangs seem like they're ready to move on without mentioning what the investigation was possibly about. I associate their lawyer advised them to hush up for a specific reason. We will have to wait & see.",
                "Damn, they broke tenure. Even if they had a good reason, without going through due process, this will ruffle a lot of feathers.\n\nAnd, if everything's on the up and up, why wasn't there due process?",
                "His lawyer’s last name is Covert?\n\nThis such a strange story.",
                "There’s rumors he was looking at electronic voting systems.",
                "I’m assuming this is some SCP type coverup",
                "My bet is he's a spy and they'll trade him for one of ours.",
                "Move along. Nothing to see here. "
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "04/04/2025 08:11:55 UTC"
}