{
    "posts": [
        {
            "category": "HOT",
            "title": "DHS Mistakenly tells attorney US Citizen to leave the US",
            "external_url": "https://www.nbcboston.com/news/local/massachusetts-immigration-attorney-dhs-parole-termination/3684504/",
            "upvotes": 2229,
            "date": "04/13/2025",
            "thumbnail": "https://media.nbcboston.com/2025/04/dhs-parole-termination-notice-attorney.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "This isn’t a mistake it’s a trial balloon",
                ">Mistakenly\n\nYeah, I’m sure it was. No veiled threats here, guys.",
                "*CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients.*\n\nYep, totally explains why the American citizen contact was the only one named in the notice. Sure guys, makes total sense.",
                "An immigration attorney….seems suspicious.",
                "According to MAGA, if they're not white, they're illegal 🤷‍♀️",
                "What dehumanizing language\n\n “ CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients”",
                "I have a bridge to sell you if you think it was a mistake",
                "It wasn’t a mistake…. They always call it a mistake when called out",
                "Nothing. \nThis. \nAdministration. \nDoes. \nIs. \nA. \nMistake. \n\nThey are tests.",
                "NPR last week interviewed a US attorney who is a US citizen, and he said the Trump administration is targeting US immigration attorneys. He was coming back from vacation and crossed the border checkpoint.That is when border patrol targeted him and detained him, then tried to confiscate his phone. They told him he was on a list for terrorists. He told them he had over ten years of attorney client privilege communications on his phone.  He told them absolutely not in confiscating his phone.  He said there are other immigration attorneys he personally knows that are also being harrassed by ICE and border patrol.\nhttps://www.npr.org/2025/04/09/nx-s1-5357455/attorney-detained-by-immigration-authorities"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Airstrike destroys parts of Gaza City hospital as Israel intensifies offensive",
            "external_url": "https://www.theguardian.com/world/2025/apr/13/gaza-city-hospital-hit-ahli-baptist-civil-defence-agency-israel-intensifies-military-operations-katz",
            "upvotes": 1958,
            "date": "04/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ed96a102a84c234498e10dab4b6ed4e9b53be73e/39_0_1198_719/master/1198.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=632544ccd01aff72de4c28216b12cd51",
            "top_comments": [
                "War criminals gonna war crime.",
                "I can remember when Israel used to deny attacking hospitals",
                "America supports this. The West supports this.",
                "MoSt MoRaL aRmY iN tHe WoRlD.",
                "Fear will have people justifying anything",
                "Just as evil as Putin’s recent strike on civilians in Ukraine but we mustn’t hold Israel accountable by criticizing them.",
                "An \"offensive\" against 99.9% civilians, mostly women and children.",
                "Wait, I thought King Donvict brought lasting peace to the mideast like he did to Ukraine?",
                "this will surely make people love Israel",
                "Interesting all those \"genocide Joe\" folks are kinda silent or just not reported on anymore. Almost like they were used to depress the vote or something."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "At least 32 people killed in Russian ballistic missile attack on Sumy",
            "external_url": "https://www.bbc.com/news/articles/c4g4262x4x1o",
            "upvotes": 1002,
            "date": "04/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0e6c/live/30aacb10-185d-11f0-b61e-cb0b76a18982.jpg",
            "top_comments": [
                "Russia is a terrorist country.",
                "Longest “One day to end the war” ever.",
                "Cluster munitions fired upon civilians on Palm Sunday. Are there still people in Russia who think this is justified?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Helicopter in fatal New York crash lacked flight recorders, officials say",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/13/helicopter-new-york-crash",
            "upvotes": 678,
            "date": "04/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/dbea5a7eb88439e5faf969e2db225b3a65afc240/0_203_7701_4623/master/7701.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d754c302a6b984d7e0af88a7110f32a5",
            "top_comments": [
                "From the article:\n> No video or camera recorders have been recovered from the Bell 206 helicopter, the NTSB said in an update late on Saturday – and none of the equipment on it had recorded information that would help the investigation.\n> \n> New York police divers were continuing to search for parts of the helicopter, including the main rotor, gear box, tail rotor and the tail boom, the safety agency said.\n\nI don’t know where a flight recorder would be installed. But nothing in the article concludes that the air craft was without a flight corder prior to the incident. Only that one has not been found.",
                "Oh come on, don't let your fk up fuel the conspiracy theories",
                "Out of all the thing that suck in this world the news is really trying to get me to care about this",
                ">\"It was also on its eighth tour flight of the day, having already completed seven, according to federal investigators.\"\n\nThe people who were on the seventh flight of the day (the one immediately preceding the fatal flight) must be pretty relieved/amazed at their good fortune. I am sure they will be interviewed as part of the investigation to see if they noticed anything out of the ordinary.",
                "Not sure how a recorder helps it not fall apart.",
                "Seems it lacked proper maintenance as well!",
                "These helicopters don’t have flight recorders, because they aren’t mandatory for this size of aircraft. \n\nSo maybe it’s time the FAA makes them mandatory.",
                "I have to admit that I'm surprised that commercial aircraft are not required by law to have flight recorders.",
                "I get that it's a military chopper, but aren't those installed by default? Like bolted in at the plant?\n\nEdit: nvm, confused it for the DC crash."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "US measles cases surpass 700 with outbreaks in six states.",
            "external_url": "https://apnews.com/article/measles-outbreak-texas-rfk-new-mexico-kansas-vaccine-e904ec9781f1d164c73afe4ab71774fe",
            "upvotes": 27619,
            "date": "04/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Texas, New Mexico, Indiana, Kansas, Oklahoma and Ohio",
                "measles is **very** contagious, this is only the beginning",
                "The pro-disease crowd must be thrilled.",
                "i just told a coworker about this.  a customer chimed in to say \"measles aint that bad.  you have a chance of going sterile, but that's it\".\n\ni hate this country.",
                "There are parents who are glad their children did not get vaccinated despite it leading to their child's death.  If this were to happen in a movie everyone would complain that this was too unrealistic.",
                "I'm doubtful, but I hope there's a reckoning for the antivaxxers with this ongoing.",
                "And it's only April. We'll see thousands and plenty of dead kids. Thanks propaganda factory! Thanks RFK! Thanks unhinged moms on Facebook looking for 'vaccine friendly pediatricians'!",
                "Not to worry, those numbers will be down to zero in no time at all. Those states just need to use the tried and true method of just not tracking the number of cases! That makes the problem go away, right?",
                "Anti vaccine folks, wake up to science.",
                "Measles outbreaks = making America great Again."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "SMART Rallies as Supreme Court Blocks Return of Deported Sheet Metal Worker",
            "external_url": "https://www.achrnews.com/articles/164441-smart-rallies-as-supreme-court-blocks-return-of-deported-sheet-metal-worker",
            "upvotes": 956,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Chief Justice Roberts, writing for the majority, focused heavily on what he termed \"improper venue shopping\" by the plaintiffs, suggesting they had sought out sympathetic courts to hear their case.\n\n\nHypocritical piece of shit.",
                "This is old news at this point, right? ",
                "Democracies which tolerate conservatism will be destroyed by it",
                "I'd like to have the bottled water concession at his grave site.",
                "Oh yes, where I get my most critical information from....air conditioning, heating, and refrigeration news. The Pulitzer of hard-hitting journalism. You know you can find better sources than this one?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Fan controversially rips ball from Mike Trout’s glove and Los Angeles Dodgers suffer record-breaking defeat",
            "external_url": "https://www.cnn.com/2025/04/13/sport/fan-snatches-mike-trout-catch-spt-intl/index.html?sp_amp_linker=1*tuyekw*amp_id*R2N3YUh3Qi1kYlA0SVdUdzktSWVFVV9Jbm5aTVQ5V1JBSTcwSmlXTEJtYnNOcmRUVWg0Ykp1NWJkNTR2SnNyZg..",
            "upvotes": 273,
            "date": "04/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25103036733621.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Just shoehorned the dodgers in there.",
                "Poorly written title. Happened during an angels game vs Houston. ",
                "Mike Trout, Dodgers legend.",
                "And Trout met with the fan and his kid after the game, chatted them up, and was genuinely just a nice guy about all of it. I think he also gave the kid his bat.",
                "The dad looks like Tim Robinson doing a bit",
                "Dodgers have had issues since visiting the White House. Almost like the Universe is telling them something.....",
                "The picture (in article) of the guy as the security guard is approaching is too funny. Looks like a Rodney Dangerfield impersonator.",
                "Good. Fuck the Dodgers.",
                "Baseball is so boring they had to combine 2 events into one headline and article.",
                "White House curse continues. \n\nFirst the Chiefs, now the Dodgers."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "HOT",
            "title": "Police: Someone set fire to Pennsylvania governor's residence; no one was injured",
            "external_url": "https://apnews.com/article/josh-shapiro-arson-police-fire-pennsylvania-governor-2d17ec60c48f7d4d15123dda60c88699",
            "upvotes": 139,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> In a statement, Shapiro, viewed as a potential White House contender for the Democratic Party in 2028, said he and his family woke up at about 2 a.m. to bangs on the door from the Pennsylvania State Police after the fire broke out.\n\nThis could have ended horrifically, and makes me think there was more to this than just a case of arson. I mean, wow.\n\nEDIT: It's occurred to me after speaking with some other redditors that this building would have had on-site security, so not only will someone probably be getting fired, but they were more safe than I initially assumed. \n\nStill, this isn't great.",
                "> The Harrisburg Bureau of Fire was called to the residence and, while they worked to put out the fire, police evacuated Shapiro and his family from the residence safely, Shapiro said.\n\"Thank God no one was injured and the fire was extinguished,” Shapiro said in a statement.\n\nI think the statement: someone tried to kill the Governor and his family is more accurate. So glad him and his loved ones are alright.",
                "US Domestic terrorists are certainly emboldened and have been in the last 10 years. I don’t see an end soon, but hope for one.",
                "It may or may not be coincidence, but Saturday was the first night of Passover.",
                "Happened to a Jewish governor as he and his family were sleeping after celebrating Passover in the evening. First conclusion in my head is hate crime.",
                "Where were the security forces?",
                "I'm sure Barbie Bondi will be on the case with the same zeal as if someone urinated on the tire of a Tesla.\n\n/s",
                "and you just know that Trump and the GOP are going to mock him and call it a false flag",
                "Violence is normalized and social media has been weaponized against democratic norms.  It’s over.  Freedom lost.  The GOP are overt fascists and Democrats are not only powerless to stop them, they exist mainly to further enable the wealthy elite against democratic norms.  We’re cooked. I hope folks are armed to protect themselves while they still an be."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Los Angeles-area residents crowdsource wildfire contamination data in battle with insurers",
            "external_url": "https://www.cbsnews.com/news/los-angeles-wildfires-insurance-smoke-damage-crowdsourcing/",
            "upvotes": 2306,
            "date": "04/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/28/b239007b-8ac6-44b1-8bae-cffc1feeb28b/thumbnail/1200x630/8308710326a932388223f628e983e4dd/matthew-craig-show-n-tell-clean.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "*Reports from other urban wildfires, in which building materials, appliances, cars and more burn at incredibly high temperatures, show increased levels of heavy metals including lead and polycyclic aromatic hydrocarbons (PAHs) such as benzene that are tied to negative health risks. But insurance companies haven't standardized testing for those contaminants.*\n\nAlso dioxins and furans from burning plastic. NYC was overwhelmed with all these toxins following 9/11, and the smoke itself took weeks to cease.",
                "It's a fricking outrage that insurance companies are denying smoke damage claims and forcing homeowners to scrape together their own testing data... like the Eaton Fire Residents United group is doing. This is a textbook example of corporate greed putting profits over people's health. Insurance policies need an overhaul, pronto.",
                "\"No help from FEMA...\". Of course, we get no help from FEMA. California is a blue state. Trump is such a vindictive prick he won't even help people that need it, because the state didn't vote for him.",
                "What the fuck is the point of paying for insurance if they're just going to deny you when you're in need?",
                "It is an issue that this is even necessary. The fact that this needs to happen just highlights the fundamental issue that insurance companies are not held to a reasonable standard and that they'll try the slimiest shit they can, relying on the damage one faces to isolate them and prevent them from fighting back. That is an issue that insurance companies have created in every sector they exist.",
                "They should base the awards based on zones not physical homes. We've been watching this unfold here in LA. You have houses with 100x the safe amount of lead, melted roof, and bubbled paint and insurance companies are offering prorated paint jobs based on the age of the house? I'd say pick another insurance company but we don't have many left here to even choose from",
                "Anyone that was in the city should basically assume they've lost ten years from their life expectancy; it would have been safer to attach an old garden hose to the tailpipe of an original Hummer and breath through that.",
                "Very poor here. If insurers have covered this as a payable event, then the claim needs to be paid. No two ways about it\n\nThe problem is next time. What insurer or reinsurer is going to want to cover property in LA from now on? The premiums will be far too expensive, so the state will have to cover it",
                "~Houses; what great investments.~\n\nPartially underground brick with sod-roofs is an actual residence that does the least amount of damage to the environment.\n\nMaking castles on sand that may or may not be covered by insurance is a poor choice of investment.\n\nEdit: don’t take this comment as “CaLiFoRnIa BaD”, I think about all the displaced people often, and it is difficult to know how they are doing because when I’ve looked all I could find were news articles about zoning and building permits.\n\nI think our society could be managed better overall, and I’ve posted before about perhaps rebuilding LA to be similar to the Jetsons. If this is outlandish, well every location/climate requires different infrastructure. A raised city might be a good thing in an area with easily persistent fire"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Man killed in 1 of 4 Thursday night Montgomery shootings identified",
            "external_url": "https://www.wsfa.com/2025/03/14/man-killed-1-4-thursday-night-montgomery-shootings-identified/",
            "upvotes": 2116,
            "date": "04/12/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/ERU4UH35UBGMPH3OCPYC36VXOA.jpg?auth=1ab795b9a7d8adeb59ca62e8446e9f1ec84546a4a840944ebe7767f5b15e5d5a&width=1200&height=600&smart=true",
            "top_comments": [
                "Police are waiting for forensic results to see if he was killed in any of the other shootings.",
                "> At least five people were shot in the Capital City in a two-hour span, including Samuel Giles, 25, of Montgomery, who died from his injuries.\n\nI feel for the people. It has to be incredibly scary to have no answers, and to wonder if this is a pattern of shootings that will continue.",
                "Montgomery resident here. Or, I was as of a few months ago. Montgomery has a serious problem with gang violence, and our dear mayor refuses to acknowledge it. You probably remember him. Steven Reed made national headlines a few years back as the first black man elected Mayor of Montgomery, once the home of the Confederacy. What they *didn’t* tell you, is that he’s the son of one of Montgomery’s most corrupt politicians in recent times. As of late, it’s clear the Apple doesn’t fall far from the questionably sourced political donations. \n\nI have it on good authority that Reed wants to make a shot at Congress, and his blatant disregard for the growing violence in his city probably won’t help him.",
                "It's deeply unsettling to hear about this string of violent events, and it's particularly troubling to think that they might *not* be related, given the lack of identified motives, I hope authorities can quickly find answers, because honestly, it's hard to believe that so much tragedy can happen without any clear connection.",
                "You're not supposed to be able to do that in a small town and guns prevent gun deaths in deep red Alabama.",
                "Just another day in the land of the freedumb.",
                "It's genuinely heartbreaking to hear about this awful chain of incidents in Montgomery, and frankly, the city needs some serious support, it's just awful., and a focus on preventing this kind of violence so everyone can feel safe, because, really, it shouldn't happen.",
                "I drove through Montgomery and got a hotel room two years ago at a decent place while traveling to FL and the lady at the hotel said I am so thankful you stopped here and not the other exit. She said it’s dangerous. She was the sweetest. You don’t know what is bad or good in cities but I picked the best exit to stop for sure.",
                "At least he didn't die on a subway",
                "[deleted]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Police: Someone set fire to Pennsylvania governor's residence; no one was injured",
            "external_url": "https://apnews.com/article/josh-shapiro-arson-police-fire-pennsylvania-governor-2d17ec60c48f7d4d15123dda60c88699",
            "upvotes": 138,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> In a statement, Shapiro, viewed as a potential White House contender for the Democratic Party in 2028, said he and his family woke up at about 2 a.m. to bangs on the door from the Pennsylvania State Police after the fire broke out.\n\nThis could have ended horrifically, and makes me think there was more to this than just a case of arson. I mean, wow.\n\nEDIT: It's occurred to me after speaking with some other redditors that this building would have had on-site security, so not only will someone probably be getting fired, but they were more safe than I initially assumed. \n\nStill, this isn't great.",
                "> The Harrisburg Bureau of Fire was called to the residence and, while they worked to put out the fire, police evacuated Shapiro and his family from the residence safely, Shapiro said.\n\"Thank God no one was injured and the fire was extinguished,” Shapiro said in a statement.\n\nI think the statement: someone tried to kill the Governor and his family is more accurate. So glad him and his loved ones are alright.",
                "US Domestic terrorists are certainly emboldened and have been in the last 10 years. I don’t see an end soon, but hope for one.",
                "It may or may not be coincidence, but Saturday was the first night of Passover.",
                "Happened to a Jewish governor as he and his family were sleeping after celebrating Passover in the evening. First conclusion in my head is hate crime.",
                "Where were the security forces?",
                "I'm sure Barbie Bondi will be on the case with the same zeal as if someone urinated on the tire of a Tesla.\n\n/s",
                "and you just know that Trump and the GOP are going to mock him and call it a false flag",
                "Violence is normalized and social media has been weaponized against democratic norms.  It’s over.  Freedom lost.  The GOP are overt fascists and Democrats are not only powerless to stop them, they exist mainly to further enable the wealthy elite against democratic norms.  We’re cooked. I hope folks are armed to protect themselves while they still an be."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "DHS Mistakenly tells attorney US Citizen to leave the US",
            "external_url": "https://www.nbcboston.com/news/local/massachusetts-immigration-attorney-dhs-parole-termination/3684504/",
            "upvotes": 2242,
            "date": "04/13/2025",
            "thumbnail": "https://media.nbcboston.com/2025/04/dhs-parole-termination-notice-attorney.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "This isn’t a mistake it’s a trial balloon",
                ">Mistakenly\n\nYeah, I’m sure it was. No veiled threats here, guys.",
                "*CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients.*\n\nYep, totally explains why the American citizen contact was the only one named in the notice. Sure guys, makes total sense.",
                "An immigration attorney….seems suspicious.",
                "According to MAGA, if they're not white, they're illegal 🤷‍♀️",
                "What dehumanizing language\n\n “ CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients”",
                "I have a bridge to sell you if you think it was a mistake",
                "It wasn’t a mistake…. They always call it a mistake when called out",
                "Nothing. \nThis. \nAdministration. \nDoes. \nIs. \nA. \nMistake. \n\nThey are tests.",
                "NPR last week interviewed a US attorney who is a US citizen, and he said the Trump administration is targeting US immigration attorneys. He was coming back from vacation and crossed the border checkpoint.That is when border patrol targeted him and detained him, then tried to confiscate his phone. They told him he was on a list for terrorists. He told them he had over ten years of attorney client privilege communications on his phone.  He told them absolutely not in confiscating his phone.  He said there are other immigration attorneys he personally knows that are also being harrassed by ICE and border patrol.\nhttps://www.npr.org/2025/04/09/nx-s1-5357455/attorney-detained-by-immigration-authorities"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Fan controversially rips ball from Mike Trout’s glove and Los Angeles Dodgers suffer record-breaking defeat",
            "external_url": "https://www.cnn.com/2025/04/13/sport/fan-snatches-mike-trout-catch-spt-intl/index.html?sp_amp_linker=1*tuyekw*amp_id*R2N3YUh3Qi1kYlA0SVdUdzktSWVFVV9Jbm5aTVQ5V1JBSTcwSmlXTEJtYnNOcmRUVWg0Ykp1NWJkNTR2SnNyZg..",
            "upvotes": 273,
            "date": "04/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25103036733621.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Just shoehorned the dodgers in there.",
                "Poorly written title. Happened during an angels game vs Houston. ",
                "Mike Trout, Dodgers legend.",
                "And Trout met with the fan and his kid after the game, chatted them up, and was genuinely just a nice guy about all of it. I think he also gave the kid his bat.",
                "The dad looks like Tim Robinson doing a bit",
                "Dodgers have had issues since visiting the White House. Almost like the Universe is telling them something.....",
                "The picture (in article) of the guy as the security guard is approaching is too funny. Looks like a Rodney Dangerfield impersonator.",
                "Good. Fuck the Dodgers.",
                "Baseball is so boring they had to combine 2 events into one headline and article.",
                "White House curse continues. \n\nFirst the Chiefs, now the Dodgers."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "Helicopter in fatal New York crash lacked flight recorders, officials say",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/13/helicopter-new-york-crash",
            "upvotes": 679,
            "date": "04/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/dbea5a7eb88439e5faf969e2db225b3a65afc240/0_203_7701_4623/master/7701.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d754c302a6b984d7e0af88a7110f32a5",
            "top_comments": [
                "From the article:\n> No video or camera recorders have been recovered from the Bell 206 helicopter, the NTSB said in an update late on Saturday – and none of the equipment on it had recorded information that would help the investigation.\n> \n> New York police divers were continuing to search for parts of the helicopter, including the main rotor, gear box, tail rotor and the tail boom, the safety agency said.\n\nI don’t know where a flight recorder would be installed. But nothing in the article concludes that the air craft was without a flight corder prior to the incident. Only that one has not been found.",
                "Oh come on, don't let your fk up fuel the conspiracy theories",
                "Out of all the thing that suck in this world the news is really trying to get me to care about this",
                ">\"It was also on its eighth tour flight of the day, having already completed seven, according to federal investigators.\"\n\nThe people who were on the seventh flight of the day (the one immediately preceding the fatal flight) must be pretty relieved/amazed at their good fortune. I am sure they will be interviewed as part of the investigation to see if they noticed anything out of the ordinary.",
                "Not sure how a recorder helps it not fall apart.",
                "Seems it lacked proper maintenance as well!",
                "These helicopters don’t have flight recorders, because they aren’t mandatory for this size of aircraft. \n\nSo maybe it’s time the FAA makes them mandatory.",
                "I have to admit that I'm surprised that commercial aircraft are not required by law to have flight recorders.",
                "I get that it's a military chopper, but aren't those installed by default? Like bolted in at the plant?\n\nEdit: nvm, confused it for the DC crash."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "At least 32 people killed in Russian ballistic missile attack on Sumy",
            "external_url": "https://www.bbc.com/news/articles/c4g4262x4x1o",
            "upvotes": 999,
            "date": "04/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0e6c/live/30aacb10-185d-11f0-b61e-cb0b76a18982.jpg",
            "top_comments": [
                "Russia is a terrorist country.",
                "Longest “One day to end the war” ever.",
                "Cluster munitions fired upon civilians on Palm Sunday. Are there still people in Russia who think this is justified?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "SMART Rallies as Supreme Court Blocks Return of Deported Sheet Metal Worker",
            "external_url": "https://www.achrnews.com/articles/164441-smart-rallies-as-supreme-court-blocks-return-of-deported-sheet-metal-worker",
            "upvotes": 949,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Chief Justice Roberts, writing for the majority, focused heavily on what he termed \"improper venue shopping\" by the plaintiffs, suggesting they had sought out sympathetic courts to hear their case.\n\n\nHypocritical piece of shit.",
                "This is old news at this point, right? ",
                "Democracies which tolerate conservatism will be destroyed by it",
                "I'd like to have the bottled water concession at his grave site.",
                "Oh yes, where I get my most critical information from....air conditioning, heating, and refrigeration news. The Pulitzer of hard-hitting journalism. You know you can find better sources than this one?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Airstrike destroys parts of Gaza City hospital as Israel intensifies offensive",
            "external_url": "https://www.theguardian.com/world/2025/apr/13/gaza-city-hospital-hit-ahli-baptist-civil-defence-agency-israel-intensifies-military-operations-katz",
            "upvotes": 1956,
            "date": "04/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ed96a102a84c234498e10dab4b6ed4e9b53be73e/39_0_1198_719/master/1198.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=632544ccd01aff72de4c28216b12cd51",
            "top_comments": [
                "War criminals gonna war crime.",
                "I can remember when Israel used to deny attacking hospitals",
                "America supports this. The West supports this.",
                "MoSt MoRaL aRmY iN tHe WoRlD.",
                "Fear will have people justifying anything",
                "Just as evil as Putin’s recent strike on civilians in Ukraine but we mustn’t hold Israel accountable by criticizing them.",
                "An \"offensive\" against 99.9% civilians, mostly women and children.",
                "Wait, I thought King Donvict brought lasting peace to the mideast like he did to Ukraine?",
                "this will surely make people love Israel",
                "Interesting all those \"genocide Joe\" folks are kinda silent or just not reported on anymore. Almost like they were used to depress the vote or something."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US measles cases surpass 700 with outbreaks in six states.",
            "external_url": "https://apnews.com/article/measles-outbreak-texas-rfk-new-mexico-kansas-vaccine-e904ec9781f1d164c73afe4ab71774fe",
            "upvotes": 27611,
            "date": "04/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Texas, New Mexico, Indiana, Kansas, Oklahoma and Ohio",
                "measles is **very** contagious, this is only the beginning",
                "The pro-disease crowd must be thrilled.",
                "i just told a coworker about this.  a customer chimed in to say \"measles aint that bad.  you have a chance of going sterile, but that's it\".\n\ni hate this country.",
                "There are parents who are glad their children did not get vaccinated despite it leading to their child's death.  If this were to happen in a movie everyone would complain that this was too unrealistic.",
                "I'm doubtful, but I hope there's a reckoning for the antivaxxers with this ongoing.",
                "And it's only April. We'll see thousands and plenty of dead kids. Thanks propaganda factory! Thanks RFK! Thanks unhinged moms on Facebook looking for 'vaccine friendly pediatricians'!",
                "Not to worry, those numbers will be down to zero in no time at all. Those states just need to use the tried and true method of just not tracking the number of cases! That makes the problem go away, right?",
                "Anti vaccine folks, wake up to science.",
                "Measles outbreaks = making America great Again."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Los Angeles-area residents crowdsource wildfire contamination data in battle with insurers",
            "external_url": "https://www.cbsnews.com/news/los-angeles-wildfires-insurance-smoke-damage-crowdsourcing/",
            "upvotes": 2307,
            "date": "04/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/28/b239007b-8ac6-44b1-8bae-cffc1feeb28b/thumbnail/1200x630/8308710326a932388223f628e983e4dd/matthew-craig-show-n-tell-clean.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "*Reports from other urban wildfires, in which building materials, appliances, cars and more burn at incredibly high temperatures, show increased levels of heavy metals including lead and polycyclic aromatic hydrocarbons (PAHs) such as benzene that are tied to negative health risks. But insurance companies haven't standardized testing for those contaminants.*\n\nAlso dioxins and furans from burning plastic. NYC was overwhelmed with all these toxins following 9/11, and the smoke itself took weeks to cease.",
                "It's a fricking outrage that insurance companies are denying smoke damage claims and forcing homeowners to scrape together their own testing data... like the Eaton Fire Residents United group is doing. This is a textbook example of corporate greed putting profits over people's health. Insurance policies need an overhaul, pronto.",
                "\"No help from FEMA...\". Of course, we get no help from FEMA. California is a blue state. Trump is such a vindictive prick he won't even help people that need it, because the state didn't vote for him.",
                "What the fuck is the point of paying for insurance if they're just going to deny you when you're in need?",
                "It is an issue that this is even necessary. The fact that this needs to happen just highlights the fundamental issue that insurance companies are not held to a reasonable standard and that they'll try the slimiest shit they can, relying on the damage one faces to isolate them and prevent them from fighting back. That is an issue that insurance companies have created in every sector they exist.",
                "They should base the awards based on zones not physical homes. We've been watching this unfold here in LA. You have houses with 100x the safe amount of lead, melted roof, and bubbled paint and insurance companies are offering prorated paint jobs based on the age of the house? I'd say pick another insurance company but we don't have many left here to even choose from",
                "Anyone that was in the city should basically assume they've lost ten years from their life expectancy; it would have been safer to attach an old garden hose to the tailpipe of an original Hummer and breath through that.",
                "Very poor here. If insurers have covered this as a payable event, then the claim needs to be paid. No two ways about it\n\nThe problem is next time. What insurer or reinsurer is going to want to cover property in LA from now on? The premiums will be far too expensive, so the state will have to cover it",
                "~Houses; what great investments.~\n\nPartially underground brick with sod-roofs is an actual residence that does the least amount of damage to the environment.\n\nMaking castles on sand that may or may not be covered by insurance is a poor choice of investment.\n\nEdit: don’t take this comment as “CaLiFoRnIa BaD”, I think about all the displaced people often, and it is difficult to know how they are doing because when I’ve looked all I could find were news articles about zoning and building permits.\n\nI think our society could be managed better overall, and I’ve posted before about perhaps rebuilding LA to be similar to the Jetsons. If this is outlandish, well every location/climate requires different infrastructure. A raised city might be a good thing in an area with easily persistent fire"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Man killed in 1 of 4 Thursday night Montgomery shootings identified",
            "external_url": "https://www.wsfa.com/2025/03/14/man-killed-1-4-thursday-night-montgomery-shootings-identified/",
            "upvotes": 2120,
            "date": "04/12/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/ERU4UH35UBGMPH3OCPYC36VXOA.jpg?auth=1ab795b9a7d8adeb59ca62e8446e9f1ec84546a4a840944ebe7767f5b15e5d5a&width=1200&height=600&smart=true",
            "top_comments": [
                "Police are waiting for forensic results to see if he was killed in any of the other shootings.",
                "> At least five people were shot in the Capital City in a two-hour span, including Samuel Giles, 25, of Montgomery, who died from his injuries.\n\nI feel for the people. It has to be incredibly scary to have no answers, and to wonder if this is a pattern of shootings that will continue.",
                "Montgomery resident here. Or, I was as of a few months ago. Montgomery has a serious problem with gang violence, and our dear mayor refuses to acknowledge it. You probably remember him. Steven Reed made national headlines a few years back as the first black man elected Mayor of Montgomery, once the home of the Confederacy. What they *didn’t* tell you, is that he’s the son of one of Montgomery’s most corrupt politicians in recent times. As of late, it’s clear the Apple doesn’t fall far from the questionably sourced political donations. \n\nI have it on good authority that Reed wants to make a shot at Congress, and his blatant disregard for the growing violence in his city probably won’t help him.",
                "It's deeply unsettling to hear about this string of violent events, and it's particularly troubling to think that they might *not* be related, given the lack of identified motives, I hope authorities can quickly find answers, because honestly, it's hard to believe that so much tragedy can happen without any clear connection.",
                "You're not supposed to be able to do that in a small town and guns prevent gun deaths in deep red Alabama.",
                "Just another day in the land of the freedumb.",
                "It's genuinely heartbreaking to hear about this awful chain of incidents in Montgomery, and frankly, the city needs some serious support, it's just awful., and a focus on preventing this kind of violence so everyone can feel safe, because, really, it shouldn't happen.",
                "I drove through Montgomery and got a hotel room two years ago at a decent place while traveling to FL and the lady at the hotel said I am so thankful you stopped here and not the other exit. She said it’s dangerous. She was the sweetest. You don’t know what is bad or good in cities but I picked the best exit to stop for sure.",
                "At least he didn't die on a subway",
                "[deleted]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "DHS Mistakenly tells attorney US Citizen to leave the US",
            "external_url": "https://www.nbcboston.com/news/local/massachusetts-immigration-attorney-dhs-parole-termination/3684504/",
            "upvotes": 2242,
            "date": "04/13/2025",
            "thumbnail": "https://media.nbcboston.com/2025/04/dhs-parole-termination-notice-attorney.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "This isn’t a mistake it’s a trial balloon",
                ">Mistakenly\n\nYeah, I’m sure it was. No veiled threats here, guys.",
                "*CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients.*\n\nYep, totally explains why the American citizen contact was the only one named in the notice. Sure guys, makes total sense.",
                "An immigration attorney….seems suspicious.",
                "According to MAGA, if they're not white, they're illegal 🤷‍♀️",
                "What dehumanizing language\n\n “ CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients”",
                "I have a bridge to sell you if you think it was a mistake",
                "It wasn’t a mistake…. They always call it a mistake when called out",
                "Nothing. \nThis. \nAdministration. \nDoes. \nIs. \nA. \nMistake. \n\nThey are tests.",
                "NPR last week interviewed a US attorney who is a US citizen, and he said the Trump administration is targeting US immigration attorneys. He was coming back from vacation and crossed the border checkpoint.That is when border patrol targeted him and detained him, then tried to confiscate his phone. They told him he was on a list for terrorists. He told them he had over ten years of attorney client privilege communications on his phone.  He told them absolutely not in confiscating his phone.  He said there are other immigration attorneys he personally knows that are also being harrassed by ICE and border patrol.\nhttps://www.npr.org/2025/04/09/nx-s1-5357455/attorney-detained-by-immigration-authorities"
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "RISING",
            "title": "At least 32 people killed in Russian ballistic missile attack on Sumy",
            "external_url": "https://www.bbc.com/news/articles/c4g4262x4x1o",
            "upvotes": 1003,
            "date": "04/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0e6c/live/30aacb10-185d-11f0-b61e-cb0b76a18982.jpg",
            "top_comments": [
                "Russia is a terrorist country.",
                "Longest “One day to end the war” ever.",
                "Cluster munitions fired upon civilians on Palm Sunday. Are there still people in Russia who think this is justified?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Helicopter in fatal New York crash lacked flight recorders, officials say",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/13/helicopter-new-york-crash",
            "upvotes": 680,
            "date": "04/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/dbea5a7eb88439e5faf969e2db225b3a65afc240/0_203_7701_4623/master/7701.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d754c302a6b984d7e0af88a7110f32a5",
            "top_comments": [
                "From the article:\n> No video or camera recorders have been recovered from the Bell 206 helicopter, the NTSB said in an update late on Saturday – and none of the equipment on it had recorded information that would help the investigation.\n> \n> New York police divers were continuing to search for parts of the helicopter, including the main rotor, gear box, tail rotor and the tail boom, the safety agency said.\n\nI don’t know where a flight recorder would be installed. But nothing in the article concludes that the air craft was without a flight corder prior to the incident. Only that one has not been found.",
                "Oh come on, don't let your fk up fuel the conspiracy theories",
                "Out of all the thing that suck in this world the news is really trying to get me to care about this",
                ">\"It was also on its eighth tour flight of the day, having already completed seven, according to federal investigators.\"\n\nThe people who were on the seventh flight of the day (the one immediately preceding the fatal flight) must be pretty relieved/amazed at their good fortune. I am sure they will be interviewed as part of the investigation to see if they noticed anything out of the ordinary.",
                "Not sure how a recorder helps it not fall apart.",
                "Seems it lacked proper maintenance as well!",
                "These helicopters don’t have flight recorders, because they aren’t mandatory for this size of aircraft. \n\nSo maybe it’s time the FAA makes them mandatory.",
                "I have to admit that I'm surprised that commercial aircraft are not required by law to have flight recorders.",
                "I get that it's a military chopper, but aren't those installed by default? Like bolted in at the plant?\n\nEdit: nvm, confused it for the DC crash."
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "RISING",
            "title": "Airstrike destroys parts of Gaza City hospital as Israel intensifies offensive",
            "external_url": "https://www.theguardian.com/world/2025/apr/13/gaza-city-hospital-hit-ahli-baptist-civil-defence-agency-israel-intensifies-military-operations-katz",
            "upvotes": 1962,
            "date": "04/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ed96a102a84c234498e10dab4b6ed4e9b53be73e/39_0_1198_719/master/1198.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=632544ccd01aff72de4c28216b12cd51",
            "top_comments": [
                "War criminals gonna war crime.",
                "I can remember when Israel used to deny attacking hospitals",
                "America supports this. The West supports this.",
                "MoSt MoRaL aRmY iN tHe WoRlD.",
                "Fear will have people justifying anything",
                "Just as evil as Putin’s recent strike on civilians in Ukraine but we mustn’t hold Israel accountable by criticizing them.",
                "An \"offensive\" against 99.9% civilians, mostly women and children.",
                "Wait, I thought King Donvict brought lasting peace to the mideast like he did to Ukraine?",
                "this will surely make people love Israel",
                "Interesting all those \"genocide Joe\" folks are kinda silent or just not reported on anymore. Almost like they were used to depress the vote or something."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Fan controversially rips ball from Mike Trout’s glove and Los Angeles Dodgers suffer record-breaking defeat",
            "external_url": "https://www.cnn.com/2025/04/13/sport/fan-snatches-mike-trout-catch-spt-intl/index.html?sp_amp_linker=1*tuyekw*amp_id*R2N3YUh3Qi1kYlA0SVdUdzktSWVFVV9Jbm5aTVQ5V1JBSTcwSmlXTEJtYnNOcmRUVWg0Ykp1NWJkNTR2SnNyZg..",
            "upvotes": 275,
            "date": "04/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25103036733621.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Just shoehorned the dodgers in there.",
                "Poorly written title. Happened during an angels game vs Houston. ",
                "Mike Trout, Dodgers legend.",
                "And Trout met with the fan and his kid after the game, chatted them up, and was genuinely just a nice guy about all of it. I think he also gave the kid his bat.",
                "The dad looks like Tim Robinson doing a bit",
                "Dodgers have had issues since visiting the White House. Almost like the Universe is telling them something.....",
                "The picture (in article) of the guy as the security guard is approaching is too funny. Looks like a Rodney Dangerfield impersonator.",
                "Good. Fuck the Dodgers.",
                "Baseball is so boring they had to combine 2 events into one headline and article.",
                "White House curse continues. \n\nFirst the Chiefs, now the Dodgers."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "SMART Rallies as Supreme Court Blocks Return of Deported Sheet Metal Worker",
            "external_url": "https://www.achrnews.com/articles/164441-smart-rallies-as-supreme-court-blocks-return-of-deported-sheet-metal-worker",
            "upvotes": 951,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Chief Justice Roberts, writing for the majority, focused heavily on what he termed \"improper venue shopping\" by the plaintiffs, suggesting they had sought out sympathetic courts to hear their case.\n\n\nHypocritical piece of shit.",
                "This is old news at this point, right? ",
                "Democracies which tolerate conservatism will be destroyed by it",
                "I'd like to have the bottled water concession at his grave site.",
                "Oh yes, where I get my most critical information from....air conditioning, heating, and refrigeration news. The Pulitzer of hard-hitting journalism. You know you can find better sources than this one?"
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "RISING",
            "title": "US measles cases surpass 700 with outbreaks in six states.",
            "external_url": "https://apnews.com/article/measles-outbreak-texas-rfk-new-mexico-kansas-vaccine-e904ec9781f1d164c73afe4ab71774fe",
            "upvotes": 27616,
            "date": "04/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Texas, New Mexico, Indiana, Kansas, Oklahoma and Ohio",
                "measles is **very** contagious, this is only the beginning",
                "The pro-disease crowd must be thrilled.",
                "i just told a coworker about this.  a customer chimed in to say \"measles aint that bad.  you have a chance of going sterile, but that's it\".\n\ni hate this country.",
                "There are parents who are glad their children did not get vaccinated despite it leading to their child's death.  If this were to happen in a movie everyone would complain that this was too unrealistic.",
                "I'm doubtful, but I hope there's a reckoning for the antivaxxers with this ongoing.",
                "And it's only April. We'll see thousands and plenty of dead kids. Thanks propaganda factory! Thanks RFK! Thanks unhinged moms on Facebook looking for 'vaccine friendly pediatricians'!",
                "Not to worry, those numbers will be down to zero in no time at all. Those states just need to use the tried and true method of just not tracking the number of cases! That makes the problem go away, right?",
                "Anti vaccine folks, wake up to science.",
                "Measles outbreaks = making America great Again."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Police: Someone set fire to Pennsylvania governor's residence; no one was injured",
            "external_url": "https://apnews.com/article/josh-shapiro-arson-police-fire-pennsylvania-governor-2d17ec60c48f7d4d15123dda60c88699",
            "upvotes": 137,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> In a statement, Shapiro, viewed as a potential White House contender for the Democratic Party in 2028, said he and his family woke up at about 2 a.m. to bangs on the door from the Pennsylvania State Police after the fire broke out.\n\nThis could have ended horrifically, and makes me think there was more to this than just a case of arson. I mean, wow.\n\nEDIT: It's occurred to me after speaking with some other redditors that this building would have had on-site security, so not only will someone probably be getting fired, but they were more safe than I initially assumed. \n\nStill, this isn't great.",
                "> The Harrisburg Bureau of Fire was called to the residence and, while they worked to put out the fire, police evacuated Shapiro and his family from the residence safely, Shapiro said.\n\"Thank God no one was injured and the fire was extinguished,” Shapiro said in a statement.\n\nI think the statement: someone tried to kill the Governor and his family is more accurate. So glad him and his loved ones are alright.",
                "US Domestic terrorists are certainly emboldened and have been in the last 10 years. I don’t see an end soon, but hope for one.",
                "It may or may not be coincidence, but Saturday was the first night of Passover.",
                "Happened to a Jewish governor as he and his family were sleeping after celebrating Passover in the evening. First conclusion in my head is hate crime.",
                "Where were the security forces?",
                "I'm sure Barbie Bondi will be on the case with the same zeal as if someone urinated on the tire of a Tesla.\n\n/s",
                "and you just know that Trump and the GOP are going to mock him and call it a false flag",
                "Violence is normalized and social media has been weaponized against democratic norms.  It’s over.  Freedom lost.  The GOP are overt fascists and Democrats are not only powerless to stop them, they exist mainly to further enable the wealthy elite against democratic norms.  We’re cooked. I hope folks are armed to protect themselves while they still an be."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Los Angeles-area residents crowdsource wildfire contamination data in battle with insurers",
            "external_url": "https://www.cbsnews.com/news/los-angeles-wildfires-insurance-smoke-damage-crowdsourcing/",
            "upvotes": 2315,
            "date": "04/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/28/b239007b-8ac6-44b1-8bae-cffc1feeb28b/thumbnail/1200x630/8308710326a932388223f628e983e4dd/matthew-craig-show-n-tell-clean.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "*Reports from other urban wildfires, in which building materials, appliances, cars and more burn at incredibly high temperatures, show increased levels of heavy metals including lead and polycyclic aromatic hydrocarbons (PAHs) such as benzene that are tied to negative health risks. But insurance companies haven't standardized testing for those contaminants.*\n\nAlso dioxins and furans from burning plastic. NYC was overwhelmed with all these toxins following 9/11, and the smoke itself took weeks to cease.",
                "It's a fricking outrage that insurance companies are denying smoke damage claims and forcing homeowners to scrape together their own testing data... like the Eaton Fire Residents United group is doing. This is a textbook example of corporate greed putting profits over people's health. Insurance policies need an overhaul, pronto.",
                "\"No help from FEMA...\". Of course, we get no help from FEMA. California is a blue state. Trump is such a vindictive prick he won't even help people that need it, because the state didn't vote for him.",
                "What the fuck is the point of paying for insurance if they're just going to deny you when you're in need?",
                "It is an issue that this is even necessary. The fact that this needs to happen just highlights the fundamental issue that insurance companies are not held to a reasonable standard and that they'll try the slimiest shit they can, relying on the damage one faces to isolate them and prevent them from fighting back. That is an issue that insurance companies have created in every sector they exist.",
                "They should base the awards based on zones not physical homes. We've been watching this unfold here in LA. You have houses with 100x the safe amount of lead, melted roof, and bubbled paint and insurance companies are offering prorated paint jobs based on the age of the house? I'd say pick another insurance company but we don't have many left here to even choose from",
                "Anyone that was in the city should basically assume they've lost ten years from their life expectancy; it would have been safer to attach an old garden hose to the tailpipe of an original Hummer and breath through that.",
                "Very poor here. If insurers have covered this as a payable event, then the claim needs to be paid. No two ways about it\n\nThe problem is next time. What insurer or reinsurer is going to want to cover property in LA from now on? The premiums will be far too expensive, so the state will have to cover it",
                "~Houses; what great investments.~\n\nPartially underground brick with sod-roofs is an actual residence that does the least amount of damage to the environment.\n\nMaking castles on sand that may or may not be covered by insurance is a poor choice of investment.\n\nEdit: don’t take this comment as “CaLiFoRnIa BaD”, I think about all the displaced people often, and it is difficult to know how they are doing because when I’ve looked all I could find were news articles about zoning and building permits.\n\nI think our society could be managed better overall, and I’ve posted before about perhaps rebuilding LA to be similar to the Jetsons. If this is outlandish, well every location/climate requires different infrastructure. A raised city might be a good thing in an area with easily persistent fire"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Man killed in 1 of 4 Thursday night Montgomery shootings identified",
            "external_url": "https://www.wsfa.com/2025/03/14/man-killed-1-4-thursday-night-montgomery-shootings-identified/",
            "upvotes": 2118,
            "date": "04/12/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/ERU4UH35UBGMPH3OCPYC36VXOA.jpg?auth=1ab795b9a7d8adeb59ca62e8446e9f1ec84546a4a840944ebe7767f5b15e5d5a&width=1200&height=600&smart=true",
            "top_comments": [
                "Police are waiting for forensic results to see if he was killed in any of the other shootings.",
                "> At least five people were shot in the Capital City in a two-hour span, including Samuel Giles, 25, of Montgomery, who died from his injuries.\n\nI feel for the people. It has to be incredibly scary to have no answers, and to wonder if this is a pattern of shootings that will continue.",
                "Montgomery resident here. Or, I was as of a few months ago. Montgomery has a serious problem with gang violence, and our dear mayor refuses to acknowledge it. You probably remember him. Steven Reed made national headlines a few years back as the first black man elected Mayor of Montgomery, once the home of the Confederacy. What they *didn’t* tell you, is that he’s the son of one of Montgomery’s most corrupt politicians in recent times. As of late, it’s clear the Apple doesn’t fall far from the questionably sourced political donations. \n\nI have it on good authority that Reed wants to make a shot at Congress, and his blatant disregard for the growing violence in his city probably won’t help him.",
                "It's deeply unsettling to hear about this string of violent events, and it's particularly troubling to think that they might *not* be related, given the lack of identified motives, I hope authorities can quickly find answers, because honestly, it's hard to believe that so much tragedy can happen without any clear connection.",
                "You're not supposed to be able to do that in a small town and guns prevent gun deaths in deep red Alabama.",
                "Just another day in the land of the freedumb.",
                "It's genuinely heartbreaking to hear about this awful chain of incidents in Montgomery, and frankly, the city needs some serious support, it's just awful., and a focus on preventing this kind of violence so everyone can feel safe, because, really, it shouldn't happen.",
                "I drove through Montgomery and got a hotel room two years ago at a decent place while traveling to FL and the lady at the hotel said I am so thankful you stopped here and not the other exit. She said it’s dangerous. She was the sweetest. You don’t know what is bad or good in cities but I picked the best exit to stop for sure.",
                "At least he didn't die on a subway",
                "[deleted]"
            ],
            "aggregate_sentiment": 50.0
        }
    ],
    "last_updated": "04/13/2025 16:08:53 UTC"
}