{
    "posts": [
        {
            "category": "HOT",
            "title": "Trump has instructed to raise Canadian tariffs on aluminum and steel to 50%",
            "external_url": "https://www.theguardian.com/us-news/live/2025/mar/11/donald-trump-latest-us-politics-news-live?CMP=share_btn_url&page=with%3Ablock-67d042cb8f087aea3a248e0d#block-67d042cb8f087aea3a248e0d",
            "upvotes": 24163,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/0e5cfb3943da44eb9c83513768b077fa8f23acf9/0_635_9504_5701/master/9504.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=5e929e182f325ba9b1bed6721b04f1be",
            "top_comments": [
                "I like how he keeps bringing up the dairy one. Negotiated BY HIM, and it only kicks in at a level that has NEVER been met. Those tariffs have never been charged.",
                "Sounds like it gonna be another great day on the Stock Market!!!",
                "It's wild. We were so scared of the first set of tariffs, now I'm just like \"I'm tired boss\" and keep scrolling. Honestly his inability to take a measured approach to anything makes me think it'll sputter out quickly, he'll claim victory and forget tariffs are a thing by summer. Wishful thinking, I know.",
                "Apparently Trump wanted more chaos and uncertainty today. He and his administration have been trying to do at least one ill intentioned thing per day so far.",
                "\"Trump said he would “permanently shut down the automobile manufacturing business in Canada” if the country did not end unspecified tariffs it had placed on US goods:\"\n\nEverything in thr market could be appeased if this moron backs down. \n\nAnd yet, he continues to double down on tariffs. \n\nThis is madness",
                "“He would see the entire world burn just to be the king of ashes”",
                "Maybe instead of tariffs, we could properly tax billionaires 🤷🏻‍♂️",
                "Last time he did this, during Trump 1.0, aluminum plants in Kentucky closed, leading to higher unemployment. That county was devastated. Congratulations, Trump, and Trump voters!!!",
                "My MAGA buddy who owns a metal building construction business is about to find out",
                "Trump recession is self inflicted. Trump must be rejected."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Seven men arrested in Japan for raping daughters, sharing footage in chat group.",
            "external_url": "https://www.straitstimes.com/asia/east-asia/seven-men-arrested-in-japan-for-raping-daughters-sharing-footage-in-chat-group",
            "upvotes": 4274,
            "date": "03/11/2025",
            "thumbnail": "https://cassette.sphdigital.com.sg/image/straitstimes/cbb298abcce5ca7335e17c5dc6540bd83acce49d9a88a567e58400a2045ea275",
            "top_comments": [
                "Investigative sources revealed that the seven men, aged in their 30s to 50s and living in Aichi Prefecture and elsewhere, stand accused of penetrative sexual assault as well as violations of anti-child prostitution and anti-child pornography laws. Four of the men allegedly filmed the scenes of them sexually assaulting their biological or foster daughters, aged between 6 and 14 at the time, and shared the footage within a social media group, while the other three owned obscene images of underage individuals.\n\nIn the messaging app used by the group, there were comments reading, \"I've trained her since she was 3,\" \"Just telling her, 'If you tell your mom, you wouldn't be able to be with your dad. Can you keep a secret?' worked for me,\" and, \"Because my wife is away on a trip.\" The prefectural police believe that the men continued to sexually abuse their own daughters and others on a regular basis.\n\nIn November last year, one of the men was arrested on suspicion of penetrative sexual assault of an underage person, and a probe of his mobile phone revealed that the group was sharing obscene videos.\n\nIt is thought that the group, comprised of men fond of incest with minors, started exchanging information in around December 2023. The seven suspects came to know each other through another online website, and one of them managed the chat group in question. The police suspect that several other men had joined the group, and are continuing to investigate the case.",
                "These guys raped their own daughters regularly, youngest girl was six years old.  \nFilmed it and then circulate/share within their own chat group with other men/fathers.   \nHow muthaf\\*\\*king sick can one be to come up with such stuff!",
                "I cannot even imagine the lifetime of trauma these girls will battle. They deserve the best care and support for the rest of their lives.  I'm not sure what kind of sentencing the Japanese legal system has, but I hope these men rot in prison. I hope every day until the end of their days is full of misery.",
                "adblocker blocks the whole entire website. like, nothing at all shows up and the block counter just goes and goes",
                "Just looked at the charges for stuff like this in Japan and got pissed off at how light of a sentence they could get",
                "Well that's enough reddit for today. ",
                "\"Seven men arrested in Japan for raping daughters, sharing footage in chat group\nThe seven were in the same chat group for incest and paedophilia.\nThe seven were in the same chat group for incest and paedophilia.PHOTO: LIANHE ZAOBAO\nUPDATED Mar 11, 2025, 08:21 PM\n\n\nPolice from Aichi Prefecture in Japan have arrested seven men as of March 11 on suspicion of raping their daughters or stepdaughters and sharing footage of the abuse on social media, reported the Mainichi Shimbun.\n\n\nThe men are in their 30s to 50s.\n\n\nThey are accused of penetrative sexual assault, and violations of anti-child prostitution and anti-child pornography laws, reported the Japanese newspaper.\n\n\n\n\nFour of the men allegedly violated their biological or foster daughters and sent videos of the abuse in a social media group.\n\n\nThe victims were between six and 14 years old at the time.\n\n\nThe other three men allegedly owned obscene images of minors.\n\n\n\n\nThe seven were in the same chat group for incest and paedophilia, and the Aichi police believe they sexually abused their daughters and other children regularly.\n\n\nThey were discovered after one of the men was arrested in November 2024 for suspected penetrative sexual assault of a minor, and a probe of his mobile phone revealed the group were sharing explicit videos.\n\n\nThe group is thought to have started exchanging information around December 2023, reported Mainichi Shimbun.\"",
                "How do all these sick fucks manage to find and enable each other? Death feels like too easy of a punishment for these degenerates.",
                "this is making me so distraught. like holy fuck i am heartbroken and angered for the victims. they’re just children, and their “fathers”, that are supposed to support and protect them, took so much away from them for the “fathers’” own benefits.",
                "I lived in Japan over a decade and I tell people it's awesome, unless you're a girl / woman / female. Then I get down voted. \n\nI'm a guy who heard from every female friend that they've been groped on trains, including foreign friends who have barely been living there. \n\nKind of like TV shows have that cliche episode every year, having a coworker come into work crying from being groped became normal with every new coworker. \n\n\nThis is evil as fuck, and it's just a bit of the iceburg tip surfacing. "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Fear of flying is pushing ticket sales down in the wake of multiple crashes, airlines say",
            "external_url": "https://www.cnn.com/2025/03/11/business/passengers-air-travel-crashes-fear/index.html",
            "upvotes": 2762,
            "date": "03/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2199796404.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Let's offset this by charging for luggage.\n\n \\- Southwest Airlines",
                "Misleading headlines it's not so much \"fear of flying\" as it is \"safety concerns after whistleblowers and deregulation and several accidents\"",
                " Without proper oversight, it is not the Fear of flying but the fear of crashing. Why would people travel with all the fear and uncertainty in the Russian Vassal State of the USA.",
                "With the government cutting a large amount of the people who service the air traffic equipment and knowing the fact that they were already pretty thin in that area, I'm probably not going to fly for a long while myself.",
                "Elon Musk only flies on Air Force 1 lately.  Must be a sign.",
                "I think it's more people not traveling because of economic reasons...",
                "I just took 6 flights last week ngl the takeoff and landings had me a bit more nervous than usual.",
                "It seems completely rational with the dangerous cuts to the FAA.",
                "make trains great again :) i seriously wish USA would build a massive highspeed rail system",
                "fear of flying, cost of flying, getting disease while flying (measles in Washington Dulles airport now)\n\nI can either drive 15 hrs to a destination or fly (2.5hrs, ~900$)... hmmmmm..... Yes I know that statistically flying is safer.  But, I know I won't get a contagious disease alone in my car too, and I can sanitize my hands after the gaspump."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Texas measles cases grow to 223, mostly among children and teens",
            "external_url": "https://abcnews.go.com/Health/texas-measles-cases-latest/story?id=119663844",
            "upvotes": 1968,
            "date": "03/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/aebbd8d7-5e11-4f76-ba61-175fae71c515/measles-lubbock-01-gty-jef-250311_1741706139050_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Can you imagine how PISSED these kids are going to be at their parents when they grow old enough to recognize that a terrible childhood illness was completely avoidable?",
                "Goddamn I hate the anti vaccine cult.",
                "Im sorry to the children caught in this stupidity. \n\nYou deserve better",
                "Child abuse in the land of \"pro life\"...",
                "Because the adults are all vaccinated as they grew up in the U.S. when we still generally agreed it was a good idea. Because it is.",
                "Thankfully this is what convinced my wife's ex to finally give permission to vaccinate their kids (since in our state both parties have to sign off on it). \n\nMy heart goes out the kids who suffer and face a lifetime of potential health issues from this disease - but fuck the parents, fuck RFK Jr, fuck that \"Autism is caused by vaccines\" British asshole (who was running a grift to get people to pay for **his** vaccines), and anyone else who puts their high school graduation \"research\" against a proven history of vaccines saving millions of lives.",
                "This is because they aren't vaccinated. Poor children have to face this for no good",
                "Oh well.  At least eggs are chea... Or my retirement is grea... I mean we are in good standing world wid... \n\nAt least they will die for freedom.",
                "Red state oWniNg tHe LiBs!!. Ok well, have fun with your new little hobby I guess.",
                "That's way more than the number of trans athletes supposedly playing the \"wrong\" sport."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Southwest Airlines shifts to paid baggage policy to lift earnings",
            "external_url": "https://www.reuters.com/business/aerospace-defense/southwest-airlines-shifts-paid-baggage-policy-lift-earnings-2025-03-11/",
            "upvotes": 2800,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "To lift earnings we are eliminating the competitive advantage that brings people to our airline.",
                "As someone who has flown Southwest many times, I’ll repeat a comment I made in an earlier thread: Herb Kelleher is twirling in his grave with how this investment group is destroying his airline. Fuck these people.",
                "Southwest Fares for me were usually around the same price or slightly more expensive than Delta/United/American etc.. but when you added in a free checked bag for a round trip flight they often ended up cheaper. \n\nIf they go to a $35+ baggage fee I will have zero reason to fly on Southwest ever again unless their flight prices come down (which I doubt).",
                "> The policy shift suggests a growing influence of activist investor Elliott Investment Management at the airline. The hedge fund, whose nominees hold five of 15 board seats, had criticized Southwest's leadership for not charging a fee for checking bags like other airlines to boost its revenue.\n\nMotherfucking hedge funds, leeching off of society while generating nothing of real value for us.",
                "In the email they sent announcing this, they rolled out multiple anti-passenger changes at the same time:\n\n* Paid checked bags\n* Flight credit expiration\n* Lower earn ratio on rapid reward points\n* No more free changes on Basic (though oddly you can still cancel and get a flight credit, so the key difference here is inconvenience)\n\nI'm going to bet the checked bags portion of this was the preplanned \"we heard you\" piece that can be easily carved out while they keep all the rest of the changes. Then they'll reintroduce the checked bag change later and there won't be nearly as much furor as the outrage was already spent once on this issue.\n\nMy company flies exclusively Southwest. I've taken hundreds of legs with them. I suspect that will change now.",
                "SW will file bankruptcy and/or be acquired within the next 10 years.",
                "“Last year, it said while charging for bags could bring in $1.5 billion in additional revenue every year, it would cost the airline $1.8 billion in lost market share.” lmao they already did the homework and determined this will hurt them more than help them, and yet they’re doing it anyway. The enshittification is inevitable.",
                "As an employee this makes me incredibly sad",
                "Time to cancel that Southwest Rapid Rewards VISA",
                "The whole reason I flew SW was because of that free bag policy. Made going to and from conventions easier, even if it meant having to do layovers.\n\nNow if costs are going to be about the same, no point in going SW if it means I can just do direct flights from the competition."
            ],
            "aggregate_sentiment": 15.0
        },
        {
            "category": "HOT",
            "title": "Alex Jones says Infowars reporter Jamie White was fatally shot near Texas home",
            "external_url": "https://www.the-independent.com/news/world/americas/crime/jamie-white-infowars-murder-alex-jones-b2712630.html",
            "upvotes": 13456,
            "date": "03/11/2025",
            "thumbnail": "https://static.the-independent.com/2025/03/11/02/jamie-white.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                ">Nevertheless, he said: \"I lay all of this squarely at the feet of these DAs and of the Soros crime syndicate, and of the Democratic Party.”\n\nSo much for the \"wait for all the facts to come out\" side. They won't even wait for the body to get cold to sacrifice the memory of one of their own to the altar of owning the libs.",
                "by the way: Is Alex Jones still pretending to be broke in order to escape the just punishment for mocking the victims with his lies?",
                "[removed]",
                "[removed]",
                "Jamie Whites murder was a hoax by the deep state. He, his family and the other people involved are just crisis actors. Let's make a buncha podcasts making millions off arguing this and just insist Alex Jones is crazy.\n\nGive him a taste of his own.",
                "[removed]",
                "I am fortunate enough to never have heard of this person.",
                "[removed]",
                "Jamie White is a crisis actor, he's not really dead.",
                "the very first line under the title\n\n\"Police have not yet confirmed the identity of the victim fatally shot late Sunday night\""
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "4 arrested after 5-year-old Michigan boy's death in hyperbaric chamber explosion",
            "external_url": "https://www.cbsnews.com/detroit/news/four-arrested-fatal-hyperbaric-chamber-explosion/",
            "upvotes": 1773,
            "date": "03/11/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/02/04/a3654649-09db-4b06-808c-f6c979b5bfbc/thumbnail/1200x630/e7ef2d7753aa4807d13cd4e4f1480f1c/thomas-cooper.png?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "Charges are second-degree murder and involuntary manslaughter according to this article:\n\nhttps://www.nbcnews.com/news/crime-courts/4-charged-death-michigan-boy-killed-hyperbaric-chamber-fire-rcna195753",
                "Why was the kid in a hyperbaric chamber??",
                "Four people have been arrested after a 5-year-old boy was killed in a hyperbaric chamber explosion in Troy, Michigan.\n\nThe Troy Police Department confirmed that the arrests occurred Monday morning. They are scheduled to be arraigned on Tuesday.\n\nPolice did not release the names of the people arrested; however, court records show that one of them was Tami Peterson, the center's owner. \n\nCBS News Detroit reached out to the Oxford Center for comment and received the following statement: \n\n    \"After cooperating with multiple investigations starting immediately after the tragic accident in January, we are disappointed to see charges filed.\n\n    \"The timing of these charges is surprising, as the typical protocol after a fire-related accident has not yet been completed. There are still outstanding questions about how this occurred. Yet, the Attorney General's office proceeded to pursue charges without those answers.\n\n    \"Our highest priority every day is the safety and wellbeing of the children and families we serve, which continues during this process.\"\n\nInvestigators say Thomas Cooper was in the chamber when it exploded on Jan. 31, 2025. The boy's mother was in the room at the time and was injured in the explosion. In a news conference shortly after the incident, Troy police and fire departments did not indicate what may have led to the explosion but said that hyperbaric chambers are filled with 100% oxygen and are, therefore, combustible devices.\n\nWithin days of the tragedy, the family retained Fieger Law, which alleges that the center had a history of being involved in questionable business practices.\n\nAttorney James Harrington told CBS News Detroit last month that his office was getting ready to file a lawsuit demanding answers into what led to his death. Harrington said the lawsuit will be filed pending their investigation.\n\n\"Under no circumstances ... should anything ever like this happen and the only way this happens is negligence,\" Harrington said. \"This industry in Michigan is unregulated. There's not a lot of science to back these claims that are being made as to what ailments and problems can actually be fixed or better by this hyperbaric treatment.\"",
                "Ethics aside, these chambers are usually very safe to use for their intended purpose (oxygen delivery is part of it) so I wonder what made this one fail.",
                "Maybe more confused after reading the article than I was by the headline.\n\nDefendants are disappointed charges were filed this quickly because normal fire accident protocol hadn't run its course?\n\nNo insight as to why the kid was in a hyperbaric chamber in what was described as an unregulated industry?\n\nSeems like a very bizarre situation that resulted in the unnecessary death of a child.",
                "This was the core plot in the novel Miracle Creek by Angie Kim.",
                "They were trying to \"cure\" his ND disorders (ADHD and I think something else). \n\n\nIt's rich that their attorney is saying there's no science behind this and it should be better regulated.\n\n\nNo. It should be banned outright. And also, I don't think the parents are blameless. Take your kid to a fucking doctor. I know these places are predatory but take your kid to a fucking doctor. \n\n\nMy kid has ADHD and is the same age as this kid, and we live not too far from there. Breaks my heart. ",
                "As a hyperbaric technician, this could've been prevented easily by doing simple maintenance from the chambers manufacturer but also the proper safety checklist before starting the treatment. Gross negligence for sure, last time something like this happened in the states was 2009 with gross negligence and lack of chamber certification...such a shame, poor kid never had a chance.",
                "I'm a little confused by this;  The CEO of the center is being charged with second degree murder but the technician that operated the chamber is only being charged with manslaughter.  I'm confused why the guy that was most likely ACTUALLY responsible for the death is being given lighter charges than the person who owns the company.",
                "another headline I never expected"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "US added to international watchlist for rapid decline in civic freedoms | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/09/watchlist-decline-civic-freedoms-civicus",
            "upvotes": 59216,
            "date": "03/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f838401ad096f61dcc28e6dfd2f04d0dad5d8448/0_192_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=66c6b81aa93b4e5c81e2755827179a60",
            "top_comments": [
                "Ah yes, soon to be in a \"do not travel advisory\". Especially after what happened to that German tourist.",
                "Does this mean Americans can now seek asylum in other countries to escape persecution?",
                "I would have never imagined to see this shit show in the US. Insane!",
                "And we're only 2 months in.",
                "Just do us the kind favor and arrest the rich as they travel abroad for human rights abuses, and likely significant other crimes. Blanket freeze on assets too.",
                "\\* Minority groups suppressed\n\n\\* Free press not allowed at WH\n\n\\* Uni students threatened if they dare protest, general intimidation tactics\n\n\\* Reckless gov dismissals and appointing loyalist to the president rather than the constitution\n\n\\* Medicaid and social security under threat\n\n\\* Withdrew from UN Human Rights Council",
                "I knew it was the right choice to not give up Mexican citizenship. Plus being Mexican is awesome.",
                "Are we winning yet Mr Krabs?",
                "Good. It's the least this administration deserves.",
                "And who is coming to save us? Hmm? All of the allies we don’t have anymore?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Moscow airports suspend flights after ‘massive’ Ukrainian drone attack",
            "external_url": "https://www.theguardian.com/world/2025/mar/11/moscow-airports-suspend-flights-after-massive-ukrainian-drone-attack",
            "upvotes": 3225,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1ecdcfb1374f87704afac6b6e5567b26715df9de/0_175_2000_1200/master/2000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=693fad69bc0bf93d7d0feb0082b77a57",
            "top_comments": [
                "If i remember one of hold outs preventing Ukraine from doing this before was the US as part of arms deal. Might be wrong",
                "Wonderful news! Keep up the fight and defeat putin and his asset, the traitorous felon krasnov.",
                "This is not a good week for Elon and friends.",
                "Well, it's what anyone would do!",
                "Russia still has planes?",
                "As far as I'm concerned, Russia was attacking the apartments and hospitals first. Why would that be a surprise?",
                "Good, some of their own medicine.",
                "I say target Moscow, return the favor back to putin and his ilk. ",
                "I love a positive news story like this. \n\nKeep it up.",
                "How long till you think Trump sells out Ukraine to Russia with all of the gathered intelligence we have on their operations?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "US to immediately restore intelligence sharing and 'security assistance' to Ukraine",
            "external_url": "https://www.bbc.com/news/live/c51ypekv9xwt",
            "upvotes": 333,
            "date": "03/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b855/live/b50bcb50-fea6-11ef-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "Now that intelligence from Ukraine goes straight to Russia during trump’s daily kneel and swallow Putin meetings.",
                "I don't believe it and any \"assistance\" will likely help Russia.",
                "I would not be trusting any US intel if I was Ukraine ",
                "Huh????\n\nSo then what was the point????",
                "Forgot to add asterisk*, *with terms and conditions applied.*",
                "So he basically got hundreds of Ukrainians killed for nothing",
                "Oh, is he thankful enough now? Was his shirt nicer? Did X have hiccups for reasons other than Ukraine?\n\nWe’ll see in 3 days when the administration throws them under the bus again.",
                "The damage is done to our alliances. They are not going to start sending us information again.",
                "So the deal with the Russians was that Trump would pause intelligence sharing to give them an advantage in Kursk? Well done, Trump!",
                "Donny got his bribe then?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Ukraine expresses support for a 30 day ceasefire with Russia",
            "external_url": "https://www.president.gov.ua/en/news/spilna-zayava-za-pidsumkami-zustrichi-delegacij-ukrayini-ta-96553",
            "upvotes": 1,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Texas bill would make identifying as transgender a felony punishable by jail",
            "external_url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/texas-bill-identify-transgender-state-felony-rcna195642",
            "upvotes": 3,
            "date": "03/11/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-09/230901-texas-state-capitol-mn-1450-c8edd9.jpg",
            "top_comments": [
                "### There's more - \n\nThe bill, which was filed last week by Republican state Rep. Tom Oliverson, would make it a state jail felony if a person “knowingly makes a false or misleading verbal or written statement” by identifying their sex assigned at birth incorrectly to a governmental entity or to their employer. State jail felonies in Texas are punishable by up to two years in jail and a fine of up to $10,000."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "US should restart shuttered coal units, Interior Secretary tells Bloomberg",
            "external_url": "https://www.reuters.com/business/energy/us-should-restart-shuttered-coal-units-interior-secretary-tells-bloomberg-2025-03-10/",
            "upvotes": 4,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Of course. Why not restart outdated tech that is more expensive, causes more pollution, and requires us to import the necessary resource from Canada, a country we just started a trade war with.\n\nThats a master plan.",
                "Heard him talking on CNBC, going on about how we can still enjoy “95%” of our federally protected land. \n\nWhat a piece of shit.",
                "at least change them over to gasification plants. i might be a bit biased though being in industrial gas.\n\n[Coal gasification - Wikipedia](https://en.wikipedia.org/wiki/Coal_gasification)\n\n  \n[Integrated gasification combined cycle - Wikipedia](https://en.wikipedia.org/wiki/Integrated_gasification_combined_cycle)"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Poland arrests Ukrainian woman convicted of selling 56 human kidneys",
            "external_url": "https://www.reuters.com/world/europe/poland-arrests-ukrainian-woman-convicted-selling-56-human-kidneys-2025-03-11/",
            "upvotes": 4,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "She was already on Interpol's list since 2020",
                "No justice in this world, just an honest woman trying to get by",
                "thats at least 28 crimes.",
                "*The woman was convicted for participation in an international organised criminal group that illegally collected tissues and organs from people from 2017 to 2019 and sold them on the black market, Petkowska added.*\n\nOne further reminder of de-humainzation. More and more we are bits and pieces and not revered whole beings with body and perhaps soul. What's worse is that there's a set price on each part of us."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Ukraine agrees to accept US 30-day ceasefire proposal",
            "external_url": "https://www.reuters.com/world/europe/moscow-drone-attack-latest-russian-capital-targeted-by-ukraine-2025-03-11/",
            "upvotes": 14,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ukraine will do whatever is best for them, but any ultimate peace treaty that doesn't include security guarantees for Ukraine is just a pause button to give Russia a few years to rebuild their military before launching a third invasion.",
                "Russian Ceasefire, take 25: and, action.",
                "Russia either won't accept, or will break it. And Trump is in for a reality check. Betting 1 Tesla stock"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "US to restart intelligence-sharing with Ukraine immediately after 'positive' day of peace talks",
            "external_url": "https://news.sky.com/story/us-to-restart-intelligence-sharing-with-ukraine-immediately-after-positive-day-of-peace-talks-12541713",
            "upvotes": 31,
            "date": "03/11/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-marco-rubio-jeddah_6852973.jpg?20250311105129",
            "top_comments": [
                "It's crazy just how quickly this administration has destroyed our credibility throughout the world. Like, it's mind boggling. The GOP has taught the entire world that we can't be reliable. So if/when they're out of power, other countries won't respect us because we're too fickle. \n\nIs he a Russian asset? I don't know. But he's sure as hell helping them.",
                "Are these four years just going to be a yo-yo with every policy? If you're going be a shitty leader, at least commit to something.",
                "Funny this happened just after a mineral-deal was reached in Saudi Arabia. A country at war, fighting for its very survival with a fascist aggressor, is getting strong-armed into reaching a \"deal\" by the supposedly freedom loving US of A!\n\nI will never trust the US ever again!",
                "I wonder how this is connected to the massive drone strike on Russia this morning."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "US to immediately restore intelligence sharing and 'security assistance' to Ukraine",
            "external_url": "https://www.bbc.com/news/live/c51ypekv9xwt",
            "upvotes": 341,
            "date": "03/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b855/live/b50bcb50-fea6-11ef-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "Now that intelligence from Ukraine goes straight to Russia during trump’s daily kneel and swallow Putin meetings.",
                "I don't believe it and any \"assistance\" will likely help Russia.",
                "I would not be trusting any US intel if I was Ukraine ",
                "Huh????\n\nSo then what was the point????",
                "Forgot to add asterisk*, *with terms and conditions applied.*",
                "So he basically got hundreds of Ukrainians killed for nothing",
                "Oh, is he thankful enough now? Was his shirt nicer? Did X have hiccups for reasons other than Ukraine?\n\nWe’ll see in 3 days when the administration throws them under the bus again.",
                "The damage is done to our alliances. They are not going to start sending us information again.",
                "So the deal with the Russians was that Trump would pause intelligence sharing to give them an advantage in Kursk? Well done, Trump!",
                "Donny got his bribe then?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Police: Before arrest in child porn case, Yucaipa man drilled hard drive — and his fingers, too",
            "external_url": "https://www.sbsun.com/2025/03/08/police-before-arrest-in-child-porn-case-yucaipa-man-drilled-hard-drive-and-his-fingers-too/",
            "upvotes": 16,
            "date": "03/11/2025",
            "thumbnail": "https://www.sbsun.com/wp-content/uploads/2025/01/generic-arrest-crime-scene-08.jpg?w=1024&h=681",
            "top_comments": [
                "It's always good practice to collect semen samples from strangers to smear on your laptop and around your house. It may sound weird, and it may make you uncomfortable during the collection process - but it is imperitive to avoid needing to remove your fingerprints with a power drill."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Texas embalmer charged with mutilating corpse of registered sex offender",
            "external_url": "https://www.nbcnews.com/news/us-news/texas-embalmer-charged-mutilating-corpse-registered-sex-offender-rcna195816",
            "upvotes": 69,
            "date": "03/11/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250311-memorial-mortuary-houston-mn-1145-5a46c2.jpg",
            "top_comments": [
                "It’s psychotic to mutilate a corpse simple. The sex offender’s dignity has nothing to do with it. Some of these comments are insane.",
                "If he didn’t want his body mutilated maybe he shouldn’t have sexually assaulted someone \n¯\\_(ツ)_/¯",
                "I worry that after trans and gay people that the MAGA and evangelicals will go after this group next. A ready made group of people to hate. - and while they deserve their punishment it’s not for random people to heap on them “cause you know they’re an offender.”\n\nEdit: Reddit cares? Ok, MAGA.",
                "That's my favorite Cattle Decapitation song.",
                "Oof this is hard, i believe sex offenders especially when targeting a young child/involving violent sex crimes that person shouldve been taken out back and shot, on the other hand the mfer was dead already defiling a corpse is wrong but that of a sex offender is hard to defend, either way the whole thing is fucked up. One less pos to hurt children.",
                "He was asking for it, did you see how he was dressed during the embalming?",
                ">Charging documents identify two employees of Memorial Mortuary & Crematory at the scene who witnessed the crime. The first witness allegedly saw Laudermilk stab Rodriguez twice in the groin in the cremation room before cutting off his penis and placing it in his mouth.\n\nI'm not seeing the problem here.",
                ">The first witness allegedly saw Laudermilk stab Rodriguez twice in the groin in the cremation room before cutting off his penis and placing it in his mouth.\n\nSo the witness saw Laudermilk stab Rodriquez...then cut off his own penis and placed it in his mouth.  \n\nStop letting AI be your fucking writer/editor.",
                "should have been more circumspect.",
                "The feel good news we all needed."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "NEW",
            "title": "U.S. Department of Education’s Office for Civil Rights Sends Letters to 60 Universities Under Investigation for Antisemitic Discrimination and Harassment",
            "external_url": "https://www.cnn.com/2025/03/10/us/department-of-education-warning-universities-title-vi-antisemitism/index.html",
            "upvotes": 185,
            "date": "03/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap24341776031813.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "There is some irony that this is being done via the DEpartment of Education, which they want to shut down, and under the auspices of Title VI of the Civil Rights Act, which they want to get rid of.",
                "\"wtf we hate antisemitism now!\" -dude who handed the country over to someone who gave a sieg heil on national television",
                "Full list of colleges:\n\nAmerican University \nArizona State University \nBoston University \nBrown University \nCalifornia State University, Sacramento \nChapman University \nColumbia University \nCornell University \nDrexel University \nEastern Washington University \nEmerson College \nGeorge Mason University \nHarvard University \nIllinois Wesleyan University \nIndiana University, Bloomington \nJohns Hopkins University \nLafayette College \nLehigh University \nMiddlebury College \nMuhlenberg College \nNorthwestern University \nOhio State University \nPacific Lutheran University     \nPomona College \nPortland State University \nPrinceton University \nRutgers University \nRutgers University-Newark\nSanta Monica College \nSarah Lawrence College \nStanford University \nState University of New York Binghamton \nState University of New York Rockland \nState University of New York, Purchase \nSwarthmore College \nTemple University \nThe New School \nTufts University \nTulane University \nUnion College \nUniversity of California Davis \nUniversity of California San Diego \nUniversity of California Santa Barbara \nUniversity of California, Berkeley\nUniversity of Cincinnati \nUniversity of Hawaii at Manoa \nUniversity of Massachusetts Amherst \nUniversity of Michigan \nUniversity of Minnesota, Twin Cities \nUniversity of North Carolina \nUniversity of South Florida \nUniversity of Southern California \nUniversity of Tampa \nUniversity of Tennessee \nUniversity of Virginia \nUniversity of Washington-Seattle \nUniversity of Wisconsin, Madison \nWellesley College \nWhitman College \nYale University",
                "I remember complaints from the felon about how dems weaponize the govt. Now we have the DOE weapon in place intent on threatening education.",
                "Oh, good! They’re gonna go after Nazis too, right?\n\nRight?",
                "Cue demonstratons that are used to invoke martial law! Yay tyranny!! /s",
                "Super credible that Nazis are making accusations about antisemitism. \n\nConservatives think us Jews are their tools to exploit to push their degenerate fascist agenda.",
                "if biden had done this, the right wingers would have started shooting",
                "Protesting the actions of the Israeli government is not anti-semitic.",
                "Being against Palestinian genocide is not being 'antisemitic'"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "US to immediately restore intelligence sharing and 'security assistance' to Ukraine",
            "external_url": "https://www.bbc.com/news/live/c51ypekv9xwt",
            "upvotes": 341,
            "date": "03/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b855/live/b50bcb50-fea6-11ef-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "Now that intelligence from Ukraine goes straight to Russia during trump’s daily kneel and swallow Putin meetings.",
                "I don't believe it and any \"assistance\" will likely help Russia.",
                "I would not be trusting any US intel if I was Ukraine ",
                "Huh????\n\nSo then what was the point????",
                "Forgot to add asterisk*, *with terms and conditions applied.*",
                "So he basically got hundreds of Ukrainians killed for nothing",
                "Oh, is he thankful enough now? Was his shirt nicer? Did X have hiccups for reasons other than Ukraine?\n\nWe’ll see in 3 days when the administration throws them under the bus again.",
                "The damage is done to our alliances. They are not going to start sending us information again.",
                "So the deal with the Russians was that Trump would pause intelligence sharing to give them an advantage in Kursk? Well done, Trump!",
                "Donny got his bribe then?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Fear of flying is pushing ticket sales down in the wake of multiple crashes, airlines say",
            "external_url": "https://www.cnn.com/2025/03/11/business/passengers-air-travel-crashes-fear/index.html",
            "upvotes": 2764,
            "date": "03/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2199796404.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Let's offset this by charging for luggage.\n\n \\- Southwest Airlines",
                "Misleading headlines it's not so much \"fear of flying\" as it is \"safety concerns after whistleblowers and deregulation and several accidents\"",
                " Without proper oversight, it is not the Fear of flying but the fear of crashing. Why would people travel with all the fear and uncertainty in the Russian Vassal State of the USA.",
                "With the government cutting a large amount of the people who service the air traffic equipment and knowing the fact that they were already pretty thin in that area, I'm probably not going to fly for a long while myself.",
                "Elon Musk only flies on Air Force 1 lately.  Must be a sign.",
                "I think it's more people not traveling because of economic reasons...",
                "I just took 6 flights last week ngl the takeoff and landings had me a bit more nervous than usual.",
                "It seems completely rational with the dangerous cuts to the FAA.",
                "make trains great again :) i seriously wish USA would build a massive highspeed rail system",
                "fear of flying, cost of flying, getting disease while flying (measles in Washington Dulles airport now)\n\nI can either drive 15 hrs to a destination or fly (2.5hrs, ~900$)... hmmmmm..... Yes I know that statistically flying is safer.  But, I know I won't get a contagious disease alone in my car too, and I can sanitize my hands after the gaspump."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Texas measles cases grow to 223, mostly among children and teens",
            "external_url": "https://abcnews.go.com/Health/texas-measles-cases-latest/story?id=119663844",
            "upvotes": 1972,
            "date": "03/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/aebbd8d7-5e11-4f76-ba61-175fae71c515/measles-lubbock-01-gty-jef-250311_1741706139050_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Can you imagine how PISSED these kids are going to be at their parents when they grow old enough to recognize that a terrible childhood illness was completely avoidable?",
                "Goddamn I hate the anti vaccine cult.",
                "Im sorry to the children caught in this stupidity. \n\nYou deserve better",
                "Child abuse in the land of \"pro life\"...",
                "Because the adults are all vaccinated as they grew up in the U.S. when we still generally agreed it was a good idea. Because it is.",
                "Thankfully this is what convinced my wife's ex to finally give permission to vaccinate their kids (since in our state both parties have to sign off on it). \n\nMy heart goes out the kids who suffer and face a lifetime of potential health issues from this disease - but fuck the parents, fuck RFK Jr, fuck that \"Autism is caused by vaccines\" British asshole (who was running a grift to get people to pay for **his** vaccines), and anyone else who puts their high school graduation \"research\" against a proven history of vaccines saving millions of lives.",
                "This is because they aren't vaccinated. Poor children have to face this for no good",
                "Oh well.  At least eggs are chea... Or my retirement is grea... I mean we are in good standing world wid... \n\nAt least they will die for freedom.",
                "Red state oWniNg tHe LiBs!!. Ok well, have fun with your new little hobby I guess.",
                "That's way more than the number of trans athletes supposedly playing the \"wrong\" sport."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Girl Scouts sued over alleged heavy metals, pesticides in cookies",
            "external_url": "https://www.reuters.com/legal/girl-scouts-sued-over-alleged-heavy-metals-pesticides-cookies-2025-03-11/",
            "upvotes": 364,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Since girl scouts are making the claim that these are normal things to find or at normal levels, id be curious to see how the other big cookie brands compare when tested \n\nAlso they mention other lawsuits of a similar nature in the past but don’t mention the outcome of those lawsuits in this article. Which seems relevant",
                "I guess the Thin Mints can be renamed Heavy Mints. Or maybe Quicksilver Mints? 🤔 ",
                "“It said heavy metals occur naturally in soil, with trace amounts not a safety issue, while glyphosate is found “nearly everywhere” in the food chain. Girl Scouts also said its bakers are committed to complying with all food safety standards.”\n\nWhich is true …  don’t want heavy metals in the food supply , maybe it’s time to do something about pollution.. As for glyphosate, maybe sue Bayer ,since they are the manufacturer..   \n\nsomebody must have not gotten the cookies they ordered",
                "It’s worth anything they want to put in it for the peanut butter ones",
                "Full study results are on the [GMOScience page](https://gmoscience.org/2024/12/27/danger-in-the-dough/). They highlight the worst offenders for each heavy metal.",
                "Should I be scared about the empty package in my trash from last night? Or about the 2 unopened packages on my counter?",
                "I've long suspected Girl Scout cookies were a one-way ticket to midnight.",
                "I just bought a box, I'll be alright, I just won't buy anymore",
                "Looking at the boxes in front of me.....well shit.",
                "Don’t matter, thin mints for life"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "U.S. Department of Education’s Office for Civil Rights Sends Letters to 60 Universities Under Investigation for Antisemitic Discrimination and Harassment",
            "external_url": "https://www.cnn.com/2025/03/10/us/department-of-education-warning-universities-title-vi-antisemitism/index.html",
            "upvotes": 184,
            "date": "03/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap24341776031813.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "There is some irony that this is being done via the DEpartment of Education, which they want to shut down, and under the auspices of Title VI of the Civil Rights Act, which they want to get rid of.",
                "\"wtf we hate antisemitism now!\" -dude who handed the country over to someone who gave a sieg heil on national television",
                "Full list of colleges:\n\nAmerican University \nArizona State University \nBoston University \nBrown University \nCalifornia State University, Sacramento \nChapman University \nColumbia University \nCornell University \nDrexel University \nEastern Washington University \nEmerson College \nGeorge Mason University \nHarvard University \nIllinois Wesleyan University \nIndiana University, Bloomington \nJohns Hopkins University \nLafayette College \nLehigh University \nMiddlebury College \nMuhlenberg College \nNorthwestern University \nOhio State University \nPacific Lutheran University     \nPomona College \nPortland State University \nPrinceton University \nRutgers University \nRutgers University-Newark\nSanta Monica College \nSarah Lawrence College \nStanford University \nState University of New York Binghamton \nState University of New York Rockland \nState University of New York, Purchase \nSwarthmore College \nTemple University \nThe New School \nTufts University \nTulane University \nUnion College \nUniversity of California Davis \nUniversity of California San Diego \nUniversity of California Santa Barbara \nUniversity of California, Berkeley\nUniversity of Cincinnati \nUniversity of Hawaii at Manoa \nUniversity of Massachusetts Amherst \nUniversity of Michigan \nUniversity of Minnesota, Twin Cities \nUniversity of North Carolina \nUniversity of South Florida \nUniversity of Southern California \nUniversity of Tampa \nUniversity of Tennessee \nUniversity of Virginia \nUniversity of Washington-Seattle \nUniversity of Wisconsin, Madison \nWellesley College \nWhitman College \nYale University",
                "I remember complaints from the felon about how dems weaponize the govt. Now we have the DOE weapon in place intent on threatening education.",
                "Oh, good! They’re gonna go after Nazis too, right?\n\nRight?",
                "Cue demonstratons that are used to invoke martial law! Yay tyranny!! /s",
                "Super credible that Nazis are making accusations about antisemitism. \n\nConservatives think us Jews are their tools to exploit to push their degenerate fascist agenda.",
                "if biden had done this, the right wingers would have started shooting",
                "Protesting the actions of the Israeli government is not anti-semitic.",
                "Being against Palestinian genocide is not being 'antisemitic'"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Jury awards $120 million to two men wrongfully convicted of 2003 murder",
            "external_url": "https://www.cbsnews.com/chicago/news/wrongful-conviction-verdict-jury-120-million-john-fulton-anthony-mitchell/",
            "upvotes": 223,
            "date": "03/11/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/11/73a21bee-9577-4457-8634-883a83f21fbd/thumbnail/1200x630/bc133372ad8a38311f08b0446e79eacb/screenshot-2025-03-11-095924.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "thats paid for with tax dollars. when civilians get sued, their own wages and/or property(s) are subject to  payment. why do civilians also have to pay for police fuck ups?",
                "Statement that supposedly pro law and order people love to make mockly: \"There are no guilty people in prison\".\n\n\nSo much of the Innocence Projects has shown that there are a lot of innocent people in prison. ",
                "They really need to start connecting these payments to the pension funds of both police and local prosecutions: Perhaps there'd be far less coercion and tampering with evidence if there actually existed some consequences for doing so.",
                "Tbh for that amount in 20 years, lock me up please ",
                "*John Fulton and Anthony Mitchell both spent more than 16 years in prison before their convictions were overturned in 2019, and prosecutors wound up dropping all charges against them in the murder of 18-year-old Christopher Collazo.*\n\nWhat happened in 2003 was not racist enough; now the city of Chicago is appealing the Federal Courts finding of 120m award for the mistaken convictions/imprisonment"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Seven men arrested in Japan for raping daughters, sharing footage in chat group.",
            "external_url": "https://www.straitstimes.com/asia/east-asia/seven-men-arrested-in-japan-for-raping-daughters-sharing-footage-in-chat-group",
            "upvotes": 4287,
            "date": "03/11/2025",
            "thumbnail": "https://cassette.sphdigital.com.sg/image/straitstimes/cbb298abcce5ca7335e17c5dc6540bd83acce49d9a88a567e58400a2045ea275",
            "top_comments": [
                "Investigative sources revealed that the seven men, aged in their 30s to 50s and living in Aichi Prefecture and elsewhere, stand accused of penetrative sexual assault as well as violations of anti-child prostitution and anti-child pornography laws. Four of the men allegedly filmed the scenes of them sexually assaulting their biological or foster daughters, aged between 6 and 14 at the time, and shared the footage within a social media group, while the other three owned obscene images of underage individuals.\n\nIn the messaging app used by the group, there were comments reading, \"I've trained her since she was 3,\" \"Just telling her, 'If you tell your mom, you wouldn't be able to be with your dad. Can you keep a secret?' worked for me,\" and, \"Because my wife is away on a trip.\" The prefectural police believe that the men continued to sexually abuse their own daughters and others on a regular basis.\n\nIn November last year, one of the men was arrested on suspicion of penetrative sexual assault of an underage person, and a probe of his mobile phone revealed that the group was sharing obscene videos.\n\nIt is thought that the group, comprised of men fond of incest with minors, started exchanging information in around December 2023. The seven suspects came to know each other through another online website, and one of them managed the chat group in question. The police suspect that several other men had joined the group, and are continuing to investigate the case.",
                "These guys raped their own daughters regularly, youngest girl was six years old.  \nFilmed it and then circulate/share within their own chat group with other men/fathers.   \nHow muthaf\\*\\*king sick can one be to come up with such stuff!",
                "I cannot even imagine the lifetime of trauma these girls will battle. They deserve the best care and support for the rest of their lives.  I'm not sure what kind of sentencing the Japanese legal system has, but I hope these men rot in prison. I hope every day until the end of their days is full of misery.",
                "adblocker blocks the whole entire website. like, nothing at all shows up and the block counter just goes and goes",
                "Just looked at the charges for stuff like this in Japan and got pissed off at how light of a sentence they could get",
                "Well that's enough reddit for today. ",
                "\"Seven men arrested in Japan for raping daughters, sharing footage in chat group\nThe seven were in the same chat group for incest and paedophilia.\nThe seven were in the same chat group for incest and paedophilia.PHOTO: LIANHE ZAOBAO\nUPDATED Mar 11, 2025, 08:21 PM\n\n\nPolice from Aichi Prefecture in Japan have arrested seven men as of March 11 on suspicion of raping their daughters or stepdaughters and sharing footage of the abuse on social media, reported the Mainichi Shimbun.\n\n\nThe men are in their 30s to 50s.\n\n\nThey are accused of penetrative sexual assault, and violations of anti-child prostitution and anti-child pornography laws, reported the Japanese newspaper.\n\n\n\n\nFour of the men allegedly violated their biological or foster daughters and sent videos of the abuse in a social media group.\n\n\nThe victims were between six and 14 years old at the time.\n\n\nThe other three men allegedly owned obscene images of minors.\n\n\n\n\nThe seven were in the same chat group for incest and paedophilia, and the Aichi police believe they sexually abused their daughters and other children regularly.\n\n\nThey were discovered after one of the men was arrested in November 2024 for suspected penetrative sexual assault of a minor, and a probe of his mobile phone revealed the group were sharing explicit videos.\n\n\nThe group is thought to have started exchanging information around December 2023, reported Mainichi Shimbun.\"",
                "How do all these sick fucks manage to find and enable each other? Death feels like too easy of a punishment for these degenerates.",
                "this is making me so distraught. like holy fuck i am heartbroken and angered for the victims. they’re just children, and their “fathers”, that are supposed to support and protect them, took so much away from them for the “fathers’” own benefits.",
                "I lived in Japan over a decade and I tell people it's awesome, unless you're a girl / woman / female. Then I get down voted. \n\nI'm a guy who heard from every female friend that they've been groped on trains, including foreign friends who have barely been living there. \n\nKind of like TV shows have that cliche episode every year, having a coworker come into work crying from being groped became normal with every new coworker. \n\n\nThis is evil as fuck, and it's just a bit of the iceburg tip surfacing. "
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Ex-president Rodrigo Duterte arrested over crimes against humanity",
            "external_url": "https://www.rappler.com/philippines/rodrigo-duterte-arrested-crimes-against-humanity-icc/",
            "upvotes": 778,
            "date": "03/11/2025",
            "thumbnail": "https://www.rappler.com/tachyon/2024/11/rodrigo-duterte-congress-quadcomm-ejk-war-on-drugs-reuters-november-13-2024-001-scaled.jpg",
            "top_comments": [
                "Remember when Trump said he loved his policies? These exact policies that are crimes against humanity?\n\nEdit:\n\n>  “I just wanted to congratulate you because I am hearing of the unbelievable job on the drug problem. Many countries have the problem, we have a problem, but what a great job you are doing and I just wanted to call and tell you that.” - Trump 2017",
                "Other countries are showing that they can bring corrupt leaders to justice. First Bolsonaro now Duterte... but we couldn't manage to throw the Mango Mussolini the book.",
                "The Philippines withdrew from the ICC when he was president, he thought that’ll save his ass from the extrajudicial killings, so he was confident and even dared ICC to start the investigation. But this is what he forgot. The Philippines is still a member of Interpol. Pres. Marcos said in his presscon, “Interpol asked for help, and we obliged because we have commitments to the Interpol which we have to fulfill. If we don’t do that they will no longer help us with other Filipino fugitives abroad.”  \n \nHopefully this evil man gets convicted so the thousands murdered will find justice and finally rest in peace.",
                "Guy who began his president campaign with a rape joke turned out to be a bad dude, funnily enough",
                "Good riddance. May he rot.",
                "Filipino here and I feel vindicated! I hope he is found guilty and rots in jail!",
                "Now do Trump, Putin, and Netanyahu please.",
                "There is always one important downside to being a corrupt leader. Unless the position is for life, they will always have to face those they targeted while in office.",
                "Do Trump next! Do Putin!",
                "I truly hope he dies in prison"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "ICE accessed car trackers in sanctuary cities that could help in raids, files show",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/11/ice-car-trackers-sanctuary-cities",
            "upvotes": 992,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d9dedc528334a4887911e448f31e312aa88ddced/0_221_4571_2743/master/4571.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=78eff3fbf2a5d68c5d2586cbdcaeff4b",
            "top_comments": [
                "Reminder that the government can and will track your car and use that information against you.",
                "> When announcing the contract to install 172 Flock cameras across Norfolk, the police chief Mark Talbot said his office wanted to create “a nice curtain of technology” that would make it “difficult to drive anywhere of any distance without running into a camera somewhere”. Lee Schmidt, one of the plaintiffs, said four of the cameras had fenced in his neighborhood.\n\n\"nice\" is the last word I would use to describe this.",
                "Regardless of how you feel about the immigration situation in this country, it's only a matter of time before they start using these same tactics to track down political dissidents.",
                "These ICE guys sound like a bunch of goombas.",
                "They’re installing trackers in my city of less than 5,000 people. Seems ridiculous.",
                "Anti flock maps are out there. Stay safe everyone.",
                "All this effort just to hurt people.",
                "So they (ICE under Drumph) arrested the kid at Columbia even tho he was here legally, they switched the app meant to help immigrants to now be an app that tracks them for ICE, and now they’re getting into cars to track them to help ICE, this is peak surveillance state, using Tech for questionable reasons won’t end well for anyone, these are the things privacy advocates have been warning us about for years",
                "I think statistics show members of the church are more detrimental to American children than raids on migrant workers. I understand ICE needs a paycheck but this is becoming egregiously wasteful of my taxes and decreasing my crop prices",
                "Maga= Diarrhea drinkers"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Trump has instructed to raise Canadian tariffs on aluminum and steel to 50%",
            "external_url": "https://www.theguardian.com/us-news/live/2025/mar/11/donald-trump-latest-us-politics-news-live?CMP=share_btn_url&page=with%3Ablock-67d042cb8f087aea3a248e0d#block-67d042cb8f087aea3a248e0d",
            "upvotes": 24176,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/0e5cfb3943da44eb9c83513768b077fa8f23acf9/0_635_9504_5701/master/9504.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=5e929e182f325ba9b1bed6721b04f1be",
            "top_comments": [
                "I like how he keeps bringing up the dairy one. Negotiated BY HIM, and it only kicks in at a level that has NEVER been met. Those tariffs have never been charged.",
                "Sounds like it gonna be another great day on the Stock Market!!!",
                "It's wild. We were so scared of the first set of tariffs, now I'm just like \"I'm tired boss\" and keep scrolling. Honestly his inability to take a measured approach to anything makes me think it'll sputter out quickly, he'll claim victory and forget tariffs are a thing by summer. Wishful thinking, I know.",
                "Apparently Trump wanted more chaos and uncertainty today. He and his administration have been trying to do at least one ill intentioned thing per day so far.",
                "\"Trump said he would “permanently shut down the automobile manufacturing business in Canada” if the country did not end unspecified tariffs it had placed on US goods:\"\n\nEverything in thr market could be appeased if this moron backs down. \n\nAnd yet, he continues to double down on tariffs. \n\nThis is madness",
                "“He would see the entire world burn just to be the king of ashes”",
                "Maybe instead of tariffs, we could properly tax billionaires 🤷🏻‍♂️",
                "Last time he did this, during Trump 1.0, aluminum plants in Kentucky closed, leading to higher unemployment. That county was devastated. Congratulations, Trump, and Trump voters!!!",
                "My MAGA buddy who owns a metal building construction business is about to find out",
                "If anybody is wondering why Trump would engage in such absurd \"negotiation\" tactics, it can be traced to his history and pathology.  Here's a professor whose specialty is negotiations discussing in-a-nutshell why Trump's tactics are incredibly foolish:\n\n----\n\n“I’m going to get a little wonky and write about Donald Trump and negotiations. For those who don't know, I'm an adjunct professor at Indiana University - Robert H. McKinney School of Law and I teach negotiations. Okay, here goes.\n\nTrump, as most of us know, is the credited author of \"The Art of the Deal,\" a book that was actually ghost written by a man named Tony Schwartz, who was given access to Trump and wrote based upon his observations. If you've read The Art of the Deal, or if you've followed Trump lately, you'll know, even if you didn't know the label, that he sees all dealmaking as what we call \"distributive bargaining.\"\n\nDistributive bargaining always has a winner and a loser. It happens when there is a fixed quantity of something and two sides are fighting over how it gets distributed. Think of it as a pie and you're fighting over who gets how many pieces. In Trump's world, the bargaining was for a building, or for construction work, or subcontractors. He perceives a successful bargain as one in which there is a winner and a loser, so if he pays less than the seller wants, he wins. The more he saves the more he wins.\n\nThe other type of bargaining is called integrative bargaining. In integrative bargaining the two sides don't have a complete conflict of interest, and it is possible to reach mutually beneficial agreements. Think of it, not a single pie to be divided by two hungry people, but as a baker and a caterer negotiating over how many pies will be baked at what prices, and the nature of their ongoing relationship after this one gig is over.\n\nThe problem with Trump is that he sees only distributive bargaining in an international world that requires integrative bargaining. He can raise tariffs, but so can other countries. He can't demand they not respond. There is no defined end to the negotiation and there is no simple winner and loser. There are always more pies to be baked. Further, negotiations aren't binary. China's choices aren't (a) buy soybeans from US farmers, or (b) don't buy soybeans. They can also (c) buy soybeans from Russia, or Argentina, or Brazil, or Canada, etc. That completely strips the distributive bargainer of his power to win or lose, to control the negotiation.\n\nOne of the risks of distributive bargaining is bad will. In a one-time distributive bargain, e.g. negotiating with the cabinet maker in your casino about whether you're going to pay his whole bill or demand a discount, you don't have to worry about your ongoing credibility or the next deal. If you do that to the cabinet maker, you can bet he won't agree to do the cabinets in your next casino, and you're going to have to find another cabinet maker.\n\nThere isn't another Canada.\n\nSo when you approach international negotiation, in a world as complex as ours, with integrated economies and multiple buyers and sellers, you simply must approach them through integrative bargaining. If you attempt distributive bargaining, success is impossible. And we see that already.\n\nTrump has raised tariffs on China. China responded, in addition to raising tariffs on US goods, by dropping all its soybean orders from the US and buying them from Russia. The effect is not only to cause tremendous harm to US farmers, but also to increase Russian revenue, making Russia less susceptible to sanctions and boycotts, increasing its economic and political power in the world, and reducing ours. Trump saw steel and aluminum and thought it would be an easy win, BECAUSE HE SAW ONLY STEEL AND ALUMINUM - HE SEES EVERY NEGOTIATION AS DISTRIBUTIVE. China saw it as integrative, and integrated Russia and its soybean purchase orders into a far more complex negotiation ecosystem.\n\nTrump has the same weakness politically. For every winner there must be a loser. And that's just not how politics works, not over the long run.\n\nFor people who study negotiations, this is incredibly basic stuff, negotiations 101, definitions you learn before you even start talking about styles and tactics. And here's another huge problem for us.\n\nTrump is utterly convinced that his experience in a closely held real estate company has prepared him to run a nation, and therefore he rejects the advice of people who spent entire careers studying the nuances of international negotiations and diplomacy. But the leaders on the other side of the table have not eschewed expertise, they have embraced it. And that means they look at Trump and, given his very limited tool chest and his blindly distributive understanding of negotiation, they know exactly what he is going to do and exactly how to respond to it.\n\nFrom a professional negotiation point of view, Trump isn't even bringing checkers to a chess match. He's bringing a quarter that he insists of flipping for heads or tails, while everybody else is studying the chess board to decide whether its better to open with Najdorf or Grünfeld.”\n\n— David Honig, Robert H. McKinney School of Law and I teach negotiations"
            ],
            "aggregate_sentiment": 12.0
        }
    ],
    "last_updated": "03/11/2025 18:31:25 UTC"
}