{
    "posts": [
        {
            "category": "HOT",
            "title": "Critically ill 9/11 first responders are being turned away from the program meant to save them",
            "external_url": "https://abcnews.go.com/US/critically-ill-911-responders-turned-program-meant-save/story?id=121338021",
            "upvotes": 36304,
            "date": "05/01/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1d68ac5d-43f3-4701-8892-aeb3f5ac40dc/firefighter-helmet-gty-jef-250501_1746117071710_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I feel the need to clarify something. The WTC healthcare program is not just for NYC first responders, it's for anyone who lived and worked within a certain area of the event. Volunteer doctors and nurses came from as far as Canada to help in the immediate aftermath and are now sick. People went back to work and school in the area because the government said it was safe. \n\nANYONE who lived or worked in that area in the following months need to sign up for the healthcare program to be monitored.",
                "Isn't this what they wanted? Traded a 30 min DEI course you had to take for work for tax cuts and no support for healthcare. Great choice!",
                "Sucks that most first responders voted for this. Jon Stewart couldn't save them from themselves. 🤷‍♂️",
                "Republicans hate first responders and veterans; they vote against them an overwhelming majority of the time.",
                ">The program now serves more than 150,000 people nationwide, up from about 76,000 in 2015, according to data from the Centers for Disease Control and Prevention. A bipartisan bill, HR 1410, was introduced in February to close the funding gap as enrollment surged, but it remains stalled in Congress.\n\nHR 1410 was introduced February 18th of this year and was sent to the House Committee on Energy and Commerce. It hasn't moved there since.",
                "Notice how the filthy troglodyte robber barons take and take and say there is not enough to go around? No one needs 100 million dollars, much less 100 billion!",
                "may you live in interesting times \n\nmay you come to the attention of those in authority \n\nmay the gods give you everything you ask for\n\nCongrats firefighters you got all three!",
                "*Jon Stewart didn't like that*",
                "9/11 firefighters are treated far worse than J6ers",
                "Conservatives hate America"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Trump shuts down program to end human waste backing into Alabama homes, calling it ‘illegal DEI’",
            "external_url": "https://www.nbcnews.com/news/nbcblk/trump-canceled-dei-program-raw-sewage-alabaman-homes-rcna201164",
            "upvotes": 8400,
            "date": "05/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-alabama-rural-water-mn-1240-060c98.jpg",
            "top_comments": [
                "Let me guess the program was helping minority communities (the most common community that is effected by pollution) in Alabama, but because helping minorities is ‘illegal DEI’ then it had to be removed",
                "I guess Alabama will now be literally full of shit.",
                "“The problem has existed so long and was so pervasive that a 2017 study determined 1 in every 3 adults in the county had the intestinal parasite hookworm. “\n\nNice",
                "Can we focus on that \"illegal DEI\" comment for a moment? He's now saying that DEI is *against the law*. Not just something he wants to stop, but something that will get you thrown in jail. \n\nDoing anything that benefits anyone other than cis straight White men with zero disabilities is now illegal.",
                "Apparently not drinking or bathing in water tainted with human excrement is (checks notes) *woke*.",
                "Anyone noticing everything benefitting anyone other than wealthy, white, male, Christian, heterosexuals is being killed for being DEI?\n\nThey've found a way to back door discrimination.",
                "He says “environmental justice” is a diversity, equity and inclusion program. Somehow.",
                "Reminder that DEI is not illegal, even if that was a valid argument, which it's not.",
                "So the federal government is shutting down a program because of the race and color of those benefitting from it.\n\nMaybe...https://uscode.house.gov/view.xhtml?req=(title:42%20section:1983%20edition:prelim)",
                "They'll be so happy to be rid of all that DEI. /s"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "White House national security adviser Waltz to leave post, sources say",
            "external_url": "https://www.reuters.com/world/us/white-house-national-security-adviser-waltz-leave-post-source-says-2025-05-01/",
            "upvotes": 9124,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is this one of the first departures of MAGA2025?",
                "How many mooches long is this?",
                "I wonder if Hegseth understands this makes it more likely that he's fucked, not less. Waltz just got motivated to talk honestly about him.",
                "I wonder if the last 3.5 months for him were worth giving up a safe congressional seat.",
                "Laura Loomer runs National security",
                "how long before Donnie starts trashing them?",
                "“When a clown moves into a palace, he does not become a king, instead the palace becomes a circus”",
                "This MFer is leaving, not because he shared the plans or was using Signal to do it, but because he had that journalist from the Atlantic in his contacts.  It's the same journalist that reported Trump calling the enlisted \"Suckers and Losers\" so Trump HATES that guy.  To see one of his people have his direct contact sent Trump into a paranoid spiral and he would never trust Mike Waltz again.  No coming back for him.",
                "Time for the first wave of MAGA firings so they can write books about their experiences and say, omg it was so awful I’m glad I’m on the right side of history again please buy my book and forgive me!",
                "I think it has something to do with doge getting access to nuke systems, stealing ssn, and providing access to the Russians via ‘unsecure’ means.  I think this is also why musk is ‘stepping back’.  All of this happened around the time those reports and the whistleblower came out.  I’m guessing it’s bad bad."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "HOT",
            "title": "Education Department stops $1 billion in funding for school mental health",
            "external_url": "https://www.npr.org/2025/05/01/nx-s1-5382582/trump-school-mental-health",
            "upvotes": 1511,
            "date": "05/01/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+430/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F28%2F70%2Fb8e504e5426384e23dd10894cbb8%2Fgettyimages-2206185094.jpg",
            "top_comments": [
                "Interesting this drops on the same day the Supreme Court is expected to rule states are obligated to fund religious charter schools. We have to pay for religion with our tax dollars, but can't pay for mental health i suppose.",
                "Conservatives say school shootings are a mental health problem and then do shit like this",
                "They are literally writing entire books about how these kids are suffering from mental health issues. It's ok though remember this country doesn't have a gun problem it has a mental health problem.",
                "This is how you get school shootings. But at this point I think that's what this administration wants.",
                "\"It's not the guns! It's a mental health issue!\"\n\nProceeds to gut mental health support. \n\nFuck the GOP.",
                "Weren’t school shootings about mental health?",
                "Can't have healthy students who are more likely to get actual education from schools, because that will reduce the Republican voting base.",
                "Republicans have always been about short term thinking. \n\nTheir biggest concerns are how to make fast money and they dismiss climate change or investments into society. This is why they hate scientists, economists, analysts and historians. Anyone who isn’t helping them gain immediate wealth is trying to sabotage them. And that is why the current administration is operating under the republican golden rule:  \n\n“if we can’t monetize it then we will destroy it”. \n\nGreenland, Canada, Ukraine, Education, Healthcare, Social Security, EVs, Windmills, FEMA and National Parks. All things that should be invested into (or at least left alone) are viewed as enemies to America because “How can these things exist without huge personal profit?”  \n\nDe-investing Education, Mental Health and Kids is going to create the absolute worst society possible. And this is why putting these things in the hands of people who wont be here in a decade is so destructive. They aren’t looking at the future, they’re trying to cash in now.",
                "That’s because it’s a fascist shithole no child should be born into",
                "Just our kids, folks.  You know, the future of our nation … \n\nCan’t think of a single, solitary, rational reason that investing money into the mental health of our children is a bad thing."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Quebec to impose full ban on cellphones in schools",
            "external_url": "https://www.cbc.ca/news/canada/montreal/quebec-cell-phone-ban-1.7523543",
            "upvotes": 1612,
            "date": "05/01/2025",
            "thumbnail": "https://i.cbc.ca/1.7299218.1724883221!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/schools-cellphones.jpg?im=Resize%3D620",
            "top_comments": [
                "This seems like a necessary step.",
                "How did phones end up in schools in the first place? We couldn’t even wear hats in school.",
                "Good. This needs to happen, and parents saying they need to be able to contact their kids... Do you not remember how it worked before cell phones? We were all fine. There is rarely a real reason for a cell phone in the classroom. ",
                "Surprised it wasn't implemented much earlier",
                "Cue the shrieking, self-righteous parents who think their kids “need” the phone for “safety” or because it’s “their property” or some other such bullshit.",
                "My child's school had a \"Cell Phone Ban,\" yet almost all kids had cell phones and used them constantly with rarely if any interference by teachers/staff.\n\nI came to realize they fully allowed it since the phones, to an extent, controlled the student's behavior.  The more the students were glued to their phones, the less **overt** trouble they caused and the less overt trouble teachers/staff had to deal with.\n\nBut, it also seemed clear to me that the presence of the phones created much more **covert** trouble and cyberbullying, etc.\n\nBottomline, cell phones are a ubiquitous fact of life, I'd much rather schools embrace that and encourage/enforce thoughtful/mature use of them.  Heck, they can have a role in learning if their use was considered carefully.",
                "As a 90s/2000s kid it boggles my mind even the idea of being able to have a smart phone in class.\n\nHell I had my calculator taken away several times just because it had the Snake game on it.",
                "Seems like a good idea. But good luck with it",
                "Absolutely the way it should be. Smart phones are ruining the world.",
                "The lost art of passing notes is about to make a comeback!"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "FTC orders Publishers Clearing House to pay $18.5 million to 'misled' customers",
            "external_url": "https://www.denver7.com/us-news/ftc-orders-publishers-clearing-house-to-pay-18-5-million-to-misled-customers",
            "upvotes": 1141,
            "date": "05/01/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/a47c520/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fbd%2F06%2Fdc94342e4e86939bce9af5d003c3%2Fshutterstock-1111363946.jpg",
            "top_comments": [
                "We WERE mislead.\n\nIt was never Ed McMahon after all.",
                "My mom was a victim of this and at one point wanted to keep sending money. I put that to a stop completely, for a while she kept getting inundated with their fucking mail.",
                "Was wondering how they had all that money to give away",
                ">The company, known for its sweepstakes, filed for bankruptcy earlier this year. PCH aired commercials featuring sweepstakes winners receiving giant checks delivered to their homes along with flowers and champagne.\n\nEd McMahon was a spokesperson for American Family Publishers. Publishers Clearing House had the Prize Patrol. It's a common example of the Mandela Effect.",
                "My grandmother has been buying crap from PCH for years… sounds like she might finally get that check she’s been waiting on lol",
                "✉️ FTC, YOU HAVE WON $18.5 MILLION!\n\nJust make sure you call your Claim Manager BEFORE you cash the check...",
                "If you wondered why companies running contests prominently say NO PURCHASE NECESSARY, VOID WHERE PROHIBITED... well this is why.",
                "Does this mean I finally get that thousand dollars a week for life, that i was always 1 step away from winning?\n\n\nOh boy pizza party tonite!",
                "Can they pay the fine with a comically oversized check? I hope so.",
                "Can't wait for a new series of PCH scams telling people they're getting a payout from this decision, and just asking for some up front administrative fees"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Rare for alleged poisonous mushroom killer to host lunch, husband says",
            "external_url": "https://www.bbc.com/news/articles/c2dek63gxp6o",
            "upvotes": 539,
            "date": "05/01/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/1f06/live/21dbe990-2643-11f0-a20d-1d8f85937283.jpg",
            "top_comments": [
                "For all of her supposed intelligence...did she really think she could invite 4 people over for dinner, kill them and NO ONE would notice?",
                "Aaaaand lied saying she had cancer and needed advice on how to tell her kids, which is why her kids weren't there to be poisoned. It's such an obvious premise.",
                "I feel so out-of-the-loop and this headline isn't helping.",
                "She used a different coloured plate for herself!!",
                "Flared for uk for some reason. Its story from Australia",
                "Forager here! She was trying to set it up as an accidental poisoning. This detail may not strike you if you're not in the hobby, but the article mentions she first claimed that she bought foraged mushrooms from an Asian grocer.\n\nAsian immigrants often enjoy foraging. When they move to other continents, they wind up poisoned by death cap mushrooms at a statistically higher rate than other groups. This is because our death caps look very similar to mushrooms edible in their home country. It's so common that immigration officials should put something on immigration forms about how edible mushrooms on X country may easily be confused with deadly mushrooms from Y country.\n\nBut anyways, clearly this woman researched poisoning with this mushroom in particular. And was trying to create plausible deniability by blaming immigrants.",
                "Wanted to kill ex-husband, his parents and aunt and the local pastor. \n\nEx declined the invitation. \n\nPastor only survivor of that meal except the accused, who ate from a different colour plate.",
                "I love that the drawing makes her look like a character out of Common Side Effects.",
                "Damn BBC, use quote marks if it's what the husband said. Had to read this multiple times before the sentence made sense!",
                "Rare, but not unheard of"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Kohl's CEO ousted amid allegations of undisclosed conflicts of interest",
            "external_url": "https://www.denver7.com/business/company-news/kohls-ceo-ousted-amid-allegations-of-undisclosed-conflicts-of-interest",
            "upvotes": 287,
            "date": "05/01/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/9702aab/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fcd%2Fd4%2F726699724b699961ede3b2330243%2F1702512423-lbmffs.jpg",
            "top_comments": [
                "Spicy headline. Article reads “Mr. Buchanan violated company policies by directing the company to engage in vendor transactions that involved undisclosed conflicts of interest, which the Board determined to be cause,\" Kohl's said in a statement” without any more details.",
                "His severance package includes $3.7m in Kohls Cash which will expire in two weeks if unused and cannot be combined with other coupons or offers",
                "\\[turning to the camera & whispering with one hand to the side of my mouth\\]  \n\"THIS is how you get ousted as CEO\""
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "More than 100 children fall sick after dead snake reportedly found in school lunch in India",
            "external_url": "https://www.cbsnews.com/news/dead-snake-school-lunch-100-children-sick-india-report/",
            "upvotes": 273,
            "date": "05/01/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/01/19629d99-068f-44da-a578-8a0bc6d3d3f2/thumbnail/1200x630/ce8e390ff36f84a152805a516484e043/gettyimages-1244020471.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "India's human rights commission is investigating an incident in which more than 100 children became sick after eating a school lunch contaminated by a dead snake at a government-run school in Mokama, Bihar. According to reports, the cook served the meal even after removing the snake from the food, resulting in illnesses among the children and triggering angry protests from their families. The commission has requested local authorities to submit a detailed report, highlighting concerns of human rights violations and ongoing issues of poor food hygiene associated with India's free Mid-Day Meal scheme, a program aimed at encouraging school attendance among disadvantaged children. This incident echoes a tragic 2013 event in Bihar, where 23 children died due to a pesticide-contaminated school meal.",
                "You know it's bad when a food mishandling story in India makes the news.",
                "I wonder what type of illness can a snake pass to you?",
                "Makes me think about all the videos I see in India where they are serving street food that is unrecognizable. I always wonder how people don’t get sick from it.",
                "I hope all the kids will be ok.",
                "[deleted]",
                "Look at your future America",
                "Well thank god that at least it was dead."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Veteran slaying trial: Wife found guilty of murder, immediately sentenced to life in prison",
            "external_url": "https://clarksvillenow.com/local/veteran-slaying-trial-wife-found-guilty-of-murder-immediately-sentenced-to-life-in-prison/",
            "upvotes": 681,
            "date": "05/01/2025",
            "thumbnail": "https://clarksvillenow.com/wp-content/blogs.dir/43/files/2025/04/Theary-Lim-verdict-4.jpg",
            "top_comments": [
                "CLARKSVILLE, TN (CLARKSVILLE NOW) – After three days of testimony and only 1 hour and 20 minutes of jury deliberation, Theary Lim, charged with killing her Army veteran husband, was found guilty of first-degree murder on Wednesday and immediately sentenced to life in prison.\n\nOn Jan. 3, 2022, Clarksville Police conducted a welfare check in the 2200 block of Ladd Drive. Upon arrival, they found 38-year-old Sothon In dead from a gunshot wound to the head. Nearby, his wife, 32-year-old Theary Lim, and her two children were on the floor under a blanket. The next day, Theary Lim was arrested and charged.\n\nProsecution: ‘This wasn’t an accident, this was calculated’\nDuring closing arguments, Assistant District Attorney Crystal Morgan displayed a professional photograph to the jury of Theary Lim holding a firearm, a leg holster secured to her thigh, and a T-shirt with the words “Girls just want to have guns” printed on the back.\n\n“It’s the defendant’s own statement to Detective (Keenan) Carlton: She admits she had the gun in her hands. She was playing with the gun, she shook it, and it went off,” Morgan told the jury.\n\nMorgan referred to the medical examiner’s testimony that the bullet entered through Sothon’s forehead and exited out the back. She stated the defendant would had to have been standing beside the bed at close range, within 3 feet, when she fired the shot.\n\n“She left her husband in that bedroom for hours to die,” Morgan said. “A nine-hour and four-minute window that Sothon lay in that bedroom – with the defendant and his children in the house – dead.\n\n“It was an accident?” Morgan said. “What we have to believe to accept that statement is that she retrieved a gun, decided to play with it at the head of her sleeping husband.” Morgan cited testimony from an expert witness who stated it would take 7 pounds of pressure on the trigger in order for that gun to go off. “Does that pass your common sense?\n\n“This wasn’t an accident, ladies and gentlemen,” Morgan said. “It was premeditated. It was calculated. She locks the door at 12:15 (p.m.), she closes the blinds after he’s shot, and at 12:59 (p.m.) she unlocks the door. … Hold her responsible. Find her guilty.”\n\nDefense: How many unanswered questions can you live with?\nWhile Theary’s attorney, Chase Smith, waived opening remarks, he did not pass up on closing arguments. “How many unanswered questions can you have and still find someone guilty of premeditated first-degree murder?” Chase Smith asked. “Moral certainty is required, absolute certainty is not.”\n\nSmith explained this means that when the trial is over and the jury is allowed to speak about the case, they need to be able to “without hesitation” explain why they found her guilty, why she shot him, why she did it intentionally, and why it was premeditated.\n\nHe pointed out what he called flaws in the state’s case and with their witnesses. Smith mentioned a “drive-thru forensic test” explaining that it took three years to get a test back on the gunshot residue kit from the Tennessee Bureau of Investigation, a test that once it was started, only took one day to complete and get results. And he called the results confusing.\n\n“All the (GSR) was on her left hand, none on her right hand,” Smith said before showing the same picture of Theary that the state published. “The picture the state put in, she has the gun in her right hand.” Smith pulled out a form his client signed that waived her right to testify. “She signs that waiver with her right hand.”\n\nSmith furthered his point by referencing the medical examiner report. Though the gun was close to the victims head, it wasn’t close enough to leave a muzzle stamp, meaning there wasn’t hard contact. “No pressure, no press down like you want to really kill somebody because you’re mad.\n\n“It doesn’t prove that she shot him,” Smith said. “What if he shot himself? What if one of the kids shot him? If you have a significant amount of unanswered questions, you’ve got to ask yourselves, how many can you have and still be certain that she’s guilty?” Smith asked the jury.\n\nSentenced to life in prison\nTheary Lim was found guilty as charged of first-degree murder. After the jury was dismissed, a sentencing was immediately held.\n\nIn the state of Tennessee, if any individual is found guilty of first-degree murder, it is a mandatory life sentence (60 years). The only charge Theary was facing was the murder charge. Judge Robert Bateman imposed an immediate life sentence, minus credited time served up to 15%, for a minimum of 51 years in prison.",
                "reading the case. \n\nyeah it was on purpose.\n\ndo gun trigger some time fail .(many recalls on that) but if gun was used before said event.\n\nit would have been easy to spot or notice in the gun.",
                "It's been proven that most gun-related accidents are usually their own family members.\n\n\nHell, my older brother almost shot me once, I was staying with him and came home one night super late. He had his gun drawn on me, and I told him I came in through the front door and had keys and everything lol.\n\n\nAn intruder wouldn't enter that way, nor have keys.\n\n\nI feel like owning a gun makes people jumpy with it, like they *want* to use it on something to justify owning it.",
                "What was the motive?  I have no problem holding her responsible for the death, but first degree murder and no established motive?",
                "Can't access the article so not sure what \"immediately\" means here, but I'm pretty sure nothing happens immediately in the legal world.",
                "She should have used the good ole “I didn’t know the gun was loaded” defense! /s",
                "\"The average prison sentence for men who kill their female partners is two to six years. By contrast women, who kill their partners are sentenced on average to 15 years.\"",
                "> “All the (GSR) was on her left hand, none on her right hand,” Smith said before showing the same picture of Theary that the state published. “The picture the state put in, she has the gun in her right hand.” Smith pulled out a form his client signed that waived her right to testify. “She signs that waiver with her right hand.”\n“What if he shot himself? What if one of the kids shot him? \n\nSounds like the prosecution failed to meet the burden of proof required for prove premeditation, but it’s Tennessee…."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Kohl's CEO ousted amid allegations of undisclosed conflicts of interest",
            "external_url": "https://www.denver7.com/business/company-news/kohls-ceo-ousted-amid-allegations-of-undisclosed-conflicts-of-interest",
            "upvotes": 288,
            "date": "05/01/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/9702aab/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fcd%2Fd4%2F726699724b699961ede3b2330243%2F1702512423-lbmffs.jpg",
            "top_comments": [
                "Spicy headline. Article reads “Mr. Buchanan violated company policies by directing the company to engage in vendor transactions that involved undisclosed conflicts of interest, which the Board determined to be cause,\" Kohl's said in a statement” without any more details.",
                "His severance package includes $3.7m in Kohls Cash which will expire in two weeks if unused and cannot be combined with other coupons or offers",
                "\\[turning to the camera & whispering with one hand to the side of my mouth\\]  \n\"THIS is how you get ousted as CEO\""
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "More than 100 children fall sick after dead snake reportedly found in school lunch in India",
            "external_url": "https://www.cbsnews.com/news/dead-snake-school-lunch-100-children-sick-india-report/",
            "upvotes": 272,
            "date": "05/01/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/01/19629d99-068f-44da-a578-8a0bc6d3d3f2/thumbnail/1200x630/ce8e390ff36f84a152805a516484e043/gettyimages-1244020471.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "India's human rights commission is investigating an incident in which more than 100 children became sick after eating a school lunch contaminated by a dead snake at a government-run school in Mokama, Bihar. According to reports, the cook served the meal even after removing the snake from the food, resulting in illnesses among the children and triggering angry protests from their families. The commission has requested local authorities to submit a detailed report, highlighting concerns of human rights violations and ongoing issues of poor food hygiene associated with India's free Mid-Day Meal scheme, a program aimed at encouraging school attendance among disadvantaged children. This incident echoes a tragic 2013 event in Bihar, where 23 children died due to a pesticide-contaminated school meal.",
                "You know it's bad when a food mishandling story in India makes the news.",
                "I wonder what type of illness can a snake pass to you?",
                "Makes me think about all the videos I see in India where they are serving street food that is unrecognizable. I always wonder how people don’t get sick from it.",
                "I hope all the kids will be ok.",
                "[deleted]",
                "Look at your future America",
                "Well thank god that at least it was dead."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Education Department stops $1 billion in funding for school mental health",
            "external_url": "https://www.npr.org/2025/05/01/nx-s1-5382582/trump-school-mental-health",
            "upvotes": 1513,
            "date": "05/01/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+430/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F28%2F70%2Fb8e504e5426384e23dd10894cbb8%2Fgettyimages-2206185094.jpg",
            "top_comments": [
                "Interesting this drops on the same day the Supreme Court is expected to rule states are obligated to fund religious charter schools. We have to pay for religion with our tax dollars, but can't pay for mental health i suppose.",
                "Conservatives say school shootings are a mental health problem and then do shit like this",
                "They are literally writing entire books about how these kids are suffering from mental health issues. It's ok though remember this country doesn't have a gun problem it has a mental health problem.",
                "This is how you get school shootings. But at this point I think that's what this administration wants.",
                "\"It's not the guns! It's a mental health issue!\"\n\nProceeds to gut mental health support. \n\nFuck the GOP.",
                "Weren’t school shootings about mental health?",
                "Can't have healthy students who are more likely to get actual education from schools, because that will reduce the Republican voting base.",
                "Republicans have always been about short term thinking. \n\nTheir biggest concerns are how to make fast money and they dismiss climate change or investments into society. This is why they hate scientists, economists, analysts and historians. Anyone who isn’t helping them gain immediate wealth is trying to sabotage them. And that is why the current administration is operating under the republican golden rule:  \n\n“if we can’t monetize it then we will destroy it”. \n\nGreenland, Canada, Ukraine, Education, Healthcare, Social Security, EVs, Windmills, FEMA and National Parks. All things that should be invested into (or at least left alone) are viewed as enemies to America because “How can these things exist without huge personal profit?”  \n\nDe-investing Education, Mental Health and Kids is going to create the absolute worst society possible. And this is why putting these things in the hands of people who wont be here in a decade is so destructive. They aren’t looking at the future, they’re trying to cash in now.",
                "That’s because it’s a fascist shithole no child should be born into",
                "Just our kids, folks.  You know, the future of our nation … \n\nCan’t think of a single, solitary, rational reason that investing money into the mental health of our children is a bad thing."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Trump shuts down program to end human waste backing into Alabama homes, calling it ‘illegal DEI’",
            "external_url": "https://www.nbcnews.com/news/nbcblk/trump-canceled-dei-program-raw-sewage-alabaman-homes-rcna201164",
            "upvotes": 8409,
            "date": "05/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-alabama-rural-water-mn-1240-060c98.jpg",
            "top_comments": [
                "Let me guess the program was helping minority communities (the most common community that is effected by pollution) in Alabama, but because helping minorities is ‘illegal DEI’ then it had to be removed",
                "I guess Alabama will now be literally full of shit.",
                "“The problem has existed so long and was so pervasive that a 2017 study determined 1 in every 3 adults in the county had the intestinal parasite hookworm. “\n\nNice",
                "Can we focus on that \"illegal DEI\" comment for a moment? He's now saying that DEI is *against the law*. Not just something he wants to stop, but something that will get you thrown in jail. \n\nDoing anything that benefits anyone other than cis straight White men with zero disabilities is now illegal.",
                "Apparently not drinking or bathing in water tainted with human excrement is (checks notes) *woke*.",
                "Anyone noticing everything benefitting anyone other than wealthy, white, male, Christian, heterosexuals is being killed for being DEI?\n\nThey've found a way to back door discrimination.",
                "He says “environmental justice” is a diversity, equity and inclusion program. Somehow.",
                "Reminder that DEI is not illegal, even if that was a valid argument, which it's not.",
                "So the federal government is shutting down a program because of the race and color of those benefitting from it.\n\nMaybe...https://uscode.house.gov/view.xhtml?req=(title:42%20section:1983%20edition:prelim)",
                "They'll be so happy to be rid of all that DEI. /s"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Rare for alleged poisonous mushroom killer to host lunch, husband says",
            "external_url": "https://www.bbc.com/news/articles/c2dek63gxp6o",
            "upvotes": 537,
            "date": "05/01/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/1f06/live/21dbe990-2643-11f0-a20d-1d8f85937283.jpg",
            "top_comments": [
                "For all of her supposed intelligence...did she really think she could invite 4 people over for dinner, kill them and NO ONE would notice?",
                "Aaaaand lied saying she had cancer and needed advice on how to tell her kids, which is why her kids weren't there to be poisoned. It's such an obvious premise.",
                "I feel so out-of-the-loop and this headline isn't helping.",
                "She used a different coloured plate for herself!!",
                "Flared for uk for some reason. Its story from Australia",
                "Forager here! She was trying to set it up as an accidental poisoning. This detail may not strike you if you're not in the hobby, but the article mentions she first claimed that she bought foraged mushrooms from an Asian grocer.\n\nAsian immigrants often enjoy foraging. When they move to other continents, they wind up poisoned by death cap mushrooms at a statistically higher rate than other groups. This is because our death caps look very similar to mushrooms edible in their home country. It's so common that immigration officials should put something on immigration forms about how edible mushrooms on X country may easily be confused with deadly mushrooms from Y country.\n\nBut anyways, clearly this woman researched poisoning with this mushroom in particular. And was trying to create plausible deniability by blaming immigrants.",
                "Wanted to kill ex-husband, his parents and aunt and the local pastor. \n\nEx declined the invitation. \n\nPastor only survivor of that meal except the accused, who ate from a different colour plate.",
                "I love that the drawing makes her look like a character out of Common Side Effects.",
                "Damn BBC, use quote marks if it's what the husband said. Had to read this multiple times before the sentence made sense!",
                "Rare, but not unheard of"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "FTC orders Publishers Clearing House to pay $18.5 million to 'misled' customers",
            "external_url": "https://www.denver7.com/us-news/ftc-orders-publishers-clearing-house-to-pay-18-5-million-to-misled-customers",
            "upvotes": 1139,
            "date": "05/01/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/a47c520/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fbd%2F06%2Fdc94342e4e86939bce9af5d003c3%2Fshutterstock-1111363946.jpg",
            "top_comments": [
                "We WERE mislead.\n\nIt was never Ed McMahon after all.",
                "My mom was a victim of this and at one point wanted to keep sending money. I put that to a stop completely, for a while she kept getting inundated with their fucking mail.",
                "Was wondering how they had all that money to give away",
                ">The company, known for its sweepstakes, filed for bankruptcy earlier this year. PCH aired commercials featuring sweepstakes winners receiving giant checks delivered to their homes along with flowers and champagne.\n\nEd McMahon was a spokesperson for American Family Publishers. Publishers Clearing House had the Prize Patrol. It's a common example of the Mandela Effect.",
                "My grandmother has been buying crap from PCH for years… sounds like she might finally get that check she’s been waiting on lol",
                "✉️ FTC, YOU HAVE WON $18.5 MILLION!\n\nJust make sure you call your Claim Manager BEFORE you cash the check...",
                "If you wondered why companies running contests prominently say NO PURCHASE NECESSARY, VOID WHERE PROHIBITED... well this is why.",
                "Does this mean I finally get that thousand dollars a week for life, that i was always 1 step away from winning?\n\n\nOh boy pizza party tonite!",
                "Can they pay the fine with a comically oversized check? I hope so.",
                "Can't wait for a new series of PCH scams telling people they're getting a payout from this decision, and just asking for some up front administrative fees"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Runaway kangaroo temporarily shuts down highway in Alabama",
            "external_url": "https://www.cnn.com/2025/04/30/us/runaway-kangaroo-shuts-highway-alabama-hnk",
            "upvotes": 242,
            "date": "05/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25119824201576.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Commuters are hopping mad.",
                "Must have escaped from the Supreme Court",
                "Mullets are flying at full staff at the Aussie embassy, somehow wrapping completely around the heads of diplomats to form hair bangs salute.  \n  \nGodspeed Runaway Roo",
                "In Aussie news, that's just another Thursday ",
                "Well, I'm sure people shut it down and not the kangaroo...",
                "Hey meema, lookie thar ya don't see that thar everyday."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "White House national security adviser Waltz to leave post, sources say",
            "external_url": "https://www.reuters.com/world/us/white-house-national-security-adviser-waltz-leave-post-source-says-2025-05-01/",
            "upvotes": 9126,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is this one of the first departures of MAGA2025?",
                "How many mooches long is this?",
                "I wonder if Hegseth understands this makes it more likely that he's fucked, not less. Waltz just got motivated to talk honestly about him.",
                "I wonder if the last 3.5 months for him were worth giving up a safe congressional seat.",
                "Laura Loomer runs National security",
                "how long before Donnie starts trashing them?",
                "“When a clown moves into a palace, he does not become a king, instead the palace becomes a circus”",
                "This MFer is leaving, not because he shared the plans or was using Signal to do it, but because he had that journalist from the Atlantic in his contacts.  It's the same journalist that reported Trump calling the enlisted \"Suckers and Losers\" so Trump HATES that guy.  To see one of his people have his direct contact sent Trump into a paranoid spiral and he would never trust Mike Waltz again.  No coming back for him.",
                "Time for the first wave of MAGA firings so they can write books about their experiences and say, omg it was so awful I’m glad I’m on the right side of history again please buy my book and forgive me!",
                "I think it has something to do with doge getting access to nuke systems, stealing ssn, and providing access to the Russians via ‘unsecure’ means.  I think this is also why musk is ‘stepping back’.  All of this happened around the time those reports and the whistleblower came out.  I’m guessing it’s bad bad."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Quebec to impose full ban on cellphones in schools",
            "external_url": "https://www.cbc.ca/news/canada/montreal/quebec-cell-phone-ban-1.7523543",
            "upvotes": 1621,
            "date": "05/01/2025",
            "thumbnail": "https://i.cbc.ca/1.7299218.1724883221!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/schools-cellphones.jpg?im=Resize%3D620",
            "top_comments": [
                "This seems like a necessary step.",
                "How did phones end up in schools in the first place? We couldn’t even wear hats in school.",
                "Good. This needs to happen, and parents saying they need to be able to contact their kids... Do you not remember how it worked before cell phones? We were all fine. There is rarely a real reason for a cell phone in the classroom. ",
                "Surprised it wasn't implemented much earlier",
                "Cue the shrieking, self-righteous parents who think their kids “need” the phone for “safety” or because it’s “their property” or some other such bullshit.",
                "My child's school had a \"Cell Phone Ban,\" yet almost all kids had cell phones and used them constantly with rarely if any interference by teachers/staff.\n\nI came to realize they fully allowed it since the phones, to an extent, controlled the student's behavior.  The more the students were glued to their phones, the less **overt** trouble they caused and the less overt trouble teachers/staff had to deal with.\n\nBut, it also seemed clear to me that the presence of the phones created much more **covert** trouble and cyberbullying, etc.\n\nBottomline, cell phones are a ubiquitous fact of life, I'd much rather schools embrace that and encourage/enforce thoughtful/mature use of them.  Heck, they can have a role in learning if their use was considered carefully.",
                "As a 90s/2000s kid it boggles my mind even the idea of being able to have a smart phone in class.\n\nHell I had my calculator taken away several times just because it had the Snake game on it.",
                "Seems like a good idea. But good luck with it",
                "Absolutely the way it should be. Smart phones are ruining the world.",
                "The lost art of passing notes is about to make a comeback!"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Critically ill 9/11 first responders are being turned away from the program meant to save them",
            "external_url": "https://abcnews.go.com/US/critically-ill-911-responders-turned-program-meant-save/story?id=121338021",
            "upvotes": 36307,
            "date": "05/01/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1d68ac5d-43f3-4701-8892-aeb3f5ac40dc/firefighter-helmet-gty-jef-250501_1746117071710_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I feel the need to clarify something. The WTC healthcare program is not just for NYC first responders, it's for anyone who lived and worked within a certain area of the event. Volunteer doctors and nurses came from as far as Canada to help in the immediate aftermath and are now sick. People went back to work and school in the area because the government said it was safe. \n\nANYONE who lived or worked in that area in the following months need to sign up for the healthcare program to be monitored.",
                "Isn't this what they wanted? Traded a 30 min DEI course you had to take for work for tax cuts and no support for healthcare. Great choice!",
                "Sucks that most first responders voted for this. Jon Stewart couldn't save them from themselves. 🤷‍♂️",
                "Republicans hate first responders and veterans; they vote against them an overwhelming majority of the time.",
                ">The program now serves more than 150,000 people nationwide, up from about 76,000 in 2015, according to data from the Centers for Disease Control and Prevention. A bipartisan bill, HR 1410, was introduced in February to close the funding gap as enrollment surged, but it remains stalled in Congress.\n\nHR 1410 was introduced February 18th of this year and was sent to the House Committee on Energy and Commerce. It hasn't moved there since.",
                "Notice how the filthy troglodyte robber barons take and take and say there is not enough to go around? No one needs 100 million dollars, much less 100 billion!",
                "may you live in interesting times \n\nmay you come to the attention of those in authority \n\nmay the gods give you everything you ask for\n\nCongrats firefighters you got all three!",
                "*Jon Stewart didn't like that*",
                "9/11 firefighters are treated far worse than J6ers",
                "Conservatives hate America"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Kohl's CEO ousted amid allegations of undisclosed conflicts of interest",
            "external_url": "https://www.denver7.com/business/company-news/kohls-ceo-ousted-amid-allegations-of-undisclosed-conflicts-of-interest",
            "upvotes": 287,
            "date": "05/01/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/9702aab/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fcd%2Fd4%2F726699724b699961ede3b2330243%2F1702512423-lbmffs.jpg",
            "top_comments": [
                "Spicy headline. Article reads “Mr. Buchanan violated company policies by directing the company to engage in vendor transactions that involved undisclosed conflicts of interest, which the Board determined to be cause,\" Kohl's said in a statement” without any more details.",
                "His severance package includes $3.7m in Kohls Cash which will expire in two weeks if unused and cannot be combined with other coupons or offers",
                "\\[turning to the camera & whispering with one hand to the side of my mouth\\]  \n\"THIS is how you get ousted as CEO\""
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Trump shuts down program to end human waste backing into Alabama homes, calling it ‘illegal DEI’",
            "external_url": "https://www.nbcnews.com/news/nbcblk/trump-canceled-dei-program-raw-sewage-alabaman-homes-rcna201164",
            "upvotes": 8404,
            "date": "05/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-alabama-rural-water-mn-1240-060c98.jpg",
            "top_comments": [
                "Let me guess the program was helping minority communities (the most common community that is effected by pollution) in Alabama, but because helping minorities is ‘illegal DEI’ then it had to be removed",
                "I guess Alabama will now be literally full of shit.",
                "“The problem has existed so long and was so pervasive that a 2017 study determined 1 in every 3 adults in the county had the intestinal parasite hookworm. “\n\nNice",
                "Can we focus on that \"illegal DEI\" comment for a moment? He's now saying that DEI is *against the law*. Not just something he wants to stop, but something that will get you thrown in jail. \n\nDoing anything that benefits anyone other than cis straight White men with zero disabilities is now illegal.",
                "Apparently not drinking or bathing in water tainted with human excrement is (checks notes) *woke*.",
                "Anyone noticing everything benefitting anyone other than wealthy, white, male, Christian, heterosexuals is being killed for being DEI?\n\nThey've found a way to back door discrimination.",
                "He says “environmental justice” is a diversity, equity and inclusion program. Somehow.",
                "Reminder that DEI is not illegal, even if that was a valid argument, which it's not.",
                "So the federal government is shutting down a program because of the race and color of those benefitting from it.\n\nMaybe...https://uscode.house.gov/view.xhtml?req=(title:42%20section:1983%20edition:prelim)",
                "They'll be so happy to be rid of all that DEI. /s"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Education Department stops $1 billion in funding for school mental health",
            "external_url": "https://www.npr.org/2025/05/01/nx-s1-5382582/trump-school-mental-health",
            "upvotes": 1510,
            "date": "05/01/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+430/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F28%2F70%2Fb8e504e5426384e23dd10894cbb8%2Fgettyimages-2206185094.jpg",
            "top_comments": [
                "Interesting this drops on the same day the Supreme Court is expected to rule states are obligated to fund religious charter schools. We have to pay for religion with our tax dollars, but can't pay for mental health i suppose.",
                "Conservatives say school shootings are a mental health problem and then do shit like this",
                "They are literally writing entire books about how these kids are suffering from mental health issues. It's ok though remember this country doesn't have a gun problem it has a mental health problem.",
                "This is how you get school shootings. But at this point I think that's what this administration wants.",
                "\"It's not the guns! It's a mental health issue!\"\n\nProceeds to gut mental health support. \n\nFuck the GOP.",
                "Weren’t school shootings about mental health?",
                "Can't have healthy students who are more likely to get actual education from schools, because that will reduce the Republican voting base.",
                "Republicans have always been about short term thinking. \n\nTheir biggest concerns are how to make fast money and they dismiss climate change or investments into society. This is why they hate scientists, economists, analysts and historians. Anyone who isn’t helping them gain immediate wealth is trying to sabotage them. And that is why the current administration is operating under the republican golden rule:  \n\n“if we can’t monetize it then we will destroy it”. \n\nGreenland, Canada, Ukraine, Education, Healthcare, Social Security, EVs, Windmills, FEMA and National Parks. All things that should be invested into (or at least left alone) are viewed as enemies to America because “How can these things exist without huge personal profit?”  \n\nDe-investing Education, Mental Health and Kids is going to create the absolute worst society possible. And this is why putting these things in the hands of people who wont be here in a decade is so destructive. They aren’t looking at the future, they’re trying to cash in now.",
                "That’s because it’s a fascist shithole no child should be born into",
                "Just our kids, folks.  You know, the future of our nation … \n\nCan’t think of a single, solitary, rational reason that investing money into the mental health of our children is a bad thing."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "More than 100 children fall sick after dead snake reportedly found in school lunch in India",
            "external_url": "https://www.cbsnews.com/news/dead-snake-school-lunch-100-children-sick-india-report/",
            "upvotes": 270,
            "date": "05/01/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/01/19629d99-068f-44da-a578-8a0bc6d3d3f2/thumbnail/1200x630/ce8e390ff36f84a152805a516484e043/gettyimages-1244020471.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "India's human rights commission is investigating an incident in which more than 100 children became sick after eating a school lunch contaminated by a dead snake at a government-run school in Mokama, Bihar. According to reports, the cook served the meal even after removing the snake from the food, resulting in illnesses among the children and triggering angry protests from their families. The commission has requested local authorities to submit a detailed report, highlighting concerns of human rights violations and ongoing issues of poor food hygiene associated with India's free Mid-Day Meal scheme, a program aimed at encouraging school attendance among disadvantaged children. This incident echoes a tragic 2013 event in Bihar, where 23 children died due to a pesticide-contaminated school meal.",
                "You know it's bad when a food mishandling story in India makes the news.",
                "I wonder what type of illness can a snake pass to you?",
                "Makes me think about all the videos I see in India where they are serving street food that is unrecognizable. I always wonder how people don’t get sick from it.",
                "I hope all the kids will be ok.",
                "[deleted]",
                "Look at your future America",
                "Well thank god that at least it was dead."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "FTC orders Publishers Clearing House to pay $18.5 million to 'misled' customers",
            "external_url": "https://www.denver7.com/us-news/ftc-orders-publishers-clearing-house-to-pay-18-5-million-to-misled-customers",
            "upvotes": 1141,
            "date": "05/01/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/a47c520/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fbd%2F06%2Fdc94342e4e86939bce9af5d003c3%2Fshutterstock-1111363946.jpg",
            "top_comments": [
                "We WERE mislead.\n\nIt was never Ed McMahon after all.",
                "My mom was a victim of this and at one point wanted to keep sending money. I put that to a stop completely, for a while she kept getting inundated with their fucking mail.",
                "Was wondering how they had all that money to give away",
                ">The company, known for its sweepstakes, filed for bankruptcy earlier this year. PCH aired commercials featuring sweepstakes winners receiving giant checks delivered to their homes along with flowers and champagne.\n\nEd McMahon was a spokesperson for American Family Publishers. Publishers Clearing House had the Prize Patrol. It's a common example of the Mandela Effect.",
                "My grandmother has been buying crap from PCH for years… sounds like she might finally get that check she’s been waiting on lol",
                "✉️ FTC, YOU HAVE WON $18.5 MILLION!\n\nJust make sure you call your Claim Manager BEFORE you cash the check...",
                "If you wondered why companies running contests prominently say NO PURCHASE NECESSARY, VOID WHERE PROHIBITED... well this is why.",
                "Does this mean I finally get that thousand dollars a week for life, that i was always 1 step away from winning?\n\n\nOh boy pizza party tonite!",
                "Can they pay the fine with a comically oversized check? I hope so.",
                "Can't wait for a new series of PCH scams telling people they're getting a payout from this decision, and just asking for some up front administrative fees"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "White House national security adviser Waltz to leave post, sources say",
            "external_url": "https://www.reuters.com/world/us/white-house-national-security-adviser-waltz-leave-post-source-says-2025-05-01/",
            "upvotes": 9123,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is this one of the first departures of MAGA2025?",
                "How many mooches long is this?",
                "I wonder if Hegseth understands this makes it more likely that he's fucked, not less. Waltz just got motivated to talk honestly about him.",
                "I wonder if the last 3.5 months for him were worth giving up a safe congressional seat.",
                "Laura Loomer runs National security",
                "how long before Donnie starts trashing them?",
                "“When a clown moves into a palace, he does not become a king, instead the palace becomes a circus”",
                "This MFer is leaving, not because he shared the plans or was using Signal to do it, but because he had that journalist from the Atlantic in his contacts.  It's the same journalist that reported Trump calling the enlisted \"Suckers and Losers\" so Trump HATES that guy.  To see one of his people have his direct contact sent Trump into a paranoid spiral and he would never trust Mike Waltz again.  No coming back for him.",
                "Time for the first wave of MAGA firings so they can write books about their experiences and say, omg it was so awful I’m glad I’m on the right side of history again please buy my book and forgive me!",
                "I think it has something to do with doge getting access to nuke systems, stealing ssn, and providing access to the Russians via ‘unsecure’ means.  I think this is also why musk is ‘stepping back’.  All of this happened around the time those reports and the whistleblower came out.  I’m guessing it’s bad bad."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Quebec to impose full ban on cellphones in schools",
            "external_url": "https://www.cbc.ca/news/canada/montreal/quebec-cell-phone-ban-1.7523543",
            "upvotes": 1613,
            "date": "05/01/2025",
            "thumbnail": "https://i.cbc.ca/1.7299218.1724883221!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/schools-cellphones.jpg?im=Resize%3D620",
            "top_comments": [
                "This seems like a necessary step.",
                "How did phones end up in schools in the first place? We couldn’t even wear hats in school.",
                "Good. This needs to happen, and parents saying they need to be able to contact their kids... Do you not remember how it worked before cell phones? We were all fine. There is rarely a real reason for a cell phone in the classroom. ",
                "Surprised it wasn't implemented much earlier",
                "Cue the shrieking, self-righteous parents who think their kids “need” the phone for “safety” or because it’s “their property” or some other such bullshit.",
                "My child's school had a \"Cell Phone Ban,\" yet almost all kids had cell phones and used them constantly with rarely if any interference by teachers/staff.\n\nI came to realize they fully allowed it since the phones, to an extent, controlled the student's behavior.  The more the students were glued to their phones, the less **overt** trouble they caused and the less overt trouble teachers/staff had to deal with.\n\nBut, it also seemed clear to me that the presence of the phones created much more **covert** trouble and cyberbullying, etc.\n\nBottomline, cell phones are a ubiquitous fact of life, I'd much rather schools embrace that and encourage/enforce thoughtful/mature use of them.  Heck, they can have a role in learning if their use was considered carefully.",
                "As a 90s/2000s kid it boggles my mind even the idea of being able to have a smart phone in class.\n\nHell I had my calculator taken away several times just because it had the Snake game on it.",
                "Seems like a good idea. But good luck with it",
                "Absolutely the way it should be. Smart phones are ruining the world.",
                "The lost art of passing notes is about to make a comeback!"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "SOS: Migrants held in Texas fear notorious El Salvador prison",
            "external_url": "https://www.reuters.com/world/americas/sos-migrants-held-texas-fear-notorious-el-salvador-prison-2025-04-30/",
            "upvotes": 551,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Venezuelan detainees in Texas fear the Trump administration will send them to El Salvador's notorious CECOT maximum security prison.\n\nShhh! Fear is exactly what he wants to hear to validate the deportations.",
                "Reuters can't read, this obviously says \"We are members of MS13 and are bad hombres\" it's all in the symbolism. ( /S because this could be a real take in this moronic world)"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Runaway kangaroo temporarily shuts down highway in Alabama",
            "external_url": "https://www.cnn.com/2025/04/30/us/runaway-kangaroo-shuts-highway-alabama-hnk",
            "upvotes": 243,
            "date": "05/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25119824201576.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Commuters are hopping mad.",
                "Must have escaped from the Supreme Court",
                "Mullets are flying at full staff at the Aussie embassy, somehow wrapping completely around the heads of diplomats to form hair bangs salute.  \n  \nGodspeed Runaway Roo",
                "In Aussie news, that's just another Thursday ",
                "Well, I'm sure people shut it down and not the kangaroo...",
                "Hey meema, lookie thar ya don't see that thar everyday."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Critically ill 9/11 first responders are being turned away from the program meant to save them",
            "external_url": "https://abcnews.go.com/US/critically-ill-911-responders-turned-program-meant-save/story?id=121338021",
            "upvotes": 36323,
            "date": "05/01/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1d68ac5d-43f3-4701-8892-aeb3f5ac40dc/firefighter-helmet-gty-jef-250501_1746117071710_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I feel the need to clarify something. The WTC healthcare program is not just for NYC first responders, it's for anyone who lived and worked within a certain area of the event. Volunteer doctors and nurses came from as far as Canada to help in the immediate aftermath and are now sick. People went back to work and school in the area because the government said it was safe. \n\nANYONE who lived or worked in that area in the following months need to sign up for the healthcare program to be monitored.",
                "Isn't this what they wanted? Traded a 30 min DEI course you had to take for work for tax cuts and no support for healthcare. Great choice!",
                "Sucks that most first responders voted for this. Jon Stewart couldn't save them from themselves. 🤷‍♂️",
                "Republicans hate first responders and veterans; they vote against them an overwhelming majority of the time.",
                ">The program now serves more than 150,000 people nationwide, up from about 76,000 in 2015, according to data from the Centers for Disease Control and Prevention. A bipartisan bill, HR 1410, was introduced in February to close the funding gap as enrollment surged, but it remains stalled in Congress.\n\nHR 1410 was introduced February 18th of this year and was sent to the House Committee on Energy and Commerce. It hasn't moved there since.",
                "Notice how the filthy troglodyte robber barons take and take and say there is not enough to go around? No one needs 100 million dollars, much less 100 billion!",
                "may you live in interesting times \n\nmay you come to the attention of those in authority \n\nmay the gods give you everything you ask for\n\nCongrats firefighters you got all three!",
                "*Jon Stewart didn't like that*",
                "9/11 firefighters are treated far worse than J6ers",
                "Conservatives hate America"
            ],
            "aggregate_sentiment": 67.0
        }
    ],
    "last_updated": "05/01/2025 20:09:41 UTC"
}