{
    "posts": [
        {
            "category": "HOT",
            "title": "Anti-Vaxx Mom Whose Daughter Died From Measles Says Disease 'Wasn't That Bad'",
            "external_url": "https://www.latintimes.com/anti-vaxx-mom-whose-daughter-died-measles-says-disease-wasnt-that-bad-578871",
            "upvotes": 21602,
            "date": "03/21/2025",
            "thumbnail": "https://d.latintimes.com/en/full/571807/measles-texas.jpg",
            "top_comments": [
                ">they argued that if measles patients had access to untested treatments, the MMR vaccines would be entirely unnecessary\n\nOf course we need untested treatments because the tested and safe prevention is the problem.",
                "\"Wasn't that bad\"?\n\nIf dead children isn't that bad, what the fuck *IS* that bad?!",
                "How is this not considered child endangerment and neglect?",
                "When there is scientific proof that a medical treatment can save lives, and you still decide against, you should be held accountable. Regardless of their religious beliefs, these parents killed their child and should be convicted. This was a preventable death.",
                "Had some absolute idiot on another thread arguing that a parents opinion on their child's medical care is as valuable as a doctors and like just no, giving birth does not magically imbue you with extra knowledge or critical thinking skills.",
                "It’s beyond sad when political bias and an almost religious fervor towards conspiracy theory makes you belittle even the death of your own child.\n\nEdit: spelling",
                "# 'Wasn't That Bad'\n\nfor me",
                "God this country fucking sucks right now.",
                "Again, Anti vaxxers don't love their children & should not have them",
                "“parents are all still sitting there saying they would rather have this than the MMR vaccination because they’ve seen so much injury”\n\nThese people are so brainwashed."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Tesla owners are trading in their EVs at record levels, Edmunds says",
            "external_url": "https://www.cnbc.com/2025/03/20/tesla-owners-are-trading-in-their-evs-at-record-levels-edmunds-says.html",
            "upvotes": 6681,
            "date": "03/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108114358-1741726193117-gettyimages-2203994536-AFP_36ZN8YB.jpeg?v=1742510993&w=1920&h=1080",
            "top_comments": [
                "People trading in their Teslas hurts Elon, because even if the brand doesn’t collapse, it’ll be harder to sell new models because the used surplus will be so huge that the prices will collapse fast on new releases, nobody is going to buy a new model on release year when they can just buy the last years model for a portion of the price when the demand sinks that low. \n\nAnd that’s *if* the company manages to persist into the future.",
                "The people I know who bought Teslas were well off yuppies, liberal and who cared about the environment (mean that in the best way possible).  Teslas are not cheap and the people who bought them did so instead of something like a BMW or Range Rover.  I myself was considering one before I went for a BMW.  \n\nTesla was like the Apple brand of the car world. \n\nAnd Elon just antagonized that entire base.  Those same folks are embarrassed by their purchase now. ",
                "I had one of the first 600 Tesla Model Ys. With taxes, etc., it came out to a pretty penny (north of $60k). It was a fun, engaging car and whoo boy that acceleration was bonkers.\n\nThen the reality set in. I kept trying to push through the inconveniences but damned if they didn’t add up quickly. To whit:\n\n1.) A software update meant to improve the positional accuracy of the map bricked - get this - the A/C system. In the summer. It was literally a guessing game whether the A/C would turn on when I got in the car. Persisted for about 3 months before a patch was rolled out.\n\n2.) The vaunted heat pump quit twice, once in winter (as we were moving across the country). Only a threat of litigation got the service center to replace the unit. Replacing it took the service center nearly a week.\n\n3.) A simple windshield replacement was needed after a rock caused a crack that started spreading. I scheduled service (soonest I could get a spot was 4 weeks out) which got delayed an additional whole month because “Our glass guy is sick,” and yet another whole month because “We don’t have glass.”\n\n4.) At 4 years of ownership, it was found that elements of the sub-frame were developing soon-to-be catastrophic cracks. No, I didn’t rally race it. Yes, I was religious about washing road salt off of it in wintertime. The upper control arm bushing was also “shredded” according to Firestone.\n\nAfter #4 happened, I drove to a dealership that literal same day and traded it in.",
                "Tesla served its original purpose:  making EV's more commonplace.  It's time for them to either go away or fix themselves.",
                "I forgot who in particular said it, but some industry person once said that the best indicator of a downturn of a brand is to take a look at the resale numbers. So inventory rise, and how steep the asking price is. You get those two together - and it's not always merely a supply surge issue - there is something in the underlying that there is no recovering from. \n\nGranted, it would be by far in Tesla's own interest to dump Musk, but the problem won't go away until Musk divests entirely. It must be shown that Musk can not benefit from their own successes - especially one that funded Trump directly.",
                "Poorly ran company without leadership or any quality control standards on their products. Actively dangerous auto driver system linked to dozens of deaths. \n\nNo idea why anyone would want to own a Tesla right now. They’re like BlackBerry. They’re product is only popular because it was first, not because it’s the best. ",
                "We traded ours in, it was completely paid off (and was bought before Elon went completely asshole), we originally planned to just keep it because selling it doesn’t do anything to Tesla to get rid of it, since they already had the money.\n\nbut when they charged an outrageous $200 per issue to diagnose and didn’t even fix the issue with the GPS we felt it was time and switched to a different EV.",
                "Yep, my wife and I just traded her model 3 for a Lucid sedan. We would have 100% stayed with Tesla if not for Mr Dyed Hair Plugs Laminated Face.  Anything I can do to bring about his destruction, I am here for.  This is the start of the class wars.  Choose a side.",
                "Even if you aren't a Elon hater, it's quite a liability with people vandalizing the fuck out of them now.",
                "\"Hi there, Honest Don Trump here for Musk Motors, or MAGA motors as I like to call it.\n\nWe've got a fire sale a-brewin' and prices are falling faster than Titanic tickets after the iceberg.\n\nWe're located right off the mall, in front of that big white house where I'm standing.\n\nDid I tell you the dashboard looks real neat?\""
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Russian energy giant Gazprom suffers $13.1 billion loss in 2024",
            "external_url": "https://kyivindependent.com/russian-energy-giant-gazprom-suffers-13-1-billion-loss-in-2024/",
            "upvotes": 1986,
            "date": "03/21/2025",
            "thumbnail": "https://assets.kyivindependent.com/content/images/2024/09/upd_GettyImages-1240297857.jpg",
            "top_comments": [
                "According to Russian accounting standards, which is very telling.\n\nWe'll find out the figure under international accounting standards soon. That will no doubt be even more damning.",
                "Don’t worry, Trump will bail them out soon.",
                "It's nice to hear some good news for once.",
                "More. More. More. Plummet baby plummet.",
                "The financial picture of this giant company is complicated by several factors. One is that it had an increased income tax imposed on it, by Putin to fund his war. Second, it lost money on shares It owns in a subsidiary. Third who knows what is a valid exchange rate of converting ruble losses to dollar losses. The exchange rate is managed and manipulated by the Kremlin. So, it’s hard to know the true pounding Gazprom is taking, other than that it is suffering.",
                "I’m sure Trumplethinskin has a plan to help",
                "That’s some r/upliftingnews!",
                "Gotta pump those numbers up. Those are rookie numbers.",
                "US... Ha! Those are rookie numbers.",
                "Losing the war of attrition."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "American officials closing Canadian access to library in Stanstead, Que.",
            "external_url": "https://www.ctvnews.ca/montreal/article/us-authorities-closing-canadian-access-to-library-that-straddles-quebec-vermont-border/",
            "upvotes": 1235,
            "date": "03/21/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/R3BW4KRUTVCXHIP526PDZDKJXA.jpg?smart=true&auth=a1e503f4b523056772dd554959709a1884b852d7d20a71f6a076bbe4e0aa8630&width=1200&height=630",
            "top_comments": [
                "\"In January, Homeland Security Secretary Kristi Noem visited the library, stepping over the tape on the Canadian side of the building and [referring to Canada as the “51st state” multiple times](https://www.ctvnews.ca/montreal/article/dhs-secretary-kristi-noem-accused-of-referring-to-canada-as-51st-state-at-quebec-vermont-border/), the library’s executive director, Deborah Bishop, told CTV News in an interview earlier this month. \"\n\nThis dog-killing bitch is the fucking worst",
                "Subtle symbolism, it ain’t.",
                "\"It’s not clear why the change was made.\"\n\n\nYeah.  Its clear.  It's because we elected the most defective personality in our public square to the most powerful office in our country and he's on a vengance tour and is using internet meme levels of judgement to hassle people he's got grievances with and will burn down everything to win those \"battles\".",
                "Next there will be a barbed wire fence going through town, guarded 24/7 by heavily armed guards. \n\nThe town used to symbolize the cooperation and peace between our two countries.",
                "Every day since January 20 something happens to chip away at the greatness that used to be the US. Loyalty, relationships, integrity all sucked into the black hole of Trump’s retribution tour and complete focus on money.",
                "they are not closing it DESPITE it being a \"symbol of harmony and cooperation.\" They are closing it BECAUSE it's a symbol of harmony and cooperation",
                "As an American, i am embarrassed by this. Im sorry Canada. 😞",
                "So Canada owns the building, but the entrance is on the US side, am I reading that right?  \n\nSounds like Canada has a chance to have fun with this. Forbid Americans from crossing the tape line, and build open an entrance on their side of the building and continue using their side of the library.  \n\nLooking at the map of that general area, there's several buildings, including some houses, that straddle the line. Canada should forbid Americans from using any part of any of those buildings that's on their land.  \n\nThere's also [this livestock farm ](https://www.google.com/maps/@45.0149476,-72.6728427,118m/)that would probably be unhappy about losing half a field, half a house, and an entire out building of some sort.  \n\nI'm sure there's many more instances along the border they could be petty about.",
                "Lol. The US is a fucking shithole country. Good job America.",
                "The Canadians should bulldoze the half that’s on their side of the border."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "People named in JFK assassination documents are not happy their personal information was released",
            "external_url": "https://apnews.com/article/jfk-assassination-files-personal-information-5609ccd6e106c5b30ee6b6cca3a30e3c",
            "upvotes": 11290,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Interesting that the JFK documents were insufficiently redacted, while the Epstein documents were redacted to the point of uselessness.",
                "The problem is the social security numbers of these living individuals were not redacted.",
                "So the only thing new was that we all know Digenova's SS number. Cool.",
                ">“It should not have happened,” diGenova said in a phone interview Thursday. “I think it’s the result of incompetent people doing the reviewing. I don’t believe it had anything to do with rushing the process. The people who reviewed these documents did not do their job.”\n\nYeah i can definitely see incompetent people involved in this and a lot else going on rn",
                "It's crazy that these people will get new SSNs, meanwhile pretty much every American's SSN has been leaked as part of a data breach at some point recently. It's beyond time for a more modern system. ",
                "So, no new info except for the stuff that was correctly and competently redacted in the past to protect people that absolutely deserved to be shielded from having their private info thrown to the conspiracy theorist wolves.\n\nNo surprise at all to any of that.",
                "Has anything knew or interesting come from this document release? I think it was just red meat to keep people's attention away from the Epstein diaries.",
                "can you imagine having to get a new social security number in yours 70s lol and with the current state of that department under this admin right now",
                "No fucking excuse, release the full unredacted Epstein file at this point.",
                "Lol they're going to help those affected by monitoring their credit.  Thats like a free pizza coupon for finding a hair in your delivered papa John's."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Musk Set to Get Access to Top-Secret U.S. Plan for Potential War With China",
            "external_url": "https://www.nytimes.com/2025/03/20/us/politics/musk-pentagon-briefing-china-war-plan.html?unlocked_article_code=1.5k4.SRAZ.aIZGK_LvUkAE&smid=nytcore-android-share",
            "upvotes": 8946,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is just getting more insane with each new day ….",
                "Just a friendly reminder that Musk has total access to and control of the federal government only because he gave Trump 250 million dollars. This is what extra-national oligarchy looks like. ",
                "Just to hammer home, there is absolutely *no* chance that Elon could pass a background check for clearance because of his drug use.",
                "He really did buy the presidency didn’t he?\n\nThis is pure insanity. Can’t wait for all the conservatives to tell us why it’s great some unelected billionaire is now working with the Pentagon on secret war plans.",
                "What the actual fuck?",
                "God damn, are our military leaders a bunch of spineless fucks too? This is going to get American soldiers fucking **killed**.",
                "Remember when Hillary sent an email from a non-secure server? Yeah I think this is far worse.",
                "the thing i'm shocked about the most, is that each successive outrage is exponentially more shocking and outrageous than the previous high, usually days between.",
                "Why does this un-elected dude get nearly limitless access to the government? It’s crazy.",
                "Such a massive conflict of interest. In addition to Elon Musk’s own business interests in China, his mother, Maye Musk, regularly visits China for business opportunities and advertising, and is an [ambassador to some Chinese mattress company](https://www.nbcnews.com/news/world/china-elon-musk-maye-musk-rcna182118): \n\n“For [Maye] Musk, that means appearing on magazine covers and lots of opportunities to endorse products. She has walked the runway for Chinese apparel brand JNBY and appeared at an event in Shanghai this year for the sportswear brand Fila.\n\nShe is also a global brand ambassador for Chinese mattress brand AISE Baobao, attending a store opening in Shanghai this month, and has appeared in smartphone advertisements for Chinese consumer electronics manufacturer Oppo.”"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "A month-old girl is pulled from the rubble in Gaza after an airstrike killed her parents",
            "external_url": "https://apnews.com/article/gaza-airstrike-baby-girl-rescued-parents-killed-7b0d1daec3dd229c3556182b9ce56e26",
            "upvotes": 2600,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Poor precious little soul deserves so much more than this",
                "You know I don't understand how this shit happens and people don't expect the child to join hamas or another organization when they grow up.",
                "My baby just turned one month this past Tuesday. I couldn’t even imagine. This makes me sick. She and the rest of Gaza deserve better.",
                "We're witnessing a genocide in 2025. Humans ain't shit, we need a reset.",
                "Fuck Benjamin Netanyahu.",
                "Everyone knows this conflict won't be \"won\" militarily.  It never has been.  It never will be.\n\nAnyone who uses the phrase \"Total Victory\" is a devilish liar - or worse.\n\nBombing children living in tents under occupation, no water, no electricity, no sanitation or medical facilities -- makes the COWARDLY criminal perpetrators toxic to the world:\n\nMadness is: preferring to take the blood of caged-in women and children to winning the  safe return of your own surviving citizens.\n\nTrump's \"support\" is Encouragement-By-FELON.  That won't protect ANYONE from criminal responsibility  -- JUST ASK his long list of toadies.\n\nTake a look around.  Trump ONLY supports criminals.  Israel should stop touting his support as some kind of blessing.  It always ends the same for Trump, and this DEVIL's on his way to an even bigger FAILure than last time.",
                "Kinda odd how the \"All Lives Matter!!\" folks dont think Palestinian lives matter.",
                "Only animals punish civilians like this.",
                "I wonder how long until this article is locked or removed because it's anti-Israel.",
                "Don't be fooled! That's a deadly Hamas fighter, I bet that baby has a gun stashed away underneath its clothes!\n\n\n*obvious /s for anyone not understanding the joke*"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Judge bars Musk's DOGE team from Social Security records in scathing ruling",
            "external_url": "https://www.cnbc.com/2025/03/20/judge-bars-musks-doge-team-from-social-security-records.html?utm_source=flipboard&utm_content=user%2FCNBC",
            "upvotes": 50921,
            "date": "03/20/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118453-1742406884122-gettyimages-2205899441-4m7a5252_j0ib0j01.jpeg?v=1742406923&w=1920&h=1080",
            "top_comments": [
                "\"Hollander, noting the affiliates of DOGE have kept their identities hidden, wrote, “ironically, the identity of these DOGE affiliates has been concealed because defendants are concerned that the disclosure of even  their names would expose them to harassment and thus invade their privacy.”\n\nA-fucking-men",
                "*Judge Ellen Lipton Hollander in a* [*scathing ruling*](https://storage.courtlistener.com/recap/gov.uscourts.mdd.577321/gov.uscourts.mdd.577321.49.0.pdf) *accused* [*DOGE*](https://www.cnbc.com/2025/02/07/elon-musk-doge-racist-treasury-x-staff.html) *of launching a “fishing expedition” at the Social Security agency and failing to provide any reason why it needed to access vast swaths of Americans’ personal and private data.*\n\nHurrah!!  She attacked DOGE for insisting on the total secrecy and privacy of their operatives while granting zilch such recognition of the tens of millions personal records they demand access to.",
                "Throw the book at these little mid 20s shits. They shouldn’t be anywhere near the government.",
                "\"Are you tired of winning?\" has turned into \"Can we win once?\"",
                "They don't even have the names of the people who had access to said data. And it's a TRO.",
                "That only works with administrations that follow the law",
                "They're getting ready to start pillaging social security. Lots of grandparents and disabled people are going to get branded frauds so billionaires can upgrade the helipads and moonpools on their yachts",
                "Before someone says “ThEy’lL jUsT iGnOrE the oRdErS” - note that the administration has been forced to follow orders then whined about it.  They aren’t as all powerful as they like to portray they are \n\nThey know while republicans are feckless and have placed their balls squarely in President Elon’s hands for safe keeping - they can only be pushed so far. \n\nThere’s a lot do resist. A lot of nonsense this administration is doing to enrich themselves and a lot of cleanup we have to do. \n\nCelebrate the win. Highlight if and when the administration ignores the law and keep fighting.\n\nEdit: added some clarifying text.",
                "Social Security is sacred grounds. They’ve already stopped phone support which will create havoc for the elderly. Touching benefits will be the poison pill that may finally cure the cancer running throughout the current administration. I hope but not holding my breath.",
                "So what happens when he ignores the law?  So far, no one has been held accountable for their illegal activities. \n\nWho actually stops this madness?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Trump signs executive order to dismantle the Education Department",
            "external_url": "https://www.nbcnews.com/politics/white-house/trump-signs-executive-order-dismantle-education-department-white-house-rcna197251",
            "upvotes": 37771,
            "date": "03/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250320-donald-trump-linda-mcmahon-vl-1056a-273d79.jpg",
            "top_comments": [
                "(He technically cannot do this but that hasn’t stopped him yet)",
                "I didn't realize the president could just run the nation with executive orders",
                "I remember when the right were outraged by Obama’s executive orders so much so that they began referring to him as Chairman Obama. \n\nAnd what do you hear now? Crickets.",
                "The senators and the states THINK they will still get funding for education things but with no federal department telling em how to spend it. I somehow doubt it",
                "They want your children working.",
                "Educated populace is difficult to manipulate.",
                "Very sad day for America.  Trump can't do much without Congress here, but Republicans seem to be pretty much on board with closing the whole thing down.\n\nI wonder if they realize that school curriculum is already controlled at a state level?",
                "Speed running societal collapse to *own the libs*",
                "[removed]",
                "Apr 3, 2016 — We won with poorly educated. “I love the poorly educated,” the Republican presidential front-runner boasted after coasting to a decisive victory."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Halifax musicians say U.S. traffic stop led to drug search, questions about allegiance",
            "external_url": "https://www.cbc.ca/news/canada/nova-scotia/halifax-musicians-pulled-over-asked-canada-or-us-1.7488950",
            "upvotes": 762,
            "date": "03/21/2025",
            "thumbnail": "https://i.cbc.ca/1.7489337.1742511045!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/cassie-and-maggie-macdonald.jpg?im=Resize%3D620",
            "top_comments": [
                "As an Asian man living in Ohio, if two white ladies are not safe from cops, I feel like I need to look for a way out of Ohio",
                "I'm an American and have to tell you this makes me not want to travel in my own country.",
                "I’m right in noticing we’re regularly getting headlines that would be considered bugfuck insane even 10 years ago right?",
                "The USA is no longer safe to visit for anyone.",
                "Canadians should not be going to the US, it's in the process of becoming a fascist nation. The next time you go you could find yourself disappeared, I'm only exaggerating a little.",
                "The world is quickly discovering that these United States of ‘Murica are indeed a shithole country to be avoided at all costs",
                "From other sources these were two officers from the Guernsey County Sheriff Department. I’ve been in Ohio my whole life and I had to look that one up, far south East area. Total population less than 40k. \n\nThe south East portion of the state has a particular…. Reputation let’s just say. It might as well be the Deep South. It’s a small county as well, 40k people is nothing so almost all rural demographics.\n\nThe sheriff system is deeply flawed as they are elected at the county level and more or less only accountable to the voters at election time. There’s little institutional force to hold them accountable to any standard and stories of sheriff department abuses are so common it borders on cliche. \n\nSo we have a sheriffs department in a deeply conservative and rural area, accountable to almost no one, parroting myths about drugs coming over the border from Canada and harassing two well meaning talented artists. \n\nThis is another despicable slide into fascism but I can’t say I’m surprised in the least. This story has all of the elements for this outcome. ",
                "It's a good thing that the US is not about to host a massively popular global even in the near future... 😭",
                "“What do you prefer, America or Canada?”\n\nWhat on earth?!",
                "Explains why other countries are now issuing travel warnings for their citizens visiting America. Come on. FOR VISITING AMERICA? How has it gotten this bad so quickly?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "London’s Heathrow Airport is closed, prompting global travel chaos",
            "external_url": "https://www.cnn.com/world/live-news/london-heathrow-airport-shut-intl-hnk-03-21-25/index.html",
            "upvotes": 102,
            "date": "03/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-03-21t080520z-1615615805-rc2khdatlp1b-rtrmadp-3-britain-heathrow-power-outage.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“London’s Heathrow Airport is completely shut down today because of a power outage due to a large fire nearby, causing massive disruption at one of the world’s busiest travel hubs. The fire is now under control, but Heathrow’s backup power supply was also affected”",
                "Are flights being rerouted to Manchester or?? What's the protocol here",
                "I’m stuck in London currently. Quite a situation to wake up to on what was meant to be my last day in the city, you can imagine\n\nI’m with a university group and we’ve had to contact our school president and everything. Crazy situation. Wasn’t on our bingo cards of “stuff that could go wrong”",
                "Start launching drones at Moscow and St Petersburg.",
                "Its a main artery for global  travelling and ripple affects will be worldwide .",
                "Doesn't take much, apparently, to cause \"global travel chaos\". Who would've thought? sigh"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "West Virginia couple sentenced to maximum of decades in prison for abusing adopted children",
            "external_url": "https://apnews.com/article/west-virginia-forced-labor-children-neglect-72e0bc45c85ed7dcce3fd55379e9843a",
            "upvotes": 167,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"The couple, who are white, adopted the five Black siblings while living in Minnesota\"\n\n.... guess they wanted black slaves uh.....  so disgusting.\n\n\"the couple blamed their real estate agent “for not finding a place isolated enough,”\"\n\nWell that's creepy.",
                " The missing part of that headline is “BLACK” adopted children. They felt that enslaving their adopted black children was ok to do.",
                "wait wait wait... were they drag queens? no? *really*? hmmph\n\nr/StillNotADragQueen",
                "Adopted children should still have a social worker and welfare checks especially if home schooled.\nLaws need to be changed asap.",
                "It’s so sad what people do to children",
                "[removed]",
                "When you realize sex trafficking and abuse is mostly done by people the children (victims) know, and not some boogeyman illegal immigrant sex trafficker, it changes your entire perspective on how we should be fighting child abuse in America.",
                "I’m praying I’m just cooked with cynicism, but watch the orange devil pardon these fuckers after screams from the MAGA crowd."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Former sound engineer charged with stealing, selling unreleased music from Eminem",
            "external_url": "https://www.denver7.com/us-news/crime/former-sound-engineer-charged-with-stealing-selling-unreleased-music-from-eminem#google_vignette",
            "upvotes": 234,
            "date": "03/21/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/d52aa4f/2147483647/strip/true/crop/5616x2948+0+398/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F37%2Fe2%2Fc0bf64ae4b9fb324c2f54b0b4915%2Fap24277714088157.jpg",
            "top_comments": [
                "Eminem doesn't have to steal music to make money.  Well I do!",
                "To get that far in a career and work for someone of that calibre only to steal……",
                "Fun fact, back in the day of Napster/kazaa eminem would use stuff like tampon boxes to put his unreleased music into to transport it. It turned out it was people at the cd manufacturers that were stealing his unreleased music and uploading it before street date.",
                "The Suge Knight diss goes hard",
                "This is 100% my favorite part of the article \n\n>Prosecutors say that Strange allegedly stole unreleased music created by Eminem — whose real name is Marshall Mathers —",
                "How would he possibly think he was going to get away with it?",
                "where is he selling the unreleased music, so i know where not to go",
                "I should probably listen and judge for myself",
                "Times up, it’s over now!",
                "Music is a bit of a stretch."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "American officials closing Canadian access to library in Stanstead, Que.",
            "external_url": "https://www.ctvnews.ca/montreal/article/us-authorities-closing-canadian-access-to-library-that-straddles-quebec-vermont-border/",
            "upvotes": 1230,
            "date": "03/21/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/R3BW4KRUTVCXHIP526PDZDKJXA.jpg?smart=true&auth=a1e503f4b523056772dd554959709a1884b852d7d20a71f6a076bbe4e0aa8630&width=1200&height=630",
            "top_comments": [
                "\"In January, Homeland Security Secretary Kristi Noem visited the library, stepping over the tape on the Canadian side of the building and [referring to Canada as the “51st state” multiple times](https://www.ctvnews.ca/montreal/article/dhs-secretary-kristi-noem-accused-of-referring-to-canada-as-51st-state-at-quebec-vermont-border/), the library’s executive director, Deborah Bishop, told CTV News in an interview earlier this month. \"\n\nThis dog-killing bitch is the fucking worst",
                "Subtle symbolism, it ain’t.",
                "\"It’s not clear why the change was made.\"\n\n\nYeah.  Its clear.  It's because we elected the most defective personality in our public square to the most powerful office in our country and he's on a vengance tour and is using internet meme levels of judgement to hassle people he's got grievances with and will burn down everything to win those \"battles\".",
                "Next there will be a barbed wire fence going through town, guarded 24/7 by heavily armed guards. \n\nThe town used to symbolize the cooperation and peace between our two countries.",
                "Every day since January 20 something happens to chip away at the greatness that used to be the US. Loyalty, relationships, integrity all sucked into the black hole of Trump’s retribution tour and complete focus on money.",
                "they are not closing it DESPITE it being a \"symbol of harmony and cooperation.\" They are closing it BECAUSE it's a symbol of harmony and cooperation",
                "As an American, i am embarrassed by this. Im sorry Canada. 😞",
                "So Canada owns the building, but the entrance is on the US side, am I reading that right?  \n\nSounds like Canada has a chance to have fun with this. Forbid Americans from crossing the tape line, and build open an entrance on their side of the building and continue using their side of the library.  \n\nLooking at the map of that general area, there's several buildings, including some houses, that straddle the line. Canada should forbid Americans from using any part of any of those buildings that's on their land.  \n\nThere's also [this livestock farm ](https://www.google.com/maps/@45.0149476,-72.6728427,118m/)that would probably be unhappy about losing half a field, half a house, and an entire out building of some sort.  \n\nI'm sure there's many more instances along the border they could be petty about.",
                "Lol. The US is a fucking shithole country. Good job America.",
                "The Canadians should bulldoze the half that’s on their side of the border."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Russian energy giant Gazprom suffers $13.1 billion loss in 2024",
            "external_url": "https://kyivindependent.com/russian-energy-giant-gazprom-suffers-13-1-billion-loss-in-2024/",
            "upvotes": 1983,
            "date": "03/21/2025",
            "thumbnail": "https://assets.kyivindependent.com/content/images/2024/09/upd_GettyImages-1240297857.jpg",
            "top_comments": [
                "According to Russian accounting standards, which is very telling.\n\nWe'll find out the figure under international accounting standards soon. That will no doubt be even more damning.",
                "Don’t worry, Trump will bail them out soon.",
                "It's nice to hear some good news for once.",
                "More. More. More. Plummet baby plummet.",
                "The financial picture of this giant company is complicated by several factors. One is that it had an increased income tax imposed on it, by Putin to fund his war. Second, it lost money on shares It owns in a subsidiary. Third who knows what is a valid exchange rate of converting ruble losses to dollar losses. The exchange rate is managed and manipulated by the Kremlin. So, it’s hard to know the true pounding Gazprom is taking, other than that it is suffering.",
                "I’m sure Trumplethinskin has a plan to help",
                "That’s some r/upliftingnews!",
                "Gotta pump those numbers up. Those are rookie numbers.",
                "US... Ha! Those are rookie numbers.",
                "Losing the war of attrition."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Tesla owners are trading in their EVs at record levels, Edmunds says",
            "external_url": "https://www.cnbc.com/2025/03/20/tesla-owners-are-trading-in-their-evs-at-record-levels-edmunds-says.html",
            "upvotes": 6679,
            "date": "03/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108114358-1741726193117-gettyimages-2203994536-AFP_36ZN8YB.jpeg?v=1742510993&w=1920&h=1080",
            "top_comments": [
                "People trading in their Teslas hurts Elon, because even if the brand doesn’t collapse, it’ll be harder to sell new models because the used surplus will be so huge that the prices will collapse fast on new releases, nobody is going to buy a new model on release year when they can just buy the last years model for a portion of the price when the demand sinks that low. \n\nAnd that’s *if* the company manages to persist into the future.",
                "The people I know who bought Teslas were well off yuppies, liberal and who cared about the environment (mean that in the best way possible).  Teslas are not cheap and the people who bought them did so instead of something like a BMW or Range Rover.  I myself was considering one before I went for a BMW.  \n\nTesla was like the Apple brand of the car world. \n\nAnd Elon just antagonized that entire base.  Those same folks are embarrassed by their purchase now. ",
                "I had one of the first 600 Tesla Model Ys. With taxes, etc., it came out to a pretty penny (north of $60k). It was a fun, engaging car and whoo boy that acceleration was bonkers.\n\nThen the reality set in. I kept trying to push through the inconveniences but damned if they didn’t add up quickly. To whit:\n\n1.) A software update meant to improve the positional accuracy of the map bricked - get this - the A/C system. In the summer. It was literally a guessing game whether the A/C would turn on when I got in the car. Persisted for about 3 months before a patch was rolled out.\n\n2.) The vaunted heat pump quit twice, once in winter (as we were moving across the country). Only a threat of litigation got the service center to replace the unit. Replacing it took the service center nearly a week.\n\n3.) A simple windshield replacement was needed after a rock caused a crack that started spreading. I scheduled service (soonest I could get a spot was 4 weeks out) which got delayed an additional whole month because “Our glass guy is sick,” and yet another whole month because “We don’t have glass.”\n\n4.) At 4 years of ownership, it was found that elements of the sub-frame were developing soon-to-be catastrophic cracks. No, I didn’t rally race it. Yes, I was religious about washing road salt off of it in wintertime. The upper control arm bushing was also “shredded” according to Firestone.\n\nAfter #4 happened, I drove to a dealership that literal same day and traded it in.",
                "Tesla served its original purpose:  making EV's more commonplace.  It's time for them to either go away or fix themselves.",
                "I forgot who in particular said it, but some industry person once said that the best indicator of a downturn of a brand is to take a look at the resale numbers. So inventory rise, and how steep the asking price is. You get those two together - and it's not always merely a supply surge issue - there is something in the underlying that there is no recovering from. \n\nGranted, it would be by far in Tesla's own interest to dump Musk, but the problem won't go away until Musk divests entirely. It must be shown that Musk can not benefit from their own successes - especially one that funded Trump directly.",
                "Poorly ran company without leadership or any quality control standards on their products. Actively dangerous auto driver system linked to dozens of deaths. \n\nNo idea why anyone would want to own a Tesla right now. They’re like BlackBerry. They’re product is only popular because it was first, not because it’s the best. ",
                "We traded ours in, it was completely paid off (and was bought before Elon went completely asshole), we originally planned to just keep it because selling it doesn’t do anything to Tesla to get rid of it, since they already had the money.\n\nbut when they charged an outrageous $200 per issue to diagnose and didn’t even fix the issue with the GPS we felt it was time and switched to a different EV.",
                "Yep, my wife and I just traded her model 3 for a Lucid sedan. We would have 100% stayed with Tesla if not for Mr Dyed Hair Plugs Laminated Face.  Anything I can do to bring about his destruction, I am here for.  This is the start of the class wars.  Choose a side.",
                "Even if you aren't a Elon hater, it's quite a liability with people vandalizing the fuck out of them now.",
                "\"Hi there, Honest Don Trump here for Musk Motors, or MAGA motors as I like to call it.\n\nWe've got a fire sale a-brewin' and prices are falling faster than Titanic tickets after the iceberg.\n\nWe're located right off the mall, in front of that big white house where I'm standing.\n\nDid I tell you the dashboard looks real neat?\""
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Germany votes for historic boost to defence and infrastructure spending",
            "external_url": "https://www.bbc.com/news/articles/c62z6gljv2yo",
            "upvotes": 361,
            "date": "03/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0b1b/live/350d13d0-0411-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "Its incredible how in WW3, Germany will be the good guys. How the turntables.",
                "Just needs the presidents signature now. (In theory he can deny it if he sees grounds for a violation of the constitution)",
                "... please don't let the afd win the next election. We finally have a chance to let the German army become the best in the world AND be the good guys. I can't handle germany joining the axis with the US this time.",
                "Good for them. With the US becoming the enemy of the world they are probably going to need it.",
                "That's  what you have to do  if you want to stay free. If you build it up big enough  the bullies always think  twice  cause they don't  want to get  hurt.  Bullies , Putin and Trump, will terrorize  weaklings. Fight the good fight Germany 🇩🇪 🇨🇦🇺🇦",
                "That's an interesting choice of picture heading the article.",
                "Well done America. Push Germany of all countries to massively boost their defense spending, and send your agent provocateurs overseas to help the far right win in German politics....",
                "The real story will be … will Germany help defend Poland when Russia invades it next year",
                "So when are all of these countries going to boot the US military bases out? It’s been a thing for so long but even as an American, when I step back and look at it, it’s odd. In the US they would never put up with foreign bases on US soil . . . well, except for maybe Russian bases soon. I should go rewatch Red Dawn.",
                "A heavily armed united Germany in a time of increasing right wing nationalism, what could possibly go wrong??"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Anti-Vaxx Mom Whose Daughter Died From Measles Says Disease 'Wasn't That Bad'",
            "external_url": "https://www.latintimes.com/anti-vaxx-mom-whose-daughter-died-measles-says-disease-wasnt-that-bad-578871",
            "upvotes": 21603,
            "date": "03/21/2025",
            "thumbnail": "https://d.latintimes.com/en/full/571807/measles-texas.jpg",
            "top_comments": [
                ">they argued that if measles patients had access to untested treatments, the MMR vaccines would be entirely unnecessary\n\nOf course we need untested treatments because the tested and safe prevention is the problem.",
                "\"Wasn't that bad\"?\n\nIf dead children isn't that bad, what the fuck *IS* that bad?!",
                "How is this not considered child endangerment and neglect?",
                "When there is scientific proof that a medical treatment can save lives, and you still decide against, you should be held accountable. Regardless of their religious beliefs, these parents killed their child and should be convicted. This was a preventable death.",
                "Had some absolute idiot on another thread arguing that a parents opinion on their child's medical care is as valuable as a doctors and like just no, giving birth does not magically imbue you with extra knowledge or critical thinking skills.",
                "It’s beyond sad when political bias and an almost religious fervor towards conspiracy theory makes you belittle even the death of your own child.\n\nEdit: spelling",
                "# 'Wasn't That Bad'\n\nfor me",
                "God this country fucking sucks right now.",
                "Again, Anti vaxxers don't love their children & should not have them",
                "“parents are all still sitting there saying they would rather have this than the MMR vaccination because they’ve seen so much injury”\n\nThese people are so brainwashed."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Halifax musicians say U.S. traffic stop led to drug search, questions about allegiance",
            "external_url": "https://www.cbc.ca/news/canada/nova-scotia/halifax-musicians-pulled-over-asked-canada-or-us-1.7488950",
            "upvotes": 762,
            "date": "03/21/2025",
            "thumbnail": "https://i.cbc.ca/1.7489337.1742511045!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/cassie-and-maggie-macdonald.jpg?im=Resize%3D620",
            "top_comments": [
                "As an Asian man living in Ohio, if two white ladies are not safe from cops, I feel like I need to look for a way out of Ohio",
                "I'm an American and have to tell you this makes me not want to travel in my own country.",
                "I’m right in noticing we’re regularly getting headlines that would be considered bugfuck insane even 10 years ago right?",
                "The USA is no longer safe to visit for anyone.",
                "Canadians should not be going to the US, it's in the process of becoming a fascist nation. The next time you go you could find yourself disappeared, I'm only exaggerating a little.",
                "The world is quickly discovering that these United States of ‘Murica are indeed a shithole country to be avoided at all costs",
                "From other sources these were two officers from the Guernsey County Sheriff Department. I’ve been in Ohio my whole life and I had to look that one up, far south East area. Total population less than 40k. \n\nThe south East portion of the state has a particular…. Reputation let’s just say. It might as well be the Deep South. It’s a small county as well, 40k people is nothing so almost all rural demographics.\n\nThe sheriff system is deeply flawed as they are elected at the county level and more or less only accountable to the voters at election time. There’s little institutional force to hold them accountable to any standard and stories of sheriff department abuses are so common it borders on cliche. \n\nSo we have a sheriffs department in a deeply conservative and rural area, accountable to almost no one, parroting myths about drugs coming over the border from Canada and harassing two well meaning talented artists. \n\nThis is another despicable slide into fascism but I can’t say I’m surprised in the least. This story has all of the elements for this outcome. ",
                "It's a good thing that the US is not about to host a massively popular global even in the near future... 😭",
                "“What do you prefer, America or Canada?”\n\nWhat on earth?!",
                "Explains why other countries are now issuing travel warnings for their citizens visiting America. Come on. FOR VISITING AMERICA? How has it gotten this bad so quickly?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Boy accused of killing elderly man while girl filmed attack ‘can’t keep track’ of murder trial lies, court hears",
            "external_url": "https://news.sky.com/story/boy-accused-of-killing-elderly-man-while-girl-filmed-attack-cant-keep-track-of-murder-trial-lies-court-hears-13332698",
            "upvotes": 294,
            "date": "03/21/2025",
            "thumbnail": "https://e3.365dm.com/25/02/1600x900/skynews-bhim-kohli-leicester_6842418.jpg?20250228162305",
            "top_comments": [
                "What the heck is a “slider”?   The article mentions the man being struck with a slider. But I am unfamiliar with this usage/definition.",
                "He's gonna be wearing some sliders in lockup",
                "You can kill someone with sandals/shower shoes? Maybe if it's an upgraded Chancla in the right hands, preferably wielded by a mother/grandmother.",
                "A space and three more letters would have made that obnoxiously long headline intelligible:\n\nBoy accused of killing elderly man while girl filmed attack 'can't keep track' of *HIS* murder trial lies, court hears\n\nStill would have been obnoxiously long, of course, but it would have at least made sense.\n\n#"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Russian energy giant Gazprom suffers $13.1 billion loss in 2024",
            "external_url": "https://kyivindependent.com/russian-energy-giant-gazprom-suffers-13-1-billion-loss-in-2024/",
            "upvotes": 1986,
            "date": "03/21/2025",
            "thumbnail": "https://assets.kyivindependent.com/content/images/2024/09/upd_GettyImages-1240297857.jpg",
            "top_comments": [
                "According to Russian accounting standards, which is very telling.\n\nWe'll find out the figure under international accounting standards soon. That will no doubt be even more damning.",
                "Don’t worry, Trump will bail them out soon.",
                "It's nice to hear some good news for once.",
                "More. More. More. Plummet baby plummet.",
                "The financial picture of this giant company is complicated by several factors. One is that it had an increased income tax imposed on it, by Putin to fund his war. Second, it lost money on shares It owns in a subsidiary. Third who knows what is a valid exchange rate of converting ruble losses to dollar losses. The exchange rate is managed and manipulated by the Kremlin. So, it’s hard to know the true pounding Gazprom is taking, other than that it is suffering.",
                "I’m sure Trumplethinskin has a plan to help",
                "That’s some r/upliftingnews!",
                "Gotta pump those numbers up. Those are rookie numbers.",
                "US... Ha! Those are rookie numbers.",
                "Losing the war of attrition."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "Tesla owners are trading in their EVs at record levels, Edmunds says",
            "external_url": "https://www.cnbc.com/2025/03/20/tesla-owners-are-trading-in-their-evs-at-record-levels-edmunds-says.html",
            "upvotes": 6677,
            "date": "03/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108114358-1741726193117-gettyimages-2203994536-AFP_36ZN8YB.jpeg?v=1742510993&w=1920&h=1080",
            "top_comments": [
                "People trading in their Teslas hurts Elon, because even if the brand doesn’t collapse, it’ll be harder to sell new models because the used surplus will be so huge that the prices will collapse fast on new releases, nobody is going to buy a new model on release year when they can just buy the last years model for a portion of the price when the demand sinks that low. \n\nAnd that’s *if* the company manages to persist into the future.",
                "The people I know who bought Teslas were well off yuppies, liberal and who cared about the environment (mean that in the best way possible).  Teslas are not cheap and the people who bought them did so instead of something like a BMW or Range Rover.  I myself was considering one before I went for a BMW.  \n\nTesla was like the Apple brand of the car world. \n\nAnd Elon just antagonized that entire base.  Those same folks are embarrassed by their purchase now. ",
                "I had one of the first 600 Tesla Model Ys. With taxes, etc., it came out to a pretty penny (north of $60k). It was a fun, engaging car and whoo boy that acceleration was bonkers.\n\nThen the reality set in. I kept trying to push through the inconveniences but damned if they didn’t add up quickly. To whit:\n\n1.) A software update meant to improve the positional accuracy of the map bricked - get this - the A/C system. In the summer. It was literally a guessing game whether the A/C would turn on when I got in the car. Persisted for about 3 months before a patch was rolled out.\n\n2.) The vaunted heat pump quit twice, once in winter (as we were moving across the country). Only a threat of litigation got the service center to replace the unit. Replacing it took the service center nearly a week.\n\n3.) A simple windshield replacement was needed after a rock caused a crack that started spreading. I scheduled service (soonest I could get a spot was 4 weeks out) which got delayed an additional whole month because “Our glass guy is sick,” and yet another whole month because “We don’t have glass.”\n\n4.) At 4 years of ownership, it was found that elements of the sub-frame were developing soon-to-be catastrophic cracks. No, I didn’t rally race it. Yes, I was religious about washing road salt off of it in wintertime. The upper control arm bushing was also “shredded” according to Firestone.\n\nAfter #4 happened, I drove to a dealership that literal same day and traded it in.",
                "Tesla served its original purpose:  making EV's more commonplace.  It's time for them to either go away or fix themselves.",
                "I forgot who in particular said it, but some industry person once said that the best indicator of a downturn of a brand is to take a look at the resale numbers. So inventory rise, and how steep the asking price is. You get those two together - and it's not always merely a supply surge issue - there is something in the underlying that there is no recovering from. \n\nGranted, it would be by far in Tesla's own interest to dump Musk, but the problem won't go away until Musk divests entirely. It must be shown that Musk can not benefit from their own successes - especially one that funded Trump directly.",
                "Poorly ran company without leadership or any quality control standards on their products. Actively dangerous auto driver system linked to dozens of deaths. \n\nNo idea why anyone would want to own a Tesla right now. They’re like BlackBerry. They’re product is only popular because it was first, not because it’s the best. ",
                "We traded ours in, it was completely paid off (and was bought before Elon went completely asshole), we originally planned to just keep it because selling it doesn’t do anything to Tesla to get rid of it, since they already had the money.\n\nbut when they charged an outrageous $200 per issue to diagnose and didn’t even fix the issue with the GPS we felt it was time and switched to a different EV.",
                "Yep, my wife and I just traded her model 3 for a Lucid sedan. We would have 100% stayed with Tesla if not for Mr Dyed Hair Plugs Laminated Face.  Anything I can do to bring about his destruction, I am here for.  This is the start of the class wars.  Choose a side.",
                "Even if you aren't a Elon hater, it's quite a liability with people vandalizing the fuck out of them now.",
                "\"Hi there, Honest Don Trump here for Musk Motors, or MAGA motors as I like to call it.\n\nWe've got a fire sale a-brewin' and prices are falling faster than Titanic tickets after the iceberg.\n\nWe're located right off the mall, in front of that big white house where I'm standing.\n\nDid I tell you the dashboard looks real neat?\""
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Former sound engineer charged with stealing, selling unreleased music from Eminem",
            "external_url": "https://www.denver7.com/us-news/crime/former-sound-engineer-charged-with-stealing-selling-unreleased-music-from-eminem#google_vignette",
            "upvotes": 232,
            "date": "03/21/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/d52aa4f/2147483647/strip/true/crop/5616x2948+0+398/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F37%2Fe2%2Fc0bf64ae4b9fb324c2f54b0b4915%2Fap24277714088157.jpg",
            "top_comments": [
                "Eminem doesn't have to steal music to make money.  Well I do!",
                "To get that far in a career and work for someone of that calibre only to steal……",
                "Fun fact, back in the day of Napster/kazaa eminem would use stuff like tampon boxes to put his unreleased music into to transport it. It turned out it was people at the cd manufacturers that were stealing his unreleased music and uploading it before street date.",
                "The Suge Knight diss goes hard",
                "This is 100% my favorite part of the article \n\n>Prosecutors say that Strange allegedly stole unreleased music created by Eminem — whose real name is Marshall Mathers —",
                "How would he possibly think he was going to get away with it?",
                "where is he selling the unreleased music, so i know where not to go",
                "I should probably listen and judge for myself",
                "Times up, it’s over now!",
                "Music is a bit of a stretch."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "American officials closing Canadian access to library in Stanstead, Que.",
            "external_url": "https://www.ctvnews.ca/montreal/article/us-authorities-closing-canadian-access-to-library-that-straddles-quebec-vermont-border/",
            "upvotes": 1230,
            "date": "03/21/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/R3BW4KRUTVCXHIP526PDZDKJXA.jpg?smart=true&auth=a1e503f4b523056772dd554959709a1884b852d7d20a71f6a076bbe4e0aa8630&width=1200&height=630",
            "top_comments": [
                "\"In January, Homeland Security Secretary Kristi Noem visited the library, stepping over the tape on the Canadian side of the building and [referring to Canada as the “51st state” multiple times](https://www.ctvnews.ca/montreal/article/dhs-secretary-kristi-noem-accused-of-referring-to-canada-as-51st-state-at-quebec-vermont-border/), the library’s executive director, Deborah Bishop, told CTV News in an interview earlier this month. \"\n\nThis dog-killing bitch is the fucking worst",
                "Subtle symbolism, it ain’t.",
                "\"It’s not clear why the change was made.\"\n\n\nYeah.  Its clear.  It's because we elected the most defective personality in our public square to the most powerful office in our country and he's on a vengance tour and is using internet meme levels of judgement to hassle people he's got grievances with and will burn down everything to win those \"battles\".",
                "Next there will be a barbed wire fence going through town, guarded 24/7 by heavily armed guards. \n\nThe town used to symbolize the cooperation and peace between our two countries.",
                "Every day since January 20 something happens to chip away at the greatness that used to be the US. Loyalty, relationships, integrity all sucked into the black hole of Trump’s retribution tour and complete focus on money.",
                "they are not closing it DESPITE it being a \"symbol of harmony and cooperation.\" They are closing it BECAUSE it's a symbol of harmony and cooperation",
                "As an American, i am embarrassed by this. Im sorry Canada. 😞",
                "So Canada owns the building, but the entrance is on the US side, am I reading that right?  \n\nSounds like Canada has a chance to have fun with this. Forbid Americans from crossing the tape line, and build open an entrance on their side of the building and continue using their side of the library.  \n\nLooking at the map of that general area, there's several buildings, including some houses, that straddle the line. Canada should forbid Americans from using any part of any of those buildings that's on their land.  \n\nThere's also [this livestock farm ](https://www.google.com/maps/@45.0149476,-72.6728427,118m/)that would probably be unhappy about losing half a field, half a house, and an entire out building of some sort.  \n\nI'm sure there's many more instances along the border they could be petty about.",
                "Lol. The US is a fucking shithole country. Good job America.",
                "The Canadians should bulldoze the half that’s on their side of the border."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Germany votes for historic boost to defence and infrastructure spending",
            "external_url": "https://www.bbc.com/news/articles/c62z6gljv2yo",
            "upvotes": 356,
            "date": "03/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0b1b/live/350d13d0-0411-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "Its incredible how in WW3, Germany will be the good guys. How the turntables.",
                "Just needs the presidents signature now. (In theory he can deny it if he sees grounds for a violation of the constitution)",
                "... please don't let the afd win the next election. We finally have a chance to let the German army become the best in the world AND be the good guys. I can't handle germany joining the axis with the US this time.",
                "Good for them. With the US becoming the enemy of the world they are probably going to need it.",
                "That's  what you have to do  if you want to stay free. If you build it up big enough  the bullies always think  twice  cause they don't  want to get  hurt.  Bullies , Putin and Trump, will terrorize  weaklings. Fight the good fight Germany 🇩🇪 🇨🇦🇺🇦",
                "That's an interesting choice of picture heading the article.",
                "Well done America. Push Germany of all countries to massively boost their defense spending, and send your agent provocateurs overseas to help the far right win in German politics....",
                "The real story will be … will Germany help defend Poland when Russia invades it next year",
                "So when are all of these countries going to boot the US military bases out? It’s been a thing for so long but even as an American, when I step back and look at it, it’s odd. In the US they would never put up with foreign bases on US soil . . . well, except for maybe Russian bases soon. I should go rewatch Red Dawn.",
                "A heavily armed united Germany in a time of increasing right wing nationalism, what could possibly go wrong??"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Anti-Vaxx Mom Whose Daughter Died From Measles Says Disease 'Wasn't That Bad'",
            "external_url": "https://www.latintimes.com/anti-vaxx-mom-whose-daughter-died-measles-says-disease-wasnt-that-bad-578871",
            "upvotes": 21604,
            "date": "03/21/2025",
            "thumbnail": "https://d.latintimes.com/en/full/571807/measles-texas.jpg",
            "top_comments": [
                ">they argued that if measles patients had access to untested treatments, the MMR vaccines would be entirely unnecessary\n\nOf course we need untested treatments because the tested and safe prevention is the problem.",
                "\"Wasn't that bad\"?\n\nIf dead children isn't that bad, what the fuck *IS* that bad?!",
                "How is this not considered child endangerment and neglect?",
                "When there is scientific proof that a medical treatment can save lives, and you still decide against, you should be held accountable. Regardless of their religious beliefs, these parents killed their child and should be convicted. This was a preventable death.",
                "Had some absolute idiot on another thread arguing that a parents opinion on their child's medical care is as valuable as a doctors and like just no, giving birth does not magically imbue you with extra knowledge or critical thinking skills.",
                "It’s beyond sad when political bias and an almost religious fervor towards conspiracy theory makes you belittle even the death of your own child.\n\nEdit: spelling",
                "# 'Wasn't That Bad'\n\nfor me",
                "God this country fucking sucks right now.",
                "Again, Anti vaxxers don't love their children & should not have them",
                "“parents are all still sitting there saying they would rather have this than the MMR vaccination because they’ve seen so much injury”\n\nThese people are so brainwashed."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "RISING",
            "title": "A month-old girl is pulled from the rubble in Gaza after an airstrike killed her parents",
            "external_url": "https://apnews.com/article/gaza-airstrike-baby-girl-rescued-parents-killed-7b0d1daec3dd229c3556182b9ce56e26",
            "upvotes": 2602,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Poor precious little soul deserves so much more than this",
                "You know I don't understand how this shit happens and people don't expect the child to join hamas or another organization when they grow up.",
                "My baby just turned one month this past Tuesday. I couldn’t even imagine. This makes me sick. She and the rest of Gaza deserve better.",
                "We're witnessing a genocide in 2025. Humans ain't shit, we need a reset.",
                "Fuck Benjamin Netanyahu.",
                "Everyone knows this conflict won't be \"won\" militarily.  It never has been.  It never will be.\n\nAnyone who uses the phrase \"Total Victory\" is a devilish liar - or worse.\n\nBombing children living in tents under occupation, no water, no electricity, no sanitation or medical facilities -- makes the COWARDLY criminal perpetrators toxic to the world:\n\nMadness is: preferring to take the blood of caged-in women and children to winning the  safe return of your own surviving citizens.\n\nTrump's \"support\" is Encouragement-By-FELON.  That won't protect ANYONE from criminal responsibility  -- JUST ASK his long list of toadies.\n\nTake a look around.  Trump ONLY supports criminals.  Israel should stop touting his support as some kind of blessing.  It always ends the same for Trump, and this DEVIL's on his way to an even bigger FAILure than last time.",
                "Kinda odd how the \"All Lives Matter!!\" folks dont think Palestinian lives matter.",
                "Only animals punish civilians like this.",
                "I wonder how long until this article is locked or removed because it's anti-Israel.",
                "Don't be fooled! That's a deadly Hamas fighter, I bet that baby has a gun stashed away underneath its clothes!\n\n\n*obvious /s for anyone not understanding the joke*"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Halifax musicians say U.S. traffic stop led to drug search, questions about allegiance",
            "external_url": "https://www.cbc.ca/news/canada/nova-scotia/halifax-musicians-pulled-over-asked-canada-or-us-1.7488950",
            "upvotes": 767,
            "date": "03/21/2025",
            "thumbnail": "https://i.cbc.ca/1.7489337.1742511045!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/cassie-and-maggie-macdonald.jpg?im=Resize%3D620",
            "top_comments": [
                "As an Asian man living in Ohio, if two white ladies are not safe from cops, I feel like I need to look for a way out of Ohio",
                "I'm an American and have to tell you this makes me not want to travel in my own country.",
                "I’m right in noticing we’re regularly getting headlines that would be considered bugfuck insane even 10 years ago right?",
                "The USA is no longer safe to visit for anyone.",
                "Canadians should not be going to the US, it's in the process of becoming a fascist nation. The next time you go you could find yourself disappeared, I'm only exaggerating a little.",
                "The world is quickly discovering that these United States of ‘Murica are indeed a shithole country to be avoided at all costs",
                "From other sources these were two officers from the Guernsey County Sheriff Department. I’ve been in Ohio my whole life and I had to look that one up, far south East area. Total population less than 40k. \n\nThe south East portion of the state has a particular…. Reputation let’s just say. It might as well be the Deep South. It’s a small county as well, 40k people is nothing so almost all rural demographics.\n\nThe sheriff system is deeply flawed as they are elected at the county level and more or less only accountable to the voters at election time. There’s little institutional force to hold them accountable to any standard and stories of sheriff department abuses are so common it borders on cliche. \n\nSo we have a sheriffs department in a deeply conservative and rural area, accountable to almost no one, parroting myths about drugs coming over the border from Canada and harassing two well meaning talented artists. \n\nThis is another despicable slide into fascism but I can’t say I’m surprised in the least. This story has all of the elements for this outcome. ",
                "It's a good thing that the US is not about to host a massively popular global even in the near future... 😭",
                "“What do you prefer, America or Canada?”\n\nWhat on earth?!",
                "Explains why other countries are now issuing travel warnings for their citizens visiting America. Come on. FOR VISITING AMERICA? How has it gotten this bad so quickly?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Boy accused of killing elderly man while girl filmed attack ‘can’t keep track’ of murder trial lies, court hears",
            "external_url": "https://news.sky.com/story/boy-accused-of-killing-elderly-man-while-girl-filmed-attack-cant-keep-track-of-murder-trial-lies-court-hears-13332698",
            "upvotes": 294,
            "date": "03/21/2025",
            "thumbnail": "https://e3.365dm.com/25/02/1600x900/skynews-bhim-kohli-leicester_6842418.jpg?20250228162305",
            "top_comments": [
                "What the heck is a “slider”?   The article mentions the man being struck with a slider. But I am unfamiliar with this usage/definition.",
                "He's gonna be wearing some sliders in lockup",
                "You can kill someone with sandals/shower shoes? Maybe if it's an upgraded Chancla in the right hands, preferably wielded by a mother/grandmother.",
                "A space and three more letters would have made that obnoxiously long headline intelligible:\n\nBoy accused of killing elderly man while girl filmed attack 'can't keep track' of *HIS* murder trial lies, court hears\n\nStill would have been obnoxiously long, of course, but it would have at least made sense.\n\n#"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "People named in JFK assassination documents are not happy their personal information was released",
            "external_url": "https://apnews.com/article/jfk-assassination-files-personal-information-5609ccd6e106c5b30ee6b6cca3a30e3c",
            "upvotes": 11291,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Interesting that the JFK documents were insufficiently redacted, while the Epstein documents were redacted to the point of uselessness.",
                "The problem is the social security numbers of these living individuals were not redacted.",
                "So the only thing new was that we all know Digenova's SS number. Cool.",
                ">“It should not have happened,” diGenova said in a phone interview Thursday. “I think it’s the result of incompetent people doing the reviewing. I don’t believe it had anything to do with rushing the process. The people who reviewed these documents did not do their job.”\n\nYeah i can definitely see incompetent people involved in this and a lot else going on rn",
                "It's crazy that these people will get new SSNs, meanwhile pretty much every American's SSN has been leaked as part of a data breach at some point recently. It's beyond time for a more modern system. ",
                "So, no new info except for the stuff that was correctly and competently redacted in the past to protect people that absolutely deserved to be shielded from having their private info thrown to the conspiracy theorist wolves.\n\nNo surprise at all to any of that.",
                "Has anything knew or interesting come from this document release? I think it was just red meat to keep people's attention away from the Epstein diaries.",
                "can you imagine having to get a new social security number in yours 70s lol and with the current state of that department under this admin right now",
                "No fucking excuse, release the full unredacted Epstein file at this point.",
                "Lol they're going to help those affected by monitoring their credit.  Thats like a free pizza coupon for finding a hair in your delivered papa John's."
            ],
            "aggregate_sentiment": 20.0
        }
    ],
    "last_updated": "03/21/2025 16:10:17 UTC"
}