{
    "posts": [
        {
            "category": "HOT",
            "title": "Trump announces sweeping new tariffs to promote US manufacturing, risking inflation and trade wars",
            "external_url": "https://apnews.com/article/trump-tariffs-liberation-day-2a031b3c16120a5672a6ddd01da09933",
            "upvotes": 22119,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Here are the numbers:\n\n* A 10% baseline tax on imports from all countries and higher tariff rates on dozens of nations that run trade surpluses with the United States\n\n* 34% tax on imports from China\n\n* 20% tax on imports from the European Union\n\n* 25% on South Korea\n\n* 24% on Japan \n\n* and 32% on Taiwan.",
                "He’s calling it liberation day? \nWhat the fuck are we getting liberated from?",
                "Don't even look at your 401K tomorrow.",
                "President who campaigned on affordability announces 20% national sales tax. Conservatives cheer.\n\nI want off this ride.",
                "Holy hell are we about to get financially stomped.",
                "> “Taxpayers have been ripped off for more than 50 years,” Trump said in remarks at the White House. “But it is not going to happen anymore.”\n\nWho does he think suffers the economic burden of tariffs? 10-34% tariffs on all imports will have a brutal impact.",
                "Trump take egg. Trump take Switch 2.",
                "Nuking the economy to own the libs",
                "Trump is not announcing tariffs to promote US Manufacturing.   \nTrump announcing tariffs to shift taxes from the wealthy to the poor.",
                "And of course he waited until after the market closed to do this.\n\nEdit: The chart said \"Tariffs Charged to the USA Including Currency Manipulation & Trade Barriers\"\n\n1. THAT STILL ISN'T HOW FUCKING TARIFFS WORK!!! THE US IS NOT PAYING TARIFFS IN OTHER COUNTRIES!!!\n2. \"Currency manipulation and trade barriers\" are such stupidly arbitrary metrics that I can't even imagine how they actually quantify that short of just making it up."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "John Oliver faces defamation lawsuit from US healthcare executive | US healthcare",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/02/john-oliver-defamation-lawsuit-healthcare",
            "upvotes": 2627,
            "date": "04/02/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/beed2090a1681a048562802c0d69bcb6e8321211/343_297_3296_1977/master/3296.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f69132c8f0c4af080c75135db925c7ad",
            "top_comments": [
                ">The lawsuit argues that context cut from the show changes the meaning of Morley’s words, which they quote as thus: “In certain cases, yes, with the patient with significant comorbidities, you would want to have someone wiping them and getting the feces off. But like I said, people have bowel movements every day where they don’t completely clean themselves and we don’t fuss over too much. People are allowed to be dirty. It’s when the dirty and the feces and the urine interfere with, you know, medical safety, like in someone who has concomitant comorbidities that you worry, but not in this specific case. I would allow him to be a little dirty for a couple days.”\n\nOh yeah, the full context makes it sound *so much* better.",
                "From the article:  A US [healthcare](https://www.theguardian.com/us-news/healthcare) executive has sued [John Oliver](https://www.theguardian.com/tv-and-radio/series/john-oliver-recap) for defamation following a Last Week Tonight [episode on Medicaid](https://www.theguardian.com/tv-and-radio/2024/apr/15/john-oliver-medicaid), in which the British-American comedian quoted the doctor as saying it was okay for a patient with bowel issues to be “a little dirty for a couple of days”.\n\nDr Brian Morley, the ex-medical director of AmeriHealth Caritas, argues that Oliver – an outspoken comic whose show has not only [addressed muzzling lawsuits](https://www.theguardian.com/culture/2019/nov/11/john-oliver-last-week-tonight-lawsuits-murray-energy) but been subject to them – took the quote out of context in an [April 2024 episode on Medicaid](https://www.theguardian.com/tv-and-radio/2024/apr/15/john-oliver-medicaid).\n\nThe suit against Oliver and the Last Week Tonight producers Partially Important Productions seeks unspecified damages “in an amount to be determined and in excess of $75,000”, according to [Deadline](https://deadline.com/2025/04/john-oliver-sued-defamation-healthcare-executive-1236356624/). It does not name Last Week Tonight’s broadcaster, HBO.",
                "Sounds like it'll get tossed based on precedent:\n\n>In 2017, a West Virginia judge [tossed](https://www.avclub.com/judge-tosses-out-that-defamation-lawsuit-against-hbo-an-1823295045) a defamation suit filed against the comedian and his show by Bob Murray, the CEO of a coal company. The judge agreed with HBO’s argument that Oliver’s comments were either factual and sourced from various court documents, or clearly satirical and thus protected by the first amendment.",
                "Oh yeah let's get to the discovery phases on this. \n\nPure Streisand Effect on this one.",
                "good luck.  The \"Last Week Tonight\" legal team is airtight.",
                "The full quote is not any better dude.",
                "I assume he gets these often and I doubt he loses - John won't be loosing any sleep over this.",
                "I’m pretty sure Mr. Oliver and his attorneys are quite ready for this complaint.",
                "The episode he did about Bob Murray after that defamation suit got withdrawn was gold. It's the first Last Week Tonight I show anyone.\n\nFor anyone who hasnt seen it\n\n[https://www.youtube.com/watch?v=UN8bJb8biZU](https://www.youtube.com/watch?v=UN8bJb8biZU)",
                "The full context doesn't change seem to change the meaning.\n\n> “People have bowel movements every day where they don’t completely clean themselves, and we don’t fuss over [them] too much. People are allowed to be dirty … You know, I would allow him to be a little dirty for a couple of days.”\n\nvs\n\n\n>“In certain cases, yes, with the patient with significant comorbidities, you would want to have someone wiping them and getting the feces off. But like I said, people have bowel movements every day where they don’t completely clean themselves and we don’t fuss over too much. People are allowed to be dirty. It’s when the dirty and the feces and the urine interfere with, you know, medical safety, like in someone who has concomitant comorbidities that you worry, but not in this specific case. I would allow him to be a little dirty for a couple days.”"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Nobel Peace Prize winner Oscar Arias says US cancelled his visa",
            "external_url": "https://www.bbc.com/news/articles/c75dl7rdxexo",
            "upvotes": 4744,
            "date": "04/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b4b7/live/606b9160-0fcd-11f0-9f8d-f125b11f3e53.jpg",
            "top_comments": [
                "And Trump himself wants to win the Nobel peace prize …yeah ok",
                ">He said he had received a \"terse\" email \"of a few lines\" from the US government informing him of the decision.\n\nWell....at least he wasn't apprehended by ICE, I guess....",
                "To give a bit more context:\n\n>The former president of Costa Rica, Oscar Arias, says his US visa has been revoked.\n\n>Arias, a Nobel laureate, said he was informed of the decision weeks after he had publicly criticised Donald Trump, comparing the behaviour of the US president to that of a Roman emperor.\n\nWay to prove you're not playing the role of a Roman emperor. Trump is a petulant child. Trump voters, this is what you voted for.",
                "'' Arias, a Nobel laureate, said he was informed of the decision weeks after he had publicly criticised Donald Trump, comparing the behaviour of the US president to that of a Roman emperor. '' How thin skinned, However comparing him to a  Emperor is a major overstatement ,",
                "Now this is sad.  You can't even win a Nobel Prize anymore and get any respect from Trump and his goons if you're not of the Aryan race.\n\nOf course, it could just be Trump is jealous, because he's not getting the Peace Prize any time soon with his bumbling around with Putin and Zelenskyy.",
                "No smart people allowed!",
                "And why am I not surprised?",
                "He’s so freaking petty! I assume it’s bc HE didn’t win one??",
                "change it to \n\nFairness, Uplifting, Compassion, Kindness, Thoughtfulness, Respect, Unity, Mindfulness, and Patience",
                "Trump doesn't have his \"Noble\" prize yet. So Arias hurt the Tangerine Toddlers feelings and his pathetic and childish vengeance is immediate. This is what the once dignified and respected office of the President of the United States has become. Kiss the ring or face the childish petulance."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "HOT",
            "title": "DOGE official at DOJ bragged about hacking, distributing pirated software",
            "external_url": "https://www.reuters.com/technology/cybersecurity/doge-official-doj-bragged-about-hacking-distributing-pirated-software-2025-04-02/",
            "upvotes": 7805,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What we were sold : Computer whiz-kids will optimize government!\n\nWhat we think we got : Computer hackers will gut government.\n\nWhat we actually probably got : Computer script kiddies are taking your data.",
                "> Stanley ran a series of websites and forums starting as far back as 2006, when he was 15, registration data preserved by the internet intelligence firm DomainTools shows. Several of those sites distributed pirated ebooks, bootleg software and video game cheats, according to copies maintained by the Internet Archive, a nonprofit whose 'Wayback Machine' preserves old websites....\n\n> In the hours after Reuters contacted Stanley, several of his old websites vanished from the Internet Archive. Mark Graham, director of the Wayback Machine, declined to answer specific questions about the disappearance of Stanley’s websites but said people who own the rights to sites can request to have their content withheld from the archive.\n\nHe immediately got some of his websites removed from the Wayback Machine to try and cover it up. So sad.",
                "We once hired a college intern and on his first day he was bragging about hacking and was playing around with a keylogger on his own laptop. We walked him out on the spot, called the school and said his internship was canceled. You have to be able to trust employees you're giving access to sensitive data (or even could potentially have access, like an intern). No amount of talent or skills can override a lack of trust.",
                "As an infosec pro, I can say that's pretty common. The difference here is that normally there's 20 years of personal and professional development happening between screwing around as a teenager and having significant responsibility in an organization.",
                "Throughout history, philosophers, scientist, and theologians have often pondered who is the biggest bitch. They can now say, without any doubt, that Elon musk is the biggest, most gigantic bitch. Huge bitch. If there was a mount bitchmore, elons head would be there over and over again. Truly a humongous cunt, I mean bitch. Musk’s bitchiness is beyond measure. He is such a bitch, even his kids hate him. Such a cunty bitch. \n\nFuck that guy. ",
                "My parents are convinced the doge folks are the cream of the crop. Super smart guys that can do no wrong. I guess short of them losing Medicare and social security checks what will it take to convince them otherwise. Unfortunately I think something drastic needs to happen for people to actually wake up.",
                "Hey Elon I can save us millions \n Let's just install hacked Office",
                "As a sys admin what I see when I read this title is “DOGE employee at DOJ just read article about how to unlock O365 products without a license”",
                "when you use personality B around group A",
                "Funny how just that alone would keep them from getting a top secret clearance.   Guess all that is just a suggestion now"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "NYC Mayor Eric Adams corruption case dismissed with prejudice, judge rules",
            "external_url": "https://www.cbsnews.com/newyork/news/nyc-mayor-eric-adams-corruption-case-dropped/",
            "upvotes": 10908,
            "date": "04/02/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/02/24/38534070-4ac0-48c8-98f7-131bee4a6782/thumbnail/1200x630/d6cab5ed83afe5450cd346e51971c2c0/gettyimages-2200888728.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Best system of justice money, bribes, and favors can buy",
                "Jesus, this is going to go down in the history books as one of the most corrupt cases ever and a highlight of just how bad the justice system in the US has gotten.\n\nThis is another case where the evidence is overwhelming, obvious, and blatant and he gets off scott free.",
                "Corruption everywhere! God bless America.",
                "Crimes are  legal now. Not that it wasn't always better for rich folks but you're getting banana republic levels of corruption now.",
                "Wild open air corruption",
                "To the surprise of absolutely no one",
                ">“Some will undoubtedly find today’s decision unsatisfying, wondering why, if DOJ’s ostensible reasons for dropping this case are so troubling, the Court does not simply deny the Motion to Dismiss altogether. But, as explained above, the Court cannot order DOJ to continue the prosecution, and it is aware of no authority (outside of the criminal contempt context) that would empower it, as some have urged, to appoint an independent prosecutor,” Judge Ho wrote. “Therefore, any decision by this Court to deny the Government’s Motion to Dismiss would be futile at best, because DOJ could—and, by all indications, unequivocally would—simply refuse to prosecute the case, inevitably resulting in a dismissal after seventy days for violating the Mayor’s right to a speedy trial. That route would simply postpone finality in this case to a date uncomfortably close to the June 24 mayoral primary. The public interest would not be served by such an outcome.”\n\nSo basically the judge is saying, “Yes, the reasons DOJ wanted this dismissed are bad, but I can’t force the prosecution to do their jobs, and if I dismiss with prejudice now they can’t hold these charges over the head of an elected official to manipulate them.”. These are the hard choices people have to make when the government has gone rogue and isn’t interested in prosecuting someone who, by all accounts, very obviously took bribes from a foreign government.",
                ">That means Adams cannot be re-tried on the same charges at a later time - a stipulation the Justice Department sought in its initial request to dismiss the case.\n\nSuch a fucking corrupt administration.",
                "The Trump admin wanted this case dismissed without prejudice, meaning that it could be brought against Adams at a later date. The request would have left the case hanging over Adams' head so that if he did not do exactly what the Trump admin asked, they could refile charges and prosecute Adams as punishment for defying the Trump admin.  It was, in every sense of the word, leverage. A quid pro quo.\n\nThe Judge dismissed the case with prejudice, meaning it cannot be resurrected no matter what happens and there is no longer this leverage hanging over Adam's head. Of course, former prosecutors in the case maintained that Adams was guilty, and given federal prosecutors win rate at trial, you would assume he would have been convicted here.  Eric Adams just hit the lottery.  A very corrupt lottery.",
                "This just sets us on a path where the president, with judicial consent, can decide himself what laws are, and are not, enforceable."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "European police say KidFlix, \"one of the largest pedophile platforms in the world,\" busted in joint operation",
            "external_url": "https://www.cbsnews.com/news/germany-online-child-sexual-abuse-platform-kidflix-busted-europol/",
            "upvotes": 6665,
            "date": "04/02/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/02/b221e717-879c-42b8-94dd-e0c331cd1f99/thumbnail/1200x630/5f1a82d31aeb4a20f5e8ee6262d24351/gettyimages-21925246851.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "I think the 1.8 million users should all be jailed.",
                "That is the creepiest name I have ever heard. I just cannot believe that people are willing to invest their intellect and time into something so sinister.",
                "Jesus christ that name gives me the heebie jeebies.",
                "i remember back when i was growing up there was a site called KidPix that was like a funky version of MS paint with fun sounds and effects. \n\ndefinitely feels like a bad name these days",
                "Bro I would 100% have thought that was a website for family-friendly movie if I just saw the URL in the wild. Gross.",
                "This is good news but holy shit is that gross.",
                "That name is so ridiculously gross. Please jail all of them and toss the keys.",
                "Wow that name. Not even hiding it. Its just a step above \"Pedos-R-Us\"",
                "Just the name creeps me the f out.",
                "Anyone heard from Matt Gaetz recently?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "North Dakota mayor resigns after sending lewd video to city attorney by mistake",
            "external_url": "https://apnews.com/article/minot-north-dakota-aa59ccb5b37fbc55e1e974dcf8dbbc6c",
            "upvotes": 2319,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I went into this thinking that this guy is just a perv that got caught but it sounds like it was a legit accident. He immediately apologized and asked her to not watch it. Then took responsibility, resigned, and praised the woman that reported him. \n\n>Ross said Wednesday he takes full responsibility and holds Stalheim “in the utmost regard and respect.” He said he had not resigned earlier “to respect the process.” He plans to focus on himself, healing and moving forward with his family, he said.",
                "Golden rule. \n\nNo wanking on your work phone. \n\nThis is a pretty standard global practice.",
                "“He sent the video minutes after the two had a telephone call discussing a police officer’s suicide.”\n\nThat’s some fucked up kink.",
                "Considering that he told the receiver to delete and not watch the video, I believe that this was a genuine mistake.\n\nI think he did the right thing by resigning, but I also don’t think we need to rake him over the coals for this. Someone can make a professional mistake without necessarily being a bad person and that’s what this sounds like. If he hasn’t had any other reports of inappropriate behavior or harassment, then this should be treated as the isolated incident it is.",
                "Ahh the days of people feeling guilty and doing the right thing when they do stupid shit and taking responsibility. Now do trump.",
                ">Ross sent a video of himself masturbating to City Attorney Stefanie Stalheim in January. \n\nThat is pretty extreme. Dude sent a video of him jerking off to a damn attorney. No chance he was getting a break.\n\nThis is one of the reasons I never do anything work-related on my personal devices and I would never email a video of myself doing anything. I won't even check my Gmail on my work computer. There is no crossover between my work and private tech lives.",
                "In this thread I see lots of redditors who have apparently made this same mistake or feel they have a high probability of doing so.",
                "The answer is, if you need any level of exhibitionism in your life, get a separate phone or tablet for your boner jams.",
                "Accident or no accident, you can't send a video of yourself jacking off to your direct subordinate at work. He thankfully chose to resign rather than try to stay in office and drag the city down with his drama.",
                "Odd, a politician did the correct thing."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Man who hates big pharmacies allegedly guns down Walgreens worker: Police",
            "external_url": "https://abcnews.go.com/US/man-hates-big-pharmacies-allegedly-guns-walgreens-worker/story?id=120408357",
            "upvotes": 1700,
            "date": "04/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8b120f52-85d8-4de2-81e8-7560381c1893/walgreens-shootinght-jef-250402_1743607443397_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "He hates big pharmaceuticals so he shot ....a cashier?",
                ">Fernandez allegedly told investigators he hates big pharmacies, Madera Police Chief Giachino Chiaramonte told ABC News.\n\nStupid motherfucker heard about big Pharmaceutical companies and went to Walgreens. Jesus Christ",
                "Hey Dipweeds. \n\nY'all need to separate a shite corporation from their underpaid employees. \n\nThe CEO is not the cashier, k?",
                "There's a lot of stupid extremists walking amongst us.",
                "Why did he shoot a cashier of all people? such the wrong objective...",
                "You shot someone working for close to minimum wage because you hate big pharma corporations? Big yikes dude.",
                "Dude did not understand the assignment.",
                "You're doing it wrong man...smh.",
                "This is some Waluigi shit",
                "I wonder if they're going to seek the death penalty or terrorism charges"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Tesla reports 336,000 vehicle deliveries in first quarter, 13% drop from a year ago.",
            "external_url": "https://www.nbcnews.com/business/business-news/tesla-reports-336000-vehicle-deliveries-first-quarter-13-percent-drop-rcna199263",
            "upvotes": 2461,
            "date": "04/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250402-tesla-ch-0950-721f15.jpg",
            "top_comments": [
                "weirdly stock up a bit today. I guess rumor mill is saying Musk might be leaving the spotlight, but how does stock go up when sales go down??",
                "They were lying about vehicle sales in Canada and claiming fraudulent EV rebates. Which caused them to be banned from incentive programs and have been put under investigation. \n\nI wouldn't doubt if those numbers are even worse.",
                "That number is probably inflated. They have been lying about sales forever to inflate their stock price.",
                "Those are deliveries. New orders will have tanked way worse.\n\nNot just a Musk backlash. I read a couple of years ago that they would be in trouble eventually. Cost and fit and finish issues were being tolerated when they were the only game in town but now established car manufacturers are in play and they know how to build cars right.",
                "I know their stock price is down over the last few months but how the heck is it climbing today?  Makes no sense.",
                "Given that those are deliveries and not orders, I expect the drop in the 2nd quarter to be 50-60%. Musk doesn't care now that he has direct access to the Treasury. God only knows how much money he has stolen.\n\nEdit: Also, why is TSLA's stock going *up*‽ That makes no sense.",
                "> Investors were expecting Tesla to report deliveries of between 360,000 and 370,000 vehicles, according to StreetAccount.\n\nIt's actually even worse than it sounds because these were the most recent estimates. Three months ago the consensus estimates were 457,000. They dropped over 100K from their estimates and were *still* way too high.",
                "Not enough till it goes 0",
                "Yet the stock is up today. Their stock prices have no connection to reality, do they?",
                "Just imagine what it really is if they weren't mass shadow buying their own cars?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "US sends three-person disaster response team to earthquake-stricken Myanmar after USAID gutted",
            "external_url": "https://www.abc.net.au/news/2025-04-02/myanmar-earthquake-usaid-cuts-emergency-response/105125224",
            "upvotes": 9155,
            "date": "04/02/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/2990662b455f59bbc476a59ae6691b22?impolicy=wcms_watermark_news&cropH=2659&cropW=4727&xPos=0&yPos=246&width=862&height=485&imformat=generic",
            "top_comments": [
                "I can imagine them asking the victims to sign a very fair « rescue deal »",
                "That team will most likely be looking for mineral deposits I guess?",
                "Basically a team of real estate assessor",
                "The Trump administration is disbanding FEMA, so this is more than they intend to send to any domestic disasters as well. \n\n\nThey're a bunch of selfish grifters who realized they had finally consolidated enough power to break the system and suck out the marrow.",
                "at this point you could just stay home",
                "I hate that our country is embarrassed on a daily basis by Trump.",
                "Well, they took \"soft power\" in a new direction.",
                "Weak and irrelevant also describes the current lame-duck administration in totality.",
                "I'm stunned they did this much.",
                "Hey, they brought three suitcases of paper towels!"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Danish PM promises to support Greenland against US pressure",
            "external_url": "https://www.aljazeera.com/news/2025/4/2/danish-pm-promises-to-support-greenland-against-us-pressure",
            "upvotes": 73,
            "date": "04/03/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/04/2025-04-02T163950Z_1894203535_RC2SPDA5ZRLD_RTRMADP_3_GREENLAND-DENMARK-1743617962.jpg?resize=1920%2C1440",
            "top_comments": [
                "I am flat out embarrassed to be an American. For fucks sake…"
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "NEW",
            "title": "DR Congo spares three convicted US coup accomplices of capital punishment",
            "external_url": "https://www.aljazeera.com/news/2025/4/2/dr-congo-spares-three-convicted-us-coup-accomplices-of-capital-punishment",
            "upvotes": 44,
            "date": "04/02/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/04/2024-09-13T183408Z_2089371245_RC2OZ9AS9U8P_RTRMADP_3_CONGO-SECURITY-1743590682.jpg?resize=1920%2C1440",
            "top_comments": [
                ">Malanga’s 21-year-old son, Marcel Malanga, who is a US citizen, was among those convicted of participating in the coup. The other US nationals are Tyler Thompson Jr, 21, a high school friend of the younger Malanga who flew to Africa from Utah for what his family believed was a free vacation, and Benjamin Reuben Zalman-Polun, 36, who is reported to have known Christian Malanga through a gold mining company.\n\nFeels like I'm a whole season behind on this one",
                "*The Americans’ commutation comes amid efforts by Congolese authorities to sign a minerals deal with the US in exchange for security support to help Kinshasa fight rebels in the* [*conflict-hit eastern region*](https://www.aljazeera.com/news/2025/3/24/mapping-the-human-toll-of-the-conflict-in-dr-congo)*.*\n\nGood news that all 40 rebels sentenced to death for an attempted coup last year have been commuted."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Canada and Mexico exempt from Trump’s new tariffs, existing duties remain",
            "external_url": "https://www.thestar.com/news/canada/cp-newsalert-canada-exempt-from-trumps-new-tariffs-existing-duties-remain/article_1183f5a4-4648-55c1-9c64-7e4e752ae643.html",
            "upvotes": 76,
            "date": "04/02/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/3/3c/33c76c14-4092-5277-8054-05231749741e/67eadf292c34b.image.jpg?crop=1620%2C851%2C0%2C114&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "This buffoon is such a clown. All this bluster and BS talk and he’s torpedoing his own country but hey - can’t wait to see all those factories opening up to make what Cambodian and Thailand make!the workers have oh so been suffering!\n\nPeople lost value in their retirements, savings, education and jobs because this old fool can’t actually pull his phat head out of its phat ass and listen to other people. \n\nUS… you are so deep in sh*t and it’s only just begun..",
                "Lol we're fucked regardless. I love having my future decided by a diaper wearing dementia patient",
                "Yeah we're going to be yo-yo'd for the foreseeable future. ",
                "They'll be exempt from the 20%. They only have, well. 25%",
                "What I'm not clear on is if vehicles imported from Canada are still getting the tariff hammer",
                "Just wait for all the “wealth” that is going to flow into the US and make all the residents very rich. More money to spend than they ever could have imagined. Sorry Donald but you’re tanking the American economy in real time. Third world very soon.",
                "I give it to morning for the list of exempted countries to get longer and longer.",
                "But won't anyone think of the penguins on Mcdonald island. 🤣🤣.  Nothing like slapping tariffs on an uninhibited island.",
                "The import taxes were already imposed. Sure, there were no additional ones but the damage has already been done.",
                "Canada is exempt from the NEW tariffs he imposed today, he already imposed tariffs of 25% on 60% of goods imported from Canada (originally 100% but that violated a treaty) and 10% on all energy imported from Canada as well as 25% on all steel and aluminum from everyone including Canada."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Australian beef singled out as Donald Trump outlines latest tariffs",
            "external_url": "https://www.abc.net.au/news/2025-04-03/australian-beef-singled-out-in-donald-trumps-liberation-tariffs/105120998",
            "upvotes": 160,
            "date": "04/02/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/ab1fcdbf2ef99d27cfc42a44efdbe908?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=0&width=862&height=485&imformat=generic",
            "top_comments": [
                "Hey Japan, South Korea and China would you like to buy more beef?\n\nHe's such a thick nonce.",
                "Australia, do you still kick people in the arse with a very large boot?",
                "You know where wasn't singled out, for anything? Russia. Funny that.",
                "I bought an Australian wagyu striploin last year - marbling score 6-8. Best steaks I've ever cooked. Fuck these tariffs :(",
                "I've been told that Australian meat is very good quality, better than what we have in Canada.\n\nAustralia, since the US doesn't seem to want it, can you start selling it to us in Canada?",
                "Non-Aussie here. If the US beef doesn't meet the standards required by Aussie, tough. Don't compromise if it's going to affect your entire beef industry.",
                "Must be where McDonalds got its beef for their hamburders.",
                "Hey, Aussie’s— Wondering if your beef cattle are raised confined in either a foul confinement operation or knee deep in mud and shit like the U.S. ?",
                "Did he tariff Brazilian beef? That’s where his hamberders come from.",
                "In Japan, the Australian beef was so good and cheap that they had to artificially raise the prices to give Japanese beef a chance.  \nResult? Now *nobody* can eat meat in Japan because both local beef and imports are overpriced."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "John Oliver faces defamation lawsuit from US healthcare executive | US healthcare",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/02/john-oliver-defamation-lawsuit-healthcare",
            "upvotes": 2629,
            "date": "04/02/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/beed2090a1681a048562802c0d69bcb6e8321211/343_297_3296_1977/master/3296.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f69132c8f0c4af080c75135db925c7ad",
            "top_comments": [
                ">The lawsuit argues that context cut from the show changes the meaning of Morley’s words, which they quote as thus: “In certain cases, yes, with the patient with significant comorbidities, you would want to have someone wiping them and getting the feces off. But like I said, people have bowel movements every day where they don’t completely clean themselves and we don’t fuss over too much. People are allowed to be dirty. It’s when the dirty and the feces and the urine interfere with, you know, medical safety, like in someone who has concomitant comorbidities that you worry, but not in this specific case. I would allow him to be a little dirty for a couple days.”\n\nOh yeah, the full context makes it sound *so much* better.",
                "From the article:  A US [healthcare](https://www.theguardian.com/us-news/healthcare) executive has sued [John Oliver](https://www.theguardian.com/tv-and-radio/series/john-oliver-recap) for defamation following a Last Week Tonight [episode on Medicaid](https://www.theguardian.com/tv-and-radio/2024/apr/15/john-oliver-medicaid), in which the British-American comedian quoted the doctor as saying it was okay for a patient with bowel issues to be “a little dirty for a couple of days”.\n\nDr Brian Morley, the ex-medical director of AmeriHealth Caritas, argues that Oliver – an outspoken comic whose show has not only [addressed muzzling lawsuits](https://www.theguardian.com/culture/2019/nov/11/john-oliver-last-week-tonight-lawsuits-murray-energy) but been subject to them – took the quote out of context in an [April 2024 episode on Medicaid](https://www.theguardian.com/tv-and-radio/2024/apr/15/john-oliver-medicaid).\n\nThe suit against Oliver and the Last Week Tonight producers Partially Important Productions seeks unspecified damages “in an amount to be determined and in excess of $75,000”, according to [Deadline](https://deadline.com/2025/04/john-oliver-sued-defamation-healthcare-executive-1236356624/). It does not name Last Week Tonight’s broadcaster, HBO.",
                "Sounds like it'll get tossed based on precedent:\n\n>In 2017, a West Virginia judge [tossed](https://www.avclub.com/judge-tosses-out-that-defamation-lawsuit-against-hbo-an-1823295045) a defamation suit filed against the comedian and his show by Bob Murray, the CEO of a coal company. The judge agreed with HBO’s argument that Oliver’s comments were either factual and sourced from various court documents, or clearly satirical and thus protected by the first amendment.",
                "Oh yeah let's get to the discovery phases on this. \n\nPure Streisand Effect on this one.",
                "good luck.  The \"Last Week Tonight\" legal team is airtight.",
                "The full quote is not any better dude.",
                "I assume he gets these often and I doubt he loses - John won't be loosing any sleep over this.",
                "I’m pretty sure Mr. Oliver and his attorneys are quite ready for this complaint.",
                "The episode he did about Bob Murray after that defamation suit got withdrawn was gold. It's the first Last Week Tonight I show anyone.\n\nFor anyone who hasnt seen it\n\n[https://www.youtube.com/watch?v=UN8bJb8biZU](https://www.youtube.com/watch?v=UN8bJb8biZU)",
                "The full context doesn't change seem to change the meaning.\n\n> “People have bowel movements every day where they don’t completely clean themselves, and we don’t fuss over [them] too much. People are allowed to be dirty … You know, I would allow him to be a little dirty for a couple of days.”\n\nvs\n\n\n>“In certain cases, yes, with the patient with significant comorbidities, you would want to have someone wiping them and getting the feces off. But like I said, people have bowel movements every day where they don’t completely clean themselves and we don’t fuss over too much. People are allowed to be dirty. It’s when the dirty and the feces and the urine interfere with, you know, medical safety, like in someone who has concomitant comorbidities that you worry, but not in this specific case. I would allow him to be a little dirty for a couple days.”"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Trump announces sweeping new tariffs to promote US manufacturing, risking inflation and trade wars",
            "external_url": "https://apnews.com/article/trump-tariffs-liberation-day-2a031b3c16120a5672a6ddd01da09933",
            "upvotes": 22137,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Here are the numbers:\n\n* A 10% baseline tax on imports from all countries and higher tariff rates on dozens of nations that run trade surpluses with the United States\n\n* 34% tax on imports from China\n\n* 20% tax on imports from the European Union\n\n* 25% on South Korea\n\n* 24% on Japan \n\n* and 32% on Taiwan.",
                "He’s calling it liberation day? \nWhat the fuck are we getting liberated from?",
                "Don't even look at your 401K tomorrow.",
                "President who campaigned on affordability announces 20% national sales tax. Conservatives cheer.\n\nI want off this ride.",
                "Holy hell are we about to get financially stomped.",
                "> “Taxpayers have been ripped off for more than 50 years,” Trump said in remarks at the White House. “But it is not going to happen anymore.”\n\nWho does he think suffers the economic burden of tariffs? 10-34% tariffs on all imports will have a brutal impact.",
                "Trump take egg. Trump take Switch 2.",
                "Nuking the economy to own the libs",
                "Trump is not announcing tariffs to promote US Manufacturing.   \nTrump announcing tariffs to shift taxes from the wealthy to the poor.",
                "And of course he waited until after the market closed to do this.\n\nEdit: The chart said \"Tariffs Charged to the USA Including Currency Manipulation & Trade Barriers\"\n\n1. THAT STILL ISN'T HOW FUCKING TARIFFS WORK!!! THE US IS NOT PAYING TARIFFS IN OTHER COUNTRIES!!!\n2. \"Currency manipulation and trade barriers\" are such stupidly arbitrary metrics that I can't even imagine how they actually quantify that short of just making it up."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Man who hates big pharmacies allegedly guns down Walgreens worker: Police",
            "external_url": "https://abcnews.go.com/US/man-hates-big-pharmacies-allegedly-guns-walgreens-worker/story?id=120408357",
            "upvotes": 1702,
            "date": "04/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8b120f52-85d8-4de2-81e8-7560381c1893/walgreens-shootinght-jef-250402_1743607443397_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "He hates big pharmaceuticals so he shot ....a cashier?",
                ">Fernandez allegedly told investigators he hates big pharmacies, Madera Police Chief Giachino Chiaramonte told ABC News.\n\nStupid motherfucker heard about big Pharmaceutical companies and went to Walgreens. Jesus Christ",
                "Hey Dipweeds. \n\nY'all need to separate a shite corporation from their underpaid employees. \n\nThe CEO is not the cashier, k?",
                "There's a lot of stupid extremists walking amongst us.",
                "Why did he shoot a cashier of all people? such the wrong objective...",
                "You shot someone working for close to minimum wage because you hate big pharma corporations? Big yikes dude.",
                "Dude did not understand the assignment.",
                "You're doing it wrong man...smh.",
                "This is some Waluigi shit",
                "I wonder if they're going to seek the death penalty or terrorism charges"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "North Dakota mayor resigns after sending lewd video to city attorney by mistake",
            "external_url": "https://apnews.com/article/minot-north-dakota-aa59ccb5b37fbc55e1e974dcf8dbbc6c",
            "upvotes": 2321,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I went into this thinking that this guy is just a perv that got caught but it sounds like it was a legit accident. He immediately apologized and asked her to not watch it. Then took responsibility, resigned, and praised the woman that reported him. \n\n>Ross said Wednesday he takes full responsibility and holds Stalheim “in the utmost regard and respect.” He said he had not resigned earlier “to respect the process.” He plans to focus on himself, healing and moving forward with his family, he said.",
                "Golden rule. \n\nNo wanking on your work phone. \n\nThis is a pretty standard global practice.",
                "“He sent the video minutes after the two had a telephone call discussing a police officer’s suicide.”\n\nThat’s some fucked up kink.",
                "Considering that he told the receiver to delete and not watch the video, I believe that this was a genuine mistake.\n\nI think he did the right thing by resigning, but I also don’t think we need to rake him over the coals for this. Someone can make a professional mistake without necessarily being a bad person and that’s what this sounds like. If he hasn’t had any other reports of inappropriate behavior or harassment, then this should be treated as the isolated incident it is.",
                "Ahh the days of people feeling guilty and doing the right thing when they do stupid shit and taking responsibility. Now do trump.",
                ">Ross sent a video of himself masturbating to City Attorney Stefanie Stalheim in January. \n\nThat is pretty extreme. Dude sent a video of him jerking off to a damn attorney. No chance he was getting a break.\n\nThis is one of the reasons I never do anything work-related on my personal devices and I would never email a video of myself doing anything. I won't even check my Gmail on my work computer. There is no crossover between my work and private tech lives.",
                "In this thread I see lots of redditors who have apparently made this same mistake or feel they have a high probability of doing so.",
                "The answer is, if you need any level of exhibitionism in your life, get a separate phone or tablet for your boner jams.",
                "Accident or no accident, you can't send a video of yourself jacking off to your direct subordinate at work. He thankfully chose to resign rather than try to stay in office and drag the city down with his drama.",
                "Odd, a politician did the correct thing."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "OnlyFans founder, crypto foundation submit late-stage bid to buy TikTok",
            "external_url": "https://www.reuters.com/technology/onlyfans-founder-crypto-foundation-submit-late-stage-bid-buy-tiktok-2025-04-02/",
            "upvotes": 264,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If this headline didn't comes from Reuters, I'd've assumed that MadLibs started a news outlet and this was their first story.",
                "They want the algorithm to make an infinite porn scrolling site don’t they?",
                "OnlyFans founder buying TikTok means it'll be renamed to TitTok",
                "Y'all need to watch the south park about TikTok",
                "Well…at least it isn’t Elon.",
                "It’s called vertical integration. He wants to own where the OF models start.",
                "Hahahahahaha. Next you'll tell me that the Hawk Tuah girl will be part of this bid as well.",
                "TikTok was already 90% gooner bait, so doubt it'll change much /S",
                "AMZN will buy it - my prediction.",
                "These goth thirst traps can skip the BS and just link right to their OF, genius"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Staffers charged in alleged abuse of 26 children at Philadelphia-area school",
            "external_url": "https://www.nbcnews.com/news/us-news/staffers-charged-abusing-children-philadelphia-area-school-rcna198982",
            "upvotes": 330,
            "date": "04/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250331-pa-chester-community-charter-school-google-maps-ac-926p-67af6e.jpg",
            "top_comments": [
                "How charter schools work. The company only hires a bear minimum of actual workers mostly just enough to sign the legal documents. Then they contract out everything from food services, janitor service, and teachers to vendors who bid the lowest. Usually these vendors hire people are paid minimum wage but who can't get hired by Target, McDonald's, or any other job that pays $0.50 more per hour than minimum wage. \n\n\nAnd if that's not bad enough these minum wage employees are ridiculously understaffed so only the ones that get off abusing kids stick around on the job, sort of the same that happens with prison guards.",
                "Twenty workers at a Philadelphia-area charter school were charged in connection with allegations of abuse of young children and failure to report it, prosecutors announced Monday.\n\nThe Chester Township Police Department said in court documents that security video captured roughly 100 incidents at Chester Community Charter School’s West Campus in November and December involving what the district attorney’s office said are 26 victims.\n\nThe victims, in grades K-5, were members of the school’s emotional support program, the office of Delaware County District Attorney Jack Stollsteimer said in a statement. Some of them were as young as 5 years old, the DA’s office said.\n\nStollsteimer said at a news conference Monday that he watched security video of the alleged abuse.\n\n“There are nine individuals who have surveillance video that I’ve watched putting their hands on children, some as young as 5,” Stollsteimer said. “Oftentimes, you can see them using their knee to take a child to the ground.”\n\nStollsteimer said formal charges were filed Monday morning. \n\nPolice filed initial charges in state court March 25 after family members of two students separately raised concerns to the school on Jan. 9 and Jan. 10, according to court documents. \n\nAn unnamed parent said their 7-year-old son was afraid to go to school because two staffers had used physical holds on children in a “positive support room” on campus, part of a program at the school called Team Approach to Achieving Academic Success, according to a police affidavit filed in support of charges.\n\nRelatives of another 7-year-old boy stepped forward the next day with similar complaints, the affidavit said. \n\nInvestigators said they found consistent accounts that staffers used “shoulder work” — including pinching pressure points on the neck, placing children in holds with their arms crossed in front of them and pushing knees into students’ backs — as a way of gaining physical compliance, the affidavit said.\n\nNine defendants alleged to have abused or had physical contact with children were charged with conspiracy, simple assault, unlawful restraint, false imprisonment, endangering the welfare of a child and failure to report endangering the welfare of a child, the DA’s office said.\n\nEleven defendants were charged with failure to report the alleged endangerment. Three of those charged with failure to report are school employees and were placed on leave pending further investigation, the school said in a statement.\n\nBoth groups of defendants include people with multiple counts of each charge. Police indicated a “dean of students” and “teachers” were among the second group.\n\nOn its website, the school lists the dean of students as Dahkeem Williams. \n\n“We take great exception to the District Attorney’s statement that ‘all the adults charged are equally guilty in failing to protect these children,’” Williams’ attorney, who also represents another defendant in the case, told NBC Philadelphia.\n\n\nNone of those charged were in custody, but some have made arrangements to surrender, Stollsteimer’s office said in its statement.\n\nOnline court records did not list attorneys for most defendants. The public defender’s office for Delaware County did not immediately respond to a request for comment Monday night.\n\n“I am proud that today we are holding the support staff, teachers, and even a dean of students accountable for abusing or failing to report the abuse, of vulnerable children,” Chester Township Police Chief Kenneth Coalson said in the DA’s statement.\n\nStollsteimer noted that state law mandates reporting child abuse for those who work in school settings.\n\nIndividual incidents of using physical contact for compliance must each be reported under state regulations, and none were, according to the affidavit. \n\n“This is just unacceptable behavior to happen anywhere, but particularly in a school setting for children who are supposed to be getting emotional support,” Stollsteimer said.\n\nThe school parent-teacher association did not immediately respond to a request for comment Monday night.\n\nThe contractor for whom the DA said most of the defendants work, Peak Performers Staffing LLC, did not respond to a request for comment. Chester Community Charter School said it severed ties with the company and its workers.\n\nThe school said in a statement that 17 of those charged work for Peak Performers, which it said took over a previous, “highly reputable” contractor’s emotional support work after that contractor discontinued the services the school was using.\n\nThe school said it was assured the Peak Performers employees were properly trained in physical contact with students but later learned they had not completed the necessary training.\n\nThe school characterized itself as an unnamed victim in the case, saying it was “duped” by Peak Performers.\n\n“CCCS plans to pursue all appropriate legal recourse against Peak Performers for the reckless and dangerous manner in which it operated,” the school said. “CCCS leaders are outraged at the actions and inactions of Peak Performers and stands in solidarity with the other victims.” \n\nIn 2018, Chester Community Charter School said it was the largest brick-and-mortar charter school in Pennsylvania. The K-8, four-campus school says it serves more than 4,000 students. Chester Township is about 22 miles southwest of Center City Philadelphia.",
                "I*nvestigators said they found consistent accounts that staffers used “shoulder work” — including pinching pressure points on the neck, placing children in holds with their arms crossed in front of them and pushing knees into students’ backs — as a way of gaining physical compliance, the affidavit said.*\n\nTwo levels of staff guilt in this charter school: 1) the coercive actors 2) the silent staff bystanders.",
                "I worked with children like this for 20 years. We stopped doing physical holds many many years ago because it was abusive,  it hurts and even kills children AND does nothing to control behavior in the long run.\n\nIt's lazy teaching, behavior management because it takes more time to build relationships, manage behaviors without being physical.\n\nShame on the staff, shame on the ones who didn't stop it or report it.",
                "So that's 9 for doing the abusing, and 11 for not reporting them. \n\n  \nAlso, a lot of job openings at the school per their website.",
                "*The victims, in grades K-5, were members of the school’s emotional support program, the office of Delaware County District Attorney Jack Stollsteimer said in a statement. Some of them were as young as 5 years old, the DA’s office said.*\n\n\nI'm so confused. The kids were the emotional support to the adults that abused them?",
                "100 incidents at Chester Community Charter School’s West Campus in November and December\n\nThat's multiple times a day, every single day. \n\nI feel for those kids, and hope those adults face some serious punishments.",
                "Why would Dahkeem Williams allow this to happen at his school?",
                "Those fuckers should rot.",
                "[removed]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "John Oliver faces defamation lawsuit from US healthcare executive | US healthcare",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/02/john-oliver-defamation-lawsuit-healthcare",
            "upvotes": 2632,
            "date": "04/02/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/beed2090a1681a048562802c0d69bcb6e8321211/343_297_3296_1977/master/3296.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f69132c8f0c4af080c75135db925c7ad",
            "top_comments": [
                ">The lawsuit argues that context cut from the show changes the meaning of Morley’s words, which they quote as thus: “In certain cases, yes, with the patient with significant comorbidities, you would want to have someone wiping them and getting the feces off. But like I said, people have bowel movements every day where they don’t completely clean themselves and we don’t fuss over too much. People are allowed to be dirty. It’s when the dirty and the feces and the urine interfere with, you know, medical safety, like in someone who has concomitant comorbidities that you worry, but not in this specific case. I would allow him to be a little dirty for a couple days.”\n\nOh yeah, the full context makes it sound *so much* better.",
                "From the article:  A US [healthcare](https://www.theguardian.com/us-news/healthcare) executive has sued [John Oliver](https://www.theguardian.com/tv-and-radio/series/john-oliver-recap) for defamation following a Last Week Tonight [episode on Medicaid](https://www.theguardian.com/tv-and-radio/2024/apr/15/john-oliver-medicaid), in which the British-American comedian quoted the doctor as saying it was okay for a patient with bowel issues to be “a little dirty for a couple of days”.\n\nDr Brian Morley, the ex-medical director of AmeriHealth Caritas, argues that Oliver – an outspoken comic whose show has not only [addressed muzzling lawsuits](https://www.theguardian.com/culture/2019/nov/11/john-oliver-last-week-tonight-lawsuits-murray-energy) but been subject to them – took the quote out of context in an [April 2024 episode on Medicaid](https://www.theguardian.com/tv-and-radio/2024/apr/15/john-oliver-medicaid).\n\nThe suit against Oliver and the Last Week Tonight producers Partially Important Productions seeks unspecified damages “in an amount to be determined and in excess of $75,000”, according to [Deadline](https://deadline.com/2025/04/john-oliver-sued-defamation-healthcare-executive-1236356624/). It does not name Last Week Tonight’s broadcaster, HBO.",
                "Sounds like it'll get tossed based on precedent:\n\n>In 2017, a West Virginia judge [tossed](https://www.avclub.com/judge-tosses-out-that-defamation-lawsuit-against-hbo-an-1823295045) a defamation suit filed against the comedian and his show by Bob Murray, the CEO of a coal company. The judge agreed with HBO’s argument that Oliver’s comments were either factual and sourced from various court documents, or clearly satirical and thus protected by the first amendment.",
                "Oh yeah let's get to the discovery phases on this. \n\nPure Streisand Effect on this one.",
                "good luck.  The \"Last Week Tonight\" legal team is airtight.",
                "The full quote is not any better dude.",
                "I assume he gets these often and I doubt he loses - John won't be loosing any sleep over this.",
                "I’m pretty sure Mr. Oliver and his attorneys are quite ready for this complaint.",
                "The episode he did about Bob Murray after that defamation suit got withdrawn was gold. It's the first Last Week Tonight I show anyone.\n\nFor anyone who hasnt seen it\n\n[https://www.youtube.com/watch?v=UN8bJb8biZU](https://www.youtube.com/watch?v=UN8bJb8biZU)",
                "The full context doesn't change seem to change the meaning.\n\n> “People have bowel movements every day where they don’t completely clean themselves, and we don’t fuss over [them] too much. People are allowed to be dirty … You know, I would allow him to be a little dirty for a couple of days.”\n\nvs\n\n\n>“In certain cases, yes, with the patient with significant comorbidities, you would want to have someone wiping them and getting the feces off. But like I said, people have bowel movements every day where they don’t completely clean themselves and we don’t fuss over too much. People are allowed to be dirty. It’s when the dirty and the feces and the urine interfere with, you know, medical safety, like in someone who has concomitant comorbidities that you worry, but not in this specific case. I would allow him to be a little dirty for a couple days.”"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "North Dakota mayor resigns after sending lewd video to city attorney by mistake",
            "external_url": "https://apnews.com/article/minot-north-dakota-aa59ccb5b37fbc55e1e974dcf8dbbc6c",
            "upvotes": 2324,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I went into this thinking that this guy is just a perv that got caught but it sounds like it was a legit accident. He immediately apologized and asked her to not watch it. Then took responsibility, resigned, and praised the woman that reported him. \n\n>Ross said Wednesday he takes full responsibility and holds Stalheim “in the utmost regard and respect.” He said he had not resigned earlier “to respect the process.” He plans to focus on himself, healing and moving forward with his family, he said.",
                "Golden rule. \n\nNo wanking on your work phone. \n\nThis is a pretty standard global practice.",
                "“He sent the video minutes after the two had a telephone call discussing a police officer’s suicide.”\n\nThat’s some fucked up kink.",
                "Considering that he told the receiver to delete and not watch the video, I believe that this was a genuine mistake.\n\nI think he did the right thing by resigning, but I also don’t think we need to rake him over the coals for this. Someone can make a professional mistake without necessarily being a bad person and that’s what this sounds like. If he hasn’t had any other reports of inappropriate behavior or harassment, then this should be treated as the isolated incident it is.",
                "Ahh the days of people feeling guilty and doing the right thing when they do stupid shit and taking responsibility. Now do trump.",
                ">Ross sent a video of himself masturbating to City Attorney Stefanie Stalheim in January. \n\nThat is pretty extreme. Dude sent a video of him jerking off to a damn attorney. No chance he was getting a break.\n\nThis is one of the reasons I never do anything work-related on my personal devices and I would never email a video of myself doing anything. I won't even check my Gmail on my work computer. There is no crossover between my work and private tech lives.",
                "In this thread I see lots of redditors who have apparently made this same mistake or feel they have a high probability of doing so.",
                "The answer is, if you need any level of exhibitionism in your life, get a separate phone or tablet for your boner jams.",
                "Accident or no accident, you can't send a video of yourself jacking off to your direct subordinate at work. He thankfully chose to resign rather than try to stay in office and drag the city down with his drama.",
                "Odd, a politician did the correct thing."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Nobel Peace Prize winner Oscar Arias says US cancelled his visa",
            "external_url": "https://www.bbc.com/news/articles/c75dl7rdxexo",
            "upvotes": 4745,
            "date": "04/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b4b7/live/606b9160-0fcd-11f0-9f8d-f125b11f3e53.jpg",
            "top_comments": [
                "And Trump himself wants to win the Nobel peace prize …yeah ok",
                ">He said he had received a \"terse\" email \"of a few lines\" from the US government informing him of the decision.\n\nWell....at least he wasn't apprehended by ICE, I guess....",
                "To give a bit more context:\n\n>The former president of Costa Rica, Oscar Arias, says his US visa has been revoked.\n\n>Arias, a Nobel laureate, said he was informed of the decision weeks after he had publicly criticised Donald Trump, comparing the behaviour of the US president to that of a Roman emperor.\n\nWay to prove you're not playing the role of a Roman emperor. Trump is a petulant child. Trump voters, this is what you voted for.",
                "'' Arias, a Nobel laureate, said he was informed of the decision weeks after he had publicly criticised Donald Trump, comparing the behaviour of the US president to that of a Roman emperor. '' How thin skinned, However comparing him to a  Emperor is a major overstatement ,",
                "Now this is sad.  You can't even win a Nobel Prize anymore and get any respect from Trump and his goons if you're not of the Aryan race.\n\nOf course, it could just be Trump is jealous, because he's not getting the Peace Prize any time soon with his bumbling around with Putin and Zelenskyy.",
                "No smart people allowed!",
                "And why am I not surprised?",
                "He’s so freaking petty! I assume it’s bc HE didn’t win one??",
                "change it to \n\nFairness, Uplifting, Compassion, Kindness, Thoughtfulness, Respect, Unity, Mindfulness, and Patience",
                "Trump doesn't have his \"Noble\" prize yet. So Arias hurt the Tangerine Toddlers feelings and his pathetic and childish vengeance is immediate. This is what the once dignified and respected office of the President of the United States has become. Kiss the ring or face the childish petulance."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Man who hates big pharmacies allegedly guns down Walgreens worker: Police",
            "external_url": "https://abcnews.go.com/US/man-hates-big-pharmacies-allegedly-guns-walgreens-worker/story?id=120408357",
            "upvotes": 1696,
            "date": "04/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8b120f52-85d8-4de2-81e8-7560381c1893/walgreens-shootinght-jef-250402_1743607443397_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "He hates big pharmaceuticals so he shot ....a cashier?",
                ">Fernandez allegedly told investigators he hates big pharmacies, Madera Police Chief Giachino Chiaramonte told ABC News.\n\nStupid motherfucker heard about big Pharmaceutical companies and went to Walgreens. Jesus Christ",
                "Hey Dipweeds. \n\nY'all need to separate a shite corporation from their underpaid employees. \n\nThe CEO is not the cashier, k?",
                "There's a lot of stupid extremists walking amongst us.",
                "Why did he shoot a cashier of all people? such the wrong objective...",
                "You shot someone working for close to minimum wage because you hate big pharma corporations? Big yikes dude.",
                "Dude did not understand the assignment.",
                "You're doing it wrong man...smh.",
                "This is some Waluigi shit",
                "I wonder if they're going to seek the death penalty or terrorism charges"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Trump announces sweeping new tariffs to promote US manufacturing, risking inflation and trade wars",
            "external_url": "https://apnews.com/article/trump-tariffs-liberation-day-2a031b3c16120a5672a6ddd01da09933",
            "upvotes": 22133,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Here are the numbers:\n\n* A 10% baseline tax on imports from all countries and higher tariff rates on dozens of nations that run trade surpluses with the United States\n\n* 34% tax on imports from China\n\n* 20% tax on imports from the European Union\n\n* 25% on South Korea\n\n* 24% on Japan \n\n* and 32% on Taiwan.",
                "He’s calling it liberation day? \nWhat the fuck are we getting liberated from?",
                "Don't even look at your 401K tomorrow.",
                "President who campaigned on affordability announces 20% national sales tax. Conservatives cheer.\n\nI want off this ride.",
                "Holy hell are we about to get financially stomped.",
                "> “Taxpayers have been ripped off for more than 50 years,” Trump said in remarks at the White House. “But it is not going to happen anymore.”\n\nWho does he think suffers the economic burden of tariffs? 10-34% tariffs on all imports will have a brutal impact.",
                "Trump take egg. Trump take Switch 2.",
                "Nuking the economy to own the libs",
                "Trump is not announcing tariffs to promote US Manufacturing.   \nTrump announcing tariffs to shift taxes from the wealthy to the poor.",
                "And of course he waited until after the market closed to do this.\n\nEdit: The chart said \"Tariffs Charged to the USA Including Currency Manipulation & Trade Barriers\"\n\n1. THAT STILL ISN'T HOW FUCKING TARIFFS WORK!!! THE US IS NOT PAYING TARIFFS IN OTHER COUNTRIES!!!\n2. \"Currency manipulation and trade barriers\" are such stupidly arbitrary metrics that I can't even imagine how they actually quantify that short of just making it up."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "DOGE official at DOJ bragged about hacking, distributing pirated software",
            "external_url": "https://www.reuters.com/technology/cybersecurity/doge-official-doj-bragged-about-hacking-distributing-pirated-software-2025-04-02/",
            "upvotes": 7811,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What we were sold : Computer whiz-kids will optimize government!\n\nWhat we think we got : Computer hackers will gut government.\n\nWhat we actually probably got : Computer script kiddies are taking your data.",
                "> Stanley ran a series of websites and forums starting as far back as 2006, when he was 15, registration data preserved by the internet intelligence firm DomainTools shows. Several of those sites distributed pirated ebooks, bootleg software and video game cheats, according to copies maintained by the Internet Archive, a nonprofit whose 'Wayback Machine' preserves old websites....\n\n> In the hours after Reuters contacted Stanley, several of his old websites vanished from the Internet Archive. Mark Graham, director of the Wayback Machine, declined to answer specific questions about the disappearance of Stanley’s websites but said people who own the rights to sites can request to have their content withheld from the archive.\n\nHe immediately got some of his websites removed from the Wayback Machine to try and cover it up. So sad.",
                "We once hired a college intern and on his first day he was bragging about hacking and was playing around with a keylogger on his own laptop. We walked him out on the spot, called the school and said his internship was canceled. You have to be able to trust employees you're giving access to sensitive data (or even could potentially have access, like an intern). No amount of talent or skills can override a lack of trust.",
                "As an infosec pro, I can say that's pretty common. The difference here is that normally there's 20 years of personal and professional development happening between screwing around as a teenager and having significant responsibility in an organization.",
                "Throughout history, philosophers, scientist, and theologians have often pondered who is the biggest bitch. They can now say, without any doubt, that Elon musk is the biggest, most gigantic bitch. Huge bitch. If there was a mount bitchmore, elons head would be there over and over again. Truly a humongous cunt, I mean bitch. Musk’s bitchiness is beyond measure. He is such a bitch, even his kids hate him. Such a cunty bitch. \n\nFuck that guy. ",
                "My parents are convinced the doge folks are the cream of the crop. Super smart guys that can do no wrong. I guess short of them losing Medicare and social security checks what will it take to convince them otherwise. Unfortunately I think something drastic needs to happen for people to actually wake up.",
                "Hey Elon I can save us millions \n Let's just install hacked Office",
                "As a sys admin what I see when I read this title is “DOGE employee at DOJ just read article about how to unlock O365 products without a license”",
                "when you use personality B around group A",
                "Funny how just that alone would keep them from getting a top secret clearance.   Guess all that is just a suggestion now"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "European police say KidFlix, \"one of the largest pedophile platforms in the world,\" busted in joint operation",
            "external_url": "https://www.cbsnews.com/news/germany-online-child-sexual-abuse-platform-kidflix-busted-europol/",
            "upvotes": 6661,
            "date": "04/02/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/02/b221e717-879c-42b8-94dd-e0c331cd1f99/thumbnail/1200x630/5f1a82d31aeb4a20f5e8ee6262d24351/gettyimages-21925246851.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "I think the 1.8 million users should all be jailed.",
                "That is the creepiest name I have ever heard. I just cannot believe that people are willing to invest their intellect and time into something so sinister.",
                "Jesus christ that name gives me the heebie jeebies.",
                "i remember back when i was growing up there was a site called KidPix that was like a funky version of MS paint with fun sounds and effects. \n\ndefinitely feels like a bad name these days",
                "Bro I would 100% have thought that was a website for family-friendly movie if I just saw the URL in the wild. Gross.",
                "This is good news but holy shit is that gross.",
                "That name is so ridiculously gross. Please jail all of them and toss the keys.",
                "Wow that name. Not even hiding it. Its just a step above \"Pedos-R-Us\"",
                "Just the name creeps me the f out.",
                "Anyone heard from Matt Gaetz recently?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Staffers charged in alleged abuse of 26 children at Philadelphia-area school",
            "external_url": "https://www.nbcnews.com/news/us-news/staffers-charged-abusing-children-philadelphia-area-school-rcna198982",
            "upvotes": 325,
            "date": "04/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250331-pa-chester-community-charter-school-google-maps-ac-926p-67af6e.jpg",
            "top_comments": [
                "How charter schools work. The company only hires a bear minimum of actual workers mostly just enough to sign the legal documents. Then they contract out everything from food services, janitor service, and teachers to vendors who bid the lowest. Usually these vendors hire people are paid minimum wage but who can't get hired by Target, McDonald's, or any other job that pays $0.50 more per hour than minimum wage. \n\n\nAnd if that's not bad enough these minum wage employees are ridiculously understaffed so only the ones that get off abusing kids stick around on the job, sort of the same that happens with prison guards.",
                "Twenty workers at a Philadelphia-area charter school were charged in connection with allegations of abuse of young children and failure to report it, prosecutors announced Monday.\n\nThe Chester Township Police Department said in court documents that security video captured roughly 100 incidents at Chester Community Charter School’s West Campus in November and December involving what the district attorney’s office said are 26 victims.\n\nThe victims, in grades K-5, were members of the school’s emotional support program, the office of Delaware County District Attorney Jack Stollsteimer said in a statement. Some of them were as young as 5 years old, the DA’s office said.\n\nStollsteimer said at a news conference Monday that he watched security video of the alleged abuse.\n\n“There are nine individuals who have surveillance video that I’ve watched putting their hands on children, some as young as 5,” Stollsteimer said. “Oftentimes, you can see them using their knee to take a child to the ground.”\n\nStollsteimer said formal charges were filed Monday morning. \n\nPolice filed initial charges in state court March 25 after family members of two students separately raised concerns to the school on Jan. 9 and Jan. 10, according to court documents. \n\nAn unnamed parent said their 7-year-old son was afraid to go to school because two staffers had used physical holds on children in a “positive support room” on campus, part of a program at the school called Team Approach to Achieving Academic Success, according to a police affidavit filed in support of charges.\n\nRelatives of another 7-year-old boy stepped forward the next day with similar complaints, the affidavit said. \n\nInvestigators said they found consistent accounts that staffers used “shoulder work” — including pinching pressure points on the neck, placing children in holds with their arms crossed in front of them and pushing knees into students’ backs — as a way of gaining physical compliance, the affidavit said.\n\nNine defendants alleged to have abused or had physical contact with children were charged with conspiracy, simple assault, unlawful restraint, false imprisonment, endangering the welfare of a child and failure to report endangering the welfare of a child, the DA’s office said.\n\nEleven defendants were charged with failure to report the alleged endangerment. Three of those charged with failure to report are school employees and were placed on leave pending further investigation, the school said in a statement.\n\nBoth groups of defendants include people with multiple counts of each charge. Police indicated a “dean of students” and “teachers” were among the second group.\n\nOn its website, the school lists the dean of students as Dahkeem Williams. \n\n“We take great exception to the District Attorney’s statement that ‘all the adults charged are equally guilty in failing to protect these children,’” Williams’ attorney, who also represents another defendant in the case, told NBC Philadelphia.\n\n\nNone of those charged were in custody, but some have made arrangements to surrender, Stollsteimer’s office said in its statement.\n\nOnline court records did not list attorneys for most defendants. The public defender’s office for Delaware County did not immediately respond to a request for comment Monday night.\n\n“I am proud that today we are holding the support staff, teachers, and even a dean of students accountable for abusing or failing to report the abuse, of vulnerable children,” Chester Township Police Chief Kenneth Coalson said in the DA’s statement.\n\nStollsteimer noted that state law mandates reporting child abuse for those who work in school settings.\n\nIndividual incidents of using physical contact for compliance must each be reported under state regulations, and none were, according to the affidavit. \n\n“This is just unacceptable behavior to happen anywhere, but particularly in a school setting for children who are supposed to be getting emotional support,” Stollsteimer said.\n\nThe school parent-teacher association did not immediately respond to a request for comment Monday night.\n\nThe contractor for whom the DA said most of the defendants work, Peak Performers Staffing LLC, did not respond to a request for comment. Chester Community Charter School said it severed ties with the company and its workers.\n\nThe school said in a statement that 17 of those charged work for Peak Performers, which it said took over a previous, “highly reputable” contractor’s emotional support work after that contractor discontinued the services the school was using.\n\nThe school said it was assured the Peak Performers employees were properly trained in physical contact with students but later learned they had not completed the necessary training.\n\nThe school characterized itself as an unnamed victim in the case, saying it was “duped” by Peak Performers.\n\n“CCCS plans to pursue all appropriate legal recourse against Peak Performers for the reckless and dangerous manner in which it operated,” the school said. “CCCS leaders are outraged at the actions and inactions of Peak Performers and stands in solidarity with the other victims.” \n\nIn 2018, Chester Community Charter School said it was the largest brick-and-mortar charter school in Pennsylvania. The K-8, four-campus school says it serves more than 4,000 students. Chester Township is about 22 miles southwest of Center City Philadelphia.",
                "I*nvestigators said they found consistent accounts that staffers used “shoulder work” — including pinching pressure points on the neck, placing children in holds with their arms crossed in front of them and pushing knees into students’ backs — as a way of gaining physical compliance, the affidavit said.*\n\nTwo levels of staff guilt in this charter school: 1) the coercive actors 2) the silent staff bystanders.",
                "I worked with children like this for 20 years. We stopped doing physical holds many many years ago because it was abusive,  it hurts and even kills children AND does nothing to control behavior in the long run.\n\nIt's lazy teaching, behavior management because it takes more time to build relationships, manage behaviors without being physical.\n\nShame on the staff, shame on the ones who didn't stop it or report it.",
                "So that's 9 for doing the abusing, and 11 for not reporting them. \n\n  \nAlso, a lot of job openings at the school per their website.",
                "*The victims, in grades K-5, were members of the school’s emotional support program, the office of Delaware County District Attorney Jack Stollsteimer said in a statement. Some of them were as young as 5 years old, the DA’s office said.*\n\n\nI'm so confused. The kids were the emotional support to the adults that abused them?",
                "100 incidents at Chester Community Charter School’s West Campus in November and December\n\nThat's multiple times a day, every single day. \n\nI feel for those kids, and hope those adults face some serious punishments.",
                "Why would Dahkeem Williams allow this to happen at his school?",
                "Those fuckers should rot.",
                "[removed]"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court sides with the FDA in dispute over sweet-flavored vaping products",
            "external_url": "https://www.denver7.com/politics/supreme-court/supreme-court-sides-with-the-fda-in-dispute-over-sweet-flavored-vaping-products",
            "upvotes": 296,
            "date": "04/02/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/66b2a87/2147483647/strip/true/crop/3000x1575+0+287/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F56%2F9c%2F310e201249a99d43a57f1e5b8160%2Fap25092546160361.jpg",
            "top_comments": [
                ">But the justices' unanimous decision throwing out a federal appeals court ruling is not the final word in the case, and the FDA could change its approach now that President Donald Trump has promised to “save” vaping.\n\nWait. Why did Trump promise to save vaping?",
                "Ah, so following that logic, surely we’re going to ban sweet/fruit/candy flavored alcohol too right?",
                "So can we ban all junk food now, if the standard is public benefit?",
                "The more sane and logical decisions this court hands down, the more worried I get; I feel like they're trying to build a cushion of legitimacy ahead of a ruling that will make Presidential Immunity look sane by comparison *^(\\*looks nervously at \"Can the President rewrite the Constitution via Executive Order\" case\\*)*",
                "How do we stop teens from vaping?\n\nBy making them have no smell at all and being even more discreet!"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Tesla reports 336,000 vehicle deliveries in first quarter, 13% drop from a year ago.",
            "external_url": "https://www.nbcnews.com/business/business-news/tesla-reports-336000-vehicle-deliveries-first-quarter-13-percent-drop-rcna199263",
            "upvotes": 2457,
            "date": "04/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250402-tesla-ch-0950-721f15.jpg",
            "top_comments": [
                "weirdly stock up a bit today. I guess rumor mill is saying Musk might be leaving the spotlight, but how does stock go up when sales go down??",
                "They were lying about vehicle sales in Canada and claiming fraudulent EV rebates. Which caused them to be banned from incentive programs and have been put under investigation. \n\nI wouldn't doubt if those numbers are even worse.",
                "That number is probably inflated. They have been lying about sales forever to inflate their stock price.",
                "Those are deliveries. New orders will have tanked way worse.\n\nNot just a Musk backlash. I read a couple of years ago that they would be in trouble eventually. Cost and fit and finish issues were being tolerated when they were the only game in town but now established car manufacturers are in play and they know how to build cars right.",
                "I know their stock price is down over the last few months but how the heck is it climbing today?  Makes no sense.",
                "Given that those are deliveries and not orders, I expect the drop in the 2nd quarter to be 50-60%. Musk doesn't care now that he has direct access to the Treasury. God only knows how much money he has stolen.\n\nEdit: Also, why is TSLA's stock going *up*‽ That makes no sense.",
                "> Investors were expecting Tesla to report deliveries of between 360,000 and 370,000 vehicles, according to StreetAccount.\n\nIt's actually even worse than it sounds because these were the most recent estimates. Three months ago the consensus estimates were 457,000. They dropped over 100K from their estimates and were *still* way too high.",
                "Not enough till it goes 0",
                "Yet the stock is up today. Their stock prices have no connection to reality, do they?",
                "Just imagine what it really is if they weren't mass shadow buying their own cars?"
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "04/03/2025 00:40:48 UTC"
}