{
    "posts": [
        {
            "category": "HOT",
            "title": "George Foreman: Heavyweight boxing legend dies aged 76, says family",
            "external_url": "https://www.bbc.com/news/articles/ckg8ez8201yo",
            "upvotes": 6248,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/05d5/live/82e5e820-06c3-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "[deleted]",
                "RIP legend. Crazy how I wasn’t even into boxing as a kid but still grew up knowing who he was.",
                "R.I.P. George\n\n>George Foreman named all of his five sons \"George Edward Foreman\" as a way to create a sense of unity and shared identity within the family.\n\nThat is going to be one confusing obituary!",
                "That grill was so clutch in my college days",
                "Our thoughts are with the George Foremans at this time. ",
                "Shit. Gotta pull out my old Forman grill and sear up a chicken breast in his memory.",
                "That's the last of the golden era heavyweights, right? End of an era.",
                "He was the oldest heavyweight champ in history when he won the belt in 1994 at 45 years old.",
                "Still set to fight Jake Paul next month.",
                "“When we were Kings” is so good if u haven’t seen it."
            ],
            "aggregate_sentiment": 70.0
        },
        {
            "category": "HOT",
            "title": "U.S. to revoke legal status of more than a half-million migrants, urges them to self deport",
            "external_url": "https://www.cbsnews.com/news/u-s-to-revoke-legal-status-of-over-a-half-million-migrants-chnv/",
            "upvotes": 6938,
            "date": "03/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/21/f77a5737-9f4d-4bf8-8759-61e97e11ba39/thumbnail/1200x630/732b2e545fbc7cfb3cc1d7a3177155cc/gettyimages-2206282830.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "I feel obliged to point out that Elon Musk and Melanie both worked illegally in the US and on that basis should also be deported. They are deporting folks for that offense, even many years on.",
                "\"We don't mind the ones who do it legally\"",
                "Let’s start with Elon Musk.",
                "He is doing this to up the deportation numbers.  He has run out of undocumented folks.  So now he has to create some new ones by snatching documents away.\n\nThese folks have jobs.  They are paying rent and mortgages. They have started their own businesses.  They are paying taxes.  They have revitalized communities.  They are decent people just trying to live a better life here.  \n\nTrump wants to throw these people out but let white South Africans in.  The racism couldn't be any more overt.",
                "They are so shit at deporting illegal immigrants that they go to legal ones",
                "But I thought they just hated the people here illegally? They kept saying that they were cool with immigrants as long as they do it legally. Were they just lying to mask their racism? Naw...",
                "Is Melania on that list 🤔🤔🤔🤔",
                "An article the other day noted that most of Trump’s immigration policy is currently targeting those who are here legally, but on “borrowed time” due to asylum seeking or refugee status. That is a rapid way to get numbers. The numbers from that policy, and the videos of illegal immigrants being treated inhumanly feeds his sociopath base.\n\nIt should be noted, a lot of posts have been saying, “Is this what you voted for!?” In regards to Cubans seeing Cubans being deported and such. You need to understand: This IS exactly what they voted for. Legal immigrants do not give a shit about their brethren who are not legal. All they see are “illegals” being kicked out of THEIR country that they “earned”. The fact that most MAGA folks would gladly see these same “legal” immigrants kicked out of THEIR country does not even register: Everyone thinks they are one of the “good ones” when it comes to hating immigrants.",
                "These are people who came here and followed the rules.  They didn’t sneak across any borders.    They did nothing wrong.   \n\nThe conservatives cant even pretend like this is about respecting the rule of law.   This is just blatant hateful bullshit.",
                "This isn’t isolated to legal migrants. This will end up being some kind of convoluted blanket order just like the aliens act."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Tate brothers say they have left US to return to Romania",
            "external_url": "https://www.bbc.com/news/articles/cvgw0w7147vo",
            "upvotes": 13329,
            "date": "03/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b815/live/88e93ad0-06bc-11f0-88b7-5556e7b55c5e.jpg",
            "top_comments": [
                "selfies w/ pizza box or it never happened",
                ">\"Innocent men don't run. They clear their name in court.\"\n\nThis guy literally fled to Romania to escape rape charges in the uk.\n\nWhat a fucking dog dong.",
                "And nothing of value was lost. Fuck these twats",
                "They're going back for their court appearance, which was part of the agreement to relax their travel restrictions. That said, I was half-expecting Trump to harbour them.",
                "If I never heard about the Tate brothers again it would make my life better",
                "The only place they should be going is prison. They should never have been allowed to travel here in the first place. Edit: it's also disgusting this dude still has ten MILLION Twitter followers.",
                "Remember, trump wasted time rallying to free these rapists. Time he was supposed to be spending serving the American people. Instead he was fighting for rapists.",
                "[removed]",
                "Bring back oubliettes.",
                "He seems to really take interest in Romania. Wonder if its the secret location of his missing chin."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Musk group offers $100 to Wisconsin voters ahead of pivotal state Supreme Court election",
            "external_url": "https://www.cnbc.com/2025/03/21/musk-group-offers-100-to-wisconsin-voters-ahead-of-pivotal-state-supreme-court-election.html",
            "upvotes": 28154,
            "date": "03/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108057782-1730819740490-gettyimages-2182402967-AFP_36LH6F6.jpeg?v=1730819836&w=1920&h=1080",
            "top_comments": [
                "$100 dollars in exchange for your freedom, great deal",
                "George Soros should do the exact same thing so this practice will get banned in one nanosecond.",
                "So he's offering bribes....which is illegal.",
                "I would ask how any of this is legal, but apparently everything is legal if no one challenges you on it. He did this during the general election and got away with zero consequences. And got his guy elected. And now that they’re talking about deporting protesters, I don’t know what the fuck we’re supposed to do.",
                "Imagine if Democrats paid for votes.\n\nIt would be the end of the world with the MAGA cult. \n\nNone stop 24/7 news coverage of the end of the republic. \n\nBut when Trump and crew do it, perfectly fine.",
                "Elon musk is a domestic terrorist",
                "The fact he needs to pay people for their vote suggests that the candidate he supports has no other positive qualifications and cannot win an election based on their merits.",
                "So it sounds like they're paying folks $100 to sign a petition about the upcoming election, which I'm assuming (cynically) is their way of tricking people into voting the way they want.  \n\nReminds me of that time Michael Moore put out an offer to college students that he'd buy them a clean pair of underwear if they registered to vote.  Didn't tell them how to vote, just to register.  And of course the justice system jumped on that with both feet.  Musk is going to get away with this, of course.",
                "Want to do something about it and make your voice heard?\n\nCALL THE WISCONSIN ELECTIONS COMMISSION\n\n608 266 8005\n\nDemand an investigation into this and explain how disgusted you are!",
                "He's such a moron. Gets all teary eyed and wondering why so many people hate him, and then he keeps doing stuff like this.\n\nZero sympathy for him."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "US to import eggs from Turkey and South Korea to ease prices",
            "external_url": "https://www.bbc.com/news/articles/c743g135vj9o",
            "upvotes": 2158,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2eb2/live/7b390f80-069b-11f0-ab19-cd63e1c90c04.jpg",
            "top_comments": [
                "By the time it gets to market here they need to rename them century eggs",
                "[removed]",
                "That’s pretty ridiculous considering that Mexico is right next door and has absolutely no issue with any egg shortage whatsoever?",
                "Because nothing does more to make something cheaper than flying it half way around the world.",
                "No word on HOW this will help prices. But who cares it makes a nice headline. \n\n  \nOh and $400 million for farmer relief? Glad we DOGE'd all those socialist programs and cut off the entitled folks!",
                "Shipping them halfway around the world is sure to save money",
                "These eggs better not be brown eggs or they're going straight to Guantanamo Bay.",
                "Would be really funny if Turkey and South Korea imposed tariffs on eggs",
                "I thought prices were high because of Joe Biden raising prices!",
                "Wait until 3+ million eggs arrive and are paid for and they’re all contaminated."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Anti-Vaxx Mom Whose Daughter Died From Measles Says Disease 'Wasn't That Bad'",
            "external_url": "https://www.latintimes.com/anti-vaxx-mom-whose-daughter-died-measles-says-disease-wasnt-that-bad-578871",
            "upvotes": 37490,
            "date": "03/21/2025",
            "thumbnail": "https://d.latintimes.com/en/full/571807/measles-texas.jpg",
            "top_comments": [
                ">they argued that if measles patients had access to untested treatments, the MMR vaccines would be entirely unnecessary\n\nOf course we need untested treatments because the tested and safe prevention is the problem.",
                "\"Wasn't that bad\"?\n\nIf dead children isn't that bad, what the fuck *IS* that bad?!",
                "How is this not considered child endangerment and neglect?",
                "When there is scientific proof that a medical treatment can save lives, and you still decide against, you should be held accountable. Regardless of their religious beliefs, these parents killed their child and should be convicted. This was a preventable death.",
                "Had some absolute idiot on another thread arguing that a parents opinion on their child's medical care is as valuable as a doctors and like just no, giving birth does not magically imbue you with extra knowledge or critical thinking skills.",
                "It’s beyond sad when political bias and an almost religious fervor towards conspiracy theory makes you belittle even the death of your own child.\n\nEdit: spelling",
                "# 'Wasn't That Bad'\n\nfor me",
                "How do you reason with people who will watch their kids die to “own the libs”.",
                "God this country fucking sucks right now.",
                ">Hailing from the Mennonite community\n\nTIL if your kid dies due to neglect, you can just claim that your mythological beliefs are more important than the kids life."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Tesla owners are trading in their EVs at record levels, Edmunds says",
            "external_url": "https://www.cnbc.com/2025/03/20/tesla-owners-are-trading-in-their-evs-at-record-levels-edmunds-says.html",
            "upvotes": 14835,
            "date": "03/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108114358-1741726193117-gettyimages-2203994536-AFP_36ZN8YB.jpeg?v=1742510993&w=1920&h=1080",
            "top_comments": [
                "People trading in their Teslas hurts Elon, because even if the brand doesn’t collapse, it’ll be harder to sell new models because the used surplus will be so huge that the prices will collapse fast on new releases, nobody is going to buy a new model on release year when they can just buy the last years model for a portion of the price when the demand sinks that low. \n\nAnd that’s *if* the company manages to persist into the future.",
                "The people I know who bought Teslas were well off yuppies, liberal and who cared about the environment (mean that in the best way possible).  Teslas are not cheap and the people who bought them did so instead of something like a BMW or Range Rover.  I myself was considering one before I went for a BMW.  \n\nTesla was like the Apple brand of the car world. \n\nAnd Elon just antagonized that entire base.  Those same folks are embarrassed by their purchase now. ",
                "Gotta do it now before it becomes illegal",
                "I had one of the first 600 Tesla Model Ys. With taxes, etc., it came out to a pretty penny (north of $60k). It was a fun, engaging car and whoo boy that acceleration was bonkers.\n\nThen the reality set in. I kept trying to push through the inconveniences but damned if they didn’t add up quickly. To whit:\n\n1.) A software update meant to improve the positional accuracy of the map bricked - get this - the A/C system. In the summer. It was literally a guessing game whether the A/C would turn on when I got in the car. Persisted for about 3 months before a patch was rolled out.\n\n2.) The vaunted heat pump quit twice, once in winter (as we were moving across the country). Only a threat of litigation got the service center to replace the unit. Replacing it took the service center nearly a week.\n\n3.) A simple windshield replacement was needed after a rock caused a crack that started spreading. I scheduled service (soonest I could get a spot was 4 weeks out) which got delayed an additional whole month because “Our glass guy is sick,” and yet another whole month because “We don’t have glass.”\n\n4.) At 4 years of ownership, it was found that elements of the sub-frame were developing soon-to-be catastrophic cracks. No, I didn’t rally race it. Yes, I was religious about washing road salt off of it in wintertime. The upper control arm bushing was also “shredded” according to Firestone.\n\nAfter #4 happened, I drove to a dealership that literal same day and traded it in.",
                "Tesla served its original purpose:  making EV's more commonplace.  It's time for them to either go away or fix themselves.",
                "I forgot who in particular said it, but some industry person once said that the best indicator of a downturn of a brand is to take a look at the resale numbers. So inventory rise, and how steep the asking price is. You get those two together - and it's not always merely a supply surge issue - there is something in the underlying that there is no recovering from. \n\nGranted, it would be by far in Tesla's own interest to dump Musk, but the problem won't go away until Musk divests entirely. It must be shown that Musk can not benefit from their own successes - especially one that funded Trump directly.",
                "\"Hi there, Honest Don Trump here for Musk Motors, or MAGA motors as I like to call it.\n\nWe've got a fire sale a-brewin' and prices are falling faster than Titanic tickets after the iceberg.\n\nWe're located right off the mall, in front of that big white house where I'm standing.\n\nDid I tell you the dashboard looks real neat?\"",
                "Poorly ran company without leadership or any quality control standards on their products. Actively dangerous auto driver system linked to dozens of deaths. \n\nNo idea why anyone would want to own a Tesla right now. They’re like BlackBerry. They’re product is only popular because it was first, not because it’s the best. ",
                "Yep, my wife and I just traded her model 3 for a Lucid sedan. We would have 100% stayed with Tesla if not for Mr Dyed Hair Plugs Laminated Face.  Anything I can do to bring about his destruction, I am here for.  This is the start of the class wars.  Choose a side.",
                "https://imgur.com/gallery/z5oA7RV\n\n0% APR Cars because nobody wants a Tesla rn\n\nCan't even give these away with 0% apr and a $7500 tax credit\n\nLol."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "‘It's a huge problem': Man says he was shot at while driving Tesla in Lowell",
            "external_url": "https://www.nbcboston.com/news/local/its-a-huge-problem-man-says-he-was-shot-at-while-driving-tesla-in-lowell/3664545/",
            "upvotes": 2200,
            "date": "03/21/2025",
            "thumbnail": "https://media.nbcboston.com/2025/03/Tesla-shot-032025.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Gonna have to drive around in a Lincoln Continental.\n\nNo one has ever been shot at in a Lincoln Continental.",
                "Yeah, but…Lowell. \n\nThat’s like saying you saw a neon sign in Las Vegas.",
                "Lowell Massachusetts...\n\nEven with everything going on with Tesla now, my gut guess is still that has more to do with road rage than the car he is driving.",
                "Idk man but I feel like you can get shot at in Lowell without driving a Tesla 😂😂",
                "What was the Tesla wearing?",
                "Review the footage from the tesla cams.",
                "That's a Lowell issue, not a Tesla issue. \n\nI live in Texas and have never been to Lowell, Mass or anywhere near it and I know about Lowell's reputation.",
                "So was he shot at cuz he was driving a Tesla? Or was he shot at cuz he was in a neighborhood that he shouldn’t have been in?",
                "Yeah I doubt this is a Tesla issue and more of a wrong neighborhood wrong time issue.\n\nI live 45 mins from Milwaukee, WI, my entire family is from the Mil and a good chunk still live there or in surrounding suburbs and everyone knows there is certain areas to avoid no matter what demographic you are because those areas have a ridiculous crime rate and bullets don't discriminate.\n\nTesla/Elon simps will flip any script to play the victim as long as they get attention.",
                "There’s like a 99% chance this guy didn’t just get randomly shot at because he’s driving a Tesla. It’s probably road rage. Lowell traffic sucks, driving in Lowell sucks, and people in Lowell suck, but they don’t really give a fuck what car you’re driving."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "George Foreman, heavyweight boxing champion, dies at 76",
            "external_url": "https://www.nbcnews.com/news/obituaries/george-foreman-heavyweight-boxing-champion-dies-76-rcna197589",
            "upvotes": 382,
            "date": "03/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250321-george-foreman-obit-1974-ac-1017p-e05d7c.jpg",
            "top_comments": [
                "Thanks for all the burgers, George",
                "That grill was a game changer during the college years.",
                "Very sad news my condolences. One of the truly great in sport and humanity.",
                "He knocked out the fat.",
                "He was a great entertainer and showman.\n\nLoved his boxing more tho.\n\nHis unorthodox guard and the feet lifting from the floor of his opponents was great!\n\nMaybe the hardest hiting man on the planet?",
                "RIP Big George! Had your grill back in the day, you will forever be an icon.",
                "I was just enlightening my family about the George Foreman grill the other day. R I P.",
                "\"I'm so proud of it, I put my name on it!\"",
                "Our thoughts are with all George Foremans.",
                "Georgemen grill memes incoming 🔥 🔥 🔥"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "HOT",
            "title": "Woman killed during conjugal prison visit in CA",
            "external_url": "https://www.latimes.com/california/story/2025-03-19/prisoner-wife-strangled-conjugal-visit",
            "upvotes": 822,
            "date": "03/21/2025",
            "thumbnail": "https://ca-times.brightspotcdn.com/dims4/default/34ae215/2147483647/strip/true/crop/2000x1050+0+142/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa4%2F82%2F521f41be44ef88f97209a1519c66%2F1342724-me-cdcr-prison-program-16-brv.jpg",
            "top_comments": [
                "According to [this article](https://ktla.com/news/local-news/woman-killed-during-conjugal-visit-with-infamous-california-murderer-officials-say/?nxsparam=1), the coroner said she was strangled to death. They’re waiting on a full report from the prison to charge him.",
                "This article is poorly written. While it says that she was killed by her husband, it also says that he reported that she had passed out and that they didn't have enough information to make a decision on charging him with anything. So... did he kill her? Did she have some kind of medical emergency? If the warden can't answer that, why is it being reported as a murder?",
                "Why does a man who has killed 4 men and has no chance of parole get to have \"conjugal visits??\"  And no doubt he will plead \"rough sex,\" as a defense if he bothers with it.",
                "How is that even a news article? There is very little information about it.",
                "The other prisoners are going to kill this dude. They will all lose the conjugal visit privilege for an extended amount of time",
                "The notion that men, even the most dangerous criminals, are entitled to sex, is very strange to me.",
                "The will probably do away with conjugal visits now. Thanks asshole got fucking it up for everyone else.",
                "Wtf are conjugal visits in prison still a thing",
                "Add on a few more life sentences?",
                "Well, who could've seen that coming? Not like a 4x murderer would commit...murder.  Also, who in their right mind wants to \\*\\*\\*\\* a 4x murderer??"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Nasa drops plan to land first woman and first person of color on the moon",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/21/nasa-drops-plan-first-woman-moon",
            "upvotes": 4,
            "date": "03/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/aac07bc3d883357f77e67ceb6bb53fc3c2f780a4/0_0_5000_3001/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b698ce2e793d534258c22be90188bb91",
            "top_comments": [
                "Mmmmmm as a dude currently subjected to the attacks on science… I would suspect there’s a decent chance that they simply decide a woman and PoC are most qualified for the next mission…"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "NEW",
            "title": "US gets eggs from Turkey and South Korea",
            "external_url": "https://www.bbc.com/news/articles/c743g135vj9o.amp",
            "upvotes": 0,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2eb2/live/7b390f80-069b-11f0-ab19-cd63e1c90c04.jpg",
            "top_comments": [
                "These won’t be going straight to grocery shelves.  Don’t kid yourself.  It won’t save us a dime.",
                "Most likely for the industry to make processed food.",
                "That’s because everyone else told them to fuck off."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "US blocks Canadian access to cross-border library, sparking outcry",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/21/canada-cross-border-library?CMP=share_btn_url",
            "upvotes": 55,
            "date": "03/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/896590de944abc7f9ddf2c147dceb85b4673350c/0_102_3000_1799/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=312bc3be6ceef427b444ced2c69a4dca",
            "top_comments": [
                "For those who don't read past the fold:\n\n\"In a statement to Reuters, a Department of Homeland Security spokesperson said the US was responding to drug trafficking.\n\n“Drug traffickers and smugglers were exploiting the fact that Canadians could use the US entrance without going through customs. We are ending such exploitation by criminals and protecting Americans,” the statement said.\n\nThe department provided no evidence of drug trafficking or smuggling and did not immediately respond to a request for additional information.\"",
                "This Administration is so focused on performative nonsense for the mouth breathing Fox News crowd. It's exhausting.",
                "Didn’t the Nazis do that in Germany once upon a time?",
                "Outcry may be a strong word. Canadians aren’t getting close enough to the US border to care."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "13 year old boy shoots and kills 14 year old girl in Baytown just outside of Houston, Texas.",
            "external_url": "https://www.click2houston.com/news/local/2025/03/21/teenage-boy-shoots-kills-girl-at-baytown-apartment-complex-playground-following-school-bus-altercation/",
            "upvotes": 77,
            "date": "03/22/2025",
            "thumbnail": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/EE4SV5JBWNCHJDNBWSENDAHNSQ.png?_a=DATAdtfiZAA0",
            "top_comments": [
                "At the very least, an adult somewhere adjacent to that event should go to prison for making the gun available. (whether deliberately or through negligence)",
                "This is so sad. Parents should be charged for not safely securing a firearm.",
                "Murder is murder. He should be tried as an adult",
                "Uh it's 2025. Dead kids don't matter, only unaware unliving unthinking clumps of fetal tissue.",
                "Guns readily available are not the issue. \n\nApparently. \n\nFuck this timeline. \n\n(Am a multiple gun owner and tired of this shit.)",
                "Oh, Texas. We have tried nothing and are all out of ideas on how to solve gun issues, but we can come up with bills like the Furries Act. \n\n\nMay that poor girl rest in peace, and hopefully her family gets all of the support they need to process their grief. ",
                "I forget which subreddit it was , but there was a guy bragging about teaching his 4 yr old gun safety and letting the child touch the gun … some people deserve to have their children taken away ..",
                "this is so sad why do they have to hurt each other\n\njust play more Fortnite or something"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "NEW",
            "title": "George Foreman, heavyweight boxing champion, dies at 76",
            "external_url": "https://www.nbcnews.com/news/obituaries/george-foreman-heavyweight-boxing-champion-dies-76-rcna197589",
            "upvotes": 384,
            "date": "03/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250321-george-foreman-obit-1974-ac-1017p-e05d7c.jpg",
            "top_comments": [
                "Thanks for all the burgers, George",
                "That grill was a game changer during the college years.",
                "Very sad news my condolences. One of the truly great in sport and humanity.",
                "He knocked out the fat.",
                "He was a great entertainer and showman.\n\nLoved his boxing more tho.\n\nHis unorthodox guard and the feet lifting from the floor of his opponents was great!\n\nMaybe the hardest hiting man on the planet?",
                "RIP Big George! Had your grill back in the day, you will forever be an icon.",
                "I was just enlightening my family about the George Foreman grill the other day. R I P.",
                "\"I'm so proud of it, I put my name on it!\"",
                "Our thoughts are with all George Foremans.",
                "Georgemen grill memes incoming 🔥 🔥 🔥"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "George Foreman: Heavyweight boxing legend dies aged 76, says family",
            "external_url": "https://www.bbc.com/news/articles/ckg8ez8201yo",
            "upvotes": 6251,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/05d5/live/82e5e820-06c3-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "[deleted]",
                "RIP legend. Crazy how I wasn’t even into boxing as a kid but still grew up knowing who he was.",
                "R.I.P. George\n\n>George Foreman named all of his five sons \"George Edward Foreman\" as a way to create a sense of unity and shared identity within the family.\n\nThat is going to be one confusing obituary!",
                "That grill was so clutch in my college days",
                "Our thoughts are with the George Foremans at this time. ",
                "Shit. Gotta pull out my old Forman grill and sear up a chicken breast in his memory.",
                "That's the last of the golden era heavyweights, right? End of an era.",
                "He was the oldest heavyweight champ in history when he won the belt in 1994 at 45 years old.",
                "Still set to fight Jake Paul next month.",
                "“When we were Kings” is so good if u haven’t seen it."
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "NEW",
            "title": "US to import eggs from Turkey and South Korea to ease prices",
            "external_url": "https://www.bbc.com/news/articles/c743g135vj9o",
            "upvotes": 2160,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2eb2/live/7b390f80-069b-11f0-ab19-cd63e1c90c04.jpg",
            "top_comments": [
                "By the time it gets to market here they need to rename them century eggs",
                "[removed]",
                "That’s pretty ridiculous considering that Mexico is right next door and has absolutely no issue with any egg shortage whatsoever?",
                "Because nothing does more to make something cheaper than flying it half way around the world.",
                "No word on HOW this will help prices. But who cares it makes a nice headline. \n\n  \nOh and $400 million for farmer relief? Glad we DOGE'd all those socialist programs and cut off the entitled folks!",
                "Shipping them halfway around the world is sure to save money",
                "These eggs better not be brown eggs or they're going straight to Guantanamo Bay.",
                "Would be really funny if Turkey and South Korea imposed tariffs on eggs",
                "I thought prices were high because of Joe Biden raising prices!",
                "Wait until 3+ million eggs arrive and are paid for and they’re all contaminated."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Columbia agrees to government demands in bid to restore funding",
            "external_url": "https://www.reuters.com/world/us/columbia-research-takes-immediate-hit-trump-funding-cuts-2025-03-21/",
            "upvotes": 400,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "At least the silver lining in this miserable timeline is quickly exposing just how many spineless cowards are amongst us.",
                "“Hires special officers that are allowed to make on campus arrests” \n\nAmerica sure loves their freedom.",
                "There's no point in capitulating to the demands of this government. They don't have any honor and will pull the rug on anything they don't like regardless of what is agreed to.\n\nIt's also not a good look to cave to a fascist regime.",
                "Turns out the Ivory Tower was just as much of a facade as the Shining City on the Hill.",
                "MAGA hates the college educated. It doesn't matter what Columbia does. The Trump administration will just find something else to hold money over.",
                "\"The New York-based university, acquiescing to the demands in a memo released on Friday, laid out plans to ban face masks on campus, empower security officers to remove or arrest individuals, and place a new official in charge of the department that offers courses on the Middle East.\"\n\n\nImagine losing 400 million because you allow students to wear face maks...",
                "I really hope the other universities and colleges grow a spine and challenge trump in court ..",
                "and they just became a satellite campus of Liberty University.",
                "What a bunch of cowards.",
                "Columbia has an almost $15BN endowment. The worst kind of cowards."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "U.S. to revoke legal status of more than a half-million migrants, urges them to self deport",
            "external_url": "https://www.cbsnews.com/news/u-s-to-revoke-legal-status-of-over-a-half-million-migrants-chnv/",
            "upvotes": 6930,
            "date": "03/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/21/f77a5737-9f4d-4bf8-8759-61e97e11ba39/thumbnail/1200x630/732b2e545fbc7cfb3cc1d7a3177155cc/gettyimages-2206282830.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "I feel obliged to point out that Elon Musk and Melanie both worked illegally in the US and on that basis should also be deported. They are deporting folks for that offense, even many years on.",
                "\"We don't mind the ones who do it legally\"",
                "Let’s start with Elon Musk.",
                "He is doing this to up the deportation numbers.  He has run out of undocumented folks.  So now he has to create some new ones by snatching documents away.\n\nThese folks have jobs.  They are paying rent and mortgages. They have started their own businesses.  They are paying taxes.  They have revitalized communities.  They are decent people just trying to live a better life here.  \n\nTrump wants to throw these people out but let white South Africans in.  The racism couldn't be any more overt.",
                "They are so shit at deporting illegal immigrants that they go to legal ones",
                "But I thought they just hated the people here illegally? They kept saying that they were cool with immigrants as long as they do it legally. Were they just lying to mask their racism? Naw...",
                "Is Melania on that list 🤔🤔🤔🤔",
                "An article the other day noted that most of Trump’s immigration policy is currently targeting those who are here legally, but on “borrowed time” due to asylum seeking or refugee status. That is a rapid way to get numbers. The numbers from that policy, and the videos of illegal immigrants being treated inhumanly feeds his sociopath base.\n\nIt should be noted, a lot of posts have been saying, “Is this what you voted for!?” In regards to Cubans seeing Cubans being deported and such. You need to understand: This IS exactly what they voted for. Legal immigrants do not give a shit about their brethren who are not legal. All they see are “illegals” being kicked out of THEIR country that they “earned”. The fact that most MAGA folks would gladly see these same “legal” immigrants kicked out of THEIR country does not even register: Everyone thinks they are one of the “good ones” when it comes to hating immigrants.",
                "These are people who came here and followed the rules.  They didn’t sneak across any borders.    They did nothing wrong.   \n\nThe conservatives cant even pretend like this is about respecting the rule of law.   This is just blatant hateful bullshit.",
                "This isn’t isolated to legal migrants. This will end up being some kind of convoluted blanket order just like the aliens act."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Woman killed during conjugal prison visit in CA",
            "external_url": "https://www.latimes.com/california/story/2025-03-19/prisoner-wife-strangled-conjugal-visit",
            "upvotes": 816,
            "date": "03/21/2025",
            "thumbnail": "https://ca-times.brightspotcdn.com/dims4/default/34ae215/2147483647/strip/true/crop/2000x1050+0+142/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa4%2F82%2F521f41be44ef88f97209a1519c66%2F1342724-me-cdcr-prison-program-16-brv.jpg",
            "top_comments": [
                "According to [this article](https://ktla.com/news/local-news/woman-killed-during-conjugal-visit-with-infamous-california-murderer-officials-say/?nxsparam=1), the coroner said she was strangled to death. They’re waiting on a full report from the prison to charge him.",
                "This article is poorly written. While it says that she was killed by her husband, it also says that he reported that she had passed out and that they didn't have enough information to make a decision on charging him with anything. So... did he kill her? Did she have some kind of medical emergency? If the warden can't answer that, why is it being reported as a murder?",
                "Why does a man who has killed 4 men and has no chance of parole get to have \"conjugal visits??\"  And no doubt he will plead \"rough sex,\" as a defense if he bothers with it.",
                "How is that even a news article? There is very little information about it.",
                "The other prisoners are going to kill this dude. They will all lose the conjugal visit privilege for an extended amount of time",
                "The notion that men, even the most dangerous criminals, are entitled to sex, is very strange to me.",
                "The will probably do away with conjugal visits now. Thanks asshole got fucking it up for everyone else.",
                "Wtf are conjugal visits in prison still a thing",
                "Add on a few more life sentences?",
                "Well, who could've seen that coming? Not like a 4x murderer would commit...murder.  Also, who in their right mind wants to \\*\\*\\*\\* a 4x murderer??"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "George Foreman: Heavyweight boxing legend dies aged 76, says family",
            "external_url": "https://www.bbc.com/news/articles/ckg8ez8201yo",
            "upvotes": 6236,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/05d5/live/82e5e820-06c3-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "[deleted]",
                "RIP legend. Crazy how I wasn’t even into boxing as a kid but still grew up knowing who he was.",
                "R.I.P. George\n\n>George Foreman named all of his five sons \"George Edward Foreman\" as a way to create a sense of unity and shared identity within the family.\n\nThat is going to be one confusing obituary!",
                "That grill was so clutch in my college days",
                "Our thoughts are with the George Foremans at this time. ",
                "Shit. Gotta pull out my old Forman grill and sear up a chicken breast in his memory.",
                "That's the last of the golden era heavyweights, right? End of an era.",
                "He was the oldest heavyweight champ in history when he won the belt in 1994 at 45 years old.",
                "Still set to fight Jake Paul next month.",
                "“When we were Kings” is so good if u haven’t seen it."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "George Foreman, heavyweight boxing champion, dies at 76",
            "external_url": "https://www.nbcnews.com/news/obituaries/george-foreman-heavyweight-boxing-champion-dies-76-rcna197589",
            "upvotes": 383,
            "date": "03/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250321-george-foreman-obit-1974-ac-1017p-e05d7c.jpg",
            "top_comments": [
                "Thanks for all the burgers, George",
                "That grill was a game changer during the college years.",
                "Very sad news my condolences. One of the truly great in sport and humanity.",
                "He knocked out the fat.",
                "He was a great entertainer and showman.\n\nLoved his boxing more tho.\n\nHis unorthodox guard and the feet lifting from the floor of his opponents was great!\n\nMaybe the hardest hiting man on the planet?",
                "RIP Big George! Had your grill back in the day, you will forever be an icon.",
                "I was just enlightening my family about the George Foreman grill the other day. R I P.",
                "\"I'm so proud of it, I put my name on it!\"",
                "Our thoughts are with all George Foremans.",
                "Georgemen grill memes incoming 🔥 🔥 🔥"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "U.S. to revoke legal status of more than a half-million migrants, urges them to self deport",
            "external_url": "https://www.cbsnews.com/news/u-s-to-revoke-legal-status-of-over-a-half-million-migrants-chnv/",
            "upvotes": 6936,
            "date": "03/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/21/f77a5737-9f4d-4bf8-8759-61e97e11ba39/thumbnail/1200x630/732b2e545fbc7cfb3cc1d7a3177155cc/gettyimages-2206282830.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "I feel obliged to point out that Elon Musk and Melanie both worked illegally in the US and on that basis should also be deported. They are deporting folks for that offense, even many years on.",
                "\"We don't mind the ones who do it legally\"",
                "Let’s start with Elon Musk.",
                "He is doing this to up the deportation numbers.  He has run out of undocumented folks.  So now he has to create some new ones by snatching documents away.\n\nThese folks have jobs.  They are paying rent and mortgages. They have started their own businesses.  They are paying taxes.  They have revitalized communities.  They are decent people just trying to live a better life here.  \n\nTrump wants to throw these people out but let white South Africans in.  The racism couldn't be any more overt.",
                "They are so shit at deporting illegal immigrants that they go to legal ones",
                "But I thought they just hated the people here illegally? They kept saying that they were cool with immigrants as long as they do it legally. Were they just lying to mask their racism? Naw...",
                "Is Melania on that list 🤔🤔🤔🤔",
                "An article the other day noted that most of Trump’s immigration policy is currently targeting those who are here legally, but on “borrowed time” due to asylum seeking or refugee status. That is a rapid way to get numbers. The numbers from that policy, and the videos of illegal immigrants being treated inhumanly feeds his sociopath base.\n\nIt should be noted, a lot of posts have been saying, “Is this what you voted for!?” In regards to Cubans seeing Cubans being deported and such. You need to understand: This IS exactly what they voted for. Legal immigrants do not give a shit about their brethren who are not legal. All they see are “illegals” being kicked out of THEIR country that they “earned”. The fact that most MAGA folks would gladly see these same “legal” immigrants kicked out of THEIR country does not even register: Everyone thinks they are one of the “good ones” when it comes to hating immigrants.",
                "These are people who came here and followed the rules.  They didn’t sneak across any borders.    They did nothing wrong.   \n\nThe conservatives cant even pretend like this is about respecting the rule of law.   This is just blatant hateful bullshit.",
                "This isn’t isolated to legal migrants. This will end up being some kind of convoluted blanket order just like the aliens act."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "US to import eggs from Turkey and South Korea to ease prices",
            "external_url": "https://www.bbc.com/news/articles/c743g135vj9o",
            "upvotes": 2156,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2eb2/live/7b390f80-069b-11f0-ab19-cd63e1c90c04.jpg",
            "top_comments": [
                "By the time it gets to market here they need to rename them century eggs",
                "[removed]",
                "That’s pretty ridiculous considering that Mexico is right next door and has absolutely no issue with any egg shortage whatsoever?",
                "Because nothing does more to make something cheaper than flying it half way around the world.",
                "No word on HOW this will help prices. But who cares it makes a nice headline. \n\n  \nOh and $400 million for farmer relief? Glad we DOGE'd all those socialist programs and cut off the entitled folks!",
                "Shipping them halfway around the world is sure to save money",
                "These eggs better not be brown eggs or they're going straight to Guantanamo Bay.",
                "Would be really funny if Turkey and South Korea imposed tariffs on eggs",
                "I thought prices were high because of Joe Biden raising prices!",
                "Wait until 3+ million eggs arrive and are paid for and they’re all contaminated."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Heathrow flights to resume as police investigate 'catastrophic' fire which cut power to Europe's busiest airport",
            "external_url": "https://www.abc.net.au/news/2025-03-22/heathrow-airport-flight-updates-after-fire/105084144",
            "upvotes": 301,
            "date": "03/21/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/29159852e06243f60920345f3274bf7b?impolicy=wcms_watermark_news&cropH=855&cropW=1521&xPos=168&yPos=176&width=862&height=485&imformat=generic",
            "top_comments": [
                "It would not surprise me in the least to hear that a russian asset was used to start this fire. It highlights just how exposed the UK (and other European countries) are to attacks like this one.",
                "probably putins orders. . .",
                "*A Heathrow Airport spokesperson apologised for the inconvenience caused by the fire and said its priority was to repatriate passengers whose flights were diverted.* \n\n\"Inconvenience\" or more like plan-shattering and awfully distressing.",
                "Wow how can you only have one set of infrastructure for such a critical resource."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Columbia agrees to government demands in bid to restore funding",
            "external_url": "https://www.reuters.com/world/us/columbia-research-takes-immediate-hit-trump-funding-cuts-2025-03-21/",
            "upvotes": 393,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "At least the silver lining in this miserable timeline is quickly exposing just how many spineless cowards are amongst us.",
                "“Hires special officers that are allowed to make on campus arrests” \n\nAmerica sure loves their freedom.",
                "There's no point in capitulating to the demands of this government. They don't have any honor and will pull the rug on anything they don't like regardless of what is agreed to.\n\nIt's also not a good look to cave to a fascist regime.",
                "Turns out the Ivory Tower was just as much of a facade as the Shining City on the Hill.",
                "MAGA hates the college educated. It doesn't matter what Columbia does. The Trump administration will just find something else to hold money over.",
                "\"The New York-based university, acquiescing to the demands in a memo released on Friday, laid out plans to ban face masks on campus, empower security officers to remove or arrest individuals, and place a new official in charge of the department that offers courses on the Middle East.\"\n\n\nImagine losing 400 million because you allow students to wear face maks...",
                "I really hope the other universities and colleges grow a spine and challenge trump in court ..",
                "and they just became a satellite campus of Liberty University.",
                "What a bunch of cowards.",
                "Columbia has an almost $15BN endowment. The worst kind of cowards."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Measles cases linked to outbreak in Texas reach 309, surpassing nationwide total in 2024",
            "external_url": "https://abcnews.go.com/Health/measles-cases-linked-outbreak-texas-reach-309-surpassing/story?id=120019612",
            "upvotes": 1381,
            "date": "03/21/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/2bd4b7ed-c6eb-488a-b2ea-bc68edd2402a/measles-vaccine-ap-jt-250311_1741733496689_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Don’t worry.  I heard it’s not that bad, even if you die.",
                "I feel bad for the kids.\n\nThey didn’t even really get a choice to be vaccinated or not.",
                "This update adds 30 new cases to the number of reported cases in Texas associated with the outbreak. Tuesday’s update added 20 new cases, last Friday’s update added 36 cases, and last Tuesday’s added 25.",
                "I wonder if RFK Jr. has found any super-resistant kids, yet?",
                "And the parents have no liability for this? How many kids got sick with measles after spending time in the same place with the children who died?  Did any of THOSE people die?\n\nVaccines SAVE LIVES.  Why are all these morons risking KILLING their children?",
                "Take Notice World: this is what happens when you let actual morons, malignant or otherwise, make decisions. Learn from our idiotic mistakes.",
                "This disease spread brought to you by the Republican party who wants to take us kicking and screaming back to the Dark Ages.",
                "RFK Jr might be dumber than Trump and Musk which is really fucking impressive.",
                "Oklahoma has launched a website to report information about their measles cases. As part of the larger Texas/New Mexico/Oklahoma outbreak concentrated in a very conservative Mennonite group, Oklahoma has reported 4 cases. They will be updating their case count on Tuesdays.\n\nhttps://www.kosu.org/health/2025-03-21/oklahoma-health-department-launches-measles-update-page-after-4-reported-probable-cases",
                "There will be less cases if we stop testing for it\n\n-RFK jr, probably"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Man found with a live turtle concealed in his pants by TSA at a New Jersey airport",
            "external_url": "https://apnews.com/article/turtle-pants-airport-tsa-newark-airport-pennsylvania-f55bd62d33530e9cfd26488e230ad8df",
            "upvotes": 206,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is that a live turtle in your pants or are you just happy to see me?",
                "Mitch McConnell sure is getting adventurous in his old age...",
                "Should have bit his dick off",
                "A shell of a good time.",
                "Now I have to know why. What are the rest of us missing?",
                "The turtle was arrested for impersonating a codpiece.",
                "So they have found the almighty ass digger.",
                "A 'support' turtle no doubt. ",
                "Are you happy to visit New Jersey or is that a turtle in your pants?",
                "Not AGAIN!!\n\n\n(oops... nope.  Dated March 11, 2025 )"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "‘It's a huge problem': Man says he was shot at while driving Tesla in Lowell",
            "external_url": "https://www.nbcboston.com/news/local/its-a-huge-problem-man-says-he-was-shot-at-while-driving-tesla-in-lowell/3664545/",
            "upvotes": 2191,
            "date": "03/21/2025",
            "thumbnail": "https://media.nbcboston.com/2025/03/Tesla-shot-032025.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Gonna have to drive around in a Lincoln Continental.\n\nNo one has ever been shot at in a Lincoln Continental.",
                "Yeah, but…Lowell. \n\nThat’s like saying you saw a neon sign in Las Vegas.",
                "Lowell Massachusetts...\n\nEven with everything going on with Tesla now, my gut guess is still that has more to do with road rage than the car he is driving.",
                "Idk man but I feel like you can get shot at in Lowell without driving a Tesla 😂😂",
                "What was the Tesla wearing?",
                "Review the footage from the tesla cams.",
                "That's a Lowell issue, not a Tesla issue. \n\nI live in Texas and have never been to Lowell, Mass or anywhere near it and I know about Lowell's reputation.",
                "So was he shot at cuz he was driving a Tesla? Or was he shot at cuz he was in a neighborhood that he shouldn’t have been in?",
                "Yeah I doubt this is a Tesla issue and more of a wrong neighborhood wrong time issue.\n\nI live 45 mins from Milwaukee, WI, my entire family is from the Mil and a good chunk still live there or in surrounding suburbs and everyone knows there is certain areas to avoid no matter what demographic you are because those areas have a ridiculous crime rate and bullets don't discriminate.\n\nTesla/Elon simps will flip any script to play the victim as long as they get attention.",
                "There’s like a 99% chance this guy didn’t just get randomly shot at because he’s driving a Tesla. It’s probably road rage. Lowell traffic sucks, driving in Lowell sucks, and people in Lowell suck, but they don’t really give a fuck what car you’re driving."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Tate brothers say they have left US to return to Romania",
            "external_url": "https://www.bbc.com/news/articles/cvgw0w7147vo",
            "upvotes": 13331,
            "date": "03/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b815/live/88e93ad0-06bc-11f0-88b7-5556e7b55c5e.jpg",
            "top_comments": [
                "selfies w/ pizza box or it never happened",
                ">\"Innocent men don't run. They clear their name in court.\"\n\nThis guy literally fled to Romania to escape rape charges in the uk.\n\nWhat a fucking dog dong.",
                "And nothing of value was lost. Fuck these twats",
                "They're going back for their court appearance, which was part of the agreement to relax their travel restrictions. That said, I was half-expecting Trump to harbour them.",
                "If I never heard about the Tate brothers again it would make my life better",
                "The only place they should be going is prison. They should never have been allowed to travel here in the first place. Edit: it's also disgusting this dude still has ten MILLION Twitter followers.",
                "Remember, trump wasted time rallying to free these rapists. Time he was supposed to be spending serving the American people. Instead he was fighting for rapists.",
                "[removed]",
                "Bring back oubliettes.",
                "He seems to really take interest in Romania. Wonder if its the secret location of his missing chin."
            ],
            "aggregate_sentiment": 82.0
        }
    ],
    "last_updated": "03/22/2025 04:09:41 UTC"
}