{
    "posts": [
        {
            "category": "HOT",
            "title": "Elon Musk's xAI buys social media platform X for $45 billion",
            "external_url": "https://www.reuters.com/markets/deals/musks-xai-buys-social-media-platform-x-45-billion-2025-03-28/",
            "upvotes": 8188,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait... so he raised money from investors for xAI, used that money to buy himself out of the $40B Twitter hole that he dug himself?? This seems very questionable at best...",
                "At the same time as DOGE goes into the SEC as well. What an amazing coincidence ",
                "\"$45 billion\" of xAI stock... so you have to accept xAI's totally specious $75B valuation in order to believe this transaction is actually worth $45 billion.  What a joke.  \n\nxAI has raised around $20 billion from investors and sells nothing but vaporware.",
                "This is like when a no name influencer “sells” their shitty NFT to themselves for $10million",
                "Okay... what?\n\nThis must be some tax/loan reshuffling thing I'm too plebeian to understand",
                "This is exactly why he put his DOGE team within the SEC. Definitely committing fraud, but no one will be able to investigate him for it. We're so fucked in this country.",
                "So he Bought it for 45 billion Tanked it into the Ground to get Trump Elected. Then somehow Magically with no Innovation/ increase in revenue/ Advertisers didn't come back/ Multiple boycotts and Still the value went back up magically to what he bought it for? \n\nHe then Sells it from himself to a company owned by him in order to pay back the 45 billion dollar loan on the saudi's before they make a call on his Tesla Stock which he was tanking. and Somehow in all of this i'm pretty sure he paid Zero taxes somehow. \n\nThis Feels like all smoke and mirrors and there's got to be some Legality involved. Where's the SEC and the FTC oh right their being defanged and Gutted by Musk as we speak. \n\n  \n/sigh",
                "Moving the trash from one garbage bin to the other.",
                "An all stock transaction... From one private company to another private company, both fundamentally controlled by the same person. This is really just economic sophistry isn't it?",
                "Could this have something to do with him using Tesla shares to fund buying X? Now that Tesla price is dropping, does this do anything to shield himself from that?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Woman Arrested After Miscarriage In Georgia Under Abortion Law",
            "external_url": "https://thegeorgiasun.com/news/woman-arrested-after-miscarriage-in-georgia-under-abortion-law/",
            "upvotes": 14911,
            "date": "03/28/2025",
            "thumbnail": "https://thegeorgiasun.com/wp-content/uploads/2022/06/shutterstock_2171223741-1170x694.jpg",
            "top_comments": [
                "You know what will help that person deal with the trauma of a miscarriage? The trauma of an arrest. That will surely improve her life /s",
                "\"*What Should Women Who Miscarry Do?: We asked several Tifton Police Department and Tift County officials what women who miscarry should do with the remains of the fetus. So far, only Tift District Attorney Patrick Warren has answered and said typically miscarriages are not handled in this manner.*\"\n\nSo they asked what she was supposed to do with the fetus and nobody had an answer.  If you can't tell her what she did wrong, why was she arrested?  Just because she probably didn't have a healthcare plan that would pay for it?",
                "\"The coroner’s office ruled it to be a occurring miscarriage\"\n\nI don't know if there's an official procedure of what to do with remains of a child when you have a miscarriage, but to jail and punish a mother for having one?   I mean... it's a miscarriage.  Did they want her to keep it in the fridge until the damn coroner can pick it up or something? Geeze! It's already traumatizing enough.",
                "People wonder why from the 1950s-70s why women hid miscarriages? This right here.",
                "What was she supposed to do with a dead fetus? At 19 weeks it was not close to viable. Women have been arrested for burying their stillborn children. Women miscarrying get turned away from hospitals because doctors are afraid to be accused of performing abortions. Maybe she didn’t even have the money to afford the ER visit (a whole other issue about how shitty the US is about healthcare).\n\nLook, I’ll be real with you. I used to work with animal control. Laws are different in different places, but when we had dead animals the law was two trash bags, into the dumpster. Trash bag/dumpster seems better to me than flushing it down the toilet. Burying it in the yard like a dead pet? If there are no laws regarding this, Tifton needs to leave this woman alone.",
                "Hey, remember when all the hippies were like \"these laws are going to be used to criminalize miscarriages!\" and the republicans were all \"nah, not us!\" and the hippies were right, just like we always are?",
                "Another article on the same topic. This is not an isolated case\n\n\nhttps://www.jezebel.com/georgia-police-jailed-woman-for-miscarriage-performed-autopsy-on-miscarried-fetus",
                "I have suffered from 2 miscarriages and I can say with absolute certainty that if, while healing physically and emotionally from a miscarriage, I had also been arrested for said miscarriage I would be ready to burn everything down.  I can also say with absolute  certainty that I still have not emotionally healed from my miscarriages, and neither has my husband.  It's one of those things where you never actually get over it, but time makes it easier to go about your day.  This is heartbreaking and chilling and I wish this woman infinite strength.",
                "If the state considers a fetus a life then a pregnant woman should be able to claim a fetus on their taxes. That is literally how it works if any logic was applied. ",
                "Wonder why the birth rates are dropping?  It is too risky to get pregnant in this country.  It opens women up to too many legal issues and possible life-threatening results."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Dow sinks more than 600 points. Stocks are on track for their worst quarter since 2023",
            "external_url": "https://www.cnn.com/2025/03/28/investing/us-stocks-tariff-uncertainty-volatility",
            "upvotes": 18459,
            "date": "03/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2206185432.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Are we having fun yet?",
                "Trump's economy in action.",
                "Ever since January 20  the economy has tanked and being on downward spiral because of poor policies .",
                "They must be updating the headline. When I first saw it the headline said 500 points. OP posted 600. Clicking the link now at 1311 hours its 700 points.\n\nEDIT: Lol. On the top right under 'latest market news' there's a headline for 600 points and clicking on it takes you to the headline for 700 points. Silly website.",
                "Sec Treasury Bennet just included me in a chat about the declining stock market.  Will keep you all posted.",
                "Right now down 735. \n\nIt would need to fall another 700 points or so to hit the dip it was at a couple weeks ago. Another drop of that magnitude would take it to summer last year.",
                "Somebody's winning.  It's just not us.",
                "Note to America - don’t elect idiots & crooks.",
                "Just wait until the unemployment figures come in.",
                "I mean is anyone surprised? I literally can't think of any positive economic indicators or good news on the horizon. We haven't even started feeling the effects of the tariffs and the feds yanking billions of dollars of spending out of the economy, unemployment is going to spike with all the layoffs over the last couple of months, and inflation is taking off again.\n\nI've moved mostly into cash. I keep hearing people repeat a dumb slogan: \"Time in the market > timing the market!!!\" Maybe that's true sometimes, but not times like now where there is literally zero reason for the market to go up, and a zillion reasons it will continue going down."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Elon Musk sued by Wisconsin attorney general ahead of state election - CBS Minnesota",
            "external_url": "https://www.cbsnews.com/minnesota/video/elon-musk-sued-by-wisconsin-attorney-general-ahead-of-state-election/",
            "upvotes": 3163,
            "date": "03/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/28/01229e65-5150-49fb-8057-a3d617b2fb1f/thumbnail/1200x630/91d35c20019f4f05ab89122be4e65360/637e56ce8c7202049f60fb0500b8f966.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Cool. Now, convict and JAIL THIS MOTHERFUCKER.",
                "This is exactly why billionaires shouldn't exist. There is nothing respectable or admirable about this, there is no advanced strategy or genius-level 4D Chess, absolutely no hard work is going into any of these victories, they are simply throwing money at the problem like always and it always works for them cause they keep us destitute.",
                "Unfortunately we’ve already seen the ultra wealthy can’t be held accountable because they can just delay delay delay forever.\n\nGood luck to them either way.",
                "Remember what life was like before this piece of shit was front and center in the news every fucking day? That was nice.",
                "In another article\n\n> Wisconsin Attorney General Josh Kaul sued Musk in state court, seeking to temporarily restrain Musk from further promoting his promise to give away two $1 million checks or making any further payments to Wisconsin voters. Wisconsin law prohibits offering anything of value to an elector in order to induce their voting behavior, Kaul said in the Dane County Circuit Court lawsuit.\n“The Wisconsin Department of Justice is committed to ensuring that elections in Wisconsin are safe, secure, free, and fair,” Kaul said in a statement on X.\n\nLike holy cow can someone please charge this man with election interference.",
                "Just like the lawsuit in Pennsylvania that went nowhere? When are people going to realize our institutions are being assaulted by Musk and MAGA. The US is in a state of constitutional and national security crisis.",
                "Arrest his punk ass as soon as he lands.",
                "Why he wants to buy the election in Wisconsin. He wants this to go away",
                "Arrest his canvassers on sight",
                "Obama really broke Trump's dementia addled brain when he had that jacket made with a little \"44\" on the sleeve. Now Trump has to do it to everything.\n\nOn a more serious note. I wouldn't have much of a problem with this if it were a true lottery of sorts. Anyone who votes, regardless of how, can put their name into a hat and have an equal chance of winning. Of course we know from before that the people who win will all be registered republicans who have a very pro-Trump online presence."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "ICE detains University of Alabama doctoral student as government's college crackdown continues",
            "external_url": "https://www.nbcnews.com/news/us-news/university-alabama-doctoral-student-detained-ice-governments-college-c-rcna198320",
            "upvotes": 40080,
            "date": "03/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250327-Alireza-Doroudi-mn-0745-bc5811.jpg",
            "top_comments": [
                "I remember hearing during winter break that exchange students should avoid going home because they might not be allowed back into the US.",
                "Whenever you get mad about this, remember that Congress (controlled by Republicans) could stop this at any time - and they choose not to because they like it.",
                "Where are the Don't Tread on Me guys now? This is rather...draconian.",
                "Man, I swear this is the kind of stuff that the right wing warned us would happen under liberal government....",
                "I earned my PhD a few years ago. One of the most stressful, engaging, and fucking stressful times of my life. To be suddenly deported? I can't imagine. So much of a PhD program is building and sustaining momentum. To be tanked out like this? These assholes are altering the lives of bright, intelligent, and young people.",
                "So we don't know where he is, what they say he's done, whether he has a lawyer, yet it's a \"crackdown\" as if there's something justifiable here in need of correction.\n\n\nFuck off. ",
                "Trump is making all of us less safe. He’s shredding the legal system and the constitution. And he’s crashing the economy.",
                "Abducted.  He was abducted not detained.",
                "This is 100% a trial run to cause some fear. This summer is going to have protests en masse and fully expect we'll start seeing even fully legal citizens start to disappear when those begin.",
                "The educated are being arrested meanwhile the criminals are running the country I'm confused"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Kentucky GOP supermajority overrides nearly all of Democratic governor's vetoes in one day",
            "external_url": "https://www.lpm.org/news/2025-03-27/kentucky-gop-supermajority-overrides-nearly-all-beshear-vetoes-in-one-day",
            "upvotes": 8967,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/7c5bffd/2147483647/strip/true/crop/2000x1050+0+225/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F90%2F24%2Ff3fa41eb47ce80b17bbb1380f6e2%2Fjoe-morning-capitol.jpg",
            "top_comments": [
                "IIRC they didn't even need a supermajority to override a veto in Kentucky. \n\n\nIt's one of the few states where a simple majority overrides a veto.",
                "I was listening to a representative from Kentucky (not sure if Congressman or Senator) on Pod Save America. He was saying the impact on Bourbon sales was immediate and impactful to their economy. More interesting was his discussion about the Department of Education and Medicaid cuts. He said that the number 1 employer in most Kentucky towns is the school system, and the loss of block grants will require firing a lot of staff, and the number 2 employer is the local hospital which is funded by Medicaid. He also said 1/2 of the children in the state are covered by Medicaid.\n\nThe administration is targeting GOP voters for the most pain. Goofy.",
                ">another that would strip the state’s ability to regulate pollution in certain water sources.\n\nSo the \"Don't tread on me\" crowd is willingly ceding authority to the federal government they demonized for years because now the federal government is as aspirationally fascist as them.",
                "Keep destroying that local economy Kentucky. ",
                "At least they have enough whiskey to drown in.",
                "I hope they get everything they voted for.",
                "Most of these bill are bills that would hurt the people of Kentucky, so its time for those people to vote those representatives out.  That might mean voting for a democrat(oh no!) and if they don't then they get to suck it up and be happy with these horrible pieces of legislation.  Enjoy that brown water coming out of your tap.",
                ">Louisville Democrat Sen. Cassie Chambers Armstrong said these programs have already played out in other states and have hurt indigent Medicaid recipients who are already working but fail to fill out burdensome paperwork.\n\nPaperwork for billion $$ companies to prove they aren't destroying the environment or abusing workers rights = Bad\n\nPaperwork for a single mother working 2 jobs to support her kids = Good",
                "[removed]",
                "Gave them the power didn’t ya?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Utah becomes the first state to ban fluoride in public drinking water",
            "external_url": "https://apnews.com/article/utah-fluoride-ban-43f67153beb3e06ada9d782655fb15de",
            "upvotes": 3001,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If only there were some 2011 event that could teach us about [what may happen](https://www.dentistryiq.com/dentistry/research-and-news/article/55248093/why-calgary-reversed-its-decision-on-fluoride-after-10-years). \n\n(Calgary reversed the decision 13 years later because they noticed a significant rise in decalcification along the gumline)\n\n\"The number of children receiving IV antibiotics for dental infections at Alberta Children’s Hospital increased by 700% from 2011 to 2018. The majority of these patients were under five years old.\"\n\nEdit: added more info from the article",
                "I wish I was a dentist and I lived in Utah.",
                ">Utah lawmakers who pushed for a ban said putting fluoride in water was too expensive.\n\nAh, ok.\n\nAnd they tied this legislation to a tax cut for everyone in the state, right? Riiiiiight??",
                "Just call it T Dazzle and throw it back in the water.",
                "First Sundance moves to Boulder. Now they ban fluoride. Come on Utah, get your act together.",
                "Calgary, Alberta did this. Just over a decade later they're reversing it. The data about how big a disaster this was is **very clear**\n\n\n> The number of children receiving IV antibiotics for dental infections at Alberta Children’s Hospital increased by 700% from 2011 to 2018. The majority of these patients were under five years old.\n\n\nAnd a study comparing Calgary with Edmonton (the other major city in Alberta)\n\n\n> [2018 and 2019 data showed] 64.8 per cent of participants in Calgary had one or more cavities in their baby teeth, compared with 55.1 per cent in Edmonton participants.\n\n\nCompared to 5 years earlier\n\n\n> [2013 and 2014 data showed] a 56.6 per cent prevalence of dental cavities in baby teeth in Calgary, and 58.7 per cent in Edmonton.\n\n\nFluoride toothpaste doesn't get the fluoride *inside* developing bones and teeth, it only treats the *outside* of the teeth. It's good for maintenance, it's not a replacement for dietary intake for children.",
                "I hate that this says \"First\" and that Utah will definitely not be the last with this Idiocracy in place.",
                "Spent most of my life in civilization (a city) that used fluoride. I seem fine. But now I’m in rural American where they don’t use it and everybody out here’s got some fucked up teeth. So there’s that.",
                "Grew up in Portland, Its a lovely motivator that my teeth deteriorate faster than most anyone else. like an entropy war drum. Floss kids!",
                "Alabama is gonna be pissed that Utah out dumbed them."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "U.S. turns to Europe for eggs to ease prices at home, but so far comes up empty-handed",
            "external_url": "https://www.cbsnews.com/news/egg-prices-us-europe-exports/",
            "upvotes": 1148,
            "date": "03/28/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/10/8b67d433-c1ec-4709-a5ad-5ffe86a0ab15/thumbnail/1200x630/5de92f083aafd8ea42c48e0bcf7711a7/gettyimages-2154882660.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Why would anyone want to help the US, at this point?",
                "Good. Don’t give us anything; we don’t deserve it.",
                "Why would any sovereign nation help the USA now? The government has abandoned all allies, is threatening their neighbors with invasion, and has begun an unnecessary trade war.\n\n\nI'm a citizen of the USA, and I say fuck our egg prices. The rest of the world will move on without us.",
                "\"Greetings, former allies!\"",
                "Europeans: let them eat cake!",
                "Nobody is going to help. The word help is gone. My assumption is they don't outright say no, but are calling in demands for providing supplies. Trump works that way and he won't ever remember you \"helping\" him cause he feels he is entitled to that and deserves it. So, no... You want eggs well I want tariffs gone. No? Then go elsewhere for eggs.",
                "Turns out the Carrot and Stick doesn't work if you have no carrot and the stick is flaccid.",
                "i wonder what could’ve prevented this",
                "As an American who didn’t vote for the shitbag in office I say good!!! Stand up to this fucking clown and make us suffer. It’s the only way we will be able to rid ourselves of this heaping pile of shit who is nothing more than a con man and a traitor.",
                "The Egg president. Humpty Dumpy. Come-on there's so many jokes. His face even looks like a wrinkly ass egg."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Convicted founder of electric vehicle startup Nikola pardoned by Trump",
            "external_url": "https://apnews.com/article/nikola-trevor-milton-fraud-trump-pardon-3fcebb0a3820cecb205656f2dc3f6764",
            "upvotes": 3325,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Fraudster helping fraudster.\n\n>the pardon could wipe out hundreds of millions of dollars in restitution that prosecutors were seeking for defrauded investors.\n\nOnce again, the victims and judicial system are spat upon by Trump. I wonder how many of them voted for him.",
                ">Milton and his wife donated more than $1.8 million to a Trump re-election campaign fund less than a month before the November election, according to the Federal Election Commission,\n\nIn case you want to know what the current going rate for a pardon is, it's $1,800,000.00 for a four-year sentence.\n\n____\n>“I am incredibly grateful to President Trump for his courage in standing up for what is right and for granting me this sacred pardon of innocence,” Milton said.\n\nA pardon doesn't grant innocence. Accepting one gives the pardoned person ['an imputation of guilt and acceptance of a confession of it'](https://en.wikipedia.org/wiki/Burdick_v._United_States#Decision).",
                "Republican crime syndicate in action.",
                "Lol are these the guys that got busted rolling a truck down a hill?",
                "President crime lover",
                "Milton was convicted by a jury. He was represented in that trial by Brad Bondi, a partner at law firm Paul Hastings and the brother of current U.S. Attorney General Pam Bondi.",
                "So Americans are just super okay now with blatant quid pro quo corruption in their government?",
                "> “I am incredibly grateful to President Trump for his courage in standing up for what is right and for granting me this sacred pardon of innocence,” Milton said.\n\n\nYeah, that's not what a pardon is, though.",
                "Poor Nikola Tesla, he did not deserve these assholes dragging his name through the mud",
                ">Milton and his wife donated more than $1.8 million to a Trump re-election campaign fund \n\n100% MAGAs and foreign MAGA-wannabes are Ok with this."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump pardons three co-founders of BitMEX crypto exchange",
            "external_url": "https://www.cnbc.com/2025/03/28/trump-pardon-bitmex-crypto-exchange-money-laundering.html",
            "upvotes": 1750,
            "date": "03/28/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108123080-1743187995978-gettyimages-881226528-CONSENSUS_INVEST.jpeg?v=1743188010&w=1920&h=1080",
            "top_comments": [
                "Fat Donny sure does love him some criminals.",
                "Every scammer in the country must love Trump. They finally have someone to represent them in the Oval Office.",
                "They'll be joining the administration shortly to oversee the scam \"crypto reserve\"",
                "Why not Just empty jail of all white collar criminals?",
                "It is only money laundering. Everyone does it.",
                "Is this so they can help him funnel all the federal cash into crypto so they can finish robbing the country blind?",
                "\"They were just grifting. It's not their fault it's against the law.\"",
                "It takes a real piece of shit to pardon other pieces of shit.",
                "it is common for Fascist regimes to pardon criminals for political reasons....particularly if they feel they can get some use from the Pardoned individual.\n\ntrumps use of the pardons is on brand.",
                "Who’s next, Kenneth Lay and the board of Enron?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Columbia University Interim President Katrina Armstrong Is Stepping Down",
            "external_url": "https://www.wsj.com/us-news/education/columbia-university-interim-president-katrina-armstrong-is-stepping-down-7644f880",
            "upvotes": 59,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Caves and then walks, prob with a very strong compensation package",
                "golden parachute out of the ivory tower",
                "Anyone who would want that job is someone they should not want to hire.",
                "Katrina Armstrong came from the Medical School and is fighting to preserve Med School funding. \n\nShe is probably being forced out by other faculty who want to fight.",
                "What do we think it’s gonna be, she couldn’t take it or the board forced her out? ",
                "I hope their international student admission numbers **plummet** after this incident.",
                "They have not supported people who are willing to fight for what's right so far (other universities included) and you won't get anyone who will until you get that support.",
                "The political situation at Columbia on at least a few fronts is so tough that even Interim Presidents step down.",
                "She's lost all credibility from now until the end of time. She had to step down.",
                "I don't know which actually qualified person would want to take this on right now and how much you'd have to pay them to make it worth the immense risk.\n\nYou're just going to be squeezed between increasingly hostile protestors who will target you and a facist government that is going to target you with a state monopoly on violence and a university that will be happy to heap the blame on you for failures to either comply with the government or address the concerns of the student body.\n\nGoodluck!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Trump signs order ending union bargaining rights for wide swaths of federal employees",
            "external_url": "https://www.npr.org/2025/03/28/nx-s1-5343474/trump-collective-bargaining-unions-federal-employees",
            "upvotes": 40,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5313x2989+0+216/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F15%2Fb4%2Fb1a0c5b24f54b1e0156c71e26852%2Fgettyimages-2202711755.jpg",
            "top_comments": [
                "Friend is a federal prison guard and he’s boiling over this. However, he did volunteer that “We all voted for him and now he does this to us….•",
                "Gotta think that’s not legal.\nSupreme Court better act quick ",
                "The funny thing is unless we are introducing slavery you cannot force a group of people to work.",
                "Everyone that \"used\" to be in the union should suddenly stop working.  Since they are not in a union it cannot be called a strike, but by golly it might have the same effect.",
                "It is legal, ask your reps"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Elon Musk sued by Wisconsin attorney general ahead of state election - CBS Minnesota",
            "external_url": "https://www.cbsnews.com/minnesota/video/elon-musk-sued-by-wisconsin-attorney-general-ahead-of-state-election/",
            "upvotes": 3147,
            "date": "03/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/28/01229e65-5150-49fb-8057-a3d617b2fb1f/thumbnail/1200x630/91d35c20019f4f05ab89122be4e65360/637e56ce8c7202049f60fb0500b8f966.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Cool. Now, convict and JAIL THIS MOTHERFUCKER.",
                "This is exactly why billionaires shouldn't exist. There is nothing respectable or admirable about this, there is no advanced strategy or genius-level 4D Chess, absolutely no hard work is going into any of these victories, they are simply throwing money at the problem like always and it always works for them cause they keep us destitute.",
                "Unfortunately we’ve already seen the ultra wealthy can’t be held accountable because they can just delay delay delay forever.\n\nGood luck to them either way.",
                "Remember what life was like before this piece of shit was front and center in the news every fucking day? That was nice.",
                "In another article\n\n> Wisconsin Attorney General Josh Kaul sued Musk in state court, seeking to temporarily restrain Musk from further promoting his promise to give away two $1 million checks or making any further payments to Wisconsin voters. Wisconsin law prohibits offering anything of value to an elector in order to induce their voting behavior, Kaul said in the Dane County Circuit Court lawsuit.\n“The Wisconsin Department of Justice is committed to ensuring that elections in Wisconsin are safe, secure, free, and fair,” Kaul said in a statement on X.\n\nLike holy cow can someone please charge this man with election interference.",
                "Just like the lawsuit in Pennsylvania that went nowhere? When are people going to realize our institutions are being assaulted by Musk and MAGA. The US is in a state of constitutional and national security crisis.",
                "Arrest his punk ass as soon as he lands.",
                "Why he wants to buy the election in Wisconsin. He wants this to go away",
                "Arrest his canvassers on sight",
                "Obama really broke Trump's dementia addled brain when he had that jacket made with a little \"44\" on the sleeve. Now Trump has to do it to everything.\n\nOn a more serious note. I wouldn't have much of a problem with this if it were a true lottery of sorts. Anyone who votes, regardless of how, can put their name into a hat and have an equal chance of winning. Of course we know from before that the people who win will all be registered republicans who have a very pro-Trump online presence."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "U.S. turns to Europe for eggs to ease prices at home, but so far comes up empty-handed",
            "external_url": "https://www.cbsnews.com/news/egg-prices-us-europe-exports/",
            "upvotes": 1149,
            "date": "03/28/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/10/8b67d433-c1ec-4709-a5ad-5ffe86a0ab15/thumbnail/1200x630/5de92f083aafd8ea42c48e0bcf7711a7/gettyimages-2154882660.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Why would anyone want to help the US, at this point?",
                "Good. Don’t give us anything; we don’t deserve it.",
                "Why would any sovereign nation help the USA now? The government has abandoned all allies, is threatening their neighbors with invasion, and has begun an unnecessary trade war.\n\n\nI'm a citizen of the USA, and I say fuck our egg prices. The rest of the world will move on without us.",
                "\"Greetings, former allies!\"",
                "Europeans: let them eat cake!",
                "Nobody is going to help. The word help is gone. My assumption is they don't outright say no, but are calling in demands for providing supplies. Trump works that way and he won't ever remember you \"helping\" him cause he feels he is entitled to that and deserves it. So, no... You want eggs well I want tariffs gone. No? Then go elsewhere for eggs.",
                "Turns out the Carrot and Stick doesn't work if you have no carrot and the stick is flaccid.",
                "i wonder what could’ve prevented this",
                "As an American who didn’t vote for the shitbag in office I say good!!! Stand up to this fucking clown and make us suffer. It’s the only way we will be able to rid ourselves of this heaping pile of shit who is nothing more than a con man and a traitor.",
                "The Egg president. Humpty Dumpy. Come-on there's so many jokes. His face even looks like a wrinkly ass egg."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "After months of cuts, State Department says it's officially shuttering USAID",
            "external_url": "https://abcnews.go.com/US/after-months-cuts-state-department-officially-shuttering-usaid/story?id=120267238",
            "upvotes": 435,
            "date": "03/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c2ce7c7c-f818-4d0b-b845-2311b14886b8/usaid-sign-flowers-gty-jt-250208_1739039973318_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "It's illegal but Trump's got immunity thanks to SCOTUS. Congress has lost all power to say where the money is spent.",
                "In a memo distributed Friday to USAID employees and obtained by ABC News, Jeremy Lewin, the agency's new deputy director and a former Department of Government Efficiency official, wrote that the State Department \"intends to assume responsibility for many of USAID's functions and its ongoing programming.\"\n\nThe State Department \"will seek to retire USAID's independent operation\" immediately and \"assess\" whether to rehire some unknown number of officials to \"assume the responsible administration of USAID's remaining life-saving and strategic aid programming,\" the memo said.\n\n\"This transfer will significantly enhance efficiency, accountability, uniformity, and strategic impact in delivering foreign assistance programs -- allowing our nation and President to speak with one voice in foreign affairs,\" according to the memo.\n\n\"It will also obviate the need for USAID to continue operating as an independent establishment,\" the memo said.\n\nAs part of the move, the memo said, \"all non-statutory positions at USAID will be eliminated.\"...",
                "The jobs report Friday is going to be a bloodbath",
                "Imagine the progress in America if you didn't have to waste time rebuilding from smoldering ruins after a Republican administration every 4-8 years. And this time it's so bad, there might not even be anything left.",
                "They're going to regret this for lots of reasons.   Destroying something because you don't know what it's doing doesn't mean it wasn't doing something important.",
                "It's so great to see Chuck Schumer's plan of \"Do nothing and roll over to expose my belly\" totally worked. Trump's totally been neutered since.",
                "I'm so ashamed of this country.",
                "Goodbye american soft power.",
                "Holy fuck. Decades of soft power gone in an instant. People quickly starving and dying without medicine. There will be consequences.",
                "Once again releasing usaid news end of week like the cowards they are."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Elon Musk's xAI buys social media platform X for $45 billion",
            "external_url": "https://www.reuters.com/markets/deals/musks-xai-buys-social-media-platform-x-45-billion-2025-03-28/",
            "upvotes": 8206,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait... so he raised money from investors for xAI, used that money to buy himself out of the $40B Twitter hole that he dug himself?? This seems very questionable at best...",
                "At the same time as DOGE goes into the SEC as well. What an amazing coincidence ",
                "\"$45 billion\" of xAI stock... so you have to accept xAI's totally specious $75B valuation in order to believe this transaction is actually worth $45 billion.  What a joke.  \n\nxAI has raised around $20 billion from investors and sells nothing but vaporware.",
                "This is like when a no name influencer “sells” their shitty NFT to themselves for $10million",
                "Okay... what?\n\nThis must be some tax/loan reshuffling thing I'm too plebeian to understand",
                "This is exactly why he put his DOGE team within the SEC. Definitely committing fraud, but no one will be able to investigate him for it. We're so fucked in this country.",
                "So he Bought it for 45 billion Tanked it into the Ground to get Trump Elected. Then somehow Magically with no Innovation/ increase in revenue/ Advertisers didn't come back/ Multiple boycotts and Still the value went back up magically to what he bought it for? \n\nHe then Sells it from himself to a company owned by him in order to pay back the 45 billion dollar loan on the saudi's before they make a call on his Tesla Stock which he was tanking. and Somehow in all of this i'm pretty sure he paid Zero taxes somehow. \n\nThis Feels like all smoke and mirrors and there's got to be some Legality involved. Where's the SEC and the FTC oh right their being defanged and Gutted by Musk as we speak. \n\n  \n/sigh",
                "Moving the trash from one garbage bin to the other.",
                "An all stock transaction... From one private company to another private company, both fundamentally controlled by the same person. This is really just economic sophistry isn't it?",
                "Could this have something to do with him using Tesla shares to fund buying X? Now that Tesla price is dropping, does this do anything to shield himself from that?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Measles update: Texas reports West Texas outbreak has seen 400 cases since January",
            "external_url": "https://www.tpr.org/bioscience-medicine/2025-03-28/measles-update-texas-reports-west-texas-outbreak-has-seen-400-cases-since-january",
            "upvotes": 325,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/1ee44ea/2147483647/strip/true/crop/5124x2690+0+1230/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe5%2F38%2F4e68a43243a7874e2fea5a65d696%2F2024-10-11t000000z-566783405-mt1imgost000rstxjp-rtrmadp-3-imago-images.JPG",
            "top_comments": [
                "You call it measles, Texans call it Freedom Cough",
                "Well this is a interesting thing to watch.  The most infectious disease on the planet to date versus a mostly vaccinated public.  So it looks like it will just sit there and simmer.  Never going away and never getting free.  Unless it mutates that is.",
                "Remember, denying vaccines was never about safety.\n\nIt's because scientists are the enemy, and the enemy is never allowed to be right about something.",
                "This update adds 73 cases to the number of reported cases in Texas associated with the outbreak. Tuesday’s update added 18 cases. Last Friday's update added 30 cases. Last Tuesday’s update added 20 new cases.\n\nOne new hospitalization (up to 41 from 40) was reported, while no new deaths were reported for Texas.",
                "Kansas has begun reporting cases that are, according to authorities, possibly linked to the Texas outbreak. They reported 10 cases last Friday and reported 13 additional cases yesterday.\n\nhttps://www.kansas.com/news/state/article302927824.html\n\nKansas will be updating their case counts on Wednesdays.",
                "Their Vitamin A supplements from Amazon must have been delayed",
                "It's now in 20 states. The total for the country is 483 cases as of March 27th. \n\n[https://www.cdc.gov/measles/data-research/index.html#cdc\\_data\\_surveillance\\_section\\_10-measles-cases-in-2025](https://www.cdc.gov/measles/data-research/index.html#cdc_data_surveillance_section_10-measles-cases-in-2025)",
                "And this should have been preventable!",
                "MAHA is a death cult. This is so obvious.",
                "God I can't wait for the observational public health study that will come out of this one to try and show everyone how important getting vaccinated is, but at the same time there's no point trying to educate the indoctrinated."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US Securities and Exchange Commission beginning to onboard DOGE staff",
            "external_url": "https://www.reuters.com/world/us/us-securities-exchange-commission-beginning-onboard-doge-staff-email-says-2025-03-28/",
            "upvotes": 231,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">SEC staff were informed that the DOGE task force had contacted the regulator, and that they would be treated as staff for the purposes of network, system and data access. \n\n\"Today the Hen House announced plans to begin allowing Foxes complete access\" \n\nWe're getting into Putin levels of corruption now.",
                "Musk to oversee the very agency investigating him. Can't make this stuff up. Straight out of the twilight zone.",
                "This is like a new level in conflict of interest. I am almost impressed.",
                "I for one can't wait for the second great depression.",
                "DODGE is the SS of the trump Reich.",
                "The United Failed States of America",
                "This would be funny if it wasn’t so dangerous.",
                "This is when the kleptocracy really starts to kick in",
                "I guess that's one way for musk to avoid getting charged for the blatant fraud he's committing today",
                "fucking with the bag there."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Reynolds skips UNI ribbon cutting for Applied Engineering Bldg. as protest draws hundreds",
            "external_url": "https://cbs2iowa.com/news/local/reynolds-skips-uni-event-as-protest-draws-hundreds",
            "upvotes": 36,
            "date": "03/28/2025",
            "thumbnail": "https://cbs2iowa.com/resources/media2/16x9/4032/986/center/90/ec5877c0-8f68-4ae6-9054-257c08cde3fa-IMG_0899.jpeg",
            "top_comments": [
                "Spineless little shit.",
                "What. These Trump stooges can't handle a few protesters?",
                "Coward, like the other Maggats."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "State Department formally notifies Congress it is effectively dissolving USAID",
            "external_url": "https://www.cnn.com/2025/03/28/politics/state-department-formally-notifies-congress-effectively-dissolving-usaid/index.html",
            "upvotes": 1450,
            "date": "03/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2198234083.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Didn't a judge JUST rule that they don't have the power to do this and that everyone needs to be rehired and the funds restored? You can't just plow ahead like this!",
                "Literally illegal. Congress created the agency and funded it.\n\nFucking media report on these acts as illegal and illegitimate! And fucking Congress get your shit together and stop giving up your already limited power!",
                "Jeremy Lewin, a DOGE liaison who is a senior official at USAID, said the move would “significantly enhance efficiency, accountability, uniformity, and strategic impact in delivering foreign assistance programs – **allowing our nation and President to speak with one voice in foreign affairs.**”\n\nYikes",
                "I find it astounding how much suffering a single person can cause.",
                "[removed]",
                "If they are permitted to do this, an estimated 2-3 million people will die annually, according to USAID.",
                "They're basically daring the courts to act at this point.",
                "Nothing will get better until the judicial and legislative branches do their job. But it looks like the right has infected both, so we’re likely cooked.",
                "What is this headline\n\nIt should be stating outright\n\n“Illegal dissolution”",
                "I’m sure that all those trump supporting farmers never figured that they would lose billions of dollars of sales of their crops cuz Trump cut if their buyer.  Seems like there is a population explosion of leopards."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk sued by Wisconsin attorney general ahead of state election - CBS Minnesota",
            "external_url": "https://www.cbsnews.com/minnesota/video/elon-musk-sued-by-wisconsin-attorney-general-ahead-of-state-election/",
            "upvotes": 3151,
            "date": "03/28/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/28/01229e65-5150-49fb-8057-a3d617b2fb1f/thumbnail/1200x630/91d35c20019f4f05ab89122be4e65360/637e56ce8c7202049f60fb0500b8f966.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Cool. Now, convict and JAIL THIS MOTHERFUCKER.",
                "This is exactly why billionaires shouldn't exist. There is nothing respectable or admirable about this, there is no advanced strategy or genius-level 4D Chess, absolutely no hard work is going into any of these victories, they are simply throwing money at the problem like always and it always works for them cause they keep us destitute.",
                "Unfortunately we’ve already seen the ultra wealthy can’t be held accountable because they can just delay delay delay forever.\n\nGood luck to them either way.",
                "Remember what life was like before this piece of shit was front and center in the news every fucking day? That was nice.",
                "In another article\n\n> Wisconsin Attorney General Josh Kaul sued Musk in state court, seeking to temporarily restrain Musk from further promoting his promise to give away two $1 million checks or making any further payments to Wisconsin voters. Wisconsin law prohibits offering anything of value to an elector in order to induce their voting behavior, Kaul said in the Dane County Circuit Court lawsuit.\n“The Wisconsin Department of Justice is committed to ensuring that elections in Wisconsin are safe, secure, free, and fair,” Kaul said in a statement on X.\n\nLike holy cow can someone please charge this man with election interference.",
                "Just like the lawsuit in Pennsylvania that went nowhere? When are people going to realize our institutions are being assaulted by Musk and MAGA. The US is in a state of constitutional and national security crisis.",
                "Arrest his punk ass as soon as he lands.",
                "Why he wants to buy the election in Wisconsin. He wants this to go away",
                "Arrest his canvassers on sight",
                "Obama really broke Trump's dementia addled brain when he had that jacket made with a little \"44\" on the sleeve. Now Trump has to do it to everything.\n\nOn a more serious note. I wouldn't have much of a problem with this if it were a true lottery of sorts. Anyone who votes, regardless of how, can put their name into a hat and have an equal chance of winning. Of course we know from before that the people who win will all be registered republicans who have a very pro-Trump online presence."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "U.S. turns to Europe for eggs to ease prices at home, but so far comes up empty-handed",
            "external_url": "https://www.cbsnews.com/news/egg-prices-us-europe-exports/",
            "upvotes": 1146,
            "date": "03/28/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/10/8b67d433-c1ec-4709-a5ad-5ffe86a0ab15/thumbnail/1200x630/5de92f083aafd8ea42c48e0bcf7711a7/gettyimages-2154882660.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Why would anyone want to help the US, at this point?",
                "Good. Don’t give us anything; we don’t deserve it.",
                "Why would any sovereign nation help the USA now? The government has abandoned all allies, is threatening their neighbors with invasion, and has begun an unnecessary trade war.\n\n\nI'm a citizen of the USA, and I say fuck our egg prices. The rest of the world will move on without us.",
                "\"Greetings, former allies!\"",
                "Europeans: let them eat cake!",
                "Nobody is going to help. The word help is gone. My assumption is they don't outright say no, but are calling in demands for providing supplies. Trump works that way and he won't ever remember you \"helping\" him cause he feels he is entitled to that and deserves it. So, no... You want eggs well I want tariffs gone. No? Then go elsewhere for eggs.",
                "Turns out the Carrot and Stick doesn't work if you have no carrot and the stick is flaccid.",
                "i wonder what could’ve prevented this",
                "As an American who didn’t vote for the shitbag in office I say good!!! Stand up to this fucking clown and make us suffer. It’s the only way we will be able to rid ourselves of this heaping pile of shit who is nothing more than a con man and a traitor.",
                "The Egg president. Humpty Dumpy. Come-on there's so many jokes. His face even looks like a wrinkly ass egg."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Over 2000 protest in wake of student detainment",
            "external_url": "https://www.tuftsdaily.com/article/2025/03/over-2000-protest-in-wake-of-student-detainment",
            "upvotes": 1728,
            "date": "03/28/2025",
            "thumbnail": "https://snworksceo.imgix.net/ttd/892ebf50-7170-4741-bd2d-38007efd0704.sized-1000x1000.jpg?w=800&dpr=2&ar=16%3A9&fit=crop&crop=faces",
            "top_comments": [
                "It’s a relief to see that people are standing up, if nothing else. Not much to feel happy about these days",
                "This is response to this video of a PhD student being abducted by ICE for writing an op-ed in the school newspaper. She committed no crime. She is in the US legally \n\n\nEven if you disagree with her opinion, she has a right to say it.\n\n\n\nhttps://www.youtube.com/watch?v=PuFIs7OkzYY",
                "Don't stop protesting until they undo it, otherwise you're wasting your time.",
                "Don't stop protesting boycotting, or this country will fall to government power abuse.",
                "I have family in the country legally with visas and they are terrified this will happen to them.",
                "I applaud them for their bravery. We need to continue to speak truth to power.",
                "*“It is the immigrant communities, the undocumented communities, the working communities who are leading this struggle for our own liberation,” another said earlier.   Local residents of all ages attended the protest in addition to Tufts students, faculty and staff.*\n\nThe voices of connection vs the voices of FEAR, Repression, and Detainment.",
                "At least some students have some courage to protest!?  The rest of us are pitiful and lazy!",
                "I suspect that this will increase in intensity as the government continues its unjustified crackdown.\n\nThis summer could be very interesting. \n\nRegardless, I support these brave students and it's a reminder that we could be doing more. I wish the Democratic leadership realized the threat we face, at least...",
                "Good job guys! Well done. Let's get her back!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Measles update: Texas reports West Texas outbreak has seen 400 cases since January",
            "external_url": "https://www.tpr.org/bioscience-medicine/2025-03-28/measles-update-texas-reports-west-texas-outbreak-has-seen-400-cases-since-january",
            "upvotes": 330,
            "date": "03/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/1ee44ea/2147483647/strip/true/crop/5124x2690+0+1230/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe5%2F38%2F4e68a43243a7874e2fea5a65d696%2F2024-10-11t000000z-566783405-mt1imgost000rstxjp-rtrmadp-3-imago-images.JPG",
            "top_comments": [
                "You call it measles, Texans call it Freedom Cough",
                "Well this is a interesting thing to watch.  The most infectious disease on the planet to date versus a mostly vaccinated public.  So it looks like it will just sit there and simmer.  Never going away and never getting free.  Unless it mutates that is.",
                "Remember, denying vaccines was never about safety.\n\nIt's because scientists are the enemy, and the enemy is never allowed to be right about something.",
                "This update adds 73 cases to the number of reported cases in Texas associated with the outbreak. Tuesday’s update added 18 cases. Last Friday's update added 30 cases. Last Tuesday’s update added 20 new cases.\n\nOne new hospitalization (up to 41 from 40) was reported, while no new deaths were reported for Texas.",
                "Kansas has begun reporting cases that are, according to authorities, possibly linked to the Texas outbreak. They reported 10 cases last Friday and reported 13 additional cases yesterday.\n\nhttps://www.kansas.com/news/state/article302927824.html\n\nKansas will be updating their case counts on Wednesdays.",
                "Their Vitamin A supplements from Amazon must have been delayed",
                "It's now in 20 states. The total for the country is 483 cases as of March 27th. \n\n[https://www.cdc.gov/measles/data-research/index.html#cdc\\_data\\_surveillance\\_section\\_10-measles-cases-in-2025](https://www.cdc.gov/measles/data-research/index.html#cdc_data_surveillance_section_10-measles-cases-in-2025)",
                "And this should have been preventable!",
                "MAHA is a death cult. This is so obvious.",
                "God I can't wait for the observational public health study that will come out of this one to try and show everyone how important getting vaccinated is, but at the same time there's no point trying to educate the indoctrinated."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Trump pardons three co-founders of BitMEX crypto exchange",
            "external_url": "https://www.cnbc.com/2025/03/28/trump-pardon-bitmex-crypto-exchange-money-laundering.html",
            "upvotes": 1752,
            "date": "03/28/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108123080-1743187995978-gettyimages-881226528-CONSENSUS_INVEST.jpeg?v=1743188010&w=1920&h=1080",
            "top_comments": [
                "Fat Donny sure does love him some criminals.",
                "Every scammer in the country must love Trump. They finally have someone to represent them in the Oval Office.",
                "They'll be joining the administration shortly to oversee the scam \"crypto reserve\"",
                "Why not Just empty jail of all white collar criminals?",
                "It is only money laundering. Everyone does it.",
                "Is this so they can help him funnel all the federal cash into crypto so they can finish robbing the country blind?",
                "\"They were just grifting. It's not their fault it's against the law.\"",
                "It takes a real piece of shit to pardon other pieces of shit.",
                "it is common for Fascist regimes to pardon criminals for political reasons....particularly if they feel they can get some use from the Pardoned individual.\n\ntrumps use of the pardons is on brand.",
                "Who’s next, Kenneth Lay and the board of Enron?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk's xAI buys social media platform X for $45 billion",
            "external_url": "https://www.reuters.com/markets/deals/musks-xai-buys-social-media-platform-x-45-billion-2025-03-28/",
            "upvotes": 8182,
            "date": "03/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait... so he raised money from investors for xAI, used that money to buy himself out of the $40B Twitter hole that he dug himself?? This seems very questionable at best...",
                "At the same time as DOGE goes into the SEC as well. What an amazing coincidence ",
                "\"$45 billion\" of xAI stock... so you have to accept xAI's totally specious $75B valuation in order to believe this transaction is actually worth $45 billion.  What a joke.  \n\nxAI has raised around $20 billion from investors and sells nothing but vaporware.",
                "This is like when a no name influencer “sells” their shitty NFT to themselves for $10million",
                "Okay... what?\n\nThis must be some tax/loan reshuffling thing I'm too plebeian to understand",
                "This is exactly why he put his DOGE team within the SEC. Definitely committing fraud, but no one will be able to investigate him for it. We're so fucked in this country.",
                "So he Bought it for 45 billion Tanked it into the Ground to get Trump Elected. Then somehow Magically with no Innovation/ increase in revenue/ Advertisers didn't come back/ Multiple boycotts and Still the value went back up magically to what he bought it for? \n\nHe then Sells it from himself to a company owned by him in order to pay back the 45 billion dollar loan on the saudi's before they make a call on his Tesla Stock which he was tanking. and Somehow in all of this i'm pretty sure he paid Zero taxes somehow. \n\nThis Feels like all smoke and mirrors and there's got to be some Legality involved. Where's the SEC and the FTC oh right their being defanged and Gutted by Musk as we speak. \n\n  \n/sigh",
                "Moving the trash from one garbage bin to the other.",
                "An all stock transaction... From one private company to another private company, both fundamentally controlled by the same person. This is really just economic sophistry isn't it?",
                "Could this have something to do with him using Tesla shares to fund buying X? Now that Tesla price is dropping, does this do anything to shield himself from that?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "483 cases of measles reported across 19 states: CDC",
            "external_url": "https://abcnews.go.com/Health/500-cases-measles-reported-nationwide-19-states-cdc/story?id=120251851",
            "upvotes": 1117,
            "date": "03/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8f40f12a-86a6-4903-a19c-5dfb224a4b33/measles-texas-gty-jt-250311_1741733208836_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Things like this flourishing into bigger and bigger problems will illustrate exactly how important public health workers are — or were, before they were fired. Of course, the culpable party will not recognize or acknowledge it.",
                "Don't worry, that will drop to zero when CDC stops reporting numbers that make the administration look bad.",
                "It’s disgusting that we have ever allowed vaccine exemptions for those without actual medical issues. This will definitely grow into an epidemic.",
                ">Health and Human Services Secretary Robert F. Kennedy Jr. and other vaccine skeptics have promoted vitamin A amid the measles outbreak\n\nA skeptic is someone who doesn't believe that you have psychic powers until you prove it.  'Denialist' is the word we're looking for here.\n\n>During an interview on Fox News with Sean Hannity earlier this month, Kennedy said that HHS was currently providing vitamin A to measles patients for treatment, claiming vitamin A can \"dramatically\" reduce measles deaths.\n\nJust the other day, I was wondering if Sean Hannity is still a huge piece of crap.  Good to have my answer.",
                "Just wave cabbage leaves at the kids, they'll be fine ....",
                "Just a heads up, some adults could use the MMR vaccine too. If you got it before 1968, high risk, or you have health issues, speak to a Dr\n\n\nhttps://www.npr.org/sections/shots-health-news/2025/02/21/nx-s1-5304458/measles-vaccine-booster-health\n\n\nI got the one shot as a kid, but being in Texas and dealing with a health issue in the family, I received the MMR recently just in case. Was told I could have side effects but I was fine. Was free with my health insurance and less spicy than the flu vaccine. ",
                "So..........much..........winning.......",
                "Good thing we are now firing CDC and NIH ppl.  Can’t make this up…",
                "Translation - a cancer spreads when you feed it.\n\nThank your unvaccinated neighbors for all this death.",
                "Don’t worry, RFK Jr. knows how to solve this crisis. Kill the kids with measles and dump them in Central Park."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Woman Arrested After Miscarriage In Georgia Under Abortion Law",
            "external_url": "https://thegeorgiasun.com/news/woman-arrested-after-miscarriage-in-georgia-under-abortion-law/",
            "upvotes": 14921,
            "date": "03/28/2025",
            "thumbnail": "https://thegeorgiasun.com/wp-content/uploads/2022/06/shutterstock_2171223741-1170x694.jpg",
            "top_comments": [
                "You know what will help that person deal with the trauma of a miscarriage? The trauma of an arrest. That will surely improve her life /s",
                "\"*What Should Women Who Miscarry Do?: We asked several Tifton Police Department and Tift County officials what women who miscarry should do with the remains of the fetus. So far, only Tift District Attorney Patrick Warren has answered and said typically miscarriages are not handled in this manner.*\"\n\nSo they asked what she was supposed to do with the fetus and nobody had an answer.  If you can't tell her what she did wrong, why was she arrested?  Just because she probably didn't have a healthcare plan that would pay for it?",
                "\"The coroner’s office ruled it to be a occurring miscarriage\"\n\nI don't know if there's an official procedure of what to do with remains of a child when you have a miscarriage, but to jail and punish a mother for having one?   I mean... it's a miscarriage.  Did they want her to keep it in the fridge until the damn coroner can pick it up or something? Geeze! It's already traumatizing enough.",
                "People wonder why from the 1950s-70s why women hid miscarriages? This right here.",
                "What was she supposed to do with a dead fetus? At 19 weeks it was not close to viable. Women have been arrested for burying their stillborn children. Women miscarrying get turned away from hospitals because doctors are afraid to be accused of performing abortions. Maybe she didn’t even have the money to afford the ER visit (a whole other issue about how shitty the US is about healthcare).\n\nLook, I’ll be real with you. I used to work with animal control. Laws are different in different places, but when we had dead animals the law was two trash bags, into the dumpster. Trash bag/dumpster seems better to me than flushing it down the toilet. Burying it in the yard like a dead pet? If there are no laws regarding this, Tifton needs to leave this woman alone.",
                "Hey, remember when all the hippies were like \"these laws are going to be used to criminalize miscarriages!\" and the republicans were all \"nah, not us!\" and the hippies were right, just like we always are?",
                "Another article on the same topic. This is not an isolated case\n\n\nhttps://www.jezebel.com/georgia-police-jailed-woman-for-miscarriage-performed-autopsy-on-miscarried-fetus",
                "I have suffered from 2 miscarriages and I can say with absolute certainty that if, while healing physically and emotionally from a miscarriage, I had also been arrested for said miscarriage I would be ready to burn everything down.  I can also say with absolute  certainty that I still have not emotionally healed from my miscarriages, and neither has my husband.  It's one of those things where you never actually get over it, but time makes it easier to go about your day.  This is heartbreaking and chilling and I wish this woman infinite strength.",
                "If the state considers a fetus a life then a pregnant woman should be able to claim a fetus on their taxes. That is literally how it works if any logic was applied. ",
                "Wonder why the birth rates are dropping?  It is too risky to get pregnant in this country.  It opens women up to too many legal issues and possible life-threatening results."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "After months of cuts, State Department says it's officially shuttering USAID",
            "external_url": "https://abcnews.go.com/US/after-months-cuts-state-department-officially-shuttering-usaid/story?id=120267238",
            "upvotes": 432,
            "date": "03/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c2ce7c7c-f818-4d0b-b845-2311b14886b8/usaid-sign-flowers-gty-jt-250208_1739039973318_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "It's illegal but Trump's got immunity thanks to SCOTUS. Congress has lost all power to say where the money is spent.",
                "In a memo distributed Friday to USAID employees and obtained by ABC News, Jeremy Lewin, the agency's new deputy director and a former Department of Government Efficiency official, wrote that the State Department \"intends to assume responsibility for many of USAID's functions and its ongoing programming.\"\n\nThe State Department \"will seek to retire USAID's independent operation\" immediately and \"assess\" whether to rehire some unknown number of officials to \"assume the responsible administration of USAID's remaining life-saving and strategic aid programming,\" the memo said.\n\n\"This transfer will significantly enhance efficiency, accountability, uniformity, and strategic impact in delivering foreign assistance programs -- allowing our nation and President to speak with one voice in foreign affairs,\" according to the memo.\n\n\"It will also obviate the need for USAID to continue operating as an independent establishment,\" the memo said.\n\nAs part of the move, the memo said, \"all non-statutory positions at USAID will be eliminated.\"...",
                "The jobs report Friday is going to be a bloodbath",
                "Imagine the progress in America if you didn't have to waste time rebuilding from smoldering ruins after a Republican administration every 4-8 years. And this time it's so bad, there might not even be anything left.",
                "They're going to regret this for lots of reasons.   Destroying something because you don't know what it's doing doesn't mean it wasn't doing something important.",
                "It's so great to see Chuck Schumer's plan of \"Do nothing and roll over to expose my belly\" totally worked. Trump's totally been neutered since.",
                "I'm so ashamed of this country.",
                "Goodbye american soft power.",
                "Holy fuck. Decades of soft power gone in an instant. People quickly starving and dying without medicine. There will be consequences.",
                "Once again releasing usaid news end of week like the cowards they are."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Dow sinks more than 600 points. Stocks are on track for their worst quarter since 2023",
            "external_url": "https://www.cnn.com/2025/03/28/investing/us-stocks-tariff-uncertainty-volatility",
            "upvotes": 18459,
            "date": "03/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2206185432.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Are we having fun yet?",
                "Trump's economy in action.",
                "Ever since January 20  the economy has tanked and being on downward spiral because of poor policies .",
                "They must be updating the headline. When I first saw it the headline said 500 points. OP posted 600. Clicking the link now at 1311 hours its 700 points.\n\nEDIT: Lol. On the top right under 'latest market news' there's a headline for 600 points and clicking on it takes you to the headline for 700 points. Silly website.",
                "Sec Treasury Bennet just included me in a chat about the declining stock market.  Will keep you all posted.",
                "Right now down 735. \n\nIt would need to fall another 700 points or so to hit the dip it was at a couple weeks ago. Another drop of that magnitude would take it to summer last year.",
                "Somebody's winning.  It's just not us.",
                "Note to America - don’t elect idiots & crooks.",
                "Just wait until the unemployment figures come in.",
                "I mean is anyone surprised? I literally can't think of any positive economic indicators or good news on the horizon. We haven't even started feeling the effects of the tariffs and the feds yanking billions of dollars of spending out of the economy, unemployment is going to spike with all the layoffs over the last couple of months, and inflation is taking off again.\n\nI've moved mostly into cash. I keep hearing people repeat a dumb slogan: \"Time in the market > timing the market!!!\" Maybe that's true sometimes, but not times like now where there is literally zero reason for the market to go up, and a zillion reasons it will continue going down."
            ],
            "aggregate_sentiment": 14.0
        }
    ],
    "last_updated": "03/29/2025 00:40:17 UTC"
}