{
    "posts": [
        {
            "category": "HOT",
            "title": "China says it is ready for 'any type of war' with US",
            "external_url": "https://www.bbc.com/news/articles/c4gmd3g2nzqo",
            "upvotes": 17478,
            "date": "03/05/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/00c6/live/68e23460-f9d5-11ef-8c03-7dfdbeeb2526.jpg",
            "top_comments": [
                "Why are we doing this.",
                "This will surely lower the cost of my groceries, medications and housing.",
                "This is crazy lol. \n\n\"If war is what the US wants, be it a tariff war, a trade war or any other type of war, we're ready to fight till the end,\" China's embassy said on X",
                "As a millennial, I'm tired.",
                "Only 44 days Trump has been in office. This is both exhausting and terrifying 🤷‍♂️",
                "Yes, lets attack all of our largest trading partners. That will go great for us.",
                "Dance off it is, then.",
                "As a lib, I feel owned.",
                "I guarantee you, there's a Republican sitting at home reading this and saying, \"Let's go, bring it, China!\"",
                "\"Intimidation does not scare us. Bullying does not work on us. Pressuring, coercion or threats are not the right way of dealing with China,\" "
            ],
            "aggregate_sentiment": 70.0
        },
        {
            "category": "HOT",
            "title": "CIA director says US has paused intelligence support to Ukraine",
            "external_url": "https://www.cnn.com/2025/03/05/politics/us-pause-intelligence-support-ukraine?utm_medium=social&amp;utm_source=whatsappCNN&amp;utm_content=2025-03-05T13%3A51%3A35",
            "upvotes": 18517,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2200569649.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "&gt;In the lead up to Trump’s inauguration, Ratcliffe and the Trump transition team were told of the value of intelligence sharing with Ukraine by US officials who stressed that it was a hallmark of their achievements on the battlefield, according to a source familiar with the discussions.\n\nWell, that's something, isn't it.",
                "The whole world is about to shift away from America and conservatives are going to wonder what happened in a decade.",
                "Just in case anyone believed that it was ever actually about the money and not an ideological desire to support Russia in the war.",
                "Sooner or later the US will share their intelligence support to its new closest ally: Russia.",
                "Intelligence in the United States has been paused as well.",
                "If not Russian asset, why Russian asset shaped?",
                "Better headline:  \n\\&gt; Russian Agent has paused US intelligence sharing with Ukraine",
                "They've paused intelligence alright ",
                "we are the baddies, its official",
                "There won't be future support from the US to Ukraine at all. It's over. Trump is going to start a manufactured fight with the entire EU I imagine to use it as a pretense to leave NATO and The UN."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Supreme Court rejects Trump’s request to keep billions in foreign aid frozen",
            "external_url": "https://www.cnn.com/2025/03/05/politics/supreme-court-usaid-foreign-aid/index.html",
            "upvotes": 11743,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-24t143153z-1113666480-rc2bl8a8wu4b-rtrmadp-3-usa-court-abortion-clinics.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Alito’s dissent is some choice bullshit. “How dare a lower court override the president!”\n\nThe lower court found that congress had specified money to be spent, and the executive branch can’t just say “Nah.” They can slow walk it, they can do some other shady shit - but in the end they gotta pay out that money. \n\nAlito’s so concerned about someone overturning the president he’s saying the statutes congress passed don’t matter.",
                "It’s kind of mind boggling that 4 Supreme Court Justices support the idea that the Executive branch can just deicide not to pay their bills when the Legislative branch has allocated the funding and the recipients have already done what they were to be paid to do.",
                "OK, so now let’s see if trump complies and if he doesn’t, then what?",
                "That there are only five SCOTUS votes for paying congressionally mandated invoices for work *already* done!? This should be as basic a test of Article I as you can get. And that does not bode well for decisions to come",
                "Damn Justice Amy Coney Barrett doing justice.",
                "Interesting that 2 conservatives, including 1 Trump appointee in Barrett ruled against Trump. Though maybe not so much considering how relatively extreme this case is. The decision to spend this money is made by Congress and the executive branch, in theory, shouldn't be able to stop it for long.\n\nWhat will be more interesting(albeit also scary and dangerous) is what happens if the executive branch starts to ignore judicial rulings that they don't like.\n\nIf Congress sits around and concedes authority to the executive branch and the judicial branch turns out to be toothless, that kind of defeats the whole checks and balances concept that we've leaned on for so long. From there the executive can do whatever, no?",
                "Hallelujah. I haven’t been keeping up too much with which justices vote for what so maybe this is normal, but I was surprised to see Amy Coney Barrett voted with the liberal justices.",
                "“Four of the court’s conservatives — Justices Clarence Thomas, Samuel Alito, Neil Gorsuch and Brett Kavanaugh — dissented.”\n\nThese are the men who will dismantle our democracy. \n\nSo shocked by Coney Barrett. I guess he does understand the Constitution and the benefit of rule of law. \n\nBTW- this ruling merely states that the USG must pay for work already done by implementers. This is money owed to them.",
                "So, it looks like this isn't a particularly strong ruling against Trump, despite the headline, given that it basically shifts responsibility back down to the lower court.\n\nAt least that's something, I guess?\n\nIn any case, we'll see if Trump decides to Jackson this.",
                "Whenever I hear even moderately good news from SCOTUS, I immediately fear that it's a bone being thrown to the Left right before an awful ruling for Trump."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Piglets left to starve as part of a controversial art exhibition in Denmark have been stolen",
            "external_url": "https://abcnews.go.com/International/wireStory/piglets-left-starve-part-controversial-art-exhibition-denmark-119470901",
            "upvotes": 3655,
            "date": "03/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0fb06c2d-556c-48e1-814e-38334a5535a3/wirestory_4ed7e96f9274f68dd9f202ed9955748a_16x9.jpg?w=1600",
            "top_comments": [
                "This the same artist that did the goldfish in blenders?",
                "Good on the activists who stole them and the guy who helped. This artist is nuts. What an awful person.\n\n This just seems extra cruel for no real end game, like its not going to stop anyone from anything, it was suffering for the sake of \"art\".",
                "This is not art it’s animal cruelty",
                "&gt; Chilean-born Marco Evaristti said he had been aiming to raise awareness of the suffering caused by mass meat production with his art installation that opened last week in Copenhagen. The piglets were being denied food and water and would have been allowed to starve to death.\n\nI don't think the way to advocate against animal cruelty, is to cause more animal cruelty. Especially when you're subjecting a creature to a slow death that is initially pretty agonizing.",
                "There was an artist a while back who did something like this with a dog. Guillermo Vargas brought in a starving street dog from outside and had it in the art gallery for 3 hours - the gallery reported that he did feed it food and water while it was there, before it \"escaped.\" Guests were shocked and complained about it, and the artist's point was basically, it's the same dog you walked past outside but didn't give a shit about.",
                "Suffering for his art is probably a good thing. Replace the missing pigs in the cage with the artist - maybe it will make the same point.",
                "I’m inclined to think this artist is actually a psychopath.  Performing animal cruelty to point out other people’s cruelty is certainly a choice.",
                "Maybe, just maybe, the theft of the piglets is all part of the art exhibition. I’m not sure this is the case given that the exhibition opened last week. \n\nIf the intention was to allow three piglets to die from thirst there is a special place in hell for the artist. \n\n“Chilean-born Marco Evaristti said he had been aiming to raise awareness of the suffering caused by mass meat production with his art installation that opened last week in Copenhagen. The piglets were being denied food and water and would have been allowed to starve to death.”\n\nThey wouldn’t have starved to death, they would have died of thirst.",
                "I'm going out on a limb here and braving the wall of downvotes.\n\n\nThe provocation artist achived what he wanted without harming the piglets. They were never starved, they were not even showcased.\n\n\nYet he managed to upset so many people, that it sparked an outrage highlighting the fact most people don't give two shits about animals dying, as long as they are out of sight. What can be more artful than getting people to reflect on issues they normally wouldn't?\n\n\nThe comments in this post are beyond disappointing and shows they have no grasp on art at all.",
                "What kind of backwards ass thinking is \"I have to commit the same abuse in trying to protest\"."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Private employers added just 77,000 jobs in February, far below expectations, ADP says",
            "external_url": "https://www.cnbc.com/2025/03/05/adp-jobs-report-february-2025-.html",
            "upvotes": 3847,
            "date": "03/05/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108108397-1740666394856-gettyimages-2202188375-homedepotquarterlyreport0013.jpeg?v=1740666491&w=1920&h=1080",
            "top_comments": [
                "Feel like lots of people cheering on the federal government layoffs are going to be in for a rude awakening when suddenly there's 10x as many people applying for each open private sector job.",
                "Virginia's governor had a whole press conference where he unveiled this website to help federal workers who had been laid off to find new jobs. \n\nThe website is literally just links to LinkedIn and Indeed.",
                "Y’all better buckle tf up because we are headed straight for a massive recession. \n\n✅Hundreds of thousands of newly out of work employees competing for a shrinking pool of private sector jobs\n\n✅Tariffs causing inflation \n\n✅Government accountability and enforcement on financial institutions becoming non-existent\n\nCannot overstate how perfect of an economic storm is brewing right now. But thank god the right finally owned us queer-loving liberal pansies.",
                "This is exactly what so many people wanted. \n\nTo get fired from their well paying and financially sound government employment so they can : *checks notes* work at Home Depot. \n\nAwesome.",
                "Our country is being crippled by the current administration and our economy is in a downward spiral. Of course there are fewer jobs being offered.",
                "First time in memory a new administration has intentionally crashed the economy. Typically, it's hard to pinpoint exactly how an administration moves the needle. There won't be any guesswork this time.",
                "Did you like the Great Depression? Well, good news, it's back! We've got isolationism! We've got protectionism! We've got the rise of fascism! All the greatest hits!",
                "Won't a flood of applicants drive down wages",
                "The government is about to start shutting down reporting of these unemployment numbers. Trump will say “take my word for it, America is doing great!” Ignore the problem..",
                "Giant agribusiness Corp I'm at is on an indefinite hiring freeze because of tariffs. Guess where their PAC $ went."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Air Force leaders issue new warning about China-backed recruitment efforts by private companies",
            "external_url": "https://defensescoop.com/2025/02/28/air-force-leaders-warning-chinese-recruitment-efforts-pilots-aviation-companies/",
            "upvotes": 1355,
            "date": "03/05/2025",
            "thumbnail": "https://defensescoop.com/wp-content/uploads/sites/8/2025/02/F-35-Red-Flag.jpg",
            "top_comments": [
                "I bet the active duty guys love seeing how veterans are currently being treated, must be doing wonders for morale.",
                "But, no longer anything about the receuitment efforts of russia.",
                "Hmm since it’s dog eat dog politics I think it’s fair to work for the highest bidder",
                "\"We're going to arbitrarily fire you, and bad-mouth you while doing so. \n\nBut don't go work for those guys!\"\n\n\n\nA little reductive, but creating a bunch of negative sentiment then wringing hands about some people acting on that sentiment feels disingenuous.",
                "You'd think the restarted \"best businessman\" would know opposing companies/countries will take your disgruntled talent. Almost like he's purposefully sabotaging the country :) Americans will just complain on socials while it happens tho.",
                "Well..wtf did they think was going to happen.  They flood the zone with unemployed govt workers and now China want the skills so they can build up their govt etc.  These fucks do stupid shit and wonder why stuff happens.  People won't sit around and suffer after you fire them.  They have families to feed.  They don't give a fk.  Whoever pay will get their services. I don't blame them. The US is unstable",
                "It's almost as if the careless firing of tens of thousands of government employees and contractors could have fully expected consequences",
                "I keep saying it, but all of this private industry push is **profoundly** anti-American. There are private companies and money *all over the world.* The GOP in America *says* they are pro-America, but there isn't, and will never be, a policy that restricts private companies (and their money) to come to America and stay--because the world is big. There will always, always be money elsewhere and companies elsewhere. \n\nYou want to make America great? Improve America's ability to compete. That's all you can do.",
                "At this point they might be better off defecting, and that's in no way an endorsement of China.",
                "It's much worse than that. The administration DOGE'd the protections we had for our people from foreign governments and enabled assets to stay safe from foreign reprisal. So now, it's carrot or stick to aid foreign powers because this government already broken their promises and assurances."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Tariffs on cars from Mexico and Canada delayed by one month",
            "external_url": "https://edition.cnn.com/2025/03/05/business/tariffs-autos-mexico-canada-paused/index.html",
            "upvotes": 935,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-03-04t175159z-2098714084-rc2h6daud9v7-rtrmadp-3-usa-trump-tariffs.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Thank God we have a businessman like Trump running the show. I was worried that things would spiral out of control and our leadership would look incompetent and become an international punchline",
                "I must have skipped this part of 'Art of the Deal' where the effete businessperson flip flops after not fully understanding the basic rules of upmanship.",
                "Yeah, constantly walking back your threats will totally make them respect you.",
                "This extortion style diplomacy is most likely going to fail and only serves to piss off everyone. Domestic companies are going to add in fees to their costs structure to put up with the amount of extra work required to deal with the chaos, forgetting that it simply costs more to produce here. International companies and governments are just going to stop doing business with us wherever they can. We need to stop thinking that America is required for the global economy to flourish. Our influence was already in decline after Trump 1.0 and v2.0 is setting us up to be completely irrelevant.",
                "I hope there is no delay for their retaliation. The only way forward is to hit the bully back. Trump is not a serious person. Show him that he is dealing with serious people.",
                "Trump is confused about the meaning of \"winning\". He keeps confusing it with \"chaos\".",
                "And now the Dow Jones is rising cause of this news. Even though the rest of the tariffs on both sides are still going.\n\nClearly nothing more than “pump and dump” schemes by Trump’s inner circle.",
                "Nah. This is because a Canadian candidate for PM proposed  to put 100% tariffs on Tesla. Elon not liking where that’s going ",
                "Make up your freaking mind. This throw shit on the wall to see if it sticks bullshit is going to fail. Let's just get it over with.",
                "How did this guy bankrupt a casino?"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Russia’s river gamble fails near Kupyansk as Ukrainian forces hold the line",
            "external_url": "https://english.nv.ua/russian-war/russian-troops-fail-to-cross-oskil-river-near-kupyansk-as-ukrainian-forces-hold-the-line-50495280.html",
            "upvotes": 3007,
            "date": "03/05/2025",
            "thumbnail": "https://static.nv.ua/shared/system/Article/posters/003/048/932/original/28b4bfea0a7978891d7deb7b8f69d2ae.jpg?q=85&stamp=20250305121340",
            "top_comments": [
                "Whoa, I didn’t think good news existed anymore!",
                "To the brave Ukrainian troops, well done (from the US with shameful apologies for our president and his party of cowards)",
                "What was it Trump said? 3 days?\n\nWhat was it Putin said? 2 weeks?",
                "I'm starting to get curious if the reason Trump is trying to strong-arm Zelensky into a deal with Russia instead of military support is because Russia knows it's fucked and can't actually win the war. They're using North Korean troops ffs, they can't be in a great position imo.",
                "Slava Ukraini! Heroyam Slava!",
                "Brave courageous Ukrainians, fighting for all our freedom.",
                "Hold the the line! Hol the line! Hol line! Holine! Holine!",
                "It's hilarious how much russia absolutely fucking sucks at this.",
                "Jeff Lynne is so great",
                "But... the Russians didn't cross in Kupyansk?\n\nThey crossed the Oskil river to it's north and are taking km's worth of ground a day. \n\nSeems like misinformation to me.\n\nedit: for those downvoting me, [here's a fucking map](https://www.google.com/maps/d/u/1/viewer?hl=en&amp;ll=49.78537039564486%2C37.684565534670206&amp;z=12&amp;mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k) where you can see the Russians have crossed the Oskil river to the *north* of Kupyansk, in the town of Kyrpychne."
            ],
            "aggregate_sentiment": 97.0
        },
        {
            "category": "HOT",
            "title": "Los Angeles County sues Southern California Edison, alleging utility’s equipment sparked wildfire",
            "external_url": "https://www.cnn.com/2025/03/05/us/los-angeles-county-eaton-fire-lawsuit-edison/index.html",
            "upvotes": 581,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2194811746.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Does it make a difference? They'll just pay for the fines by CPUC approved rate hikes.",
                "again. \n\nThis time there appears to be footage as it started.",
                "Same with the fires caused by PG&amp;E.  Newsom screwed the pooch on that one.  California should not only own PG&amp;E, they should make all utilities public entities - including cell companies.  T-Mobile was sued by CPUC for causing large wildfires because of brush around base stations knocking up against the wires and transformers. Just one more example.",
                "They need to prohibit Edison from raising rates post-lawsuit, otherwise it's just going to be Edison customers footing the bill.",
                "17 people died..and thousands of properties were destroyed. Fuck..",
                "*The complaint alleges that witnesses, photos, and videos indicate the fire started directly under Edison transmission lines in Eaton Canyon.    “We are committed to seeking justice for the Altadena community and the taxpayers of Los Angeles County,” she said.*\n\nSounds like a repeat of the PG&amp;E responsibility for most or many of the northern CA fires, some of which destroyed whole villages and cities.",
                "everyone was ready to hunt down every homeless person and completely change the political landscape when the fire starter was unknown, but the moment we learned the Eaton fire came from a faulty powerline, that lets be real, they probably knew about, all ire just sort of disappeared. \n\nUtilities like these need to be government owned.",
                "That utility and other companies should be held accountable for the damage they created only makes sense. The problem with suing them doesn't accomplish much. What will happen is they raise rates for their customers. The customer, not the business, will pay the fine, plus higher rates past when it's paid for.\n\nThis isn't the first time this has happened. Sure, they take a short-term hit, but they'll get that money back and then some. Maybe jail time for CEOs, managers, or the board of directors. But just fining them millions will only shift the burden to the customers/tax payers.",
                "PG&amp;E just happy they didn’t start another disaster",
                "Alleged? There is video. However, the lawsuit will fail."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "RFK Jr sparks alarm after backing vitamins to treat measles amid outbreak",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/04/rfk-jr-vitamins-measles-outbreak",
            "upvotes": 16190,
            "date": "03/05/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3035a085c46a31b4ca76636ee32f88dabe9fd753/0_171_5174_3105/master/5174.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c79f04229516887391a37ded6863c479",
            "top_comments": [
                "Elect clowns, expect a circus.",
                "This is what you MAGA fucks voted for.  Now we can all be sick, poor, and hated by the world. Good job, you assholes.",
                "Nothing to see here, the brain worm is in command",
                "It's beginning to feel like the Secretary of Health and Human Services doesn't know anything about health.\n\nMust be a DEI hire 🤷‍♂️",
                "I'm curious why a non medical professional is allowed to have this cabinet position. There should be a law requiring MD or DO credentials. \n\nIf a licensed doctor gave misinformation publicly, he could be sanctioned by the medical board, making the MD requirement a safeguard against abuse.",
                "At a time when parents are staging measles parties, we need someone who advocates for proper prevention via vaccination. Instead we get this guy. The measles parties are absolutely insane to me, and I am so pissed at parents putting their kids at risk like that.",
                "I love how Trump surrounds himself with the best and brightest people unlike Biden who chose merely competent people. /s",
                "If only there was a way to prevent measles\n\ngee, i wonder why the rest of the developed world doesnt have this problem",
                "CEOs, politicians, public figures, etc, need to practice what they preach.  \n  \nRFK should host a measles party.   \nElon should try to live on a bus driver's wage.  \nMarco Rubio should move to Ukraine.\n\nDo that for a month and then we'll entertain your harebrained ideas.",
                "Bunch of drooling MAGA idiots. You've enabled the downfall of America and have done irreversible damage."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "U.S. Imposes Visa Restrictions on Foreign Officials and Others Facilitating Illegal Migration to the U.S.",
            "external_url": "https://nepyork.com/2025/03/05/u-s-imposes-visa-restrictions-on-foreign-officials-and-others-facilitating-illegal-migration-to-the-u-s/",
            "upvotes": 7,
            "date": "03/05/2025",
            "thumbnail": "https://nepyork.com/wp-content/uploads/2025/03/Visa-rejection-policy.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Treating male partners along with women may help stop bacterial vaginosis",
            "external_url": "https://www.sciencenews.org/article/bacterial-vaginosis-treatment-women-men",
            "upvotes": 47,
            "date": "03/05/2025",
            "thumbnail": "https://i0.wp.com/www.sciencenews.org/wp-content/uploads/2025/03/030525_AC_BV_feat.jpg",
            "top_comments": [
                "&gt;For many women who develop bacterial vaginosis, the syndrome returns weeks or months after treatment. A clinical trial of women in monogamous relationships with male partners found that [treating both partners significantly reduced the likelihood of recurrence](https://dx.doi.org/10.1056/NEJMoa2405404), researchers report in the March 5 *New England Journal of Medicine*. When both partners were treated, 35 percent of the women developed bacterial vaginosis again, while in the women-only treatment group, it was 63 percent.\n\n&gt;The treatment approach builds on past research finding that sexual transmission may account for some repeat episodes of bacterial vaginosis. In the new trial, women received the standard treatment: either an oral antibiotic or an intravaginal antibiotic cream or gel. In the group in which both partners were treated, the male partner took the oral antibiotic and applied an antibiotic cream to the skin of the penis for seven days. In the women-only treatment group, 43 out of 68 developed bacterial vaginosis again within 12 weeks, while only 24 out of 69 did when both partners received treatment.\n\n[Read more here.](https://www.sciencenews.org/article/bacterial-vaginosis-treatment-women-men)",
                "Why are the comments here about men being gross?\n\n\nThe article talks about \"male partner took the oral antibiotic and applied an antibiotic cream to the skin of the penis for seven days\", makes absolutely no mention of hygiene habits being either cause or solution. Just bacteria and antibiotics same as the female partner.",
                "Let’s save this article and link it to those women who complain about their yeast infections because their partner refuses to shower before they’re intimate.",
                "What’s bacterial vaginitis",
                "I was taught in the 80's to treat the male partner. This is far from new",
                "So... Dudes are nasty and need to wash their dick more often, is what I got from this."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "10 Chinese nationals charged with hacking U.S. Treasury and others: Justice Department",
            "external_url": "https://www.usatoday.com/story/news/politics/2025/03/05/chinese-cyber-hacking-federal-charges/81612072007/",
            "upvotes": 97,
            "date": "03/05/2025",
            "thumbnail": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/03/05/USAT/81615283007-20240613-t-182358-z-1395539376-rc-2-ha-8-azkjvc-rtrmadp-3-microsoftcyber.JPG?crop=5710,3212,x0,y297&width=3200&height=1801&format=pjpg&auto=webp",
            "top_comments": [
                "Did they check to see if they were DOGE employees first?",
                "DOGE got hacked. So happy we were able to do a thorough review of their software to protect people's data.",
                "Their strategic mistake was not being Russian.",
                "I’m sure for a tidy sum Trump will make the charges disappear.",
                "They also thought Singapore was China!! This falls right in line with their moves/goals for Project 2025. They are a few days late, but otherwise…. On track!! Luckily, it is a sloppy garbage plan and DT is making some big changes to it on the fly, so it is mostly just sad and embarrassing!!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Woman claims she's victim of 'love bombing,' owed thousands",
            "external_url": "https://www.cbc.ca/news/canada/ottawa/ottawa-woman-says-man-left-her-thousands-in-debt-wants-to-warn-others-1.7472910",
            "upvotes": 0,
            "date": "03/05/2025",
            "thumbnail": "https://i.cbc.ca/1.7473119.1741017739!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_1180/christina-maccrimmon.jpeg?im=Resize%3D620",
            "top_comments": [
                "there's hope for all of us",
                "This guy must have mad game. That article reads like a bad Unsolved Mysteries script.",
                "I'd love to see one of these where the victim isn't a complete idiot for a change."
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "NEW",
            "title": "Los Angeles County sues Southern California Edison, alleging utility’s equipment sparked wildfire",
            "external_url": "https://www.cnn.com/2025/03/05/us/los-angeles-county-eaton-fire-lawsuit-edison/index.html",
            "upvotes": 584,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2194811746.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Does it make a difference? They'll just pay for the fines by CPUC approved rate hikes.",
                "again. \n\nThis time there appears to be footage as it started.",
                "Same with the fires caused by PG&amp;E.  Newsom screwed the pooch on that one.  California should not only own PG&amp;E, they should make all utilities public entities - including cell companies.  T-Mobile was sued by CPUC for causing large wildfires because of brush around base stations knocking up against the wires and transformers. Just one more example.",
                "They need to prohibit Edison from raising rates post-lawsuit, otherwise it's just going to be Edison customers footing the bill.",
                "17 people died..and thousands of properties were destroyed. Fuck..",
                "*The complaint alleges that witnesses, photos, and videos indicate the fire started directly under Edison transmission lines in Eaton Canyon.    “We are committed to seeking justice for the Altadena community and the taxpayers of Los Angeles County,” she said.*\n\nSounds like a repeat of the PG&amp;E responsibility for most or many of the northern CA fires, some of which destroyed whole villages and cities.",
                "everyone was ready to hunt down every homeless person and completely change the political landscape when the fire starter was unknown, but the moment we learned the Eaton fire came from a faulty powerline, that lets be real, they probably knew about, all ire just sort of disappeared. \n\nUtilities like these need to be government owned.",
                "That utility and other companies should be held accountable for the damage they created only makes sense. The problem with suing them doesn't accomplish much. What will happen is they raise rates for their customers. The customer, not the business, will pay the fine, plus higher rates past when it's paid for.\n\nThis isn't the first time this has happened. Sure, they take a short-term hit, but they'll get that money back and then some. Maybe jail time for CEOs, managers, or the board of directors. But just fining them millions will only shift the burden to the customers/tax payers.",
                "PG&amp;E just happy they didn’t start another disaster",
                "Alleged? There is video. However, the lawsuit will fail."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Tariffs on cars from Mexico and Canada delayed by one month",
            "external_url": "https://edition.cnn.com/2025/03/05/business/tariffs-autos-mexico-canada-paused/index.html",
            "upvotes": 931,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-03-04t175159z-2098714084-rc2h6daud9v7-rtrmadp-3-usa-trump-tariffs.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Thank God we have a businessman like Trump running the show. I was worried that things would spiral out of control and our leadership would look incompetent and become an international punchline",
                "I must have skipped this part of 'Art of the Deal' where the effete businessperson flip flops after not fully understanding the basic rules of upmanship.",
                "Yeah, constantly walking back your threats will totally make them respect you.",
                "This extortion style diplomacy is most likely going to fail and only serves to piss off everyone. Domestic companies are going to add in fees to their costs structure to put up with the amount of extra work required to deal with the chaos, forgetting that it simply costs more to produce here. International companies and governments are just going to stop doing business with us wherever they can. We need to stop thinking that America is required for the global economy to flourish. Our influence was already in decline after Trump 1.0 and v2.0 is setting us up to be completely irrelevant.",
                "I hope there is no delay for their retaliation. The only way forward is to hit the bully back. Trump is not a serious person. Show him that he is dealing with serious people.",
                "Trump is confused about the meaning of \"winning\". He keeps confusing it with \"chaos\".",
                "And now the Dow Jones is rising cause of this news. Even though the rest of the tariffs on both sides are still going.\n\nClearly nothing more than “pump and dump” schemes by Trump’s inner circle.",
                "Nah. This is because a Canadian candidate for PM proposed  to put 100% tariffs on Tesla. Elon not liking where that’s going ",
                "Make up your freaking mind. This throw shit on the wall to see if it sticks bullshit is going to fail. Let's just get it over with.",
                "How did this guy bankrupt a casino?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "NYS Corrections enters its third weeks of wildcat strikes; more than 8000 COs still on strike",
            "external_url": "https://www.northcountrypublicradio.org/news/story/51365/20250305/more-than-half-of-corrections-officers-still-on-ny-prison-strike-statewide",
            "upvotes": 239,
            "date": "03/05/2025",
            "thumbnail": "https://www.northcountrypublicradio.org/news/images/prisonrally030525.webp",
            "top_comments": [
                "Hard for me to sympathize with them when one of their major concerns is being limited on how much and often they can use solitary confinement on prisoners.\n\n\nWhen a CO is describing being unable to lock people in solitary 24/7 as an “Inhumane condition“ for them to be working under, without a hint of irony that solitary confinement is actually inhumane, they lost me. \n\n\nHire wages, better hours, better prisoner to guard ratios, are all reasonable. Strike to hell and back for those, but “it’s inhumane to not let me be inhumane” is a joke.",
                "So if the CO’s are strike, who’s running the prison? Oh the same people that have always been running a prison. Inmates.",
                "The incarcerated must be overjoyed by being free from sex abuse and violence."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "FIRE files federal lawsuit against top Texas A&amp;M administrators",
            "external_url": "https://thebatt.com/news/fire-files-federal-lawsuit-against-texas-am/",
            "upvotes": 390,
            "date": "03/05/2025",
            "thumbnail": "https://thebatt.com/wp-content/uploads/2024/03/ASHB1317.jpg",
            "top_comments": [
                "&gt;The lawsuit comes days after the Board of Regents banned on-campus drag shows across the 11 universities in the A&amp;M System, including the flagship campus in College Station. The resolution, passed unanimously by the regents last Friday, said drag shows were “inconsistent with the system’s mission and core values of its universities, including the value of respect for others.” \n\nReally wish they would elaborate more on how drag shows *specifically* violate their \"mission and core values\". Really seems not that different than theater, musicals, etc which is historically filled with dressing up as the opposite gender. It's all in good fun, so what's the problem?",
                "“The Foundation for Individual Rights and Expression, or FIRE, has filed a federal lawsuit against the nine members of the Board of Regents, Chancellor John Sharp and Texas A&amp;M President Mark A. Welsh III on behalf of the Queer Empowerment Council, the student organization that hosts and organizes Draggieland.”\n\nKeep the lawsuits coming. Freedom of speech, freedom from persecution and discrimination are the building blocks of our democracy.",
                "What ever happened to just not attending if you're not interested? I mean, it's not the sort of thing I'd go out of my way to see, but I can always just... you know... not attend. When I was in college there would occasionally be some wandering preacher guy who'd show up on campus for a couple days. I wasn't really interested in his message, so I just kept walking. A very simple and elegant solution that didn't involve me trying to impose my personal beliefs on anyone else. I just would have appreciated someone from the campus security doing a bit of crowd control since people listening would often block the entire sidewalk which was a major thoroughfare.\n\nAnd honestly, nothing beats the name of a SF group: The Sisters of Perpetual Indulgence"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Air Force leaders issue new warning about China-backed recruitment efforts by private companies",
            "external_url": "https://defensescoop.com/2025/02/28/air-force-leaders-warning-chinese-recruitment-efforts-pilots-aviation-companies/",
            "upvotes": 1358,
            "date": "03/05/2025",
            "thumbnail": "https://defensescoop.com/wp-content/uploads/sites/8/2025/02/F-35-Red-Flag.jpg",
            "top_comments": [
                "I bet the active duty guys love seeing how veterans are currently being treated, must be doing wonders for morale.",
                "But, no longer anything about the receuitment efforts of russia.",
                "Hmm since it’s dog eat dog politics I think it’s fair to work for the highest bidder",
                "\"We're going to arbitrarily fire you, and bad-mouth you while doing so. \n\nBut don't go work for those guys!\"\n\n\n\nA little reductive, but creating a bunch of negative sentiment then wringing hands about some people acting on that sentiment feels disingenuous.",
                "You'd think the restarted \"best businessman\" would know opposing companies/countries will take your disgruntled talent. Almost like he's purposefully sabotaging the country :) Americans will just complain on socials while it happens tho.",
                "Well..wtf did they think was going to happen.  They flood the zone with unemployed govt workers and now China want the skills so they can build up their govt etc.  These fucks do stupid shit and wonder why stuff happens.  People won't sit around and suffer after you fire them.  They have families to feed.  They don't give a fk.  Whoever pay will get their services. I don't blame them. The US is unstable",
                "It's almost as if the careless firing of tens of thousands of government employees and contractors could have fully expected consequences",
                "I keep saying it, but all of this private industry push is **profoundly** anti-American. There are private companies and money *all over the world.* The GOP in America *says* they are pro-America, but there isn't, and will never be, a policy that restricts private companies (and their money) to come to America and stay--because the world is big. There will always, always be money elsewhere and companies elsewhere. \n\nYou want to make America great? Improve America's ability to compete. That's all you can do.",
                "At this point they might be better off defecting, and that's in no way an endorsement of China.",
                "It's much worse than that. The administration DOGE'd the protections we had for our people from foreign governments and enabled assets to stay safe from foreign reprisal. So now, it's carrot or stick to aid foreign powers because this government already broken their promises and assurances."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Florida jewelry thief swallows $770K worth of Tiffany earrings just before arrest, police say",
            "external_url": "https://www.nbcnews.com/news/us-news/florida-jewelry-thief-swallows-770k-tiffany-earrings-just-arrest-polic-rcna194879",
            "upvotes": 405,
            "date": "03/05/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250305-jewelry-scan-ch-1112-14ce69.jpg",
            "top_comments": [
                "Good way to puncture your stomach and die.",
                "does the resale value goe down after it has passed through someone's anus? like how a new car loses a lot of value if you drive it off the lot?",
                "Take him to the airport, they have a special machine they strap them to until they poop and sort it out . They do this for drug smugglers who swallow drugs.",
                "Honey I got a great deal on some earrings for you!!!",
                "Someone took Breakfast at Tiffany's too literally.",
                "\"Private Pile: You had best square your ass away and start shitting me Tiffany cuff links or I will definitely fuck you up!\"",
                "Give him a ton of Miralax.",
                "This shit is gonna get messy.",
                "He'll just be hungry in an hour.",
                "Some poor rookie cop is probably going to be the one assigned to fish whatever's left out of his shit."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Treating male partners along with women may help stop bacterial vaginosis",
            "external_url": "https://www.sciencenews.org/article/bacterial-vaginosis-treatment-women-men",
            "upvotes": 48,
            "date": "03/05/2025",
            "thumbnail": "https://i0.wp.com/www.sciencenews.org/wp-content/uploads/2025/03/030525_AC_BV_feat.jpg",
            "top_comments": [
                "&gt;For many women who develop bacterial vaginosis, the syndrome returns weeks or months after treatment. A clinical trial of women in monogamous relationships with male partners found that [treating both partners significantly reduced the likelihood of recurrence](https://dx.doi.org/10.1056/NEJMoa2405404), researchers report in the March 5 *New England Journal of Medicine*. When both partners were treated, 35 percent of the women developed bacterial vaginosis again, while in the women-only treatment group, it was 63 percent.\n\n&gt;The treatment approach builds on past research finding that sexual transmission may account for some repeat episodes of bacterial vaginosis. In the new trial, women received the standard treatment: either an oral antibiotic or an intravaginal antibiotic cream or gel. In the group in which both partners were treated, the male partner took the oral antibiotic and applied an antibiotic cream to the skin of the penis for seven days. In the women-only treatment group, 43 out of 68 developed bacterial vaginosis again within 12 weeks, while only 24 out of 69 did when both partners received treatment.\n\n[Read more here.](https://www.sciencenews.org/article/bacterial-vaginosis-treatment-women-men)",
                "Why are the comments here about men being gross?\n\n\nThe article talks about \"male partner took the oral antibiotic and applied an antibiotic cream to the skin of the penis for seven days\", makes absolutely no mention of hygiene habits being either cause or solution. Just bacteria and antibiotics same as the female partner.",
                "Let’s save this article and link it to those women who complain about their yeast infections because their partner refuses to shower before they’re intimate.",
                "What’s bacterial vaginitis",
                "I was taught in the 80's to treat the male partner. This is far from new",
                "So... Dudes are nasty and need to wash their dick more often, is what I got from this."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "China says it is ready for 'any type of war' with US",
            "external_url": "https://www.bbc.com/news/articles/c4gmd3g2nzqo",
            "upvotes": 17488,
            "date": "03/05/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/00c6/live/68e23460-f9d5-11ef-8c03-7dfdbeeb2526.jpg",
            "top_comments": [
                "Why are we doing this.",
                "This will surely lower the cost of my groceries, medications and housing.",
                "This is crazy lol. \n\n\"If war is what the US wants, be it a tariff war, a trade war or any other type of war, we're ready to fight till the end,\" China's embassy said on X",
                "As a millennial, I'm tired.",
                "Only 44 days Trump has been in office. This is both exhausting and terrifying 🤷‍♂️",
                "Yes, lets attack all of our largest trading partners. That will go great for us.",
                "Dance off it is, then.",
                "As a lib, I feel owned.",
                "I guarantee you, there's a Republican sitting at home reading this and saying, \"Let's go, bring it, China!\"",
                "\"Intimidation does not scare us. Bullying does not work on us. Pressuring, coercion or threats are not the right way of dealing with China,\" "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "CIA director says US has paused intelligence support to Ukraine",
            "external_url": "https://www.cnn.com/2025/03/05/politics/us-pause-intelligence-support-ukraine?utm_medium=social&amp;utm_source=whatsappCNN&amp;utm_content=2025-03-05T13%3A51%3A35",
            "upvotes": 18531,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2200569649.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "&gt;In the lead up to Trump’s inauguration, Ratcliffe and the Trump transition team were told of the value of intelligence sharing with Ukraine by US officials who stressed that it was a hallmark of their achievements on the battlefield, according to a source familiar with the discussions.\n\nWell, that's something, isn't it.",
                "The whole world is about to shift away from America and conservatives are going to wonder what happened in a decade.",
                "Just in case anyone believed that it was ever actually about the money and not an ideological desire to support Russia in the war.",
                "Sooner or later the US will share their intelligence support to its new closest ally: Russia.",
                "Intelligence in the United States has been paused as well.",
                "If not Russian asset, why Russian asset shaped?",
                "Better headline:  \n\\&gt; Russian Agent has paused US intelligence sharing with Ukraine",
                "They've paused intelligence alright ",
                "we are the baddies, its official",
                "There won't be future support from the US to Ukraine at all. It's over. Trump is going to start a manufactured fight with the entire EU I imagine to use it as a pretense to leave NATO and The UN."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court rejects Trump’s request to keep billions in foreign aid frozen",
            "external_url": "https://www.cnn.com/2025/03/05/politics/supreme-court-usaid-foreign-aid/index.html",
            "upvotes": 11750,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-24t143153z-1113666480-rc2bl8a8wu4b-rtrmadp-3-usa-court-abortion-clinics.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Alito’s dissent is some choice bullshit. “How dare a lower court override the president!”\n\nThe lower court found that congress had specified money to be spent, and the executive branch can’t just say “Nah.” They can slow walk it, they can do some other shady shit - but in the end they gotta pay out that money. \n\nAlito’s so concerned about someone overturning the president he’s saying the statutes congress passed don’t matter.",
                "It’s kind of mind boggling that 4 Supreme Court Justices support the idea that the Executive branch can just deicide not to pay their bills when the Legislative branch has allocated the funding and the recipients have already done what they were to be paid to do.",
                "OK, so now let’s see if trump complies and if he doesn’t, then what?",
                "That there are only five SCOTUS votes for paying congressionally mandated invoices for work *already* done!? This should be as basic a test of Article I as you can get. And that does not bode well for decisions to come",
                "Damn Justice Amy Coney Barrett doing justice.",
                "Interesting that 2 conservatives, including 1 Trump appointee in Barrett ruled against Trump. Though maybe not so much considering how relatively extreme this case is. The decision to spend this money is made by Congress and the executive branch, in theory, shouldn't be able to stop it for long.\n\nWhat will be more interesting(albeit also scary and dangerous) is what happens if the executive branch starts to ignore judicial rulings that they don't like.\n\nIf Congress sits around and concedes authority to the executive branch and the judicial branch turns out to be toothless, that kind of defeats the whole checks and balances concept that we've leaned on for so long. From there the executive can do whatever, no?",
                "Hallelujah. I haven’t been keeping up too much with which justices vote for what so maybe this is normal, but I was surprised to see Amy Coney Barrett voted with the liberal justices.",
                "“Four of the court’s conservatives — Justices Clarence Thomas, Samuel Alito, Neil Gorsuch and Brett Kavanaugh — dissented.”\n\nThese are the men who will dismantle our democracy. \n\nSo shocked by Coney Barrett. I guess he does understand the Constitution and the benefit of rule of law. \n\nBTW- this ruling merely states that the USG must pay for work already done by implementers. This is money owed to them.",
                "So, it looks like this isn't a particularly strong ruling against Trump, despite the headline, given that it basically shifts responsibility back down to the lower court.\n\nAt least that's something, I guess?\n\nIn any case, we'll see if Trump decides to Jackson this.",
                "Whenever I hear even moderately good news from SCOTUS, I immediately fear that it's a bone being thrown to the Left right before an awful ruling for Trump."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Piglets left to starve as part of a controversial art exhibition in Denmark have been stolen",
            "external_url": "https://abcnews.go.com/International/wireStory/piglets-left-starve-part-controversial-art-exhibition-denmark-119470901",
            "upvotes": 3658,
            "date": "03/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0fb06c2d-556c-48e1-814e-38334a5535a3/wirestory_4ed7e96f9274f68dd9f202ed9955748a_16x9.jpg?w=1600",
            "top_comments": [
                "This the same artist that did the goldfish in blenders?",
                "Good on the activists who stole them and the guy who helped. This artist is nuts. What an awful person.\n\n This just seems extra cruel for no real end game, like its not going to stop anyone from anything, it was suffering for the sake of \"art\".",
                "This is not art it’s animal cruelty",
                "&gt; Chilean-born Marco Evaristti said he had been aiming to raise awareness of the suffering caused by mass meat production with his art installation that opened last week in Copenhagen. The piglets were being denied food and water and would have been allowed to starve to death.\n\nI don't think the way to advocate against animal cruelty, is to cause more animal cruelty. Especially when you're subjecting a creature to a slow death that is initially pretty agonizing.",
                "There was an artist a while back who did something like this with a dog. Guillermo Vargas brought in a starving street dog from outside and had it in the art gallery for 3 hours - the gallery reported that he did feed it food and water while it was there, before it \"escaped.\" Guests were shocked and complained about it, and the artist's point was basically, it's the same dog you walked past outside but didn't give a shit about.",
                "Suffering for his art is probably a good thing. Replace the missing pigs in the cage with the artist - maybe it will make the same point.",
                "I’m inclined to think this artist is actually a psychopath.  Performing animal cruelty to point out other people’s cruelty is certainly a choice.",
                "Maybe, just maybe, the theft of the piglets is all part of the art exhibition. I’m not sure this is the case given that the exhibition opened last week. \n\nIf the intention was to allow three piglets to die from thirst there is a special place in hell for the artist. \n\n“Chilean-born Marco Evaristti said he had been aiming to raise awareness of the suffering caused by mass meat production with his art installation that opened last week in Copenhagen. The piglets were being denied food and water and would have been allowed to starve to death.”\n\nThey wouldn’t have starved to death, they would have died of thirst.",
                "I'm going out on a limb here and braving the wall of downvotes.\n\n\nThe provocation artist achived what he wanted without harming the piglets. They were never starved, they were not even showcased.\n\n\nYet he managed to upset so many people, that it sparked an outrage highlighting the fact most people don't give two shits about animals dying, as long as they are out of sight. What can be more artful than getting people to reflect on issues they normally wouldn't?\n\n\nThe comments in this post are beyond disappointing and shows they have no grasp on art at all.",
                "What kind of backwards ass thinking is \"I have to commit the same abuse in trying to protest\"."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Private employers added just 77,000 jobs in February, far below expectations, ADP says",
            "external_url": "https://www.cnbc.com/2025/03/05/adp-jobs-report-february-2025-.html",
            "upvotes": 3851,
            "date": "03/05/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108108397-1740666394856-gettyimages-2202188375-homedepotquarterlyreport0013.jpeg?v=1740666491&w=1920&h=1080",
            "top_comments": [
                "Feel like lots of people cheering on the federal government layoffs are going to be in for a rude awakening when suddenly there's 10x as many people applying for each open private sector job.",
                "Virginia's governor had a whole press conference where he unveiled this website to help federal workers who had been laid off to find new jobs. \n\nThe website is literally just links to LinkedIn and Indeed.",
                "Y’all better buckle tf up because we are headed straight for a massive recession. \n\n✅Hundreds of thousands of newly out of work employees competing for a shrinking pool of private sector jobs\n\n✅Tariffs causing inflation \n\n✅Government accountability and enforcement on financial institutions becoming non-existent\n\nCannot overstate how perfect of an economic storm is brewing right now. But thank god the right finally owned us queer-loving liberal pansies.",
                "This is exactly what so many people wanted. \n\nTo get fired from their well paying and financially sound government employment so they can : *checks notes* work at Home Depot. \n\nAwesome.",
                "Our country is being crippled by the current administration and our economy is in a downward spiral. Of course there are fewer jobs being offered.",
                "First time in memory a new administration has intentionally crashed the economy. Typically, it's hard to pinpoint exactly how an administration moves the needle. There won't be any guesswork this time.",
                "Did you like the Great Depression? Well, good news, it's back! We've got isolationism! We've got protectionism! We've got the rise of fascism! All the greatest hits!",
                "Won't a flood of applicants drive down wages",
                "The government is about to start shutting down reporting of these unemployment numbers. Trump will say “take my word for it, America is doing great!” Ignore the problem..",
                "Giant agribusiness Corp I'm at is on an indefinite hiring freeze because of tariffs. Guess where their PAC $ went."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Air Force leaders issue new warning about China-backed recruitment efforts by private companies",
            "external_url": "https://defensescoop.com/2025/02/28/air-force-leaders-warning-chinese-recruitment-efforts-pilots-aviation-companies/",
            "upvotes": 1353,
            "date": "03/05/2025",
            "thumbnail": "https://defensescoop.com/wp-content/uploads/sites/8/2025/02/F-35-Red-Flag.jpg",
            "top_comments": [
                "I bet the active duty guys love seeing how veterans are currently being treated, must be doing wonders for morale.",
                "But, no longer anything about the receuitment efforts of russia.",
                "Hmm since it’s dog eat dog politics I think it’s fair to work for the highest bidder",
                "\"We're going to arbitrarily fire you, and bad-mouth you while doing so. \n\nBut don't go work for those guys!\"\n\n\n\nA little reductive, but creating a bunch of negative sentiment then wringing hands about some people acting on that sentiment feels disingenuous.",
                "You'd think the restarted \"best businessman\" would know opposing companies/countries will take your disgruntled talent. Almost like he's purposefully sabotaging the country :) Americans will just complain on socials while it happens tho.",
                "Well..wtf did they think was going to happen.  They flood the zone with unemployed govt workers and now China want the skills so they can build up their govt etc.  These fucks do stupid shit and wonder why stuff happens.  People won't sit around and suffer after you fire them.  They have families to feed.  They don't give a fk.  Whoever pay will get their services. I don't blame them. The US is unstable",
                "It's almost as if the careless firing of tens of thousands of government employees and contractors could have fully expected consequences",
                "I keep saying it, but all of this private industry push is **profoundly** anti-American. There are private companies and money *all over the world.* The GOP in America *says* they are pro-America, but there isn't, and will never be, a policy that restricts private companies (and their money) to come to America and stay--because the world is big. There will always, always be money elsewhere and companies elsewhere. \n\nYou want to make America great? Improve America's ability to compete. That's all you can do.",
                "At this point they might be better off defecting, and that's in no way an endorsement of China.",
                "It's much worse than that. The administration DOGE'd the protections we had for our people from foreign governments and enabled assets to stay safe from foreign reprisal. So now, it's carrot or stick to aid foreign powers because this government already broken their promises and assurances."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Tariffs on cars from Mexico and Canada delayed by one month",
            "external_url": "https://edition.cnn.com/2025/03/05/business/tariffs-autos-mexico-canada-paused/index.html",
            "upvotes": 937,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-03-04t175159z-2098714084-rc2h6daud9v7-rtrmadp-3-usa-trump-tariffs.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Thank God we have a businessman like Trump running the show. I was worried that things would spiral out of control and our leadership would look incompetent and become an international punchline",
                "I must have skipped this part of 'Art of the Deal' where the effete businessperson flip flops after not fully understanding the basic rules of upmanship.",
                "Yeah, constantly walking back your threats will totally make them respect you.",
                "This extortion style diplomacy is most likely going to fail and only serves to piss off everyone. Domestic companies are going to add in fees to their costs structure to put up with the amount of extra work required to deal with the chaos, forgetting that it simply costs more to produce here. International companies and governments are just going to stop doing business with us wherever they can. We need to stop thinking that America is required for the global economy to flourish. Our influence was already in decline after Trump 1.0 and v2.0 is setting us up to be completely irrelevant.",
                "I hope there is no delay for their retaliation. The only way forward is to hit the bully back. Trump is not a serious person. Show him that he is dealing with serious people.",
                "Trump is confused about the meaning of \"winning\". He keeps confusing it with \"chaos\".",
                "And now the Dow Jones is rising cause of this news. Even though the rest of the tariffs on both sides are still going.\n\nClearly nothing more than “pump and dump” schemes by Trump’s inner circle.",
                "Nah. This is because a Canadian candidate for PM proposed  to put 100% tariffs on Tesla. Elon not liking where that’s going ",
                "Make up your freaking mind. This throw shit on the wall to see if it sticks bullshit is going to fail. Let's just get it over with.",
                "How did this guy bankrupt a casino?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Russia’s river gamble fails near Kupyansk as Ukrainian forces hold the line",
            "external_url": "https://english.nv.ua/russian-war/russian-troops-fail-to-cross-oskil-river-near-kupyansk-as-ukrainian-forces-hold-the-line-50495280.html",
            "upvotes": 3007,
            "date": "03/05/2025",
            "thumbnail": "https://static.nv.ua/shared/system/Article/posters/003/048/932/original/28b4bfea0a7978891d7deb7b8f69d2ae.jpg?q=85&stamp=20250305121340",
            "top_comments": [
                "Whoa, I didn’t think good news existed anymore!",
                "To the brave Ukrainian troops, well done (from the US with shameful apologies for our president and his party of cowards)",
                "What was it Trump said? 3 days?\n\nWhat was it Putin said? 2 weeks?",
                "I'm starting to get curious if the reason Trump is trying to strong-arm Zelensky into a deal with Russia instead of military support is because Russia knows it's fucked and can't actually win the war. They're using North Korean troops ffs, they can't be in a great position imo.",
                "Slava Ukraini! Heroyam Slava!",
                "Brave courageous Ukrainians, fighting for all our freedom.",
                "Hold the the line! Hol the line! Hol line! Holine! Holine!",
                "It's hilarious how much russia absolutely fucking sucks at this.",
                "Jeff Lynne is so great",
                "But... the Russians didn't cross in Kupyansk?\n\nThey crossed the Oskil river to it's north and are taking km's worth of ground a day. \n\nSeems like misinformation to me.\n\nedit: for those downvoting me, [here's a fucking map](https://www.google.com/maps/d/u/1/viewer?hl=en&amp;ll=49.78537039564486%2C37.684565534670206&amp;z=12&amp;mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k) where you can see the Russians have crossed the Oskil river to the *north* of Kupyansk, in the town of Kyrpychne."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Los Angeles County sues Southern California Edison, alleging utility’s equipment sparked wildfire",
            "external_url": "https://www.cnn.com/2025/03/05/us/los-angeles-county-eaton-fire-lawsuit-edison/index.html",
            "upvotes": 583,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2194811746.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Does it make a difference? They'll just pay for the fines by CPUC approved rate hikes.",
                "again. \n\nThis time there appears to be footage as it started.",
                "Same with the fires caused by PG&amp;E.  Newsom screwed the pooch on that one.  California should not only own PG&amp;E, they should make all utilities public entities - including cell companies.  T-Mobile was sued by CPUC for causing large wildfires because of brush around base stations knocking up against the wires and transformers. Just one more example.",
                "They need to prohibit Edison from raising rates post-lawsuit, otherwise it's just going to be Edison customers footing the bill.",
                "17 people died..and thousands of properties were destroyed. Fuck..",
                "*The complaint alleges that witnesses, photos, and videos indicate the fire started directly under Edison transmission lines in Eaton Canyon.    “We are committed to seeking justice for the Altadena community and the taxpayers of Los Angeles County,” she said.*\n\nSounds like a repeat of the PG&amp;E responsibility for most or many of the northern CA fires, some of which destroyed whole villages and cities.",
                "everyone was ready to hunt down every homeless person and completely change the political landscape when the fire starter was unknown, but the moment we learned the Eaton fire came from a faulty powerline, that lets be real, they probably knew about, all ire just sort of disappeared. \n\nUtilities like these need to be government owned.",
                "That utility and other companies should be held accountable for the damage they created only makes sense. The problem with suing them doesn't accomplish much. What will happen is they raise rates for their customers. The customer, not the business, will pay the fine, plus higher rates past when it's paid for.\n\nThis isn't the first time this has happened. Sure, they take a short-term hit, but they'll get that money back and then some. Maybe jail time for CEOs, managers, or the board of directors. But just fining them millions will only shift the burden to the customers/tax payers.",
                "PG&amp;E just happy they didn’t start another disaster",
                "Alleged? There is video. However, the lawsuit will fail."
            ],
            "aggregate_sentiment": 6.0
        }
    ],
    "last_updated": "03/05/2025 22:31:48 UTC"
}