{
    "posts": [
        {
            "category": "HOT",
            "title": "Columbia Activist Arrested by ICE at His Appointment for Citizenship",
            "external_url": "https://www.nytimes.com/2025/04/14/nyregion/columbia-student-palestinian-arrested-ice.html?unlocked_article_code=1._k4.cex1.lATs6MwweUmU&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 12359,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Mr. Mahdawi has not been accused of a crime. According to his lawyers, the Trump administration appears to be seeking his removal from the country under the same legal provision that it is using to detain another recent Columbia student and Palestinian, Mahmoud Khalil, contending that his presence is a threat to the foreign policy and national security interests of the United States. Immigration officials have argued that pro-Palestinian demonstrators have enabled the spread of antisemitism, but they have not offered evidence to substantiate the claim.\n\nThis is the real issue. Rubio can just say this guy’s presence harms our foreign policy agenda and SCOTUS has already said a judge can’t overrule that or challenge it in any way, despite Rubio not presenting any evidence to support it. \n\nSo, once again, if the government says you’re a terrorist, they can deport you without any evidence of that, and ~~SCOTUS has affirmed that somehow that’s legal and constitutional!~~\n\nEDIT: Clarifying one point (corrected above) - SCOTUS has not (yet) ruled on Khalil’s case, that was a judge in Louisiana. That ruling is in the process of being appealed.",
                "4th amendment protects “people” (not citizens) from unreasonable arrests, without charging him with a crime this is kidnapping and false imprisonment; and if they can do it to him they can do it to anyone.",
                "Brownshirts disappear another person in broad daylight.",
                "Honestly, me as a legal immigrant, with a good education and positively contributing to my community,  I feel in danger, I can’t imagine how the other human beings who came to this country to try a better life as many did in the last century feels right now.\n\nAnd honestly again, it does not look like the base of US society cares on what he does, if he doesn’t harm the economy.",
                "Representatives for Columbia declined to comment, citing federal student privacy regulations.. \nLOL the fucking irony with them.",
                "Disband ICE.\n\nThe new secret police.",
                "This is what people voted for.",
                "Look at all these ICE agents, happy to be Nazis.",
                "Guys they told you it will be bloodless if you allow it to be.",
                "How long will it take the sensible US person that what the US used to stand for is gone and the current admin is what the US fought in WW2."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump officials cut billions in Harvard funds after university defies demands | Trump administration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/14/trump-harvard-funding-freeze",
            "upvotes": 5253,
            "date": "04/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/afd6a3bcc0691545d7f8e402764158b7fa57d58a/0_91_4971_2983/master/4971.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b23276720d3bbb147424850c0c5c17f2",
            "top_comments": [
                "Kinda funny that Trump wants to ban students from wearing masks while federal agents conducting deportations wear them.",
                "It's really interesting, the way conservative voters never shut the fuck up about tyranny when they believe the government is serving anyone except exclusively them. But when the government starts cutting aid as punishment for defiance - an example of actual tyranny, for the record - it's fucking crickets from the conservative voter base.",
                "This is the hallmark of a totalitarian dictator.  Any university that caves to this, especially with the massive endowments that Harvard has deserves to lose their reputation.",
                "He can withhold money RIGHT AWAY. But go retrieve a human he trafficked? That's not possible.",
                "The actions of a vengeful man who never learned to regulate his emotions beyond the toddler stage.",
                "About to meet the real deep state.",
                "Harvard are rich enough and old enough (388 years) to tell this tinpot dictator to go fuck himself. \n\nAt least someone in power is doing it.",
                "Not an administration, a REGIME. Trump is not a leader, he's a dictator. Say what it really is.",
                "Harvard is literally older than the US government and his majesty of pettiness finds a way to soil it with his overflowing hatred. What a pathetic weak man. History will not be kind to his name.",
                "Good on Harvard, they need to stand their ground.     \nNow for the fun part, a lot of Harvard graduates do hold government positions and are probably going to get really mad that Trump did this to their school.  Can't wait to see the economic and campaign fallout from this."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "US sees biggest drop in Australian visitors since Covid as travellers avoid Trump’s America",
            "external_url": "https://www.theguardian.com/australia-news/2025/apr/15/us-sees-biggest-drop-in-australian-visitors-since-covid-as-travellers-avoid-trumps-america",
            "upvotes": 27569,
            "date": "04/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/32eb6410fc03cf6fbe66f73498734b5e15bbcbce/0_0_5150_3091/master/5150.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a710af17fcfae470b219b576ff0e3974",
            "top_comments": [
                "why risk being deported to a El Salvador prison for life?",
                "Even Americans want to avoid Trump’s America.",
                "Sorry America but your president is a cunt.",
                "Twice a year, I attend an international conference for engineers. It's always held in the U.S. and attendance can sometimes be as high as 50,000 people. Our last conference was an absolute ghost town. Id be surprised if we cracked 8000 people. We had to cancel committee meetings due to lack of attendance. Literally, not a single Canadian attended that I'm aware of. And I'm used to running into many.",
                "If not dictatorship, why dictatorship shaped?",
                "Don't come to America. Please. Stay away. It's not that I don't like you, I just don't want you to end up in a torture prison in El Salvador with no due process.",
                "Just imagine going to visit a new country, tasting the food, and ending up in a prison in El Salvador, without due process. The land of freedom, yeah...",
                "No shit, who wants to visit a country where non citizens can be grabbed and deported on a whim to a slave labor camp.",
                "As Brits, my wife's family has taken their yearly holiday in Florida every year for nearly 20 years and they've decided to holiday in Europe instead now. They said there's no way they're going to the US anytime soon.",
                "Canadian here.    \nThank you Australia."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "President of El Salvador says he won't return mistakenly deported man to U.S.",
            "external_url": "https://www.nbcnews.com/news/rcna201136",
            "upvotes": 42850,
            "date": "04/14/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250414-trump-bukele-vl-1156a-ae43d5.jpg",
            "top_comments": [
                "Visit the US*\n\n*we cannot guarantee you won’t be deported to a prison in El Salvador by mistake.",
                "There are really only a few logical conclusions to draw here. Either:\n\n1. Trump told him to say this to subvert the decision of the courts\n2. He is dead\n3. They dont actually know where he is since record keeping is suspect at best\n\nRegardless, the complete lack of due process here should be extremely concerning to every citizen in the Country, regardless of if they were born in the US or not.",
                "So kidnapping it is then.",
                "So let me get this straight. These people committed no crimes. They were illegally detained and removed from the country against their will. And they're being held in a foreign prison indefinitely with no due process.\nAnd yet they still frame it as deportation and not kidnapping & human trafficking",
                "This is a fucking problem.",
                "[ Removed by Reddit ]",
                "Trump also told him that he needs to build more prisons because we will be sending our \"home-grown\" next.",
                "[deleted]",
                "The baseline for Democrats in 2026 and 2028 should putting these sociopaths on trial and in boxes at ADX Florence the rest of their lives. I want a live stream of every single perp walk. \n\nSet an example or else we’re doing this again in 2032.",
                "I have a growing suspicion the deported man is no longer living..."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "U.S. businesses sue to block Trump tariffs, say trade deficits are not an emergency",
            "external_url": "https://www.cnbc.com/2025/04/14/us-businesses-sue-to-block-trump-tariffs-say-trade-deficits-are-not-an-emergency.html",
            "upvotes": 11954,
            "date": "04/14/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108130239-17443060692025-04-10t171901z_1554291057_rc25vda791jm_rtrmadp_0_usa-trump.jpeg?v=1744664864&w=1920&h=1080",
            "top_comments": [
                "We are a service economy and Trump wants you and your children back in the mines.",
                "Only matters if 2/3rds of the Senate agree. Sooo get used to a tanking economy.",
                "By any reasonable definition Trump is _very clearly_ (as in beyond a shadow of a doubt) abusing emergency powers. And abusing them badly. Dictatorially.\n\nReasonable definitions no longer apply in this country, though.",
                "Trump is ignoring the Supreme Court, your lawsuits won't matter to him at all",
                "Shame he will ignore the judges. A bribe might be more effective. ",
                "This will be an interesting lawsuit. I believe they are seeking an injunction as well. Since this is court of International Trade it would have jurisdiction to issue the injunction. Secretly Republicans are hoping courts rules against Trump so they don’t have to reign him in",
                "They are absolutely correct, of course. That said, I'm skeptical that a judge is going to allow private business to overrule what the federal government decides is a national emergency.",
                "It's as if their Congressional Reps are devoid of any legal power on their behalf. I wonder if any of these said businesses donated money to Republican reps who sit idly by as Trump jeopardizes their constituents' livelihoods.",
                "[https://www.theguardian.com/us-news/2025/apr/07/trump-tariffs-lawsuit](https://www.theguardian.com/us-news/2025/apr/07/trump-tariffs-lawsuit)\n\nfun fact the Koch brothers are suing the government. Yes those Koch brother republican mega-donors.",
                "Good thing that Congress paused \"the concept of days passing\" so that they don't have to vote on ending the emergency powers granted to Trump that he's using to enact all these tariffs."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Harvard University rejects Trump administration's proposed conditions for federal funding",
            "external_url": "https://www.cbsnews.com/boston/news/harvard-university-trump-federal-funding/",
            "upvotes": 10014,
            "date": "04/14/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/09/11/5ac72c51-54d4-468b-85ad-ab4e6c6498d1/thumbnail/1200x630/e8eea82be00e3f7cadfd3999429d4642/harvard-university.jpg?v=22a842e47fa1552047fb956f78e1acf0",
            "top_comments": [
                ">A letter sent to Harvard on April 11 outlined a series of conditions Harvard needed to meet to maintain a \"financial relationship\" with the federal government. The demands included leadership reforms, an immediate halt to diversity, equity and inclusion policies, an audit of \"viewpoint diversity\" among students and faculty, and \"meaningful discipline\" for students who violated school policies when a pro-Palestinian tent encampment went up on Harvard Yard. \n\nFor those who wondered what the conditions were.",
                "I was really concerned after Columbia that they would all fold. I am happy to see at least some arent for now",
                "It’s about time. I hope more universities soon follow!",
                "Harvard knows game theory.  If more universities follow suit, there are going to be a whole lot of pissed off parents and employers.  And they won't be pissed off at the universities.",
                "This is what “fuck you” money looks like. ",
                "Read the letter from the government to Harvard. Insane that the federal government tried to dictate to a private university things like the following: \n\n+ Harvard must ban specific student clubs and discipline their members\n\n+ Harvard must enforce \"viewpoint diversity\" (that is, make sure that every department hires more Republican faculty and admits more Republican students) \n\n+ Harvard must ban masks",
                "This should sound the alarm in any democracy. They are threatening defunding of one of the most prestigious universities if they don't fall in line with the narrative of the administration.",
                "It's almost like Harvard has a massive endowment and a shitload of Harvard-trained lawyers they can call on.",
                "Fuck MAGA. Every college, corporation, law firm, etc needs to sack up. FIGHT!",
                "Tomorrow's Headline: Harvard Board of Trustees Deported to El Salvador."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Despite a court order, White House bars AP from Oval Office event",
            "external_url": "https://apnews.com/article/trump-ap-press-freedom-court-gulf-caffd32aa8ec6b04a50b8c5277d7c9cb",
            "upvotes": 5794,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It's starting to look like judges don't hold any real power.",
                "The trump regime is refusing to follow the rule of law or the constitution. Trumps own personally stacked supreme court has ruled against his actions, and he won't even follow their orders. Trump is a full blown dictator and should face the penalty for treason against the US and its citizens.",
                "FoxNews better be yelling and screaming that the Musk/Trump administration is doing this. \n\nPepperidge Farms remembers: [White House attempted to shut out Fox News reporter](https://www.rcfp.org/white-house-attempted-shut-out-fox-news-reporter/)",
                "So the White House press secretary will be held in contempt and imprisoned until they comply with a lawful court order, right?",
                "This was all but guaranteed to happen. Trump will not be following the law. He doesn't have to. His own voters said he doesn't need to be law-abiding. ",
                "This is part of the playbook: ignore the courts, have no consequences, and continue the implementation of Project 2025.",
                "Looks like today was the big \"The courts no longer matter\" coming out party.\n\nIirc the report on martial law drops this Sunday so stay tuned for that announcement.",
                "Hold them in contempt! Do something?!",
                "Dear Other news Agencies: see what you do now is ALL of you boycott until the AP is allowed back in. Just to make sure you understand that. ",
                "It's not about party anymore. Wake the fuck up America."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Panama opposition party accuses US of ‘camouflaged invasion’",
            "external_url": "https://www.theguardian.com/world/2025/apr/12/panama-hegseth-us-invasion-canal",
            "upvotes": 2240,
            "date": "04/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7bf75c775d223205be1dc61e405462971266fcc2/0_322_4827_2895/master/4827.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=560d918d4f7f03ff4d73c54f899d89e6",
            "top_comments": [
                "Nothing camo about it. Trump wants territory, resist or you'll find policy more aggressive by the year. ",
                "The silver lining is that while the Trump administration is corrupt and fascist, it's also stunningly incompetent.\n\nIt's Stalin mixed with simple Jack.",
                "Why are countries losing trust in us? It must be DEI.",
                "*For many Panamanians, the return of US armed forces – even for supposed “joint operations” – will bring back uncomfortable memories of 1989’s Operation Just Cause, when* [*American troops killed hundreds of civilians*](https://www.theguardian.com/world/2025/jan/12/panama-canal-trump)\n\nAdd this to Trump's imperial big mouth threats to take it over--and then sending troops back into the abandoned US bases, which Panamanians are not permitted to enter, and you do a \"camouflaged invasion.\"",
                "Panama, we're just as concerned here in the US. The day will come when the Trump cult \"disappears\" us to some foreign prison. That's where we're headed.",
                "No Panama, this is open invasion",
                "Like the “little green men” that invaded Crimea in 2014",
                "Hostile action from the United States in a Latin American country over economic benefits?  Hmm, where have I heard that one before for an entire century?",
                "Don't let the greedy pasty crusty old gringos touch your land",
                "Not surprised. Our politicians have failed us. We’re fucked."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Sixth Staff Member Identified with Brain Tumor at Newton-Wellesley Hospital",
            "external_url": "https://www.bcheights.com/2025/04/11/sixth-staff-member-identified-with-brain-tumor-at-newton-wellesley-hospital/",
            "upvotes": 4156,
            "date": "04/14/2025",
            "thumbnail": "https://heights-photos.s3.amazonaws.com/wp-content/uploads/2025/04/11001207/Newton_Wellesley_Hospital-_2__ccexpress.jpeg",
            "top_comments": [
                "\"five nurses who work in the fifth-floor maternal care labor and delivery unit were diagnosed with benign brain tumors, prompting an internal investigation by the hospital. \"\n\n  \nyikes",
                "Stuff like this is wild. Three different employees at the OKC VA Prosthetics department have been diagnosed with cancer. One employee we worked closely with died unexpectedly from it.",
                "Where’s House when you need him…",
                "There are cancer-associated viral infections like Epstein-Barr (EBV). Whether they have strong causative links like HPV and cervical cancer is up for debate, IE it may not be primarily causative, but increases susceptibility to them. especially if there are environmental factors within the work environment that raise risks. \n\nFunnily, sometimes you can use viral infections to fight cancers. Cytomegalovirus (CMV) is sometimes an infection to be found in brain tumors, but not in the surrounding non-tumor brain tissues (IE healthy ones).  So, if you can turn your immune system against CMV, you can by proxy target brain tumors (Glioblastomas specifically). And it turns out that most adults (40+) are CMV+. It's just that CMV is usually quite benign in adults so no one really pays attention to it.\n\n  \nBut the odds of 6 people getting tumors is quite odds-defying. Public/Occupational health really ought to take a look at the workplace.",
                "According to this coverage, and given the thorough and ongoing investigation, the benign tumors are inexplicable.  One more big mystery but it has to have some environmental or medical device/equipment cause.",
                "Were they x-raying they heads 20 times a day for funsies over there?",
                "Where I used to work, 3 people in on particular part of the floor got brain cancer.  They tested the air quality, and found nothing, but makes you wonder.",
                "Was it those damn purple wipes?",
                "Time to move the ward elsewhere and put the CEO and admin in the space.",
                "So like, are a bunch of people still working on that floor? Or did they close down the floor until they're done investigating? I absolutely would not want to be on that floor at all unless they figured out that something was indeed causing the brain tumors and fixing the issue."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Fears over extremism in US military as soldier revealed as neo-Nazi TikTok follower",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/14/us-military-extremism-the-base",
            "upvotes": 36625,
            "date": "04/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/06022cc5a489574a13f2c0d9f524b425e88a8fef/0_51_1500_900/master/1500.png?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=af364b4fcd4b4a90b875795a970167cf",
            "top_comments": [
                "\"But in February, the DoD issued a memo halting a major counter-extremism initiative rooting out white nationalists and far-right influences among servicemen, citing that it was not in line with Donald Trump’s executive orders.\" \nBig yikes",
                "For the last time, he’s not a soldier, he’s secretary of defense.",
                "For the party that complains about being called Nazis, republicans sure have a lot of Nazis.",
                "My experience in the military is it made people more tolerant as it was the first time people mingled with different backgrounds. \n\nThat said, when your job is to protect/kill, you can't be surprised when your governments sanctioned killers got a few screws loose and turn to poisonous warrior-coded ideologies. \n\nNot sure what the answer is, but when your whole being is demonizing and finding faults in certain areas/culture so you can look at terrorism in a shrewd lens, you eventually demonize the population.",
                "I’m more worried about them in the white house",
                "As a euro nobody, let me tell you : this kind of idiot exists in every first world armed forces. To varying degrees. The issue is really how organized and dedicated to their cause they are.",
                "[removed]",
                "Ive seen a lot of people express hope that the military will step up when Trump eventually crosses a line with regards to annexation.\n\nStuff like this should reinforce that is unlikely to happen",
                "Meanwhile Joe Kent is awaiting senate confirmation. Look him up. How does one expect right wing extremism to be tamped down when white christian nationalists are in charge of major intelligence and defense institutions",
                "I'm sure the same people crying about Woke and chamas and all the rest of the talking mouth pieces are going to come out with some really strong statements for the Trump Administration and force them to purge the US military of Nazis, like they are purging it of 'woke ideology' - Right?!?! Because we know how they feel about terrorist sympathizers and college students, so they should feel even more strongly about actual fucking Nazis plotting against the US government hoping for a race war."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Unemployment fears hit worst levels since Covid as tariffs fuel inflation outlook, Fed survey shows",
            "external_url": "https://www.cnbc.com/2025/04/14/unemployment-fears-hit-worst-levels-since-covid-fed-survey-shows.html",
            "upvotes": 8,
            "date": "04/15/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108131050-1744402361562-gettyimages-2209110946-AFP_423D3NP.jpeg?v=1744402451&w=1920&h=1080",
            "top_comments": [
                "Who could have possibly seen this coming?"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "\"Black Lives Matter\" posters taken down at Lakeville schools; district settles lawsuit",
            "external_url": "https://www.cbsnews.com/minnesota/news/lakeville-schools-black-lives-matter-posters-down-settlement/",
            "upvotes": 62,
            "date": "04/15/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/01/27/b24ecf4e-17dc-473e-8f0e-5b7e39e93d18/thumbnail/1200x630/03ee0c618e68e7a908dd5a648d06ea5e/12p-vo-lakeville-blm-lawsuit-wcco6yry-00-00-4012.jpg?v=22a842e47fa1552047fb956f78e1acf0",
            "top_comments": [
                "$30k to the predatory law firm that did this",
                "Get your shit together, Lakeville."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Trump officials cut billions in Harvard funds after university defies demands | Trump administration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/14/trump-harvard-funding-freeze",
            "upvotes": 5257,
            "date": "04/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/afd6a3bcc0691545d7f8e402764158b7fa57d58a/0_91_4971_2983/master/4971.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b23276720d3bbb147424850c0c5c17f2",
            "top_comments": [
                "Kinda funny that Trump wants to ban students from wearing masks while federal agents conducting deportations wear them.",
                "It's really interesting, the way conservative voters never shut the fuck up about tyranny when they believe the government is serving anyone except exclusively them. But when the government starts cutting aid as punishment for defiance - an example of actual tyranny, for the record - it's fucking crickets from the conservative voter base.",
                "This is the hallmark of a totalitarian dictator.  Any university that caves to this, especially with the massive endowments that Harvard has deserves to lose their reputation.",
                "He can withhold money RIGHT AWAY. But go retrieve a human he trafficked? That's not possible.",
                "The actions of a vengeful man who never learned to regulate his emotions beyond the toddler stage.",
                "About to meet the real deep state.",
                "Harvard are rich enough and old enough (388 years) to tell this tinpot dictator to go fuck himself. \n\nAt least someone in power is doing it.",
                "Not an administration, a REGIME. Trump is not a leader, he's a dictator. Say what it really is.",
                "Harvard is literally older than the US government and his majesty of pettiness finds a way to soil it with his overflowing hatred. What a pathetic weak man. History will not be kind to his name.",
                "Good on Harvard, they need to stand their ground.     \nNow for the fun part, a lot of Harvard graduates do hold government positions and are probably going to get really mad that Trump did this to their school.  Can't wait to see the economic and campaign fallout from this."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "NEW",
            "title": "More H5N1 detections in US dairy cows and poultry; WHO unveils H5 surveillance guide",
            "external_url": "https://www.cidrap.umn.edu/avian-influenza-bird-flu/more-h5n1-detections-us-dairy-cows-and-poultry-who-unveils-h5-surveillance",
            "upvotes": 201,
            "date": "04/15/2025",
            "thumbnail": "https://www.cidrap.umn.edu/themes/custom/cidrap_theme/images/cidrap-og-image.jpg",
            "top_comments": [
                "Just a reminder that the current administration is more likely to order you to be infected to \"build immunity\" than it is to do anything to stop this.",
                "Bird flue is fake news!!  \n\nLiterally everyone around me is saying that. They make my brain hurt.",
                "If we don't test for it, then it doesn't exist. Just need more Vitamin C. /s",
                "Just believe in Trump hard enough and you'll be fine. If you die it's your fault for not loving America.",
                "god people are so _______d . we are fucked .",
                "Jokes on them, we don’t believe in the WHO anymore over here in freedom land…\n\n/s"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Israeli strike leaves Gaza City’s last fully functioning hospital out of service as offensive escalates",
            "external_url": "https://www.cnn.com/2025/04/13/world/israel-strike-gaza-city-hospital-intl/index.html",
            "upvotes": 418,
            "date": "04/15/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2209405234.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Respect the United States doctrine to use their weapons. This is bull shit. It’s not the civilians fault that the “command center was built there”. We had servicemen die in Afghanistan just to reduce civilian casualties. This is inhumane and wrong",
                "Fuck these guys man. Even war is supposed to have rules. I can't wait for their downfall.",
                "Let me guess. The hospital was a Hamas operative?",
                "Fuck the Israeli Government. Fuck them to hell. Evil bastards. Every single one of them.",
                "But but but, there are terrorists.  Everyone is terrorist, even the children, especially the children.",
                "Israel is a terrorist genocidal state and the United States supports it. History will view those who supported this the same way it views nazis and their supporters.",
                "I bet there were almost zero Hamas leaders hiding below children's cribs in there.",
                "what is this, the 20th time Israel has “destroyed the LAST functioning hospital in Gaza”",
                "Gaza Hospital is always the headline. Hamas control center is always in quotes three paragraphs down...",
                "Do a google search for the words “Israel destroys last fully functioning hospital in Gaza” and you will come up with thirty or forty dates since the conflict began that this mythical “last fully functioning hospital” has been “destroyed by Israel.”\n\nYou lot believe any false propaganda Hamas spouts."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Panama opposition party accuses US of ‘camouflaged invasion’",
            "external_url": "https://www.theguardian.com/world/2025/apr/12/panama-hegseth-us-invasion-canal",
            "upvotes": 2238,
            "date": "04/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7bf75c775d223205be1dc61e405462971266fcc2/0_322_4827_2895/master/4827.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=560d918d4f7f03ff4d73c54f899d89e6",
            "top_comments": [
                "Nothing camo about it. Trump wants territory, resist or you'll find policy more aggressive by the year. ",
                "The silver lining is that while the Trump administration is corrupt and fascist, it's also stunningly incompetent.\n\nIt's Stalin mixed with simple Jack.",
                "Why are countries losing trust in us? It must be DEI.",
                "*For many Panamanians, the return of US armed forces – even for supposed “joint operations” – will bring back uncomfortable memories of 1989’s Operation Just Cause, when* [*American troops killed hundreds of civilians*](https://www.theguardian.com/world/2025/jan/12/panama-canal-trump)\n\nAdd this to Trump's imperial big mouth threats to take it over--and then sending troops back into the abandoned US bases, which Panamanians are not permitted to enter, and you do a \"camouflaged invasion.\"",
                "Panama, we're just as concerned here in the US. The day will come when the Trump cult \"disappears\" us to some foreign prison. That's where we're headed.",
                "No Panama, this is open invasion",
                "Like the “little green men” that invaded Crimea in 2014",
                "Hostile action from the United States in a Latin American country over economic benefits?  Hmm, where have I heard that one before for an entire century?",
                "Don't let the greedy pasty crusty old gringos touch your land",
                "Not surprised. Our politicians have failed us. We’re fucked."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "‘I became like a slave’: why 43 women are suing the secretive Opus Dei Catholic group in Argentina",
            "external_url": "https://www.inkl.com/news/i-became-like-a-slave-why-43-women-are-suing-the-secretive-opus-dei-catholic-group-in-argentina",
            "upvotes": 843,
            "date": "04/14/2025",
            "thumbnail": "https://images.inkl.com/s3/article/lead_image/21829879/1000.jpg",
            "top_comments": [
                "Went to a boys only Opus Dei school in Colombia. Super creepy people, fundamentalist catholics, they used to teach us hoax miracle stories from tabloids as if they were true, taught us old testament biblical scripture as if it were literally true (adam & eve, noahs ark, etc), and we had to go to mass every morning. \n\nI left that school for a more secular Jesuit school.\n\nNot surprised that they're involved in a scandal like this.",
                "Wasn't this group a big part of The Da Vinci Code?",
                "I wonder what it will take humanity, to inoculate itself against cults.",
                "Isn't this the same Catholic cult responsible for a lot of the insanity happening in America right now?",
                "A cult is a cult, and they are all evil.",
                "There a non-paywalled version of TFA?",
                "Catholics treating women like crap? Really?\n\nYa don’t say…",
                "I think it's time for everybody to put religion in their rear view mirror. Believe what you want. You don't need someone to put rules on you.",
                "Wow ... when I think the catholic clergies cannot be more evil, they exceed my expectation. Abusing children is not enough. Have to make them into slaves too? You better hope there is no god and there is no hell.",
                "And… Christianity strikes again."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Columbia Activist Arrested by ICE at His Appointment for Citizenship",
            "external_url": "https://www.nytimes.com/2025/04/14/nyregion/columbia-student-palestinian-arrested-ice.html?unlocked_article_code=1._k4.cex1.lATs6MwweUmU&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 12355,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Mr. Mahdawi has not been accused of a crime. According to his lawyers, the Trump administration appears to be seeking his removal from the country under the same legal provision that it is using to detain another recent Columbia student and Palestinian, Mahmoud Khalil, contending that his presence is a threat to the foreign policy and national security interests of the United States. Immigration officials have argued that pro-Palestinian demonstrators have enabled the spread of antisemitism, but they have not offered evidence to substantiate the claim.\n\nThis is the real issue. Rubio can just say this guy’s presence harms our foreign policy agenda and SCOTUS has already said a judge can’t overrule that or challenge it in any way, despite Rubio not presenting any evidence to support it. \n\nSo, once again, if the government says you’re a terrorist, they can deport you without any evidence of that, and ~~SCOTUS has affirmed that somehow that’s legal and constitutional!~~\n\nEDIT: Clarifying one point (corrected above) - SCOTUS has not (yet) ruled on Khalil’s case, that was a judge in Louisiana. That ruling is in the process of being appealed.",
                "4th amendment protects “people” (not citizens) from unreasonable arrests, without charging him with a crime this is kidnapping and false imprisonment; and if they can do it to him they can do it to anyone.",
                "Brownshirts disappear another person in broad daylight.",
                "Honestly, me as a legal immigrant, with a good education and positively contributing to my community,  I feel in danger, I can’t imagine how the other human beings who came to this country to try a better life as many did in the last century feels right now.\n\nAnd honestly again, it does not look like the base of US society cares on what he does, if he doesn’t harm the economy.",
                "Representatives for Columbia declined to comment, citing federal student privacy regulations.. \nLOL the fucking irony with them.",
                "Disband ICE.\n\nThe new secret police.",
                "This is what people voted for.",
                "Look at all these ICE agents, happy to be Nazis.",
                "Guys they told you it will be bloodless if you allow it to be.",
                "How long will it take the sensible US person that what the US used to stand for is gone and the current admin is what the US fought in WW2."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Centers for Disease Control Stops Inspecting Cruise Ships for Cleanliness",
            "external_url": "https://www.cruiselawnews.com/2025/04/articles/norovirus/centers-for-disease-control-stops-inspecting-cruise-ships-for-cleanliness/",
            "upvotes": 1569,
            "date": "04/14/2025",
            "thumbnail": "https://images.bannerbear.com/direct/y0aJ23zRDdqMxX4OGl/requests/000/086/762/705/aMBJ5DWdLYPeMemPzXRNjrp4Z/b5fcb413da3b1c55d9e0c6cdbcdee80ccc8837ee.png",
            "top_comments": [
                "**Me** *\"Oh, I wonder if this has anything to do with all the government cuts that have been happening...\"*\n\n**First line of the story** *\"Due to cuts by the Trump Administration, the U.S. Centers for Disease Control and Prevention (CDC) is now lacking the staff and resources to continue cruise ship health inspections...\"*\n\nHuh... I guess I'm not going to take a cruise any time soon either!",
                "The cruise ships were petri dish when regulations were in place, now it's just a buoyant bio-weapon.",
                "Luckily cruise ships are known as paragons of cleanliness & sanitation\n\nhttps://www.cdc.gov/vessel-sanitation/cruise-ship-outbreaks/index.html",
                "The ships were that nasty WITH inspections? damn....",
                "Mmmm… tasty norovirus",
                "It's almost like this Administration will poison, infect, disable and/or kill every man, woman & child in order to make a buck...",
                "The last 15 years cruise ships have been petri dishes with minimum inspections. No way in hell, I’d get on a cruise ship now",
                "I would only go on a cruise if I was looking for a way to get sick.",
                "Yet another reason not to take a cruise",
                "People responsible for enormous unnecessary environmental disaster about to reap the benefits."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Real ID Act to start May 7th",
            "external_url": "https://www.npr.org/2025/04/10/nx-s1-5355902/real-id-enforcement-may-7",
            "upvotes": 251,
            "date": "04/14/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+314/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbc%2Fb3%2Fbd8024254601bb9555dc8f59ca5d%2Fgettyimages-2190862035.jpg",
            "top_comments": [
                "Fuck, I got that when it was supposed to go into effect the first time as I just happened to need to renew my license anyway. That license already expired and I've had its replacement for like 2-years already.\n\nWith tourism tanking, I wouldn't be at all surprised if they decide to delay this again in some kind of pathetic attempt to convince people that they won't be picked up by ~~SS Storm Troopers~~ ICE agents and sent off to some ~~concentration camp~~ detention center before being deported.",
                "I’ve been hearing that the Real ID Act will kick in any day now for fifteen years. Every single time it has gotten delayed and kicked down the road. I’ll be genuinely shocked if it happens this time.",
                "If this actually happens, I **guarantee** the airports will be a f#cking zoo.  Plan on getting to the airport four hours before your flight and you might just make it aboard.",
                "Thankfully I got my passport renewed just before the new administration came in.\n\nI’ll get the Real ID after all this time when I get a new Driver’s License next year. But what a stupid thing to do. Like anyone has a god damn passport in mind for DOMESTIC flights.",
                "Can I vote with this or do I need a bunch of other forms?",
                "Just in time for the orange man to exploit it.",
                "Bet red states will pass a law to require Real ID in order to vote. \n\nI registered for a Voter ID card in February and it never arrived even after calling twice.",
                "Sooooo… how’s this going to be enforced if they dismantle TSA?",
                "It's about time. I'm tired of coddling the lowest common denominator, and this is just one small step."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Trump officials cut billions in Harvard funds after university defies demands | Trump administration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/14/trump-harvard-funding-freeze",
            "upvotes": 5247,
            "date": "04/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/afd6a3bcc0691545d7f8e402764158b7fa57d58a/0_91_4971_2983/master/4971.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b23276720d3bbb147424850c0c5c17f2",
            "top_comments": [
                "Kinda funny that Trump wants to ban students from wearing masks while federal agents conducting deportations wear them.",
                "It's really interesting, the way conservative voters never shut the fuck up about tyranny when they believe the government is serving anyone except exclusively them. But when the government starts cutting aid as punishment for defiance - an example of actual tyranny, for the record - it's fucking crickets from the conservative voter base.",
                "This is the hallmark of a totalitarian dictator.  Any university that caves to this, especially with the massive endowments that Harvard has deserves to lose their reputation.",
                "He can withhold money RIGHT AWAY. But go retrieve a human he trafficked? That's not possible.",
                "The actions of a vengeful man who never learned to regulate his emotions beyond the toddler stage.",
                "About to meet the real deep state.",
                "Harvard are rich enough and old enough (388 years) to tell this tinpot dictator to go fuck himself. \n\nAt least someone in power is doing it.",
                "Not an administration, a REGIME. Trump is not a leader, he's a dictator. Say what it really is.",
                "Harvard is literally older than the US government and his majesty of pettiness finds a way to soil it with his overflowing hatred. What a pathetic weak man. History will not be kind to his name.",
                "Good on Harvard, they need to stand their ground.     \nNow for the fun part, a lot of Harvard graduates do hold government positions and are probably going to get really mad that Trump did this to their school.  Can't wait to see the economic and campaign fallout from this."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "RISING",
            "title": "Panama opposition party accuses US of ‘camouflaged invasion’",
            "external_url": "https://www.theguardian.com/world/2025/apr/12/panama-hegseth-us-invasion-canal",
            "upvotes": 2241,
            "date": "04/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7bf75c775d223205be1dc61e405462971266fcc2/0_322_4827_2895/master/4827.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=560d918d4f7f03ff4d73c54f899d89e6",
            "top_comments": [
                "Nothing camo about it. Trump wants territory, resist or you'll find policy more aggressive by the year. ",
                "The silver lining is that while the Trump administration is corrupt and fascist, it's also stunningly incompetent.\n\nIt's Stalin mixed with simple Jack.",
                "Why are countries losing trust in us? It must be DEI.",
                "*For many Panamanians, the return of US armed forces – even for supposed “joint operations” – will bring back uncomfortable memories of 1989’s Operation Just Cause, when* [*American troops killed hundreds of civilians*](https://www.theguardian.com/world/2025/jan/12/panama-canal-trump)\n\nAdd this to Trump's imperial big mouth threats to take it over--and then sending troops back into the abandoned US bases, which Panamanians are not permitted to enter, and you do a \"camouflaged invasion.\"",
                "Panama, we're just as concerned here in the US. The day will come when the Trump cult \"disappears\" us to some foreign prison. That's where we're headed.",
                "No Panama, this is open invasion",
                "Like the “little green men” that invaded Crimea in 2014",
                "Hostile action from the United States in a Latin American country over economic benefits?  Hmm, where have I heard that one before for an entire century?",
                "Don't let the greedy pasty crusty old gringos touch your land",
                "Not surprised. Our politicians have failed us. We’re fucked."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Israeli strike leaves Gaza City’s last fully functioning hospital out of service as offensive escalates",
            "external_url": "https://www.cnn.com/2025/04/13/world/israel-strike-gaza-city-hospital-intl/index.html",
            "upvotes": 414,
            "date": "04/15/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2209405234.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Respect the United States doctrine to use their weapons. This is bull shit. It’s not the civilians fault that the “command center was built there”. We had servicemen die in Afghanistan just to reduce civilian casualties. This is inhumane and wrong",
                "Fuck these guys man. Even war is supposed to have rules. I can't wait for their downfall.",
                "Let me guess. The hospital was a Hamas operative?",
                "Fuck the Israeli Government. Fuck them to hell. Evil bastards. Every single one of them.",
                "But but but, there are terrorists.  Everyone is terrorist, even the children, especially the children.",
                "Israel is a terrorist genocidal state and the United States supports it. History will view those who supported this the same way it views nazis and their supporters.",
                "I bet there were almost zero Hamas leaders hiding below children's cribs in there.",
                "what is this, the 20th time Israel has “destroyed the LAST functioning hospital in Gaza”",
                "Gaza Hospital is always the headline. Hamas control center is always in quotes three paragraphs down...",
                "Do a google search for the words “Israel destroys last fully functioning hospital in Gaza” and you will come up with thirty or forty dates since the conflict began that this mythical “last fully functioning hospital” has been “destroyed by Israel.”\n\nYou lot believe any false propaganda Hamas spouts."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Columbia Activist Arrested by ICE at His Appointment for Citizenship",
            "external_url": "https://www.nytimes.com/2025/04/14/nyregion/columbia-student-palestinian-arrested-ice.html?unlocked_article_code=1._k4.cex1.lATs6MwweUmU&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 12362,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Mr. Mahdawi has not been accused of a crime. According to his lawyers, the Trump administration appears to be seeking his removal from the country under the same legal provision that it is using to detain another recent Columbia student and Palestinian, Mahmoud Khalil, contending that his presence is a threat to the foreign policy and national security interests of the United States. Immigration officials have argued that pro-Palestinian demonstrators have enabled the spread of antisemitism, but they have not offered evidence to substantiate the claim.\n\nThis is the real issue. Rubio can just say this guy’s presence harms our foreign policy agenda and SCOTUS has already said a judge can’t overrule that or challenge it in any way, despite Rubio not presenting any evidence to support it. \n\nSo, once again, if the government says you’re a terrorist, they can deport you without any evidence of that, and ~~SCOTUS has affirmed that somehow that’s legal and constitutional!~~\n\nEDIT: Clarifying one point (corrected above) - SCOTUS has not (yet) ruled on Khalil’s case, that was a judge in Louisiana. That ruling is in the process of being appealed.",
                "4th amendment protects “people” (not citizens) from unreasonable arrests, without charging him with a crime this is kidnapping and false imprisonment; and if they can do it to him they can do it to anyone.",
                "Brownshirts disappear another person in broad daylight.",
                "Honestly, me as a legal immigrant, with a good education and positively contributing to my community,  I feel in danger, I can’t imagine how the other human beings who came to this country to try a better life as many did in the last century feels right now.\n\nAnd honestly again, it does not look like the base of US society cares on what he does, if he doesn’t harm the economy.",
                "Representatives for Columbia declined to comment, citing federal student privacy regulations.. \nLOL the fucking irony with them.",
                "Disband ICE.\n\nThe new secret police.",
                "This is what people voted for.",
                "Look at all these ICE agents, happy to be Nazis.",
                "Guys they told you it will be bloodless if you allow it to be.",
                "How long will it take the sensible US person that what the US used to stand for is gone and the current admin is what the US fought in WW2."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Centers for Disease Control Stops Inspecting Cruise Ships for Cleanliness",
            "external_url": "https://www.cruiselawnews.com/2025/04/articles/norovirus/centers-for-disease-control-stops-inspecting-cruise-ships-for-cleanliness/",
            "upvotes": 1565,
            "date": "04/14/2025",
            "thumbnail": "https://images.bannerbear.com/direct/y0aJ23zRDdqMxX4OGl/requests/000/086/762/705/aMBJ5DWdLYPeMemPzXRNjrp4Z/b5fcb413da3b1c55d9e0c6cdbcdee80ccc8837ee.png",
            "top_comments": [
                "**Me** *\"Oh, I wonder if this has anything to do with all the government cuts that have been happening...\"*\n\n**First line of the story** *\"Due to cuts by the Trump Administration, the U.S. Centers for Disease Control and Prevention (CDC) is now lacking the staff and resources to continue cruise ship health inspections...\"*\n\nHuh... I guess I'm not going to take a cruise any time soon either!",
                "The cruise ships were petri dish when regulations were in place, now it's just a buoyant bio-weapon.",
                "Luckily cruise ships are known as paragons of cleanliness & sanitation\n\nhttps://www.cdc.gov/vessel-sanitation/cruise-ship-outbreaks/index.html",
                "The ships were that nasty WITH inspections? damn....",
                "Mmmm… tasty norovirus",
                "It's almost like this Administration will poison, infect, disable and/or kill every man, woman & child in order to make a buck...",
                "The last 15 years cruise ships have been petri dishes with minimum inspections. No way in hell, I’d get on a cruise ship now",
                "I would only go on a cruise if I was looking for a way to get sick.",
                "Yet another reason not to take a cruise",
                "People responsible for enormous unnecessary environmental disaster about to reap the benefits."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "‘I became like a slave’: why 43 women are suing the secretive Opus Dei Catholic group in Argentina",
            "external_url": "https://www.inkl.com/news/i-became-like-a-slave-why-43-women-are-suing-the-secretive-opus-dei-catholic-group-in-argentina",
            "upvotes": 840,
            "date": "04/14/2025",
            "thumbnail": "https://images.inkl.com/s3/article/lead_image/21829879/1000.jpg",
            "top_comments": [
                "Went to a boys only Opus Dei school in Colombia. Super creepy people, fundamentalist catholics, they used to teach us hoax miracle stories from tabloids as if they were true, taught us old testament biblical scripture as if it were literally true (adam & eve, noahs ark, etc), and we had to go to mass every morning. \n\nI left that school for a more secular Jesuit school.\n\nNot surprised that they're involved in a scandal like this.",
                "Wasn't this group a big part of The Da Vinci Code?",
                "I wonder what it will take humanity, to inoculate itself against cults.",
                "Isn't this the same Catholic cult responsible for a lot of the insanity happening in America right now?",
                "A cult is a cult, and they are all evil.",
                "There a non-paywalled version of TFA?",
                "Catholics treating women like crap? Really?\n\nYa don’t say…",
                "I think it's time for everybody to put religion in their rear view mirror. Believe what you want. You don't need someone to put rules on you.",
                "Wow ... when I think the catholic clergies cannot be more evil, they exceed my expectation. Abusing children is not enough. Have to make them into slaves too? You better hope there is no god and there is no hell.",
                "And… Christianity strikes again."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "U.S. businesses sue to block Trump tariffs, say trade deficits are not an emergency",
            "external_url": "https://www.cnbc.com/2025/04/14/us-businesses-sue-to-block-trump-tariffs-say-trade-deficits-are-not-an-emergency.html",
            "upvotes": 11958,
            "date": "04/14/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108130239-17443060692025-04-10t171901z_1554291057_rc25vda791jm_rtrmadp_0_usa-trump.jpeg?v=1744664864&w=1920&h=1080",
            "top_comments": [
                "We are a service economy and Trump wants you and your children back in the mines.",
                "Only matters if 2/3rds of the Senate agree. Sooo get used to a tanking economy.",
                "By any reasonable definition Trump is _very clearly_ (as in beyond a shadow of a doubt) abusing emergency powers. And abusing them badly. Dictatorially.\n\nReasonable definitions no longer apply in this country, though.",
                "Trump is ignoring the Supreme Court, your lawsuits won't matter to him at all",
                "Shame he will ignore the judges. A bribe might be more effective. ",
                "This will be an interesting lawsuit. I believe they are seeking an injunction as well. Since this is court of International Trade it would have jurisdiction to issue the injunction. Secretly Republicans are hoping courts rules against Trump so they don’t have to reign him in",
                "They are absolutely correct, of course. That said, I'm skeptical that a judge is going to allow private business to overrule what the federal government decides is a national emergency.",
                "It's as if their Congressional Reps are devoid of any legal power on their behalf. I wonder if any of these said businesses donated money to Republican reps who sit idly by as Trump jeopardizes their constituents' livelihoods.",
                "[https://www.theguardian.com/us-news/2025/apr/07/trump-tariffs-lawsuit](https://www.theguardian.com/us-news/2025/apr/07/trump-tariffs-lawsuit)\n\nfun fact the Koch brothers are suing the government. Yes those Koch brother republican mega-donors.",
                "Good thing that Congress paused \"the concept of days passing\" so that they don't have to vote on ending the emergency powers granted to Trump that he's using to enact all these tariffs."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "More H5N1 detections in US dairy cows and poultry; WHO unveils H5 surveillance guide",
            "external_url": "https://www.cidrap.umn.edu/avian-influenza-bird-flu/more-h5n1-detections-us-dairy-cows-and-poultry-who-unveils-h5-surveillance",
            "upvotes": 199,
            "date": "04/15/2025",
            "thumbnail": "https://www.cidrap.umn.edu/themes/custom/cidrap_theme/images/cidrap-og-image.jpg",
            "top_comments": [
                "Just a reminder that the current administration is more likely to order you to be infected to \"build immunity\" than it is to do anything to stop this.",
                "Bird flue is fake news!!  \n\nLiterally everyone around me is saying that. They make my brain hurt.",
                "If we don't test for it, then it doesn't exist. Just need more Vitamin C. /s",
                "Just believe in Trump hard enough and you'll be fine. If you die it's your fault for not loving America.",
                "god people are so _______d . we are fucked .",
                "Jokes on them, we don’t believe in the WHO anymore over here in freedom land…\n\n/s"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Despite a court order, White House bars AP from Oval Office event",
            "external_url": "https://apnews.com/article/trump-ap-press-freedom-court-gulf-caffd32aa8ec6b04a50b8c5277d7c9cb",
            "upvotes": 5787,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It's starting to look like judges don't hold any real power.",
                "The trump regime is refusing to follow the rule of law or the constitution. Trumps own personally stacked supreme court has ruled against his actions, and he won't even follow their orders. Trump is a full blown dictator and should face the penalty for treason against the US and its citizens.",
                "FoxNews better be yelling and screaming that the Musk/Trump administration is doing this. \n\nPepperidge Farms remembers: [White House attempted to shut out Fox News reporter](https://www.rcfp.org/white-house-attempted-shut-out-fox-news-reporter/)",
                "So the White House press secretary will be held in contempt and imprisoned until they comply with a lawful court order, right?",
                "This was all but guaranteed to happen. Trump will not be following the law. He doesn't have to. His own voters said he doesn't need to be law-abiding. ",
                "This is part of the playbook: ignore the courts, have no consequences, and continue the implementation of Project 2025.",
                "Looks like today was the big \"The courts no longer matter\" coming out party.\n\nIirc the report on martial law drops this Sunday so stay tuned for that announcement.",
                "Hold them in contempt! Do something?!",
                "Dear Other news Agencies: see what you do now is ALL of you boycott until the AP is allowed back in. Just to make sure you understand that. ",
                "It's not about party anymore. Wake the fuck up America."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Harvard University rejects Trump administration's proposed conditions for federal funding",
            "external_url": "https://www.cbsnews.com/boston/news/harvard-university-trump-federal-funding/",
            "upvotes": 10010,
            "date": "04/14/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/09/11/5ac72c51-54d4-468b-85ad-ab4e6c6498d1/thumbnail/1200x630/e8eea82be00e3f7cadfd3999429d4642/harvard-university.jpg?v=22a842e47fa1552047fb956f78e1acf0",
            "top_comments": [
                ">A letter sent to Harvard on April 11 outlined a series of conditions Harvard needed to meet to maintain a \"financial relationship\" with the federal government. The demands included leadership reforms, an immediate halt to diversity, equity and inclusion policies, an audit of \"viewpoint diversity\" among students and faculty, and \"meaningful discipline\" for students who violated school policies when a pro-Palestinian tent encampment went up on Harvard Yard. \n\nFor those who wondered what the conditions were.",
                "I was really concerned after Columbia that they would all fold. I am happy to see at least some arent for now",
                "It’s about time. I hope more universities soon follow!",
                "Harvard knows game theory.  If more universities follow suit, there are going to be a whole lot of pissed off parents and employers.  And they won't be pissed off at the universities.",
                "This is what “fuck you” money looks like. ",
                "Read the letter from the government to Harvard. Insane that the federal government tried to dictate to a private university things like the following: \n\n+ Harvard must ban specific student clubs and discipline their members\n\n+ Harvard must enforce \"viewpoint diversity\" (that is, make sure that every department hires more Republican faculty and admits more Republican students) \n\n+ Harvard must ban masks",
                "This should sound the alarm in any democracy. They are threatening defunding of one of the most prestigious universities if they don't fall in line with the narrative of the administration.",
                "It's almost like Harvard has a massive endowment and a shitload of Harvard-trained lawyers they can call on.",
                "Fuck MAGA. Every college, corporation, law firm, etc needs to sack up. FIGHT!",
                "Tomorrow's Headline: Harvard Board of Trustees Deported to El Salvador."
            ],
            "aggregate_sentiment": 38.0
        }
    ],
    "last_updated": "04/15/2025 04:10:53 UTC"
}