{
    "posts": [
        {
            "category": "HOT",
            "title": "Former US Rep. Charles Rangel, who spent nearly 50 years representing New York, has died",
            "external_url": "https://apnews.com/article/charles-rangel-dies-9902b608e33aeb7db30478be00a77acc",
            "upvotes": 3652,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Rep Rangel fought with the 2d Division in the Battle of Chongchon, some of the most intense fighting during the Korean War. This was the battle in late November 1959 when the Chinese surprised the US military by entering into the war on North Korea’s side. Here is his interview on his experience: https://koreanwarlegacy.org/interviews/charles-rangel/\nRIP Rep Rangel.",
                "Rangel did a lot of work for the Harlem community, esp culturally in terms of the research library there, the arts, and Harlem history.",
                "Democrats are falling like flies lately. Quite unfortunate, RIP.",
                "No one reads the articles.",
                "It's quite amazing that Harlem has only had three people represent them in Congress in 80 years. Rangel defeated Adam Clayton Powell, Jr. in 1970 who was a legend in the community but by the time the mid-60s came around, he had all but checked out of the job and was under investigation for misusing public money. And he was spending more time in his second home in Bimini than Washington or New York. And Rangel became a legend in his own right but probably stayed too long as well before finally retiring in 2017.",
                "For anyone who only knows about politics through The Daily Show and other comedy programming, you may recognize Rep. Charlie Rangel from [this photo.](https://vip.nypost.com/wp-content/uploads/sites/2/2014/06/rangel5.jpg)",
                "He helped Nixon lead the war on drugs. \n\nhttps://www.northcountrypublicradio.org/news/story/22550/20130819/charles-rangel-america-s-front-line-general-in-the-drug-war",
                "https://youtu.be/a_GRMQ9H6IU?si=XyLCIaRvxWn-40-7",
                "[deleted]",
                "“Don’t leave me swinging in the wind, until November” I still remember that smoyoho video chorus. RIP, Rangel."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Mary Lou Retton arrested for DUI",
            "external_url": "https://www.wdtv.com/2025/05/26/mary-lou-retton-arrested-dui-marion-county/",
            "upvotes": 5945,
            "date": "05/26/2025",
            "thumbnail": "https://gray-wdtv-prod.gtv-cdn.com/resizer/v2/LRXBURX27RGONAM34KNDBKXDQQ.jpg?auth=06dde6adb7b85990a69e4984ffdab2c6bbf8a9788c86af1cae05d7b26a2c2483&width=1200&height=600&smart=true",
            "top_comments": [
                "She blew a 6.0, but the Russian judge cut it down to 5.4.",
                "Thought she was dying in the hospital recently? Either way sucks don’t drink and drive.",
                "Fuck her. She campaigned AGAINST a bill calling for reform in gymnastics after the whole Nasser sexual assault scandal. Vile.",
                "She was leaving the Uneven Bar",
                "For anyone who doesn’t know who she is: [Mary Lou Retton](https://en.m.wikipedia.org/wiki/Mary_Lou_Retton)\n\nJudging from the current comments, her current reputation is sub-par to say the least.",
                "I guess her crowded funded half million from a few years ago won't cover an Uber.",
                "For those keeping track at home, we've got:  \n\\- Abuse apologizer / Larry Nassar supporter  \n\\- Anti-SafeSport Act  \n\\- Anti-universal healthcare (and subsequent leech of others' generosity to expense her medical bills due to being anti-Obamacare, all the while living in a mansion and having received $2 million in her divorce settlement only a few years prior)  \n\\- Face of reverse mortgage ads  \nAnd now,  \n\\- Selfish and dangerous driver with a DUI on her record\n\nQuite the fall from grace imho, really failed to stick the landing on her post-Olympic life.",
                "She cried about not having insurance when she was near death a few years back, but doesn’t vote for the party that would’ve helped her.\n\nAnd the  Nassar  stuff. F her",
                "She’s apparently not having a good post Olympics life.",
                "That's a rough 57. Too bad. She was America's sweetheart. On the box of Wheaties and everything."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Sentencing hearing scheduled for Myrtle Beach Safari owner highlighted in ‘Tiger King’",
            "external_url": "https://www.wmbfnews.com/2025/05/26/sentencing-hearing-scheduled-myrtle-beach-safari-owner-highlighted-tiger-king/",
            "upvotes": 3002,
            "date": "05/26/2025",
            "thumbnail": "https://gray-wmbf-prod.gtv-cdn.com/resizer/v2/VQSOJZS435AF3NCVAUBXYVLD74.jpg?auth=956150d40cdfb7bd084074507ad21f87db4903f5f733efd55225dd3987999637&width=1200&height=600&smart=true",
            "top_comments": [
                "Just as big of a piece of shit as Joe, but with more intelligence.",
                "What stuck with me about this guy after watching Tiger King were the women he \"employed\". They had to be virginal or really close to it, young and willing to work seven days a week for the roof over their head. He's a disgusting piece of garbage and I hope he gets max sentencing.",
                "He's got ~~Betty Davis~~ Methamphetamine Eyes.",
                "*The investigation also uncovered evidence of money laundering between Feb. and April 2022, when Antle and his co-conspirator conducted financial transactions with cash they believed was obtained from transporting and harboring undocumented immigrants.*\n\nWhat da hell",
                "Who the fuck operates a “safari” in Myrtle fucking beach?!",
                "Is Carol Baskins the only main character that isn’t in jail?",
                "That guy was such an insufferable douche. That guy is gonna need both hands to pull his head out of his ass.",
                "Didn't he do tourist photos with heavily drugged tigers at his Myrtle Beach Safari?",
                "I watched that train wreck...I'll never get that time back.",
                "In the paraphrased words of L. Ron Hubbard, the real grift is in religion. You make up some mumbo jumbo and get some marks to believe it. Hubbard did set the standard though, if your money laundering sci-fi sex cult doesn't have a boat, are you even trying?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Duck Dynasty founding father Phil Robertson dies at 79",
            "external_url": "https://www.nbcnews.com/news/obituaries/duck-dynasty-founding-father-phil-robertson-dies-79-rcna209035",
            "upvotes": 9367,
            "date": "05/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250526-Phil-Robertson-DD-RS-408024.jpg",
            "top_comments": [
                "[deleted]",
                "What's crazy is he went to college and played QB and a very high level",
                "Goldnecks: rich people who like pretending they're just some country boys",
                "Claims to be Pro-Life, dies.",
                "“Two guys break into an atheist’s home, he has a little atheist wife and two little atheist daughters. Two guys break into his home, and tie him up in a chair and gag him. And then they take his two daughters in front of him and rape both of ‘em and then shoot ‘em. And they take his wife and decapitate her head off in front of him. And then they can look at him and say “Isn’t it great that I didn’t have to worry about being judged? Isn’t it great that there’s nothing wrong with this? There’s no right or wrong. Now is it, dude?” And then you take a sharp knife and take his manhood and hold it in front of him and say “Wouldn’t it be something if there was something wrong with this? But you’re the one who says there’s no god, there’s no right, there’s no wrong, so we’re just having fun! We’re sick in the head. Have a nice day.”\n\n-Phil Robertson\n\nYeah this is the thought process of a piece of garbage. Nothing was lost on this day. Good riddance, prick.",
                "Is that the super racist one?",
                "The Hillbilly Kardashians",
                "Hmmmm… a grifting father of a family of grifters no longer alive to grift. \n\nSo, what’s everyone doing for Memorial Day?",
                "He’s visiting Rush Limbaugh.",
                "As a 13th generation Cajun, I hated this family."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Police responding to incident at Liverpool FC parade after reports of car collision with pedestrians | UK News",
            "external_url": "https://news.sky.com/story/police-responding-to-incident-at-liverpool-fc-parade-after-reports-of-car-collision-with-pedestrians-13374978",
            "upvotes": 1364,
            "date": "05/26/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-liverpool-car-crash_6928124.jpg?20250526194011",
            "top_comments": [
                "[removed]",
                "In case anybody was unsure: \"closed the damned streets with car-proof barriers\"\n\nMy God how does this keep happening.",
                "53 year old white male\nhttps://news.sky.com/story/police-responding-to-incident-at-liverpool-fc-parade-after-reports-of-car-collision-with-pedestrians-13374978",
                "That's got to be a police fail. Yes, the guy lost it, but how he was allowed to get his car into that area is inexcusable. \n\nIt is then a series of panicked decisions (just get out of the car and give it up, it'll be fine) followed by utter psychosis, literally deliberately driving into people. \n\nIt is GBH and possibly attempted murder BTW, fucking idiot.",
                "First one I’ve experienced where I had family at the event. They’re fine, thank god. No where near it. \n\nFirst one, but at this rate, probably not the last. We all responded so immediately and calmly with calls to make sure everyone was fine? Like it was drilled? Fuck.",
                "Think we should be careful about speculation. Especially in the wake of what happened following the Southport killings.",
                "The bastard is lucky the crowd didn’t tear them limb from limb. Definitely deliberate. ",
                "Looks like the cops were protecting the perpetrator from the crowd after he plowed into them. Seems like they would of dragged his ass out and put the boots to him.",
                "Guys im not questioning the guy being white and british but looking at the numerous videos available he is not 53 years old",
                "Cars are the new favorite weapons for high casualty events, but we let them into crowded spaces daily."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "WWII bomber crash left 11 dead and ‘non-recoverable.’ 4 are finally coming home",
            "external_url": "https://apnews.com/article/american-bomber-wwii-remains-divers-212ba07efdab40941f09026c79fdb5c0",
            "upvotes": 1591,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Sheppick, 26, and Tennyson, 24, each left behind pregnant wives who would sometimes write them two or three letters a day. Darrigan, 26, also was married, and had been able to attend his son’s baptism while on leave. A photo shows him in uniform, smiling as he holds the boy.\n\n>Darrigan’s wife, Florence, remarried but quietly held on to photos of her late husband, as well as a telegram informing her of his death.\n\n>Tennyson’s wife, Jean, lived until age 96 and never remarried.\n\n>“She never stopped believing that he was going to come home,” said her grandson, Scott Jefferson.\n\nSo rough on the families too. Glad they were able to help bring closure for some of them.",
                "From the title I thought another restored aircraft went down.",
                "Their bomber was called *'Heaven Can Wait'*. Thank you gentlemen. Youe wait is over.",
                "If anyone has American ancestors who were MIA in WW1, WW2, Korea, Vietnam, the Gulf Wars, or anytime during the Cold War that are unidentified, you can reach out to the [Defense POW/MIA Accounting Agency](http://dpaa.mil/Resources/FAQs/) (Look at WHO IS ELIGIBLE TO DONATE MITOCHONDRIAL DNA?)",
                "Welcome home gentlemen. Rest in peace - your service shall not be forgotten.",
                "cant imagine theres many remains left to find after being at the bottom of the ocean for 80 years.  surely their bones would have been scattered by scavengers? i doubt the wreck was perfectly sealed",
                "Welcome home gentleman.    R.I.P.",
                "All of you did what was necessary and paid the ultimate price and sacrifice.  Thank you very much for your service and welcome home.  \n\nHope you and the loved one left behind are together again upstair.\n\nGod bless you all."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Ex-police chief escapes from Arkansas prison where he was serving murder, rape sentences",
            "external_url": "https://www.cbsnews.com/news/grant-hardin-arkansas-prison-escape/",
            "upvotes": 7661,
            "date": "05/26/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/26/c4e4b220-3f6d-437e-87ce-45f405a660b9/thumbnail/1200x630/0dae33da6db213d4a59f739177cb86f5/screenshot-2025-05-25-at-9-50-46-pm.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                ">[KFSM reported in 2019](https://www.5newsonline.com/article/news/local/outreach/back-to-school/former-police-chief-convicted-murderer-pleads-guilty-to-raping-rogers-teacher-in-1997/527-accc272d-e94b-4c00-b9cb-6a4ee5e42125) that police in 2003 used DNA samples from the rape victim's clothes to apply for a \"John Doe\" warrant since the statute of limitations was close to expiring. Investigators eventually got a match after Hardin was imprisoned for Appleton's killing.\n\nMurders someone, then his DNA sample during processing matches a rape case.\n\nWinning through and through.",
                "Hardin pleaded guilty in October 2017 to first-degree murder in connection with the shooting death of 59-year-old James Appleton. According to an affidavit filed in the case, Appleton worked for the Gateway water department and was talking to his brother-in-law, then-Gateway Mayor Andrew Tillman, when he was shot in the head on Feb. 23, 2017, near Garfield. Police found Appleton's body inside a car.",
                "“Ex-police chief, who escaped from prison for rape and murder sentences, is found as the new police chief a town in a neighboring state”",
                "Totally “accidentally”",
                "What's with all the prison breaks that have been happening lately? Have there actually been more of them, or is the news just reporting on them because they're trending? Or is the *Prison Break* reboot going hard with its marketing?",
                "Wouldn't he have been out of genpop for being a former cop anyway? How he escaped has to either be a serious fuck up or extremely daring.",
                "I bet he had inside help.",
                "he likely just knew the layout and knew exactly what was needed to go with no fuss. \n\ni worked in a psych ward for a few years and realize im not exempt to being subjected to a place like this if i decided on a whim that i was done. if i had landed in the facility i worked i'd probably beg them not to take me to this particular place, mostly out of embarrassment, specifically telling them that i know the entire layout and how to get out if i needed to. this highlights the flaw in the system. if i told them this en route, they wouldnt care. its not their problem. the intake department might have some concerns, but the facility manager would likely pass it off as some random manic episode. they certainly wouldnt check records, because the paycheck of holding someone is the single most important factor for them.\n\ni left that job btw, because someone on another unit successfully committed suicide on their watch. this is literally the most important part of our job, but they wanted to cut corners, and go against doctors orders to save a few dollars. the only positive takeaway i have from the entire situation that it wasnt my unit. i only heard things. never interacted with the individual myself...",
                "Gonna end up dead soon.",
                "Pretty sure there’s Datelines, and a few YouTube docs about this guys case"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Japan flight made emergency landing after man tried opening door",
            "external_url": "https://www.bbc.com/news/articles/cgmjzlj0g30o",
            "upvotes": 1857,
            "date": "05/26/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4d40/live/c8831680-3a0f-11f0-a4ca-c350ccf42b30.jpg",
            "top_comments": [
                "When my sister flew with Air New Zealand as a stewardess, she relates how a gentleman came up to her in the galley, and asked if he could get off. He said he’d had enough of flying and just wanted off. He was subsequently gently sedated.",
                "Just in case anyone is wondering, it's basically impossible to open the doors of a commercial airliner at altitude. They open inward first before swinging out, and the interior of the aircraft is pressurized when flying, forcing the door into its frame. That pressure applies too much interior force to the door for a human to overcome and prevents it from opening.",
                "I keep seeing headlines about people doing this. Whats actually happening with these people? What “medical crisis” makes someone think they can just open a door and get off an airplane in mid-air? Are they on weird sleep/anxiety medications and having some sort of reaction or episode? Are they crazy and having a delusion?",
                "A Japanese plane headed from Tokyo to Texas had to make an emergency landing after a passenger tried to open one of its doors during the flight.\n\nAll Nippon Airways (ANA) Flight 114 was diverted to Seattle hours after taking off on Saturday \"due to an unruly passenger\", the airline said.\n\nPort of Seattle police told media they had been notified of a man who \"attempted to open exit doors during the flight\".",
                "It’s coming to the point where I am constantly seeing people not knowing how to behave or being dangerous on flights that I wouldn’t be surprised if you had to have a background check and interview to be allowed on planes in the future",
                "A lot of very not-normal people going to Japan for trips recently. It makes me not want to go just to not contribute to their disrespectful tourist epidemic, even if I'd never be of that group.",
                "You're not in the movie Air Force One, brother.",
                "What's the big deal? Dude just needed to step out for some fresh air.",
                "Odd, when you realise it's the altitude holding the door closed.",
                "Intrusive thoughts win again!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump delays 50% tariffs on EU to July 9",
            "external_url": "https://www.cnbc.com/2025/05/25/trump-50percent-tariffs-eu-july-9.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
            "upvotes": 16646,
            "date": "05/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108150321-1748213510226-AP20021497359027.jpg?v=1748213621&w=1920&h=1080",
            "top_comments": [
                "No way. What, wow. Did not see that coming.",
                "Another day, another method to manipulate the markets.",
                "Come Tuesday, it will be 100% tariffs on the EU, then by Friday they will be delayed again.  Guaranteed the Trump family will make millions this week",
                "We've seen this movie already. First time was shitty by the way",
                "Friendly reminder that Congress could stop this at any time. They, specifically Republicans, are actively choosing not to, likely because they are also benefiting from this blatant market manipulation.",
                "Today. Tomorrow it will take effect immediately. On Thursday he will double it if a single European citizen complains about US tariffs. Friday he will have forgotten about all of the tariffs and will wonder why European citizens are cold to his administration until his aides remind him, which he will at first deny, and then go on an hours long xenophobic rant, claiming Latvian as the next new state, and quadruple the already doubled tariffs. Repeat.",
                "Is it really a delay if you were never going to do it in the first place? If so, then I'm announcing my decision to delay my upcoming date with Margot Robbie.",
                "Trump’s foreign policy strategy: threaten fire, then call it a favor when you delay the match.",
                "lol they saw stock market futures and said yah, no.... this is the fat nixon market manipulation cycle of walking back tariffs so they never get imposed when his bluff is called. now the markets will be happy on Tuesday. i guess our judicial system is ignoring this blatant illegal activity like god sleeping through the holocaust",
                "Amazing leadership. Truly maga in every way"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "National parks ordered to police negative history under Trump directive",
            "external_url": "https://www.sfgate.com/california-parks/article/national-parks-negative-history-trump-20343308.php",
            "upvotes": 25295,
            "date": "05/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It's so interesting how statues are history that can't be challenged, but actual history needs to be hidden.",
                "So, we're in the, \"Report your neighbor for wrong think,\" phase.",
                "\"The battle of Gettysburg was a decisive win for the confederacy.   Afterwards both sides celebrated with dancing and singing to the historic tune \"YMCA\" by the legendary people of the village. \"",
                "History is *supposed* to make you uncomfortable.",
                "[removed]",
                "Negative history... like his administration?",
                "“The signs will state that the property belongs to the American people and ask visitors to report any areas in need of repair, services requiring improvement, or signage and information that present past or living Americans in a negative light or “fail to emphasize the beauty, grandeur, and abundance of the natural landscape,””\n\nSo this is about finding signs that don’t glaze America enough? To what standard? Are we going to ask Elon’s AI to grade each sign and rank it by how good the glaze is?",
                "So let me guess, countrywide its going to start being taught as \"The War of Northern Aggression\" and how the Union cruelly stole Blacks \"happiness in slavery.\" Or perhaps something about how Americans never harmed Native Americans and always honored their treaties. You know, just straight up ignore history so Cletus doesn't have to feel uncomfortable. ",
                "“Those who cannot remember the past are condemned to repeat it.” – George Santayana, The Life of Reason, 1905",
                "Executive order for revisionist history thats certainly something "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Former US Rep. Charles Rangel, who spent nearly 50 years representing New York, has died",
            "external_url": "https://apnews.com/article/charles-rangel-dies-9902b608e33aeb7db30478be00a77acc",
            "upvotes": 3653,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Rep Rangel fought with the 2d Division in the Battle of Chongchon, some of the most intense fighting during the Korean War. This was the battle in late November 1959 when the Chinese surprised the US military by entering into the war on North Korea’s side. Here is his interview on his experience: https://koreanwarlegacy.org/interviews/charles-rangel/\nRIP Rep Rangel.",
                "Rangel did a lot of work for the Harlem community, esp culturally in terms of the research library there, the arts, and Harlem history.",
                "Democrats are falling like flies lately. Quite unfortunate, RIP.",
                "No one reads the articles.",
                "It's quite amazing that Harlem has only had three people represent them in Congress in 80 years. Rangel defeated Adam Clayton Powell, Jr. in 1970 who was a legend in the community but by the time the mid-60s came around, he had all but checked out of the job and was under investigation for misusing public money. And he was spending more time in his second home in Bimini than Washington or New York. And Rangel became a legend in his own right but probably stayed too long as well before finally retiring in 2017.",
                "For anyone who only knows about politics through The Daily Show and other comedy programming, you may recognize Rep. Charlie Rangel from [this photo.](https://vip.nypost.com/wp-content/uploads/sites/2/2014/06/rangel5.jpg)",
                "He helped Nixon lead the war on drugs. \n\nhttps://www.northcountrypublicradio.org/news/story/22550/20130819/charles-rangel-america-s-front-line-general-in-the-drug-war",
                "https://youtu.be/a_GRMQ9H6IU?si=XyLCIaRvxWn-40-7",
                "[deleted]",
                "“Don’t leave me swinging in the wind, until November” I still remember that smoyoho video chorus. RIP, Rangel."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Mary Lou Retton arrested for DUI",
            "external_url": "https://www.wdtv.com/2025/05/26/mary-lou-retton-arrested-dui-marion-county/",
            "upvotes": 5951,
            "date": "05/26/2025",
            "thumbnail": "https://gray-wdtv-prod.gtv-cdn.com/resizer/v2/LRXBURX27RGONAM34KNDBKXDQQ.jpg?auth=06dde6adb7b85990a69e4984ffdab2c6bbf8a9788c86af1cae05d7b26a2c2483&width=1200&height=600&smart=true",
            "top_comments": [
                "She blew a 6.0, but the Russian judge cut it down to 5.4.",
                "Thought she was dying in the hospital recently? Either way sucks don’t drink and drive.",
                "Fuck her. She campaigned AGAINST a bill calling for reform in gymnastics after the whole Nasser sexual assault scandal. Vile.",
                "She was leaving the Uneven Bar",
                "For anyone who doesn’t know who she is: [Mary Lou Retton](https://en.m.wikipedia.org/wiki/Mary_Lou_Retton)\n\nJudging from the current comments, her current reputation is sub-par to say the least.",
                "I guess her crowded funded half million from a few years ago won't cover an Uber.",
                "For those keeping track at home, we've got:  \n\\- Abuse apologizer / Larry Nassar supporter  \n\\- Anti-SafeSport Act  \n\\- Anti-universal healthcare (and subsequent leech of others' generosity to expense her medical bills due to being anti-Obamacare, all the while living in a mansion and having received $2 million in her divorce settlement only a few years prior)  \n\\- Face of reverse mortgage ads  \nAnd now,  \n\\- Selfish and dangerous driver with a DUI on her record\n\nQuite the fall from grace imho, really failed to stick the landing on her post-Olympic life.",
                "She cried about not having insurance when she was near death a few years back, but doesn’t vote for the party that would’ve helped her.\n\nAnd the  Nassar  stuff. F her",
                "She’s apparently not having a good post Olympics life.",
                "That's a rough 57. Too bad. She was America's sweetheart. On the box of Wheaties and everything."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Sentencing hearing scheduled for Myrtle Beach Safari owner highlighted in ‘Tiger King’",
            "external_url": "https://www.wmbfnews.com/2025/05/26/sentencing-hearing-scheduled-myrtle-beach-safari-owner-highlighted-tiger-king/",
            "upvotes": 3008,
            "date": "05/26/2025",
            "thumbnail": "https://gray-wmbf-prod.gtv-cdn.com/resizer/v2/VQSOJZS435AF3NCVAUBXYVLD74.jpg?auth=956150d40cdfb7bd084074507ad21f87db4903f5f733efd55225dd3987999637&width=1200&height=600&smart=true",
            "top_comments": [
                "Just as big of a piece of shit as Joe, but with more intelligence.",
                "What stuck with me about this guy after watching Tiger King were the women he \"employed\". They had to be virginal or really close to it, young and willing to work seven days a week for the roof over their head. He's a disgusting piece of garbage and I hope he gets max sentencing.",
                "He's got ~~Betty Davis~~ Methamphetamine Eyes.",
                "*The investigation also uncovered evidence of money laundering between Feb. and April 2022, when Antle and his co-conspirator conducted financial transactions with cash they believed was obtained from transporting and harboring undocumented immigrants.*\n\nWhat da hell",
                "Who the fuck operates a “safari” in Myrtle fucking beach?!",
                "Is Carol Baskins the only main character that isn’t in jail?",
                "That guy was such an insufferable douche. That guy is gonna need both hands to pull his head out of his ass.",
                "Didn't he do tourist photos with heavily drugged tigers at his Myrtle Beach Safari?",
                "I watched that train wreck...I'll never get that time back.",
                "In the paraphrased words of L. Ron Hubbard, the real grift is in religion. You make up some mumbo jumbo and get some marks to believe it. Hubbard did set the standard though, if your money laundering sci-fi sex cult doesn't have a boat, are you even trying?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Police responding to incident at Liverpool FC parade after reports of car collision with pedestrians | UK News",
            "external_url": "https://news.sky.com/story/police-responding-to-incident-at-liverpool-fc-parade-after-reports-of-car-collision-with-pedestrians-13374978",
            "upvotes": 1364,
            "date": "05/26/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-liverpool-car-crash_6928124.jpg?20250526194011",
            "top_comments": [
                "[removed]",
                "In case anybody was unsure: \"closed the damned streets with car-proof barriers\"\n\nMy God how does this keep happening.",
                "53 year old white male\nhttps://news.sky.com/story/police-responding-to-incident-at-liverpool-fc-parade-after-reports-of-car-collision-with-pedestrians-13374978",
                "That's got to be a police fail. Yes, the guy lost it, but how he was allowed to get his car into that area is inexcusable. \n\nIt is then a series of panicked decisions (just get out of the car and give it up, it'll be fine) followed by utter psychosis, literally deliberately driving into people. \n\nIt is GBH and possibly attempted murder BTW, fucking idiot.",
                "First one I’ve experienced where I had family at the event. They’re fine, thank god. No where near it. \n\nFirst one, but at this rate, probably not the last. We all responded so immediately and calmly with calls to make sure everyone was fine? Like it was drilled? Fuck.",
                "Think we should be careful about speculation. Especially in the wake of what happened following the Southport killings.",
                "The bastard is lucky the crowd didn’t tear them limb from limb. Definitely deliberate. ",
                "Looks like the cops were protecting the perpetrator from the crowd after he plowed into them. Seems like they would of dragged his ass out and put the boots to him.",
                "Guys im not questioning the guy being white and british but looking at the numerous videos available he is not 53 years old",
                "Cars are the new favorite weapons for high casualty events, but we let them into crowded spaces daily."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "WWII bomber crash left 11 dead and ‘non-recoverable.’ 4 are finally coming home",
            "external_url": "https://apnews.com/article/american-bomber-wwii-remains-divers-212ba07efdab40941f09026c79fdb5c0",
            "upvotes": 1597,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Sheppick, 26, and Tennyson, 24, each left behind pregnant wives who would sometimes write them two or three letters a day. Darrigan, 26, also was married, and had been able to attend his son’s baptism while on leave. A photo shows him in uniform, smiling as he holds the boy.\n\n>Darrigan’s wife, Florence, remarried but quietly held on to photos of her late husband, as well as a telegram informing her of his death.\n\n>Tennyson’s wife, Jean, lived until age 96 and never remarried.\n\n>“She never stopped believing that he was going to come home,” said her grandson, Scott Jefferson.\n\nSo rough on the families too. Glad they were able to help bring closure for some of them.",
                "From the title I thought another restored aircraft went down.",
                "Their bomber was called *'Heaven Can Wait'*. Thank you gentlemen. Youe wait is over.",
                "If anyone has American ancestors who were MIA in WW1, WW2, Korea, Vietnam, the Gulf Wars, or anytime during the Cold War that are unidentified, you can reach out to the [Defense POW/MIA Accounting Agency](http://dpaa.mil/Resources/FAQs/) (Look at WHO IS ELIGIBLE TO DONATE MITOCHONDRIAL DNA?)",
                "Welcome home gentlemen. Rest in peace - your service shall not be forgotten.",
                "cant imagine theres many remains left to find after being at the bottom of the ocean for 80 years.  surely their bones would have been scattered by scavengers? i doubt the wreck was perfectly sealed",
                "Welcome home gentleman.    R.I.P.",
                "All of you did what was necessary and paid the ultimate price and sacrifice.  Thank you very much for your service and welcome home.  \n\nHope you and the loved one left behind are together again upstair.\n\nGod bless you all."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Duck Dynasty founding father Phil Robertson dies at 79",
            "external_url": "https://www.nbcnews.com/news/obituaries/duck-dynasty-founding-father-phil-robertson-dies-79-rcna209035",
            "upvotes": 9366,
            "date": "05/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250526-Phil-Robertson-DD-RS-408024.jpg",
            "top_comments": [
                "[deleted]",
                "What's crazy is he went to college and played QB and a very high level",
                "Goldnecks: rich people who like pretending they're just some country boys",
                "Claims to be Pro-Life, dies.",
                "“Two guys break into an atheist’s home, he has a little atheist wife and two little atheist daughters. Two guys break into his home, and tie him up in a chair and gag him. And then they take his two daughters in front of him and rape both of ‘em and then shoot ‘em. And they take his wife and decapitate her head off in front of him. And then they can look at him and say “Isn’t it great that I didn’t have to worry about being judged? Isn’t it great that there’s nothing wrong with this? There’s no right or wrong. Now is it, dude?” And then you take a sharp knife and take his manhood and hold it in front of him and say “Wouldn’t it be something if there was something wrong with this? But you’re the one who says there’s no god, there’s no right, there’s no wrong, so we’re just having fun! We’re sick in the head. Have a nice day.”\n\n-Phil Robertson\n\nYeah this is the thought process of a piece of garbage. Nothing was lost on this day. Good riddance, prick.",
                "Is that the super racist one?",
                "The Hillbilly Kardashians",
                "Hmmmm… a grifting father of a family of grifters no longer alive to grift. \n\nSo, what’s everyone doing for Memorial Day?",
                "He’s visiting Rush Limbaugh.",
                "As a 13th generation Cajun, I hated this family."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Japan flight made emergency landing after man tried opening door",
            "external_url": "https://www.bbc.com/news/articles/cgmjzlj0g30o",
            "upvotes": 1854,
            "date": "05/26/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4d40/live/c8831680-3a0f-11f0-a4ca-c350ccf42b30.jpg",
            "top_comments": [
                "When my sister flew with Air New Zealand as a stewardess, she relates how a gentleman came up to her in the galley, and asked if he could get off. He said he’d had enough of flying and just wanted off. He was subsequently gently sedated.",
                "Just in case anyone is wondering, it's basically impossible to open the doors of a commercial airliner at altitude. They open inward first before swinging out, and the interior of the aircraft is pressurized when flying, forcing the door into its frame. That pressure applies too much interior force to the door for a human to overcome and prevents it from opening.",
                "I keep seeing headlines about people doing this. Whats actually happening with these people? What “medical crisis” makes someone think they can just open a door and get off an airplane in mid-air? Are they on weird sleep/anxiety medications and having some sort of reaction or episode? Are they crazy and having a delusion?",
                "A Japanese plane headed from Tokyo to Texas had to make an emergency landing after a passenger tried to open one of its doors during the flight.\n\nAll Nippon Airways (ANA) Flight 114 was diverted to Seattle hours after taking off on Saturday \"due to an unruly passenger\", the airline said.\n\nPort of Seattle police told media they had been notified of a man who \"attempted to open exit doors during the flight\".",
                "It’s coming to the point where I am constantly seeing people not knowing how to behave or being dangerous on flights that I wouldn’t be surprised if you had to have a background check and interview to be allowed on planes in the future",
                "A lot of very not-normal people going to Japan for trips recently. It makes me not want to go just to not contribute to their disrespectful tourist epidemic, even if I'd never be of that group.",
                "You're not in the movie Air Force One, brother.",
                "What's the big deal? Dude just needed to step out for some fresh air.",
                "Odd, when you realise it's the altitude holding the door closed.",
                "Intrusive thoughts win again!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Ex-police chief escapes from Arkansas prison where he was serving murder, rape sentences",
            "external_url": "https://www.cbsnews.com/news/grant-hardin-arkansas-prison-escape/",
            "upvotes": 7667,
            "date": "05/26/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/26/c4e4b220-3f6d-437e-87ce-45f405a660b9/thumbnail/1200x630/0dae33da6db213d4a59f739177cb86f5/screenshot-2025-05-25-at-9-50-46-pm.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                ">[KFSM reported in 2019](https://www.5newsonline.com/article/news/local/outreach/back-to-school/former-police-chief-convicted-murderer-pleads-guilty-to-raping-rogers-teacher-in-1997/527-accc272d-e94b-4c00-b9cb-6a4ee5e42125) that police in 2003 used DNA samples from the rape victim's clothes to apply for a \"John Doe\" warrant since the statute of limitations was close to expiring. Investigators eventually got a match after Hardin was imprisoned for Appleton's killing.\n\nMurders someone, then his DNA sample during processing matches a rape case.\n\nWinning through and through.",
                "Hardin pleaded guilty in October 2017 to first-degree murder in connection with the shooting death of 59-year-old James Appleton. According to an affidavit filed in the case, Appleton worked for the Gateway water department and was talking to his brother-in-law, then-Gateway Mayor Andrew Tillman, when he was shot in the head on Feb. 23, 2017, near Garfield. Police found Appleton's body inside a car.",
                "“Ex-police chief, who escaped from prison for rape and murder sentences, is found as the new police chief a town in a neighboring state”",
                "Totally “accidentally”",
                "What's with all the prison breaks that have been happening lately? Have there actually been more of them, or is the news just reporting on them because they're trending? Or is the *Prison Break* reboot going hard with its marketing?",
                "Wouldn't he have been out of genpop for being a former cop anyway? How he escaped has to either be a serious fuck up or extremely daring.",
                "I bet he had inside help.",
                "he likely just knew the layout and knew exactly what was needed to go with no fuss. \n\ni worked in a psych ward for a few years and realize im not exempt to being subjected to a place like this if i decided on a whim that i was done. if i had landed in the facility i worked i'd probably beg them not to take me to this particular place, mostly out of embarrassment, specifically telling them that i know the entire layout and how to get out if i needed to. this highlights the flaw in the system. if i told them this en route, they wouldnt care. its not their problem. the intake department might have some concerns, but the facility manager would likely pass it off as some random manic episode. they certainly wouldnt check records, because the paycheck of holding someone is the single most important factor for them.\n\ni left that job btw, because someone on another unit successfully committed suicide on their watch. this is literally the most important part of our job, but they wanted to cut corners, and go against doctors orders to save a few dollars. the only positive takeaway i have from the entire situation that it wasnt my unit. i only heard things. never interacted with the individual myself...",
                "Gonna end up dead soon.",
                "Pretty sure there’s Datelines, and a few YouTube docs about this guys case"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "At least 11 hospitalized after shooting in South Carolina: Police",
            "external_url": "https://abcnews.go.com/US/11-hospitalized-after-shooting-river-south-carolina-police/story?id=122186737",
            "upvotes": 2164,
            "date": "05/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/4e481934-8b15-42bf-a8bf-b2032c7df4b2/sc_1748230661591_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Seems it was a drunken dispute that escalated in a crowded area, not a targeted attack but still early.",
                "Good ol’ Bike Week! This is why I’ve never been in my life. Someone gets killed EVERY year. Someone just got killed on Thursday night out there. Thought they’d make it through the rest of the weekend but damn. Not surprised.",
                "No information other than the shooting taking place on a street in a town 30 minutes away from Myrtle Beach.\n\n11 people injured is kind of a fucking lot though",
                "This is clearly fake, South Carolina is a staunchly conservative state, and I was told just this week that it's only Liberal areas with such crime.\n\n*Nice try, liberal media.*\n\nYes, I'm being facetious.",
                "Summer fun is starting.",
                "They don’t call it murder beach for nothing",
                "In Little River there have always been a lot of guns and a lot of alcohol its never a good combination.",
                "Hope the injuries are not serious.",
                "I'd bet money that this was gang related and/or in a bad area with alchohol involved.",
                "Jesus Christ stop fuckin shooting people you ASSHOLES"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Comic book legend Peter David dies after series of health issues at age 68",
            "external_url": "https://www.the-independent.com/arts-entertainment/books/news/peter-david-death-cause-hulk-b2757683.html",
            "upvotes": 3257,
            "date": "05/25/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/25/21/48/Peter-David.jpeg?trim=105,0,272,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "> Family friend restarted GoFundMe to help raise money for medical expenses after he was rejected from Medicaid",
                "He's one of the greats of Marvel. He redefined the Hulk, and his run on X-Factor was terrific.  He had a knack for deep diving into Marvel characters that were two-dimensional and redefining them as people. By the time his run was complete, we knew who The Multiple Man was, for example.\n\nVale, Peter David, writer of Stuff.",
                "Why would someone be denied Medicaid? That's ridiculous.",
                "He wrote some of the best Star Trek novels.\n\nVendetta, Imzadi and Q-Squared were mainstays when I was a kid. \n\nRest easy PAD, Writer of Stuff.",
                "If you read comics in the '90s and didn't cry, laugh, and rethink reality a little, you werent reading Peter David.\n\nHe wrote Spider-Man 2099, but honestly, he was always about 30 years ahead of everyone else anyway.",
                "He has a far-reaching legacy.  This is being discussed on r/babylon5 also.",
                "He wrote some of the best Star Trek novels - I always enjoyed his Deep Space Nine ones and his original creation New Frontier. He was incredibly witty and would insert all sorts of jokes into them. \n\nHe wrote for many genres and it was easy to see he was a full-blown geek who was very passionate about his fandoms - he just did what so many of us wish we could do and made a living doing it. \n\nRIP to a legend of sci-fi and fantasy literature.",
                "This is such a weird little thing but it’s stuck with me forever, there is a Star Trek novel he wrote that I read when I was a kid and for no apparent thematic reason he made all the aliens or one planet have names that come from the Seder plate, like used in Passover. Like their names are Maror, Charoset, Karpas and Matza if I remember correctly. Such a weird choice it’s stuck in my head forever",
                "He was one of the first online comic authors.  Back in 1990-1991, he and a few others were part of FidoNet, answering questions and regaling other users with stories.  And that doesn't even start to include all the great comics and novels he produced.  We've lost a great one.",
                "The greatest health system in the whole world!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Former US Rep. Charles Rangel, who spent nearly 50 years representing New York, has died",
            "external_url": "https://apnews.com/article/charles-rangel-dies-9902b608e33aeb7db30478be00a77acc",
            "upvotes": 3659,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Rep Rangel fought with the 2d Division in the Battle of Chongchon, some of the most intense fighting during the Korean War. This was the battle in late November 1959 when the Chinese surprised the US military by entering into the war on North Korea’s side. Here is his interview on his experience: https://koreanwarlegacy.org/interviews/charles-rangel/\nRIP Rep Rangel.",
                "Rangel did a lot of work for the Harlem community, esp culturally in terms of the research library there, the arts, and Harlem history.",
                "Democrats are falling like flies lately. Quite unfortunate, RIP.",
                "No one reads the articles.",
                "It's quite amazing that Harlem has only had three people represent them in Congress in 80 years. Rangel defeated Adam Clayton Powell, Jr. in 1970 who was a legend in the community but by the time the mid-60s came around, he had all but checked out of the job and was under investigation for misusing public money. And he was spending more time in his second home in Bimini than Washington or New York. And Rangel became a legend in his own right but probably stayed too long as well before finally retiring in 2017.",
                "For anyone who only knows about politics through The Daily Show and other comedy programming, you may recognize Rep. Charlie Rangel from [this photo.](https://vip.nypost.com/wp-content/uploads/sites/2/2014/06/rangel5.jpg)",
                "He helped Nixon lead the war on drugs. \n\nhttps://www.northcountrypublicradio.org/news/story/22550/20130819/charles-rangel-america-s-front-line-general-in-the-drug-war",
                "https://youtu.be/a_GRMQ9H6IU?si=XyLCIaRvxWn-40-7",
                "[deleted]",
                "“Don’t leave me swinging in the wind, until November” I still remember that smoyoho video chorus. RIP, Rangel."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Sentencing hearing scheduled for Myrtle Beach Safari owner highlighted in ‘Tiger King’",
            "external_url": "https://www.wmbfnews.com/2025/05/26/sentencing-hearing-scheduled-myrtle-beach-safari-owner-highlighted-tiger-king/",
            "upvotes": 3006,
            "date": "05/26/2025",
            "thumbnail": "https://gray-wmbf-prod.gtv-cdn.com/resizer/v2/VQSOJZS435AF3NCVAUBXYVLD74.jpg?auth=956150d40cdfb7bd084074507ad21f87db4903f5f733efd55225dd3987999637&width=1200&height=600&smart=true",
            "top_comments": [
                "Just as big of a piece of shit as Joe, but with more intelligence.",
                "What stuck with me about this guy after watching Tiger King were the women he \"employed\". They had to be virginal or really close to it, young and willing to work seven days a week for the roof over their head. He's a disgusting piece of garbage and I hope he gets max sentencing.",
                "He's got ~~Betty Davis~~ Methamphetamine Eyes.",
                "*The investigation also uncovered evidence of money laundering between Feb. and April 2022, when Antle and his co-conspirator conducted financial transactions with cash they believed was obtained from transporting and harboring undocumented immigrants.*\n\nWhat da hell",
                "Who the fuck operates a “safari” in Myrtle fucking beach?!",
                "Is Carol Baskins the only main character that isn’t in jail?",
                "That guy was such an insufferable douche. That guy is gonna need both hands to pull his head out of his ass.",
                "Didn't he do tourist photos with heavily drugged tigers at his Myrtle Beach Safari?",
                "I watched that train wreck...I'll never get that time back.",
                "In the paraphrased words of L. Ron Hubbard, the real grift is in religion. You make up some mumbo jumbo and get some marks to believe it. Hubbard did set the standard though, if your money laundering sci-fi sex cult doesn't have a boat, are you even trying?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Mary Lou Retton arrested for DUI",
            "external_url": "https://www.wdtv.com/2025/05/26/mary-lou-retton-arrested-dui-marion-county/",
            "upvotes": 5946,
            "date": "05/26/2025",
            "thumbnail": "https://gray-wdtv-prod.gtv-cdn.com/resizer/v2/LRXBURX27RGONAM34KNDBKXDQQ.jpg?auth=06dde6adb7b85990a69e4984ffdab2c6bbf8a9788c86af1cae05d7b26a2c2483&width=1200&height=600&smart=true",
            "top_comments": [
                "She blew a 6.0, but the Russian judge cut it down to 5.4.",
                "Thought she was dying in the hospital recently? Either way sucks don’t drink and drive.",
                "Fuck her. She campaigned AGAINST a bill calling for reform in gymnastics after the whole Nasser sexual assault scandal. Vile.",
                "She was leaving the Uneven Bar",
                "For anyone who doesn’t know who she is: [Mary Lou Retton](https://en.m.wikipedia.org/wiki/Mary_Lou_Retton)\n\nJudging from the current comments, her current reputation is sub-par to say the least.",
                "I guess her crowded funded half million from a few years ago won't cover an Uber.",
                "For those keeping track at home, we've got:  \n\\- Abuse apologizer / Larry Nassar supporter  \n\\- Anti-SafeSport Act  \n\\- Anti-universal healthcare (and subsequent leech of others' generosity to expense her medical bills due to being anti-Obamacare, all the while living in a mansion and having received $2 million in her divorce settlement only a few years prior)  \n\\- Face of reverse mortgage ads  \nAnd now,  \n\\- Selfish and dangerous driver with a DUI on her record\n\nQuite the fall from grace imho, really failed to stick the landing on her post-Olympic life.",
                "She cried about not having insurance when she was near death a few years back, but doesn’t vote for the party that would’ve helped her.\n\nAnd the  Nassar  stuff. F her",
                "She’s apparently not having a good post Olympics life.",
                "That's a rough 57. Too bad. She was America's sweetheart. On the box of Wheaties and everything."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Police responding to incident at Liverpool FC parade after reports of car collision with pedestrians | UK News",
            "external_url": "https://news.sky.com/story/police-responding-to-incident-at-liverpool-fc-parade-after-reports-of-car-collision-with-pedestrians-13374978",
            "upvotes": 1363,
            "date": "05/26/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-liverpool-car-crash_6928124.jpg?20250526194011",
            "top_comments": [
                "[removed]",
                "In case anybody was unsure: \"closed the damned streets with car-proof barriers\"\n\nMy God how does this keep happening.",
                "53 year old white male\nhttps://news.sky.com/story/police-responding-to-incident-at-liverpool-fc-parade-after-reports-of-car-collision-with-pedestrians-13374978",
                "That's got to be a police fail. Yes, the guy lost it, but how he was allowed to get his car into that area is inexcusable. \n\nIt is then a series of panicked decisions (just get out of the car and give it up, it'll be fine) followed by utter psychosis, literally deliberately driving into people. \n\nIt is GBH and possibly attempted murder BTW, fucking idiot.",
                "First one I’ve experienced where I had family at the event. They’re fine, thank god. No where near it. \n\nFirst one, but at this rate, probably not the last. We all responded so immediately and calmly with calls to make sure everyone was fine? Like it was drilled? Fuck.",
                "Think we should be careful about speculation. Especially in the wake of what happened following the Southport killings.",
                "The bastard is lucky the crowd didn’t tear them limb from limb. Definitely deliberate. ",
                "Looks like the cops were protecting the perpetrator from the crowd after he plowed into them. Seems like they would of dragged his ass out and put the boots to him.",
                "Guys im not questioning the guy being white and british but looking at the numerous videos available he is not 53 years old",
                "Cars are the new favorite weapons for high casualty events, but we let them into crowded spaces daily."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Duck Dynasty founding father Phil Robertson dies at 79",
            "external_url": "https://www.nbcnews.com/news/obituaries/duck-dynasty-founding-father-phil-robertson-dies-79-rcna209035",
            "upvotes": 9367,
            "date": "05/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250526-Phil-Robertson-DD-RS-408024.jpg",
            "top_comments": [
                "[deleted]",
                "What's crazy is he went to college and played QB and a very high level",
                "Goldnecks: rich people who like pretending they're just some country boys",
                "Claims to be Pro-Life, dies.",
                "“Two guys break into an atheist’s home, he has a little atheist wife and two little atheist daughters. Two guys break into his home, and tie him up in a chair and gag him. And then they take his two daughters in front of him and rape both of ‘em and then shoot ‘em. And they take his wife and decapitate her head off in front of him. And then they can look at him and say “Isn’t it great that I didn’t have to worry about being judged? Isn’t it great that there’s nothing wrong with this? There’s no right or wrong. Now is it, dude?” And then you take a sharp knife and take his manhood and hold it in front of him and say “Wouldn’t it be something if there was something wrong with this? But you’re the one who says there’s no god, there’s no right, there’s no wrong, so we’re just having fun! We’re sick in the head. Have a nice day.”\n\n-Phil Robertson\n\nYeah this is the thought process of a piece of garbage. Nothing was lost on this day. Good riddance, prick.",
                "Is that the super racist one?",
                "The Hillbilly Kardashians",
                "Hmmmm… a grifting father of a family of grifters no longer alive to grift. \n\nSo, what’s everyone doing for Memorial Day?",
                "He’s visiting Rush Limbaugh.",
                "As a 13th generation Cajun, I hated this family."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "WWII bomber crash left 11 dead and ‘non-recoverable.’ 4 are finally coming home",
            "external_url": "https://apnews.com/article/american-bomber-wwii-remains-divers-212ba07efdab40941f09026c79fdb5c0",
            "upvotes": 1591,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Sheppick, 26, and Tennyson, 24, each left behind pregnant wives who would sometimes write them two or three letters a day. Darrigan, 26, also was married, and had been able to attend his son’s baptism while on leave. A photo shows him in uniform, smiling as he holds the boy.\n\n>Darrigan’s wife, Florence, remarried but quietly held on to photos of her late husband, as well as a telegram informing her of his death.\n\n>Tennyson’s wife, Jean, lived until age 96 and never remarried.\n\n>“She never stopped believing that he was going to come home,” said her grandson, Scott Jefferson.\n\nSo rough on the families too. Glad they were able to help bring closure for some of them.",
                "From the title I thought another restored aircraft went down.",
                "Their bomber was called *'Heaven Can Wait'*. Thank you gentlemen. Youe wait is over.",
                "If anyone has American ancestors who were MIA in WW1, WW2, Korea, Vietnam, the Gulf Wars, or anytime during the Cold War that are unidentified, you can reach out to the [Defense POW/MIA Accounting Agency](http://dpaa.mil/Resources/FAQs/) (Look at WHO IS ELIGIBLE TO DONATE MITOCHONDRIAL DNA?)",
                "Welcome home gentlemen. Rest in peace - your service shall not be forgotten.",
                "cant imagine theres many remains left to find after being at the bottom of the ocean for 80 years.  surely their bones would have been scattered by scavengers? i doubt the wreck was perfectly sealed",
                "Welcome home gentleman.    R.I.P.",
                "All of you did what was necessary and paid the ultimate price and sacrifice.  Thank you very much for your service and welcome home.  \n\nHope you and the loved one left behind are together again upstair.\n\nGod bless you all."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Ex-police chief escapes from Arkansas prison where he was serving murder, rape sentences",
            "external_url": "https://www.cbsnews.com/news/grant-hardin-arkansas-prison-escape/",
            "upvotes": 7663,
            "date": "05/26/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/26/c4e4b220-3f6d-437e-87ce-45f405a660b9/thumbnail/1200x630/0dae33da6db213d4a59f739177cb86f5/screenshot-2025-05-25-at-9-50-46-pm.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                ">[KFSM reported in 2019](https://www.5newsonline.com/article/news/local/outreach/back-to-school/former-police-chief-convicted-murderer-pleads-guilty-to-raping-rogers-teacher-in-1997/527-accc272d-e94b-4c00-b9cb-6a4ee5e42125) that police in 2003 used DNA samples from the rape victim's clothes to apply for a \"John Doe\" warrant since the statute of limitations was close to expiring. Investigators eventually got a match after Hardin was imprisoned for Appleton's killing.\n\nMurders someone, then his DNA sample during processing matches a rape case.\n\nWinning through and through.",
                "Hardin pleaded guilty in October 2017 to first-degree murder in connection with the shooting death of 59-year-old James Appleton. According to an affidavit filed in the case, Appleton worked for the Gateway water department and was talking to his brother-in-law, then-Gateway Mayor Andrew Tillman, when he was shot in the head on Feb. 23, 2017, near Garfield. Police found Appleton's body inside a car.",
                "“Ex-police chief, who escaped from prison for rape and murder sentences, is found as the new police chief a town in a neighboring state”",
                "Totally “accidentally”",
                "What's with all the prison breaks that have been happening lately? Have there actually been more of them, or is the news just reporting on them because they're trending? Or is the *Prison Break* reboot going hard with its marketing?",
                "Wouldn't he have been out of genpop for being a former cop anyway? How he escaped has to either be a serious fuck up or extremely daring.",
                "I bet he had inside help.",
                "he likely just knew the layout and knew exactly what was needed to go with no fuss. \n\ni worked in a psych ward for a few years and realize im not exempt to being subjected to a place like this if i decided on a whim that i was done. if i had landed in the facility i worked i'd probably beg them not to take me to this particular place, mostly out of embarrassment, specifically telling them that i know the entire layout and how to get out if i needed to. this highlights the flaw in the system. if i told them this en route, they wouldnt care. its not their problem. the intake department might have some concerns, but the facility manager would likely pass it off as some random manic episode. they certainly wouldnt check records, because the paycheck of holding someone is the single most important factor for them.\n\ni left that job btw, because someone on another unit successfully committed suicide on their watch. this is literally the most important part of our job, but they wanted to cut corners, and go against doctors orders to save a few dollars. the only positive takeaway i have from the entire situation that it wasnt my unit. i only heard things. never interacted with the individual myself...",
                "Gonna end up dead soon.",
                "Pretty sure there’s Datelines, and a few YouTube docs about this guys case"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Japan flight made emergency landing after man tried opening door",
            "external_url": "https://www.bbc.com/news/articles/cgmjzlj0g30o",
            "upvotes": 1855,
            "date": "05/26/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4d40/live/c8831680-3a0f-11f0-a4ca-c350ccf42b30.jpg",
            "top_comments": [
                "When my sister flew with Air New Zealand as a stewardess, she relates how a gentleman came up to her in the galley, and asked if he could get off. He said he’d had enough of flying and just wanted off. He was subsequently gently sedated.",
                "Just in case anyone is wondering, it's basically impossible to open the doors of a commercial airliner at altitude. They open inward first before swinging out, and the interior of the aircraft is pressurized when flying, forcing the door into its frame. That pressure applies too much interior force to the door for a human to overcome and prevents it from opening.",
                "I keep seeing headlines about people doing this. Whats actually happening with these people? What “medical crisis” makes someone think they can just open a door and get off an airplane in mid-air? Are they on weird sleep/anxiety medications and having some sort of reaction or episode? Are they crazy and having a delusion?",
                "A Japanese plane headed from Tokyo to Texas had to make an emergency landing after a passenger tried to open one of its doors during the flight.\n\nAll Nippon Airways (ANA) Flight 114 was diverted to Seattle hours after taking off on Saturday \"due to an unruly passenger\", the airline said.\n\nPort of Seattle police told media they had been notified of a man who \"attempted to open exit doors during the flight\".",
                "It’s coming to the point where I am constantly seeing people not knowing how to behave or being dangerous on flights that I wouldn’t be surprised if you had to have a background check and interview to be allowed on planes in the future",
                "A lot of very not-normal people going to Japan for trips recently. It makes me not want to go just to not contribute to their disrespectful tourist epidemic, even if I'd never be of that group.",
                "You're not in the movie Air Force One, brother.",
                "What's the big deal? Dude just needed to step out for some fresh air.",
                "Odd, when you realise it's the altitude holding the door closed.",
                "Intrusive thoughts win again!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump delays 50% tariffs on EU to July 9",
            "external_url": "https://www.cnbc.com/2025/05/25/trump-50percent-tariffs-eu-july-9.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
            "upvotes": 16651,
            "date": "05/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108150321-1748213510226-AP20021497359027.jpg?v=1748213621&w=1920&h=1080",
            "top_comments": [
                "No way. What, wow. Did not see that coming.",
                "Another day, another method to manipulate the markets.",
                "Come Tuesday, it will be 100% tariffs on the EU, then by Friday they will be delayed again.  Guaranteed the Trump family will make millions this week",
                "We've seen this movie already. First time was shitty by the way",
                "Friendly reminder that Congress could stop this at any time. They, specifically Republicans, are actively choosing not to, likely because they are also benefiting from this blatant market manipulation.",
                "Today. Tomorrow it will take effect immediately. On Thursday he will double it if a single European citizen complains about US tariffs. Friday he will have forgotten about all of the tariffs and will wonder why European citizens are cold to his administration until his aides remind him, which he will at first deny, and then go on an hours long xenophobic rant, claiming Latvian as the next new state, and quadruple the already doubled tariffs. Repeat.",
                "Is it really a delay if you were never going to do it in the first place? If so, then I'm announcing my decision to delay my upcoming date with Margot Robbie.",
                "Trump’s foreign policy strategy: threaten fire, then call it a favor when you delay the match.",
                "lol they saw stock market futures and said yah, no.... this is the fat nixon market manipulation cycle of walking back tariffs so they never get imposed when his bluff is called. now the markets will be happy on Tuesday. i guess our judicial system is ignoring this blatant illegal activity like god sleeping through the holocaust",
                "Amazing leadership. Truly maga in every way"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "National parks ordered to police negative history under Trump directive",
            "external_url": "https://www.sfgate.com/california-parks/article/national-parks-negative-history-trump-20343308.php",
            "upvotes": 25299,
            "date": "05/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It's so interesting how statues are history that can't be challenged, but actual history needs to be hidden.",
                "So, we're in the, \"Report your neighbor for wrong think,\" phase.",
                "\"The battle of Gettysburg was a decisive win for the confederacy.   Afterwards both sides celebrated with dancing and singing to the historic tune \"YMCA\" by the legendary people of the village. \"",
                "History is *supposed* to make you uncomfortable.",
                "[removed]",
                "Negative history... like his administration?",
                "“The signs will state that the property belongs to the American people and ask visitors to report any areas in need of repair, services requiring improvement, or signage and information that present past or living Americans in a negative light or “fail to emphasize the beauty, grandeur, and abundance of the natural landscape,””\n\nSo this is about finding signs that don’t glaze America enough? To what standard? Are we going to ask Elon’s AI to grade each sign and rank it by how good the glaze is?",
                "So let me guess, countrywide its going to start being taught as \"The War of Northern Aggression\" and how the Union cruelly stole Blacks \"happiness in slavery.\" Or perhaps something about how Americans never harmed Native Americans and always honored their treaties. You know, just straight up ignore history so Cletus doesn't have to feel uncomfortable. ",
                "“Those who cannot remember the past are condemned to repeat it.” – George Santayana, The Life of Reason, 1905",
                "Executive order for revisionist history thats certainly something "
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/27/2025 04:15:12 UTC"
}