{
    "posts": [
        {
            "category": "HOT",
            "title": "US Defense Secretary Hegseth to slash senior-most ranks of military",
            "external_url": "https://www.reuters.com/world/us/pentagon-reduce-4-star-positions-by-20-official-says-2025-05-05/",
            "upvotes": 35066,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This includes removing the Chairman of the Joint Chiefs of Staff, the Navy's top admiral and other senior flag officers from their positions.",
                "Imagine achieving the highest rank in the military over a lifetime of excellence & devotion ... only to be fired by this chode.",
                "Genuinely troubling. These are the few people most likely to stand up against an unconstitutional order.",
                "You gotta remove the guys who won’t do fascism for you, y’know?",
                "The cleanup after this administration will be monumental and take decades. America is in the process of learning an intensely painful lesson.",
                "For all the noise conservatives make when democratic presidents are in charge, screeching about tyranny... I've never been more afraid of the government than I have been the last four months. And it is getting worse every day.  Something has got to give. The mid terms need to be fucking tidal wave\n\nEdit: yeah, yeah, I get it, \"there won't be midterms\"... Well what the fuck are you doing, then?  You got a militia I can join? Otherwise, propose a fucking solution. Because I'll be phone banking, donating, knocking on doors and doing the best my household can to democratically pull this shit back.",
                "*\"More generals and admirals does not lead to more success,\" Hegseth said in a video posted on X.*\n\nThis is coming from a Fox News weekend TV host - someone with absolutely zero experience to say something like that. \n…\n\n*\"This is not a slash and burn exercise meant to punish high ranking officers, nothing could be further from the truth,\" he said.*\n\nSooooo, it’s a slash and burn exercise meant to punish high ranking officers.",
                "Yeah, so when they stage the coup for the third term there is no one at the top to defy them.",
                "I can’t imagine being a general and having this hot dog fire you. After leaking literal war plans in multiple group chats.",
                "Getting rid of any military leaders who swore allegiance to the US Constitution, and not Trump before they are deployed to oppress Americans."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "84% of the world's coral reefs hit by worst bleaching event on record",
            "external_url": "https://apnews.com/article/coral-reef-bleaching-climate-change-fdbeddf7ae3ccc9d7cf85d1c3267e581",
            "upvotes": 2949,
            "date": "05/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Anti-intellectualism and corporate oligarchy have to die out or we are done for.",
                "I’m so fucking scared of the future",
                "I read it but I have a question. Is it 84% of all of them are completely bleached, or are 84% affected by some bleaching?",
                "It’s why they fight to hide it or call it lies, they know what’s happening and know what would happen if they didn’t keep 50% of the population on their side for their crimes. They expect to let everyone die off as they’ve prepped as best they can and continue to prep to survive with the massive wealth transfer",
                "As a scuba diver I’ve seen this first hand. I visited Coron, Philippines in 2014 and 2024, entire reefs had been bleached and killed in just 10 years.\n\nBetween the sheer amount of plastic we dump into the oceans and rising temperatures, we are doing our damnedest to kill off marine and coral life as fast as possible.",
                "But hey, it's YOUR fault average person!, YOU have to adjust and reduce. Not us!, you! - Corporations",
                "I grew up within an easy boat ride of the Great Barrier Reef. It was a distinct presence during my childhood and something that I’ve always thought as permanent as the mountains. I can’t take in and process that it’s dying so quickly, it’s like the moon disappearing from the sky.",
                "Grim. And I doubt we’re going to change anything.",
                "Fuck SAKE. Every fucking day these cunts are fucking killing us. Can we please fucking do something whatever we are doing is not enough. ",
                "I feel like I should apologize to my kids for creating them and encourage them not to procreate. Is that an extreme position? \n\nIs there a chance that the coral and algae can adapt to these new temperatures? And then when the earth starts to rapidly cool, will they be able to adapt again? It doesn't seem like a possibility to me. And I wouldn't want to be around when the oceans fail. All these dead whales washing up lately makes me think it's happening sooner than I'd hoped."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Russia says all airports in Moscow shut after drone attack",
            "external_url": "https://www.bbc.com/news/articles/c20xqdn04g3o",
            "upvotes": 5309,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0ef2/live/45708ce0-2a11-11f0-b699-f17b68e54842.jpg",
            "top_comments": [
                "Not a good sign for the military parade",
                "Anyone that would fly these dodgy Russian airlines after all the sanctions needs to have their head checked\n ",
                "Job well done. Professionals bring results without bluster; amateurs declare a special military operation.",
                "They got what they wanted. Shouldn't have invaded another country. C***s.",
                "Better to keep those jets ground as many of them are western made running parts that is long overdue to be replaced but can't due to sanction.\n\nPassengers will be inconvenienced but better they are on ground rather than flying.",
                "Shutting down all the airports in Moscow??  Good lord that sounds costly. \n\nDo it again.  Seriously.  Keep them shuting down, that's as easy way to bankrupt a few airlines.",
                "Hell, our Jetports don't even need drone attacks to be shut down.\n\nWe are EXCEPTIONAL!!!",
                "Are people in Moscow starting to see their lives impacted? I would assume if the people in that city start getting very upset things might start happening?",
                "“Oh no!”\n\nAnyway, my nuts itch. ",
                "I hope Ukraine strikes the parade!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration bars Harvard from new federal research funding",
            "external_url": "https://www.politico.com/news/2025/05/05/trump-bars-harvard-new-federal-research-funding-00330059",
            "upvotes": 6384,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Yet another thing Harvard can sue him for and win.\n\n\nTrump is so bad at this villainous consolidation thing.",
                "Trump just showing the way Liberty University can be denied federal funding through their students.",
                "12 Nobel Prize-winning scientists have active research programs at the Harvard Biological Labs.  Trump is attempting to cut off funding to some of the most important and impactful research on the planet, research that has and will save lives and make people's lives better, all because he's in a snit. \n\nAnd I say this as someone who did my PhD at a rival institution,  and devoutly believes that Harvard can gargle my testicles.  It's hard to argue with their results.",
                "Just a waste of everyone's resources and time. Fuckwad and his crew have no intentions on actually doing anything that will help the average American",
                "He’s going to decimate America’s leadership in various areas of research over his bruised ego, and the Republican Congress won’t challenge him. This is a team effort.",
                "He's gonna hamstring the brightest minds in the United States from conducting research that may help us all some day? Great.",
                "Fascists doing fascist shit.",
                "I wonder what a great America looks like to Trump. He guts NASA, the greatest space research institution in the world. He guts the NIH, the greatest medical research institution in the world. He guts the CDC, the greatest public health organization in the world. And now he targets Harvard, one of the greatest universities in the world. These are the things that, to me, make America \"great.\"\n\nDoes he think a great America is just a place with the most sweat shops in the world? He really seems to prefer America makes brake pads than revolutionary medical breakthroughs.",
                "He’s really not up to speed on what Universities can achieve, is he?\n\nManchester University isolating Graphene being just one example…",
                "Man, Donnie really hates America"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Judges must clear a high bar to separate parents from children forever, Texas Supreme Court rules",
            "external_url": "https://www.keranews.org/government/2025-05-05/judges-must-clear-a-high-bar-to-separate-parents-from-children-forever-texas-supreme-court-rules",
            "upvotes": 9179,
            "date": "05/05/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/be46422/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F87%2F01%2Fcd8484fc40b180a66aef0fe0c66c%2F121824-supreme-court-of-texas-seal-kut.JPG",
            "top_comments": [
                "You all would be shocked at how infrequently they went after parents who hurt their children. I would say it was less than 2%. \n\nI used to do this job. A solid third of my cases were bullshit weed and custody cases that no one cared about. There just weren't enough resources to care about this.\n\nAnother third was abject poverty and people living in falling apart plywood trailers with no plumbing or electricity in the middle of Texas summer. Obviously you can't have a newborn baby living in 110° shed. Usually for that we would cram them in with the very unwilling family member and call it a day. There wasn't enough money to do anything else. \n\nA third of my cases were teen parents who didn't know any better and often didn't care but sometimes were trying. It's hard to be 15 and have a baby of your own when you're living on someone's couch. We usually got another unwilling family member to help supervise in these situations and called it a day. There wasn't enough money to do anything else. \n\nIn a perfect world I would have gotten them all affordable housing and healthcare and birth control and education and government IDs and bus passes and nutrition and clothes and sooooooo muchhhhhh therapyyyyyyy. \n\nA small portion of my cases were absolute monsters who needed to be locked up and so many of them escaped any sort of actual punishment. Again because of resources. \n\nVery frequently we terminated rights for shit parents but that's usually because the parents didn't even make an effort to complete the court required programs they were ordered to do. Simple stuff like parenting classes and showing up to visits and paying $10 a month in child support. Half the time they didn't even show up. I would tell them in person and in writing and tell the attorney \"hey this person has court on this date if they want to continue being a parent they need to show up.\" Nothing.\n\nParents who actually made even a half-assed effort got their kids back unless they were complete monsters like incest/rapists.",
                ">Terminating parental rights requires a higher burden of proof — trial courts must find the evidence “clear and convincing.”\n\nClear and convincing is the medium level of proof. Below 'beyond a reasonable doubt'. \n\n>Court documents allege in March 2020, Stary had grabbed her then 9-year-old son by the back of his head, beat his face on the hardwood floor and carpet, then continued to beat his bruised face as his nose began to bleed. Stary was arrested and charged with injuring a child, a third-degree felony.\n\nShe was given a lifetime protective order against all her children. She now gets a new hearing with the new standard needing to be applied.",
                "I thought this was about ICE and am now disappointed.",
                "My cousin fostered and eventually adopted a baby who's addict parents fed him meth, more than once.  The judge kept insisting the baby needed to go to his biological family.  My cousin had to hire two lawyers to finally adopt him.\n\nFuck this state.  Fuck this state so much.",
                "from the click through.. of course this wasnt the only incident with her\n\n>During protective order hearings over the course of several months, Ethridge testified about the March 2020 incident and several previous instances in which he said Stary beat the children, forced them to sleep outside on the porch and abandoned one of their daughters on the side of the road during a drive back from Colorado.\n\n>The kids called the police for help at least six times, and Child Protective Services was contacted at least five times, according to court records.\n\n>After interviews with the children, a Harris County district court judge went a step further — she issued a lifetime protective order. Stary would not be allowed to see or directly contact her kids indefinitely.\n\nthe kids calling for help 11 times.. FFS and what happened with abandoning one on the drive from colorado to texas. Sounds like she should have had kids taken away a long time ago.",
                "So the standard is still below that needed for a conviction, and only even that high for permanent protective orders?\n\nThat sounds reasonable? Am I missing something?\n\n>Stary was arrested and charged with injuring a child, a third-degree felony.\n\nIf this woman beat her kid bloody, the should be convicted for that, which would require a higher burden of proof than terminating her parental rights.",
                "I was a public health nurse and some parents should lose custody before destroying their children.",
                "Obviously doesn't apply to citizens at the border. ",
                "\"...in cases of white american parents who beat their children\"\n\nThey're NOT talking about ICE separating migrant parents from their children. \n\nBecause of course they aren't.",
                "Hot take, if you literally ever hit your kid hard enough to make them bleed, and to be clear you shouldn't hit your kid at all, but if you ever hit them hard enough to make them bleed then you should never be allowed to see them again, ever. Not ever."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump orders the reopening of Alcatraz prison",
            "external_url": "https://www.reuters.com/world/us/trump-directs-bureau-prisons-reopen-alcatraz-2025-05-04/",
            "upvotes": 17455,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I bet he just watched The Rock last weekend.",
                "Such a worthless idea, there is no reason to have a prison there and terrible from a cost efficiency standpoint, people escaping from maximum security prisons isn’t the concern it used to be",
                "We literally have incredible supermax prisons on the mainland. The rock was built during a time when modern supermax didn't really exist and the natural island/water barrier was useful. But now ... This is more of a visual move. Alcatraz is infamous and legendary, Trump wants to tie its reopening to him. It's symbolic and moronic.",
                "Step 1: insist on reopening a long abandoned prison with enormous costs associated in order to divert attention.\n\nStep 2: announce reopening will cost $45B.\n\nStep 3: announce that we will not reopen the prison citing budgetary reasons.\n\nStep 4: claim to have saved the federal government $45B & gives friends the \"savings\". MAGA spikes the football.\n\nThis is Trump math, y'all.",
                "Honest question is this even legally allowed? I assume Alcatraz was set up as National Park via legislation? This would need budget correct?",
                "This is a distraction from more important things, like him saying he doesn't know if he has to uphold the constitution or if people are guaranteed due process. Let's keep the focus there.",
                "Swear to God he watched fucking Escape from Alcatraz the other night, thought Clint was cool, and came up with this bullshit about reopening the prison and tariffs on movies.",
                "All I know about Alcatraz I learned from Tony Hawk’s Pro Skater 4",
                "isn't it a museum now? whats the plan? bulldoze the tourist attraction?",
                "Donald Trump has, on more than on occasion, compared himself to Al Capone.\n\nAlcatraz is where Al Capone first got any sort of treatment for his festering syphilis. Though it was an outdated treatment, even for its time. His condition worsened and his mental capacity greatly diminished during his incarceration there."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Germany's Merz falls short of majority in vote for chancellor",
            "external_url": "https://www.bbc.com/news/articles/cvgp22zlrgko",
            "upvotes": 333,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/1d17/live/1da7dab0-2a52-11f0-b26b-ab62c890638b.jpg",
            "top_comments": [
                "I think this shouldn't lead to anything too bad. I assume the no votes come from hardliners in the Union who disliked his debt brake agreement. According to the bundestag website they have 14 days for the second round during which they'll do backroom deals, and even if that fails the third round only requires a plurality not a majority of votes. \n\nWorst case scenario would be Merz elected by plurality but he is then immediately toppled by a no confidence vote resulting in new elections. However I doubt the Greens or even the Left would do so since polling for the AfD has only increased since early this year.\n\nAt least this is my speculation feel free to correct me.",
                "That’s definitely a blow for him, but I think he should meet with the dissidents and understand their reasons and make an agreement. That’s politics and will show if he can make bridges with the adversaries.  At least one more time he should be given the chance to form government.",
                "This was only the first vote! Behold! As there still can be two more. But this has never happened before, so I'm all excited for round two. 😄",
                "Time for back room deals.",
                "He probably shouldn’t have allied him self with the extremist right wing party AfD and he probably shouldn’t kept the last government’s budget short just to abandon all his strong hesitations about the budged once he himself headed toward office…",
                "To quite Nelson from The Simpsons :\n\n\nHaha!",
                "Die Rache von Saskia Esken und Olaf Scholz 😊",
                "A clear set up by Trump and Musk, after they declared the Afd an extremist organization."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Astronomers spot possible Planet Nine in data spanning 23 years",
            "external_url": "https://www.techspot.com/news/107802-astronomers-spot-possible-planet-nine-data-spanning-23.html",
            "upvotes": 1205,
            "date": "05/06/2025",
            "thumbnail": "https://www.techspot.com/images2/news/bigimage/2025/05/2025-05-05-image-18.jpg",
            "top_comments": [
                "Any millennials remember Planet X?",
                "I'd laugh if it's on this massive eliptical orbit and just comes around once every few million years to fuck shit up",
                "King Gizz gonna write a song about this",
                "It must be Pluto again :)",
                "If you zoom in on the planet it says MS 13. It’s the real deal. /s",
                "Nibiru has returned and the Anunnaki will liberate us.\n\n\n...lol oh man it's been awhile",
                "Tariffs incoming in 3...2...",
                "> Planet Nine\n\nGus inconsolable",
                "[what Happened To Planet X?](https://youtu.be/wy8fi77t8zU?si=5HrlKc0wIzPQYRGu)",
                "I thought we found planet nine 95 years ago???"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Portugal announces the expulsion of 18,000 foreigners ahead of a national election",
            "external_url": "https://apnews.com/article/portugal-immigration-election-c491f01613bab2f5342118d288c2903e",
            "upvotes": 2869,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "18,000 notifications to people in the country illegally to leave. The minister said officials will begin next week by asking some 4,500 foreigners to leave voluntarily within 20 days.",
                "Leaving aside the merits of expelling these people, it’s interesting that a caretaker government is doing something that could sway the outcome of the election. Im assuming the caretaker conventions in Portugal differ from other countries?",
                "18000 in the country without permission. It sounds like those on visas, right to remain, and naturalized are all staying where they are.",
                "Is this any different than what countries do everyday? Why is this news exactly?",
                "What happens if they dont leave ?",
                "What does this accomplish in relation to the voting? I'm guessing they can't currently vote so I don't see the connection.",
                "Are they in the country actually illegally or Stephen Miller’s definition of illegally?",
                "Brilliant news for them! Very jealous.\nI hope they continue with many more.",
                "mass deportation light?",
                "Portugal needs immigration to survive. People have been leaving en masse for decades and depopulation is a problem.\n\nThe immigration authority in Portugal is totally mismanaged and thousands have been waiting beyond what is legal for their immigration appointments or been turned away from their scheduled immigration appointments after waiting hours. They end up suing just to actually have an appointment. Just check over at r/Portugalexpat\n\nThis is just an attempt like Trump to find an “enemy” to blame. Let’s hope it backfires"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "AI-generated porn site Mr. Deepfakes shuts down after service provider pulls support",
            "external_url": "https://www.cbsnews.com/news/ai-generated-porn-site-mr-deepfakes-shuts-down/",
            "upvotes": 1094,
            "date": "05/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/06/c156411b-333f-4edb-b3b5-e7099edf11d0/thumbnail/1200x630/3084baa6060ceb6f9499827feb0ebbcc/gettyimages-2192524685.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                ">The shutdown comes just days after Congress passed the \"Take It Down Act,\" which makes it a federal crime to post nonconsensual sexual imagery, including explicit deepfakes. The legislation, backed by first lady Melania Trump, requires social media platforms and other websites to remove images and videos within 48 hours after a victim's request. \n\nWell, there's your answer. They're getting ahead of the law. Probably spent all the money on blackjack and hookers and didn't have any in reserve for lawyers. I wonder if the ACLU would have considered taking the case on Free Speech grounds.",
                "The law has a weird clause in it.\n\nIt shall be unlawful for any person to use a computer to publish intimate depictions (I paraphrased here). Then it says, \"If - \" followed by further conditions. Condition \"ii.\" says:\n\n>what is depicted was not voluntarily exposed by the identifiable individual in a public or commercial setting;\n\nSo, if someone uploaded an intimate photo online, then someone else could use that photo to create deepfakes and it would be legal? Because if someone uploaded even one photo voluntarily to any website, then that could be public? And then anyone could use it for deepfakes.\n\nIf so, then that makes no sense and they should've left this part out. Or am I not understanding it?\n\nThe simpler law could've said, \"You can't use someone's likeness to create intimate/porn depictions.\" I don't know why that's so hard for the government. As now, it looks like they still have a window open where people can make deepfakes of a lot of people without their permission.\n\n[https://www.congress.gov/119/bills/s146/BILLS-119s146es.pdf](https://www.congress.gov/119/bills/s146/BILLS-119s146es.pdf)",
                "*The site allowed users to upload and view deepfake porn videos created using artificial intelligence. Forums on the site allowed users to buy and sell custom nonconsensual deepfake content, as well as discuss practices for making deepfakes.  The owner of the site remains unknown.* \n\nAll nonconsensual sex online should be taken down--no way in hell that it's \"free speech.\" In fact, quite the opposite. The fact the owner of this site is \"unknown,\" says it all.",
                "How will Elon musk react",
                "It's not actually AI right? It's deepfake tech which is worse, in a way, because it has more user input.",
                "OP really missed the chance to add the word \"out\" after \"pulls\" on this one.",
                "We have had good fake static images for decades.  No one cared until it was video.\n\nMy personal take is as long as the subject is a celeb and the content is offered freely its not a big deal.  \n\nSomehow we are still allowed to ai fake randos in non sexual ways?",
                "This just in. Everyone who ever cut out a headshot and put it over a body in a porn mag is to be hunted down and arrested."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Friedrich Merz’s bid to become Germany’s chancellor fails in parliament in a stunning defeat",
            "external_url": "https://www.ctvnews.ca/world/article/friedrich-merzs-bid-to-become-germanys-chancellor-fails-in-parliament-in-a-stunning-defeat/",
            "upvotes": 7,
            "date": "05/06/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/5G7FQKFG5U6H3NKRMVWTJVVITQ.jpg?smart=true&auth=760b7b96928cc0b7b9b209001af6ac62d71bb876edde00f941368bb00917d5b5&width=1200&height=630",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Two of our dinosaurs are missing - head ranger",
            "external_url": "https://www.bbc.co.uk/news/articles/cly5dk219gwo",
            "upvotes": 7,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0c14/live/c93ab230-29b2-11f0-a252-f789f44e224b.jpg",
            "top_comments": [
                "Hey, I think I saw this episode of Brassic!\n\nSeriously though, hope those dinosaurs find their way home."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Germany's Merz falls short of majority in vote for chancellor",
            "external_url": "https://www.bbc.com/news/articles/cvgp22zlrgko",
            "upvotes": 337,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/1d17/live/1da7dab0-2a52-11f0-b26b-ab62c890638b.jpg",
            "top_comments": [
                "I think this shouldn't lead to anything too bad. I assume the no votes come from hardliners in the Union who disliked his debt brake agreement. According to the bundestag website they have 14 days for the second round during which they'll do backroom deals, and even if that fails the third round only requires a plurality not a majority of votes. \n\nWorst case scenario would be Merz elected by plurality but he is then immediately toppled by a no confidence vote resulting in new elections. However I doubt the Greens or even the Left would do so since polling for the AfD has only increased since early this year.\n\nAt least this is my speculation feel free to correct me.",
                "That’s definitely a blow for him, but I think he should meet with the dissidents and understand their reasons and make an agreement. That’s politics and will show if he can make bridges with the adversaries.  At least one more time he should be given the chance to form government.",
                "This was only the first vote! Behold! As there still can be two more. But this has never happened before, so I'm all excited for round two. 😄",
                "Time for back room deals.",
                "He probably shouldn’t have allied him self with the extremist right wing party AfD and he probably shouldn’t kept the last government’s budget short just to abandon all his strong hesitations about the budged once he himself headed toward office…",
                "To quite Nelson from The Simpsons :\n\n\nHaha!",
                "Die Rache von Saskia Esken und Olaf Scholz 😊",
                "A clear set up by Trump and Musk, after they declared the Afd an extremist organization."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Additional checkpoint at B.C.-U.S. border shocks travellers",
            "external_url": "https://globalnews.ca/news/11164618/additional-checkpoint-bc-us-border-shocks/",
            "upvotes": 388,
            "date": "05/06/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/05/WEB-6P-EXTRA-BORDER-CHECKPOINT.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "Note that this was NORTHBOUND. So, they’re trying to stop illegal immigrants and “drugs” going TO Canada?",
                "I bet this is going to make Canadians want to visit the US even more right now! It's so much fun being interrogated!",
                "I was just invited down to the US to celebrate my niece’s graduation near Seattle. I’m heartbroken not to go, but I just can’t do it, for moral and safety reasons.",
                "These folks think they are this centuries SS.   I would not travel to the United States unless it was vitally important from some reason.",
                "Whom ever wrote the article\n\n\n\n\n It's Lynden not Linden.",
                "Maybe they can find the mystery smell that’s been going on in my car thanks to my kids.",
                "There is no good reason to cross the US border for any other reason than as required for work/employment.  ",
                "Don't come here. Spend your money somewhere else. Who knows when Trump is gonna declare Canadians enemies of the state.\n\nDo not come here. For the same reasons you should avoid Iran and Afghanistan.",
                "Easy solution: don’t fucking go to the us 🤷‍♂️",
                "We’re the NK of the Western world"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "84% of the world's coral reefs hit by worst bleaching event on record",
            "external_url": "https://apnews.com/article/coral-reef-bleaching-climate-change-fdbeddf7ae3ccc9d7cf85d1c3267e581",
            "upvotes": 2958,
            "date": "05/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Anti-intellectualism and corporate oligarchy have to die out or we are done for.",
                "I’m so fucking scared of the future",
                "I read it but I have a question. Is it 84% of all of them are completely bleached, or are 84% affected by some bleaching?",
                "It’s why they fight to hide it or call it lies, they know what’s happening and know what would happen if they didn’t keep 50% of the population on their side for their crimes. They expect to let everyone die off as they’ve prepped as best they can and continue to prep to survive with the massive wealth transfer",
                "As a scuba diver I’ve seen this first hand. I visited Coron, Philippines in 2014 and 2024, entire reefs had been bleached and killed in just 10 years.\n\nBetween the sheer amount of plastic we dump into the oceans and rising temperatures, we are doing our damnedest to kill off marine and coral life as fast as possible.",
                "But hey, it's YOUR fault average person!, YOU have to adjust and reduce. Not us!, you! - Corporations",
                "I grew up within an easy boat ride of the Great Barrier Reef. It was a distinct presence during my childhood and something that I’ve always thought as permanent as the mountains. I can’t take in and process that it’s dying so quickly, it’s like the moon disappearing from the sky.",
                "Grim. And I doubt we’re going to change anything.",
                "Fuck SAKE. Every fucking day these cunts are fucking killing us. Can we please fucking do something whatever we are doing is not enough. ",
                "I feel like I should apologize to my kids for creating them and encourage them not to procreate. Is that an extreme position? \n\nIs there a chance that the coral and algae can adapt to these new temperatures? And then when the earth starts to rapidly cool, will they be able to adapt again? It doesn't seem like a possibility to me. And I wouldn't want to be around when the oceans fail. All these dead whales washing up lately makes me think it's happening sooner than I'd hoped."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "British Superbike Championship: Two riders die in British Supersport Championship race",
            "external_url": "https://www.bbc.com/sport/motorsport/articles/creqg3e74e7o",
            "upvotes": 74,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/598d/live/5f523ac0-29fb-11f0-8c66-ebf25fc2cfef.png",
            "top_comments": [
                "My ex-husband used to race a 250 Honda motorcycle on the US West Coast and during the early-mid 90's he was one of the top 250 riders there. He got in a big crash and almost lost his foot. These crashes are no joke and freak me the hell out."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Peru suspends gold mining in north after massacre",
            "external_url": "https://www.dw.com/en/peru-suspends-gold-mining-in-north-after-massacre/a-72443414",
            "upvotes": 348,
            "date": "05/06/2025",
            "thumbnail": "https://static.dw.com/image/72443254_6.jpg",
            "top_comments": [
                "The suspension only applies to \"informal miners\". The licenced mining companies are unaffected. This suspension should have very little effect on overall gold production.",
                "They should also go after gaps and issues in supply chain. Illegal miners are obviously selling to someone and it ends up in supply chain",
                "Funny how they refer to their miners as \"artisanal\" and the other miners as \"illegal\"",
                "I read things like this from the US and have to wonder what the real crime rate and frequency are in Mexico and South America. As for statistics, it’s hard for me to gauge as I’ve seen the many ways they’re convoluted and gamed to show more/less crime as it benefits people.\n\nBeing in the US, sure we have bad neighborhoods. We have bad areas in cities. But mostly you’re safe unless you’re engaging in illegal/illicit behavior. Most crimes are not committed against innocent bystanders. \n\nIs the same true for down there?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Russia says all airports in Moscow shut after drone attack",
            "external_url": "https://www.bbc.com/news/articles/c20xqdn04g3o",
            "upvotes": 5314,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0ef2/live/45708ce0-2a11-11f0-b699-f17b68e54842.jpg",
            "top_comments": [
                "Not a good sign for the military parade",
                "Anyone that would fly these dodgy Russian airlines after all the sanctions needs to have their head checked\n ",
                "Job well done. Professionals bring results without bluster; amateurs declare a special military operation.",
                "They got what they wanted. Shouldn't have invaded another country. C***s.",
                "Better to keep those jets ground as many of them are western made running parts that is long overdue to be replaced but can't due to sanction.\n\nPassengers will be inconvenienced but better they are on ground rather than flying.",
                "Shutting down all the airports in Moscow??  Good lord that sounds costly. \n\nDo it again.  Seriously.  Keep them shuting down, that's as easy way to bankrupt a few airlines.",
                "Hell, our Jetports don't even need drone attacks to be shut down.\n\nWe are EXCEPTIONAL!!!",
                "Are people in Moscow starting to see their lives impacted? I would assume if the people in that city start getting very upset things might start happening?",
                "“Oh no!”\n\nAnyway, my nuts itch. ",
                "I hope Ukraine strikes the parade!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "AI-generated porn site Mr. Deepfakes shuts down after service provider pulls support",
            "external_url": "https://www.cbsnews.com/news/ai-generated-porn-site-mr-deepfakes-shuts-down/",
            "upvotes": 1101,
            "date": "05/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/06/c156411b-333f-4edb-b3b5-e7099edf11d0/thumbnail/1200x630/3084baa6060ceb6f9499827feb0ebbcc/gettyimages-2192524685.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                ">The shutdown comes just days after Congress passed the \"Take It Down Act,\" which makes it a federal crime to post nonconsensual sexual imagery, including explicit deepfakes. The legislation, backed by first lady Melania Trump, requires social media platforms and other websites to remove images and videos within 48 hours after a victim's request. \n\nWell, there's your answer. They're getting ahead of the law. Probably spent all the money on blackjack and hookers and didn't have any in reserve for lawyers. I wonder if the ACLU would have considered taking the case on Free Speech grounds.",
                "The law has a weird clause in it.\n\nIt shall be unlawful for any person to use a computer to publish intimate depictions (I paraphrased here). Then it says, \"If - \" followed by further conditions. Condition \"ii.\" says:\n\n>what is depicted was not voluntarily exposed by the identifiable individual in a public or commercial setting;\n\nSo, if someone uploaded an intimate photo online, then someone else could use that photo to create deepfakes and it would be legal? Because if someone uploaded even one photo voluntarily to any website, then that could be public? And then anyone could use it for deepfakes.\n\nIf so, then that makes no sense and they should've left this part out. Or am I not understanding it?\n\nThe simpler law could've said, \"You can't use someone's likeness to create intimate/porn depictions.\" I don't know why that's so hard for the government. As now, it looks like they still have a window open where people can make deepfakes of a lot of people without their permission.\n\n[https://www.congress.gov/119/bills/s146/BILLS-119s146es.pdf](https://www.congress.gov/119/bills/s146/BILLS-119s146es.pdf)",
                "*The site allowed users to upload and view deepfake porn videos created using artificial intelligence. Forums on the site allowed users to buy and sell custom nonconsensual deepfake content, as well as discuss practices for making deepfakes.  The owner of the site remains unknown.* \n\nAll nonconsensual sex online should be taken down--no way in hell that it's \"free speech.\" In fact, quite the opposite. The fact the owner of this site is \"unknown,\" says it all.",
                "How will Elon musk react",
                "It's not actually AI right? It's deepfake tech which is worse, in a way, because it has more user input.",
                "OP really missed the chance to add the word \"out\" after \"pulls\" on this one.",
                "We have had good fake static images for decades.  No one cared until it was video.\n\nMy personal take is as long as the subject is a celeb and the content is offered freely its not a big deal.  \n\nSomehow we are still allowed to ai fake randos in non sexual ways?",
                "This just in. Everyone who ever cut out a headshot and put it over a body in a porn mag is to be hunted down and arrested."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Astronomers spot possible Planet Nine in data spanning 23 years",
            "external_url": "https://www.techspot.com/news/107802-astronomers-spot-possible-planet-nine-data-spanning-23.html",
            "upvotes": 1208,
            "date": "05/06/2025",
            "thumbnail": "https://www.techspot.com/images2/news/bigimage/2025/05/2025-05-05-image-18.jpg",
            "top_comments": [
                "Any millennials remember Planet X?",
                "I'd laugh if it's on this massive eliptical orbit and just comes around once every few million years to fuck shit up",
                "King Gizz gonna write a song about this",
                "It must be Pluto again :)",
                "If you zoom in on the planet it says MS 13. It’s the real deal. /s",
                "Nibiru has returned and the Anunnaki will liberate us.\n\n\n...lol oh man it's been awhile",
                "Tariffs incoming in 3...2...",
                "> Planet Nine\n\nGus inconsolable",
                "[what Happened To Planet X?](https://youtu.be/wy8fi77t8zU?si=5HrlKc0wIzPQYRGu)",
                "I thought we found planet nine 95 years ago???"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "84% of the world's coral reefs hit by worst bleaching event on record",
            "external_url": "https://apnews.com/article/coral-reef-bleaching-climate-change-fdbeddf7ae3ccc9d7cf85d1c3267e581",
            "upvotes": 2952,
            "date": "05/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Anti-intellectualism and corporate oligarchy have to die out or we are done for.",
                "I’m so fucking scared of the future",
                "I read it but I have a question. Is it 84% of all of them are completely bleached, or are 84% affected by some bleaching?",
                "It’s why they fight to hide it or call it lies, they know what’s happening and know what would happen if they didn’t keep 50% of the population on their side for their crimes. They expect to let everyone die off as they’ve prepped as best they can and continue to prep to survive with the massive wealth transfer",
                "As a scuba diver I’ve seen this first hand. I visited Coron, Philippines in 2014 and 2024, entire reefs had been bleached and killed in just 10 years.\n\nBetween the sheer amount of plastic we dump into the oceans and rising temperatures, we are doing our damnedest to kill off marine and coral life as fast as possible.",
                "But hey, it's YOUR fault average person!, YOU have to adjust and reduce. Not us!, you! - Corporations",
                "I grew up within an easy boat ride of the Great Barrier Reef. It was a distinct presence during my childhood and something that I’ve always thought as permanent as the mountains. I can’t take in and process that it’s dying so quickly, it’s like the moon disappearing from the sky.",
                "Grim. And I doubt we’re going to change anything.",
                "Fuck SAKE. Every fucking day these cunts are fucking killing us. Can we please fucking do something whatever we are doing is not enough. ",
                "I feel like I should apologize to my kids for creating them and encourage them not to procreate. Is that an extreme position? \n\nIs there a chance that the coral and algae can adapt to these new temperatures? And then when the earth starts to rapidly cool, will they be able to adapt again? It doesn't seem like a possibility to me. And I wouldn't want to be around when the oceans fail. All these dead whales washing up lately makes me think it's happening sooner than I'd hoped."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Russia says all airports in Moscow shut after drone attack",
            "external_url": "https://www.bbc.com/news/articles/c20xqdn04g3o",
            "upvotes": 5316,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0ef2/live/45708ce0-2a11-11f0-b699-f17b68e54842.jpg",
            "top_comments": [
                "Not a good sign for the military parade",
                "Anyone that would fly these dodgy Russian airlines after all the sanctions needs to have their head checked\n ",
                "Job well done. Professionals bring results without bluster; amateurs declare a special military operation.",
                "They got what they wanted. Shouldn't have invaded another country. C***s.",
                "Better to keep those jets ground as many of them are western made running parts that is long overdue to be replaced but can't due to sanction.\n\nPassengers will be inconvenienced but better they are on ground rather than flying.",
                "Shutting down all the airports in Moscow??  Good lord that sounds costly. \n\nDo it again.  Seriously.  Keep them shuting down, that's as easy way to bankrupt a few airlines.",
                "Hell, our Jetports don't even need drone attacks to be shut down.\n\nWe are EXCEPTIONAL!!!",
                "Are people in Moscow starting to see their lives impacted? I would assume if the people in that city start getting very upset things might start happening?",
                "“Oh no!”\n\nAnyway, my nuts itch. ",
                "I hope Ukraine strikes the parade!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Germany's Merz falls short of majority in vote for chancellor",
            "external_url": "https://www.bbc.com/news/articles/cvgp22zlrgko",
            "upvotes": 334,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/1d17/live/1da7dab0-2a52-11f0-b26b-ab62c890638b.jpg",
            "top_comments": [
                "I think this shouldn't lead to anything too bad. I assume the no votes come from hardliners in the Union who disliked his debt brake agreement. According to the bundestag website they have 14 days for the second round during which they'll do backroom deals, and even if that fails the third round only requires a plurality not a majority of votes. \n\nWorst case scenario would be Merz elected by plurality but he is then immediately toppled by a no confidence vote resulting in new elections. However I doubt the Greens or even the Left would do so since polling for the AfD has only increased since early this year.\n\nAt least this is my speculation feel free to correct me.",
                "That’s definitely a blow for him, but I think he should meet with the dissidents and understand their reasons and make an agreement. That’s politics and will show if he can make bridges with the adversaries.  At least one more time he should be given the chance to form government.",
                "This was only the first vote! Behold! As there still can be two more. But this has never happened before, so I'm all excited for round two. 😄",
                "Time for back room deals.",
                "He probably shouldn’t have allied him self with the extremist right wing party AfD and he probably shouldn’t kept the last government’s budget short just to abandon all his strong hesitations about the budged once he himself headed toward office…",
                "To quite Nelson from The Simpsons :\n\n\nHaha!",
                "Die Rache von Saskia Esken und Olaf Scholz 😊",
                "A clear set up by Trump and Musk, after they declared the Afd an extremist organization."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Additional checkpoint at B.C.-U.S. border shocks travellers",
            "external_url": "https://globalnews.ca/news/11164618/additional-checkpoint-bc-us-border-shocks/",
            "upvotes": 387,
            "date": "05/06/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/05/WEB-6P-EXTRA-BORDER-CHECKPOINT.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "Note that this was NORTHBOUND. So, they’re trying to stop illegal immigrants and “drugs” going TO Canada?",
                "I bet this is going to make Canadians want to visit the US even more right now! It's so much fun being interrogated!",
                "I was just invited down to the US to celebrate my niece’s graduation near Seattle. I’m heartbroken not to go, but I just can’t do it, for moral and safety reasons.",
                "These folks think they are this centuries SS.   I would not travel to the United States unless it was vitally important from some reason.",
                "Whom ever wrote the article\n\n\n\n\n It's Lynden not Linden.",
                "Maybe they can find the mystery smell that’s been going on in my car thanks to my kids.",
                "There is no good reason to cross the US border for any other reason than as required for work/employment.  ",
                "Don't come here. Spend your money somewhere else. Who knows when Trump is gonna declare Canadians enemies of the state.\n\nDo not come here. For the same reasons you should avoid Iran and Afghanistan.",
                "Easy solution: don’t fucking go to the us 🤷‍♂️",
                "We’re the NK of the Western world"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Peru suspends gold mining in north after massacre",
            "external_url": "https://www.dw.com/en/peru-suspends-gold-mining-in-north-after-massacre/a-72443414",
            "upvotes": 346,
            "date": "05/06/2025",
            "thumbnail": "https://static.dw.com/image/72443254_6.jpg",
            "top_comments": [
                "The suspension only applies to \"informal miners\". The licenced mining companies are unaffected. This suspension should have very little effect on overall gold production.",
                "They should also go after gaps and issues in supply chain. Illegal miners are obviously selling to someone and it ends up in supply chain",
                "Funny how they refer to their miners as \"artisanal\" and the other miners as \"illegal\"",
                "I read things like this from the US and have to wonder what the real crime rate and frequency are in Mexico and South America. As for statistics, it’s hard for me to gauge as I’ve seen the many ways they’re convoluted and gamed to show more/less crime as it benefits people.\n\nBeing in the US, sure we have bad neighborhoods. We have bad areas in cities. But mostly you’re safe unless you’re engaging in illegal/illicit behavior. Most crimes are not committed against innocent bystanders. \n\nIs the same true for down there?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "AI-generated porn site Mr. Deepfakes shuts down after service provider pulls support",
            "external_url": "https://www.cbsnews.com/news/ai-generated-porn-site-mr-deepfakes-shuts-down/",
            "upvotes": 1097,
            "date": "05/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/06/c156411b-333f-4edb-b3b5-e7099edf11d0/thumbnail/1200x630/3084baa6060ceb6f9499827feb0ebbcc/gettyimages-2192524685.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                ">The shutdown comes just days after Congress passed the \"Take It Down Act,\" which makes it a federal crime to post nonconsensual sexual imagery, including explicit deepfakes. The legislation, backed by first lady Melania Trump, requires social media platforms and other websites to remove images and videos within 48 hours after a victim's request. \n\nWell, there's your answer. They're getting ahead of the law. Probably spent all the money on blackjack and hookers and didn't have any in reserve for lawyers. I wonder if the ACLU would have considered taking the case on Free Speech grounds.",
                "The law has a weird clause in it.\n\nIt shall be unlawful for any person to use a computer to publish intimate depictions (I paraphrased here). Then it says, \"If - \" followed by further conditions. Condition \"ii.\" says:\n\n>what is depicted was not voluntarily exposed by the identifiable individual in a public or commercial setting;\n\nSo, if someone uploaded an intimate photo online, then someone else could use that photo to create deepfakes and it would be legal? Because if someone uploaded even one photo voluntarily to any website, then that could be public? And then anyone could use it for deepfakes.\n\nIf so, then that makes no sense and they should've left this part out. Or am I not understanding it?\n\nThe simpler law could've said, \"You can't use someone's likeness to create intimate/porn depictions.\" I don't know why that's so hard for the government. As now, it looks like they still have a window open where people can make deepfakes of a lot of people without their permission.\n\n[https://www.congress.gov/119/bills/s146/BILLS-119s146es.pdf](https://www.congress.gov/119/bills/s146/BILLS-119s146es.pdf)",
                "*The site allowed users to upload and view deepfake porn videos created using artificial intelligence. Forums on the site allowed users to buy and sell custom nonconsensual deepfake content, as well as discuss practices for making deepfakes.  The owner of the site remains unknown.* \n\nAll nonconsensual sex online should be taken down--no way in hell that it's \"free speech.\" In fact, quite the opposite. The fact the owner of this site is \"unknown,\" says it all.",
                "How will Elon musk react",
                "It's not actually AI right? It's deepfake tech which is worse, in a way, because it has more user input.",
                "OP really missed the chance to add the word \"out\" after \"pulls\" on this one.",
                "We have had good fake static images for decades.  No one cared until it was video.\n\nMy personal take is as long as the subject is a celeb and the content is offered freely its not a big deal.  \n\nSomehow we are still allowed to ai fake randos in non sexual ways?",
                "This just in. Everyone who ever cut out a headshot and put it over a body in a porn mag is to be hunted down and arrested."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Astronomers spot possible Planet Nine in data spanning 23 years",
            "external_url": "https://www.techspot.com/news/107802-astronomers-spot-possible-planet-nine-data-spanning-23.html",
            "upvotes": 1216,
            "date": "05/06/2025",
            "thumbnail": "https://www.techspot.com/images2/news/bigimage/2025/05/2025-05-05-image-18.jpg",
            "top_comments": [
                "Any millennials remember Planet X?",
                "I'd laugh if it's on this massive eliptical orbit and just comes around once every few million years to fuck shit up",
                "King Gizz gonna write a song about this",
                "It must be Pluto again :)",
                "If you zoom in on the planet it says MS 13. It’s the real deal. /s",
                "Nibiru has returned and the Anunnaki will liberate us.\n\n\n...lol oh man it's been awhile",
                "Tariffs incoming in 3...2...",
                "> Planet Nine\n\nGus inconsolable",
                "[what Happened To Planet X?](https://youtu.be/wy8fi77t8zU?si=5HrlKc0wIzPQYRGu)",
                "I thought we found planet nine 95 years ago???"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US Defense Secretary Hegseth to slash senior-most ranks of military",
            "external_url": "https://www.reuters.com/world/us/pentagon-reduce-4-star-positions-by-20-official-says-2025-05-05/",
            "upvotes": 35080,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This includes removing the Chairman of the Joint Chiefs of Staff, the Navy's top admiral and other senior flag officers from their positions.",
                "Imagine achieving the highest rank in the military over a lifetime of excellence & devotion ... only to be fired by this chode.",
                "Genuinely troubling. These are the few people most likely to stand up against an unconstitutional order.",
                "You gotta remove the guys who won’t do fascism for you, y’know?",
                "The cleanup after this administration will be monumental and take decades. America is in the process of learning an intensely painful lesson.",
                "For all the noise conservatives make when democratic presidents are in charge, screeching about tyranny... I've never been more afraid of the government than I have been the last four months. And it is getting worse every day.  Something has got to give. The mid terms need to be fucking tidal wave\n\nEdit: yeah, yeah, I get it, \"there won't be midterms\"... Well what the fuck are you doing, then?  You got a militia I can join? Otherwise, propose a fucking solution. Because I'll be phone banking, donating, knocking on doors and doing the best my household can to democratically pull this shit back.",
                "*\"More generals and admirals does not lead to more success,\" Hegseth said in a video posted on X.*\n\nThis is coming from a Fox News weekend TV host - someone with absolutely zero experience to say something like that. \n…\n\n*\"This is not a slash and burn exercise meant to punish high ranking officers, nothing could be further from the truth,\" he said.*\n\nSooooo, it’s a slash and burn exercise meant to punish high ranking officers.",
                "Yeah, so when they stage the coup for the third term there is no one at the top to defy them.",
                "I can’t imagine being a general and having this hot dog fire you. After leaking literal war plans in multiple group chats.",
                "Getting rid of any military leaders who swore allegiance to the US Constitution, and not Trump before they are deployed to oppress Americans."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump administration bars Harvard from new federal research funding",
            "external_url": "https://www.politico.com/news/2025/05/05/trump-bars-harvard-new-federal-research-funding-00330059",
            "upvotes": 6381,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Yet another thing Harvard can sue him for and win.\n\n\nTrump is so bad at this villainous consolidation thing.",
                "Trump just showing the way Liberty University can be denied federal funding through their students.",
                "12 Nobel Prize-winning scientists have active research programs at the Harvard Biological Labs.  Trump is attempting to cut off funding to some of the most important and impactful research on the planet, research that has and will save lives and make people's lives better, all because he's in a snit. \n\nAnd I say this as someone who did my PhD at a rival institution,  and devoutly believes that Harvard can gargle my testicles.  It's hard to argue with their results.",
                "Just a waste of everyone's resources and time. Fuckwad and his crew have no intentions on actually doing anything that will help the average American",
                "He’s going to decimate America’s leadership in various areas of research over his bruised ego, and the Republican Congress won’t challenge him. This is a team effort.",
                "He's gonna hamstring the brightest minds in the United States from conducting research that may help us all some day? Great.",
                "Fascists doing fascist shit.",
                "I wonder what a great America looks like to Trump. He guts NASA, the greatest space research institution in the world. He guts the NIH, the greatest medical research institution in the world. He guts the CDC, the greatest public health organization in the world. And now he targets Harvard, one of the greatest universities in the world. These are the things that, to me, make America \"great.\"\n\nDoes he think a great America is just a place with the most sweat shops in the world? He really seems to prefer America makes brake pads than revolutionary medical breakthroughs.",
                "He’s really not up to speed on what Universities can achieve, is he?\n\nManchester University isolating Graphene being just one example…",
                "Man, Donnie really hates America"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Judges must clear a high bar to separate parents from children forever, Texas Supreme Court rules",
            "external_url": "https://www.keranews.org/government/2025-05-05/judges-must-clear-a-high-bar-to-separate-parents-from-children-forever-texas-supreme-court-rules",
            "upvotes": 9173,
            "date": "05/05/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/be46422/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F87%2F01%2Fcd8484fc40b180a66aef0fe0c66c%2F121824-supreme-court-of-texas-seal-kut.JPG",
            "top_comments": [
                "You all would be shocked at how infrequently they went after parents who hurt their children. I would say it was less than 2%. \n\nI used to do this job. A solid third of my cases were bullshit weed and custody cases that no one cared about. There just weren't enough resources to care about this.\n\nAnother third was abject poverty and people living in falling apart plywood trailers with no plumbing or electricity in the middle of Texas summer. Obviously you can't have a newborn baby living in 110° shed. Usually for that we would cram them in with the very unwilling family member and call it a day. There wasn't enough money to do anything else. \n\nA third of my cases were teen parents who didn't know any better and often didn't care but sometimes were trying. It's hard to be 15 and have a baby of your own when you're living on someone's couch. We usually got another unwilling family member to help supervise in these situations and called it a day. There wasn't enough money to do anything else. \n\nIn a perfect world I would have gotten them all affordable housing and healthcare and birth control and education and government IDs and bus passes and nutrition and clothes and sooooooo muchhhhhh therapyyyyyyy. \n\nA small portion of my cases were absolute monsters who needed to be locked up and so many of them escaped any sort of actual punishment. Again because of resources. \n\nVery frequently we terminated rights for shit parents but that's usually because the parents didn't even make an effort to complete the court required programs they were ordered to do. Simple stuff like parenting classes and showing up to visits and paying $10 a month in child support. Half the time they didn't even show up. I would tell them in person and in writing and tell the attorney \"hey this person has court on this date if they want to continue being a parent they need to show up.\" Nothing.\n\nParents who actually made even a half-assed effort got their kids back unless they were complete monsters like incest/rapists.",
                ">Terminating parental rights requires a higher burden of proof — trial courts must find the evidence “clear and convincing.”\n\nClear and convincing is the medium level of proof. Below 'beyond a reasonable doubt'. \n\n>Court documents allege in March 2020, Stary had grabbed her then 9-year-old son by the back of his head, beat his face on the hardwood floor and carpet, then continued to beat his bruised face as his nose began to bleed. Stary was arrested and charged with injuring a child, a third-degree felony.\n\nShe was given a lifetime protective order against all her children. She now gets a new hearing with the new standard needing to be applied.",
                "I thought this was about ICE and am now disappointed.",
                "My cousin fostered and eventually adopted a baby who's addict parents fed him meth, more than once.  The judge kept insisting the baby needed to go to his biological family.  My cousin had to hire two lawyers to finally adopt him.\n\nFuck this state.  Fuck this state so much.",
                "from the click through.. of course this wasnt the only incident with her\n\n>During protective order hearings over the course of several months, Ethridge testified about the March 2020 incident and several previous instances in which he said Stary beat the children, forced them to sleep outside on the porch and abandoned one of their daughters on the side of the road during a drive back from Colorado.\n\n>The kids called the police for help at least six times, and Child Protective Services was contacted at least five times, according to court records.\n\n>After interviews with the children, a Harris County district court judge went a step further — she issued a lifetime protective order. Stary would not be allowed to see or directly contact her kids indefinitely.\n\nthe kids calling for help 11 times.. FFS and what happened with abandoning one on the drive from colorado to texas. Sounds like she should have had kids taken away a long time ago.",
                "So the standard is still below that needed for a conviction, and only even that high for permanent protective orders?\n\nThat sounds reasonable? Am I missing something?\n\n>Stary was arrested and charged with injuring a child, a third-degree felony.\n\nIf this woman beat her kid bloody, the should be convicted for that, which would require a higher burden of proof than terminating her parental rights.",
                "I was a public health nurse and some parents should lose custody before destroying their children.",
                "Obviously doesn't apply to citizens at the border. ",
                "\"...in cases of white american parents who beat their children\"\n\nThey're NOT talking about ICE separating migrant parents from their children. \n\nBecause of course they aren't.",
                "Hot take, if you literally ever hit your kid hard enough to make them bleed, and to be clear you shouldn't hit your kid at all, but if you ever hit them hard enough to make them bleed then you should never be allowed to see them again, ever. Not ever."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/06/2025 12:18:12 UTC"
}