{
    "posts": [
        {
            "category": "HOT",
            "title": "White House Correspondents’ Association cancels plans to have a comedian headline annual dinner",
            "external_url": "https://www.cnn.com/2025/03/29/media/white-house-correspondents-association-dinner-comedian/index.html",
            "upvotes": 23955,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/220430231320-23-white-house-correspondents-dinner.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Instead, the association says it will celebrate the First Amendment and the free press.\n\nAlso irony.",
                "I always find it hilarious the man who bullies everyone under the guise of a joke can’t take one himself. I’m sure it’s a narcissist thing.",
                ">\"At this consequential moment for journalism, I want to ensure the focus is not on the politics of division but entirely on awarding our colleagues for their outstanding work and providing scholarship and mentorship to the next generation of journalists\"\n\nSit, lie down, play dead. Good doggy.",
                "They're too chicken to have a real comedian, and comedians on their side of the aisle are probably gonna say a lot of really racist shit.",
                "lol any comedian worth their salt would have absolutely brutally buried this administration with joke after joke. I can’t blame them for canceling. The roast would have been REAL!",
                "Softer than baby shit.",
                "Cancel this fucking dinner. No respectable journalist should show up to rub elbows with this authoritarian administration.",
                "She told hosts comedian Samantha Bee and Beast Chief Content Officer Joanna Coles that the Trump administration are “kind of a bunch of murderers,” adding that playing to both sides “makes them feel like human beings, but they shouldn’t get to feel that way, ‘cause they’re not.”\n\nHA",
                "Get Bill Burr you cowards",
                "Elon: “the left killed comedy”\nThe right: “no comedy this year.”"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Protests hit Tesla dealerships across the world in challenge to Elon Musk",
            "external_url": "https://www.theguardian.com/world/2025/mar/29/tesla-protests-elon-musk-doge",
            "upvotes": 11681,
            "date": "03/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/35ea73a65fc7a315f860de5cf6c1a41aaeb375a1/0_120_1600_961/master/1600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f512a33f02abb7923975fb836120a1f9",
            "top_comments": [
                "Just a friendly reminder that he views these protests as a form of economic warfare and would prosecute everyone there if he could. He absolutely hates this stuff. Look at how emotional he got when someone made fun of the stock prices, he called him evil lol.\n\nKeep it up everybody.",
                "That's ok...seems like Nikola may be making a comeback. /s\n\nThis shit is getting obscene...listen to Trump explain his Pardon...\n\n\" I think...\"\n\n\" I think he was exonerated\"\n\n\" I don't know but I got lotsa references \"",
                "*On Saturday, with more than 200 events planned worldwide, protests kicked off midday in front of Tesla showrooms in Australia and New Zealand and then rippled across Europe in countries including Finland, Norway, Denmark, Germany, France, the Netherlands and the UK. Each rally was locally organized with original themes. In Ireland, it was “Smash the Fash”, and Switzerland had “Down with Doge...”*\n\nAnd, of course, from coast to coast in the US Tesla dealerships were closed down because of all the demonstrations, actions, and angry displays.",
                "The whole world hates you Elon. You are universally despised.",
                "The smartest thing Tesla can do is remove Elon and any association for the sake of the company.\n\nUnless Elon holds a majority in the company, in that case id ditch the stock now before it goes any lower.",
                "The world cannot wait for Elon to Occupy Mars.",
                "Just left one in Sunnyvale, CA, which might have the highest concentration of Teslas anywhere in the world. In fact, I would bet on it. Conservatively guessing 700+ protesters and four very lonely pro-Trump counterprotesters.",
                "Great, hit him where it hurts, his wealth.",
                "I am reminded of the generosity of humans all over the world after 911 when they all came together to support us, for they saw it as an attack on democracy.\n\nThat is exactly what is going on now. With their demonstrations against  Tesla and other American corporations, they are once again showing their support for democracy.\n\nAmericans thank all of you for your support. Yes, these Nazis will be defeated again, and this time no one will give a shit, what SCOTUS has to say in support of these fucking Nazis. All states will refuse to follow SCOTUS  orders and keep these motherfuckers, where they belong, in JAIL.",
                "Guys please stop, you might make 53 year old manchild cry!"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Wisconsin appeals court won't stop Musk's $1 million payments to voters after attorney general sues",
            "external_url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-checks-43fa79215e16c333a1079a86cb9aab08",
            "upvotes": 2367,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "As if people needed more motivation, beyond making sure Elon doesn't get his way, Crawford winning is the only chance of fixing those gerrymandered congressional lines in Wisconsin.\n\nThis is why local elections matter, people. In case it's not clear, it all connects.",
                "The article doesn't really cover it, what is the rationale given for denying an injunction?\n\nMusk already committed the felony by making the offer, are they just overlooking that because... reasons?",
                "This isnt even thinly veiled corruption, this is ranked corruption",
                "Kills me that we can’t hand water bottles to people in line to vote, but this vermin can do this crap.",
                "What is to stop any lower election from just paying people a hundred bucks to vote out a school board member or sheriff?",
                "This is unfucking believable.",
                "I think when one can buy democracy at that point democracy is dead.",
                "Laws just, do not apply to billionaires anymore. He quite literally could shoot someone in the middle of Fifth Avenue and no one would do a thing",
                "18 U.S. Code § 597 - Expenditures to influence voting- \n\nWhoever makes or offers to make an expenditure to any person, either to vote or withhold his vote, or to vote for or against any candidate; and\n\nWhoever solicits, accepts, or receives any such expenditure in consideration of his vote or the withholding of his vote—\n\nShall be fined under this title or imprisoned not more than one year, or both; and if the violation was willful, shall be fined under this title or imprisoned not more than two years, or both.",
                "My reaction kicked in about a month ago. Arm up...fascism is here."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Most employees at US Institute of Peace mass-fired via late-night email",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/29/us-institute-of-peace-mass-firings",
            "upvotes": 3207,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/838cf7912a5941c09917ec84b399a8690b6084fc/0_3_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=97f523c9f779f6186ee1a2e2ea4cf72a",
            "top_comments": [
                "Congressionally created and funded thinktank taken over by ‘Doge’ seeks to prevent and resolve global conflicts.",
                "*...there was a standoff as employees blocked Doge members from entering . Doge staff gained access in part with the help of the Washington police.   A White House spokesperson, Anna Kelly, said in an email Saturday that the institute “has failed to deliver peace...\"* \n\nSo, fire the Pentagon for failure to deliver defense on 911. That would be far more appropriate and would save 800 billion bucks rather than a few million.",
                "Its illegal, so why does anybody go along with it?",
                "\"They have failed to create peace.\"\n\nIts so childish and stupid.  It's \"I don't like your name so I'm shutting you down.\"  They have no idea what this group does.",
                "What a cowardly way of terminating people.  They are afraid to put a name with a face.",
                "They're not an executive department. Does OMB write their paychecks? What leverage do they have?",
                "I was just at the Hiroshima Peace Park and Memorial Museum. Of the many thoughts that crossed my mind was Trump's first term question to his security briefers - 'Why haven't we used [our tactical nukes] since we have them?'",
                "One of my close friends works there.  They do really important work and America is less safe with them gone",
                "That tracks with this government. I can’t wait to we mass fire the all of the  Americorps. I did the Americorps  program City Year which provided extra support to struggling schools.\n\n I taught ESL 3rd grade  in MA and all my students were 1st year immigrant students. Some students spoke no english in the beginning of the year and by the end of the year they were near grade level.  some of my students (2nd year english speakers) ended up exceeding grade level requirements.\n\nThese programs that cost money do a lot of good for the community and children.",
                "They're still pulling this ahit. Seriously, stop firing people."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Hegseth’s younger brother is serving in a key role as liaison and senior adviser inside the Pentagon",
            "external_url": "https://apnews.com/article/hegseth-brother-signal-dhs-hired-68678a8a653c79a4c6ae31a8bee64836",
            "upvotes": 11941,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Obviously a merit-based hire.",
                "Awful lot of nepotism in this swamp. Someone should think about draining it. ",
                "Nepotism in a Trump administration?  NO WAY.  They have too much integrity for that.",
                "Another DUI hire like his old brother?",
                "This is like the 1000000th most questionable thing the Trump administration has done",
                "I really hope a motivated reporter gets a bunch of info through FOIA about this dude's hiring process.\n\n\nConsidering how much info the government expects contractors to track and report around OFCCP compliance, it would be neat to find out if his hiring was nothing but an order from up top. You know, because merit and not anything else this could possibly be.\n\n\nNot that conservatives give two shits about blatant hypocrisy.",
                "So you can just put “Started my own podcast company” and “I do social media” on your resume now and people don’t laugh at you?",
                "My friends hate “DEI” because “merit based!” (Which is its own false argument by itself) but when I bring these kinds of blatant nepotism hires up they go “nothing wrong with wanting people you trust working with you”\n\nSo yeah that’s where we’re at. The mental gymnastics know no bounds.",
                "He sneaks the scotch around for big bro.",
                "Is he the one tasked with downsizing it into a trigon?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Luigi Mangione may get a laptop in jail to work on his defense in CEO murder case",
            "external_url": "https://apnews.com/article/luigi-mangione-trial-laptop-jail-unitedhealthcare-8bed30b120f57942cd24fdb91b61d210",
            "upvotes": 1501,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is for when the DOJ accidentally adds him to their Discord chat.",
                "I know he won’t have internet but will he have a webcam?",
                "The man killed a mass murderer who preyed on sick people. He should be given the key to the city; not locked up in a cell.",
                "So what are his chances of avoiding life in prison with no parole?",
                "And fix the crappy Civ 7 UI as well, hopefully.",
                "Sweet. I have issues with the new civ's UI",
                "Me in high school: I need a powerful pc for school work, mom! Word and powerpoint and research.\n\nI hope they let him install some games.",
                "Can he get access to a 3D printer?",
                "Does this mean I can send him nudes",
                "And cat videos. Legal defense and cat videos."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "US orders French companies to comply with Trump's diversity ban",
            "external_url": "https://www.reuters.com/world/us-warns-french-companies-they-must-comply-with-trumps-diversity-ban-2025-03-29/",
            "upvotes": 1275,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "French don't get shit from their government, so if you believe they take shit from FOREIGN governments you're sorely mistaken...",
                "Apparently he doesn't realize he doesn't own the whole planet.",
                "The WORST president of ALL TIME.",
                "And their response will likely be “fuck off” in French.",
                "We really are watching the Rise of the Turd Reich.",
                "Hmm, maybe American companies should comply with French labor laws.",
                "Oh boy, this definitely won't sour another relationship with an ally more",
                "Does Trump even know what country he's \"President\" of?",
                "He doesn’t get the French. Most Americans have zero idea about French culture. The French go hard and they don’t suffer fools. \n\nAs they say FAFO.",
                "At least Nero knew how to play the violin."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Meat packing plant workers worried over USDA allowing faster line speeds",
            "external_url": "https://www.mprnews.org/story/2025/03/28/meat-packing-plant-workers-worried-over-faster-line-speeds",
            "upvotes": 1296,
            "date": "03/29/2025",
            "thumbnail": "https://img.apmcdn.org/d2513a1442c4be0a45fcc07d1cad749bce9fc2b5/widescreen/49bae7-2021-06-gettyimages-1233224268-2000.jpg",
            "top_comments": [
                "And see an increase in workplace injuries in 3...2...\n\nOops, I can't do 1.\n\nThe saw just cut my finger off.",
                "The United Food and Commercial Workers Union is against this.\n\nThe National Pork Producers Council supports this.\n\nTells you everything you need to know about this policy change.\n\nWho benefits, the corporate leaders who can force higher output or the workers physically on the actual line?",
                "Biden refused to speed up the poultry processing lines even more because of the risk of increasing that all ready increased food borne outbreaks.",
                "Dudes read The Jungle like an instruction manual.",
                "A lot of safety regulations are built on the suffering, pain, anguish, maiming, and deaths from past tragedies.\n\n[This channel is great for learning about the instances that caused such innovations.](https://www.youtube.com/@FascinatingHorror)\n\nThis shit is also why I say Libertarianism is the act of relearning history the hard stupid painful way. You could look at a regulation, crack open a history book, and read about why it exists. \n\nOr you can deregulate shit blindly then cause the same accident or tragedy to happen  again and again until the victims and community demand the regulation gets reinstated.",
                "First ones on the line should be the 🐷 advocating for it.",
                "Isn't most packing factories having issues w staffing for some reason...   The speed of the line might not be the problem.",
                "The Jungle was not a map to success.",
                "In the early 1900s, Henry Ford started very slightly speeding up assembly/production lines every week. Employees caught on quickly, but injuries skyrocketed. \n\nWe’ve known for over 100 years that this is a bad idea.",
                "RFK says that bacteria are natural part of meat, so are worms. Eat up."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Curiosity rover makes ‘arguably the most exciting organic detection to date on Mars’",
            "external_url": "https://www.cnn.com/2025/03/29/science/mars-curiosity-large-organic-molecules/index.html",
            "upvotes": 1577,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/nasa-mars-hydrocarbons-2025.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "\"Some scientists believe that fatty acids such as decanoic acid and dodecanoic acid formed the membranes of the first simple cell-like structures on Earth, Pearce said.\"\n\n\n\n\n\n“(This is) the closest we’ve come to detecting a major biomolecule-related signal — something potentially tied to membrane structure, which is a key feature of life,” Pearce said via email. “Organics on their own are intriguing, but not evidence of life. In contrast, biomolecules like membranes, amino acids, nucleotides, and sugars are central components of biology as we know it, and finding any of them would be groundbreaking (we haven’t yet).”",
                "It’s cool to see the life on mars theory continue to gain validation. There’s a pretty convincing theory that as the core of Mars cooled it lost its global magnetic field which allowed solar winds to wreck the are, and turned what could’ve been a planet that supported life into what it is today.",
                "Too bad there's no one left at NASA to study it.",
                "With the US going to shit at least this some good news",
                "Just say oil. Just say it’s oil and nasa will get a budget of fifty trillion next year",
                "Well poop, the great filter vid from kurzgesagt says something to the effect of if we found even microbial life on mars it would mean we have yet to pass the filter.  So self made apocalypse here we come!",
                "> decane, undecane and dodecane\n\ndamn, was hoping they were gonna say cocaine! Mars is made of COCAINE!",
                "I am just glad someone is having a good year. Good for you, little rover!",
                "Bad news for the great filter theory",
                "Sounds like Mars needs some Freedom🦅"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Small plane crashes in Minneapolis suburb, FAA says",
            "external_url": "https://abcnews.go.com/US/small-plane-crashes-minneapolis-suburb-faa/story?id=120298494",
            "upvotes": 610,
            "date": "03/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/19daad38-9af0-4161-a580-af151d91483c/minnesota-plane-crash-01-ht-jt-250329_1743276433188_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Having listened to ATC recordings for years, one of the points people overlook is many of the smaller airports have controllers with general aviation experience themselves. \n\nWhen shit hits the fan, having someone on the radio who can immediately provide guidance and calm based on their own piloting experience in the region isn't really replaceable. \n\nYou're losing that too.",
                "Wow this looks really bad.",
                "The surprising thing is not the plane crashing but people left at the FAA who can speak on its behalf!",
                "So what did the air traffic controllers have to say about this?\n\nWait there aren't those anymore",
                "How big of a plane are these usually? I'm assuming this is one of those small ones, maybe a handful of people?",
                "At least they survived."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Wisconsin appeals court won't stop Musk's $1 million payments to voters after attorney general sues",
            "external_url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-checks-43fa79215e16c333a1079a86cb9aab08",
            "upvotes": 2357,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "As if people needed more motivation, beyond making sure Elon doesn't get his way, Crawford winning is the only chance of fixing those gerrymandered congressional lines in Wisconsin.\n\nThis is why local elections matter, people. In case it's not clear, it all connects.",
                "The article doesn't really cover it, what is the rationale given for denying an injunction?\n\nMusk already committed the felony by making the offer, are they just overlooking that because... reasons?",
                "This isnt even thinly veiled corruption, this is ranked corruption",
                "Kills me that we can’t hand water bottles to people in line to vote, but this vermin can do this crap.",
                "What is to stop any lower election from just paying people a hundred bucks to vote out a school board member or sheriff?",
                "This is unfucking believable.",
                "I think when one can buy democracy at that point democracy is dead.",
                "Laws just, do not apply to billionaires anymore. He quite literally could shoot someone in the middle of Fifth Avenue and no one would do a thing",
                "18 U.S. Code § 597 - Expenditures to influence voting- \n\nWhoever makes or offers to make an expenditure to any person, either to vote or withhold his vote, or to vote for or against any candidate; and\n\nWhoever solicits, accepts, or receives any such expenditure in consideration of his vote or the withholding of his vote—\n\nShall be fined under this title or imprisoned not more than one year, or both; and if the violation was willful, shall be fined under this title or imprisoned not more than two years, or both.",
                "My reaction kicked in about a month ago. Arm up...fascism is here."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Most employees at US Institute of Peace mass-fired via late-night email",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/29/us-institute-of-peace-mass-firings",
            "upvotes": 3206,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/838cf7912a5941c09917ec84b399a8690b6084fc/0_3_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=97f523c9f779f6186ee1a2e2ea4cf72a",
            "top_comments": [
                "Congressionally created and funded thinktank taken over by ‘Doge’ seeks to prevent and resolve global conflicts.",
                "*...there was a standoff as employees blocked Doge members from entering . Doge staff gained access in part with the help of the Washington police.   A White House spokesperson, Anna Kelly, said in an email Saturday that the institute “has failed to deliver peace...\"* \n\nSo, fire the Pentagon for failure to deliver defense on 911. That would be far more appropriate and would save 800 billion bucks rather than a few million.",
                "Its illegal, so why does anybody go along with it?",
                "\"They have failed to create peace.\"\n\nIts so childish and stupid.  It's \"I don't like your name so I'm shutting you down.\"  They have no idea what this group does.",
                "What a cowardly way of terminating people.  They are afraid to put a name with a face.",
                "They're not an executive department. Does OMB write their paychecks? What leverage do they have?",
                "I was just at the Hiroshima Peace Park and Memorial Museum. Of the many thoughts that crossed my mind was Trump's first term question to his security briefers - 'Why haven't we used [our tactical nukes] since we have them?'",
                "One of my close friends works there.  They do really important work and America is less safe with them gone",
                "That tracks with this government. I can’t wait to we mass fire the all of the  Americorps. I did the Americorps  program City Year which provided extra support to struggling schools.\n\n I taught ESL 3rd grade  in MA and all my students were 1st year immigrant students. Some students spoke no english in the beginning of the year and by the end of the year they were near grade level.  some of my students (2nd year english speakers) ended up exceeding grade level requirements.\n\nThese programs that cost money do a lot of good for the community and children.",
                "They're still pulling this ahit. Seriously, stop firing people."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "US orders French companies to comply with Trump's diversity ban",
            "external_url": "https://www.reuters.com/world/us-warns-french-companies-they-must-comply-with-trumps-diversity-ban-2025-03-29/",
            "upvotes": 1276,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "French don't get shit from their government, so if you believe they take shit from FOREIGN governments you're sorely mistaken...",
                "Apparently he doesn't realize he doesn't own the whole planet.",
                "The WORST president of ALL TIME.",
                "And their response will likely be “fuck off” in French.",
                "We really are watching the Rise of the Turd Reich.",
                "Hmm, maybe American companies should comply with French labor laws.",
                "Oh boy, this definitely won't sour another relationship with an ally more",
                "Does Trump even know what country he's \"President\" of?",
                "He doesn’t get the French. Most Americans have zero idea about French culture. The French go hard and they don’t suffer fools. \n\nAs they say FAFO.",
                "At least Nero knew how to play the violin."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Luigi Mangione may get a laptop in jail to work on his defense in CEO murder case",
            "external_url": "https://apnews.com/article/luigi-mangione-trial-laptop-jail-unitedhealthcare-8bed30b120f57942cd24fdb91b61d210",
            "upvotes": 1499,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is for when the DOJ accidentally adds him to their Discord chat.",
                "I know he won’t have internet but will he have a webcam?",
                "The man killed a mass murderer who preyed on sick people. He should be given the key to the city; not locked up in a cell.",
                "So what are his chances of avoiding life in prison with no parole?",
                "And fix the crappy Civ 7 UI as well, hopefully.",
                "Sweet. I have issues with the new civ's UI",
                "Me in high school: I need a powerful pc for school work, mom! Word and powerpoint and research.\n\nI hope they let him install some games.",
                "Can he get access to a 3D printer?",
                "Does this mean I can send him nudes",
                "And cat videos. Legal defense and cat videos."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "NEW",
            "title": "Small plane crashes in Minneapolis suburb, FAA says",
            "external_url": "https://abcnews.go.com/US/small-plane-crashes-minneapolis-suburb-faa/story?id=120298494",
            "upvotes": 605,
            "date": "03/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/19daad38-9af0-4161-a580-af151d91483c/minnesota-plane-crash-01-ht-jt-250329_1743276433188_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Having listened to ATC recordings for years, one of the points people overlook is many of the smaller airports have controllers with general aviation experience themselves. \n\nWhen shit hits the fan, having someone on the radio who can immediately provide guidance and calm based on their own piloting experience in the region isn't really replaceable. \n\nYou're losing that too.",
                "Wow this looks really bad.",
                "The surprising thing is not the plane crashing but people left at the FAA who can speak on its behalf!",
                "So what did the air traffic controllers have to say about this?\n\nWait there aren't those anymore",
                "How big of a plane are these usually? I'm assuming this is one of those small ones, maybe a handful of people?",
                "At least they survived."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Meat packing plant workers worried over USDA allowing faster line speeds",
            "external_url": "https://www.mprnews.org/story/2025/03/28/meat-packing-plant-workers-worried-over-faster-line-speeds",
            "upvotes": 1298,
            "date": "03/29/2025",
            "thumbnail": "https://img.apmcdn.org/d2513a1442c4be0a45fcc07d1cad749bce9fc2b5/widescreen/49bae7-2021-06-gettyimages-1233224268-2000.jpg",
            "top_comments": [
                "And see an increase in workplace injuries in 3...2...\n\nOops, I can't do 1.\n\nThe saw just cut my finger off.",
                "The United Food and Commercial Workers Union is against this.\n\nThe National Pork Producers Council supports this.\n\nTells you everything you need to know about this policy change.\n\nWho benefits, the corporate leaders who can force higher output or the workers physically on the actual line?",
                "Biden refused to speed up the poultry processing lines even more because of the risk of increasing that all ready increased food borne outbreaks.",
                "Dudes read The Jungle like an instruction manual.",
                "A lot of safety regulations are built on the suffering, pain, anguish, maiming, and deaths from past tragedies.\n\n[This channel is great for learning about the instances that caused such innovations.](https://www.youtube.com/@FascinatingHorror)\n\nThis shit is also why I say Libertarianism is the act of relearning history the hard stupid painful way. You could look at a regulation, crack open a history book, and read about why it exists. \n\nOr you can deregulate shit blindly then cause the same accident or tragedy to happen  again and again until the victims and community demand the regulation gets reinstated.",
                "First ones on the line should be the 🐷 advocating for it.",
                "Isn't most packing factories having issues w staffing for some reason...   The speed of the line might not be the problem.",
                "The Jungle was not a map to success.",
                "In the early 1900s, Henry Ford started very slightly speeding up assembly/production lines every week. Employees caught on quickly, but injuries skyrocketed. \n\nWe’ve known for over 100 years that this is a bad idea.",
                "RFK says that bacteria are natural part of meat, so are worms. Eat up."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Protests hit Tesla dealerships across the world in challenge to Elon Musk",
            "external_url": "https://www.theguardian.com/world/2025/mar/29/tesla-protests-elon-musk-doge",
            "upvotes": 11671,
            "date": "03/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/35ea73a65fc7a315f860de5cf6c1a41aaeb375a1/0_120_1600_961/master/1600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f512a33f02abb7923975fb836120a1f9",
            "top_comments": [
                "Just a friendly reminder that he views these protests as a form of economic warfare and would prosecute everyone there if he could. He absolutely hates this stuff. Look at how emotional he got when someone made fun of the stock prices, he called him evil lol.\n\nKeep it up everybody.",
                "That's ok...seems like Nikola may be making a comeback. /s\n\nThis shit is getting obscene...listen to Trump explain his Pardon...\n\n\" I think...\"\n\n\" I think he was exonerated\"\n\n\" I don't know but I got lotsa references \"",
                "*On Saturday, with more than 200 events planned worldwide, protests kicked off midday in front of Tesla showrooms in Australia and New Zealand and then rippled across Europe in countries including Finland, Norway, Denmark, Germany, France, the Netherlands and the UK. Each rally was locally organized with original themes. In Ireland, it was “Smash the Fash”, and Switzerland had “Down with Doge...”*\n\nAnd, of course, from coast to coast in the US Tesla dealerships were closed down because of all the demonstrations, actions, and angry displays.",
                "The whole world hates you Elon. You are universally despised.",
                "The smartest thing Tesla can do is remove Elon and any association for the sake of the company.\n\nUnless Elon holds a majority in the company, in that case id ditch the stock now before it goes any lower.",
                "The world cannot wait for Elon to Occupy Mars.",
                "Just left one in Sunnyvale, CA, which might have the highest concentration of Teslas anywhere in the world. In fact, I would bet on it. Conservatively guessing 700+ protesters and four very lonely pro-Trump counterprotesters.",
                "Great, hit him where it hurts, his wealth.",
                "I am reminded of the generosity of humans all over the world after 911 when they all came together to support us, for they saw it as an attack on democracy.\n\nThat is exactly what is going on now. With their demonstrations against  Tesla and other American corporations, they are once again showing their support for democracy.\n\nAmericans thank all of you for your support. Yes, these Nazis will be defeated again, and this time no one will give a shit, what SCOTUS has to say in support of these fucking Nazis. All states will refuse to follow SCOTUS  orders and keep these motherfuckers, where they belong, in JAIL.",
                "Guys please stop, you might make 53 year old manchild cry!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "White House Correspondents’ Association cancels plans to have a comedian headline annual dinner",
            "external_url": "https://www.cnn.com/2025/03/29/media/white-house-correspondents-association-dinner-comedian/index.html",
            "upvotes": 23957,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/220430231320-23-white-house-correspondents-dinner.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Instead, the association says it will celebrate the First Amendment and the free press.\n\nAlso irony.",
                "I always find it hilarious the man who bullies everyone under the guise of a joke can’t take one himself. I’m sure it’s a narcissist thing.",
                ">\"At this consequential moment for journalism, I want to ensure the focus is not on the politics of division but entirely on awarding our colleagues for their outstanding work and providing scholarship and mentorship to the next generation of journalists\"\n\nSit, lie down, play dead. Good doggy.",
                "They're too chicken to have a real comedian, and comedians on their side of the aisle are probably gonna say a lot of really racist shit.",
                "lol any comedian worth their salt would have absolutely brutally buried this administration with joke after joke. I can’t blame them for canceling. The roast would have been REAL!",
                "Softer than baby shit.",
                "Cancel this fucking dinner. No respectable journalist should show up to rub elbows with this authoritarian administration.",
                "She told hosts comedian Samantha Bee and Beast Chief Content Officer Joanna Coles that the Trump administration are “kind of a bunch of murderers,” adding that playing to both sides “makes them feel like human beings, but they shouldn’t get to feel that way, ‘cause they’re not.”\n\nHA",
                "Get Bill Burr you cowards",
                "Elon: “the left killed comedy”\nThe right: “no comedy this year.”"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Artificial sweetener surcralose (aka E955) confuses brain and increases hunger, study says | CNN",
            "external_url": "https://www.cnn.com/2025/03/29/health/artificial-sweetener-sucralose-hunger-signals-wellness/index.html",
            "upvotes": 143,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2162322149.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Study funded by Big Sugar",
                "it also can cause migraines",
                "Sucralose tastes like chlorine to me."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Harvard Dismisses Leaders of Center for Middle Eastern Studies | News | The Harvard Crimson",
            "external_url": "https://www.thecrimson.com/article/2025/3/29/harvard-cmes-director-departure/",
            "upvotes": 144,
            "date": "03/29/2025",
            "thumbnail": "https://s3.amazonaws.com/thumbnails.thecrimson.com/photos/2017/01/24/195101_1319860.jpg.1999x1750_q95_crop-smart_upscale.jpg",
            "top_comments": [
                "Harvard has been suspiciously silent about all of this. Just 10 minutes away Tufts U has 2000 people show up in a day protesting the abduction of a PHD student while Harvard just closed their gates to the public. F off.",
                "Have to cave to the fascists or risk having to dip into the endowment to offset the potential loss of federal money. \n\nSo much for the school's motto: Veritas.",
                "$50BN endowment. They’re a hedge fund. Cowards.",
                "Our institutions will not stand against fascism. It must be us",
                "Not sure why people think a University primarily for the rich to produce more bankers/lawyers/MBAs/hedge fund managers, is some liberal hotbed of progressive ideals.",
                "Schools w large endowments should be using them for their intellectual independence, otherwise, what the hell good are they?",
                "“The departures come after the CMES has repeatedly faced public criticism from Harvard affiliates who have alleged that some of the center’s programming has been antisemitic and has failed to represent Israeli perspectives.”\n\nIn other news, the Holocaust Museum has repeatedly faced public criticism for failing to represent the Nazi perspective.",
                "Liberals are not your allies.",
                "That was an antisemitic propaganda center anyways."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Wisconsin appeals court won't stop Musk's $1 million payments to voters after attorney general sues",
            "external_url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-checks-43fa79215e16c333a1079a86cb9aab08",
            "upvotes": 2360,
            "date": "03/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "As if people needed more motivation, beyond making sure Elon doesn't get his way, Crawford winning is the only chance of fixing those gerrymandered congressional lines in Wisconsin.\n\nThis is why local elections matter, people. In case it's not clear, it all connects.",
                "The article doesn't really cover it, what is the rationale given for denying an injunction?\n\nMusk already committed the felony by making the offer, are they just overlooking that because... reasons?",
                "This isnt even thinly veiled corruption, this is ranked corruption",
                "Kills me that we can’t hand water bottles to people in line to vote, but this vermin can do this crap.",
                "What is to stop any lower election from just paying people a hundred bucks to vote out a school board member or sheriff?",
                "This is unfucking believable.",
                "I think when one can buy democracy at that point democracy is dead.",
                "Laws just, do not apply to billionaires anymore. He quite literally could shoot someone in the middle of Fifth Avenue and no one would do a thing",
                "18 U.S. Code § 597 - Expenditures to influence voting- \n\nWhoever makes or offers to make an expenditure to any person, either to vote or withhold his vote, or to vote for or against any candidate; and\n\nWhoever solicits, accepts, or receives any such expenditure in consideration of his vote or the withholding of his vote—\n\nShall be fined under this title or imprisoned not more than one year, or both; and if the violation was willful, shall be fined under this title or imprisoned not more than two years, or both.",
                "My reaction kicked in about a month ago. Arm up...fascism is here."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Luigi Mangione may get a laptop in jail to work on his defense in CEO murder case",
            "external_url": "https://apnews.com/article/luigi-mangione-trial-laptop-jail-unitedhealthcare-8bed30b120f57942cd24fdb91b61d210",
            "upvotes": 1498,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is for when the DOJ accidentally adds him to their Discord chat.",
                "I know he won’t have internet but will he have a webcam?",
                "The man killed a mass murderer who preyed on sick people. He should be given the key to the city; not locked up in a cell.",
                "So what are his chances of avoiding life in prison with no parole?",
                "And fix the crappy Civ 7 UI as well, hopefully.",
                "Sweet. I have issues with the new civ's UI",
                "Me in high school: I need a powerful pc for school work, mom! Word and powerpoint and research.\n\nI hope they let him install some games.",
                "Can he get access to a 3D printer?",
                "Does this mean I can send him nudes",
                "And cat videos. Legal defense and cat videos."
            ],
            "aggregate_sentiment": 51.0
        },
        {
            "category": "RISING",
            "title": "Most employees at US Institute of Peace mass-fired via late-night email",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/29/us-institute-of-peace-mass-firings",
            "upvotes": 3205,
            "date": "03/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/838cf7912a5941c09917ec84b399a8690b6084fc/0_3_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=97f523c9f779f6186ee1a2e2ea4cf72a",
            "top_comments": [
                "Congressionally created and funded thinktank taken over by ‘Doge’ seeks to prevent and resolve global conflicts.",
                "*...there was a standoff as employees blocked Doge members from entering . Doge staff gained access in part with the help of the Washington police.   A White House spokesperson, Anna Kelly, said in an email Saturday that the institute “has failed to deliver peace...\"* \n\nSo, fire the Pentagon for failure to deliver defense on 911. That would be far more appropriate and would save 800 billion bucks rather than a few million.",
                "Its illegal, so why does anybody go along with it?",
                "\"They have failed to create peace.\"\n\nIts so childish and stupid.  It's \"I don't like your name so I'm shutting you down.\"  They have no idea what this group does.",
                "What a cowardly way of terminating people.  They are afraid to put a name with a face.",
                "They're not an executive department. Does OMB write their paychecks? What leverage do they have?",
                "I was just at the Hiroshima Peace Park and Memorial Museum. Of the many thoughts that crossed my mind was Trump's first term question to his security briefers - 'Why haven't we used [our tactical nukes] since we have them?'",
                "One of my close friends works there.  They do really important work and America is less safe with them gone",
                "That tracks with this government. I can’t wait to we mass fire the all of the  Americorps. I did the Americorps  program City Year which provided extra support to struggling schools.\n\n I taught ESL 3rd grade  in MA and all my students were 1st year immigrant students. Some students spoke no english in the beginning of the year and by the end of the year they were near grade level.  some of my students (2nd year english speakers) ended up exceeding grade level requirements.\n\nThese programs that cost money do a lot of good for the community and children.",
                "They're still pulling this ahit. Seriously, stop firing people."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Protests hit Tesla dealerships across the world in challenge to Elon Musk",
            "external_url": "https://www.theguardian.com/world/2025/mar/29/tesla-protests-elon-musk-doge",
            "upvotes": 11679,
            "date": "03/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/35ea73a65fc7a315f860de5cf6c1a41aaeb375a1/0_120_1600_961/master/1600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f512a33f02abb7923975fb836120a1f9",
            "top_comments": [
                "Just a friendly reminder that he views these protests as a form of economic warfare and would prosecute everyone there if he could. He absolutely hates this stuff. Look at how emotional he got when someone made fun of the stock prices, he called him evil lol.\n\nKeep it up everybody.",
                "That's ok...seems like Nikola may be making a comeback. /s\n\nThis shit is getting obscene...listen to Trump explain his Pardon...\n\n\" I think...\"\n\n\" I think he was exonerated\"\n\n\" I don't know but I got lotsa references \"",
                "*On Saturday, with more than 200 events planned worldwide, protests kicked off midday in front of Tesla showrooms in Australia and New Zealand and then rippled across Europe in countries including Finland, Norway, Denmark, Germany, France, the Netherlands and the UK. Each rally was locally organized with original themes. In Ireland, it was “Smash the Fash”, and Switzerland had “Down with Doge...”*\n\nAnd, of course, from coast to coast in the US Tesla dealerships were closed down because of all the demonstrations, actions, and angry displays.",
                "The whole world hates you Elon. You are universally despised.",
                "The smartest thing Tesla can do is remove Elon and any association for the sake of the company.\n\nUnless Elon holds a majority in the company, in that case id ditch the stock now before it goes any lower.",
                "The world cannot wait for Elon to Occupy Mars.",
                "Just left one in Sunnyvale, CA, which might have the highest concentration of Teslas anywhere in the world. In fact, I would bet on it. Conservatively guessing 700+ protesters and four very lonely pro-Trump counterprotesters.",
                "Great, hit him where it hurts, his wealth.",
                "I am reminded of the generosity of humans all over the world after 911 when they all came together to support us, for they saw it as an attack on democracy.\n\nThat is exactly what is going on now. With their demonstrations against  Tesla and other American corporations, they are once again showing their support for democracy.\n\nAmericans thank all of you for your support. Yes, these Nazis will be defeated again, and this time no one will give a shit, what SCOTUS has to say in support of these fucking Nazis. All states will refuse to follow SCOTUS  orders and keep these motherfuckers, where they belong, in JAIL.",
                "Guys please stop, you might make 53 year old manchild cry!"
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "RISING",
            "title": "Meat packing plant workers worried over USDA allowing faster line speeds",
            "external_url": "https://www.mprnews.org/story/2025/03/28/meat-packing-plant-workers-worried-over-faster-line-speeds",
            "upvotes": 1300,
            "date": "03/29/2025",
            "thumbnail": "https://img.apmcdn.org/d2513a1442c4be0a45fcc07d1cad749bce9fc2b5/widescreen/49bae7-2021-06-gettyimages-1233224268-2000.jpg",
            "top_comments": [
                "And see an increase in workplace injuries in 3...2...\n\nOops, I can't do 1.\n\nThe saw just cut my finger off.",
                "The United Food and Commercial Workers Union is against this.\n\nThe National Pork Producers Council supports this.\n\nTells you everything you need to know about this policy change.\n\nWho benefits, the corporate leaders who can force higher output or the workers physically on the actual line?",
                "Biden refused to speed up the poultry processing lines even more because of the risk of increasing that all ready increased food borne outbreaks.",
                "Dudes read The Jungle like an instruction manual.",
                "A lot of safety regulations are built on the suffering, pain, anguish, maiming, and deaths from past tragedies.\n\n[This channel is great for learning about the instances that caused such innovations.](https://www.youtube.com/@FascinatingHorror)\n\nThis shit is also why I say Libertarianism is the act of relearning history the hard stupid painful way. You could look at a regulation, crack open a history book, and read about why it exists. \n\nOr you can deregulate shit blindly then cause the same accident or tragedy to happen  again and again until the victims and community demand the regulation gets reinstated.",
                "First ones on the line should be the 🐷 advocating for it.",
                "Isn't most packing factories having issues w staffing for some reason...   The speed of the line might not be the problem.",
                "The Jungle was not a map to success.",
                "In the early 1900s, Henry Ford started very slightly speeding up assembly/production lines every week. Employees caught on quickly, but injuries skyrocketed. \n\nWe’ve known for over 100 years that this is a bad idea.",
                "RFK says that bacteria are natural part of meat, so are worms. Eat up."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Small plane crashes in Minneapolis suburb, FAA says",
            "external_url": "https://abcnews.go.com/US/small-plane-crashes-minneapolis-suburb-faa/story?id=120298494",
            "upvotes": 607,
            "date": "03/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/19daad38-9af0-4161-a580-af151d91483c/minnesota-plane-crash-01-ht-jt-250329_1743276433188_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Having listened to ATC recordings for years, one of the points people overlook is many of the smaller airports have controllers with general aviation experience themselves. \n\nWhen shit hits the fan, having someone on the radio who can immediately provide guidance and calm based on their own piloting experience in the region isn't really replaceable. \n\nYou're losing that too.",
                "Wow this looks really bad.",
                "The surprising thing is not the plane crashing but people left at the FAA who can speak on its behalf!",
                "So what did the air traffic controllers have to say about this?\n\nWait there aren't those anymore",
                "How big of a plane are these usually? I'm assuming this is one of those small ones, maybe a handful of people?",
                "At least they survived."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "US orders French companies to comply with Trump's diversity ban",
            "external_url": "https://www.reuters.com/world/us-warns-french-companies-they-must-comply-with-trumps-diversity-ban-2025-03-29/",
            "upvotes": 1275,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "French don't get shit from their government, so if you believe they take shit from FOREIGN governments you're sorely mistaken...",
                "Apparently he doesn't realize he doesn't own the whole planet.",
                "The WORST president of ALL TIME.",
                "And their response will likely be “fuck off” in French.",
                "We really are watching the Rise of the Turd Reich.",
                "Hmm, maybe American companies should comply with French labor laws.",
                "Oh boy, this definitely won't sour another relationship with an ally more",
                "Does Trump even know what country he's \"President\" of?",
                "He doesn’t get the French. Most Americans have zero idea about French culture. The French go hard and they don’t suffer fools. \n\nAs they say FAFO.",
                "At least Nero knew how to play the violin."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "White House Correspondents’ Association cancels plans to have a comedian headline annual dinner",
            "external_url": "https://www.cnn.com/2025/03/29/media/white-house-correspondents-association-dinner-comedian/index.html",
            "upvotes": 23954,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/220430231320-23-white-house-correspondents-dinner.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Instead, the association says it will celebrate the First Amendment and the free press.\n\nAlso irony.",
                "I always find it hilarious the man who bullies everyone under the guise of a joke can’t take one himself. I’m sure it’s a narcissist thing.",
                ">\"At this consequential moment for journalism, I want to ensure the focus is not on the politics of division but entirely on awarding our colleagues for their outstanding work and providing scholarship and mentorship to the next generation of journalists\"\n\nSit, lie down, play dead. Good doggy.",
                "They're too chicken to have a real comedian, and comedians on their side of the aisle are probably gonna say a lot of really racist shit.",
                "lol any comedian worth their salt would have absolutely brutally buried this administration with joke after joke. I can’t blame them for canceling. The roast would have been REAL!",
                "Softer than baby shit.",
                "Cancel this fucking dinner. No respectable journalist should show up to rub elbows with this authoritarian administration.",
                "She told hosts comedian Samantha Bee and Beast Chief Content Officer Joanna Coles that the Trump administration are “kind of a bunch of murderers,” adding that playing to both sides “makes them feel like human beings, but they shouldn’t get to feel that way, ‘cause they’re not.”\n\nHA",
                "Get Bill Burr you cowards",
                "Elon: “the left killed comedy”\nThe right: “no comedy this year.”"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Red Cross gravely concerned for nine missing medics in Gaza",
            "external_url": "https://www.reuters.com/world/middle-east/red-cross-gravely-concerned-nine-missing-medics-gaza-2025-03-29/",
            "upvotes": 1123,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I read a novel about a society of flying lizard people in which one of, if not the worst crimes a person could commit was to kill a healer. I wish humans thought that way",
                "I admire the optimism to be concerned about missing medics rather than just writing them off as murdered five minutes after the were late checking in.",
                "Weird, I wonder who killed them.",
                "Israel breaks international law like Snoop Dogg smokes weed",
                "For people who are paywalled, mirror from [USNews](https://www.usnews.com/news/world/articles/2025-03-29/red-cross-gravely-concerned-for-nine-missing-medics-in-gaza).",
                "Red cross could get fuck itself as one of the most corrupt and useless organization",
                "*Everyone* is concerned except for Zionists and the American politicians they pay for.",
                "[removed]",
                "Ask BIBI, I’m sure he knows",
                "[deleted]"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Airman who was shot down, imprisoned in Japan during World War II accounted for",
            "external_url": "https://www.cbsnews.com/news/world-war-ii-airman-tokyo-prison-fire-accounted-for/",
            "upvotes": 855,
            "date": "03/29/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/27/967af4aa-c473-4418-bd2c-425f83459f2c/thumbnail/1200x630g8/4a8e7242c096130e2350b6bc14d572d4/screenshot-2025-03-27-at-10-40-32-am.png?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "I marvel at tenacity of organization geared to search and identify missing US military members lost in the fog of war.\n\nAnother missing is now identified and will return home.\n\nThank you very much for your service to US.",
                "Total accounting for every soldier, sailor, airman and Marine. Leave no man behind.",
                "I find it ironic that the people he came to bomb merely put him in prison, then his own country killed him."
            ],
            "aggregate_sentiment": 42.0
        }
    ],
    "last_updated": "03/30/2025 04:10:20 UTC"
}