{
    "posts": [
        {
            "category": "HOT",
            "title": "Regeneron to buy bankrupt DNA testing firm 23andMe for $256 million",
            "external_url": "https://www.cnn.com/2025/05/19/business/regeneron-23-and-me?utm_medium=social&utm_source=igCNN&utm_content=2025-05-19T12%3A31%3A59",
            "upvotes": 9018,
            "date": "05/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/231207110123-23andme-testing-kit-file.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Delete Your Data From 23andMe\n\nhttps://www.nytimes.com/wirecutter/reviews/wirecutter-show-podcast-20250328-23andme-data-bankrupt/",
                "$256 million/15 million customers = $17.\n\nYour DNA is worth $17.",
                "Can't wait to fight my genetically upgraded evil clone, designed to replace me!!",
                "IMO the biggest miss with 23&Me is them not buying Ancestry.com, etc, to help build a collaborative genealogical chart system families could use and edit, or expanding on it with local family related news and documents available throughout the generations to better piece together familial history and even photos, etc.\n\nAside from selling biological info to ad companies or insurers or other seedy profiteers, I don’t see why they couldn’t have made money from a reduced priced option for current members / entrants to access the “plus” member benefits or used the genetic data and self reports, combined with localized double blind studies ofc, to confirm data trends that could be profitable while also not selling discreet information.\n\nI feel like they just didn’t broaden the definition of what was possible under their company’s umbrella.",
                "I never did a DNA test because I always felt it was going to be used for transactional reasons. This is exactly why; Your information is whoever buys it.",
                "I sent my DNA in knowing all the pitfalls (to Ancestry, not 23andMe, but same thing) because I'm adopted and wanted to find my biological family. I actually found them, and now have a solid relationship with my full biological brother, which has been well worth any horrors that might occur from my DNA being in a database. Otherwise, I wouldn't do this.",
                "Ah, good thing it didn’t get sold to an unscrupulous buyer that engages in securities fraud, price fixing, and has ties to the current administration. \n\nOh wait.  \n\nIf you haven’t deleted your data from 23andMe, do it now.",
                "Regeneron is the biggest company that created the monoclonal antibody treatment that was used as a post-infective treatment for COVID. Trump himself got it when he was infected. \n\nThey were also the recipient of close to half a billion in funding from Trump's Operation Warp Speed, the government-funded race to come up with vaccines and treatments for COVID.\n\nThe CEO and the company were treated quite preferentially by Ron DeSantis during the Biden years. \n\nSo we are talking strong ties to Trump and the GOP. It's not entirely out of the realm of possibility for them to sell the data inappropriately for unethical ends. Like HHS' contemplated autism DB. Thiel's Palantir. DOGE for whatever dystopic reason. ICE for a different dystopia. And of course, insurance companies.",
                "Ok, I guess I need to brace for the downvotes given the current comments here. \n\nHonestly, this is worlds better than an insurance company or some random tech startup with undescribed end goals, guys. This is a legitimate big pharmaceutical company who has a lot of R&D around genetic disease and has made a lot of therapeutic advances. They want the data to develop new therapies, probably ones for genetic based disease. Being the first to do this will make them so much money. That’s their goal here, I think. It’s new massively growing space in R&D. And this much genetic data is research treasure trove for them.\n\nThey are also going to have pre-designed protocols and standards when it comes to handling this data. I know people side eye big pharma (rightfully in most circumstances) but this is a much better outcome than many other situations.\n\nAm I saying don’t delete your data? No. Am I saying this is better than pretty much any other potential buyer? Absolutely.\n\nI also want to add one thing: All the stuff about Trump ties is wild. Pretty much every pharma company (and  many of the academic researchers that Trump is now black listing from NIH funding due to their coronavirus research) got Project Warp Speed funding during the pandemic. Monoclonal antibody treatment was an absolute scientific miracle. So were the other rapid vaccine developments during the pandemic. It saved so many lives.",
                "What are the downsides of them having our dna data. I keep seeing everyone saying delete it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "30-year Treasury yield jumps above 5% after Moody's downgrades U.S. credit rating",
            "external_url": "https://www.cnbc.com/2025/05/19/us-treasury-yields-moodys-downgrades-us-credit-rating.html",
            "upvotes": 2780,
            "date": "05/19/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136194-17455098532025-04-24t154347z_1903305251_rc2e4eazuveh_rtrmadp_0_usa-stocks.jpeg?v=1745598876&w=1920&h=1080",
            "top_comments": [
                "i'm too poor to understand what this means",
                "Markets are down and treasury yields are up. That's a very bad sign.\n\nThe US is getting hit with a \"moron penalty\" from global investors.",
                "And Bessent “doesn’t care.” 🙄 Mother fucker.",
                "I remember when it was an alleged HUGE DEAL when the US rating first dropped in 2011. The big corporate media alarmist reporting was non-stop. All the talking heads were blathering. Everything was just a way bigger deal when Obama was in office for ::reasons:: 😆",
                "Well played Russia. They were never going to defeat US in a military war. Paying for a Russian Asset to bury the US economy 4 feet under though...",
                "Can anyone explain this like they’re talking to a five year old for me? Uh uh uh it’s so I explain it to my 5 year old it’s not for me clearly I understand what this means.",
                "Let me guess. Market going back down, it's Biden fault again until they go back up for a day. Then it's Rumps market. Until the downfall again and then it's Biden again. \n\nNothing shows accountability, like lack of accountability. \n\n8647.",
                "Trump doesn’t have the cards, but he went all in on a mind numbingly transparent and idiotic bluff, and he lost. Like with all things Trump, he’s left someone else with the bill (in this case the American taxpayers). He still gets to collect bribes with impunity thanks to the corrupt MAGA party that refuses to hold him accountable. ",
                "We're , we're not even 6 months in. ",
                "Can we use Experian Boost to get our credit rating back up where it belongs?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Tornado warnings delayed because of DOGE cuts",
            "external_url": "https://www.mesoscalenews.com/p/tornado-warnings-delayed-because",
            "upvotes": 33193,
            "date": "05/19/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbf1204d0-dd21-493d-b55a-0394aebc6880_1800x2250.jpeg",
            "top_comments": [
                "**Key facts before the politics start flying:**\n\n* **What happened** – A nocturnal tornado outbreak late 17 May killed at least 27 people across Kentucky and Missouri (18 of them in Laurel County, KY). Radar‐based debris signatures appeared before midnight, but the first *official* warnings for parts of the path weren’t pushed until minutes after circulation was already on the ground.\n\n* **Why the gap matters** – For night-time storms you’re asleep until a phone alert blares. Even a 5- to 10-minute lag can be the difference between getting to a basement and dying in bed.\n\n* **Staffing reality** – The Jackson, KY forecast office that covers Laurel County has been running 31 % below its authorised staffing since DOGE-mandated cuts early this year. The overnight forecaster position—whose only job is to watch radar while everyone else sleeps—was eliminated in April. Nearly half of NWS offices now have 20 %+ vacancy rates, according to an Associated Press analysis.\n\n* **Warnings on the night** – Because the office can’t staff 24/7 anymore, an on-call meteorologist had to remote-log-in when rotation ramped up. That start-up window accounts for the delay you see in the warning logs.\n\n* **Experts warned this would happen** – Meteorologists and the employees’ union flagged the risk in February; The NY Times, PBS, and WaPo all ran pieces in the past month on how the same budget axe was forcing eight forecast offices—including Jackson—to drop round-the-clock coverage.\n\n**TL;DR**\n\nThe science isn’t broken; the funding pipeline is. Cut the people who keep eyes on radar at 11 p.m. and you buy tragedy at midnight.",
                "But think of the money nobody saved.",
                "Watched a YouTuber stream these and he questioned at times why tornado warnings were not being issued…oof.",
                "It’s worse than just warnings (which is awful to be clear). \n\n[Weather balloon cuts](https://www.axios.com/2025/03/21/nws-layoffs-cuts-weather-balloons-forecasts) are also ongoing. \n\nWhat do weather balloons do? They give critical live data as they ascend through the atmosphere. What does that tell us, why should I care what the wind speed or temperature is 18,000 feet up? \n\nBecause that feeds *directly* into weather models that are used to predict these kinds of events. \n\nSo they’re *literally* making our forecasts harder and shittier.\n\nEdit: if you want to help the national weather service, you can look into volunteering to collect weather data through [CoCoRaHS](https://www.weather.gov/ilm/cocorahs).",
                "That's just good business right there! The national weather service costs every taxpayer roughly $4 a year. Thanks to the heroes at DOGE, that number will surely come down to something more palatable, and all it's costing us are people's lives and livelihoods! Truly the art of the deal!\n\n/s in case it wasn't obvious",
                "That's the point. Reduce the trust people have in national services so they practically *beg* them to be privatized.\n\nAlso, NOAA had the nerve to call trump out over the hurricane. And that's some shit he just won't let stand.",
                "And I had someone telling today “There’s an app! And it’s automatically updated you don’t need those employees! The people who died just didn’t check the app!”",
                "Reminder that part of P2025 was making the weather information that the government provides for free privatized. They want that information to be provided to companies for free so those companies can turn around and offer it as a paid service. \n\nPeople would not receive alerts for dangerous weather anymore unless they paid for it.",
                "Trump's American Bloodbath is underway.",
                "27 lives that may have been saved if they had more warning."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Yellowstone Park officials take action: Grizzly bear euthanized for repeatedly accessing trash",
            "external_url": "https://www.denver7.com/science-and-tech/animals-and-insects/yellowstone-park-officials-take-action-grizzly-bear-euthanized-for-repeatedly-accessing-trash",
            "upvotes": 861,
            "date": "05/19/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/41176df/2147483647/strip/true/crop/2048x1075+0+230/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F14%2F88%2F5a56c5f14717869fa31704a1acb5%2F54521718168-6343a39264-k.jpg",
            "top_comments": [
                "R.I.P Yogi, too smart for his own good.",
                ">The bear, weighing approximately 400 pounds, had overturned multiple large, bear-resistant dumpsters and accessed human food and trash at popular locations, including Old Faithful, the Nez Perce Picnic Area, and the Midway Geyser Basin parking lot.\n\n\"There is considerable overlap between the intelligence of the smartest bears and the dumbest tourists.\"\n\n-Yosemite National Park ranger, attributed.",
                "I feel like the trash is the bigger problem than the bear. That was his home. Not ours and not our trash’s.",
                "What about the dirty humans creating the trash.",
                "So they killed a bear for doing bear shit?",
                "ITT alot of people who underestimate Grizzly Bears, apparently",
                "Something something a succulent meal",
                "Are the job cuts to park rangers to blame for this? Should the trash not be regularly emptied? Are they unable to empty it as frequently with less rangers? If so, glad to know that even animals are being killed because of this dumb shit.",
                "That's kinda messed up.  \nBear just finds a source of great food  delivered to his home by people wanting see bears doing bear things only to be shot dead by those people for doing bear things.",
                "So sad.  Necessary, but so damn sad.  That bear did nothing wrong."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "South Florida woman facing $1.8 million ICE fine speaks out: \"Please have mercy\" - CBS Miami",
            "external_url": "https://www.cbsnews.com/miami/news/south-florida-woman-facing-1-8-million-immigration-fine-speaks-out-please-have-mercy/",
            "upvotes": 1888,
            "date": "05/19/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/17/2d9b8a3e-78b0-411e-8576-4a4074697124/thumbnail/1200x630/ed232a3a2a15950b21749c2bd81d68b5/1800-ivan-miami-springs-ice-fine-pkg-5-16-25.jpg?v=6df9366690ed146f169dd0670c453f91",
            "top_comments": [
                "1.8 million? \n\nHow is that not a cruel and unusual fine?",
                "Still have no idea why so many Hispanics voted for Trump. This whole ICE bullshit is a small horror.",
                "People like this are the vast majority of those trump wants to deport.  Decent human beings raising a family and contributing more to America than the entire trump family ever could. \n\nYes, he'll deport a few criminals.  He'll also deport citizens he'll claim are criminals.  In the long run he'll end up losing what greatness America ever had.",
                "How about fining people who employ undocumented workers millions of dollars? Of course we could never do that.",
                "If only she was a born a white South African than Trump would like her.",
                "[removed]",
                "I am pro immigration.  My father immigrated (legally) here from Canada and my husband and his family came here legally from Cuba.   I hate what the Trump admin is doing to immigrants.\n\nBUT\n\n\"Maria entered the U.S. through California in February 2005. Two months later, after failing to appear at a scheduled immigration hearing, she was ordered to leave the country.\"\n\nShe was given a chance to stay and yet she failed to appear and was told to leave 20 years ago.  I don't agree with the fine, it's ridiculous.  But \"The fine was issued under the [Immigration and Nationality Act of 1952](https://www.uscis.gov/laws-and-policy/legislation/immigration-and-nationality-act), which permits the government to impose daily penalties on undocumented individuals who ignore removal orders.\".\n\nI feel bad for her but she could have followed the system, attended the hearings and followed the direction she was given.  Now she wants mercy because she doesn't want to leave her children and go back to Honduras.  All of this could have been avoided by showing up for the hearing in 2005.  I'm not unsympathetic but when you hear about legal immigrants being denied due process and being held for having a fucking opinion that Trump doesn't like, this seems more of a her problem.",
                "They are trying to get her to leave. Having that large a fine on the books kills your credit and will make things difficult for you.",
                "[removed]",
                "A mother of two with no criminal record? Sure, makes sense.\n\nWhy do I never hear about Trump handling all the worst hardened criminals like he said he would?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Spain orders Airbnb to block nearly 66,000 holiday rental listings over rule violations",
            "external_url": "https://apnews.com/article/airbnb-spain-rental-listing-a91e605f6342db1b169d4f9d1681e9d4",
            "upvotes": 648,
            "date": "05/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I've been a fan of AIRBnB for a long time, and I like the idea of people being able to rent out a home, their own or another, for a short period of time...\n\nBut it's gotten too commercialized.\n\nSites like these should only be allowing individuals, not businesses, who normally reside in those countries to rent out their primary, or perhaps a secondary residence for short term rentals.\n\nPeople shouldnt have 3+ properties they are renting out short term.  You want to have 3+ properties, long term rentals only for anything above your primary +1.\n\nI still use AIRBnB, but hotel pricing has come a long way in the past few years, where now it's a toss up if I look at Airbnb or hotels when I'm on vacation.  So it isn't even the savings it used to be which drove me to it in the first place.",
                "Hate airBNBs The ruin quiet neighborhoods and are mostly corporate owned",
                "Good.\n\nTourism is a big part of the Spanish economy but it has l been kidnapped by capitalist profiteers who will do everything to earn an extra penny.\n\nThey are squeezing out the liveability of the big city's and making live miserable for both the citizens as wel as the tourists.",
                "It's not enough. To solve the housing crisis you need to ban corporations from buying, owning and renting homes, as well as institute a cap on property ownership (imo no more than 2 properties per person), and heavily tax short term rentals. Just going after AirBnB is like putting a bandaid on an exposed bone ",
                "At this point in time, fuck second home ownership and fuck any entity that owns an apartment that is not a person.\n\nUnfettered capitalism has failed us in one of the most important rights and human need. Nationalize the whole housing market. Let each family unit have a standard house, provided by the government. And absolutely no ownership. You get a house when you become an adult, you leave it for another person when you die. Inheritance is the root of all evil, as it allows inter-generational wealth to accrue and wealth disparity to persist. It allows the most evil and cruel persons to think they're so clever, when all they had was lucky to be born to rich fucks.\n\nNationalized housing, 100% inheritance tax. Reset the system, it's not working for us people.\n\nI'll expand the comment: everywhere I see around me, in Barcelona (one of the affected cities in the article), people pay more than 100% of a single salary for rent (forget about buying, you can't save for the down-payment). Commerces are strangled by absurd renting costs and have to close. The neighbourhood I live in has a continuously rotating procession of opening and closing shops that cannot really afford staying open when everyone is poorer and the rents are sky high. The only shops that can stay are housing agencies and franchise boutiques or cafeterias. It's very saddening.\n\nMany of my friends have had to abandon Barcelona, gentrified away from the places they were born.\n\nAnd the only ones gaining anything now are the landlords. Fuck them all, they're just parasites. Appropriate them all, without paying. If there was any justice, they would also receive the Marie Antoinette treatment for making everyone's life miserable and painful."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Biden diagnosed with ‘aggressive form’ of prostate cancer",
            "external_url": "https://www.cnn.com/2025/05/18/politics/joe-biden-prostate-cancer",
            "upvotes": 52374,
            "date": "05/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2193208062.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Former US president Joe Biden has been diagnosed with prostate cancer, a statement from his office said on Sunday.\n\n>Biden, 82, was diagnosed on Friday after he saw a doctor last week for urinary symptoms.\n\n>The cancer is characterised by a Gleason score of 9 with metastasis to the bone, his office said, meaning it is a more aggressive form of the disease.\n\n>Biden and his family are said to be reviewing treatment options, the statement said. The former president's office added that the cancer is hormone-sensitive, meaning it can likely be managed.\n\n>This is a developing story.\n\n>This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version.\n\n/saved you a click. Sad news.",
                "As someone who has had a father and a grandfather who were both diagnosed with early onset prostate cancer, my heart goes out to Biden and his family. A Gleason 9 score with bone involvement is not good news. \n\nProstate cancer typically is very slow growing and easily catchable in the early stages. However, every now and then there are some really nasty aggressive forms. Unfortunately, it sounds like the former president might be dealing with the latter. I’ll be praying for him.",
                "‪Fuck prostate cancer. Lost my dad and so many other family members to it. Regardless of your politics, don’t wish cancer on anyone. Prayers up Mr. President. ‬ may we one day have a cure for this awful disease.",
                "Biden has viewed cancer as one of the most important changes he can make in his position for the past decade. His experience with losing Beau clearly made it a health policy focus, and it’s reflected in the research programs he helped establish and re-establish through the Cancer Moonshot effort. \n\nI hope he has the opportunity to benefit from the care he helped enable.",
                "Fuck cancer.  I lost my mom to it and I would give my own life to have taken away the pain and degeneration she faced in her final year.  \n\nI hope for the best for Biden and his treatment, and my heart goes out to the whole Biden family.",
                "I'm still recovering from having my prostate removed last Wednesday, due to prostate cancer with the score of Gleason 7.  I'm still in that awful period where I have to wear a catheter. I just got the pathology results that showed the surgeon got it all and hopefully there  should be none remaining in the body. Best day of my life. Biden's Gleason 9 is a pretty poor diagnosis. I wish him well and a positive result.",
                "Seems like the writing’s on the wall and wish we could skip the shitshow that’ll inevitably ensue",
                "That’s rough. Absolutely fuck cancer.",
                "The hate on FoxNews page is absolutely horrible.\n\nThe nicest comment was something along the lines of, \"horrible president, don't wish this on him, but he might deserve it.\"\n\nThe fuck is wrong with these people.",
                "As someone who just had their prostate removed due to cancer…Fuck cancer. I was diagnosed in February, so it was caught early and I should make a full recovery. Go get your PSA checked gents. I hope Biden makes it through this."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "CBS News chief steps down amid tension over Trump lawsuit",
            "external_url": "https://www.nbcnews.com/business/media/cbs-news-chief-steps-down-over-trump-tensions-rcna207700",
            "upvotes": 330,
            "date": "05/19/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-wendy-mcmahon-mb-1605-cf1d81.jpg",
            "top_comments": [
                "Super fun to watch all the news orgs capitulate to the fascist fuck. I'm sure this bodes well for our future. 4 months in and you can see just how primed the wealthy are to abandon entire groups of people and democracy itself to ensure they keep making money.",
                "From the article:\n\n//\nThe president and CEO of CBS News said Monday that she is stepping down, marking the second high-profile departure from the organization within the past month as it contends with a $20 billion lawsuit from President Donald Trump and a high-profile merger.\n\nWendy McMahon, who took over the stalwart news brand in 2023, said in a memo that her time atop the company has been \"a privilege and joy,\" but that the past few months had been \"challenging.\"\n\n\"It’s become clear that the company and I do not agree on the path forward,\" McMahon wrote in a memo to CBS News staff. \"It’s time for me to move on and for this organization to move forward with new leadership.\"\n//",
                "Another brick in the wall against fascism has crumbled.",
                "There goes the reporting, what’s left? A scattered, frayed court system. Coming Soon Amerirussa 🤷‍♂️",
                "Last night on Last Week Tonight.",
                "I'm not even sure what the main problem is with mainstream news organizations are, cowardice, greed, avarice, or stupidity.\n\nAt this point I'm convinced we as a society are better off without giant corporations controlling all aspects of news and entertainment. \n\nBreak them all up.",
                "Another example as to why independent media is important",
                "Paid off to stop reporting facts and retire?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "France to open new high security prison in French Guiana",
            "external_url": "https://www.bbc.com/news/articles/c7v7n81emy3o",
            "upvotes": 375,
            "date": "05/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/cb38/live/1485c920-349c-11f0-ad6d-67c1c2fdfbf5.jpg",
            "top_comments": [
                "Didn't they do that like 100 years ago already, only for some dude to escape and write a book about it, which then turned into the movie *Papillon*, lol",
                "Related note: since French Guiana is part of France and France is part of the European Union, the largest national park in the European Union isn’t in Europe",
                "we already tried that 100 years ago please stop",
                "Lads, it's fine - it ain't a colonial prison coz itsanintegralpartoffrance",
                "South American mega prisons... So hot right now",
                "Local leper colonies purchase cigars to prepare for influx of escapees.",
                "Wait, with how French Guyana is part of France, isn't this just France opening a new prison in France?  Woopity?",
                "I like how France can go from a darling of the Western world one moment to completely tone deaf moves so quickly. They keep things spicy.",
                "In 2009 I was visiting France with my bf at the time to see his family. On a drive from Lyon to Bourges we passed a large castle/fortress-like building on the top of a hill, and I asked what it was. His dad said it was a prison. I replied, \"oh, is that where all the murderers are?\" he kind of laughed in reply, saying not really; that murder was pretty uncommon in that part of France. He kind of made fun of me a little bit, since I was from the US and was used to murders and violence as just being a part of life and not some rare and shocking occurrence. \n\nKind of a long and round-about way of saying that the France's need for a new high security prison is news to me, assuming the intent is to send convicts from mainland France there is the intent.",
                "instead of FG, why not island of Mayotte?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Primary school evacuated after student brings in a grenade for show and tell",
            "external_url": "https://www.the-independent.com/news/uk/home-news/grenade-osmaston-school-evacuation-derbyshire-b2752851.html",
            "upvotes": 4096,
            "date": "05/19/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/17/10/00/iStock-1018660080.jpeg?trim=83,0,83,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                ">“It was quite an eventful assembly,” said Mrs Hart. “It was going fine and there was a boy who brought an old bullet case in, which I knew about, but then his friend produced a hand grenade from his pocket. That, I was not expecting.”\n\nPoor kid who brought in the bullet case must have been feeling so good thinking, *\"What a badass I am\"* before his friend followed it up with the grenade. Crushing.",
                "Brick where did you get a hand grenade?",
                "[deleted]",
                "Better to learn now than on the streets",
                "I remember bringing in a Hamilton Model 27 .22 caliber boys rifle to school for my son to use for a show and tell.\n\nI called the principal to see if I needed to case it up when I brought it in, and he said, \"Nope, just stop at the office.\"\n\n1990, obviously. \n\nFast forward to now, his autistic son made a comment about shooting  an Uzi and now has to be searched every morning before school, while escorted by his father.\n\nI get it, but he has trouble sometimes with impulsive talk.\n\nHe is 11, and I feel bad for him.",
                "Article completely left the most important part out: Did he count to three, no more, no less?",
                "I almost did this as a kid. It was a much simpler time back then.",
                "Say what you will but if the goal of show and tell is to share your story then I'd say this kid blew the assignment out of the water. I'm honored and confused to learn about his family's heirloom grenade.",
                "My dad was the town GP and did a lot of housecalls. According to staff at the local clinic, he was the first and last person a lot of people in town ever saw. \n\nHe had a box in the garage filled with all kind of stuff that he'd taken out of his medicine bag. Expired medicine, gadgets gifted by medical reps, equipment he didn't need at the moment, you name it.\n\nAs a kid, the box fascinated me. One morning, I remembered that I needed to bring something to school for show-and-tell and decided to take something from the box. Without telling my parents.\n\nMom was called in to come get the speculum I'd chosen. Dad found it hilarious. Mom was not impressed. \n\n(We'd later raid his bag and use the surgical tubing in our slingshots. We could shoot a glass marble through an empty oil can with those. It's a miracle we didn't maim anyone. )",
                "*kids, they blow up so fast.*"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "CBS News chief steps down amid tension over Trump lawsuit",
            "external_url": "https://www.nbcnews.com/business/media/cbs-news-chief-steps-down-over-trump-tensions-rcna207700",
            "upvotes": 330,
            "date": "05/19/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-wendy-mcmahon-mb-1605-cf1d81.jpg",
            "top_comments": [
                "Super fun to watch all the news orgs capitulate to the fascist fuck. I'm sure this bodes well for our future. 4 months in and you can see just how primed the wealthy are to abandon entire groups of people and democracy itself to ensure they keep making money.",
                "From the article:\n\n//\nThe president and CEO of CBS News said Monday that she is stepping down, marking the second high-profile departure from the organization within the past month as it contends with a $20 billion lawsuit from President Donald Trump and a high-profile merger.\n\nWendy McMahon, who took over the stalwart news brand in 2023, said in a memo that her time atop the company has been \"a privilege and joy,\" but that the past few months had been \"challenging.\"\n\n\"It’s become clear that the company and I do not agree on the path forward,\" McMahon wrote in a memo to CBS News staff. \"It’s time for me to move on and for this organization to move forward with new leadership.\"\n//",
                "Another brick in the wall against fascism has crumbled.",
                "There goes the reporting, what’s left? A scattered, frayed court system. Coming Soon Amerirussa 🤷‍♂️",
                "Last night on Last Week Tonight.",
                "I'm not even sure what the main problem is with mainstream news organizations are, cowardice, greed, avarice, or stupidity.\n\nAt this point I'm convinced we as a society are better off without giant corporations controlling all aspects of news and entertainment. \n\nBreak them all up.",
                "Another example as to why independent media is important",
                "Paid off to stop reporting facts and retire?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "3 killed in lightning strike at Cambodia's Angkor Wat UNESCO site",
            "external_url": "https://abcnews.go.com/International/wireStory/3-killed-lightning-strike-cambodias-angkor-wat-unesco-121939389",
            "upvotes": 100,
            "date": "05/19/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8bb172da-98a7-4420-a747-3e7ed74c2e56/wirestory_906b4f088c6b97d2bc992f1ac0501ef5_16x9.jpg?w=1600",
            "top_comments": [
                "Wow. Take a wonderful sightseeing trip and die.  Terrible",
                "And that's why you watch your mouth in temples kids"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Spain orders Airbnb to block nearly 66,000 holiday rental listings over rule violations",
            "external_url": "https://apnews.com/article/airbnb-spain-rental-listing-a91e605f6342db1b169d4f9d1681e9d4",
            "upvotes": 647,
            "date": "05/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I've been a fan of AIRBnB for a long time, and I like the idea of people being able to rent out a home, their own or another, for a short period of time...\n\nBut it's gotten too commercialized.\n\nSites like these should only be allowing individuals, not businesses, who normally reside in those countries to rent out their primary, or perhaps a secondary residence for short term rentals.\n\nPeople shouldnt have 3+ properties they are renting out short term.  You want to have 3+ properties, long term rentals only for anything above your primary +1.\n\nI still use AIRBnB, but hotel pricing has come a long way in the past few years, where now it's a toss up if I look at Airbnb or hotels when I'm on vacation.  So it isn't even the savings it used to be which drove me to it in the first place.",
                "Hate airBNBs The ruin quiet neighborhoods and are mostly corporate owned",
                "Good.\n\nTourism is a big part of the Spanish economy but it has l been kidnapped by capitalist profiteers who will do everything to earn an extra penny.\n\nThey are squeezing out the liveability of the big city's and making live miserable for both the citizens as wel as the tourists.",
                "It's not enough. To solve the housing crisis you need to ban corporations from buying, owning and renting homes, as well as institute a cap on property ownership (imo no more than 2 properties per person), and heavily tax short term rentals. Just going after AirBnB is like putting a bandaid on an exposed bone ",
                "At this point in time, fuck second home ownership and fuck any entity that owns an apartment that is not a person.\n\nUnfettered capitalism has failed us in one of the most important rights and human need. Nationalize the whole housing market. Let each family unit have a standard house, provided by the government. And absolutely no ownership. You get a house when you become an adult, you leave it for another person when you die. Inheritance is the root of all evil, as it allows inter-generational wealth to accrue and wealth disparity to persist. It allows the most evil and cruel persons to think they're so clever, when all they had was lucky to be born to rich fucks.\n\nNationalized housing, 100% inheritance tax. Reset the system, it's not working for us people.\n\nI'll expand the comment: everywhere I see around me, in Barcelona (one of the affected cities in the article), people pay more than 100% of a single salary for rent (forget about buying, you can't save for the down-payment). Commerces are strangled by absurd renting costs and have to close. The neighbourhood I live in has a continuously rotating procession of opening and closing shops that cannot really afford staying open when everyone is poorer and the rents are sky high. The only shops that can stay are housing agencies and franchise boutiques or cafeterias. It's very saddening.\n\nMany of my friends have had to abandon Barcelona, gentrified away from the places they were born.\n\nAnd the only ones gaining anything now are the landlords. Fuck them all, they're just parasites. Appropriate them all, without paying. If there was any justice, they would also receive the Marie Antoinette treatment for making everyone's life miserable and painful."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "30-year Treasury yield jumps above 5% after Moody's downgrades U.S. credit rating",
            "external_url": "https://www.cnbc.com/2025/05/19/us-treasury-yields-moodys-downgrades-us-credit-rating.html",
            "upvotes": 2780,
            "date": "05/19/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136194-17455098532025-04-24t154347z_1903305251_rc2e4eazuveh_rtrmadp_0_usa-stocks.jpeg?v=1745598876&w=1920&h=1080",
            "top_comments": [
                "i'm too poor to understand what this means",
                "Markets are down and treasury yields are up. That's a very bad sign.\n\nThe US is getting hit with a \"moron penalty\" from global investors.",
                "And Bessent “doesn’t care.” 🙄 Mother fucker.",
                "I remember when it was an alleged HUGE DEAL when the US rating first dropped in 2011. The big corporate media alarmist reporting was non-stop. All the talking heads were blathering. Everything was just a way bigger deal when Obama was in office for ::reasons:: 😆",
                "Well played Russia. They were never going to defeat US in a military war. Paying for a Russian Asset to bury the US economy 4 feet under though...",
                "Can anyone explain this like they’re talking to a five year old for me? Uh uh uh it’s so I explain it to my 5 year old it’s not for me clearly I understand what this means.",
                "Let me guess. Market going back down, it's Biden fault again until they go back up for a day. Then it's Rumps market. Until the downfall again and then it's Biden again. \n\nNothing shows accountability, like lack of accountability. \n\n8647.",
                "Trump doesn’t have the cards, but he went all in on a mind numbingly transparent and idiotic bluff, and he lost. Like with all things Trump, he’s left someone else with the bill (in this case the American taxpayers). He still gets to collect bribes with impunity thanks to the corrupt MAGA party that refuses to hold him accountable. ",
                "We're , we're not even 6 months in. ",
                "Can we use Experian Boost to get our credit rating back up where it belongs?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Yellowstone Park officials take action: Grizzly bear euthanized for repeatedly accessing trash",
            "external_url": "https://www.denver7.com/science-and-tech/animals-and-insects/yellowstone-park-officials-take-action-grizzly-bear-euthanized-for-repeatedly-accessing-trash",
            "upvotes": 862,
            "date": "05/19/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/41176df/2147483647/strip/true/crop/2048x1075+0+230/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F14%2F88%2F5a56c5f14717869fa31704a1acb5%2F54521718168-6343a39264-k.jpg",
            "top_comments": [
                "R.I.P Yogi, too smart for his own good.",
                ">The bear, weighing approximately 400 pounds, had overturned multiple large, bear-resistant dumpsters and accessed human food and trash at popular locations, including Old Faithful, the Nez Perce Picnic Area, and the Midway Geyser Basin parking lot.\n\n\"There is considerable overlap between the intelligence of the smartest bears and the dumbest tourists.\"\n\n-Yosemite National Park ranger, attributed.",
                "I feel like the trash is the bigger problem than the bear. That was his home. Not ours and not our trash’s.",
                "What about the dirty humans creating the trash.",
                "So they killed a bear for doing bear shit?",
                "ITT alot of people who underestimate Grizzly Bears, apparently",
                "Something something a succulent meal",
                "Are the job cuts to park rangers to blame for this? Should the trash not be regularly emptied? Are they unable to empty it as frequently with less rangers? If so, glad to know that even animals are being killed because of this dumb shit.",
                "That's kinda messed up.  \nBear just finds a source of great food  delivered to his home by people wanting see bears doing bear things only to be shot dead by those people for doing bear things.",
                "So sad.  Necessary, but so damn sad.  That bear did nothing wrong."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "France to open new high security prison in French Guiana",
            "external_url": "https://www.bbc.com/news/articles/c7v7n81emy3o",
            "upvotes": 370,
            "date": "05/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/cb38/live/1485c920-349c-11f0-ad6d-67c1c2fdfbf5.jpg",
            "top_comments": [
                "Didn't they do that like 100 years ago already, only for some dude to escape and write a book about it, which then turned into the movie *Papillon*, lol",
                "Related note: since French Guiana is part of France and France is part of the European Union, the largest national park in the European Union isn’t in Europe",
                "we already tried that 100 years ago please stop",
                "Lads, it's fine - it ain't a colonial prison coz itsanintegralpartoffrance",
                "South American mega prisons... So hot right now",
                "Local leper colonies purchase cigars to prepare for influx of escapees.",
                "Wait, with how French Guyana is part of France, isn't this just France opening a new prison in France?  Woopity?",
                "I like how France can go from a darling of the Western world one moment to completely tone deaf moves so quickly. They keep things spicy.",
                "In 2009 I was visiting France with my bf at the time to see his family. On a drive from Lyon to Bourges we passed a large castle/fortress-like building on the top of a hill, and I asked what it was. His dad said it was a prison. I replied, \"oh, is that where all the murderers are?\" he kind of laughed in reply, saying not really; that murder was pretty uncommon in that part of France. He kind of made fun of me a little bit, since I was from the US and was used to murders and violence as just being a part of life and not some rare and shocking occurrence. \n\nKind of a long and round-about way of saying that the France's need for a new high security prison is news to me, assuming the intent is to send convicts from mainland France there is the intent.",
                "instead of FG, why not island of Mayotte?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Regeneron to buy bankrupt DNA testing firm 23andMe for $256 million",
            "external_url": "https://www.cnn.com/2025/05/19/business/regeneron-23-and-me?utm_medium=social&utm_source=igCNN&utm_content=2025-05-19T12%3A31%3A59",
            "upvotes": 9041,
            "date": "05/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/231207110123-23andme-testing-kit-file.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Delete Your Data From 23andMe\n\nhttps://www.nytimes.com/wirecutter/reviews/wirecutter-show-podcast-20250328-23andme-data-bankrupt/",
                "$256 million/15 million customers = $17.\n\nYour DNA is worth $17.",
                "Can't wait to fight my genetically upgraded evil clone, designed to replace me!!",
                "IMO the biggest miss with 23&Me is them not buying Ancestry.com, etc, to help build a collaborative genealogical chart system families could use and edit, or expanding on it with local family related news and documents available throughout the generations to better piece together familial history and even photos, etc.\n\nAside from selling biological info to ad companies or insurers or other seedy profiteers, I don’t see why they couldn’t have made money from a reduced priced option for current members / entrants to access the “plus” member benefits or used the genetic data and self reports, combined with localized double blind studies ofc, to confirm data trends that could be profitable while also not selling discreet information.\n\nI feel like they just didn’t broaden the definition of what was possible under their company’s umbrella.",
                "I never did a DNA test because I always felt it was going to be used for transactional reasons. This is exactly why; Your information is whoever buys it.",
                "I sent my DNA in knowing all the pitfalls (to Ancestry, not 23andMe, but same thing) because I'm adopted and wanted to find my biological family. I actually found them, and now have a solid relationship with my full biological brother, which has been well worth any horrors that might occur from my DNA being in a database. Otherwise, I wouldn't do this.",
                "Ah, good thing it didn’t get sold to an unscrupulous buyer that engages in securities fraud, price fixing, and has ties to the current administration. \n\nOh wait.  \n\nIf you haven’t deleted your data from 23andMe, do it now.",
                "Regeneron is the biggest company that created the monoclonal antibody treatment that was used as a post-infective treatment for COVID. Trump himself got it when he was infected. \n\nThey were also the recipient of close to half a billion in funding from Trump's Operation Warp Speed, the government-funded race to come up with vaccines and treatments for COVID.\n\nThe CEO and the company were treated quite preferentially by Ron DeSantis during the Biden years. \n\nSo we are talking strong ties to Trump and the GOP. It's not entirely out of the realm of possibility for them to sell the data inappropriately for unethical ends. Like HHS' contemplated autism DB. Thiel's Palantir. DOGE for whatever dystopic reason. ICE for a different dystopia. And of course, insurance companies.",
                "Ok, I guess I need to brace for the downvotes given the current comments here. \n\nHonestly, this is worlds better than an insurance company or some random tech startup with undescribed end goals, guys. This is a legitimate big pharmaceutical company who has a lot of R&D around genetic disease and has made a lot of therapeutic advances. They want the data to develop new therapies, probably ones for genetic based disease. Being the first to do this will make them so much money. That’s their goal here, I think. It’s new massively growing space in R&D. And this much genetic data is research treasure trove for them.\n\nThey are also going to have pre-designed protocols and standards when it comes to handling this data. I know people side eye big pharma (rightfully in most circumstances) but this is a much better outcome than many other situations.\n\nAm I saying don’t delete your data? No. Am I saying this is better than pretty much any other potential buyer? Absolutely.\n\nI also want to add one thing: All the stuff about Trump ties is wild. Pretty much every pharma company (and  many of the academic researchers that Trump is now black listing from NIH funding due to their coronavirus research) got Project Warp Speed funding during the pandemic. Monoclonal antibody treatment was an absolute scientific miracle. So were the other rapid vaccine developments during the pandemic. It saved so many lives.",
                "What are the downsides of them having our dna data. I keep seeing everyone saying delete it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Man handed suspended sentence over role in Blenheim Palace £4.8m gold toilet heist",
            "external_url": "https://www.theguardian.com/uk-news/2025/may/19/blenheim-palace-gold-toilet-heist-man-sentenced",
            "upvotes": 211,
            "date": "05/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8423dc512f2967ec57a909ab79467ba723007bcc/0_890_2449_1960/master/2449.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f5a2e942aa5fb324f4f20fddc36f689e",
            "top_comments": [
                "Stole the wrong golden toilet.",
                "They never found the guy that stole the toilet from our local police station. The detectives had nothing to go on.",
                "The other two guys who are awaiting trial really flushed their lives down the toilet.",
                "I thought the police said they had nothing to go on?",
                "They had to suspend the sentence.  All the evidence got wiped",
                "Disappointed to learn the culprits name isn’t Max Flush. :/",
                "I thought it was an actual gold toilet conferred upon the Duke of Marlborough by a grateful nation, but no:\n\n>[An Italian artist] created the sculpture – called “America” – to reflect the excesses of the art market and evoke the American dream of opportunity for all.",
                "glad to see the suspect is no longer on the loos.",
                "I was just a bit taken aback by the museum connecting it to the plumbing!  So it was a working toilet."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "South Florida woman facing $1.8 million ICE fine speaks out: \"Please have mercy\" - CBS Miami",
            "external_url": "https://www.cbsnews.com/miami/news/south-florida-woman-facing-1-8-million-immigration-fine-speaks-out-please-have-mercy/",
            "upvotes": 1885,
            "date": "05/19/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/17/2d9b8a3e-78b0-411e-8576-4a4074697124/thumbnail/1200x630/ed232a3a2a15950b21749c2bd81d68b5/1800-ivan-miami-springs-ice-fine-pkg-5-16-25.jpg?v=6df9366690ed146f169dd0670c453f91",
            "top_comments": [
                "1.8 million? \n\nHow is that not a cruel and unusual fine?",
                "Still have no idea why so many Hispanics voted for Trump. This whole ICE bullshit is a small horror.",
                "People like this are the vast majority of those trump wants to deport.  Decent human beings raising a family and contributing more to America than the entire trump family ever could. \n\nYes, he'll deport a few criminals.  He'll also deport citizens he'll claim are criminals.  In the long run he'll end up losing what greatness America ever had.",
                "How about fining people who employ undocumented workers millions of dollars? Of course we could never do that.",
                "If only she was a born a white South African than Trump would like her.",
                "[removed]",
                "I am pro immigration.  My father immigrated (legally) here from Canada and my husband and his family came here legally from Cuba.   I hate what the Trump admin is doing to immigrants.\n\nBUT\n\n\"Maria entered the U.S. through California in February 2005. Two months later, after failing to appear at a scheduled immigration hearing, she was ordered to leave the country.\"\n\nShe was given a chance to stay and yet she failed to appear and was told to leave 20 years ago.  I don't agree with the fine, it's ridiculous.  But \"The fine was issued under the [Immigration and Nationality Act of 1952](https://www.uscis.gov/laws-and-policy/legislation/immigration-and-nationality-act), which permits the government to impose daily penalties on undocumented individuals who ignore removal orders.\".\n\nI feel bad for her but she could have followed the system, attended the hearings and followed the direction she was given.  Now she wants mercy because she doesn't want to leave her children and go back to Honduras.  All of this could have been avoided by showing up for the hearing in 2005.  I'm not unsympathetic but when you hear about legal immigrants being denied due process and being held for having a fucking opinion that Trump doesn't like, this seems more of a her problem.",
                "They are trying to get her to leave. Having that large a fine on the books kills your credit and will make things difficult for you.",
                "[removed]",
                "A mother of two with no criminal record? Sure, makes sense.\n\nWhy do I never hear about Trump handling all the worst hardened criminals like he said he would?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Tornado warnings delayed because of DOGE cuts",
            "external_url": "https://www.mesoscalenews.com/p/tornado-warnings-delayed-because",
            "upvotes": 33197,
            "date": "05/19/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbf1204d0-dd21-493d-b55a-0394aebc6880_1800x2250.jpeg",
            "top_comments": [
                "**Key facts before the politics start flying:**\n\n* **What happened** – A nocturnal tornado outbreak late 17 May killed at least 27 people across Kentucky and Missouri (18 of them in Laurel County, KY). Radar‐based debris signatures appeared before midnight, but the first *official* warnings for parts of the path weren’t pushed until minutes after circulation was already on the ground.\n\n* **Why the gap matters** – For night-time storms you’re asleep until a phone alert blares. Even a 5- to 10-minute lag can be the difference between getting to a basement and dying in bed.\n\n* **Staffing reality** – The Jackson, KY forecast office that covers Laurel County has been running 31 % below its authorised staffing since DOGE-mandated cuts early this year. The overnight forecaster position—whose only job is to watch radar while everyone else sleeps—was eliminated in April. Nearly half of NWS offices now have 20 %+ vacancy rates, according to an Associated Press analysis.\n\n* **Warnings on the night** – Because the office can’t staff 24/7 anymore, an on-call meteorologist had to remote-log-in when rotation ramped up. That start-up window accounts for the delay you see in the warning logs.\n\n* **Experts warned this would happen** – Meteorologists and the employees’ union flagged the risk in February; The NY Times, PBS, and WaPo all ran pieces in the past month on how the same budget axe was forcing eight forecast offices—including Jackson—to drop round-the-clock coverage.\n\n**TL;DR**\n\nThe science isn’t broken; the funding pipeline is. Cut the people who keep eyes on radar at 11 p.m. and you buy tragedy at midnight.",
                "But think of the money nobody saved.",
                "Watched a YouTuber stream these and he questioned at times why tornado warnings were not being issued…oof.",
                "It’s worse than just warnings (which is awful to be clear). \n\n[Weather balloon cuts](https://www.axios.com/2025/03/21/nws-layoffs-cuts-weather-balloons-forecasts) are also ongoing. \n\nWhat do weather balloons do? They give critical live data as they ascend through the atmosphere. What does that tell us, why should I care what the wind speed or temperature is 18,000 feet up? \n\nBecause that feeds *directly* into weather models that are used to predict these kinds of events. \n\nSo they’re *literally* making our forecasts harder and shittier.\n\nEdit: if you want to help the national weather service, you can look into volunteering to collect weather data through [CoCoRaHS](https://www.weather.gov/ilm/cocorahs).",
                "That's just good business right there! The national weather service costs every taxpayer roughly $4 a year. Thanks to the heroes at DOGE, that number will surely come down to something more palatable, and all it's costing us are people's lives and livelihoods! Truly the art of the deal!\n\n/s in case it wasn't obvious",
                "That's the point. Reduce the trust people have in national services so they practically *beg* them to be privatized.\n\nAlso, NOAA had the nerve to call trump out over the hurricane. And that's some shit he just won't let stand.",
                "And I had someone telling today “There’s an app! And it’s automatically updated you don’t need those employees! The people who died just didn’t check the app!”",
                "Reminder that part of P2025 was making the weather information that the government provides for free privatized. They want that information to be provided to companies for free so those companies can turn around and offer it as a paid service. \n\nPeople would not receive alerts for dangerous weather anymore unless they paid for it.",
                "Trump's American Bloodbath is underway.",
                "27 lives that may have been saved if they had more warning."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Spain orders Airbnb to block nearly 66,000 holiday rental listings over rule violations",
            "external_url": "https://apnews.com/article/airbnb-spain-rental-listing-a91e605f6342db1b169d4f9d1681e9d4",
            "upvotes": 653,
            "date": "05/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I've been a fan of AIRBnB for a long time, and I like the idea of people being able to rent out a home, their own or another, for a short period of time...\n\nBut it's gotten too commercialized.\n\nSites like these should only be allowing individuals, not businesses, who normally reside in those countries to rent out their primary, or perhaps a secondary residence for short term rentals.\n\nPeople shouldnt have 3+ properties they are renting out short term.  You want to have 3+ properties, long term rentals only for anything above your primary +1.\n\nI still use AIRBnB, but hotel pricing has come a long way in the past few years, where now it's a toss up if I look at Airbnb or hotels when I'm on vacation.  So it isn't even the savings it used to be which drove me to it in the first place.",
                "Hate airBNBs The ruin quiet neighborhoods and are mostly corporate owned",
                "Good.\n\nTourism is a big part of the Spanish economy but it has l been kidnapped by capitalist profiteers who will do everything to earn an extra penny.\n\nThey are squeezing out the liveability of the big city's and making live miserable for both the citizens as wel as the tourists.",
                "It's not enough. To solve the housing crisis you need to ban corporations from buying, owning and renting homes, as well as institute a cap on property ownership (imo no more than 2 properties per person), and heavily tax short term rentals. Just going after AirBnB is like putting a bandaid on an exposed bone ",
                "At this point in time, fuck second home ownership and fuck any entity that owns an apartment that is not a person.\n\nUnfettered capitalism has failed us in one of the most important rights and human need. Nationalize the whole housing market. Let each family unit have a standard house, provided by the government. And absolutely no ownership. You get a house when you become an adult, you leave it for another person when you die. Inheritance is the root of all evil, as it allows inter-generational wealth to accrue and wealth disparity to persist. It allows the most evil and cruel persons to think they're so clever, when all they had was lucky to be born to rich fucks.\n\nNationalized housing, 100% inheritance tax. Reset the system, it's not working for us people.\n\nI'll expand the comment: everywhere I see around me, in Barcelona (one of the affected cities in the article), people pay more than 100% of a single salary for rent (forget about buying, you can't save for the down-payment). Commerces are strangled by absurd renting costs and have to close. The neighbourhood I live in has a continuously rotating procession of opening and closing shops that cannot really afford staying open when everyone is poorer and the rents are sky high. The only shops that can stay are housing agencies and franchise boutiques or cafeterias. It's very saddening.\n\nMany of my friends have had to abandon Barcelona, gentrified away from the places they were born.\n\nAnd the only ones gaining anything now are the landlords. Fuck them all, they're just parasites. Appropriate them all, without paying. If there was any justice, they would also receive the Marie Antoinette treatment for making everyone's life miserable and painful."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "CBS News chief steps down amid tension over Trump lawsuit",
            "external_url": "https://www.nbcnews.com/business/media/cbs-news-chief-steps-down-over-trump-tensions-rcna207700",
            "upvotes": 329,
            "date": "05/19/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-wendy-mcmahon-mb-1605-cf1d81.jpg",
            "top_comments": [
                "Super fun to watch all the news orgs capitulate to the fascist fuck. I'm sure this bodes well for our future. 4 months in and you can see just how primed the wealthy are to abandon entire groups of people and democracy itself to ensure they keep making money.",
                "From the article:\n\n//\nThe president and CEO of CBS News said Monday that she is stepping down, marking the second high-profile departure from the organization within the past month as it contends with a $20 billion lawsuit from President Donald Trump and a high-profile merger.\n\nWendy McMahon, who took over the stalwart news brand in 2023, said in a memo that her time atop the company has been \"a privilege and joy,\" but that the past few months had been \"challenging.\"\n\n\"It’s become clear that the company and I do not agree on the path forward,\" McMahon wrote in a memo to CBS News staff. \"It’s time for me to move on and for this organization to move forward with new leadership.\"\n//",
                "Another brick in the wall against fascism has crumbled.",
                "There goes the reporting, what’s left? A scattered, frayed court system. Coming Soon Amerirussa 🤷‍♂️",
                "Last night on Last Week Tonight.",
                "I'm not even sure what the main problem is with mainstream news organizations are, cowardice, greed, avarice, or stupidity.\n\nAt this point I'm convinced we as a society are better off without giant corporations controlling all aspects of news and entertainment. \n\nBreak them all up.",
                "Another example as to why independent media is important",
                "Paid off to stop reporting facts and retire?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "30-year Treasury yield jumps above 5% after Moody's downgrades U.S. credit rating",
            "external_url": "https://www.cnbc.com/2025/05/19/us-treasury-yields-moodys-downgrades-us-credit-rating.html",
            "upvotes": 2793,
            "date": "05/19/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136194-17455098532025-04-24t154347z_1903305251_rc2e4eazuveh_rtrmadp_0_usa-stocks.jpeg?v=1745598876&w=1920&h=1080",
            "top_comments": [
                "i'm too poor to understand what this means",
                "Markets are down and treasury yields are up. That's a very bad sign.\n\nThe US is getting hit with a \"moron penalty\" from global investors.",
                "And Bessent “doesn’t care.” 🙄 Mother fucker.",
                "I remember when it was an alleged HUGE DEAL when the US rating first dropped in 2011. The big corporate media alarmist reporting was non-stop. All the talking heads were blathering. Everything was just a way bigger deal when Obama was in office for ::reasons:: 😆",
                "Well played Russia. They were never going to defeat US in a military war. Paying for a Russian Asset to bury the US economy 4 feet under though...",
                "Can anyone explain this like they’re talking to a five year old for me? Uh uh uh it’s so I explain it to my 5 year old it’s not for me clearly I understand what this means.",
                "Let me guess. Market going back down, it's Biden fault again until they go back up for a day. Then it's Rumps market. Until the downfall again and then it's Biden again. \n\nNothing shows accountability, like lack of accountability. \n\n8647.",
                "Trump doesn’t have the cards, but he went all in on a mind numbingly transparent and idiotic bluff, and he lost. Like with all things Trump, he’s left someone else with the bill (in this case the American taxpayers). He still gets to collect bribes with impunity thanks to the corrupt MAGA party that refuses to hold him accountable. ",
                "We're , we're not even 6 months in. ",
                "Can we use Experian Boost to get our credit rating back up where it belongs?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Yellowstone Park officials take action: Grizzly bear euthanized for repeatedly accessing trash",
            "external_url": "https://www.denver7.com/science-and-tech/animals-and-insects/yellowstone-park-officials-take-action-grizzly-bear-euthanized-for-repeatedly-accessing-trash",
            "upvotes": 865,
            "date": "05/19/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/41176df/2147483647/strip/true/crop/2048x1075+0+230/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F14%2F88%2F5a56c5f14717869fa31704a1acb5%2F54521718168-6343a39264-k.jpg",
            "top_comments": [
                "R.I.P Yogi, too smart for his own good.",
                ">The bear, weighing approximately 400 pounds, had overturned multiple large, bear-resistant dumpsters and accessed human food and trash at popular locations, including Old Faithful, the Nez Perce Picnic Area, and the Midway Geyser Basin parking lot.\n\n\"There is considerable overlap between the intelligence of the smartest bears and the dumbest tourists.\"\n\n-Yosemite National Park ranger, attributed.",
                "I feel like the trash is the bigger problem than the bear. That was his home. Not ours and not our trash’s.",
                "What about the dirty humans creating the trash.",
                "So they killed a bear for doing bear shit?",
                "ITT alot of people who underestimate Grizzly Bears, apparently",
                "Something something a succulent meal",
                "Are the job cuts to park rangers to blame for this? Should the trash not be regularly emptied? Are they unable to empty it as frequently with less rangers? If so, glad to know that even animals are being killed because of this dumb shit.",
                "That's kinda messed up.  \nBear just finds a source of great food  delivered to his home by people wanting see bears doing bear things only to be shot dead by those people for doing bear things.",
                "So sad.  Necessary, but so damn sad.  That bear did nothing wrong."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Regeneron to buy bankrupt DNA testing firm 23andMe for $256 million",
            "external_url": "https://www.cnn.com/2025/05/19/business/regeneron-23-and-me?utm_medium=social&utm_source=igCNN&utm_content=2025-05-19T12%3A31%3A59",
            "upvotes": 9044,
            "date": "05/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/231207110123-23andme-testing-kit-file.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Delete Your Data From 23andMe\n\nhttps://www.nytimes.com/wirecutter/reviews/wirecutter-show-podcast-20250328-23andme-data-bankrupt/",
                "$256 million/15 million customers = $17.\n\nYour DNA is worth $17.",
                "Can't wait to fight my genetically upgraded evil clone, designed to replace me!!",
                "IMO the biggest miss with 23&Me is them not buying Ancestry.com, etc, to help build a collaborative genealogical chart system families could use and edit, or expanding on it with local family related news and documents available throughout the generations to better piece together familial history and even photos, etc.\n\nAside from selling biological info to ad companies or insurers or other seedy profiteers, I don’t see why they couldn’t have made money from a reduced priced option for current members / entrants to access the “plus” member benefits or used the genetic data and self reports, combined with localized double blind studies ofc, to confirm data trends that could be profitable while also not selling discreet information.\n\nI feel like they just didn’t broaden the definition of what was possible under their company’s umbrella.",
                "I never did a DNA test because I always felt it was going to be used for transactional reasons. This is exactly why; Your information is whoever buys it.",
                "I sent my DNA in knowing all the pitfalls (to Ancestry, not 23andMe, but same thing) because I'm adopted and wanted to find my biological family. I actually found them, and now have a solid relationship with my full biological brother, which has been well worth any horrors that might occur from my DNA being in a database. Otherwise, I wouldn't do this.",
                "Ah, good thing it didn’t get sold to an unscrupulous buyer that engages in securities fraud, price fixing, and has ties to the current administration. \n\nOh wait.  \n\nIf you haven’t deleted your data from 23andMe, do it now.",
                "Regeneron is the biggest company that created the monoclonal antibody treatment that was used as a post-infective treatment for COVID. Trump himself got it when he was infected. \n\nThey were also the recipient of close to half a billion in funding from Trump's Operation Warp Speed, the government-funded race to come up with vaccines and treatments for COVID.\n\nThe CEO and the company were treated quite preferentially by Ron DeSantis during the Biden years. \n\nSo we are talking strong ties to Trump and the GOP. It's not entirely out of the realm of possibility for them to sell the data inappropriately for unethical ends. Like HHS' contemplated autism DB. Thiel's Palantir. DOGE for whatever dystopic reason. ICE for a different dystopia. And of course, insurance companies.",
                "Ok, I guess I need to brace for the downvotes given the current comments here. \n\nHonestly, this is worlds better than an insurance company or some random tech startup with undescribed end goals, guys. This is a legitimate big pharmaceutical company who has a lot of R&D around genetic disease and has made a lot of therapeutic advances. They want the data to develop new therapies, probably ones for genetic based disease. Being the first to do this will make them so much money. That’s their goal here, I think. It’s new massively growing space in R&D. And this much genetic data is research treasure trove for them.\n\nThey are also going to have pre-designed protocols and standards when it comes to handling this data. I know people side eye big pharma (rightfully in most circumstances) but this is a much better outcome than many other situations.\n\nAm I saying don’t delete your data? No. Am I saying this is better than pretty much any other potential buyer? Absolutely.\n\nI also want to add one thing: All the stuff about Trump ties is wild. Pretty much every pharma company (and  many of the academic researchers that Trump is now black listing from NIH funding due to their coronavirus research) got Project Warp Speed funding during the pandemic. Monoclonal antibody treatment was an absolute scientific miracle. So were the other rapid vaccine developments during the pandemic. It saved so many lives.",
                "What are the downsides of them having our dna data. I keep seeing everyone saying delete it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "France to open new high security prison in French Guiana",
            "external_url": "https://www.bbc.com/news/articles/c7v7n81emy3o",
            "upvotes": 371,
            "date": "05/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/cb38/live/1485c920-349c-11f0-ad6d-67c1c2fdfbf5.jpg",
            "top_comments": [
                "Didn't they do that like 100 years ago already, only for some dude to escape and write a book about it, which then turned into the movie *Papillon*, lol",
                "Related note: since French Guiana is part of France and France is part of the European Union, the largest national park in the European Union isn’t in Europe",
                "we already tried that 100 years ago please stop",
                "Lads, it's fine - it ain't a colonial prison coz itsanintegralpartoffrance",
                "South American mega prisons... So hot right now",
                "Local leper colonies purchase cigars to prepare for influx of escapees.",
                "Wait, with how French Guyana is part of France, isn't this just France opening a new prison in France?  Woopity?",
                "I like how France can go from a darling of the Western world one moment to completely tone deaf moves so quickly. They keep things spicy.",
                "In 2009 I was visiting France with my bf at the time to see his family. On a drive from Lyon to Bourges we passed a large castle/fortress-like building on the top of a hill, and I asked what it was. His dad said it was a prison. I replied, \"oh, is that where all the murderers are?\" he kind of laughed in reply, saying not really; that murder was pretty uncommon in that part of France. He kind of made fun of me a little bit, since I was from the US and was used to murders and violence as just being a part of life and not some rare and shocking occurrence. \n\nKind of a long and round-about way of saying that the France's need for a new high security prison is news to me, assuming the intent is to send convicts from mainland France there is the intent.",
                "instead of FG, why not island of Mayotte?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Man handed suspended sentence over role in Blenheim Palace £4.8m gold toilet heist",
            "external_url": "https://www.theguardian.com/uk-news/2025/may/19/blenheim-palace-gold-toilet-heist-man-sentenced",
            "upvotes": 206,
            "date": "05/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8423dc512f2967ec57a909ab79467ba723007bcc/0_890_2449_1960/master/2449.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f5a2e942aa5fb324f4f20fddc36f689e",
            "top_comments": [
                "Stole the wrong golden toilet.",
                "They never found the guy that stole the toilet from our local police station. The detectives had nothing to go on.",
                "The other two guys who are awaiting trial really flushed their lives down the toilet.",
                "I thought the police said they had nothing to go on?",
                "They had to suspend the sentence.  All the evidence got wiped",
                "Disappointed to learn the culprits name isn’t Max Flush. :/",
                "I thought it was an actual gold toilet conferred upon the Duke of Marlborough by a grateful nation, but no:\n\n>[An Italian artist] created the sculpture – called “America” – to reflect the excesses of the art market and evoke the American dream of opportunity for all.",
                "glad to see the suspect is no longer on the loos.",
                "I was just a bit taken aback by the museum connecting it to the plumbing!  So it was a working toilet."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "South Florida woman facing $1.8 million ICE fine speaks out: \"Please have mercy\" - CBS Miami",
            "external_url": "https://www.cbsnews.com/miami/news/south-florida-woman-facing-1-8-million-immigration-fine-speaks-out-please-have-mercy/",
            "upvotes": 1880,
            "date": "05/19/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/17/2d9b8a3e-78b0-411e-8576-4a4074697124/thumbnail/1200x630/ed232a3a2a15950b21749c2bd81d68b5/1800-ivan-miami-springs-ice-fine-pkg-5-16-25.jpg?v=6df9366690ed146f169dd0670c453f91",
            "top_comments": [
                "1.8 million? \n\nHow is that not a cruel and unusual fine?",
                "Still have no idea why so many Hispanics voted for Trump. This whole ICE bullshit is a small horror.",
                "People like this are the vast majority of those trump wants to deport.  Decent human beings raising a family and contributing more to America than the entire trump family ever could. \n\nYes, he'll deport a few criminals.  He'll also deport citizens he'll claim are criminals.  In the long run he'll end up losing what greatness America ever had.",
                "How about fining people who employ undocumented workers millions of dollars? Of course we could never do that.",
                "If only she was a born a white South African than Trump would like her.",
                "[removed]",
                "I am pro immigration.  My father immigrated (legally) here from Canada and my husband and his family came here legally from Cuba.   I hate what the Trump admin is doing to immigrants.\n\nBUT\n\n\"Maria entered the U.S. through California in February 2005. Two months later, after failing to appear at a scheduled immigration hearing, she was ordered to leave the country.\"\n\nShe was given a chance to stay and yet she failed to appear and was told to leave 20 years ago.  I don't agree with the fine, it's ridiculous.  But \"The fine was issued under the [Immigration and Nationality Act of 1952](https://www.uscis.gov/laws-and-policy/legislation/immigration-and-nationality-act), which permits the government to impose daily penalties on undocumented individuals who ignore removal orders.\".\n\nI feel bad for her but she could have followed the system, attended the hearings and followed the direction she was given.  Now she wants mercy because she doesn't want to leave her children and go back to Honduras.  All of this could have been avoided by showing up for the hearing in 2005.  I'm not unsympathetic but when you hear about legal immigrants being denied due process and being held for having a fucking opinion that Trump doesn't like, this seems more of a her problem.",
                "They are trying to get her to leave. Having that large a fine on the books kills your credit and will make things difficult for you.",
                "[removed]",
                "A mother of two with no criminal record? Sure, makes sense.\n\nWhy do I never hear about Trump handling all the worst hardened criminals like he said he would?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Tornado warnings delayed because of DOGE cuts",
            "external_url": "https://www.mesoscalenews.com/p/tornado-warnings-delayed-because",
            "upvotes": 33202,
            "date": "05/19/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbf1204d0-dd21-493d-b55a-0394aebc6880_1800x2250.jpeg",
            "top_comments": [
                "**Key facts before the politics start flying:**\n\n* **What happened** – A nocturnal tornado outbreak late 17 May killed at least 27 people across Kentucky and Missouri (18 of them in Laurel County, KY). Radar‐based debris signatures appeared before midnight, but the first *official* warnings for parts of the path weren’t pushed until minutes after circulation was already on the ground.\n\n* **Why the gap matters** – For night-time storms you’re asleep until a phone alert blares. Even a 5- to 10-minute lag can be the difference between getting to a basement and dying in bed.\n\n* **Staffing reality** – The Jackson, KY forecast office that covers Laurel County has been running 31 % below its authorised staffing since DOGE-mandated cuts early this year. The overnight forecaster position—whose only job is to watch radar while everyone else sleeps—was eliminated in April. Nearly half of NWS offices now have 20 %+ vacancy rates, according to an Associated Press analysis.\n\n* **Warnings on the night** – Because the office can’t staff 24/7 anymore, an on-call meteorologist had to remote-log-in when rotation ramped up. That start-up window accounts for the delay you see in the warning logs.\n\n* **Experts warned this would happen** – Meteorologists and the employees’ union flagged the risk in February; The NY Times, PBS, and WaPo all ran pieces in the past month on how the same budget axe was forcing eight forecast offices—including Jackson—to drop round-the-clock coverage.\n\n**TL;DR**\n\nThe science isn’t broken; the funding pipeline is. Cut the people who keep eyes on radar at 11 p.m. and you buy tragedy at midnight.",
                "But think of the money nobody saved.",
                "Watched a YouTuber stream these and he questioned at times why tornado warnings were not being issued…oof.",
                "It’s worse than just warnings (which is awful to be clear). \n\n[Weather balloon cuts](https://www.axios.com/2025/03/21/nws-layoffs-cuts-weather-balloons-forecasts) are also ongoing. \n\nWhat do weather balloons do? They give critical live data as they ascend through the atmosphere. What does that tell us, why should I care what the wind speed or temperature is 18,000 feet up? \n\nBecause that feeds *directly* into weather models that are used to predict these kinds of events. \n\nSo they’re *literally* making our forecasts harder and shittier.\n\nEdit: if you want to help the national weather service, you can look into volunteering to collect weather data through [CoCoRaHS](https://www.weather.gov/ilm/cocorahs).",
                "That's just good business right there! The national weather service costs every taxpayer roughly $4 a year. Thanks to the heroes at DOGE, that number will surely come down to something more palatable, and all it's costing us are people's lives and livelihoods! Truly the art of the deal!\n\n/s in case it wasn't obvious",
                "That's the point. Reduce the trust people have in national services so they practically *beg* them to be privatized.\n\nAlso, NOAA had the nerve to call trump out over the hurricane. And that's some shit he just won't let stand.",
                "And I had someone telling today “There’s an app! And it’s automatically updated you don’t need those employees! The people who died just didn’t check the app!”",
                "Reminder that part of P2025 was making the weather information that the government provides for free privatized. They want that information to be provided to companies for free so those companies can turn around and offer it as a paid service. \n\nPeople would not receive alerts for dangerous weather anymore unless they paid for it.",
                "Trump's American Bloodbath is underway.",
                "27 lives that may have been saved if they had more warning."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Biden diagnosed with ‘aggressive form’ of prostate cancer",
            "external_url": "https://www.cnn.com/2025/05/18/politics/joe-biden-prostate-cancer",
            "upvotes": 52377,
            "date": "05/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2193208062.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Former US president Joe Biden has been diagnosed with prostate cancer, a statement from his office said on Sunday.\n\n>Biden, 82, was diagnosed on Friday after he saw a doctor last week for urinary symptoms.\n\n>The cancer is characterised by a Gleason score of 9 with metastasis to the bone, his office said, meaning it is a more aggressive form of the disease.\n\n>Biden and his family are said to be reviewing treatment options, the statement said. The former president's office added that the cancer is hormone-sensitive, meaning it can likely be managed.\n\n>This is a developing story.\n\n>This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version.\n\n/saved you a click. Sad news.",
                "As someone who has had a father and a grandfather who were both diagnosed with early onset prostate cancer, my heart goes out to Biden and his family. A Gleason 9 score with bone involvement is not good news. \n\nProstate cancer typically is very slow growing and easily catchable in the early stages. However, every now and then there are some really nasty aggressive forms. Unfortunately, it sounds like the former president might be dealing with the latter. I’ll be praying for him.",
                "‪Fuck prostate cancer. Lost my dad and so many other family members to it. Regardless of your politics, don’t wish cancer on anyone. Prayers up Mr. President. ‬ may we one day have a cure for this awful disease.",
                "Biden has viewed cancer as one of the most important changes he can make in his position for the past decade. His experience with losing Beau clearly made it a health policy focus, and it’s reflected in the research programs he helped establish and re-establish through the Cancer Moonshot effort. \n\nI hope he has the opportunity to benefit from the care he helped enable.",
                "Fuck cancer.  I lost my mom to it and I would give my own life to have taken away the pain and degeneration she faced in her final year.  \n\nI hope for the best for Biden and his treatment, and my heart goes out to the whole Biden family.",
                "I'm still recovering from having my prostate removed last Wednesday, due to prostate cancer with the score of Gleason 7.  I'm still in that awful period where I have to wear a catheter. I just got the pathology results that showed the surgeon got it all and hopefully there  should be none remaining in the body. Best day of my life. Biden's Gleason 9 is a pretty poor diagnosis. I wish him well and a positive result.",
                "Seems like the writing’s on the wall and wish we could skip the shitshow that’ll inevitably ensue",
                "That’s rough. Absolutely fuck cancer.",
                "The hate on FoxNews page is absolutely horrible.\n\nThe nicest comment was something along the lines of, \"horrible president, don't wish this on him, but he might deserve it.\"\n\nThe fuck is wrong with these people.",
                "As someone who just had their prostate removed due to cancer…Fuck cancer. I was diagnosed in February, so it was caught early and I should make a full recovery. Go get your PSA checked gents. I hope Biden makes it through this."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/19/2025 16:11:04 UTC"
}