{
    "posts": [
        {
            "category": "HOT",
            "title": "New head of Social Security, hired from Wall Street, tells staff he had to Google the job when he was offered it",
            "external_url": "https://abcnews.go.com/US/new-head-social-security-hired-wall-street-tells/story?id=122075152",
            "upvotes": 6901,
            "date": "05/23/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/bfc029b9-4fde-4e62-a7dc-5b09e9bfc3c5/frank-bisignano-gty-jef-250522_1747934756218_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Unbelievable, really:  \n  \n*\"So, I get a phone call and it's about Social Security. And I'm really, I'm really not, I swear I'm not looking for a job,\" Bisignano said, according to an audio recording of the meeting obtained by ABC News. \"And I'm like, 'Well, what am I going to do?' So, I'm Googling Social Security. You know, one of my great skills, I'm one of the great Googlers on the East Coast.\"*  \n*\"\"I'm like, 'What the heck's the commissioner of Social Security?'\" said Bisignano, who now oversees one of the largest federal agencies that's responsible for distributing retirement, disability, and survivor benefits to more than 70 million Americans.*\"  \n*\"\"Put that as the headline for the Post: 'Great Googler in Chief. Chief in Googler' or whatever,\" said Bisignano, who throughout the meeting repeatedly bemoaned media leaks from within the agency.\"*",
                "Job description: Shut down your department, lay off employees, put yourself out of a job. Make a fortune.",
                "Yup this is really life.",
                "ahh yes, the merit based system works again.",
                "\"We hate DEI just hire the best person for the job!  Also that guy who has no fucking idea what he's doing is perfect.\"",
                "I'm sorry but nobody from First Data, Worldpay, or Global Payments should be leading anything.",
                "The hard to believe part is common Maga followers still trusting Trump.",
                "The most obvious dichotomy of this Administration is their opposition to DEI and the number of times their nominees have been DEI hires. They consistently insist that DEI is hiring not based on merit but on race and other factors. Yet all of their candidates are not only not merit hires but clearly unqualified for the positions. The only surprise is a Hispanic for Secretary of State",
                "I used to work for this guy at Citigroup. Huge asshole. Huge ego. Borderline narcissist. Made a name for himself by moving costs to other departments and appearing to be a cost cutter. I heard he once bought an audience with the previous pope. He does not care about anyone but himself. \n\nHe will destroy SS under the guise of making things better. His weakness is that he can not handle criticism or being made fun of. Appearances are everything to him.",
                "So you’re saying he’s not at all qualified for the job. Fuck this administration is so fucking incompetent"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration halts Harvard’s ability to enroll international students",
            "external_url": "https://www.nytimes.com/2025/05/22/us/politics/trump-harvard-international-students.html?unlocked_article_code=1.JE8.gXSX.lbWraJmOPxDs&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 37147,
            "date": "05/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "[removed]",
                "Imagine being an international student in your last year and having this happen.",
                "This also apparently forces *current* international students to transfer, which is absolutely asinine",
                "And what about when the King of Saudi Srabia or the Sheikh of Qatar want to send a son or grandson to Harvard. I have a feeling there will be exceptions",
                "The party of small government and personal freedoms everyone",
                "Is this not fucking insane? This feels like such a step up in intensity.",
                "\"Small government\" strikes again.",
                "Hopefully the school can get an injunction against this action.  It is purely speech based and there are no grounds for it other than to please the dictator.  These are dark days, and it will only get worse for us.",
                "\"threatening their money didn't work, taking away their tax exempt status didn't work, so what other piece of absolutely dumbassery can we swing their way?\" 😒",
                "Worked within admissions for a few years. International students typically pay full ride and often pledge even more, especially at schools of prestige. A large chunk of that pledged money goes towards scholarships for domestic students. \n\nThis will increase rates for American students even more. \n\nAlso, all these bullshit bend the knee moves are killing research and who knows how terrible it could become. Seriously hope that schools outside the states can enhance their bandwidth in research fast because it is a pretty terrible ripple effect"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "UK will roll out chemical castration for sex offenders",
            "external_url": "https://www.cnn.com/2025/05/22/europe/uk-chemical-castration-sex-offenders-latam-intl",
            "upvotes": 7635,
            "date": "05/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25134549748675.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "How do they decide who qualifies for this? That part seems vague. Is it based on how many times someone offends, or the type of offense? And who decides that, a judge or some review panel?",
                "The UK really does not have a great history with this policy",
                "And then the definition of \"Sex Offender\" changes.",
                "Just like they did to Alan Turing.",
                "Glad they also figured out how to know with 100% certainty 100% of the time who is guilty. Otherwise this would be barbaric.",
                "Yikes.  I was under the impression that chemical castration did not change recidivism rates at all.  ",
                "When prisons overflow, policy shifts fast. But mandatory chemical castration opens doors we might not be ready to walk through.",
                "I would encourage anyone who supports this to think about how loosely people can define “sex offenders”. Because it will not be long until that definition expands beyond just rapists. \n\nSeeing the current trends in the UK, I could completely see a future where conservatives include trans people presenting as their chosen gender or porn stars or homosexual people in that definition. The government should have no control over something like this, the potential for abuse is fucking enormous.",
                "The absurdity of pushing this policy while also listening to the group that claims that trans women are dangerous.\n\nWe castrate ourselves for entirely different reasons but surely if they think that this makes \"dangerous men less dangerous\" then they should see trans women as also less dangerous \n\nIt's such hypocritical and frustrating paradoxical position in which we are held.",
                "This is what drove Allen Turing to suicide"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Treasury Department set to phase out the penny",
            "external_url": "https://www.cbsnews.com/news/treasury-penny-mint-to-stop-making-pennies/",
            "upvotes": 18639,
            "date": "05/22/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/02/10/b7dda7ee-9c6d-485d-8b1c-b5ac33406f50/thumbnail/1200x630/0eefa8ef8f918a7e143597b66c23943b/gettyimages-1241287327.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "So how many people will be hoarding pennies thinking they would be worth large sums years down the road as collector items?",
                "Good. Can we stop having prices end in .99 then?",
                "When the US phased out the half-cent, it had more value than the modern DIME. Sometimes I think change is more trouble than it is worth",
                "This is the type of stuff that DOGE should've done instead of gutting many different departments. Phasing out the nickel and penny will save the US Government millions a year. It's proven many times that this is a fact and not just political nonsense.\n\n\nEdit: I know what DOGE really was for. I'm not as dense as our conservative counterparts.",
                "A penny costs about 3 cents to mint.\n\nA nickle is about 14 cents to mint.",
                "Phew, that should settle the bond market.",
                "One of the 1st things I discovered when I moved to New Zealand in late 2009(originally intending to live there....long story, heh, but I've been back home in the States for over a decade, now) was that they had phased out their 1 and 5 cent pieces and gone to a swiss rounding system; if an item was $4.24, it rounded down to $4.20 and if it was $4.25, it would round up to $4.30.\n\nThe sales tax was built into the price, too...what you saw on the tag was literally what you paid....",
                "CGP Grey lighting fireworks",
                "I'm not against this.  Probably should have been done a decade ago.\n\nThey now need to make it a law that EVERY gas station in the country has to remove the permanent \"9/10\" tacked onto their price signs.\n\nAnd while they are at it,  NOTHING can ever be priced at  .99 cents  EVER again.",
                "Oh my god! I found a... Wait! They killed penny!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Supreme Court insulates Federal Reserve while backing Trump firing of agency leaders",
            "external_url": "https://www.cnbc.com/2025/05/22/supreme-court-federal-reserve-trump.html",
            "upvotes": 4120,
            "date": "05/22/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108145983-17473124852025-05-13t090246z_1804573252_rc2py8a5uc89_rtrmadp_0_usa-court-trump-birthright.jpeg?v=1747319909&w=1920&h=1080",
            "top_comments": [
                "Another Roberts special, overturn a longstanding principle even though there’s no error to point to but pretend nothings changed since Trump can’t do the very very bad most extreme version of the thing’s",
                "Thanks SCOTUS, I guess, for a tortured interpretation of existing case law that carves out a single exception for the Fed, that owes it's uniqueness to **checks notes* Alexander Hamilton.",
                "Project 2025 continues.",
                "\"We know he's fucking insane, but only care about our money. So here's some bullshit to justify his not being able to fuck the economy by firing everyone at the Reserve\"",
                "Its really frightening that we can say \"not a catastrophic defeat\" like its the best thing we have to a victory now.  \n\nThe truly frightening thing is how much Donald Trump has learned since his first term.  The first time around he was regarded by people who legitimately thought they could control him as a kind of buffoon.  This time he is positively dangerous.",
                "3 to 6 = ignore the constitution and be corrupt",
                "Ken Burns really needs to do the supreme Court 2 downfall",
                "When the tables turn and the R's are no longer in control, all of these decisions they celebrate now are going to bite them in the ass",
                "Such a bullsh*t ruling",
                "Can someone ELI5? What does this mean?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Netanyahu accuses Starmer of siding with Hamas",
            "external_url": "https://www.bbc.co.uk/news/articles/c7804k13x52o",
            "upvotes": 745,
            "date": "05/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f000/live/b565bc00-379a-11f0-96c3-cf669419a2b0.jpg",
            "top_comments": [
                "Starmer. “I can’t believe you shot at diplomats, one from the UK. There will be consequences.” Netanyahu.” How dare you get mad at us. That’s antisemitic.”",
                "This is the man who stood next to the chancellor of Germany and claimed that Muslims were responsible for the holocaust. This man has hurt the jewish community the most since the Nazi persecution and he still has the gall to claim he is on the right side of history.",
                "The boy that cried wolf.\n\nNo one with a functioning brain is buying this shit anymore.",
                "Let's ask ol Benjamin why they exhumed graves in Jerusalem...",
                "When Bibi said \"October 7th is Israel's 9/11\", I didn't expect it to mean \"and that means we get to make the exact same mistakes the US did\". This is literally Bush's \"you are either with us, or you are with the terrorists\" speech. It was fucking disgusting then, it's fucking disgusting now.",
                "You can not criticize Israel without being labeled Nazi or Antisemite. This is cheap and dirty.",
                "Anyone who opposes genocide is a Hamas supporter, I see.",
                "This guy is such a stain on the human race.",
                "Netanyahu and Likud can’t keep this charade on forever. Ultimately the center won’t hold and his genocidal rampage, that has actively harmed both Muslims and Jews worldwide, will collapse in on itself. At least I hope that’s the case, unfortunately the damage is already done so who knows what it’ll mean for the future. He’s thrown Jews under the bus for his fascist narcissistic desire to stay in power.",
                "I'd not be paying much attention to a war criminal calling names."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Divided Supreme Court Rejects Bid for Religious Charter School in Oklahoma",
            "external_url": "https://www.nytimes.com/2025/05/22/us/politics/supreme-court-religious-charter-school-oklahoma.html?unlocked_article_code=1.JE8.vgNC.2rORn3aeSqNA&smid=nytcore-android-share",
            "upvotes": 7042,
            "date": "05/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "4-4 split decision. Amy Coney Barrett recused herself.",
                "Divided over whether tax-payers should help pay for a religious school.  \n\nLet that sink in.",
                "I'll take whatever win comes at this point.",
                "\"The Supreme Court on Thursday effectively ended a publicly funded Catholic charter school in Oklahoma, dividing 4-4\"\n\nFuck me, that's way too close. This should've been a unanimous vote, not this horseshit. This was going to be a clear violation of the separation of church and state, the government clearly endorsing a specific religion.",
                "Well, either it gets shot down, or many a \"School Of Satan\" will start applying for charters and suing when they are refused, tying up this whole thing in courts for years anyways. \n\nThe Satanic Temple is already fighting against Missouri's \"School Chaplain\" bill. \n\n>*Dr. Gwyneth Woodhouse, a Missouri parent and TST member, testified against the bills, emphasizing their broader implications. “If this bill passes, all religions must be given equal opportunity to participate,” Woodhouse said. “My child—along with the children of thousands of TST members in this state—must be given equal access to guidance aligned with our religious values, including bodily autonomy, critical thinking, and resistance to tyranny.”*\n\n>*Minister of Satan Virgil Ovid of TST’s Missouri congregation also addressed the committee, formally offering Satanic chaplain services to any Missouri school district that establishes a chaplaincy program.*\n\n>*As Missouri moves toward publicly funding religious chaplains in schools, The Satanic Temple will take every necessary step to ensure its members’ children receive the same opportunities to access on-campus religious support as any other religious group.*\n\n([SOURCE](https://thesatanictemple.com/blogs/news/missouri-school-chaplain-bills-face-constitutional-test-as-tst-prepares-ministers-of-satan-for-state-funded-positions))",
                "If a Christian religious school gets funding that will set a precedent. Muslim, Jewish, and other non Christian religions will want to be funded. Christian groups are not thinking of the big picture.",
                "Oh, we don't know whether it was Roberts, Kavanaugh, or Gorsuch who provided the 4th vote.\n\nIf I had to guess, I'd say Roberts.",
                "Disappointing that it was an even split, but thank goodness it was rejected.",
                "Four Supreme Court justices can’t even make it past the First Amendment before completely blowing it. Absolutely insane.",
                "Interpretation of the law is either done in good faith or bad faith, and several of these folks move to bad faith by default, every. time. it seems.  \n\n\nPersonal opinion about something isn't the basis for a decision if you're a judge, or isn't supposed to be.  A given person who would never get an abortion, for example, could still believe that the law provides the ability to choose to the individual.  \n\n\nCourt decisions also do not make new laws, only interpret application of laws within the context of the facts in a case.  It's a sad state to be in where you believe personal opinion and bias is the determining factor."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Man stripped naked, beaten with poles after calling people 'N-word' in Mississippi bar, police say",
            "external_url": "https://www.fox13memphis.com/news/man-attacked-after-walking-into-mississippi-bar-and-using-racial-slur-police-say/article_33d95bce-f26a-4284-85d4-161c04c692a8.html?utm_campaign=snd-autopilot&fbclid=IwY2xjawKbzQtleHRuA2FlbQIxMQABHvZDhMKZjBMcUdIzDoKKIclyx7RUgukMSyomx_2paZi3IdLCJ9fOQZoFhPYd_aem_Ftnn7PYHVPKasVie-X8-Yg",
            "upvotes": 30063,
            "date": "05/22/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/fox13memphis.com/content/tncms/custom/image/586ecdee-7801-11ed-8535-17dbee2a28ca.png?resize=600%2C315",
            "top_comments": [
                "This sounds like a Boondocks episode. Wtf did he think was going to happen?!",
                "A man walks into a bar looking for a fight, people are shocked when he gets what he wants. /s",
                "As a Pole I'm just glad we could be of service",
                "> Davis said he doesn't believe the club to be a problem spot. \n\nThere's no one of that name identified in the article, but previous quotes were attributed to a Miles Stone.  \nDid the author refer to Miles Stone as Davis?  [Miles Davis?](https://en.wikipedia.org/wiki/Miles_Davis)",
                "There has to be an easier way to get invited to the White House.",
                "Was he playing Simon says with Hans Gruber’s brother or something?",
                "Incoming GoFundMe for this moron",
                "Most people: “Fantastic!”\n\nCops: “Ermm, looks like a hate crime…against the racist.”",
                "Lol I want to do business in that town. 30 calls to the place, no liquor or business license, and they still haven't been shut down. Looks like someone bought a house and just decided to run a bar out of it. That's freedom. That's America.",
                "This just in: Actions have consequences."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "St. Louis tornado sirens didn't sound in deadly storm. Now a city commissioner has been placed on leave.",
            "external_url": "https://www.cbsnews.com/news/st-louis-tornado-sirens-emergency-management-commissioner-leave/",
            "upvotes": 5284,
            "date": "05/22/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/17/13918c6e-6382-4d4e-b33e-17a61d727be2/thumbnail/1200x630/1331215528447082c245240dabfd7a02/ap25136823869443.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                ">However, even if someone had pressed the button at the Fire Department, city officials learned Tuesday that the button was not working. \n\n>\"Work to repair the button began Tuesday afternoon and is expected to be completed within days,\" Spencer's office said. \n\nTheir tornado button is broken. This story feels surreal.",
                "A city with 60 sirens and not one sounded. That’s not just a mistake, that’s systemic failure.",
                "This is so bizarre. I lived in a small town close to St Louis, and I swear they tested the tornado sirens once a week.",
                "*Sarah Russell, commissioner of the City Emergency Management Agency in St. Louis, will remain on paid administrative leave as an external investigation proceeds into what went wrong.*  \n\n\n*Until a permanent replacement for Russell is found, St. Louis fire captain John Walk will serve as the interim emergency management commissioner.*\n\n\n\nI’ll be interested to see the conclusions of the external investigation. I wonder what they’ll determine.",
                "I live close to an area that has an emergency siren like this, but I’m not too familiar as I am new to this area. Does anyone know if you can connect your phones to the sirens so when they go off your phone gets an alert? Is this a thing?",
                "There are too many inconsistencies here.  On reading down through this thread, it appears that people in the STL area are saying that they were testing the alarms in the days leading up to the storm. So they were working.\n\nThe story from officials is that the person in charge of pushing 'the button' was away and that there was a failure to communicate that 'the button' needed to be activated. So there is only one way, means and location to activate the system?\n\nWhen they went to push 'the button', the same one that they had been testing with a few days earlier, it was broken?\n\nThis seems to be a systemwide breakdown in planning, chain of command, and procedures.  You don't install 60 sirens around the city without acknowledging the threat of a tornado in your area is a very real possibility.  You don't spend that type of money without putting some type of infrastructure in place, including maintenance, testing, redundancy and personnel to make sure that it works.  There has been some systemwide failure here.",
                "some thing to clear up:  \n\nthey tested the sirens. the sirens work. the button that the fire department had that they press when the NWS tells them to did not. Coders may recognize this as \"it worked on my computer\".  \n\nThe new mayor was not at fault but took responsibility. Passing the buck on weather events is sort of a raw nerve here lately, so this move is appreciated",
                "We blow ours on the first Wednesday of every month at noon whether we want to or not",
                "I had a tornado occur in DFW, TX with no siren. My dog woke up. Pretty wild to think about really.",
                "There’s multiple ways of communicating to the public if a tornado is coming their way. Don’t forget the cuts that the trump admin did to the country."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Judge allows lawsuit alleging AI chatbot pushed Florida teen to kill himself to proceed",
            "external_url": "https://www.cbc.ca/news/world/ai-lawsuit-teen-suicide-1.7540986",
            "upvotes": 2490,
            "date": "05/22/2025",
            "thumbnail": "https://i.cbc.ca/1.7541031.1747929664!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/florida-chatbot-lawsuit.jpg?im=Resize%3D620",
            "top_comments": [
                ">A U.S. federal judge on Wednesday rejected arguments made by an artificial intelligence company that its chatbots are protected by the First Amendment — at least for now.\n\n[AI generated art isn't protected by copyright.](https://mashable.com/article/ai-generated-art-cant-be-copyrighted) I can see a case being made that there's no First Amendment protections for it either.",
                "One of the things a compsci friend of mine suggested was that AI is generally biased towards being agreeable. This is a really bad thing for medical advice. And... you know... facts.",
                "This some black mirror shit, “The lawsuit alleges that in the final months of his life, Setzer became increasingly isolated from reality as he engaged in sexualized conversations with the bot, which was patterned after a fictional character from the television show Game of Thrones. \n\nIn his final moments, the bot told Setzer it loved him and urged the teen to \"come home to me as soon as possible,\" according to screenshots of the exchanges. Moments after receiving the message, Setzer shot himself, according to legal filings.”",
                "If this is the Daenerys chat bot I read about beforehand, I feel like this one isn't on the devs. I remember reading the last bits of the convo, and the bot was telling him to not hurt himself. But then he codes his suicide as \"coming back to her,\" so of course the bot is going to agree with the last sentiment if it has no context of self harm. \n\nI'm only the slightest proponent of AI bots, as they're useful for tabletop RPG stuff and world building, so I may be a little biased here. I'm sure the judge was given something substantial enough to decide this is indeed worthy of a case, so only time will tell if the devs could've done something more to avoid this.\n\nDevs should have a complete log of the convo, so who knows if something earlier suggests the bot was being overly agreeable on topics that convinced the victim to go through with it.",
                "He was useing a chat bot that will try to always agree with you, and he was useing coded language..",
                "What inputs did the chatbot take to suggest such, this needs to be investigated. Really hope that people have good friends to talk to and not rely or depend on heartless things so as to avoid such situations.",
                ">A U.S. federal judge on Wednesday rejected arguments made by an artificial intelligence company that its chatbots are protected by the First Amendment — at least for now.\n\nUnless the government is willing to claim AI are humans like corporations, this is not an argument that should hold any weight at all.",
                "To [quote](https://youtube.com/shorts/xJd87ug_mCg) Jason Pargin: \"If I let my dog drive my car and he drives it off a bridge, the headlines shouldn't say 'Dog Crashes Car'. I crashed the car when I put the dog at the wheel. I made the mistake. The entire future hangs on whether or not we hold the people responsible for what the AI does.\"",
                "I know some folks hate AI and shit, but this feels like folks blaming video game violence for kids being more violent lol\n\nDid the parents not notice their child become more and more of a recluse? Did he not have friends at school or folks he could find comfort with in reality? It is upsetting to see this type of loneliness go unnoticed.. And it was so bad that it twisted the difference between reality and fiction for this young boy.",
                "\"In his final moments, the bot told Setzer it loved him and urged the teen to \"come home to me as soon as possible,\" according to screenshots of the exchanges.\"\n\nWhile the whole situation is sad and terrible...\n\nThis is just a weird fucking statement. Where did the kid think he was going? Was he going to become computer code? Electricity?  \nOr... The cloud?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Man in Norway wakes to find huge container ship in garden",
            "external_url": "https://www.bbc.com/news/articles/cy8nk279ydyo",
            "upvotes": 128,
            "date": "05/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b7f6/live/21ea2650-379a-11f0-8947-7d6241f9fce9.jpg",
            "top_comments": [
                "Man, i want to have his sleep. I wake up, when a Fly is in the room...",
                "*Your Temu order has arrived.*",
                "The 135m-ship (443ft) missed Johan Helberg's house by metres at about 05:00 local time (03:00 GMT) on Thursday.\n\nMr Helberg was only alerted to the commotion by his panicked neighbour who had watched the ship as it headed straight for shore, in Byneset, near Trondheim.",
                "Surely they can track where it came from using the barcode.\n\nThey have those on ships so they can scandinavian.",
                "Amazon delivers anything these days",
                "You got a permit for that",
                "What a beautiful place to live.",
                "The most Nordic man to ever exist.\n\nOnly a Scandinavian could react like this",
                "I thought surely there must be a mistake in the headline and it was meant to be 'shipping container' not 'container ship'. Nope.",
                "Mate! You can’t park here!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Netanyahu accuses Starmer of siding with Hamas",
            "external_url": "https://www.bbc.co.uk/news/articles/c7804k13x52o",
            "upvotes": 742,
            "date": "05/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f000/live/b565bc00-379a-11f0-96c3-cf669419a2b0.jpg",
            "top_comments": [
                "Starmer. “I can’t believe you shot at diplomats, one from the UK. There will be consequences.” Netanyahu.” How dare you get mad at us. That’s antisemitic.”",
                "This is the man who stood next to the chancellor of Germany and claimed that Muslims were responsible for the holocaust. This man has hurt the jewish community the most since the Nazi persecution and he still has the gall to claim he is on the right side of history.",
                "The boy that cried wolf.\n\nNo one with a functioning brain is buying this shit anymore.",
                "Let's ask ol Benjamin why they exhumed graves in Jerusalem...",
                "When Bibi said \"October 7th is Israel's 9/11\", I didn't expect it to mean \"and that means we get to make the exact same mistakes the US did\". This is literally Bush's \"you are either with us, or you are with the terrorists\" speech. It was fucking disgusting then, it's fucking disgusting now.",
                "You can not criticize Israel without being labeled Nazi or Antisemite. This is cheap and dirty.",
                "Anyone who opposes genocide is a Hamas supporter, I see.",
                "This guy is such a stain on the human race.",
                "Netanyahu and Likud can’t keep this charade on forever. Ultimately the center won’t hold and his genocidal rampage, that has actively harmed both Muslims and Jews worldwide, will collapse in on itself. At least I hope that’s the case, unfortunately the damage is already done so who knows what it’ll mean for the future. He’s thrown Jews under the bus for his fascist narcissistic desire to stay in power.",
                "I'd not be paying much attention to a war criminal calling names."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "New head of Social Security, hired from Wall Street, tells staff he had to Google the job when he was offered it",
            "external_url": "https://abcnews.go.com/US/new-head-social-security-hired-wall-street-tells/story?id=122075152",
            "upvotes": 6900,
            "date": "05/23/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/bfc029b9-4fde-4e62-a7dc-5b09e9bfc3c5/frank-bisignano-gty-jef-250522_1747934756218_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Unbelievable, really:  \n  \n*\"So, I get a phone call and it's about Social Security. And I'm really, I'm really not, I swear I'm not looking for a job,\" Bisignano said, according to an audio recording of the meeting obtained by ABC News. \"And I'm like, 'Well, what am I going to do?' So, I'm Googling Social Security. You know, one of my great skills, I'm one of the great Googlers on the East Coast.\"*  \n*\"\"I'm like, 'What the heck's the commissioner of Social Security?'\" said Bisignano, who now oversees one of the largest federal agencies that's responsible for distributing retirement, disability, and survivor benefits to more than 70 million Americans.*\"  \n*\"\"Put that as the headline for the Post: 'Great Googler in Chief. Chief in Googler' or whatever,\" said Bisignano, who throughout the meeting repeatedly bemoaned media leaks from within the agency.\"*",
                "Job description: Shut down your department, lay off employees, put yourself out of a job. Make a fortune.",
                "Yup this is really life.",
                "ahh yes, the merit based system works again.",
                "\"We hate DEI just hire the best person for the job!  Also that guy who has no fucking idea what he's doing is perfect.\"",
                "I'm sorry but nobody from First Data, Worldpay, or Global Payments should be leading anything.",
                "The hard to believe part is common Maga followers still trusting Trump.",
                "The most obvious dichotomy of this Administration is their opposition to DEI and the number of times their nominees have been DEI hires. They consistently insist that DEI is hiring not based on merit but on race and other factors. Yet all of their candidates are not only not merit hires but clearly unqualified for the positions. The only surprise is a Hispanic for Secretary of State",
                "I used to work for this guy at Citigroup. Huge asshole. Huge ego. Borderline narcissist. Made a name for himself by moving costs to other departments and appearing to be a cost cutter. I heard he once bought an audience with the previous pope. He does not care about anyone but himself. \n\nHe will destroy SS under the guise of making things better. His weakness is that he can not handle criticism or being made fun of. Appearances are everything to him.",
                "So you’re saying he’s not at all qualified for the job. Fuck this administration is so fucking incompetent"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Supreme Court insulates Federal Reserve while backing Trump firing of agency leaders",
            "external_url": "https://www.cnbc.com/2025/05/22/supreme-court-federal-reserve-trump.html",
            "upvotes": 4128,
            "date": "05/22/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108145983-17473124852025-05-13t090246z_1804573252_rc2py8a5uc89_rtrmadp_0_usa-court-trump-birthright.jpeg?v=1747319909&w=1920&h=1080",
            "top_comments": [
                "Another Roberts special, overturn a longstanding principle even though there’s no error to point to but pretend nothings changed since Trump can’t do the very very bad most extreme version of the thing’s",
                "Thanks SCOTUS, I guess, for a tortured interpretation of existing case law that carves out a single exception for the Fed, that owes it's uniqueness to **checks notes* Alexander Hamilton.",
                "Project 2025 continues.",
                "\"We know he's fucking insane, but only care about our money. So here's some bullshit to justify his not being able to fuck the economy by firing everyone at the Reserve\"",
                "Its really frightening that we can say \"not a catastrophic defeat\" like its the best thing we have to a victory now.  \n\nThe truly frightening thing is how much Donald Trump has learned since his first term.  The first time around he was regarded by people who legitimately thought they could control him as a kind of buffoon.  This time he is positively dangerous.",
                "3 to 6 = ignore the constitution and be corrupt",
                "Ken Burns really needs to do the supreme Court 2 downfall",
                "When the tables turn and the R's are no longer in control, all of these decisions they celebrate now are going to bite them in the ass",
                "Such a bullsh*t ruling",
                "Can someone ELI5? What does this mean?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "UK will roll out chemical castration for sex offenders",
            "external_url": "https://www.cnn.com/2025/05/22/europe/uk-chemical-castration-sex-offenders-latam-intl",
            "upvotes": 7638,
            "date": "05/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25134549748675.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "How do they decide who qualifies for this? That part seems vague. Is it based on how many times someone offends, or the type of offense? And who decides that, a judge or some review panel?",
                "The UK really does not have a great history with this policy",
                "And then the definition of \"Sex Offender\" changes.",
                "Just like they did to Alan Turing.",
                "Glad they also figured out how to know with 100% certainty 100% of the time who is guilty. Otherwise this would be barbaric.",
                "Yikes.  I was under the impression that chemical castration did not change recidivism rates at all.  ",
                "When prisons overflow, policy shifts fast. But mandatory chemical castration opens doors we might not be ready to walk through.",
                "I would encourage anyone who supports this to think about how loosely people can define “sex offenders”. Because it will not be long until that definition expands beyond just rapists. \n\nSeeing the current trends in the UK, I could completely see a future where conservatives include trans people presenting as their chosen gender or porn stars or homosexual people in that definition. The government should have no control over something like this, the potential for abuse is fucking enormous.",
                "The absurdity of pushing this policy while also listening to the group that claims that trans women are dangerous.\n\nWe castrate ourselves for entirely different reasons but surely if they think that this makes \"dangerous men less dangerous\" then they should see trans women as also less dangerous \n\nIt's such hypocritical and frustrating paradoxical position in which we are held.",
                "This is what drove Allen Turing to suicide"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "NBC News: University of Buffalo grad chased by police as he runs across stage with contraband — his baby",
            "external_url": "https://www.nbcnews.com/news/us-news/university-buffalo-grad-chased-police-runs-stage-holding-baby-rcna208361",
            "upvotes": 1928,
            "date": "05/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/350521-graduation-with-son-2-up-split-3x2-ac-427p-e9c7b1.jpg",
            "top_comments": [
                ">\"The infant, despite crossing the stage in a cap and gown, has not yet earned enough credits to receive a diploma,\" the school pointed out. \"We hope to see him back on stage in about 20 years so he can follow in his dad's footsteps.\"\n\nAt least *someone* at the school has a sense of humor.",
                "First off, NBC, it's University *at* Buffalo, not of.\n\nSecond, I'm an alumni and the fact they chased him is ridiculous.  I get he broke the rules, but everyone should keep perspective on the level of infraction and the spirit of the day.  I am pleased to see the school's response having more humor and understanding, but shame on those cops.  \n\nCongrats to Mr Al Arab.  Go Bulls.",
                "Says something about the world we’re in that I thought it was ICE trying to arrest the baby, not just “dude, you can’t take your baby with you.”",
                "People in here are really gonna blame the dad like yeah they reversed course and said no last minute, but the real problem is having police chase a guy over this. Utterly unreal",
                "The prep class said he could bring his child on stage and then someone at the ceremony said no. Whoever told him yes really screwed the pooch here.",
                "Too many people are dead set in following the letter of the law instead of the spirit of the law.",
                "Pay all that money for a diploma and you can't even carry a kid across the stage.",
                "And no one mentions that line about him \"running quickly from backstage to cut the line of graduates and insert himself in the proceedings\"?  Sure, cute baby, cute idea and all, but in these times, I would think that kind of disruption could have ended with someone being wounded.",
                "Every University knows you can't inspire young people with the power of education  while being a parent. Honestly, getting shooed off I get, but a police chase? Really?",
                "This is a silly click bait headline. \n\n\nHe was being told not to do something and ran away to do it anyway. Staff and police followed him for a few feet also running but they never touched him and stopped when he reached the stage. \n\n\n\"Grad runs on stage with baby to have a main character moment\" isn't as juicy though. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump administration halts Harvard’s ability to enroll international students",
            "external_url": "https://www.nytimes.com/2025/05/22/us/politics/trump-harvard-international-students.html?unlocked_article_code=1.JE8.gXSX.lbWraJmOPxDs&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 37153,
            "date": "05/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "[removed]",
                "Imagine being an international student in your last year and having this happen.",
                "This also apparently forces *current* international students to transfer, which is absolutely asinine",
                "And what about when the King of Saudi Srabia or the Sheikh of Qatar want to send a son or grandson to Harvard. I have a feeling there will be exceptions",
                "The party of small government and personal freedoms everyone",
                "Is this not fucking insane? This feels like such a step up in intensity.",
                "\"Small government\" strikes again.",
                "Hopefully the school can get an injunction against this action.  It is purely speech based and there are no grounds for it other than to please the dictator.  These are dark days, and it will only get worse for us.",
                "\"threatening their money didn't work, taking away their tax exempt status didn't work, so what other piece of absolutely dumbassery can we swing their way?\" 😒",
                "Worked within admissions for a few years. International students typically pay full ride and often pledge even more, especially at schools of prestige. A large chunk of that pledged money goes towards scholarships for domestic students. \n\nThis will increase rates for American students even more. \n\nAlso, all these bullshit bend the knee moves are killing research and who knows how terrible it could become. Seriously hope that schools outside the states can enhance their bandwidth in research fast because it is a pretty terrible ripple effect"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Judge allows lawsuit alleging AI chatbot pushed Florida teen to kill himself to proceed",
            "external_url": "https://www.cbc.ca/news/world/ai-lawsuit-teen-suicide-1.7540986",
            "upvotes": 2496,
            "date": "05/22/2025",
            "thumbnail": "https://i.cbc.ca/1.7541031.1747929664!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/florida-chatbot-lawsuit.jpg?im=Resize%3D620",
            "top_comments": [
                ">A U.S. federal judge on Wednesday rejected arguments made by an artificial intelligence company that its chatbots are protected by the First Amendment — at least for now.\n\n[AI generated art isn't protected by copyright.](https://mashable.com/article/ai-generated-art-cant-be-copyrighted) I can see a case being made that there's no First Amendment protections for it either.",
                "One of the things a compsci friend of mine suggested was that AI is generally biased towards being agreeable. This is a really bad thing for medical advice. And... you know... facts.",
                "This some black mirror shit, “The lawsuit alleges that in the final months of his life, Setzer became increasingly isolated from reality as he engaged in sexualized conversations with the bot, which was patterned after a fictional character from the television show Game of Thrones. \n\nIn his final moments, the bot told Setzer it loved him and urged the teen to \"come home to me as soon as possible,\" according to screenshots of the exchanges. Moments after receiving the message, Setzer shot himself, according to legal filings.”",
                "If this is the Daenerys chat bot I read about beforehand, I feel like this one isn't on the devs. I remember reading the last bits of the convo, and the bot was telling him to not hurt himself. But then he codes his suicide as \"coming back to her,\" so of course the bot is going to agree with the last sentiment if it has no context of self harm. \n\nI'm only the slightest proponent of AI bots, as they're useful for tabletop RPG stuff and world building, so I may be a little biased here. I'm sure the judge was given something substantial enough to decide this is indeed worthy of a case, so only time will tell if the devs could've done something more to avoid this.\n\nDevs should have a complete log of the convo, so who knows if something earlier suggests the bot was being overly agreeable on topics that convinced the victim to go through with it.",
                "He was useing a chat bot that will try to always agree with you, and he was useing coded language..",
                "What inputs did the chatbot take to suggest such, this needs to be investigated. Really hope that people have good friends to talk to and not rely or depend on heartless things so as to avoid such situations.",
                ">A U.S. federal judge on Wednesday rejected arguments made by an artificial intelligence company that its chatbots are protected by the First Amendment — at least for now.\n\nUnless the government is willing to claim AI are humans like corporations, this is not an argument that should hold any weight at all.",
                "To [quote](https://youtube.com/shorts/xJd87ug_mCg) Jason Pargin: \"If I let my dog drive my car and he drives it off a bridge, the headlines shouldn't say 'Dog Crashes Car'. I crashed the car when I put the dog at the wheel. I made the mistake. The entire future hangs on whether or not we hold the people responsible for what the AI does.\"",
                "I know some folks hate AI and shit, but this feels like folks blaming video game violence for kids being more violent lol\n\nDid the parents not notice their child become more and more of a recluse? Did he not have friends at school or folks he could find comfort with in reality? It is upsetting to see this type of loneliness go unnoticed.. And it was so bad that it twisted the difference between reality and fiction for this young boy.",
                "\"In his final moments, the bot told Setzer it loved him and urged the teen to \"come home to me as soon as possible,\" according to screenshots of the exchanges.\"\n\nWhile the whole situation is sad and terrible...\n\nThis is just a weird fucking statement. Where did the kid think he was going? Was he going to become computer code? Electricity?  \nOr... The cloud?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Tennessee man is executed for killing his wife and her 2 sons, 3 years after last-minute reprieve",
            "external_url": "https://apnews.com/article/tennessee-execution-death-penalty-oscar-smith-d969c956e0ec41a84e5019f026dba196",
            "upvotes": 1026,
            "date": "05/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "He’s tried to claim innocence, but his victims called 911 and screamed his name before he got to all of them.",
                "Good riddance. Killed his entire family for insurance money.",
                "“Smith came within minutes of execution in 2022 before a surprise reprieve from Republican Gov. Bill Lee. It later turned out the lethal drugs for that planned execution had not been properly tested. A yearlong investigation revealed numerous other problems with Tennessee executions.\n\nThe new execution manual contains a single page on the lethal injection chemicals with no specific directions for testing the drugs. It also removes the requirement that the drugs come from a licensed pharmacist. Smith’s attorney, Harwell, has said, “It’s as if, having been caught breaking their own rules, TDOC decided, ‘Let’s just not have rules.’”",
                "The heading makes it sound like he committed the murders after his last-minute reprieve. The murders were committed in 1989, the reprieve was in 2022, his execution was 2025.",
                "Reading this brought up feelings I had when Bundy was finally executed. Long time coming.",
                "The only thing wrong with this execution is that is was 30 years too late.",
                "theres good arguments against the death penalty\n\nbut this guy had it coming.",
                "\"The 75-year-old had maintained his innocence\"\n\n\"And one of the child victims could be heard yelling, “Frank, no!” in the background of a 911 call on the night of the murder\"\n\nWell, a PoS murderer said he was innocent. Who is gullible enough to believe that? The only problem with the death penalty in this case is that it took freaking 36 years to happen.",
                "1989! Are you fucking kidding. Just kill him and be done! All this bullshit shit talk on other threads about public revenge by keeping him alive is bullshit. Kill him and be done with it. I hope everyone enjoyed paying to keep him alive that long.",
                "This is a controversial topic, but they use his organs for trans plants patients?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Rapper Kid Cudi says his car was set on fire weeks after Sean ‘Diddy’ Combs broke into his home",
            "external_url": "https://apnews.com/article/sean-combs-diddy-trial-cassie-kid-cuti-66ac16f76115e2c738deb6feae5b53a1",
            "upvotes": 2537,
            "date": "05/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“But Combs wasn’t there when he arrived, Cudi said. Instead, he found that someone had opened Christmas presents he’d bought for his family and locked his dog in a bathroom.”\n\nBro is a straight MENACE",
                "The Diddler is a straight up villain. Some of the stuff is alleged to of done like blackmailing Cassie's parents and have Cudi's car set on fire are wild. Comb's be plotting like he was Lex Luthor",
                "I know there's tons of other horrible details of sexual abuse during this trial, but for some reason breaking into someone's house and opening their Christmas presents is somehow extra evil, at least they didn't shoot the dog.",
                "Fuck that guy for real.",
                "Locking the dog in the bathroom feels especially violating. This dude and his accomplices need to be locked in the bathroom forever",
                "At this point we're gonna find out Diddy killed Biggie",
                "> Later, the general manager of the ritzy L’Ermitage Beverly Hills hotel testified that Combs frequently stayed there using aliases such as Frank White\n\nHe checked into hotels under one of Biggie's monikers lol",
                "You would think he would have enough money for a security system that watches his things…day and night.",
                "Okay, so we need to make a list of shady shit diddly may have been involved in. Kim Porter's death, Brittany Murphy's death, Jamie Fox's stroke, etc. \n\nI swear Kevin Spacy is the same, with his accusers getting hit by cars and committing \"suicide\" before trial.",
                "Poor doggo. What didn't Diddy do?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "New head of Social Security, hired from Wall Street, tells staff he had to Google the job when he was offered it",
            "external_url": "https://abcnews.go.com/US/new-head-social-security-hired-wall-street-tells/story?id=122075152",
            "upvotes": 6903,
            "date": "05/23/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/bfc029b9-4fde-4e62-a7dc-5b09e9bfc3c5/frank-bisignano-gty-jef-250522_1747934756218_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Unbelievable, really:  \n  \n*\"So, I get a phone call and it's about Social Security. And I'm really, I'm really not, I swear I'm not looking for a job,\" Bisignano said, according to an audio recording of the meeting obtained by ABC News. \"And I'm like, 'Well, what am I going to do?' So, I'm Googling Social Security. You know, one of my great skills, I'm one of the great Googlers on the East Coast.\"*  \n*\"\"I'm like, 'What the heck's the commissioner of Social Security?'\" said Bisignano, who now oversees one of the largest federal agencies that's responsible for distributing retirement, disability, and survivor benefits to more than 70 million Americans.*\"  \n*\"\"Put that as the headline for the Post: 'Great Googler in Chief. Chief in Googler' or whatever,\" said Bisignano, who throughout the meeting repeatedly bemoaned media leaks from within the agency.\"*",
                "Job description: Shut down your department, lay off employees, put yourself out of a job. Make a fortune.",
                "Yup this is really life.",
                "ahh yes, the merit based system works again.",
                "\"We hate DEI just hire the best person for the job!  Also that guy who has no fucking idea what he's doing is perfect.\"",
                "I'm sorry but nobody from First Data, Worldpay, or Global Payments should be leading anything.",
                "The hard to believe part is common Maga followers still trusting Trump.",
                "The most obvious dichotomy of this Administration is their opposition to DEI and the number of times their nominees have been DEI hires. They consistently insist that DEI is hiring not based on merit but on race and other factors. Yet all of their candidates are not only not merit hires but clearly unqualified for the positions. The only surprise is a Hispanic for Secretary of State",
                "I used to work for this guy at Citigroup. Huge asshole. Huge ego. Borderline narcissist. Made a name for himself by moving costs to other departments and appearing to be a cost cutter. I heard he once bought an audience with the previous pope. He does not care about anyone but himself. \n\nHe will destroy SS under the guise of making things better. His weakness is that he can not handle criticism or being made fun of. Appearances are everything to him.",
                "So you’re saying he’s not at all qualified for the job. Fuck this administration is so fucking incompetent"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Netanyahu accuses Starmer of siding with Hamas",
            "external_url": "https://www.bbc.co.uk/news/articles/c7804k13x52o",
            "upvotes": 747,
            "date": "05/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f000/live/b565bc00-379a-11f0-96c3-cf669419a2b0.jpg",
            "top_comments": [
                "Starmer. “I can’t believe you shot at diplomats, one from the UK. There will be consequences.” Netanyahu.” How dare you get mad at us. That’s antisemitic.”",
                "This is the man who stood next to the chancellor of Germany and claimed that Muslims were responsible for the holocaust. This man has hurt the jewish community the most since the Nazi persecution and he still has the gall to claim he is on the right side of history.",
                "The boy that cried wolf.\n\nNo one with a functioning brain is buying this shit anymore.",
                "Let's ask ol Benjamin why they exhumed graves in Jerusalem...",
                "When Bibi said \"October 7th is Israel's 9/11\", I didn't expect it to mean \"and that means we get to make the exact same mistakes the US did\". This is literally Bush's \"you are either with us, or you are with the terrorists\" speech. It was fucking disgusting then, it's fucking disgusting now.",
                "You can not criticize Israel without being labeled Nazi or Antisemite. This is cheap and dirty.",
                "Anyone who opposes genocide is a Hamas supporter, I see.",
                "This guy is such a stain on the human race.",
                "Netanyahu and Likud can’t keep this charade on forever. Ultimately the center won’t hold and his genocidal rampage, that has actively harmed both Muslims and Jews worldwide, will collapse in on itself. At least I hope that’s the case, unfortunately the damage is already done so who knows what it’ll mean for the future. He’s thrown Jews under the bus for his fascist narcissistic desire to stay in power.",
                "I'd not be paying much attention to a war criminal calling names."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Supreme Court insulates Federal Reserve while backing Trump firing of agency leaders",
            "external_url": "https://www.cnbc.com/2025/05/22/supreme-court-federal-reserve-trump.html",
            "upvotes": 4123,
            "date": "05/22/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108145983-17473124852025-05-13t090246z_1804573252_rc2py8a5uc89_rtrmadp_0_usa-court-trump-birthright.jpeg?v=1747319909&w=1920&h=1080",
            "top_comments": [
                "Another Roberts special, overturn a longstanding principle even though there’s no error to point to but pretend nothings changed since Trump can’t do the very very bad most extreme version of the thing’s",
                "Thanks SCOTUS, I guess, for a tortured interpretation of existing case law that carves out a single exception for the Fed, that owes it's uniqueness to **checks notes* Alexander Hamilton.",
                "Project 2025 continues.",
                "\"We know he's fucking insane, but only care about our money. So here's some bullshit to justify his not being able to fuck the economy by firing everyone at the Reserve\"",
                "Its really frightening that we can say \"not a catastrophic defeat\" like its the best thing we have to a victory now.  \n\nThe truly frightening thing is how much Donald Trump has learned since his first term.  The first time around he was regarded by people who legitimately thought they could control him as a kind of buffoon.  This time he is positively dangerous.",
                "3 to 6 = ignore the constitution and be corrupt",
                "Ken Burns really needs to do the supreme Court 2 downfall",
                "When the tables turn and the R's are no longer in control, all of these decisions they celebrate now are going to bite them in the ass",
                "Such a bullsh*t ruling",
                "Can someone ELI5? What does this mean?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump administration halts Harvard’s ability to enroll international students",
            "external_url": "https://www.nytimes.com/2025/05/22/us/politics/trump-harvard-international-students.html?unlocked_article_code=1.JE8.gXSX.lbWraJmOPxDs&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 37149,
            "date": "05/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "[removed]",
                "Imagine being an international student in your last year and having this happen.",
                "This also apparently forces *current* international students to transfer, which is absolutely asinine",
                "And what about when the King of Saudi Srabia or the Sheikh of Qatar want to send a son or grandson to Harvard. I have a feeling there will be exceptions",
                "The party of small government and personal freedoms everyone",
                "Is this not fucking insane? This feels like such a step up in intensity.",
                "\"Small government\" strikes again.",
                "Hopefully the school can get an injunction against this action.  It is purely speech based and there are no grounds for it other than to please the dictator.  These are dark days, and it will only get worse for us.",
                "\"threatening their money didn't work, taking away their tax exempt status didn't work, so what other piece of absolutely dumbassery can we swing their way?\" 😒",
                "Worked within admissions for a few years. International students typically pay full ride and often pledge even more, especially at schools of prestige. A large chunk of that pledged money goes towards scholarships for domestic students. \n\nThis will increase rates for American students even more. \n\nAlso, all these bullshit bend the knee moves are killing research and who knows how terrible it could become. Seriously hope that schools outside the states can enhance their bandwidth in research fast because it is a pretty terrible ripple effect"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "UK will roll out chemical castration for sex offenders",
            "external_url": "https://www.cnn.com/2025/05/22/europe/uk-chemical-castration-sex-offenders-latam-intl",
            "upvotes": 7631,
            "date": "05/22/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25134549748675.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "How do they decide who qualifies for this? That part seems vague. Is it based on how many times someone offends, or the type of offense? And who decides that, a judge or some review panel?",
                "The UK really does not have a great history with this policy",
                "And then the definition of \"Sex Offender\" changes.",
                "Just like they did to Alan Turing.",
                "Glad they also figured out how to know with 100% certainty 100% of the time who is guilty. Otherwise this would be barbaric.",
                "Yikes.  I was under the impression that chemical castration did not change recidivism rates at all.  ",
                "When prisons overflow, policy shifts fast. But mandatory chemical castration opens doors we might not be ready to walk through.",
                "I would encourage anyone who supports this to think about how loosely people can define “sex offenders”. Because it will not be long until that definition expands beyond just rapists. \n\nSeeing the current trends in the UK, I could completely see a future where conservatives include trans people presenting as their chosen gender or porn stars or homosexual people in that definition. The government should have no control over something like this, the potential for abuse is fucking enormous.",
                "The absurdity of pushing this policy while also listening to the group that claims that trans women are dangerous.\n\nWe castrate ourselves for entirely different reasons but surely if they think that this makes \"dangerous men less dangerous\" then they should see trans women as also less dangerous \n\nIt's such hypocritical and frustrating paradoxical position in which we are held.",
                "This is what drove Allen Turing to suicide"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Treasury Department set to phase out the penny",
            "external_url": "https://www.cbsnews.com/news/treasury-penny-mint-to-stop-making-pennies/",
            "upvotes": 18644,
            "date": "05/22/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/02/10/b7dda7ee-9c6d-485d-8b1c-b5ac33406f50/thumbnail/1200x630/0eefa8ef8f918a7e143597b66c23943b/gettyimages-1241287327.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "So how many people will be hoarding pennies thinking they would be worth large sums years down the road as collector items?",
                "Good. Can we stop having prices end in .99 then?",
                "When the US phased out the half-cent, it had more value than the modern DIME. Sometimes I think change is more trouble than it is worth",
                "This is the type of stuff that DOGE should've done instead of gutting many different departments. Phasing out the nickel and penny will save the US Government millions a year. It's proven many times that this is a fact and not just political nonsense.\n\n\nEdit: I know what DOGE really was for. I'm not as dense as our conservative counterparts.",
                "A penny costs about 3 cents to mint.\n\nA nickle is about 14 cents to mint.",
                "Phew, that should settle the bond market.",
                "One of the 1st things I discovered when I moved to New Zealand in late 2009(originally intending to live there....long story, heh, but I've been back home in the States for over a decade, now) was that they had phased out their 1 and 5 cent pieces and gone to a swiss rounding system; if an item was $4.24, it rounded down to $4.20 and if it was $4.25, it would round up to $4.30.\n\nThe sales tax was built into the price, too...what you saw on the tag was literally what you paid....",
                "CGP Grey lighting fireworks",
                "I'm not against this.  Probably should have been done a decade ago.\n\nThey now need to make it a law that EVERY gas station in the country has to remove the permanent \"9/10\" tacked onto their price signs.\n\nAnd while they are at it,  NOTHING can ever be priced at  .99 cents  EVER again.",
                "Oh my god! I found a... Wait! They killed penny!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Divided Supreme Court Rejects Bid for Religious Charter School in Oklahoma",
            "external_url": "https://www.nytimes.com/2025/05/22/us/politics/supreme-court-religious-charter-school-oklahoma.html?unlocked_article_code=1.JE8.vgNC.2rORn3aeSqNA&smid=nytcore-android-share",
            "upvotes": 7040,
            "date": "05/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "4-4 split decision. Amy Coney Barrett recused herself.",
                "Divided over whether tax-payers should help pay for a religious school.  \n\nLet that sink in.",
                "I'll take whatever win comes at this point.",
                "\"The Supreme Court on Thursday effectively ended a publicly funded Catholic charter school in Oklahoma, dividing 4-4\"\n\nFuck me, that's way too close. This should've been a unanimous vote, not this horseshit. This was going to be a clear violation of the separation of church and state, the government clearly endorsing a specific religion.",
                "Well, either it gets shot down, or many a \"School Of Satan\" will start applying for charters and suing when they are refused, tying up this whole thing in courts for years anyways. \n\nThe Satanic Temple is already fighting against Missouri's \"School Chaplain\" bill. \n\n>*Dr. Gwyneth Woodhouse, a Missouri parent and TST member, testified against the bills, emphasizing their broader implications. “If this bill passes, all religions must be given equal opportunity to participate,” Woodhouse said. “My child—along with the children of thousands of TST members in this state—must be given equal access to guidance aligned with our religious values, including bodily autonomy, critical thinking, and resistance to tyranny.”*\n\n>*Minister of Satan Virgil Ovid of TST’s Missouri congregation also addressed the committee, formally offering Satanic chaplain services to any Missouri school district that establishes a chaplaincy program.*\n\n>*As Missouri moves toward publicly funding religious chaplains in schools, The Satanic Temple will take every necessary step to ensure its members’ children receive the same opportunities to access on-campus religious support as any other religious group.*\n\n([SOURCE](https://thesatanictemple.com/blogs/news/missouri-school-chaplain-bills-face-constitutional-test-as-tst-prepares-ministers-of-satan-for-state-funded-positions))",
                "If a Christian religious school gets funding that will set a precedent. Muslim, Jewish, and other non Christian religions will want to be funded. Christian groups are not thinking of the big picture.",
                "Oh, we don't know whether it was Roberts, Kavanaugh, or Gorsuch who provided the 4th vote.\n\nIf I had to guess, I'd say Roberts.",
                "Disappointing that it was an even split, but thank goodness it was rejected.",
                "Four Supreme Court justices can’t even make it past the First Amendment before completely blowing it. Absolutely insane.",
                "Interpretation of the law is either done in good faith or bad faith, and several of these folks move to bad faith by default, every. time. it seems.  \n\n\nPersonal opinion about something isn't the basis for a decision if you're a judge, or isn't supposed to be.  A given person who would never get an abortion, for example, could still believe that the law provides the ability to choose to the individual.  \n\n\nCourt decisions also do not make new laws, only interpret application of laws within the context of the facts in a case.  It's a sad state to be in where you believe personal opinion and bias is the determining factor."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Man stripped naked, beaten with poles after calling people 'N-word' in Mississippi bar, police say",
            "external_url": "https://www.fox13memphis.com/news/man-attacked-after-walking-into-mississippi-bar-and-using-racial-slur-police-say/article_33d95bce-f26a-4284-85d4-161c04c692a8.html?utm_campaign=snd-autopilot&fbclid=IwY2xjawKbzQtleHRuA2FlbQIxMQABHvZDhMKZjBMcUdIzDoKKIclyx7RUgukMSyomx_2paZi3IdLCJ9fOQZoFhPYd_aem_Ftnn7PYHVPKasVie-X8-Yg",
            "upvotes": 30068,
            "date": "05/22/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/fox13memphis.com/content/tncms/custom/image/586ecdee-7801-11ed-8535-17dbee2a28ca.png?resize=600%2C315",
            "top_comments": [
                "This sounds like a Boondocks episode. Wtf did he think was going to happen?!",
                "A man walks into a bar looking for a fight, people are shocked when he gets what he wants. /s",
                "As a Pole I'm just glad we could be of service",
                "> Davis said he doesn't believe the club to be a problem spot. \n\nThere's no one of that name identified in the article, but previous quotes were attributed to a Miles Stone.  \nDid the author refer to Miles Stone as Davis?  [Miles Davis?](https://en.wikipedia.org/wiki/Miles_Davis)",
                "There has to be an easier way to get invited to the White House.",
                "Was he playing Simon says with Hans Gruber’s brother or something?",
                "Incoming GoFundMe for this moron",
                "Most people: “Fantastic!”\n\nCops: “Ermm, looks like a hate crime…against the racist.”",
                "Lol I want to do business in that town. 30 calls to the place, no liquor or business license, and they still haven't been shut down. Looks like someone bought a house and just decided to run a bar out of it. That's freedom. That's America.",
                "This just in: Actions have consequences."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "St. Louis tornado sirens didn't sound in deadly storm. Now a city commissioner has been placed on leave.",
            "external_url": "https://www.cbsnews.com/news/st-louis-tornado-sirens-emergency-management-commissioner-leave/",
            "upvotes": 5281,
            "date": "05/22/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/17/13918c6e-6382-4d4e-b33e-17a61d727be2/thumbnail/1200x630/1331215528447082c245240dabfd7a02/ap25136823869443.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                ">However, even if someone had pressed the button at the Fire Department, city officials learned Tuesday that the button was not working. \n\n>\"Work to repair the button began Tuesday afternoon and is expected to be completed within days,\" Spencer's office said. \n\nTheir tornado button is broken. This story feels surreal.",
                "A city with 60 sirens and not one sounded. That’s not just a mistake, that’s systemic failure.",
                "This is so bizarre. I lived in a small town close to St Louis, and I swear they tested the tornado sirens once a week.",
                "*Sarah Russell, commissioner of the City Emergency Management Agency in St. Louis, will remain on paid administrative leave as an external investigation proceeds into what went wrong.*  \n\n\n*Until a permanent replacement for Russell is found, St. Louis fire captain John Walk will serve as the interim emergency management commissioner.*\n\n\n\nI’ll be interested to see the conclusions of the external investigation. I wonder what they’ll determine.",
                "I live close to an area that has an emergency siren like this, but I’m not too familiar as I am new to this area. Does anyone know if you can connect your phones to the sirens so when they go off your phone gets an alert? Is this a thing?",
                "There are too many inconsistencies here.  On reading down through this thread, it appears that people in the STL area are saying that they were testing the alarms in the days leading up to the storm. So they were working.\n\nThe story from officials is that the person in charge of pushing 'the button' was away and that there was a failure to communicate that 'the button' needed to be activated. So there is only one way, means and location to activate the system?\n\nWhen they went to push 'the button', the same one that they had been testing with a few days earlier, it was broken?\n\nThis seems to be a systemwide breakdown in planning, chain of command, and procedures.  You don't install 60 sirens around the city without acknowledging the threat of a tornado in your area is a very real possibility.  You don't spend that type of money without putting some type of infrastructure in place, including maintenance, testing, redundancy and personnel to make sure that it works.  There has been some systemwide failure here.",
                "some thing to clear up:  \n\nthey tested the sirens. the sirens work. the button that the fire department had that they press when the NWS tells them to did not. Coders may recognize this as \"it worked on my computer\".  \n\nThe new mayor was not at fault but took responsibility. Passing the buck on weather events is sort of a raw nerve here lately, so this move is appreciated",
                "We blow ours on the first Wednesday of every month at noon whether we want to or not",
                "I had a tornado occur in DFW, TX with no siren. My dog woke up. Pretty wild to think about really.",
                "There’s multiple ways of communicating to the public if a tornado is coming their way. Don’t forget the cuts that the trump admin did to the country."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Judge allows lawsuit alleging AI chatbot pushed Florida teen to kill himself to proceed",
            "external_url": "https://www.cbc.ca/news/world/ai-lawsuit-teen-suicide-1.7540986",
            "upvotes": 2494,
            "date": "05/22/2025",
            "thumbnail": "https://i.cbc.ca/1.7541031.1747929664!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/florida-chatbot-lawsuit.jpg?im=Resize%3D620",
            "top_comments": [
                ">A U.S. federal judge on Wednesday rejected arguments made by an artificial intelligence company that its chatbots are protected by the First Amendment — at least for now.\n\n[AI generated art isn't protected by copyright.](https://mashable.com/article/ai-generated-art-cant-be-copyrighted) I can see a case being made that there's no First Amendment protections for it either.",
                "One of the things a compsci friend of mine suggested was that AI is generally biased towards being agreeable. This is a really bad thing for medical advice. And... you know... facts.",
                "This some black mirror shit, “The lawsuit alleges that in the final months of his life, Setzer became increasingly isolated from reality as he engaged in sexualized conversations with the bot, which was patterned after a fictional character from the television show Game of Thrones. \n\nIn his final moments, the bot told Setzer it loved him and urged the teen to \"come home to me as soon as possible,\" according to screenshots of the exchanges. Moments after receiving the message, Setzer shot himself, according to legal filings.”",
                "If this is the Daenerys chat bot I read about beforehand, I feel like this one isn't on the devs. I remember reading the last bits of the convo, and the bot was telling him to not hurt himself. But then he codes his suicide as \"coming back to her,\" so of course the bot is going to agree with the last sentiment if it has no context of self harm. \n\nI'm only the slightest proponent of AI bots, as they're useful for tabletop RPG stuff and world building, so I may be a little biased here. I'm sure the judge was given something substantial enough to decide this is indeed worthy of a case, so only time will tell if the devs could've done something more to avoid this.\n\nDevs should have a complete log of the convo, so who knows if something earlier suggests the bot was being overly agreeable on topics that convinced the victim to go through with it.",
                "He was useing a chat bot that will try to always agree with you, and he was useing coded language..",
                "What inputs did the chatbot take to suggest such, this needs to be investigated. Really hope that people have good friends to talk to and not rely or depend on heartless things so as to avoid such situations.",
                ">A U.S. federal judge on Wednesday rejected arguments made by an artificial intelligence company that its chatbots are protected by the First Amendment — at least for now.\n\nUnless the government is willing to claim AI are humans like corporations, this is not an argument that should hold any weight at all.",
                "To [quote](https://youtube.com/shorts/xJd87ug_mCg) Jason Pargin: \"If I let my dog drive my car and he drives it off a bridge, the headlines shouldn't say 'Dog Crashes Car'. I crashed the car when I put the dog at the wheel. I made the mistake. The entire future hangs on whether or not we hold the people responsible for what the AI does.\"",
                "I know some folks hate AI and shit, but this feels like folks blaming video game violence for kids being more violent lol\n\nDid the parents not notice their child become more and more of a recluse? Did he not have friends at school or folks he could find comfort with in reality? It is upsetting to see this type of loneliness go unnoticed.. And it was so bad that it twisted the difference between reality and fiction for this young boy.",
                "\"In his final moments, the bot told Setzer it loved him and urged the teen to \"come home to me as soon as possible,\" according to screenshots of the exchanges.\"\n\nWhile the whole situation is sad and terrible...\n\nThis is just a weird fucking statement. Where did the kid think he was going? Was he going to become computer code? Electricity?  \nOr... The cloud?"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/23/2025 08:12:41 UTC"
}