{
    "posts": [
        {
            "category": "HOT",
            "title": "Person in Ohio dies of rabies after contracting virus from organ transplant",
            "external_url": "https://www.whio.com/news/local/person-dies-rabies-after-contracting-virus-organ-transplant/HMS5STBDHZESJJ7FU6464OMN3I/",
            "upvotes": 16664,
            "date": "03/26/2025",
            "thumbnail": "https://cmg-cmg-tv-10040-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fcmg%2FYPMX5TX5QVGJJLZSDGUPWR7NGQ.jpg?auth=612d61eb069c04a50f81fce2778338c3c1cbaaf0f16c60a6d2c3cbff7f510de5&width=1200&height=630&smart=true",
            "top_comments": [
                "Wtf. So did the donor die of rabies too or just somehow died before the rabies set in and they didn’t know? So sad",
                "Didn't this happen in an episode of Scrubs?",
                "That's some fuck you in particular level shit.",
                "from the article:\n\n26 March 2025\n\nLUCAS COUNTY — A person died from rabies after receiving a transplanted organ in Lucas County earlier this year:\n\n>The recipient, who had undergone a kidney transplant in December, contracted the viral disease through the donated organ, according to the Toledo-Lucas County Health Department, WTOL reported.\n\n>As the recipient was from Michigan, Michigan’s Department of Health and Human Services worked with the Ohio Department of Health and the Centers for Disease Control and Prevention to investigate the case.\n\n>It marks the first human case of rabies in Michigan since 2009, according to WTOL.\n\n>No additional individuals are at risk of rabies exposure, according to the CDC.\n\n>Kara Steele, a representative from Life Connection of Ohio, could not comment on the specific case but explained to WTOL that a donor risk assessment interview is conducted before any organ donation.\n\n>The identities of both the recipient and the donor have not been released.\n\n>The facility where the transplant took place has also not been disclosed. \n\n>However, according to the University of Toledo Medical Center’s website, it is the only organ transplant center in northwest Ohio.\n\n>Fewer than 10 people in the United States die from rabies each year, according to the CDC.",
                "There are other viruses where this has happened. There was a case that a donor got LCMV from his pet hamster and got into an accident.  7 out of 8 donors who go his organs died of LCMV, which is not considered wildly dangerous in humans.\n\nhttps://www.nejm.org/doi/full/10.1056/NEJMoa053240",
                "The donor had rabies, but died of something else? This is really bizarre.",
                "Maybe this is a question for a different subreddit.\n\nIf they figured this out shortly after the transplant could the recipient be saved by getting the rabies vaccine?    I am wondering if this is similar to having been bitten... it is in your body but is hasn't gotten into... the nerves(?) enough that the vaccine can help.  Maybe a transplant would be too much rabies all at once or in the wrong part of your body for the rabies treatment to be effective.",
                "That is absolutely tragic. And one of THE WORST ways to die :( \n\nImagine having your brain literally liquified in real-time, as you lose all comprehension of the people and world around you, except for intense and overwhelming fear and confusion.",
                "first comment on the article:\n\nsandytratt1 hour ago\n\nIn 2012 at this same hospital they threw a donor kidney into the trash during a transplant surgery. The poor woman eventually managed to get her transplant months later but the organ accidentally thrown out had been a perfect match donated by her brother.",
                "Someone check on Dr. Cox."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Private Data and Passwords of Senior U.S. Security Officials Found Online",
            "external_url": "https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7?sara_ref=re-so-app-sh",
            "upvotes": 7366,
            "date": "03/26/2025",
            "thumbnail": "https://cdn.prod.www.spiegel.de/images/87ac326a-da00-4ba1-b643-d410f8595cbe_w1200_r1.778_fpx60.66_fpy45.jpg",
            "top_comments": [
                ">To do so, the reporters used commercial people search engines along with hacked customer data that has been published on the web. Those affected by the leaks include National Security Adviser Mike Waltz, Director of National Intelligence Tulsi Gabbard and Secretary of Defense Pete Hegseth.  \n>  \n>Most of these numbers and email addresses are apparently still in use, with some of them linked to profiles on social media platforms like Instagram and LinkedIn. They were used to create Dropbox accounts and profiles in apps that track running data. There are also WhatsApp profiles for the respective phone numbers and even Signal accounts in some cases.  \n>  \n>[...]  \n>National Intelligence Director Gabbard was seemingly more careful with her data than her two male colleagues. She apparently had her own data blocked in the commercial contact search engines that contained the data of Hegseth and Waltz. But her email address was to be found on WikiLeaks and Reddit.  \n>  \n>Gabbard’s email address is available in more than 10 leaks. One of those also contains a partial telephone number, which, when completed, leads to an active WhatsApp account and a Signal profile.  \n>\n>src: https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7  \n  \nI can see quite a few people being very interested in exploiting this.",
                "😂😂😂😂😂\nOf course they are. Why would anyone with empathy or common sense expect competence from this administration???",
                "The clown show continues.\n\nI watch in amazement as the US won the cold war and now a bunch of village idiots absolutely wreck national security and long standing alliances in a couple of weeks.",
                "*Hostile intelligence services could use this publicly available data to hack the communications of those affected by installing spyware on their devices. It is thus conceivable that foreign agents were privy to the Signal chat group in which Gabbard, Waltz and Hegseth discussed a military strike.*\n\nThe headlines come fast and furious from T's desk, but the incompetence of the Admin seems equally propelled.",
                "I bet Trump has a sticky note with passwords on his computer monitor",
                "We are seeing the fall of America in real time. Thanks Republicans!",
                "The soundtrack of the US Government is \"Yackety Sax\"",
                "You just know the clowns in Trump's cabinet answer phishing emails all the time and have probably already infected multiple government systems with malware.",
                "1,395 days 20 hours and 20 minutes left Of this season 😩",
                "My old Xanga account has better security"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "Turkish student at Tufts University detained, video shows masked people handcuffing her",
            "external_url": "https://apnews.com/article/tufts-student-detained-massachusetts-immigration-6c3978da98a8d0f39ab311e092ffd892",
            "upvotes": 3549,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Gestapo level shit.  Her lawyer has no idea where she is.",
                "Why are they given till Friday to provide information?\n\nI understand if people disagree with someone’s opinion but they are literally violating the first amendment. And before you say she’s not a us citizen, the first amendment applies to all humans. If they can prove she violated some other law then prove it! Due process exists to protect the government and its people. It’s sad that there are Americans who don’t understand this and worse that there are Americans willing to participate.",
                "Trumps secret police. Extinguish all freedom of speech.",
                "this is INSANE! the article said she wasn't an activist or member of any pro-Palestinian organization. She simply wrote an op-ed article for her campus paper, not even a national media outlet. She didn't organize protests or sit-ins or never was accused of harrassing or accosting Jewish students on campus. And the scary thing about it is that she hasn't even been accused of any crime. Her grad student visa (in the psychology department no less) was terminated on the whims of the Administration.",
                "What are you even supposed to do in this case? Masked unidentified men claiming to be police with unmarked vehicles come to try to take you. Would calling 911 even help? What about self defense? ",
                "They wore facial masks, so they can’t be identified as cowards because cameras are rolling. Simp cowards.",
                "People need to stop being complacent about this kind of stuff. They are detaining people with no due process. It's essentially kidnapping people who don't agree with the government's foreign policies. Whatever the fuck happened to free speech. They allow Nazis to walk around waving Swastika flags, but someone who criticizes Israel gets arrested like this? The double standards and hypocrisy of this government is pathetic. I wouldn't be surprised if the people who criticize Elon and Tesla end up getting kidnapped like this too.",
                "“First they came for” shit, on stanza two already.",
                "Daily, there are crimes happening that are so bad, citizens from other countries would be in the streets in droves if it happened where they live. But in America we're so desensitized now, we barely notice before the next crime happens the following day.  Or hour.",
                "Individuals here on visas should start considering wearing AirTags in the undergarments so their whereabouts can be traced to some extent. Phones are the first thing they go for."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Trump signs election order calling for proof of U.S. citizenship to vote",
            "external_url": "https://www.reuters.com/world/us/trump-signs-election-order-calling-proof-us-citizenship-vote-2025-03-26/",
            "upvotes": 32534,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I don't understand, aren't only citizens allowed to vote?",
                "Considering this isn’t a law, that voting is up to the states, this is mostly a Big Mac fueled fart in the wind.",
                "Meanwhile, Elon came over on a student visa. Stayed after it had expired… and now has more power than any US citizen",
                "States rights except when it is against Trumps agenda",
                "Oh hey ... those people who were really upset about overreach of the federal government. Are you all gonna be mad about Trump taking away a right reserved for the states?",
                "They aren't doing this because they expect States to follow the requirements. They are doing it because they expect *certain* states *won't*.\n\nThis is setting up a pretext for invalidating legal votes from registered voters, American citizens, specifically from blue States. \n\nThis needs to be heavily challenged in the courts and we should all hope it is shot down, because hell will break loose if the will of the people of entire States is disregarded.",
                "Article I, Section 4, Clause 1\n\n>The Times, Places and Manner of holding Elections for Senators and Representatives, shall be prescribed in each State by the Legislature thereof; but the Congress may at any time by Law make or alter such Regulations, except as to the Places of chusing Senators.\n\n\nStates or Congress.  The Executive have the power to do change state or federal laws.  This is yet another impeachable offense, yet congress is full of feckless cowards.",
                "If they provide free, EASILY ATTAINABLE, federal ID for this purpose then I say go ahead. We all know they won’t though",
                "Trump will announce that the 2028 election has too many security failures and declare a state of emergency over election interference early in the year. The election may be cancelled.\n\nWe are right in the middle of it, folks. This is not my random redditor theory, this is the discussion being held about Trump trying to subvert term limits and how he'll do it. Prepare your pitchforks now, you'll need them in a few years.",
                "I'd be ok with voter ID if everyone registered to vote was also given an ID for proof of identification."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Exclusive: DOGE staffer, 'Big Balls', provided tech support to cybercrime ring, records show",
            "external_url": "https://www.reuters.com/world/us/doge-staffer-big-balls-provided-tech-support-cybercrime-ring-records-show-2025-03-26/?utm_source=reddit.com",
            "upvotes": 34996,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ok, as a reminder to everyone about \"Big Balls\".  \n\nHe is the grandson of a KGB spy.\n\nHe was fired from an internship at a cyber security company for leaking company info to a competitor. \n\nAnd now we know he's involved with crime rings.",
                "He still does, but he used to, too.",
                "The people involved with modifying code on our most sensitive electronic systems are not only just fresh out of school, but are sketchy as hell. \n\nAs a cybersecurity professional, I'm terrified. \n\nMost people can't comprehend how bad this stuff is.\n\nEdit: \n\nHere's a fun thought experiment:\n\n1) Look at the cybersecurity actions taken by this administration. \n2) Think about what actions a compromised President/Cabinet would take regarding cybersecurity. \n3) Ask yourself, what actions would a foreign agent of Russia take that ARE ANY DIFFERENT than what we all have seen up to this point. \n\nEducate yourself! The ONLY way ANY of this makes sense is with this context. Krasnov is destroying this country.\n\nhttps://www.csoonline.com/article/3829710/firing-of-130-cisa-staff-worries-cybersecurity-industry.html/amp/\n\nhttps://www.cybersecuritydive.com/news/dhs-disbands-advisory-board-csrb/737976/\n\nhttps://gizmodo.com/trumps-defense-secretary-hegseth-orders-cyber-command-to-stand-down-on-all-russia-operations-2000570343\n\nhttps://www.euronews.com/my-europe/2025/03/13/fact-checking-online-claims-that-donald-trump-was-recruited-by-the-kgb-as-krasnov",
                "You mean, the guys who use ICE to run the country like a mob, hire people from the underworld?",
                "He will work for any cybercrime group. He has chosen DOGE in this case.",
                "I There's something so deeply unsettling about the fact that literally a group of people from 4chan are not only in charge of the US government, but have proceeded to transform said government according to 4chan's ideal of the perfect government and are also implementing 4chan lingo into the government itself. I don't think i'll ever be able to get used to this. Even 60 years from now i feel like i'll still remember this period and continue to wonder \"wtf happened there?\"",
                "If you want to use criminal tactics to be successful criminals, hire criminals.",
                "We already know he's working with Elon and Trump. Nothing new.",
                "This is not the level of professionalism we expect from Big Balls.",
                "SOB ... 28 years, 3 time polygraphed ... friends I hadn't seen in years contacted by Suits & Ray-Bans and they let this little fucker have free reign over entire CRITICAL systems???\n\nI'm fucking pissed.\n\nTHIS should get people out in the streets!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Brazil Supreme Court to put Bolsonaro on trial for alleged coup attempt",
            "external_url": "https://www.reuters.com/world/americas/brazil-top-court-justice-recommends-that-bolsonaro-stand-trial-alleged-coup-2025-03-26/",
            "upvotes": 5206,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Good job Brazil. I like it when people are held accountable for their actions.",
                "Wow, just imagine what we could have had if Merrick Garland hadn’t been an absolutely worthless piece of shit.",
                "That's wild, I thought you were supposed re-elect people who attempt coups...",
                "Accountability for actions?! What’s this nonsense!",
                "Good job brazil 👏🏾 this is what america shouldve done with our felon in chief",
                "So South Korea and Brazil have better democracies than the United States.",
                "Brazil picking up a lot of ground against USA when it comes to accountability and corruption. What’s curious is that Brazil always copies American politics, but now are forging their own path. Good for them and I hope the crime rate gets fixed next.",
                "Thank you Merrick Garland, for showing the world the dangers of a pathetically weak judicial system.  May they learn from our incompetence. \n\nMerrick Garland will go down in history as the enabler of American Fascism .",
                "Hey look, a real country with a functioning legal system.",
                "Imprison his fascist ass"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "The Atlantic publishes additional trove of Signal messages with details of Yemen strike",
            "external_url": "https://www.cnn.com/2025/03/26/politics/the-atlantic-publishes-signal-messages-yemen-strike/index.html",
            "upvotes": 11236,
            "date": "03/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2204323444.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So we already knew every single turd in the committee hearings yesterday straight-up lied, prompting The Atlantic to post the rest of the transcripts.\n\nPlease, Senate Intelligence Committee, lay it on them THICK today.",
                "The Trump admin trying to downplay this is the most pathetic thing they've done in months. 'only the best people'. All Trump supporters are rubes.",
                "Looks like there was one responsible adult in this mess.\n\n>  “We did redact one piece of information because we felt, on our own, that we felt it was best to do. And the CIA asked us, but, you know, at a certain point, the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves,” \n\n-- Jeffrey Goldberg\n\n> “Weather is FAVORABLE. Just CONFIRMED w/CENTCOM we are a GO for mission launch,” Hegseth wrote. \n\n> This entire story was another hoax written by a Trump-hater who is well-known for his sensationalist spin,” White House press secretary Karoline Leavitt said \n\n> “You’re talking about a deceitful and highly discredited so-called journalist who’s made a profession of peddling hoaxes time and time again,” Hegseth said. \n\n> Britt  Hume was quick to point out the glaring flaw in Hegseth’s excuse: It wasn’t a hoax, as the National Security Council confirmed that the messages accidentally sent to Goldberg were legit:",
                "Goldberg is being incredibly patriotic here, he is taking on a great personal risk against a regime that controls the most powerful government in the world. This regime is made up of truly incompetent bad faith actors, we should all remember that moving forward, whatever happens- these people running our country are incredibly dumb. They can be defeated.",
                "Not a day goes by that this clown fiesta of an administration fails to blow my mind.",
                "Funny how the GOP used to have fake outrage fits out of things 1,000 times smaller than this.",
                "I don't even get what the point of him sharing all these details in real time with that group chat to begin with? Just send a recap when it's over. It's like he was trying to show off or some shit",
                "*\"the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves\"*\n\nBrilliant. Absolutely calling their bluff.",
                "Already lots of bots on twitter trying to claim this is all fine. Not sure what else I expected.",
                "I do find it so funny that half of these clowns will wax for hours about how much money we burned in Ukraine or whatever, but these strike packages are big emoji worthy after burning whatever the cost in munitions, fuel and logistics were."
            ],
            "aggregate_sentiment": 87.0
        },
        {
            "category": "HOT",
            "title": "Second woman is strangled during an overnight visit at the same California prison",
            "external_url": "https://www.nbcnews.com/news/us-news/second-woman-strangled-overnight-visit-california-prison-rcna197785",
            "upvotes": 2702,
            "date": "03/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250324-Stephanie-Dowells-se-12313p-58faba.jpg",
            "top_comments": [
                "from the article:\n\n24 March 2025\n\nThe family of a woman who died of strangulation during an overnight visit with her husband at a California prison is questioning why a man convicted of murdering four people was allowed to have family visits:\n\n>Stephanie Diane Dowells, 62, who also went by the name Stephanie Brinson, was killed in November, making her the second person in a year to die at Mule Creek State Prison in Ione during a family visit, according to the California Department of Corrections and Rehabilitation.\n\n>The other victim, Tania Thomas, 47, was also strangled during a family visit, Amador County District Attorney Todd Riebe said in an interview Monday. The man she was visiting has been charged with murder in connection with her killing, Riebe said.\n\n>Dowells, a hairdresser, was killed while visiting her husband, David Brinson, 54, who was convicted in the 1990s of murdering four men during a robbery, and sentenced to four consecutive life terms without the possibility of parole.\n\n>After Brinson called prison officials at 2:04 a.m. on Nov. 13 to tell them his wife had passed out, officers immediately began life-saving measures and called 911, a spokesperson for the California Department of Corrections and Rehabilitation said. \n\n>But Dowells was pronounced dead a short time later.\n\n>Dowells’ killing remains under investigation by prison officials and the district attorney’s office, the spokesperson said. \n\n>Riebe said charges are pending prison and autopsy reports.",
                "They might wanna stop these visits altogether.\n\nOr at least give these ladies a f'ng panic button?\n\n\"He's coming in for the kill! AGAIN!\"",
                "Absolutely insane that someone serving four life sentences for murder was allowed unsupervised overnight visits. Then it happens TWICE at the same prison? The system completely failed these women.\n\nThe fact that her son didn't even know his mom's husband had murdered four people is heartbreaking. They trusted this man enough to let their 3 year old visit him. Like what kind of vetting process is the prison using? The prison needs to answer for this. These weren't random acts they gave violent offenders private access to vulnerable visitors. How many more women need to die before they fix this broken system?",
                "I know I'm victim blaming here but why would you want to go have sex with someone who's been convicted of murdering 4 people?",
                "So many valid questions but I wonder “Why would you kill someone that is still willing to have sex with you?” \nI mean that probably means this also was the last time they will ever have sex.",
                "It’s almost as if giving serial killers special privileges in prison is a bad idea.",
                "In relation to the prison in the article, Mule Creek State Prison is roughly 15 miles away from me and I interviewed there for a state gov't IT position as an onsite Network and PC tech. It's kind of a crazy place because there are unsupervised prisoners there doing maintenance tasks, just walking around albeit in orange prison suits. Later on when I went to work at a nearby casino, one of my reports was a former corrections officer at that prison and he told me that most of those guys are \"short-timers\" or had mild offenses on good behavior. I asked \"Has anybody run off before?\" He says \"Of course. These guys are the dumbest guys on the planet. One fellow had his girlfriend pick him up in the parking lot and they took off. Sheriff caught them in an under hour. Guy added five years to his term for pulling that stunt.\" Before that he was literally 4 weeks away from his release date.",
                "Why are sex visits allowed at all?",
                "[removed]",
                "Like someone said in the last thread about this, homeboy is going to end up in a trash bag pretty soon because goodbye conjugal visits!"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Trump takes bid to slash teacher training funds to US Supreme Court",
            "external_url": "https://www.reuters.com/world/us/trump-takes-bid-slash-teacher-training-funds-us-supreme-court-2025-03-26/",
            "upvotes": 2471,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump hates americans",
                "From the article:\n\ntrump “says funds promote divisive ideologies.”\n\nThis fucking guy.",
                "Is Trump following orders from Putin to destroy our country?",
                "Conservatives will bend over backwards to tell you that less teachers, and less educated teachers, is a good thing.",
                "Republicans love the uneducated, and there's no way this could be bad for America, right? Stone age America looks like the next step for the G.O.P.",
                "Great.  Uneducated educators teaching education.   Just what we need.  A whole generation of lost children.",
                "“I love the poorly educated.” -Krasnov",
                "Another Trump movie I hadn't heard of,\nIf he does enough stuff maybe we won't notice him stuffing his pockets.",
                "They say they’re for the working class. Why does that never include teachers?",
                "Dear Supreme Court, please slap down the 🍊🤡. We appreciate it. Sincerely, ethical Americans"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "3 teen girls try to stab mom for turning off Wi-Fi: Sheriff",
            "external_url": "https://abcnews.go.com/US/3-teens-stab-mom-turning-off-wi-fi/story?id=120126479",
            "upvotes": 4742,
            "date": "03/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/57abeb79-c721-4134-b0bf-7962bc0fec4b/teens-wifi-stabbing-ktrk-jef-250325_1742907203519_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "> Because the mom turned off the Wi-Fi, the teens allegedly grabbed kitchen knives Sunday night and chased their mother through their Houston home and into the street, according to the sheriff. One of the girls threw a brick that hit their 39-year old mom in the ankle, and the girls' 70-year-old grandmother was knocked over while attempting to protect the mom, the sheriff's office said.\n\nAll three daughters tried to kill their mother over losing the internet. There's something more going on in that family dynamic if this kind of violent outburst happens.",
                "This is the behavior of addicts. I’ve been an addict most of my life. I’ve been clean for years and years but I recognize addictive behavior. Take away my drugs and I would have likely stabbed you at the worst points in my life. Social media is being designed to be addictive and it’s working.",
                "I would say I'm attached to my phone non stop. I am 32 though so for all of my childhood phones were useless, just good enough to call and text on and the odd game of snake. Then as I got into the work place as a young teen smart phones started but they were still \"ok\". Now I know the amount I use my phone is too much, but I'm also an adult that remembers not having one, so in situations where I can't use it, it doesn't bother me. I really do not envy a parent of a child old enough to use a phone.",
                "thank god I grew up in the 2000s when phones were only good for calls and texts and riding bikes all day with your friends till the sun set was still the thing to do ",
                "This seems not very well thought out because who’s going to pay for the WiFi?",
                "...all 3? \n\nLike not one of them said \"wait, what are we doing?\".",
                "I was literally choked by my step son who at the time was 17 because I unplugged the router. He refused to go pick up his mother from work (he had taken her car and dropped her off) because he was in the middle of a League of Legends game. \n\nAt the time I was routinely doing dialysis and very weak, the only way I got him to release me was by biting his hand as hard as I fucking could. And then this little bastard rips the router out of the wall (cable) and throws it in the yard. \n\nThe addiction to the internet is absolutely crazy. Had the same kid punch a hole in my door and assault me again before he was literally thrown out. And then he has the audacity to invite me to his wedding like none of this happened. \n\nI feel for this mom. You love your kids and step kids, but these kids need to learn. Send their asses to jail or juvenile detention before they continue down this path in life.",
                "Bring back mental institutions but with wifi and gaming.  These kids will sign up for it.",
                "As a mom, I would not take them back. They belong to the state now.",
                "The Veldt- Ray Bradbury"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Ukraine’s clandestine book club defies Russia’s push to rewrite history",
            "external_url": "https://www.theguardian.com/world/2025/mar/22/ukraine-clandestine-book-club-defies-russia-push-rewrite-history",
            "upvotes": 38,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/896b995e0cdeffe910df83663974f493652d215d/0_193_5787_3472/master/5787.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=72fc51639e66ad3a0558aeef9f34cdba",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Florida bill to allow teens to work overnight hours on school days moves forward",
            "external_url": "https://www.cbsnews.com/miami/news/florida-senate-panel-advances-bill-to-further-roll-back-child-labor-restrictions/",
            "upvotes": 298,
            "date": "03/27/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/01/29/911b2764-1f3a-4329-9334-1a0bde77de35/thumbnail/1200x630/8ad06d13d3412c1b1b1c5ce56a74ff84/snapshot-41.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Desantis needs to work overnight not the children ……",
                "The party of Family Values! The party that wants Families to Be Together because that makes America strong-\n\nOh no I’m sorry the party of Fuck You Kids I Got Mine Get To Work Plebs. The same people who probably think slaves had it easy with “free room and board and on the job training.”",
                ">Florida Republicans advance bill to expand child labor\n\nFixed the headline",
                "I’m sure this won’t impact their educational performance at all. ",
                "Conservatives will do anything to punish children.",
                "Now the WHOLE family can join in on the fun of slugging it out at a low paying job, making ends meat, while the rich get even richer.  Brought to you by the party of family values.",
                "US is about three months away from being a third world nation .",
                "How does this make society better? Keep wages low, prevent taxes from helping feed kids, then “allow” them to work.",
                "Cuz teenagers need neither sleep nor an education 🤦‍♀️\n\n\n\n\n\"The bill (SB 918) would do away with restrictions on 16- and 17-year-olds, who would be able to work more than eight hours a day on school nights and over 30 hours a week while school is in session, without mandated breaks.\n\n\nIn addition, the measure aims to remove restrictions for 14- and 15-year-olds who have graduated from high school, are home-schooled or attend virtual school.\n\n\nBill sponsor state Rep. Jay Collins, R-Tampa, told the Senate Commerce and Tourism Committee that the bill would bring Florida into line with federal labor laws. Most of the jobs held by teens are in safe environments such as grocery stores, according to Collins.\"\n\n\n*copied and pasted. \n\n\n\n\nJay Collins....if this happens, may his teenagers be the first to work over 8 hours during school weeks. ",
                "Because anything is better then paying people to work.\n\nSMH"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Neptune's auroras are captured in great detail by NASA's Webb telescope",
            "external_url": "https://apnews.com/article/neptune-auroras-webb-telescope-ffac7282bc5ced7e90759728d1d0b96a",
            "upvotes": 55,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"great detail\"\n\n*Adds some green low res noise.*"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Sudanese army retakes Khartoum after nearly two years of fighting, says army chief",
            "external_url": "https://news.sky.com/story/sudanese-army-retakes-capital-khartoum-says-military-chief-after-nearly-two-years-of-fighting-13336219",
            "upvotes": 96,
            "date": "03/26/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-sudan-abdel-fattah-al-burhan_6867860.jpg?20250326181941",
            "top_comments": [
                "Great to see that Sudan is restoring control over its largest city",
                "I don't think either side is exactly ethical, but for the sake of the Sudanese people I hope this awful war is near its end."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Turkish student at Tufts University detained, video shows masked people handcuffing her",
            "external_url": "https://apnews.com/article/tufts-student-detained-massachusetts-immigration-6c3978da98a8d0f39ab311e092ffd892",
            "upvotes": 3543,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Gestapo level shit.  Her lawyer has no idea where she is.",
                "Why are they given till Friday to provide information?\n\nI understand if people disagree with someone’s opinion but they are literally violating the first amendment. And before you say she’s not a us citizen, the first amendment applies to all humans. If they can prove she violated some other law then prove it! Due process exists to protect the government and its people. It’s sad that there are Americans who don’t understand this and worse that there are Americans willing to participate.",
                "Trumps secret police. Extinguish all freedom of speech.",
                "this is INSANE! the article said she wasn't an activist or member of any pro-Palestinian organization. She simply wrote an op-ed article for her campus paper, not even a national media outlet. She didn't organize protests or sit-ins or never was accused of harrassing or accosting Jewish students on campus. And the scary thing about it is that she hasn't even been accused of any crime. Her grad student visa (in the psychology department no less) was terminated on the whims of the Administration.",
                "What are you even supposed to do in this case? Masked unidentified men claiming to be police with unmarked vehicles come to try to take you. Would calling 911 even help? What about self defense? ",
                "They wore facial masks, so they can’t be identified as cowards because cameras are rolling. Simp cowards.",
                "People need to stop being complacent about this kind of stuff. They are detaining people with no due process. It's essentially kidnapping people who don't agree with the government's foreign policies. Whatever the fuck happened to free speech. They allow Nazis to walk around waving Swastika flags, but someone who criticizes Israel gets arrested like this? The double standards and hypocrisy of this government is pathetic. I wouldn't be surprised if the people who criticize Elon and Tesla end up getting kidnapped like this too.",
                "“First they came for” shit, on stanza two already.",
                "Daily, there are crimes happening that are so bad, citizens from other countries would be in the streets in droves if it happened where they live. But in America we're so desensitized now, we barely notice before the next crime happens the following day.  Or hour.",
                "Individuals here on visas should start considering wearing AirTags in the undergarments so their whereabouts can be traced to some extent. Phones are the first thing they go for."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Denmark welcomes US plan to scale back unsolicited Greenland visit",
            "external_url": "https://www.theguardian.com/world/2025/mar/26/denmark-welcomes-us-plan-to-scale-back-unsolicited-greenland-visit",
            "upvotes": 905,
            "date": "03/26/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/87d134bc2d65ed363101ae4b0938a13c5b9ec3d6/0_39_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=93623c877e8967be1827de19a474634c",
            "top_comments": [
                "It's like a sigh of relief that the guy who wasn't invited to the party in the first place decided not to come.",
                "It’s be hilarious if Greenland is the first country to close its borders to US officials.",
                ">Denmark has welcomed the Trump administration’s decision to scale back an unsolicited visit to Greenland as a sign the US is “de-escalating” after the planned trip sparked a diplomatic row with the Arctic island and Denmark.\n\n“We’re very happy you cancelled your plans to see us.”\n\n>The trip was originally to have involved a delegation led by the US second lady, Usha Vance, and including the White House national security adviser, Mike Waltz, visiting the Greenlandic capital, Nuuk, and a dog sled race.\n\nAww, I bet Vance was looking forward to a doggie ride. Good thing Noem wasn’t planning on joining.",
                "According to [Danish newsmedia TV2](https://nyheder.tv2.dk/live/2025-01-06-kampen-om-groenlands-fremtid/amerikanere-stemte-doerklokker-i-nuuk-foer-aflyst-besoeg-siger-steinmetz?entry=2b1ef233-8348-47f6-8219-f8783a4b72cd) they might also have scaled back the visit after American representatives went around in Nuuk to find somebody who would accept a visit to their home from Vance wife... They couldn't find anyone willing to have her visit.",
                "According to Danish news tv2 there were American government officials knocking doors asking if they don't want visits from the Americans and pretty much everyone said no. Probably cancelled cause it would not fit their narrative \n\n\nSource https://nyheder.tv2.dk/live/2025-01-06-kampen-om-groenlands-fremtid/amerikanere-stemte-doerklokker-i-nuuk-foer-aflyst-besoeg-siger-steinmetz?entry=2b1ef233-8348-47f6-8219-f8783a4b72cd",
                "They were not invited. End of.",
                "They are only going in order to to be dicks and not to appreciate Greenlands culture and nature.\n\nSource: I do a lot of things to make me a dick so I know a dick move when I see one.",
                "Canada needs to plan its own state visit to Greenland, but in cooperation with Greenland and Denmark, along with an Inuit delegation from neighbouring Nunavut. Use it to celebrate arctic culture and sovereignty, and sign a mutual arctic defence agreement. It would get a completely different reaction locally (I would assume). American heads would explode.",
                "*“I actually think it is very positive that the Americans are cancelling their visit to the Greenlandic community. Then they will instead make a visit to their own base, Pituffik, and we have nothing against that,” Rasmussen told the Danish broadcaster DR.*\n\nThey're probably secretly wishing that they go to Pituffik and Thule bases and freeze their butts off.",
                "“The short of it is that the cars that were delivered a few days ago are now being brought back home…”\n\nSo they loaded up a bunch of vehicles, flew them 3,300 miles to Greenland, and now they’re packing them back up and returning to DC. How much has this latest clusterfuck cost us?\n\nEdit: typo"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Estonia amends Constitution to strip Russian, Belarusian citizens of right to vote",
            "external_url": "https://news.err.ee/1609644830/estonia-amends-constitution-to-strip-russian-belarusian-citizens-of-right-to-vote",
            "upvotes": 1059,
            "date": "03/26/2025",
            "thumbnail": "https://s.err.ee/photo/crop/2025/03/26/2802038hae96t24.jpg",
            "top_comments": [
                "Wait, Russian and Belarusian citizens were allowed to vote in Estonian elections? This is surprising to me",
                "Does this mean that if you have dual citizenship in both Estonia and either Russia or Belarus, you won't be able to vote?",
                "Definitely not an expert on Estonian politics but on it's face I'm more surprised that was ever something that was allowed in the first place.\n\nLike yeah, you should probably put in the effort to be a citizen of the country you're living in if you want to have a say in how it's run. Unless the naturalization process is totally fucked that seems fine?",
                "Anyone not estonian\\*\\*\\* not just russians and belorussians, weird title",
                "Now this is common sense.",
                "All nationalists- but especially Russian nationalists- are toxic to democracies"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Private Data and Passwords of Senior U.S. Security Officials Found Online",
            "external_url": "https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7?sara_ref=re-so-app-sh",
            "upvotes": 7363,
            "date": "03/26/2025",
            "thumbnail": "https://cdn.prod.www.spiegel.de/images/87ac326a-da00-4ba1-b643-d410f8595cbe_w1200_r1.778_fpx60.66_fpy45.jpg",
            "top_comments": [
                ">To do so, the reporters used commercial people search engines along with hacked customer data that has been published on the web. Those affected by the leaks include National Security Adviser Mike Waltz, Director of National Intelligence Tulsi Gabbard and Secretary of Defense Pete Hegseth.  \n>  \n>Most of these numbers and email addresses are apparently still in use, with some of them linked to profiles on social media platforms like Instagram and LinkedIn. They were used to create Dropbox accounts and profiles in apps that track running data. There are also WhatsApp profiles for the respective phone numbers and even Signal accounts in some cases.  \n>  \n>[...]  \n>National Intelligence Director Gabbard was seemingly more careful with her data than her two male colleagues. She apparently had her own data blocked in the commercial contact search engines that contained the data of Hegseth and Waltz. But her email address was to be found on WikiLeaks and Reddit.  \n>  \n>Gabbard’s email address is available in more than 10 leaks. One of those also contains a partial telephone number, which, when completed, leads to an active WhatsApp account and a Signal profile.  \n>\n>src: https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7  \n  \nI can see quite a few people being very interested in exploiting this.",
                "😂😂😂😂😂\nOf course they are. Why would anyone with empathy or common sense expect competence from this administration???",
                "The clown show continues.\n\nI watch in amazement as the US won the cold war and now a bunch of village idiots absolutely wreck national security and long standing alliances in a couple of weeks.",
                "*Hostile intelligence services could use this publicly available data to hack the communications of those affected by installing spyware on their devices. It is thus conceivable that foreign agents were privy to the Signal chat group in which Gabbard, Waltz and Hegseth discussed a military strike.*\n\nThe headlines come fast and furious from T's desk, but the incompetence of the Admin seems equally propelled.",
                "I bet Trump has a sticky note with passwords on his computer monitor",
                "We are seeing the fall of America in real time. Thanks Republicans!",
                "The soundtrack of the US Government is \"Yackety Sax\"",
                "You just know the clowns in Trump's cabinet answer phishing emails all the time and have probably already infected multiple government systems with malware.",
                "1,395 days 20 hours and 20 minutes left Of this season 😩",
                "My old Xanga account has better security"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Person in Ohio dies of rabies after contracting virus from organ transplant",
            "external_url": "https://www.whio.com/news/local/person-dies-rabies-after-contracting-virus-organ-transplant/HMS5STBDHZESJJ7FU6464OMN3I/",
            "upvotes": 16664,
            "date": "03/26/2025",
            "thumbnail": "https://cmg-cmg-tv-10040-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fcmg%2FYPMX5TX5QVGJJLZSDGUPWR7NGQ.jpg?auth=612d61eb069c04a50f81fce2778338c3c1cbaaf0f16c60a6d2c3cbff7f510de5&width=1200&height=630&smart=true",
            "top_comments": [
                "Wtf. So did the donor die of rabies too or just somehow died before the rabies set in and they didn’t know? So sad",
                "Didn't this happen in an episode of Scrubs?",
                "That's some fuck you in particular level shit.",
                "from the article:\n\n26 March 2025\n\nLUCAS COUNTY — A person died from rabies after receiving a transplanted organ in Lucas County earlier this year:\n\n>The recipient, who had undergone a kidney transplant in December, contracted the viral disease through the donated organ, according to the Toledo-Lucas County Health Department, WTOL reported.\n\n>As the recipient was from Michigan, Michigan’s Department of Health and Human Services worked with the Ohio Department of Health and the Centers for Disease Control and Prevention to investigate the case.\n\n>It marks the first human case of rabies in Michigan since 2009, according to WTOL.\n\n>No additional individuals are at risk of rabies exposure, according to the CDC.\n\n>Kara Steele, a representative from Life Connection of Ohio, could not comment on the specific case but explained to WTOL that a donor risk assessment interview is conducted before any organ donation.\n\n>The identities of both the recipient and the donor have not been released.\n\n>The facility where the transplant took place has also not been disclosed. \n\n>However, according to the University of Toledo Medical Center’s website, it is the only organ transplant center in northwest Ohio.\n\n>Fewer than 10 people in the United States die from rabies each year, according to the CDC.",
                "There are other viruses where this has happened. There was a case that a donor got LCMV from his pet hamster and got into an accident.  7 out of 8 donors who go his organs died of LCMV, which is not considered wildly dangerous in humans.\n\nhttps://www.nejm.org/doi/full/10.1056/NEJMoa053240",
                "The donor had rabies, but died of something else? This is really bizarre.",
                "Maybe this is a question for a different subreddit.\n\nIf they figured this out shortly after the transplant could the recipient be saved by getting the rabies vaccine?    I am wondering if this is similar to having been bitten... it is in your body but is hasn't gotten into... the nerves(?) enough that the vaccine can help.  Maybe a transplant would be too much rabies all at once or in the wrong part of your body for the rabies treatment to be effective.",
                "That is absolutely tragic. And one of THE WORST ways to die :( \n\nImagine having your brain literally liquified in real-time, as you lose all comprehension of the people and world around you, except for intense and overwhelming fear and confusion.",
                "first comment on the article:\n\nsandytratt1 hour ago\n\nIn 2012 at this same hospital they threw a donor kidney into the trash during a transplant surgery. The poor woman eventually managed to get her transplant months later but the organ accidentally thrown out had been a perfect match donated by her brother.",
                "Someone check on Dr. Cox."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Dollar Tree sells Family Dollar to private equity firms",
            "external_url": "https://www.denver7.com/business/company-news/dollar-tree-sells-family-dollar-to-private-equity-firms",
            "upvotes": 540,
            "date": "03/26/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/f8635c0/2147483647/strip/true/crop/4939x2593+0+350/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F77%2Ff4%2F2502043d486aa4c49ca67482fd65%2Fap25085398616989.jpg",
            "top_comments": [
                "Family Dollar is toast. Private equity destroys everything it touches. They sink the ship while looting its hold every time.",
                ">Dollar Tree had been scouting options for Family Dollar for a while and said Wednesday that the sale to Brigade Capital Management and Macellum Capital Management will allow it to focus on its core business.\n\nBrigade Capital won some private equity award in the same year it was defrauded in a Ponzi scheme. Macellum Capital doesn't have a wiki page and LinkedIn shows they have 2-10 employees.",
                "Gonna get saddled with someone elses debt and crumble.",
                "2 years until closing is my bet ",
                "really unfortunate for all the people stuck in food deserts where family dollar is often the only store",
                "Family dollar was already doing poorly.  Once Dollar Tree added non-\"dollar\" items it didn't make any sense to be running both brands either so it makes sense.",
                ">Dollar Tree sells Family Dollar to private equity firms\n\nIn related news... Family Dollar raises prices to $20.",
                "How can you enshittify that which is already shit?",
                "Whelp, they've already out competed all the small mom and pop grocers that used to be in the rural towns where i grew up. Not one left. Now the dollar stores will go bankrupt and leave food deserts where you have to drive 45 minutes to get to the closest grocery store. Late stage capitalism at its best",
                "I might be wrong, but private equity seems to be the nice way of saying parasites. Does private equity actually do any good ?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Florida bill to allow teens to work overnight hours on school days moves forward",
            "external_url": "https://www.cbsnews.com/miami/news/florida-senate-panel-advances-bill-to-further-roll-back-child-labor-restrictions/",
            "upvotes": 299,
            "date": "03/27/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/01/29/911b2764-1f3a-4329-9334-1a0bde77de35/thumbnail/1200x630/8ad06d13d3412c1b1b1c5ce56a74ff84/snapshot-41.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Desantis needs to work overnight not the children ……",
                "The party of Family Values! The party that wants Families to Be Together because that makes America strong-\n\nOh no I’m sorry the party of Fuck You Kids I Got Mine Get To Work Plebs. The same people who probably think slaves had it easy with “free room and board and on the job training.”",
                ">Florida Republicans advance bill to expand child labor\n\nFixed the headline",
                "I’m sure this won’t impact their educational performance at all. ",
                "Conservatives will do anything to punish children.",
                "Now the WHOLE family can join in on the fun of slugging it out at a low paying job, making ends meat, while the rich get even richer.  Brought to you by the party of family values.",
                "US is about three months away from being a third world nation .",
                "How does this make society better? Keep wages low, prevent taxes from helping feed kids, then “allow” them to work.",
                "Cuz teenagers need neither sleep nor an education 🤦‍♀️\n\n\n\n\n\"The bill (SB 918) would do away with restrictions on 16- and 17-year-olds, who would be able to work more than eight hours a day on school nights and over 30 hours a week while school is in session, without mandated breaks.\n\n\nIn addition, the measure aims to remove restrictions for 14- and 15-year-olds who have graduated from high school, are home-schooled or attend virtual school.\n\n\nBill sponsor state Rep. Jay Collins, R-Tampa, told the Senate Commerce and Tourism Committee that the bill would bring Florida into line with federal labor laws. Most of the jobs held by teens are in safe environments such as grocery stores, according to Collins.\"\n\n\n*copied and pasted. \n\n\n\n\nJay Collins....if this happens, may his teenagers be the first to work over 8 hours during school weeks. ",
                "Because anything is better then paying people to work.\n\nSMH"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Private Data and Passwords of Senior U.S. Security Officials Found Online",
            "external_url": "https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7?sara_ref=re-so-app-sh",
            "upvotes": 7362,
            "date": "03/26/2025",
            "thumbnail": "https://cdn.prod.www.spiegel.de/images/87ac326a-da00-4ba1-b643-d410f8595cbe_w1200_r1.778_fpx60.66_fpy45.jpg",
            "top_comments": [
                ">To do so, the reporters used commercial people search engines along with hacked customer data that has been published on the web. Those affected by the leaks include National Security Adviser Mike Waltz, Director of National Intelligence Tulsi Gabbard and Secretary of Defense Pete Hegseth.  \n>  \n>Most of these numbers and email addresses are apparently still in use, with some of them linked to profiles on social media platforms like Instagram and LinkedIn. They were used to create Dropbox accounts and profiles in apps that track running data. There are also WhatsApp profiles for the respective phone numbers and even Signal accounts in some cases.  \n>  \n>[...]  \n>National Intelligence Director Gabbard was seemingly more careful with her data than her two male colleagues. She apparently had her own data blocked in the commercial contact search engines that contained the data of Hegseth and Waltz. But her email address was to be found on WikiLeaks and Reddit.  \n>  \n>Gabbard’s email address is available in more than 10 leaks. One of those also contains a partial telephone number, which, when completed, leads to an active WhatsApp account and a Signal profile.  \n>\n>src: https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7  \n  \nI can see quite a few people being very interested in exploiting this.",
                "😂😂😂😂😂\nOf course they are. Why would anyone with empathy or common sense expect competence from this administration???",
                "The clown show continues.\n\nI watch in amazement as the US won the cold war and now a bunch of village idiots absolutely wreck national security and long standing alliances in a couple of weeks.",
                "*Hostile intelligence services could use this publicly available data to hack the communications of those affected by installing spyware on their devices. It is thus conceivable that foreign agents were privy to the Signal chat group in which Gabbard, Waltz and Hegseth discussed a military strike.*\n\nThe headlines come fast and furious from T's desk, but the incompetence of the Admin seems equally propelled.",
                "I bet Trump has a sticky note with passwords on his computer monitor",
                "We are seeing the fall of America in real time. Thanks Republicans!",
                "The soundtrack of the US Government is \"Yackety Sax\"",
                "You just know the clowns in Trump's cabinet answer phishing emails all the time and have probably already infected multiple government systems with malware.",
                "1,395 days 20 hours and 20 minutes left Of this season 😩",
                "My old Xanga account has better security"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Estonia amends Constitution to strip Russian, Belarusian citizens of right to vote",
            "external_url": "https://news.err.ee/1609644830/estonia-amends-constitution-to-strip-russian-belarusian-citizens-of-right-to-vote",
            "upvotes": 1053,
            "date": "03/26/2025",
            "thumbnail": "https://s.err.ee/photo/crop/2025/03/26/2802038hae96t24.jpg",
            "top_comments": [
                "Wait, Russian and Belarusian citizens were allowed to vote in Estonian elections? This is surprising to me",
                "Does this mean that if you have dual citizenship in both Estonia and either Russia or Belarus, you won't be able to vote?",
                "Definitely not an expert on Estonian politics but on it's face I'm more surprised that was ever something that was allowed in the first place.\n\nLike yeah, you should probably put in the effort to be a citizen of the country you're living in if you want to have a say in how it's run. Unless the naturalization process is totally fucked that seems fine?",
                "Anyone not estonian\\*\\*\\* not just russians and belorussians, weird title",
                "Now this is common sense.",
                "All nationalists- but especially Russian nationalists- are toxic to democracies"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Turkish student at Tufts University detained, video shows masked people handcuffing her",
            "external_url": "https://apnews.com/article/tufts-student-detained-massachusetts-immigration-6c3978da98a8d0f39ab311e092ffd892",
            "upvotes": 3550,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Gestapo level shit.  Her lawyer has no idea where she is.",
                "Why are they given till Friday to provide information?\n\nI understand if people disagree with someone’s opinion but they are literally violating the first amendment. And before you say she’s not a us citizen, the first amendment applies to all humans. If they can prove she violated some other law then prove it! Due process exists to protect the government and its people. It’s sad that there are Americans who don’t understand this and worse that there are Americans willing to participate.",
                "Trumps secret police. Extinguish all freedom of speech.",
                "this is INSANE! the article said she wasn't an activist or member of any pro-Palestinian organization. She simply wrote an op-ed article for her campus paper, not even a national media outlet. She didn't organize protests or sit-ins or never was accused of harrassing or accosting Jewish students on campus. And the scary thing about it is that she hasn't even been accused of any crime. Her grad student visa (in the psychology department no less) was terminated on the whims of the Administration.",
                "What are you even supposed to do in this case? Masked unidentified men claiming to be police with unmarked vehicles come to try to take you. Would calling 911 even help? What about self defense? ",
                "They wore facial masks, so they can’t be identified as cowards because cameras are rolling. Simp cowards.",
                "People need to stop being complacent about this kind of stuff. They are detaining people with no due process. It's essentially kidnapping people who don't agree with the government's foreign policies. Whatever the fuck happened to free speech. They allow Nazis to walk around waving Swastika flags, but someone who criticizes Israel gets arrested like this? The double standards and hypocrisy of this government is pathetic. I wouldn't be surprised if the people who criticize Elon and Tesla end up getting kidnapped like this too.",
                "“First they came for” shit, on stanza two already.",
                "Daily, there are crimes happening that are so bad, citizens from other countries would be in the streets in droves if it happened where they live. But in America we're so desensitized now, we barely notice before the next crime happens the following day.  Or hour.",
                "Individuals here on visas should start considering wearing AirTags in the undergarments so their whereabouts can be traced to some extent. Phones are the first thing they go for."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "Brazil Supreme Court to put Bolsonaro on trial for alleged coup attempt",
            "external_url": "https://www.reuters.com/world/americas/brazil-top-court-justice-recommends-that-bolsonaro-stand-trial-alleged-coup-2025-03-26/",
            "upvotes": 5214,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Good job Brazil. I like it when people are held accountable for their actions.",
                "Wow, just imagine what we could have had if Merrick Garland hadn’t been an absolutely worthless piece of shit.",
                "That's wild, I thought you were supposed re-elect people who attempt coups...",
                "Accountability for actions?! What’s this nonsense!",
                "Good job brazil 👏🏾 this is what america shouldve done with our felon in chief",
                "So South Korea and Brazil have better democracies than the United States.",
                "Brazil picking up a lot of ground against USA when it comes to accountability and corruption. What’s curious is that Brazil always copies American politics, but now are forging their own path. Good for them and I hope the crime rate gets fixed next.",
                "Thank you Merrick Garland, for showing the world the dangers of a pathetically weak judicial system.  May they learn from our incompetence. \n\nMerrick Garland will go down in history as the enabler of American Fascism .",
                "Hey look, a real country with a functioning legal system.",
                "Imprison his fascist ass"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "Denmark welcomes US plan to scale back unsolicited Greenland visit",
            "external_url": "https://www.theguardian.com/world/2025/mar/26/denmark-welcomes-us-plan-to-scale-back-unsolicited-greenland-visit",
            "upvotes": 904,
            "date": "03/26/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/87d134bc2d65ed363101ae4b0938a13c5b9ec3d6/0_39_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=93623c877e8967be1827de19a474634c",
            "top_comments": [
                "It's like a sigh of relief that the guy who wasn't invited to the party in the first place decided not to come.",
                "It’s be hilarious if Greenland is the first country to close its borders to US officials.",
                ">Denmark has welcomed the Trump administration’s decision to scale back an unsolicited visit to Greenland as a sign the US is “de-escalating” after the planned trip sparked a diplomatic row with the Arctic island and Denmark.\n\n“We’re very happy you cancelled your plans to see us.”\n\n>The trip was originally to have involved a delegation led by the US second lady, Usha Vance, and including the White House national security adviser, Mike Waltz, visiting the Greenlandic capital, Nuuk, and a dog sled race.\n\nAww, I bet Vance was looking forward to a doggie ride. Good thing Noem wasn’t planning on joining.",
                "According to [Danish newsmedia TV2](https://nyheder.tv2.dk/live/2025-01-06-kampen-om-groenlands-fremtid/amerikanere-stemte-doerklokker-i-nuuk-foer-aflyst-besoeg-siger-steinmetz?entry=2b1ef233-8348-47f6-8219-f8783a4b72cd) they might also have scaled back the visit after American representatives went around in Nuuk to find somebody who would accept a visit to their home from Vance wife... They couldn't find anyone willing to have her visit.",
                "According to Danish news tv2 there were American government officials knocking doors asking if they don't want visits from the Americans and pretty much everyone said no. Probably cancelled cause it would not fit their narrative \n\n\nSource https://nyheder.tv2.dk/live/2025-01-06-kampen-om-groenlands-fremtid/amerikanere-stemte-doerklokker-i-nuuk-foer-aflyst-besoeg-siger-steinmetz?entry=2b1ef233-8348-47f6-8219-f8783a4b72cd",
                "They were not invited. End of.",
                "They are only going in order to to be dicks and not to appreciate Greenlands culture and nature.\n\nSource: I do a lot of things to make me a dick so I know a dick move when I see one.",
                "Canada needs to plan its own state visit to Greenland, but in cooperation with Greenland and Denmark, along with an Inuit delegation from neighbouring Nunavut. Use it to celebrate arctic culture and sovereignty, and sign a mutual arctic defence agreement. It would get a completely different reaction locally (I would assume). American heads would explode.",
                "*“I actually think it is very positive that the Americans are cancelling their visit to the Greenlandic community. Then they will instead make a visit to their own base, Pituffik, and we have nothing against that,” Rasmussen told the Danish broadcaster DR.*\n\nThey're probably secretly wishing that they go to Pituffik and Thule bases and freeze their butts off.",
                "“The short of it is that the cars that were delivered a few days ago are now being brought back home…”\n\nSo they loaded up a bunch of vehicles, flew them 3,300 miles to Greenland, and now they’re packing them back up and returning to DC. How much has this latest clusterfuck cost us?\n\nEdit: typo"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Illinois returns stolen land to Prairie Band Potawatomi Nation",
            "external_url": "https://abcnews.go.com/US/wireStory/illinois-returns-stolen-land-prairie-band-potawatomi-nation-120144789",
            "upvotes": 1825,
            "date": "03/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/68d4b9ed-826a-487e-9e90-00953dee1db2/wirestory_805f5030d9abbac93ce3da3cec18a636_16x9.jpg?w=1600",
            "top_comments": [
                "[The treaty gave land to some chiefs directly](https://www.archives.gov/news/articles/prairie-du-chien-treaty) and forced the Potawatomi off their lands. The article mentions the chief was visiting family in Kansas when the land was stolen.",
                "I’m still baffled by how little attention our historical treatment and abuse of Native Americans receives in our media and our politics.  They are probably the most marginalized and mistreated of all citizens and very few people seem to care.",
                "This is huge, glad this is happening in my state. ",
                "> He did not rule out constructing a hotel, however, noting that the park, 68 miles (109 kilometers) west of Chicago, has 150 campsites, draws 500,000 visitors a year, and the closest lodging is a 20-minute drive away.\n\nAnd once you have a hotel there you'll need some restaurants.  Probably a gas station or a \"Travel Center\" too.  Maybe an events center, like a place where you could hold concerts.  \n\nAt least that's how it goes in California.",
                "Don't tell Indiana, we'll want it to go along with those Illinois counties that are trying to secede.",
                "So what about the rest of the stolen land a.k.a. the rest of the entire state",
                "Some actual decent news today? Wow",
                "Way too little too late, but damn even this small win is nice",
                "This is a great step! I hope to see more cooperation with Land Back movements to support the indigenous peoples of this land.",
                "Now return the rest of the land"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Person in Ohio dies of rabies after contracting virus from organ transplant",
            "external_url": "https://www.whio.com/news/local/person-dies-rabies-after-contracting-virus-organ-transplant/HMS5STBDHZESJJ7FU6464OMN3I/",
            "upvotes": 16673,
            "date": "03/26/2025",
            "thumbnail": "https://cmg-cmg-tv-10040-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fcmg%2FYPMX5TX5QVGJJLZSDGUPWR7NGQ.jpg?auth=612d61eb069c04a50f81fce2778338c3c1cbaaf0f16c60a6d2c3cbff7f510de5&width=1200&height=630&smart=true",
            "top_comments": [
                "Wtf. So did the donor die of rabies too or just somehow died before the rabies set in and they didn’t know? So sad",
                "Didn't this happen in an episode of Scrubs?",
                "That's some fuck you in particular level shit.",
                "from the article:\n\n26 March 2025\n\nLUCAS COUNTY — A person died from rabies after receiving a transplanted organ in Lucas County earlier this year:\n\n>The recipient, who had undergone a kidney transplant in December, contracted the viral disease through the donated organ, according to the Toledo-Lucas County Health Department, WTOL reported.\n\n>As the recipient was from Michigan, Michigan’s Department of Health and Human Services worked with the Ohio Department of Health and the Centers for Disease Control and Prevention to investigate the case.\n\n>It marks the first human case of rabies in Michigan since 2009, according to WTOL.\n\n>No additional individuals are at risk of rabies exposure, according to the CDC.\n\n>Kara Steele, a representative from Life Connection of Ohio, could not comment on the specific case but explained to WTOL that a donor risk assessment interview is conducted before any organ donation.\n\n>The identities of both the recipient and the donor have not been released.\n\n>The facility where the transplant took place has also not been disclosed. \n\n>However, according to the University of Toledo Medical Center’s website, it is the only organ transplant center in northwest Ohio.\n\n>Fewer than 10 people in the United States die from rabies each year, according to the CDC.",
                "There are other viruses where this has happened. There was a case that a donor got LCMV from his pet hamster and got into an accident.  7 out of 8 donors who go his organs died of LCMV, which is not considered wildly dangerous in humans.\n\nhttps://www.nejm.org/doi/full/10.1056/NEJMoa053240",
                "The donor had rabies, but died of something else? This is really bizarre.",
                "Maybe this is a question for a different subreddit.\n\nIf they figured this out shortly after the transplant could the recipient be saved by getting the rabies vaccine?    I am wondering if this is similar to having been bitten... it is in your body but is hasn't gotten into... the nerves(?) enough that the vaccine can help.  Maybe a transplant would be too much rabies all at once or in the wrong part of your body for the rabies treatment to be effective.",
                "That is absolutely tragic. And one of THE WORST ways to die :( \n\nImagine having your brain literally liquified in real-time, as you lose all comprehension of the people and world around you, except for intense and overwhelming fear and confusion.",
                "first comment on the article:\n\nsandytratt1 hour ago\n\nIn 2012 at this same hospital they threw a donor kidney into the trash during a transplant surgery. The poor woman eventually managed to get her transplant months later but the organ accidentally thrown out had been a perfect match donated by her brother.",
                "Someone check on Dr. Cox."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Trump takes bid to slash teacher training funds to US Supreme Court",
            "external_url": "https://www.reuters.com/world/us/trump-takes-bid-slash-teacher-training-funds-us-supreme-court-2025-03-26/",
            "upvotes": 2472,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump hates americans",
                "From the article:\n\ntrump “says funds promote divisive ideologies.”\n\nThis fucking guy.",
                "Is Trump following orders from Putin to destroy our country?",
                "Conservatives will bend over backwards to tell you that less teachers, and less educated teachers, is a good thing.",
                "Republicans love the uneducated, and there's no way this could be bad for America, right? Stone age America looks like the next step for the G.O.P.",
                "Great.  Uneducated educators teaching education.   Just what we need.  A whole generation of lost children.",
                "“I love the poorly educated.” -Krasnov",
                "Another Trump movie I hadn't heard of,\nIf he does enough stuff maybe we won't notice him stuffing his pockets.",
                "They say they’re for the working class. Why does that never include teachers?",
                "Dear Supreme Court, please slap down the 🍊🤡. We appreciate it. Sincerely, ethical Americans"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "The Atlantic publishes additional trove of Signal messages with details of Yemen strike",
            "external_url": "https://www.cnn.com/2025/03/26/politics/the-atlantic-publishes-signal-messages-yemen-strike/index.html",
            "upvotes": 11238,
            "date": "03/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2204323444.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So we already knew every single turd in the committee hearings yesterday straight-up lied, prompting The Atlantic to post the rest of the transcripts.\n\nPlease, Senate Intelligence Committee, lay it on them THICK today.",
                "The Trump admin trying to downplay this is the most pathetic thing they've done in months. 'only the best people'. All Trump supporters are rubes.",
                "Looks like there was one responsible adult in this mess.\n\n>  “We did redact one piece of information because we felt, on our own, that we felt it was best to do. And the CIA asked us, but, you know, at a certain point, the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves,” \n\n-- Jeffrey Goldberg\n\n> “Weather is FAVORABLE. Just CONFIRMED w/CENTCOM we are a GO for mission launch,” Hegseth wrote. \n\n> This entire story was another hoax written by a Trump-hater who is well-known for his sensationalist spin,” White House press secretary Karoline Leavitt said \n\n> “You’re talking about a deceitful and highly discredited so-called journalist who’s made a profession of peddling hoaxes time and time again,” Hegseth said. \n\n> Britt  Hume was quick to point out the glaring flaw in Hegseth’s excuse: It wasn’t a hoax, as the National Security Council confirmed that the messages accidentally sent to Goldberg were legit:",
                "Goldberg is being incredibly patriotic here, he is taking on a great personal risk against a regime that controls the most powerful government in the world. This regime is made up of truly incompetent bad faith actors, we should all remember that moving forward, whatever happens- these people running our country are incredibly dumb. They can be defeated.",
                "Not a day goes by that this clown fiesta of an administration fails to blow my mind.",
                "Funny how the GOP used to have fake outrage fits out of things 1,000 times smaller than this.",
                "I don't even get what the point of him sharing all these details in real time with that group chat to begin with? Just send a recap when it's over. It's like he was trying to show off or some shit",
                "*\"the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves\"*\n\nBrilliant. Absolutely calling their bluff.",
                "Already lots of bots on twitter trying to claim this is all fine. Not sure what else I expected.",
                "I do find it so funny that half of these clowns will wax for hours about how much money we burned in Ukraine or whatever, but these strike packages are big emoji worthy after burning whatever the cost in munitions, fuel and logistics were."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "03/27/2025 00:40:53 UTC"
}