{
    "posts": [
        {
            "category": "HOT",
            "title": "U.S.-citizen family 'traumatized' after ICE raided their Oklahoma home in search of someone else",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-family-traumatized-ice-raid-rcna203700",
            "upvotes": 11936,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-ice-agent-ch-0916-f8729f.jpg",
            "top_comments": [
                "OKLAHOMA CITY (KFOR) — A woman says her family’s fresh start in Oklahoma turned into a nightmare after federal immigration agents raided their home, **taking their phones, laptops, and life savings** – even though they were not the suspects the agents were looking for.\n\nThe agents had a search warrant for the home, but **the suspects listed on the warrant do not live in the house**.\n\nThe woman who actually lives in the house had just moved to Oklahoma City from Maryland with her family about two weeks earlier..\n\n\"I said you took my phone. We have no money. I just moved here,” the mother said. “I have to feed my children. I’m going to need gas money. I need to be able to get around. Like, how do you just leave me like this? Like an abandoned dog.”\n\nShe said the agents ordered her and her daughters to step outside, even though it was raining and they barely were given time to put on clothes.\n\n“**They wanted me to change in front of all of them, in between all of them**,” she said. “My husband has not even seen my daughter in her undergarments — her own dad, because it’s respectful. **You have her out there, a minor, in her underwear,**” the woman told KFOR.\n\n“One of them said, ‘I know it was a little rough this morning,’” she said. “It was so denigrating. That you do all of this to a family, to women, your fellow citizens. And it was a little rough? You literally traumatized me and my daughters for life. We’re going to have to go get help or get over this somehow.”\n\nBefore the agents left, the mother asked when could the family get their belongings back and they said **it could be days or even months,** KFOR reported.\n\nEdit: Other news sources clarified that **20 men** broke into the house in the middle of the night while they were sleeping. So 20 men surrounded this woman and her three young daughters, dragged them out into the rain in their underwear, and made them change clothes in front of them. If there was any justice in this  country they would be up on charges of sexual exploitation of minors.\n\n2nd Edit: The ~~agents~~ stasi thugs wouldn't even leave a business card or phone number they could call to find out how to get their electronics and life savings back. The ~~agents~~ thieves refused to even tell them which government agency or department would be storing their property.",
                "I wonder if that was a real warrant or one of those ICE administrative warrants? Those should be illegal. If police can make their own warrants, that defeats the whole purpose.",
                "More purposeful domestic terrorism - not incompetence - from maga ICE.",
                "They probably broke a bunch of their stuff too.",
                "The more commonplace this becomes the more commonplace it will be for other countries to compare us to the Russians. Is that what Republicans want?",
                "Has Oklahomas senators or ag commented on this or do they support it?",
                "Not just a raid. This was full on sexual assault and theft. ICE goons deserve to be prosecuted at the Hague like the Nazis they are based on. Instead the US will allow them to do as they please, just like they did with the nazis. Disgusting. I am sad to be american.",
                "How long will it be until non-government thugs decide to do the same thing? It seems to be a huge opportunity for anyone with no morals, and we have seen how many of those are out there. How would anyone know they weren't from the government?",
                "Law enforcement needs to be held accountable\n\nEven if you could agree with what ICE is trying to do, any law enforcement agency should be heavily penalized for raiding the wrong goddamn house!\n\nLike are you fucking serious? Somebody easily could have been killed. These are not our best folks.",
                "I can only imagine, the cruelty of this bunch is astounding."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Middle schooler records himself harassing 5-year-old with ethnic slurs",
            "external_url": "https://www.nbcwashington.com/news/local/northern-virginia/middle-schooler-records-himself-harassing-5-year-old-with-ethnic-slurs/3899952/",
            "upvotes": 12353,
            "date": "04/30/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/04/39225742009-1080pnbcstations.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The 5-year-old went to the door to his house, pleading, “No! Don’t hurt me! Don’t hurt me!”\n\nHe then ran along the porch crying out for other children to help him – “Don’t do it! Save me! Save me!” No one stepped in, and laughter is heard in the background.\n\nThe harassment continued.\n\n“Are you having dumplings for dinner?” the middle schooler asked.\n\nAfter two minutes, the 5-year-old boy’s mother opened the door, and her son ran inside.",
                "As a middle school teacher, sadly I am not suprised.\n\nI teach lots of terrific students, but I'm also exposed to ones that are underparented, undersupervised, and have little ability to function in a civil society.\n\nWe need to find a way to implement consequences for these actions that not only show that we take it seriously, but help the person try to move out of the mindset that lead to this behavior.  Counseling, community service, etc..  Unfortunately, we tend to either do nothing, or incarcerate them once it escalates to violence. Nothing to stop it before that point.",
                "What’s up with middle schoolers and being the worst people possible?",
                "5... pre-k / kindergarten age. This middle school was at least twice their age. Shame on them, and shame on their parents.",
                "seeing that poor child running to his door and putting the towel over his face is so fucking sad. those middle school kids deserve the worst, they know better than to bully a fucking toddler less than half their age. as someone from the area, these types of middle schoolers grow up into the shittiest and most entitled high schoolers who have never faced consequences",
                "Five year olds are literally, and I mean *literally*, just living their best lives. Sure, they have trouble with emotional control sometimes and have meltdowns, but that also means they’re kind when none of us would be kind, they’re happy when none of us would be happy, they’re friendly when none of us would be friendly, they’re inquisitive and funny and compassionate and…just insert all the traits we as adults say we strive for. \n\nSo to see a five year old have this kind of malicious fear deliberately inflicted on them… \n\nI would be hunting the parents down. And I mean that in a predatory sense.",
                "I wish all hell on the parents who raised that middle school bastard. \n\nI was a middle schooler. I raised middle schoolers. This is not normal and no talk of hormones will make me believe it is.",
                "Wow, my heart breaks for the little boy and his parents. But especially the little boy.\n\nCrazy thing is this school says it’s not their problem and police are being silent.\n\nThe community is going to demand justice and this won’t go quietly until people feel the middle schooler(s) are punished justly.\n\nIf this happened to my child, it would take everything in my power to not be vindictive. I don’t think I could remain peaceful.",
                "Genius kid-must have learned it from the parents",
                "Very few things make me as angry as seeing bullying like this.  I was bullied as a child and even did some myself when I was young and trying to sort out my way.  I always feel bad about my part, and wish I could go back and apologize to those I hurt."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "$800,000 in dimes spills onto North Texas highway",
            "external_url": "https://www.fox4news.com/news/truckload-dimes-spills-onto-wise-county-highway",
            "upvotes": 1768,
            "date": "04/30/2025",
            "thumbnail": "https://images.foxtv.com/static.fox4news.com/www.fox4news.com/content/uploads/2025/04/1280/720/dimes.jpg?ve=1&tl=1",
            "top_comments": [
                "_\"Somebody's gotta go back and get a shitload of dimes!\"_",
                "I would have liked to hear the sound of the spill.",
                "Good that road needed a major change",
                "This feels like the start of a probability question.",
                "Someone’s paying everyone’s toll on the Le Petomane Thruway.",
                "The nearby coinstar is going to be a hotspot for a few days.",
                "It sounds like one of \"greed\" dreams I used to have when I was down and out.  I'd be grasping for the dimes and then wake up....",
                "How will anyone ever count all $600,000 worth of dimes?",
                "Le Petomane Thruway? Now what'll that asshole think of next?",
                "Is this the March of Dimes I keep getting letters about?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Supreme Court hears arguments over publicly funded Catholic charter school in Oklahoma",
            "external_url": "https://apnews.com/article/supreme-court-religious-catholic-charter-school-oklahoma-983ed57aabeae53e4b58367c5021f5e1",
            "upvotes": 9103,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This one’s gonna suck. They love their private schools being funded by state tax dollars. This is gonna be a big blow to public education…",
                ">Justice Amy Coney Barrett recused herself without explanation. Barrett previously taught law at Notre Dame and is close friends with Notre Dame law professor Nicole Garnett, a leading proponent of publicly funded religious charter schools.\n\nWow a justice doing something right for a change.",
                " If this is allowed, red states are only going to fund religious schools.  Prepare for a complete backslide into the middle ages.",
                "I know someone in Ohio who makes about $250,000 household income that gets free tuition and PUBLIC SCHOOL bus transportation with a voucher program for their three kids. Shit like this already happens.",
                "We don’t want religious schools.\n\nTeach science, not “god’s word” (which is actually man’s word from 3000 years ago and edits ever since).",
                "It’s not a real catholic school a real\nCatholic school wouldn’t need public funding.  It’s a for profit school gaining public money from under the guise of religious education",
                "How did this even make it to scotus? This is an obvious \"F*** no\"",
                "Honestly, props to Coney Barrett for recusing herself.",
                "Republicans are fake patriots",
                "I hope The Church of Satan starts a charter school."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Federal judge in Vermont orders release of Columbia student Mohsen Mahdawi",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/mohsen-mahdawi-released-immigration-detention",
            "upvotes": 5362,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7128145d98ae03c483a557284594d0e9089104ba/0_0_3769_2261/master/3769.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4a5217dac0e17adb2b1b93b9c49660b0",
            "top_comments": [
                "[He’s been released](https://abcnews.go.com/US/lawyers-columbia-student-detained-ice-seek-release-case/story?id=121317902)\n\nI honestly think that contempt threat scared them straight, at least for now",
                "Hence why they try and relocate these people to Louisiana etc immediately to avoid these more liberal federal judges.",
                "> In new court filings submitted on Monday, the justice department included a two-page letter from Marco Rubio, the US secretary of state, saying that Mahdawi’s activities and presence in the US “undermines US policy to combat antisemitism” according to NPR, and that his activities could “potentially undermine the peace process underway in the Middle East”.\n\nWhat fucking peace process? Trump boasted about turning Gaza into a Trump resort. He quite literally supported the idea of a genocide because it was \"good business\".\n\n> Judge Crawford noted at Wednesday's hearing that Mahdawi received letters of support from over 90 community members, including members of the Jewish community, \"who have in a consistent pattern described him as peaceful.\"\n\nI bet they'll claim that those aren't real Jews or something. I fucking hate this administration.",
                "How cute, a judicial order? That’s a crime against trump now, so jail for the judge and the order goes in the special filing cabinet for corporate memos 🗑️",
                "Tomorrow we will see this judge arrested",
                "Request: where are we in the timeline in the Garcia case anyway? Wasn't there a deadline yesterday?",
                "Good! Now free Mahmoud Kahlil.\n\nI’m Jewish. I’d rather have these two men as neighbors than any of the chuds on my block.",
                "Thank goodness. I am worried for the safety of the judge, but this was absolutely needed.",
                "It's important to realise he's been released but that the removal proceedings continue; he's just not in prison while they do so.",
                "He's getting arrested next.."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Invasive Chinese crab that can scale walls spotted for 1st time in US Pacific Northwest",
            "external_url": "https://www.denver7.com/us-news/weird/invasive-chinese-crab-that-can-scale-walls-spotted-for-1st-time-in-us-pacific-northwest",
            "upvotes": 1852,
            "date": "04/30/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/07edff2/2147483647/strip/true/crop/500x263+0+36/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fb5%2Fe5%2Fa0756c304cae8652c5666823a8b6%2Fshutterstock-149549846.jpg",
            "top_comments": [
                "Please tell me they taste good with garlic butter and I'll join the eradication squad.",
                "Slap a 25% tariff on them.",
                "Thankfully the PNW has excellent resources for marine life management.",
                ">\"While this is a rare event in Oregon, mitten crabs caused significant infrastructure and ecological damage in and around San Francisco Bay when the population was at its height in the late 1990s,\" the ODFW said in a statement. \"So, it is important to correctly identify this species and report it to your local ODFW office with the location found.\n\nChinese mitten crab sounds like an adorable name for a crab.",
                "\\*Sigh\n\nGet my cracker and some butter.",
                "Build higher walls to keep out the crabs! And make them pay for it!!! ",
                "I mean if they taste good I can strip a steamed crab down to the meat in about 2 minutes.",
                "Two questions:\n\n1. Are they edible?\n\n2. Do they taste good?",
                "Can we attack its weak point for massive damage?",
                "Time to bust out the garlic and butter.\n\n\nMaybe some black bean sauce crab?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "11 high schoolers ordered to surrender after lacrosse team hazing in upstate New York",
            "external_url": "https://www.nbcnews.com/news/us-news/high-schoolers-lacrosse-team-hazing-rcna203662",
            "upvotes": 1579,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-westhill-high-school-vl-909a-2fe878.jpg",
            "top_comments": [
                "This is a huge deal for CNY. In a lot of areas of the country Lacrosse is considered a prep-school sport for wealthy kids. In Syracuse metro area it's ingrained in the entire culture. The cancellation of the season can mean the difference for some of these seniors being offered D1 scholarships and being lucky to have a D3 team willing to take them on as walk on's after pulling this shit. Bunch of fucking idiots and they absolutely deserve full punishment.",
                "No one should receive scholarships after participating in hazing",
                "Geez. When I was in high school, the “hazing” for the band only involved getting water balloons and shaving cream thrown at you.",
                "Senior year of high school, 5 or 6 lacrosse players were expelled for hazing a younger player. My understanding is teabagging and some violating acts with lacross sticks is what happened. Still don’t understand how they were not charged with anything but that was 20+ years ago",
                "One victim reported that he went to a lacrosse game and then McDonald's with upperclassmen. But the evening took a turn when he said he was taken to a remote wooded area in the county after the driver of the vehicle pretended to be lost.\n\n“At some point by prearrangement, people came out of the woods all dressed in black. They were armed with what appeared to be at least one handgun and at least one knife,” Fitzpatrick said. “The individual had a pillowcase placed over his head, he was tied up and placed in the trunk of a car.”\n\nThe district attorney said he saw videotape of the incident.\n\n“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,”",
                "Hazing usually doesn't involve a loaded firearm...",
                "*“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,” Fitzpatrick added*\n\nThis almost would have been the least of my worries, given the horrible scenes he had just endured. As in leave me alone anywhere--even on the moon, anything but  what your threatening arms and masks implied.",
                "We still have hazing incidents?  WTF? They get what they deserve.",
                "Hazing is making the pledges dress up in tutus and do interpretive dance in the quad or chucking balloons full of ketchup at them. It does not involve brandishing lethal weapons in a secluded forest. These idiots should all be charged with felony crimes, and the judge should order the lacrosse program shut down for a year. \"But they're just kids!\" They showed up with pistol. Pistols are for killing people. Fuck these \"kids\".",
                "Weapons use? Kidnapping in car trunks? Need to set an example. Turn yourself in and pay a ticket is not setting an example it seems."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Visa wants to give artificial intelligence 'agents' your credit card",
            "external_url": "https://apnews.com/article/ai-artificial-intelligence-5dfa1da145689e7951a181e2253ab349",
            "upvotes": 392,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Ideas by someone who’s never used a chatbot before”",
                "Yet another AI thing I don’t want and that won’t ever function correctly anyway.",
                "\\*reads article\\* This sounds incredibly useless.",
                "What people want: robot that folds clothes, empties dishwasher, gives them more free time.\n\nWhat tech makes: robot that you pay to shop for you.\n\nWhat's next, a robot that lists it all on Buy Nothing before it even gets back to the house?",
                "It does your grocery shopping for you?  Ha, so instead of incessant advertising trying to get you to choose such-and-such brand, they can just pay whoever runs the AI to decide you want their brand and cut out the human influencing part.  \n\nA new age of marketing is upon us.  I wonder what kind of euphemistic name that'll have.",
                "Man its a good thing I dont have a credit card and im poor as fuck lmfao",
                "Like hell I'm gonna use an AI to book travel; even if I trusted that it had the capacity to find the best deal, the bank would just end up making deals with various hotels and airlines to have it prioritize them regardless of price. Wherever there's extra profit to be made, companies will try to squeeze it out of you.",
                "Not a chance in hell, Visa/ Samsung.   Uf you actually develop this, I will cut up all of my visa cards.",
                "I fail to see how this will work. “Buy me a sweater” OK, here’s the sweatshop that bought the Google Ad space to appear in the recommended/shop results for a sweater. Congrats on your latest purchase that won’t survive the wash.",
                "Talk about the stripping away of human agency.  And so much more of our lives being programmed out of our control. We become more like Things than the things that control us."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Some 55,000 Los Angeles County workers walk out in 2-day strike, pausing operations",
            "external_url": "https://abcnews.go.com/US/55000-los-angeles-county-workers-walk-2-day/story?id=121289727",
            "upvotes": 14257,
            "date": "04/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6c746ab5-3125-4990-b523-ca2297d5455d/la-strike-01-ap-jt-250429_1745952356016_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Excuse for not paying their workers more:\n\n>The county also cited \"unprecedented stresses on our budget\" including a $4 billion settlement of thousands of childhood sexual assault claims brought under AB 218,\n\nThat sounds very much like a you problem.",
                "I can't recall a more color coordinated US strike.  Purple works well even from helicopter level.",
                "Mayday is coming people. Join in.",
                "We need lots more of this. Call off work on the 1st! [https://actionnetwork.org/event\\_campaigns/general-protest-mayday-of-action](https://actionnetwork.org/event_campaigns/general-protest-mayday-of-action)",
                "Stickin' it to the man... In solidarity.",
                "SEIU Strong! The county has been working hard to put out messaging that the union’s demands are inappropriate and irresponsible. All we are asking for is cost of living adjustments, an end to contracting out positions (which costs more and leads to higher turnover which is unsafe for county services), and a strong enough contract to fill vacancies. LA county jobs used to be coveted, for fair pay and benefits, as well as respect and dignity at work. Now some of our members can barely afford rent, are overworked, burned out, and ready for change. Our 55k members are involved in almost every county service, including parks and rec, healthcare, social services, and mental health. We are the county safety net!",
                "How about 1-week long mass-strike/mass-protest across the US?",
                "I haven't seen this on any news feeds how come? There is also a school shooting in Texas and it was hardly even a blip. There's some weird suppression activities going on but Obama forgetting to salute is around 90 million views.",
                "AB 218 is a law that extends the statute of limitations for sexual assault victims. Many of the cases occurred in the 60’s and 70’s. Only the victim is alive, and nobody connected with assault is at the facility anymore. Most organizations (school districts for example) have insurance for when things need a big payout like this, but you can’t get insurance to pay out for sexual assaults in these cases as the insuring organization when the crime was committed have been gone out of business and current insurance plans do not cover this kind of crime.  That means the payout comes from a general fund, the same fund that they pay their employees from and where they find money to fix facilities. \n\nI’m not denying the heinous nature of the crimes these sexual assault survivors have had to endure, or the long term effects of those acts, how it likely played a role in many of not all of their actions and decisions since. But in many cases nobody connected with the crimes works for the organization anymore and hasn’t been for decades, but they are left with the bill. \n\nBecause of these cases there has been a significant shortfall in funding for nurses, teachers and other affected industries as they have had to pay out millions to victims that would have otherwise gone to increase pay for their staff. \n\nI am not trying to diminish anyone’s suffering but it’s like someone saying they were assaulted in a house 50 years ago and even though you moved in 5 years ago you’re responsible for crime because you live there now.\n\n\nSource: I am a school board member in a small district (we thankfully have not had an cases of SA) who participated in a legislative advocacy and AB 218 was one of the bills we discussed",
                "Watch Trump send in federal troops to \"quell the rioting\"."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "US and Ukraine sign minerals deal that solidifies investment in Kyiv’s defense against Russia administration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/us-ukraine-minerals-deal-russia",
            "upvotes": 176,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d35efa338b1a438e259e78e6017f968274c758b8/0_44_4744_2847/master/4744.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0107bb8b2b102056ea9386bb8f54cc28",
            "top_comments": [
                "*The US and* [*Kyiv*](https://www.theguardian.com/world/ukraine) *have signed an agreement to share profits and royalties from the future sale of Ukrainian minerals and rare earths, sealing a deal that Donald Trump has said will provide an economic incentive for the US to continue to invest in Ukraine’s defense and its reconstruction after he brokers a peace deal with Russia.*\n\nI've read tens of articles on \"the mineral deal\" but never seen a single reference to what the minerals are how they will be mined. Thus, I really wonder how real the projected \"profits and royalties\" to be shared by the two countries. I think most of all this is just political show.  But maybe now we'll see just how real the minerals are. For starters, what are they exactly??",
                "Making a deal with the devil isn't good but sometimes necessary.",
                "“We’re well aware that this loan is predatory, but fuck them kids, we’re doin usury anyways.”",
                "Turns out “sign this deal or I’ll let that guy murder you” is a pretty persuasive argument…",
                "Ukraine should sign a mineral “assurance” that they’ll let the us invest there. And follow through with the same vigor that the us did in the Budapest memorandum when they convinced Ukraine to give up its nuclear defence.",
                "I think it's overall a good thing. It's a step in the process to bring this stalemate to an end, and a bone to throw to those who question western support for Ukraine. \n\nIt also gives Trump a much clearer reason to support Ukraine. A lot of the territory these minerals are under is currently occupied by Russia. It would be foolish to think that all of it will come back under the control of Ukraine, but now there is a clear reason to support Ukraine in taking back some of it. \n\nUnfortunately for Ukraine, this does equate to a loss of some level of sovereignty. There was never a scenario where a less developed country in the cross-hairs of both Europe and Russia maintained maximal sovereignty though.",
                "As soon as the war ends and Ukraine has the means to defend itself from any other aggression from Russia (like joining NATO) Ukraine should back out of the deal and tell the US to get bent. Hell they could say, just like how the US backed out of the deal they made when Ukraine gave up its nuclear arms (they had the 3rd largest at the time), they too need to look after their own country's welfare. \n\nI mean if the US can just \"Naw\" to any deal it made with any country then Ukraine should be able to do the same."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "US and Ukraine sign minerals deal that solidifies investment in Kyiv’s defense against Russia administration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/us-ukraine-minerals-deal-russia",
            "upvotes": 175,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d35efa338b1a438e259e78e6017f968274c758b8/0_44_4744_2847/master/4744.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0107bb8b2b102056ea9386bb8f54cc28",
            "top_comments": [
                "*The US and* [*Kyiv*](https://www.theguardian.com/world/ukraine) *have signed an agreement to share profits and royalties from the future sale of Ukrainian minerals and rare earths, sealing a deal that Donald Trump has said will provide an economic incentive for the US to continue to invest in Ukraine’s defense and its reconstruction after he brokers a peace deal with Russia.*\n\nI've read tens of articles on \"the mineral deal\" but never seen a single reference to what the minerals are how they will be mined. Thus, I really wonder how real the projected \"profits and royalties\" to be shared by the two countries. I think most of all this is just political show.  But maybe now we'll see just how real the minerals are. For starters, what are they exactly??",
                "Making a deal with the devil isn't good but sometimes necessary.",
                "“We’re well aware that this loan is predatory, but fuck them kids, we’re doin usury anyways.”",
                "Turns out “sign this deal or I’ll let that guy murder you” is a pretty persuasive argument…",
                "Ukraine should sign a mineral “assurance” that they’ll let the us invest there. And follow through with the same vigor that the us did in the Budapest memorandum when they convinced Ukraine to give up its nuclear defence.",
                "I think it's overall a good thing. It's a step in the process to bring this stalemate to an end, and a bone to throw to those who question western support for Ukraine. \n\nIt also gives Trump a much clearer reason to support Ukraine. A lot of the territory these minerals are under is currently occupied by Russia. It would be foolish to think that all of it will come back under the control of Ukraine, but now there is a clear reason to support Ukraine in taking back some of it. \n\nUnfortunately for Ukraine, this does equate to a loss of some level of sovereignty. There was never a scenario where a less developed country in the cross-hairs of both Europe and Russia maintained maximal sovereignty though.",
                "As soon as the war ends and Ukraine has the means to defend itself from any other aggression from Russia (like joining NATO) Ukraine should back out of the deal and tell the US to get bent. Hell they could say, just like how the US backed out of the deal they made when Ukraine gave up its nuclear arms (they had the 3rd largest at the time), they too need to look after their own country's welfare. \n\nI mean if the US can just \"Naw\" to any deal it made with any country then Ukraine should be able to do the same."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "$800,000 in dimes spills onto North Texas highway",
            "external_url": "https://www.fox4news.com/news/truckload-dimes-spills-onto-wise-county-highway",
            "upvotes": 1775,
            "date": "04/30/2025",
            "thumbnail": "https://images.foxtv.com/static.fox4news.com/www.fox4news.com/content/uploads/2025/04/1280/720/dimes.jpg?ve=1&tl=1",
            "top_comments": [
                "_\"Somebody's gotta go back and get a shitload of dimes!\"_",
                "I would have liked to hear the sound of the spill.",
                "Good that road needed a major change",
                "This feels like the start of a probability question.",
                "Someone’s paying everyone’s toll on the Le Petomane Thruway.",
                "The nearby coinstar is going to be a hotspot for a few days.",
                "It sounds like one of \"greed\" dreams I used to have when I was down and out.  I'd be grasping for the dimes and then wake up....",
                "How will anyone ever count all $600,000 worth of dimes?",
                "Le Petomane Thruway? Now what'll that asshole think of next?",
                "Is this the March of Dimes I keep getting letters about?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Visa wants to give artificial intelligence 'agents' your credit card",
            "external_url": "https://apnews.com/article/ai-artificial-intelligence-5dfa1da145689e7951a181e2253ab349",
            "upvotes": 392,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Ideas by someone who’s never used a chatbot before”",
                "Yet another AI thing I don’t want and that won’t ever function correctly anyway.",
                "\\*reads article\\* This sounds incredibly useless.",
                "What people want: robot that folds clothes, empties dishwasher, gives them more free time.\n\nWhat tech makes: robot that you pay to shop for you.\n\nWhat's next, a robot that lists it all on Buy Nothing before it even gets back to the house?",
                "It does your grocery shopping for you?  Ha, so instead of incessant advertising trying to get you to choose such-and-such brand, they can just pay whoever runs the AI to decide you want their brand and cut out the human influencing part.  \n\nA new age of marketing is upon us.  I wonder what kind of euphemistic name that'll have.",
                "Man its a good thing I dont have a credit card and im poor as fuck lmfao",
                "Like hell I'm gonna use an AI to book travel; even if I trusted that it had the capacity to find the best deal, the bank would just end up making deals with various hotels and airlines to have it prioritize them regardless of price. Wherever there's extra profit to be made, companies will try to squeeze it out of you.",
                "Not a chance in hell, Visa/ Samsung.   Uf you actually develop this, I will cut up all of my visa cards.",
                "I fail to see how this will work. “Buy me a sweater” OK, here’s the sweatshop that bought the Google Ad space to appear in the recommended/shop results for a sweater. Congrats on your latest purchase that won’t survive the wash.",
                "Talk about the stripping away of human agency.  And so much more of our lives being programmed out of our control. We become more like Things than the things that control us."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Invasive Chinese crab that can scale walls spotted for 1st time in US Pacific Northwest",
            "external_url": "https://www.denver7.com/us-news/weird/invasive-chinese-crab-that-can-scale-walls-spotted-for-1st-time-in-us-pacific-northwest",
            "upvotes": 1854,
            "date": "04/30/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/07edff2/2147483647/strip/true/crop/500x263+0+36/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fb5%2Fe5%2Fa0756c304cae8652c5666823a8b6%2Fshutterstock-149549846.jpg",
            "top_comments": [
                "Please tell me they taste good with garlic butter and I'll join the eradication squad.",
                "Slap a 25% tariff on them.",
                "Thankfully the PNW has excellent resources for marine life management.",
                ">\"While this is a rare event in Oregon, mitten crabs caused significant infrastructure and ecological damage in and around San Francisco Bay when the population was at its height in the late 1990s,\" the ODFW said in a statement. \"So, it is important to correctly identify this species and report it to your local ODFW office with the location found.\n\nChinese mitten crab sounds like an adorable name for a crab.",
                "\\*Sigh\n\nGet my cracker and some butter.",
                "Build higher walls to keep out the crabs! And make them pay for it!!! ",
                "I mean if they taste good I can strip a steamed crab down to the meat in about 2 minutes.",
                "Two questions:\n\n1. Are they edible?\n\n2. Do they taste good?",
                "Can we attack its weak point for massive damage?",
                "Time to bust out the garlic and butter.\n\n\nMaybe some black bean sauce crab?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "U.S.-citizen family 'traumatized' after ICE raided their Oklahoma home in search of someone else",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-family-traumatized-ice-raid-rcna203700",
            "upvotes": 11941,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-ice-agent-ch-0916-f8729f.jpg",
            "top_comments": [
                "OKLAHOMA CITY (KFOR) — A woman says her family’s fresh start in Oklahoma turned into a nightmare after federal immigration agents raided their home, **taking their phones, laptops, and life savings** – even though they were not the suspects the agents were looking for.\n\nThe agents had a search warrant for the home, but **the suspects listed on the warrant do not live in the house**.\n\nThe woman who actually lives in the house had just moved to Oklahoma City from Maryland with her family about two weeks earlier..\n\n\"I said you took my phone. We have no money. I just moved here,” the mother said. “I have to feed my children. I’m going to need gas money. I need to be able to get around. Like, how do you just leave me like this? Like an abandoned dog.”\n\nShe said the agents ordered her and her daughters to step outside, even though it was raining and they barely were given time to put on clothes.\n\n“**They wanted me to change in front of all of them, in between all of them**,” she said. “My husband has not even seen my daughter in her undergarments — her own dad, because it’s respectful. **You have her out there, a minor, in her underwear,**” the woman told KFOR.\n\n“One of them said, ‘I know it was a little rough this morning,’” she said. “It was so denigrating. That you do all of this to a family, to women, your fellow citizens. And it was a little rough? You literally traumatized me and my daughters for life. We’re going to have to go get help or get over this somehow.”\n\nBefore the agents left, the mother asked when could the family get their belongings back and they said **it could be days or even months,** KFOR reported.\n\nEdit: Other news sources clarified that **20 men** broke into the house in the middle of the night while they were sleeping. So 20 men surrounded this woman and her three young daughters, dragged them out into the rain in their underwear, and made them change clothes in front of them. If there was any justice in this  country they would be up on charges of sexual exploitation of minors.\n\n2nd Edit: The ~~agents~~ stasi thugs wouldn't even leave a business card or phone number they could call to find out how to get their electronics and life savings back. The ~~agents~~ thieves refused to even tell them which government agency or department would be storing their property.",
                "I wonder if that was a real warrant or one of those ICE administrative warrants? Those should be illegal. If police can make their own warrants, that defeats the whole purpose.",
                "More purposeful domestic terrorism - not incompetence - from maga ICE.",
                "They probably broke a bunch of their stuff too.",
                "The more commonplace this becomes the more commonplace it will be for other countries to compare us to the Russians. Is that what Republicans want?",
                "Has Oklahomas senators or ag commented on this or do they support it?",
                "Not just a raid. This was full on sexual assault and theft. ICE goons deserve to be prosecuted at the Hague like the Nazis they are based on. Instead the US will allow them to do as they please, just like they did with the nazis. Disgusting. I am sad to be american.",
                "How long will it be until non-government thugs decide to do the same thing? It seems to be a huge opportunity for anyone with no morals, and we have seen how many of those are out there. How would anyone know they weren't from the government?",
                "Law enforcement needs to be held accountable\n\nEven if you could agree with what ICE is trying to do, any law enforcement agency should be heavily penalized for raiding the wrong goddamn house!\n\nLike are you fucking serious? Somebody easily could have been killed. These are not our best folks.",
                "I can only imagine, the cruelty of this bunch is astounding."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Middle schooler records himself harassing 5-year-old with ethnic slurs",
            "external_url": "https://www.nbcwashington.com/news/local/northern-virginia/middle-schooler-records-himself-harassing-5-year-old-with-ethnic-slurs/3899952/",
            "upvotes": 12365,
            "date": "04/30/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/04/39225742009-1080pnbcstations.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The 5-year-old went to the door to his house, pleading, “No! Don’t hurt me! Don’t hurt me!”\n\nHe then ran along the porch crying out for other children to help him – “Don’t do it! Save me! Save me!” No one stepped in, and laughter is heard in the background.\n\nThe harassment continued.\n\n“Are you having dumplings for dinner?” the middle schooler asked.\n\nAfter two minutes, the 5-year-old boy’s mother opened the door, and her son ran inside.",
                "As a middle school teacher, sadly I am not suprised.\n\nI teach lots of terrific students, but I'm also exposed to ones that are underparented, undersupervised, and have little ability to function in a civil society.\n\nWe need to find a way to implement consequences for these actions that not only show that we take it seriously, but help the person try to move out of the mindset that lead to this behavior.  Counseling, community service, etc..  Unfortunately, we tend to either do nothing, or incarcerate them once it escalates to violence. Nothing to stop it before that point.",
                "What’s up with middle schoolers and being the worst people possible?",
                "5... pre-k / kindergarten age. This middle school was at least twice their age. Shame on them, and shame on their parents.",
                "seeing that poor child running to his door and putting the towel over his face is so fucking sad. those middle school kids deserve the worst, they know better than to bully a fucking toddler less than half their age. as someone from the area, these types of middle schoolers grow up into the shittiest and most entitled high schoolers who have never faced consequences",
                "Five year olds are literally, and I mean *literally*, just living their best lives. Sure, they have trouble with emotional control sometimes and have meltdowns, but that also means they’re kind when none of us would be kind, they’re happy when none of us would be happy, they’re friendly when none of us would be friendly, they’re inquisitive and funny and compassionate and…just insert all the traits we as adults say we strive for. \n\nSo to see a five year old have this kind of malicious fear deliberately inflicted on them… \n\nI would be hunting the parents down. And I mean that in a predatory sense.",
                "I wish all hell on the parents who raised that middle school bastard. \n\nI was a middle schooler. I raised middle schoolers. This is not normal and no talk of hormones will make me believe it is.",
                "Wow, my heart breaks for the little boy and his parents. But especially the little boy.\n\nCrazy thing is this school says it’s not their problem and police are being silent.\n\nThe community is going to demand justice and this won’t go quietly until people feel the middle schooler(s) are punished justly.\n\nIf this happened to my child, it would take everything in my power to not be vindictive. I don’t think I could remain peaceful.",
                "Genius kid-must have learned it from the parents",
                "Very few things make me as angry as seeing bullying like this.  I was bullied as a child and even did some myself when I was young and trying to sort out my way.  I always feel bad about my part, and wish I could go back and apologize to those I hurt."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "11 high schoolers ordered to surrender after lacrosse team hazing in upstate New York",
            "external_url": "https://www.nbcnews.com/news/us-news/high-schoolers-lacrosse-team-hazing-rcna203662",
            "upvotes": 1581,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-westhill-high-school-vl-909a-2fe878.jpg",
            "top_comments": [
                "This is a huge deal for CNY. In a lot of areas of the country Lacrosse is considered a prep-school sport for wealthy kids. In Syracuse metro area it's ingrained in the entire culture. The cancellation of the season can mean the difference for some of these seniors being offered D1 scholarships and being lucky to have a D3 team willing to take them on as walk on's after pulling this shit. Bunch of fucking idiots and they absolutely deserve full punishment.",
                "No one should receive scholarships after participating in hazing",
                "Geez. When I was in high school, the “hazing” for the band only involved getting water balloons and shaving cream thrown at you.",
                "Senior year of high school, 5 or 6 lacrosse players were expelled for hazing a younger player. My understanding is teabagging and some violating acts with lacross sticks is what happened. Still don’t understand how they were not charged with anything but that was 20+ years ago",
                "One victim reported that he went to a lacrosse game and then McDonald's with upperclassmen. But the evening took a turn when he said he was taken to a remote wooded area in the county after the driver of the vehicle pretended to be lost.\n\n“At some point by prearrangement, people came out of the woods all dressed in black. They were armed with what appeared to be at least one handgun and at least one knife,” Fitzpatrick said. “The individual had a pillowcase placed over his head, he was tied up and placed in the trunk of a car.”\n\nThe district attorney said he saw videotape of the incident.\n\n“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,”",
                "Hazing usually doesn't involve a loaded firearm...",
                "*“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,” Fitzpatrick added*\n\nThis almost would have been the least of my worries, given the horrible scenes he had just endured. As in leave me alone anywhere--even on the moon, anything but  what your threatening arms and masks implied.",
                "We still have hazing incidents?  WTF? They get what they deserve.",
                "Hazing is making the pledges dress up in tutus and do interpretive dance in the quad or chucking balloons full of ketchup at them. It does not involve brandishing lethal weapons in a secluded forest. These idiots should all be charged with felony crimes, and the judge should order the lacrosse program shut down for a year. \"But they're just kids!\" They showed up with pistol. Pistols are for killing people. Fuck these \"kids\".",
                "Weapons use? Kidnapping in car trunks? Need to set an example. Turn yourself in and pay a ticket is not setting an example it seems."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Federal judge in Vermont orders release of Columbia student Mohsen Mahdawi",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/mohsen-mahdawi-released-immigration-detention",
            "upvotes": 5371,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7128145d98ae03c483a557284594d0e9089104ba/0_0_3769_2261/master/3769.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4a5217dac0e17adb2b1b93b9c49660b0",
            "top_comments": [
                "[He’s been released](https://abcnews.go.com/US/lawyers-columbia-student-detained-ice-seek-release-case/story?id=121317902)\n\nI honestly think that contempt threat scared them straight, at least for now",
                "Hence why they try and relocate these people to Louisiana etc immediately to avoid these more liberal federal judges.",
                "> In new court filings submitted on Monday, the justice department included a two-page letter from Marco Rubio, the US secretary of state, saying that Mahdawi’s activities and presence in the US “undermines US policy to combat antisemitism” according to NPR, and that his activities could “potentially undermine the peace process underway in the Middle East”.\n\nWhat fucking peace process? Trump boasted about turning Gaza into a Trump resort. He quite literally supported the idea of a genocide because it was \"good business\".\n\n> Judge Crawford noted at Wednesday's hearing that Mahdawi received letters of support from over 90 community members, including members of the Jewish community, \"who have in a consistent pattern described him as peaceful.\"\n\nI bet they'll claim that those aren't real Jews or something. I fucking hate this administration.",
                "How cute, a judicial order? That’s a crime against trump now, so jail for the judge and the order goes in the special filing cabinet for corporate memos 🗑️",
                "Tomorrow we will see this judge arrested",
                "Request: where are we in the timeline in the Garcia case anyway? Wasn't there a deadline yesterday?",
                "Good! Now free Mahmoud Kahlil.\n\nI’m Jewish. I’d rather have these two men as neighbors than any of the chuds on my block.",
                "Thank goodness. I am worried for the safety of the judge, but this was absolutely needed.",
                "It's important to realise he's been released but that the removal proceedings continue; he's just not in prison while they do so.",
                "He's getting arrested next.."
            ],
            "aggregate_sentiment": 65.0
        },
        {
            "category": "NEW",
            "title": "Supreme Court hears arguments over publicly funded Catholic charter school in Oklahoma",
            "external_url": "https://apnews.com/article/supreme-court-religious-catholic-charter-school-oklahoma-983ed57aabeae53e4b58367c5021f5e1",
            "upvotes": 9105,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This one’s gonna suck. They love their private schools being funded by state tax dollars. This is gonna be a big blow to public education…",
                ">Justice Amy Coney Barrett recused herself without explanation. Barrett previously taught law at Notre Dame and is close friends with Notre Dame law professor Nicole Garnett, a leading proponent of publicly funded religious charter schools.\n\nWow a justice doing something right for a change.",
                " If this is allowed, red states are only going to fund religious schools.  Prepare for a complete backslide into the middle ages.",
                "I know someone in Ohio who makes about $250,000 household income that gets free tuition and PUBLIC SCHOOL bus transportation with a voucher program for their three kids. Shit like this already happens.",
                "We don’t want religious schools.\n\nTeach science, not “god’s word” (which is actually man’s word from 3000 years ago and edits ever since).",
                "It’s not a real catholic school a real\nCatholic school wouldn’t need public funding.  It’s a for profit school gaining public money from under the guise of religious education",
                "How did this even make it to scotus? This is an obvious \"F*** no\"",
                "Honestly, props to Coney Barrett for recusing herself.",
                "Republicans are fake patriots",
                "I hope The Church of Satan starts a charter school."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Man arrested after death of former NHLer won't face charges",
            "external_url": "https://www.cbc.ca/sports/hockey/hockey-adam-johnson-matt-petgrave-charges-1.7521462",
            "upvotes": 558,
            "date": "04/30/2025",
            "thumbnail": "https://i.cbc.ca/1.7020534.1700289982!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/johnson-adam-110623.jpg?im=Resize%3D620",
            "top_comments": [
                "In case the title confused you into thinking this was about the other NHLer who was killed (Johnny Gaudreau and his brother who were killed by a drunk driver) and are now curious what happened to that drunk driver, he is definitely being charged and recently tried to argue that the brothers who were cycling at the time were at fault since [the brothers were drunker](https://www.cbc.ca/amp/1.7510461)",
                "[removed]",
                "Wild, I was just wondering what came of this last night and forgot to look it up.",
                "Good. It was an obvious accident during a dangerous game where people can get hurt. Racists online co-opted it to start race arguments because of the skin color of the people involved. It was shameful that he was even arrested in the first place.",
                "Why the hell did they arrest him in the first place?  Even a quick look would have shown that it was an accident.  This man already had to live with the fact that he inadvertently caused the death of another person, and then the police just doubled down and made everything worse.",
                "Good, people were being downright silly, implying that this was some intentional act. Lots of embarrassing armchair detectives trying to float ridiculous hot takes. Perfect example of redditors being unable to manage their emotions.",
                "Shoulda been involuntary manslaughter charges",
                "[deleted]",
                "Who the fuck calls NHL players \"NHLers\"?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "$800,000 in dimes spills onto North Texas highway",
            "external_url": "https://www.fox4news.com/news/truckload-dimes-spills-onto-wise-county-highway",
            "upvotes": 1772,
            "date": "04/30/2025",
            "thumbnail": "https://images.foxtv.com/static.fox4news.com/www.fox4news.com/content/uploads/2025/04/1280/720/dimes.jpg?ve=1&tl=1",
            "top_comments": [
                "_\"Somebody's gotta go back and get a shitload of dimes!\"_",
                "I would have liked to hear the sound of the spill.",
                "Good that road needed a major change",
                "This feels like the start of a probability question.",
                "Someone’s paying everyone’s toll on the Le Petomane Thruway.",
                "The nearby coinstar is going to be a hotspot for a few days.",
                "It sounds like one of \"greed\" dreams I used to have when I was down and out.  I'd be grasping for the dimes and then wake up....",
                "How will anyone ever count all $600,000 worth of dimes?",
                "Le Petomane Thruway? Now what'll that asshole think of next?",
                "Is this the March of Dimes I keep getting letters about?"
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "RISING",
            "title": "Visa wants to give artificial intelligence 'agents' your credit card",
            "external_url": "https://apnews.com/article/ai-artificial-intelligence-5dfa1da145689e7951a181e2253ab349",
            "upvotes": 394,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Ideas by someone who’s never used a chatbot before”",
                "Yet another AI thing I don’t want and that won’t ever function correctly anyway.",
                "\\*reads article\\* This sounds incredibly useless.",
                "What people want: robot that folds clothes, empties dishwasher, gives them more free time.\n\nWhat tech makes: robot that you pay to shop for you.\n\nWhat's next, a robot that lists it all on Buy Nothing before it even gets back to the house?",
                "It does your grocery shopping for you?  Ha, so instead of incessant advertising trying to get you to choose such-and-such brand, they can just pay whoever runs the AI to decide you want their brand and cut out the human influencing part.  \n\nA new age of marketing is upon us.  I wonder what kind of euphemistic name that'll have.",
                "Man its a good thing I dont have a credit card and im poor as fuck lmfao",
                "Like hell I'm gonna use an AI to book travel; even if I trusted that it had the capacity to find the best deal, the bank would just end up making deals with various hotels and airlines to have it prioritize them regardless of price. Wherever there's extra profit to be made, companies will try to squeeze it out of you.",
                "Not a chance in hell, Visa/ Samsung.   Uf you actually develop this, I will cut up all of my visa cards.",
                "I fail to see how this will work. “Buy me a sweater” OK, here’s the sweatshop that bought the Google Ad space to appear in the recommended/shop results for a sweater. Congrats on your latest purchase that won’t survive the wash.",
                "Talk about the stripping away of human agency.  And so much more of our lives being programmed out of our control. We become more like Things than the things that control us."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "U.S.-citizen family 'traumatized' after ICE raided their Oklahoma home in search of someone else",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-family-traumatized-ice-raid-rcna203700",
            "upvotes": 11921,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-ice-agent-ch-0916-f8729f.jpg",
            "top_comments": [
                "OKLAHOMA CITY (KFOR) — A woman says her family’s fresh start in Oklahoma turned into a nightmare after federal immigration agents raided their home, **taking their phones, laptops, and life savings** – even though they were not the suspects the agents were looking for.\n\nThe agents had a search warrant for the home, but **the suspects listed on the warrant do not live in the house**.\n\nThe woman who actually lives in the house had just moved to Oklahoma City from Maryland with her family about two weeks earlier..\n\n\"I said you took my phone. We have no money. I just moved here,” the mother said. “I have to feed my children. I’m going to need gas money. I need to be able to get around. Like, how do you just leave me like this? Like an abandoned dog.”\n\nShe said the agents ordered her and her daughters to step outside, even though it was raining and they barely were given time to put on clothes.\n\n“**They wanted me to change in front of all of them, in between all of them**,” she said. “My husband has not even seen my daughter in her undergarments — her own dad, because it’s respectful. **You have her out there, a minor, in her underwear,**” the woman told KFOR.\n\n“One of them said, ‘I know it was a little rough this morning,’” she said. “It was so denigrating. That you do all of this to a family, to women, your fellow citizens. And it was a little rough? You literally traumatized me and my daughters for life. We’re going to have to go get help or get over this somehow.”\n\nBefore the agents left, the mother asked when could the family get their belongings back and they said **it could be days or even months,** KFOR reported.\n\nEdit: Other news sources clarified that **20 men** broke into the house in the middle of the night while they were sleeping. So 20 men surrounded this woman and her three young daughters, dragged them out into the rain in their underwear, and made them change clothes in front of them. If there was any justice in this  country they would be up on charges of sexual exploitation of minors.\n\n2nd Edit: The ~~agents~~ stasi thugs wouldn't even leave a business card or phone number they could call to find out how to get their electronics and life savings back. The ~~agents~~ thieves refused to even tell them which government agency or department would be storing their property.",
                "I wonder if that was a real warrant or one of those ICE administrative warrants? Those should be illegal. If police can make their own warrants, that defeats the whole purpose.",
                "More purposeful domestic terrorism - not incompetence - from maga ICE.",
                "They probably broke a bunch of their stuff too.",
                "The more commonplace this becomes the more commonplace it will be for other countries to compare us to the Russians. Is that what Republicans want?",
                "Has Oklahomas senators or ag commented on this or do they support it?",
                "Not just a raid. This was full on sexual assault and theft. ICE goons deserve to be prosecuted at the Hague like the Nazis they are based on. Instead the US will allow them to do as they please, just like they did with the nazis. Disgusting. I am sad to be american.",
                "How long will it be until non-government thugs decide to do the same thing? It seems to be a huge opportunity for anyone with no morals, and we have seen how many of those are out there. How would anyone know they weren't from the government?",
                "Law enforcement needs to be held accountable\n\nEven if you could agree with what ICE is trying to do, any law enforcement agency should be heavily penalized for raiding the wrong goddamn house!\n\nLike are you fucking serious? Somebody easily could have been killed. These are not our best folks.",
                "I can only imagine, the cruelty of this bunch is astounding."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Federal judge in Vermont orders release of Columbia student Mohsen Mahdawi",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/30/mohsen-mahdawi-released-immigration-detention",
            "upvotes": 5371,
            "date": "04/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7128145d98ae03c483a557284594d0e9089104ba/0_0_3769_2261/master/3769.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4a5217dac0e17adb2b1b93b9c49660b0",
            "top_comments": [
                "[He’s been released](https://abcnews.go.com/US/lawyers-columbia-student-detained-ice-seek-release-case/story?id=121317902)\n\nI honestly think that contempt threat scared them straight, at least for now",
                "Hence why they try and relocate these people to Louisiana etc immediately to avoid these more liberal federal judges.",
                "> In new court filings submitted on Monday, the justice department included a two-page letter from Marco Rubio, the US secretary of state, saying that Mahdawi’s activities and presence in the US “undermines US policy to combat antisemitism” according to NPR, and that his activities could “potentially undermine the peace process underway in the Middle East”.\n\nWhat fucking peace process? Trump boasted about turning Gaza into a Trump resort. He quite literally supported the idea of a genocide because it was \"good business\".\n\n> Judge Crawford noted at Wednesday's hearing that Mahdawi received letters of support from over 90 community members, including members of the Jewish community, \"who have in a consistent pattern described him as peaceful.\"\n\nI bet they'll claim that those aren't real Jews or something. I fucking hate this administration.",
                "How cute, a judicial order? That’s a crime against trump now, so jail for the judge and the order goes in the special filing cabinet for corporate memos 🗑️",
                "Tomorrow we will see this judge arrested",
                "Request: where are we in the timeline in the Garcia case anyway? Wasn't there a deadline yesterday?",
                "Good! Now free Mahmoud Kahlil.\n\nI’m Jewish. I’d rather have these two men as neighbors than any of the chuds on my block.",
                "Thank goodness. I am worried for the safety of the judge, but this was absolutely needed.",
                "It's important to realise he's been released but that the removal proceedings continue; he's just not in prison while they do so.",
                "He's getting arrested next.."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Invasive Chinese crab that can scale walls spotted for 1st time in US Pacific Northwest",
            "external_url": "https://www.denver7.com/us-news/weird/invasive-chinese-crab-that-can-scale-walls-spotted-for-1st-time-in-us-pacific-northwest",
            "upvotes": 1853,
            "date": "04/30/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/07edff2/2147483647/strip/true/crop/500x263+0+36/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fb5%2Fe5%2Fa0756c304cae8652c5666823a8b6%2Fshutterstock-149549846.jpg",
            "top_comments": [
                "Please tell me they taste good with garlic butter and I'll join the eradication squad.",
                "Slap a 25% tariff on them.",
                "Thankfully the PNW has excellent resources for marine life management.",
                ">\"While this is a rare event in Oregon, mitten crabs caused significant infrastructure and ecological damage in and around San Francisco Bay when the population was at its height in the late 1990s,\" the ODFW said in a statement. \"So, it is important to correctly identify this species and report it to your local ODFW office with the location found.\n\nChinese mitten crab sounds like an adorable name for a crab.",
                "\\*Sigh\n\nGet my cracker and some butter.",
                "Build higher walls to keep out the crabs! And make them pay for it!!! ",
                "I mean if they taste good I can strip a steamed crab down to the meat in about 2 minutes.",
                "Two questions:\n\n1. Are they edible?\n\n2. Do they taste good?",
                "Can we attack its weak point for massive damage?",
                "Time to bust out the garlic and butter.\n\n\nMaybe some black bean sauce crab?"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Middle schooler records himself harassing 5-year-old with ethnic slurs",
            "external_url": "https://www.nbcwashington.com/news/local/northern-virginia/middle-schooler-records-himself-harassing-5-year-old-with-ethnic-slurs/3899952/",
            "upvotes": 12358,
            "date": "04/30/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/04/39225742009-1080pnbcstations.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The 5-year-old went to the door to his house, pleading, “No! Don’t hurt me! Don’t hurt me!”\n\nHe then ran along the porch crying out for other children to help him – “Don’t do it! Save me! Save me!” No one stepped in, and laughter is heard in the background.\n\nThe harassment continued.\n\n“Are you having dumplings for dinner?” the middle schooler asked.\n\nAfter two minutes, the 5-year-old boy’s mother opened the door, and her son ran inside.",
                "As a middle school teacher, sadly I am not suprised.\n\nI teach lots of terrific students, but I'm also exposed to ones that are underparented, undersupervised, and have little ability to function in a civil society.\n\nWe need to find a way to implement consequences for these actions that not only show that we take it seriously, but help the person try to move out of the mindset that lead to this behavior.  Counseling, community service, etc..  Unfortunately, we tend to either do nothing, or incarcerate them once it escalates to violence. Nothing to stop it before that point.",
                "What’s up with middle schoolers and being the worst people possible?",
                "5... pre-k / kindergarten age. This middle school was at least twice their age. Shame on them, and shame on their parents.",
                "seeing that poor child running to his door and putting the towel over his face is so fucking sad. those middle school kids deserve the worst, they know better than to bully a fucking toddler less than half their age. as someone from the area, these types of middle schoolers grow up into the shittiest and most entitled high schoolers who have never faced consequences",
                "Five year olds are literally, and I mean *literally*, just living their best lives. Sure, they have trouble with emotional control sometimes and have meltdowns, but that also means they’re kind when none of us would be kind, they’re happy when none of us would be happy, they’re friendly when none of us would be friendly, they’re inquisitive and funny and compassionate and…just insert all the traits we as adults say we strive for. \n\nSo to see a five year old have this kind of malicious fear deliberately inflicted on them… \n\nI would be hunting the parents down. And I mean that in a predatory sense.",
                "I wish all hell on the parents who raised that middle school bastard. \n\nI was a middle schooler. I raised middle schoolers. This is not normal and no talk of hormones will make me believe it is.",
                "Wow, my heart breaks for the little boy and his parents. But especially the little boy.\n\nCrazy thing is this school says it’s not their problem and police are being silent.\n\nThe community is going to demand justice and this won’t go quietly until people feel the middle schooler(s) are punished justly.\n\nIf this happened to my child, it would take everything in my power to not be vindictive. I don’t think I could remain peaceful.",
                "Genius kid-must have learned it from the parents",
                "Very few things make me as angry as seeing bullying like this.  I was bullied as a child and even did some myself when I was young and trying to sort out my way.  I always feel bad about my part, and wish I could go back and apologize to those I hurt."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "11 high schoolers ordered to surrender after lacrosse team hazing in upstate New York",
            "external_url": "https://www.nbcnews.com/news/us-news/high-schoolers-lacrosse-team-hazing-rcna203662",
            "upvotes": 1585,
            "date": "04/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-westhill-high-school-vl-909a-2fe878.jpg",
            "top_comments": [
                "This is a huge deal for CNY. In a lot of areas of the country Lacrosse is considered a prep-school sport for wealthy kids. In Syracuse metro area it's ingrained in the entire culture. The cancellation of the season can mean the difference for some of these seniors being offered D1 scholarships and being lucky to have a D3 team willing to take them on as walk on's after pulling this shit. Bunch of fucking idiots and they absolutely deserve full punishment.",
                "No one should receive scholarships after participating in hazing",
                "Geez. When I was in high school, the “hazing” for the band only involved getting water balloons and shaving cream thrown at you.",
                "Senior year of high school, 5 or 6 lacrosse players were expelled for hazing a younger player. My understanding is teabagging and some violating acts with lacross sticks is what happened. Still don’t understand how they were not charged with anything but that was 20+ years ago",
                "One victim reported that he went to a lacrosse game and then McDonald's with upperclassmen. But the evening took a turn when he said he was taken to a remote wooded area in the county after the driver of the vehicle pretended to be lost.\n\n“At some point by prearrangement, people came out of the woods all dressed in black. They were armed with what appeared to be at least one handgun and at least one knife,” Fitzpatrick said. “The individual had a pillowcase placed over his head, he was tied up and placed in the trunk of a car.”\n\nThe district attorney said he saw videotape of the incident.\n\n“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,”",
                "Hazing usually doesn't involve a loaded firearm...",
                "*“There was a period of time where he thought that he was going to be abandoned in the middle of nowhere,” Fitzpatrick added*\n\nThis almost would have been the least of my worries, given the horrible scenes he had just endured. As in leave me alone anywhere--even on the moon, anything but  what your threatening arms and masks implied.",
                "We still have hazing incidents?  WTF? They get what they deserve.",
                "Hazing is making the pledges dress up in tutus and do interpretive dance in the quad or chucking balloons full of ketchup at them. It does not involve brandishing lethal weapons in a secluded forest. These idiots should all be charged with felony crimes, and the judge should order the lacrosse program shut down for a year. \"But they're just kids!\" They showed up with pistol. Pistols are for killing people. Fuck these \"kids\".",
                "Weapons use? Kidnapping in car trunks? Need to set an example. Turn yourself in and pay a ticket is not setting an example it seems."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court hears arguments over publicly funded Catholic charter school in Oklahoma",
            "external_url": "https://apnews.com/article/supreme-court-religious-catholic-charter-school-oklahoma-983ed57aabeae53e4b58367c5021f5e1",
            "upvotes": 9103,
            "date": "04/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This one’s gonna suck. They love their private schools being funded by state tax dollars. This is gonna be a big blow to public education…",
                ">Justice Amy Coney Barrett recused herself without explanation. Barrett previously taught law at Notre Dame and is close friends with Notre Dame law professor Nicole Garnett, a leading proponent of publicly funded religious charter schools.\n\nWow a justice doing something right for a change.",
                " If this is allowed, red states are only going to fund religious schools.  Prepare for a complete backslide into the middle ages.",
                "I know someone in Ohio who makes about $250,000 household income that gets free tuition and PUBLIC SCHOOL bus transportation with a voucher program for their three kids. Shit like this already happens.",
                "We don’t want religious schools.\n\nTeach science, not “god’s word” (which is actually man’s word from 3000 years ago and edits ever since).",
                "It’s not a real catholic school a real\nCatholic school wouldn’t need public funding.  It’s a for profit school gaining public money from under the guise of religious education",
                "How did this even make it to scotus? This is an obvious \"F*** no\"",
                "Honestly, props to Coney Barrett for recusing herself.",
                "Republicans are fake patriots",
                "I hope The Church of Satan starts a charter school."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Man arrested after death of former NHLer won't face charges",
            "external_url": "https://www.cbc.ca/sports/hockey/hockey-adam-johnson-matt-petgrave-charges-1.7521462",
            "upvotes": 556,
            "date": "04/30/2025",
            "thumbnail": "https://i.cbc.ca/1.7020534.1700289982!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/johnson-adam-110623.jpg?im=Resize%3D620",
            "top_comments": [
                "In case the title confused you into thinking this was about the other NHLer who was killed (Johnny Gaudreau and his brother who were killed by a drunk driver) and are now curious what happened to that drunk driver, he is definitely being charged and recently tried to argue that the brothers who were cycling at the time were at fault since [the brothers were drunker](https://www.cbc.ca/amp/1.7510461)",
                "[removed]",
                "Wild, I was just wondering what came of this last night and forgot to look it up.",
                "Good. It was an obvious accident during a dangerous game where people can get hurt. Racists online co-opted it to start race arguments because of the skin color of the people involved. It was shameful that he was even arrested in the first place.",
                "Why the hell did they arrest him in the first place?  Even a quick look would have shown that it was an accident.  This man already had to live with the fact that he inadvertently caused the death of another person, and then the police just doubled down and made everything worse.",
                "Good, people were being downright silly, implying that this was some intentional act. Lots of embarrassing armchair detectives trying to float ridiculous hot takes. Perfect example of redditors being unable to manage their emotions.",
                "Shoulda been involuntary manslaughter charges",
                "[deleted]",
                "Who the fuck calls NHL players \"NHLers\"?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Some 55,000 Los Angeles County workers walk out in 2-day strike, pausing operations",
            "external_url": "https://abcnews.go.com/US/55000-los-angeles-county-workers-walk-2-day/story?id=121289727",
            "upvotes": 14253,
            "date": "04/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6c746ab5-3125-4990-b523-ca2297d5455d/la-strike-01-ap-jt-250429_1745952356016_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Excuse for not paying their workers more:\n\n>The county also cited \"unprecedented stresses on our budget\" including a $4 billion settlement of thousands of childhood sexual assault claims brought under AB 218,\n\nThat sounds very much like a you problem.",
                "I can't recall a more color coordinated US strike.  Purple works well even from helicopter level.",
                "Mayday is coming people. Join in.",
                "We need lots more of this. Call off work on the 1st! [https://actionnetwork.org/event\\_campaigns/general-protest-mayday-of-action](https://actionnetwork.org/event_campaigns/general-protest-mayday-of-action)",
                "Stickin' it to the man... In solidarity.",
                "SEIU Strong! The county has been working hard to put out messaging that the union’s demands are inappropriate and irresponsible. All we are asking for is cost of living adjustments, an end to contracting out positions (which costs more and leads to higher turnover which is unsafe for county services), and a strong enough contract to fill vacancies. LA county jobs used to be coveted, for fair pay and benefits, as well as respect and dignity at work. Now some of our members can barely afford rent, are overworked, burned out, and ready for change. Our 55k members are involved in almost every county service, including parks and rec, healthcare, social services, and mental health. We are the county safety net!",
                "How about 1-week long mass-strike/mass-protest across the US?",
                "I haven't seen this on any news feeds how come? There is also a school shooting in Texas and it was hardly even a blip. There's some weird suppression activities going on but Obama forgetting to salute is around 90 million views.",
                "AB 218 is a law that extends the statute of limitations for sexual assault victims. Many of the cases occurred in the 60’s and 70’s. Only the victim is alive, and nobody connected with assault is at the facility anymore. Most organizations (school districts for example) have insurance for when things need a big payout like this, but you can’t get insurance to pay out for sexual assaults in these cases as the insuring organization when the crime was committed have been gone out of business and current insurance plans do not cover this kind of crime.  That means the payout comes from a general fund, the same fund that they pay their employees from and where they find money to fix facilities. \n\nI’m not denying the heinous nature of the crimes these sexual assault survivors have had to endure, or the long term effects of those acts, how it likely played a role in many of not all of their actions and decisions since. But in many cases nobody connected with the crimes works for the organization anymore and hasn’t been for decades, but they are left with the bill. \n\nBecause of these cases there has been a significant shortfall in funding for nurses, teachers and other affected industries as they have had to pay out millions to victims that would have otherwise gone to increase pay for their staff. \n\nI am not trying to diminish anyone’s suffering but it’s like someone saying they were assaulted in a house 50 years ago and even though you moved in 5 years ago you’re responsible for crime because you live there now.\n\n\nSource: I am a school board member in a small district (we thankfully have not had an cases of SA) who participated in a legislative advocacy and AB 218 was one of the bills we discussed",
                "Watch Trump send in federal troops to \"quell the rioting\"."
            ],
            "aggregate_sentiment": 80.0
        }
    ],
    "last_updated": "05/01/2025 00:48:49 UTC"
}