{
    "posts": [
        {
            "category": "HOT",
            "title": "Alex Jones says Infowars reporter Jamie White was fatally shot near Texas home",
            "external_url": "https://www.the-independent.com/news/world/americas/crime/jamie-white-infowars-murder-alex-jones-b2712630.html",
            "upvotes": 5369,
            "date": "03/11/2025",
            "thumbnail": "https://static.the-independent.com/2025/03/11/02/jamie-white.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                ">Nevertheless, he said: \"I lay all of this squarely at the feet of these DAs and of the Soros crime syndicate, and of the Democratic Party.”\n\nSo much for the \"wait for all the facts to come out\" side. They won't even wait for the body to get cold to sacrifice the memory of one of their own to the altar of owning the libs.",
                "by the way: Is Alex Jones still pretending to be broke in order to escape the just punishment for mocking the victims with his lies?",
                "This is just a false flag by Alex Jones. Jamie White isn't even a real person. He's been seen at hundreds of locations as a paid crisis reporter. ",
                "[removed]",
                "I guess he lost the info war",
                "Nah probably a crisis actor this never happened",
                "It's his fault he got shot. If he didn't want to get shot, he shouldn't have been dressed like that. His body had a way of shutting down that bullet. Totally the victims fault.",
                "So, in a heavily GOP controlled region, the usual cats put the blame on... hold on, let me see, someone who is NOT a lawmaker. Of course. Makes perfect nonsense.",
                "I see were using the term \"journalist\" real, real loosely here. \n\n\nAnyway, tots and pears I guess. Best I can do.  ",
                "Inb4 it’s just that he got into an argument with a gun nut neighbor because it’s Texas…"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "US added to international watchlist for rapid decline in civic freedoms | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/09/watchlist-decline-civic-freedoms-civicus",
            "upvotes": 50730,
            "date": "03/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f838401ad096f61dcc28e6dfd2f04d0dad5d8448/0_192_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=66c6b81aa93b4e5c81e2755827179a60",
            "top_comments": [
                "Ah yes, soon to be in a \"do not travel advisory\". Especially after what happened to that German tourist.",
                "Does this mean Americans can now seek asylum in other countries to escape persecution?",
                "I would have never imagined to see this shit show in the US. Insane!",
                "\\* Minority groups suppressed\n\n\\* Free press not allowed at WH\n\n\\* Uni students threatened if they dare protest, general intimidation tactics\n\n\\* Reckless gov dismissals and appointing loyalist to the president rather than the constitution\n\n\\* Medicaid and social security under threat\n\n\\* Withdrew from UN Human Rights Council",
                "Just do us the kind favor and arrest the rich as they travel abroad for human rights abuses, and likely significant other crimes. Blanket freeze on assets too.",
                "And we're only 2 months in.",
                "I knew it was the right choice to not give up Mexican citizenship. Plus being Mexican is awesome.",
                "Are we winning yet Mr Krabs?",
                "Good. It's the least this administration deserves.",
                "You MAGA heads proud of what trumpz has done to America so far? Feeling good about being a laughing stock on the world stage? Feeling good losing your rights to free speach and the right to protest? Feeling good about the economy? Guy is pathetic and worse he is a traitor to what makes America and previous American Presidents great."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Stocks fall as Trump warns of US economy trade war 'transition'",
            "external_url": "https://www.bbc.co.uk/news/articles/cz61nn99eg1o",
            "upvotes": 45665,
            "date": "03/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7d16/live/091cf470-fdc2-11ef-8869-3b46261c581e.jpg",
            "top_comments": [
                "Tesla down 15% today alone is crazy. Wipes out every gain they made from November.",
                "President of “No Wars” begins his second term by starting a Trade War. More news at 11",
                "the great businessman who had 6 bankruptcies ladies and gentlemen.  🎩 ",
                "Trump, contrary to polls, is very bad for our economy.",
                "In case anyone is wondering where we've been and where we're going, here's a handy guide.\n\n1. The tariffs are great for the economy\n2. The tariffs are great for the economy, but it will take time to see\n3. The tariffs will be good overall for America, but the economy will \"transition\" **<-- (you are here)**\n4. This is a market correction, not a recession\n5. Not *all* experts agree that we're in stagflation\n6. This depression is all because of the Biden/Obama tariffs which I, Donald Trump, will now end!",
                "Transition TO WHAT?   Financial ruin, destroyed partnerships, vaporized supply chains, never retiring, and blown investments?\n\nThis guy is the dumbest sack of Matlock reruns I have ever seen.",
                "We've almost given up 6 months of stock growth. The stock market isn't the economy, but when stocks slump, the real economy slumps.",
                "Already tired of all this … winning?",
                "“I bullied and alienated multiple countries - they will back down soon for U.S. final victory”, Trump state of union for the gullible",
                "Thought he was against transitioning"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "HOT",
            "title": "Moscow airports suspend flights after ‘massive’ Ukrainian drone attack",
            "external_url": "https://www.theguardian.com/world/2025/mar/11/moscow-airports-suspend-flights-after-massive-ukrainian-drone-attack",
            "upvotes": 1346,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1ecdcfb1374f87704afac6b6e5567b26715df9de/0_175_2000_1200/master/2000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=693fad69bc0bf93d7d0feb0082b77a57",
            "top_comments": [
                "If i remember one of hold outs preventing Ukraine from doing this before was the US as part of arms deal. Might be wrong",
                "Wonderful news! Keep up the fight and defeat putin and his asset, the traitorous felon krasnov.",
                "Well, it's what anyone would do!",
                "As far as I'm concerned, Russia was attacking the apartments and hospitals first. Why would that be a surprise?",
                "Good, some of their own medicine.",
                "[removed]",
                "[deleted]",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Judge temporarily blocks effort to deport Palestinian activist who helped lead Columbia student protests | CNN",
            "external_url": "https://www.cnn.com/2025/03/10/us/mahmoud-khalil-columbia-university-israel-hnk/index.html",
            "upvotes": 5143,
            "date": "03/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-23150126.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> The DHS agents said the US Department of State revoked Khalil’s student visa, although he does not have a student visa, but rather a green card, and is a lawful permanent resident, WAWOG said. When Khalil’s wife, who is eight months pregnant, showed the agents his green card, “one agent was visibly confused and said on the phone, ‘He has a green card’,” according to the news release. \n\nWhat an absolute shitshow.",
                "This is an illegal detainment. This is pure authoritarianism.",
                "This is the kind of thing that should alarm any American. Our government planning to punish and silence people who are using constitutionally protected rights. It's a really slippery slope that leads to nobody being allowed to criticize the government. It's something we consider abhorrent when other countries do it.",
                "The attempt at the federal government silencing someone and removing them is explicitly against the 1st Amendment.  If you don't see that our government is explicitly unconstitutional by now, you aren't looking.",
                "Good. The notion that someone who is legally in the country can be detained and punished for legally protesting the government is bullshit. \n\nFrom the “party of free speech and against cancel culture!”\n\nAnd the excuse is bullshit too. “Might support hamas” my puckered ass.",
                "There's going to be a lot of exhausted judges for the next 4 years. Hopefully it's only 4 years.",
                "I remember saying to multiple people that this exact thing would happen, and was told that I was exaggerating and catastrophizing.\n\nAnd people wonder why I don't take Republicans seriously anymore.",
                "RIP to the first amendment. If this works for trump, Americans are next.",
                "The state department can’t revoke a green card.  They also can’t revoke somebody’s authorized stay once they’ve entered the country.",
                "One of the basic, and most important rights, that we have in America is that Constitutional rights apply to all people within America. There is a reason why Bush sent terrorist to Gitmo and not an American prison on the mainland. The idea that we disagree with someone’s political view, despite their immigration stance, and want to deport them is both illegal and contrary to our laws. Hell, one of John Adam’s first famous acts was being the defense lawyer for the british soldiers in the Boston massacre. He did it not because he agreed with their actions but that our laws are universal or they are worthless. You don’t pick and choose when you want laws to apply. And before down votes happen. Imagine a democratic president doing the same thing to a conservative person. I’m sure that would go down just as smootgly."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Ontario premier threatens to ‘shut off electricity completely’ for US if tariffs escalates",
            "external_url": "https://edition.cnn.com/2025/03/10/business/canada-electricity-us-tariffs-doug-ford/index.html",
            "upvotes": 550,
            "date": "03/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2203462747.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I'm pretty sure where I live in northern NY would be affected. It's amazing how many Trump flags I see daily, yet almost every one of his policies hurt this rural, economically depressed area in some way.\n\n Given the electorate's short-term memory loss, they'll probably still go out and elect the next deplorable grifter with an R next to their name, regardless of how much damage Trump and Musk do.",
                "This is a big deal, because it’s not exactly an overnight thing to pivot to another source of electricity on a permanent basis. Hopefully this ever-increasing pressure will eventually resort in more of a backlash against Donald; because so far it doesn’t seem like there’s a whole lot of outrage against him quite literally destroying the US; at least outside of Reddit.",
                "Just do it. Let's get this over with guys \n\nWe see the wall, we know the car is gonna hit it because the new driver didn't listen to dad and ignored safety standards. Now we're crashing and finding that standing on the breaks does nothing",
                "I'm genuinely curious how many people and what areas would lose power?",
                "Good for him. This is a FAFO moment for everyone.",
                "As a Canadian and someone in full support of actions we have taken todate - I don't think this is a bright idea AT THIS POINT. We have a few nuclear options and this needs to be held back for when (or more hopefully if) things get that bad... the other nuclear options in my mind are export tax on oil, and potash.\n\nWe need to continue a tit for tat strategy and a complete shut off of electricity is not tit for tat - it would be an escalation and that is not the best strategy for us.",
                "America deserves this! They fucked around and hopefully they will find out!",
                "While I believe that Canada should respond as it see fit, I also believe that getting additional funds ( export tax) from US is a better outcome,since you can support unemployment for people that will lose their jobs. And in the meantime find new customers.",
                "raising the price is smart as it helps people understand Cost/Benefit. But, shutting it off is not smart, Trump is short term (if 4 years is short) so make some lemonade, don't just leave them to rot.",
                "Trump is know for \"double down\" on stupid shit."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Russia warns Australia of grave consequences if peacekeepers join coalition forces in Ukraine",
            "external_url": "https://www.abc.net.au/news/2025-03-10/australia-warned-of-grave-consequences/105034468",
            "upvotes": 3155,
            "date": "03/11/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/99e8e0324525e41b7717f16868465c40?impolicy=wcms_watermark_news&cropH=1687&cropW=3000&xPos=0&yPos=119&width=862&height=485&imformat=generic",
            "top_comments": [
                "Let the world not forget 37 Australian were among the 298 crew and passengers who perished during the tragedy of MH17. The perpetrators got absolutely f all consequences.",
                "Grave consequences as soon as Putin figures out a way to ship 100 donkeys to Australia",
                "Always the threats never the action.",
                "Everything on land and in the ocean is trying to kill Australians, you think they’re afraid of Putin?",
                "As a Canadian I don't stand at all for anyone * warning or threatening* Australia.",
                "Once Australia deploys the tactical assault emus Russia will eat their words.",
                "Russia can barely push a T-72 next door.  They aren't invading an Island thousands of miles away.",
                "Like Australia give 2 fux what Russia says",
                "There’s an entire subreddit of things that Russia has ominously warned about. R/ russiawarns",
                "DJ Dump has blocked shipment of older Australian tanks being sent to support Ukraine, Albo should be calling for them back immediately"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Washington Post editor resigns after accusing CEO of killing column",
            "external_url": "https://www.nbcnews.com/news/us-news/washington-post-editor-ruth-marcus-resigns-accusing-ceo-killing-column-rcna195634",
            "upvotes": 24586,
            "date": "03/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-10/241025-the-washington-post-newspaper-building-ew-1249p-551ccb.jpg",
            "top_comments": [
                "“Will’s decision to not run the column that I wrote respectfully dissenting from Jeff’s edict — something that I have not experienced in almost two decades of column-writing — underscores that the traditional freedom of columnists to select topics they wish to address and say what they think has been dangerously eroded,” Marcus wrote in her resignation, according to The New York Times.",
                "If I've said it once, I've said it a thousand times. \n\nThe true value of owning a newspaper is controlling the narrative and silencing opposition.\n\nIt doesn't matter to Jeff Bezos how many subscribers or ad clicks he has. He can *lose* money on the newspaper and it's still more valuable than not owning it. This way, he gets to drive a specific narrative specific to his own agenda while attaching a (formerly) prestigious publication to it. \n\nHe doesn't care about journalism. He cares about his money and power.\n\nThe days of legacy Journalism are over.",
                ">Bezos, the Amazon founder who purchased the venerable publication in 2013, told the staff last month that the opinion section would take a radical turn by \"writing every day in support and defense” of “personal liberties and free markets.\"\n\n\"From now on you'll print *my* opinion - daily\" - American oligarch and owner of the Washington Post",
                "People need to cancel, there is no way one can trust anything from the Washington post now",
                "I regret that I HAD only one Washington Post subscription to cancel for my country.",
                "Nothing to see here, just the conservative billionaires who control the media killing anything that doesn't support their narratives.",
                "WP credibility shot to pieces .",
                ">Democracy Dies In Darkness\n\nIt used to be a warning, but it's become just a description...",
                "The part where they discredit everything so nobody knows what to believe.\n\nThe ultimate objective aims for America's transformation into a diminished power: A nation too internally divided to project global influence, democratic institutions that exist in form but not function, *a population skeptical of all information sources*, alliances fractured beyond effective cooperation, economic systems vulnerable to external pressure, cultural divisions preventing unified national purpose. It succeeds not through conquest but conversion - turning America's strengths into vulnerabilities and its systems against itself. The most devastating aspect is its plausible deniability, with each action justifiable through other motives, the pattern only visible when viewed as a whole.\n\nThis portrays an operation of remarkable scope and patience, turning America's openness, individualism, and democratic processes into vectors for its decline. The genius of this operation is its self-sustaining nature - once set in motion, America's own dynamics continue the process without continued external direction.",
                "If only there was a way to cancel my subscription multiple times. "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Ukraine's biggest drone attack on Moscow kills one, disrupts air and train transport",
            "external_url": "https://www.reuters.com/world/europe/ukraine-launches-drone-attacks-targeting-moscow-russia-says-2025-03-11/",
            "upvotes": 847,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Russia could just give up territory, dismantle their military, vowing never to join a defensive alliance, sell their minerals cheap to Germany and this won’t happen again.\n\n;P",
                "Well since Trump pulled aid Ukraine is now free to attack Ruzzia as much as they like.\n\nUS is really destroying itself lmfao.",
                "Oh well, they started it.",
                "The russian people need to stand up to Putin and demand a ceasefire. Like America needs too",
                "***adding War Pigs to my play list***",
                "Great news! \n\nDon’t stop until these murderous russian invaders surrender and pay for what they have done.",
                "No one was killed. A human meat interceptor blocked an incoming drone."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "New York fires 2,000 prison guards, declares strike over",
            "external_url": "https://www.cbsnews.com/newyork/news/new-yorks-prison-strike-poised-to-end-monday/",
            "upvotes": 606,
            "date": "03/11/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/03/60609003-572c-4d8b-9f73-987802bcfc0c/thumbnail/1200x630/d42a6c315c0444cfb5330c6c71fc87bf/ap25058732974698.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "Nothing like having disgruntled employees watching over felons. Surely this is a recipe for good things only.",
                "Work condition just got worse now with 2000 less guards = More mandatory overtimes.",
                "To be clear, these prison guards went on strike because of a law put in place over solitary confinement.",
                "Does anyone have any info on why these 2000 guards held out? The article says a deal was struck, but these were the hold outs and fired because of it.",
                "Naw screw those prison guards, striking over being mad they can't just send people to solitary confinement willy nilly.",
                "This has Trump disillusionment vibes",
                "Ss: DOCCS said no penalties were waived as part of the agreement.",
                "Maybe they should stop being corrupt and murdering inmates? ",
                "The union and the state came to an agreement, these are the hold outs. Not saying there isn’t more to it, but this isn’t DOGE/ fElon style bullshit, there was a good faith effort from the state from what I can gather. ",
                "And the governor is worried about bad press… try skirting the unions under, what she called, an “illegal strike”\n\nStriking is legal under union representation if an accord is not met with contracts. What she did opens up the state of New York to lawsuits which, in my opinion, is reckless and puts larger liability on the state and her administration. So why did she do it? Just to end the strike??"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "ICE accessed car trackers in sanctuary cities that could help in raids, files show",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/11/ice-car-trackers-sanctuary-cities",
            "upvotes": 84,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d9dedc528334a4887911e448f31e312aa88ddced/0_221_4571_2743/master/4571.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=78eff3fbf2a5d68c5d2586cbdcaeff4b",
            "top_comments": [
                "These ICE guys sound like a bunch of goombas.",
                "Regardless of how you feel the about immigration situation in this country, it's only a matter of time before they start using these same tactics to track down political dissidents.",
                "They’re installing trackers in my city of less than 5,000 people. Seems ridiculous.",
                "I think statistics show members of the church are more detrimental to American children than raids on migrant workers. I understand ICE needs a paycheck but this is becoming egregiously wasteful of my taxes and decreasing my crop prices",
                "Reminder that the government can and will track your car and use that information against you.",
                "Another click bait headline. Makes it sound like they can access car data from cars. Spoiler: they're just using license plate trade data from traffic cams.  \nStill sketchy, of course. But not that big brothery."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Ontario premier threatens to ‘shut off electricity completely’ for US if tariffs escalates",
            "external_url": "https://edition.cnn.com/2025/03/10/business/canada-electricity-us-tariffs-doug-ford/index.html",
            "upvotes": 552,
            "date": "03/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2203462747.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I'm pretty sure where I live in northern NY would be affected. It's amazing how many Trump flags I see daily, yet almost every one of his policies hurt this rural, economically depressed area in some way.\n\n Given the electorate's short-term memory loss, they'll probably still go out and elect the next deplorable grifter with an R next to their name, regardless of how much damage Trump and Musk do.",
                "This is a big deal, because it’s not exactly an overnight thing to pivot to another source of electricity on a permanent basis. Hopefully this ever-increasing pressure will eventually resort in more of a backlash against Donald; because so far it doesn’t seem like there’s a whole lot of outrage against him quite literally destroying the US; at least outside of Reddit.",
                "Just do it. Let's get this over with guys \n\nWe see the wall, we know the car is gonna hit it because the new driver didn't listen to dad and ignored safety standards. Now we're crashing and finding that standing on the breaks does nothing",
                "I'm genuinely curious how many people and what areas would lose power?",
                "Good for him. This is a FAFO moment for everyone.",
                "As a Canadian and someone in full support of actions we have taken todate - I don't think this is a bright idea AT THIS POINT. We have a few nuclear options and this needs to be held back for when (or more hopefully if) things get that bad... the other nuclear options in my mind are export tax on oil, and potash.\n\nWe need to continue a tit for tat strategy and a complete shut off of electricity is not tit for tat - it would be an escalation and that is not the best strategy for us.",
                "America deserves this! They fucked around and hopefully they will find out!",
                "While I believe that Canada should respond as it see fit, I also believe that getting additional funds ( export tax) from US is a better outcome,since you can support unemployment for people that will lose their jobs. And in the meantime find new customers.",
                "raising the price is smart as it helps people understand Cost/Benefit. But, shutting it off is not smart, Trump is short term (if 4 years is short) so make some lemonade, don't just leave them to rot.",
                "Trump is know for \"double down\" on stupid shit."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "New York fires 2,000 prison guards, declares strike over",
            "external_url": "https://www.cbsnews.com/newyork/news/new-yorks-prison-strike-poised-to-end-monday/",
            "upvotes": 606,
            "date": "03/11/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/03/60609003-572c-4d8b-9f73-987802bcfc0c/thumbnail/1200x630/d42a6c315c0444cfb5330c6c71fc87bf/ap25058732974698.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "Nothing like having disgruntled employees watching over felons. Surely this is a recipe for good things only.",
                "Work condition just got worse now with 2000 less guards = More mandatory overtimes.",
                "To be clear, these prison guards went on strike because of a law put in place over solitary confinement.",
                "Does anyone have any info on why these 2000 guards held out? The article says a deal was struck, but these were the hold outs and fired because of it.",
                "Naw screw those prison guards, striking over being mad they can't just send people to solitary confinement willy nilly.",
                "This has Trump disillusionment vibes",
                "Ss: DOCCS said no penalties were waived as part of the agreement.",
                "Maybe they should stop being corrupt and murdering inmates? ",
                "The union and the state came to an agreement, these are the hold outs. Not saying there isn’t more to it, but this isn’t DOGE/ fElon style bullshit, there was a good faith effort from the state from what I can gather. ",
                "And the governor is worried about bad press… try skirting the unions under, what she called, an “illegal strike”\n\nStriking is legal under union representation if an accord is not met with contracts. What she did opens up the state of New York to lawsuits which, in my opinion, is reckless and puts larger liability on the state and her administration. So why did she do it? Just to end the strike??"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Moscow airports suspend flights after ‘massive’ Ukrainian drone attack",
            "external_url": "https://www.theguardian.com/world/2025/mar/11/moscow-airports-suspend-flights-after-massive-ukrainian-drone-attack",
            "upvotes": 1351,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1ecdcfb1374f87704afac6b6e5567b26715df9de/0_175_2000_1200/master/2000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=693fad69bc0bf93d7d0feb0082b77a57",
            "top_comments": [
                "If i remember one of hold outs preventing Ukraine from doing this before was the US as part of arms deal. Might be wrong",
                "Wonderful news! Keep up the fight and defeat putin and his asset, the traitorous felon krasnov.",
                "Well, it's what anyone would do!",
                "As far as I'm concerned, Russia was attacking the apartments and hospitals first. Why would that be a surprise?",
                "Good, some of their own medicine.",
                "[removed]",
                "[deleted]",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Alex Jones says Infowars reporter Jamie White was fatally shot near Texas home",
            "external_url": "https://www.the-independent.com/news/world/americas/crime/jamie-white-infowars-murder-alex-jones-b2712630.html",
            "upvotes": 5384,
            "date": "03/11/2025",
            "thumbnail": "https://static.the-independent.com/2025/03/11/02/jamie-white.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                ">Nevertheless, he said: \"I lay all of this squarely at the feet of these DAs and of the Soros crime syndicate, and of the Democratic Party.”\n\nSo much for the \"wait for all the facts to come out\" side. They won't even wait for the body to get cold to sacrifice the memory of one of their own to the altar of owning the libs.",
                "by the way: Is Alex Jones still pretending to be broke in order to escape the just punishment for mocking the victims with his lies?",
                "This is just a false flag by Alex Jones. Jamie White isn't even a real person. He's been seen at hundreds of locations as a paid crisis reporter. ",
                "[removed]",
                "I guess he lost the info war",
                "Nah probably a crisis actor this never happened",
                "It's his fault he got shot. If he didn't want to get shot, he shouldn't have been dressed like that. His body had a way of shutting down that bullet. Totally the victims fault.",
                "So, in a heavily GOP controlled region, the usual cats put the blame on... hold on, let me see, someone who is NOT a lawmaker. Of course. Makes perfect nonsense.",
                "I see were using the term \"journalist\" real, real loosely here. \n\n\nAnyway, tots and pears I guess. Best I can do.  ",
                "Inb4 it’s just that he got into an argument with a gun nut neighbor because it’s Texas…"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Ukraine's biggest drone attack on Moscow kills one, disrupts air and train transport",
            "external_url": "https://www.reuters.com/world/europe/ukraine-launches-drone-attacks-targeting-moscow-russia-says-2025-03-11/",
            "upvotes": 846,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Russia could just give up territory, dismantle their military, vowing never to join a defensive alliance, sell their minerals cheap to Germany and this won’t happen again.\n\n;P",
                "Well since Trump pulled aid Ukraine is now free to attack Ruzzia as much as they like.\n\nUS is really destroying itself lmfao.",
                "Oh well, they started it.",
                "The russian people need to stand up to Putin and demand a ceasefire. Like America needs too",
                "***adding War Pigs to my play list***",
                "Great news! \n\nDon’t stop until these murderous russian invaders surrender and pay for what they have done.",
                "No one was killed. A human meat interceptor blocked an incoming drone."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Texas army base poised to become mass deportation hub under new plan",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/08/texas-army-fort-bliss-deportation-detention",
            "upvotes": 886,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a2b686ca4ccf4a2d7b09134ea6bf357582a94180/0_88_2631_1580/master/2631.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1fa80dbce6850981de8ad2f33ea339c8",
            "top_comments": [
                "God i hate that they’re building a concentration camp right by my city. I already despise living in Texas, but this is rubbing salt on the wound.",
                "Fort Bliss \n\nWar is peace",
                "You misspelled \"concentration camp\"",
                "Texaushwitz.\n\nThis will end well.",
                ">Reports of Fort Bliss being used for detention as well as expulsion purposes spark outrage from critics\n\nIn case you were wondering which base",
                "\"Deportation Hub\". Sure, let's go with that. Just ignore all those open trenches and mysterious clouds of black smoke...",
                "of course in texas, Poll on which red state is the most evil at this point? people called this before they put one at gitmo.",
                "So that’s the first concentration camp in the new America?",
                "Spending all those millions to ship migrants everywhere else, and now Texas makes millions getting em all back. Not even sure it’s a smart grift but follow the money.",
                "State prisons owners don’t trust the Trump administration to pay the inmate housing bills. "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "US rebrands immigration app to CBP Home with ‘self-deport’ function",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/10/us-self-deport-app-cbp-home-immigration",
            "upvotes": 1030,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6f794a259755f8a3a9d533a1fc5e5f514f2e1414/0_171_6365_3822/master/6365.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4326e55c252ad9c4a6524d97c7a29fd1",
            "top_comments": [
                "I can say with nearly 100% confidence that a self-deport function was another one of Elon's ketamine-fueled ideas",
                "So by merely using the app your GPS position is logged, cross-referenced and ICE alerted to your whereabouts?\n\nHoney trap anyone?",
                "This is only Trump’s second month. At this rate in one year nobody wants to move to the U.S. or stay here anyway",
                "If I self deport, can I pick where to?  Asking on behalf of American citizens.",
                "Can I self deport myself. This maybe the ticket outta hell I need.",
                "The Kristi Noem ads where she touts “self-deportation” are chilling to watch. And cringeworthy, since they’re only run during the news, and in English only.",
                "Let me guess, the updated app will relay your GPS to the nearest ICE office. Hmm, I wonder what happens if more people get the app...",
                "i wonder what would happen if a bunch of bored American citizens spam that.",
                "We are living in an episode of black mirror.",
                "It's probably no longer safe to install any government app on your phone. No idea what Musk is collecting about you. Your 4th amendment rights will not be protected if you give the app permission to collect data about you. Think about reddit banning you for *upvoting* a comment. You could find yourself at the end of a SS investigation for \"inciting violence\" against Trump. Deporting people is the start. Locking up Liberals is next."
            ],
            "aggregate_sentiment": 23.0
        },
        {
            "category": "NEW",
            "title": "Russia warns Australia of grave consequences if peacekeepers join coalition forces in Ukraine",
            "external_url": "https://www.abc.net.au/news/2025-03-10/australia-warned-of-grave-consequences/105034468",
            "upvotes": 3164,
            "date": "03/11/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/99e8e0324525e41b7717f16868465c40?impolicy=wcms_watermark_news&cropH=1687&cropW=3000&xPos=0&yPos=119&width=862&height=485&imformat=generic",
            "top_comments": [
                "Let the world not forget 37 Australian were among the 298 crew and passengers who perished during the tragedy of MH17. The perpetrators got absolutely f all consequences.",
                "Grave consequences as soon as Putin figures out a way to ship 100 donkeys to Australia",
                "Always the threats never the action.",
                "Everything on land and in the ocean is trying to kill Australians, you think they’re afraid of Putin?",
                "As a Canadian I don't stand at all for anyone * warning or threatening* Australia.",
                "Once Australia deploys the tactical assault emus Russia will eat their words.",
                "Russia can barely push a T-72 next door.  They aren't invading an Island thousands of miles away.",
                "Like Australia give 2 fux what Russia says",
                "There’s an entire subreddit of things that Russia has ominously warned about. R/ russiawarns",
                "DJ Dump has blocked shipment of older Australian tanks being sent to support Ukraine, Albo should be calling for them back immediately"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Microplastics Are Messing with Photosynthesis in Plants",
            "external_url": "https://www.scientificamerican.com/article/microplastic-pollution-is-messing-with-photosynthesis-in-plants/",
            "upvotes": 1214,
            "date": "03/10/2025",
            "thumbnail": "https://static.scientificamerican.com/dam/m/46e06e82bdca0207/original/Plastic-sheeting-surrounds-crops.jpg?m=1741634378.369&w=1200",
            "top_comments": [
                "We have filled every corner of the planet with plastic, and now it is sabotaging the very process that keeps life going, photosynthesis. If plants and algae struggle to convert sunlight into energy, we are looking at lower crop yields, collapsing marine ecosystems, and yet another hit to our ability to capture carbon.\n\nThe fact that a mere 13 per cent reduction in plastic pollution could significantly slow this damage makes it even more infuriating. We have known for decades that plastic breaks down into microplastics, yet international talks keep stalling. If we do not act soon, \"plastic planet\" will stop being a metaphor and start being a reality.",
                "*They’re being detected everywhere researchers look, from Antarctic sea ice to* [*human brains*](https://www.scientificamerican.com/podcast/episode/how-are-microplastics-getting-into-our-brain/)*....   Scientists are  just beginning to understand how these pollutants affect one of the most essential and widespread kingdoms of life on Earth: plants.*\n\nPhotosynthesis is cut from 7-12% which means a similar loss of production.  (add in strokes, heart problems, Alzheimers in people)",
                "This is not something that plants crave.",
                "The plastics industry really set-off a global long-term dirty bomb didn't they. Price of progress I guess 🤷",
                "Eventually companies will be forced to admit that they probably knew there were serious health risks with plastics and other chemicals. Risks ranging from infertility to autism ,even death . It was know for decades how dangerous asbestos was but they used it anyway.The companies just declare bankruptcy and try to shield all wealthy investors  while they destroy Americans. Just like asbestos they have no idea how to get the microplastics out of the body ,it just piles up in the organs, brain and tissue ,autopsies show the increased weight of organs from accumulation. We are all being destroyed.",
                "Well, maybe the plants should think about finally eliminating plastic from their lives.",
                "God, we’re so boned.\n\nI can’t wait for whatever radical idea is proposed to “fix” this that actually makes things so much worse.",
                "What little things can I do to help? Genuine question.",
                "Reminder that the vast majority of microplastics in the environment, in most cases around 75%, but up to 90%, come from tire wear from cars and other heavy motor vehicles. This problem is not going to be solved by any means by simply switching away from plastic in consumer goods. We have to get away from our dependence on motor vehicles if we want to move the needle.",
                "The majority of plastics in the ocean come from 10 rivers in Asia / Africa\n[https://www.scientificamerican.com/article/stemming-the-plastic-tide-10-rivers-contribute-most-of-the-plastic-in-the-oceans/](https://www.scientificamerican.com/article/stemming-the-plastic-tide-10-rivers-contribute-most-of-the-plastic-in-the-oceans/)"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Ontario premier threatens to ‘shut off electricity completely’ for US if tariffs escalates",
            "external_url": "https://edition.cnn.com/2025/03/10/business/canada-electricity-us-tariffs-doug-ford/index.html",
            "upvotes": 553,
            "date": "03/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2203462747.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I'm pretty sure where I live in northern NY would be affected. It's amazing how many Trump flags I see daily, yet almost every one of his policies hurt this rural, economically depressed area in some way.\n\n Given the electorate's short-term memory loss, they'll probably still go out and elect the next deplorable grifter with an R next to their name, regardless of how much damage Trump and Musk do.",
                "This is a big deal, because it’s not exactly an overnight thing to pivot to another source of electricity on a permanent basis. Hopefully this ever-increasing pressure will eventually resort in more of a backlash against Donald; because so far it doesn’t seem like there’s a whole lot of outrage against him quite literally destroying the US; at least outside of Reddit.",
                "Just do it. Let's get this over with guys \n\nWe see the wall, we know the car is gonna hit it because the new driver didn't listen to dad and ignored safety standards. Now we're crashing and finding that standing on the breaks does nothing",
                "I'm genuinely curious how many people and what areas would lose power?",
                "Good for him. This is a FAFO moment for everyone.",
                "As a Canadian and someone in full support of actions we have taken todate - I don't think this is a bright idea AT THIS POINT. We have a few nuclear options and this needs to be held back for when (or more hopefully if) things get that bad... the other nuclear options in my mind are export tax on oil, and potash.\n\nWe need to continue a tit for tat strategy and a complete shut off of electricity is not tit for tat - it would be an escalation and that is not the best strategy for us.",
                "America deserves this! They fucked around and hopefully they will find out!",
                "While I believe that Canada should respond as it see fit, I also believe that getting additional funds ( export tax) from US is a better outcome,since you can support unemployment for people that will lose their jobs. And in the meantime find new customers.",
                "raising the price is smart as it helps people understand Cost/Benefit. But, shutting it off is not smart, Trump is short term (if 4 years is short) so make some lemonade, don't just leave them to rot.",
                "Trump is know for \"double down\" on stupid shit."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Moscow airports suspend flights after ‘massive’ Ukrainian drone attack",
            "external_url": "https://www.theguardian.com/world/2025/mar/11/moscow-airports-suspend-flights-after-massive-ukrainian-drone-attack",
            "upvotes": 1342,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1ecdcfb1374f87704afac6b6e5567b26715df9de/0_175_2000_1200/master/2000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=693fad69bc0bf93d7d0feb0082b77a57",
            "top_comments": [
                "If i remember one of hold outs preventing Ukraine from doing this before was the US as part of arms deal. Might be wrong",
                "Wonderful news! Keep up the fight and defeat putin and his asset, the traitorous felon krasnov.",
                "Well, it's what anyone would do!",
                "As far as I'm concerned, Russia was attacking the apartments and hospitals first. Why would that be a surprise?",
                "Good, some of their own medicine.",
                "[removed]",
                "[deleted]",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Ukraine's biggest drone attack on Moscow kills one, disrupts air and train transport",
            "external_url": "https://www.reuters.com/world/europe/ukraine-launches-drone-attacks-targeting-moscow-russia-says-2025-03-11/",
            "upvotes": 840,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Russia could just give up territory, dismantle their military, vowing never to join a defensive alliance, sell their minerals cheap to Germany and this won’t happen again.\n\n;P",
                "Well since Trump pulled aid Ukraine is now free to attack Ruzzia as much as they like.\n\nUS is really destroying itself lmfao.",
                "Oh well, they started it.",
                "The russian people need to stand up to Putin and demand a ceasefire. Like America needs too",
                "***adding War Pigs to my play list***",
                "Great news! \n\nDon’t stop until these murderous russian invaders surrender and pay for what they have done.",
                "No one was killed. A human meat interceptor blocked an incoming drone."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "New York fires 2,000 prison guards, declares strike over",
            "external_url": "https://www.cbsnews.com/newyork/news/new-yorks-prison-strike-poised-to-end-monday/",
            "upvotes": 606,
            "date": "03/11/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/03/60609003-572c-4d8b-9f73-987802bcfc0c/thumbnail/1200x630/d42a6c315c0444cfb5330c6c71fc87bf/ap25058732974698.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "Nothing like having disgruntled employees watching over felons. Surely this is a recipe for good things only.",
                "Work condition just got worse now with 2000 less guards = More mandatory overtimes.",
                "To be clear, these prison guards went on strike because of a law put in place over solitary confinement.",
                "Does anyone have any info on why these 2000 guards held out? The article says a deal was struck, but these were the hold outs and fired because of it.",
                "Naw screw those prison guards, striking over being mad they can't just send people to solitary confinement willy nilly.",
                "This has Trump disillusionment vibes",
                "Ss: DOCCS said no penalties were waived as part of the agreement.",
                "Maybe they should stop being corrupt and murdering inmates? ",
                "The union and the state came to an agreement, these are the hold outs. Not saying there isn’t more to it, but this isn’t DOGE/ fElon style bullshit, there was a good faith effort from the state from what I can gather. ",
                "And the governor is worried about bad press… try skirting the unions under, what she called, an “illegal strike”\n\nStriking is legal under union representation if an accord is not met with contracts. What she did opens up the state of New York to lawsuits which, in my opinion, is reckless and puts larger liability on the state and her administration. So why did she do it? Just to end the strike??"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Alex Jones says Infowars reporter Jamie White was fatally shot near Texas home",
            "external_url": "https://www.the-independent.com/news/world/americas/crime/jamie-white-infowars-murder-alex-jones-b2712630.html",
            "upvotes": 5385,
            "date": "03/11/2025",
            "thumbnail": "https://static.the-independent.com/2025/03/11/02/jamie-white.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                ">Nevertheless, he said: \"I lay all of this squarely at the feet of these DAs and of the Soros crime syndicate, and of the Democratic Party.”\n\nSo much for the \"wait for all the facts to come out\" side. They won't even wait for the body to get cold to sacrifice the memory of one of their own to the altar of owning the libs.",
                "by the way: Is Alex Jones still pretending to be broke in order to escape the just punishment for mocking the victims with his lies?",
                "This is just a false flag by Alex Jones. Jamie White isn't even a real person. He's been seen at hundreds of locations as a paid crisis reporter. ",
                "[removed]",
                "I guess he lost the info war",
                "Nah probably a crisis actor this never happened",
                "It's his fault he got shot. If he didn't want to get shot, he shouldn't have been dressed like that. His body had a way of shutting down that bullet. Totally the victims fault.",
                "So, in a heavily GOP controlled region, the usual cats put the blame on... hold on, let me see, someone who is NOT a lawmaker. Of course. Makes perfect nonsense.",
                "I see were using the term \"journalist\" real, real loosely here. \n\n\nAnyway, tots and pears I guess. Best I can do.  ",
                "Inb4 it’s just that he got into an argument with a gun nut neighbor because it’s Texas…"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Texas army base poised to become mass deportation hub under new plan",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/08/texas-army-fort-bliss-deportation-detention",
            "upvotes": 892,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a2b686ca4ccf4a2d7b09134ea6bf357582a94180/0_88_2631_1580/master/2631.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1fa80dbce6850981de8ad2f33ea339c8",
            "top_comments": [
                "God i hate that they’re building a concentration camp right by my city. I already despise living in Texas, but this is rubbing salt on the wound.",
                "Fort Bliss \n\nWar is peace",
                "You misspelled \"concentration camp\"",
                "Texaushwitz.\n\nThis will end well.",
                ">Reports of Fort Bliss being used for detention as well as expulsion purposes spark outrage from critics\n\nIn case you were wondering which base",
                "\"Deportation Hub\". Sure, let's go with that. Just ignore all those open trenches and mysterious clouds of black smoke...",
                "of course in texas, Poll on which red state is the most evil at this point? people called this before they put one at gitmo.",
                "So that’s the first concentration camp in the new America?",
                "Spending all those millions to ship migrants everywhere else, and now Texas makes millions getting em all back. Not even sure it’s a smart grift but follow the money.",
                "State prisons owners don’t trust the Trump administration to pay the inmate housing bills. "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US rebrands immigration app to CBP Home with ‘self-deport’ function",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/10/us-self-deport-app-cbp-home-immigration",
            "upvotes": 1032,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6f794a259755f8a3a9d533a1fc5e5f514f2e1414/0_171_6365_3822/master/6365.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4326e55c252ad9c4a6524d97c7a29fd1",
            "top_comments": [
                "I can say with nearly 100% confidence that a self-deport function was another one of Elon's ketamine-fueled ideas",
                "So by merely using the app your GPS position is logged, cross-referenced and ICE alerted to your whereabouts?\n\nHoney trap anyone?",
                "This is only Trump’s second month. At this rate in one year nobody wants to move to the U.S. or stay here anyway",
                "If I self deport, can I pick where to?  Asking on behalf of American citizens.",
                "Can I self deport myself. This maybe the ticket outta hell I need.",
                "The Kristi Noem ads where she touts “self-deportation” are chilling to watch. And cringeworthy, since they’re only run during the news, and in English only.",
                "Let me guess, the updated app will relay your GPS to the nearest ICE office. Hmm, I wonder what happens if more people get the app...",
                "i wonder what would happen if a bunch of bored American citizens spam that.",
                "We are living in an episode of black mirror.",
                "It's probably no longer safe to install any government app on your phone. No idea what Musk is collecting about you. Your 4th amendment rights will not be protected if you give the app permission to collect data about you. Think about reddit banning you for *upvoting* a comment. You could find yourself at the end of a SS investigation for \"inciting violence\" against Trump. Deporting people is the start. Locking up Liberals is next."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "US added to international watchlist for rapid decline in civic freedoms | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/09/watchlist-decline-civic-freedoms-civicus",
            "upvotes": 50739,
            "date": "03/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f838401ad096f61dcc28e6dfd2f04d0dad5d8448/0_192_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=66c6b81aa93b4e5c81e2755827179a60",
            "top_comments": [
                "Ah yes, soon to be in a \"do not travel advisory\". Especially after what happened to that German tourist.",
                "Does this mean Americans can now seek asylum in other countries to escape persecution?",
                "I would have never imagined to see this shit show in the US. Insane!",
                "\\* Minority groups suppressed\n\n\\* Free press not allowed at WH\n\n\\* Uni students threatened if they dare protest, general intimidation tactics\n\n\\* Reckless gov dismissals and appointing loyalist to the president rather than the constitution\n\n\\* Medicaid and social security under threat\n\n\\* Withdrew from UN Human Rights Council",
                "Just do us the kind favor and arrest the rich as they travel abroad for human rights abuses, and likely significant other crimes. Blanket freeze on assets too.",
                "And we're only 2 months in.",
                "I knew it was the right choice to not give up Mexican citizenship. Plus being Mexican is awesome.",
                "Are we winning yet Mr Krabs?",
                "Good. It's the least this administration deserves.",
                "You MAGA heads proud of what trumpz has done to America so far? Feeling good about being a laughing stock on the world stage? Feeling good losing your rights to free speach and the right to protest? Feeling good about the economy? Guy is pathetic and worse he is a traitor to what makes America and previous American Presidents great."
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "RISING",
            "title": "Stocks fall as Trump warns of US economy trade war 'transition'",
            "external_url": "https://www.bbc.co.uk/news/articles/cz61nn99eg1o",
            "upvotes": 45668,
            "date": "03/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7d16/live/091cf470-fdc2-11ef-8869-3b46261c581e.jpg",
            "top_comments": [
                "Tesla down 15% today alone is crazy. Wipes out every gain they made from November.",
                "President of “No Wars” begins his second term by starting a Trade War. More news at 11",
                "the great businessman who had 6 bankruptcies ladies and gentlemen.  🎩 ",
                "Trump, contrary to polls, is very bad for our economy.",
                "In case anyone is wondering where we've been and where we're going, here's a handy guide.\n\n1. The tariffs are great for the economy\n2. The tariffs are great for the economy, but it will take time to see\n3. The tariffs will be good overall for America, but the economy will \"transition\" **<-- (you are here)**\n4. This is a market correction, not a recession\n5. Not *all* experts agree that we're in stagflation\n6. This depression is all because of the Biden/Obama tariffs which I, Donald Trump, will now end!",
                "Transition TO WHAT?   Financial ruin, destroyed partnerships, vaporized supply chains, never retiring, and blown investments?\n\nThis guy is the dumbest sack of Matlock reruns I have ever seen.",
                "We've almost given up 6 months of stock growth. The stock market isn't the economy, but when stocks slump, the real economy slumps.",
                "Already tired of all this … winning?",
                "“I bullied and alienated multiple countries - they will back down soon for U.S. final victory”, Trump state of union for the gullible",
                "Thought he was against transitioning"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Judge temporarily blocks effort to deport Palestinian activist who helped lead Columbia student protests | CNN",
            "external_url": "https://www.cnn.com/2025/03/10/us/mahmoud-khalil-columbia-university-israel-hnk/index.html",
            "upvotes": 5148,
            "date": "03/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-23150126.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> The DHS agents said the US Department of State revoked Khalil’s student visa, although he does not have a student visa, but rather a green card, and is a lawful permanent resident, WAWOG said. When Khalil’s wife, who is eight months pregnant, showed the agents his green card, “one agent was visibly confused and said on the phone, ‘He has a green card’,” according to the news release. \n\nWhat an absolute shitshow.",
                "This is an illegal detainment. This is pure authoritarianism.",
                "This is the kind of thing that should alarm any American. Our government planning to punish and silence people who are using constitutionally protected rights. It's a really slippery slope that leads to nobody being allowed to criticize the government. It's something we consider abhorrent when other countries do it.",
                "The attempt at the federal government silencing someone and removing them is explicitly against the 1st Amendment.  If you don't see that our government is explicitly unconstitutional by now, you aren't looking.",
                "Good. The notion that someone who is legally in the country can be detained and punished for legally protesting the government is bullshit. \n\nFrom the “party of free speech and against cancel culture!”\n\nAnd the excuse is bullshit too. “Might support hamas” my puckered ass.",
                "There's going to be a lot of exhausted judges for the next 4 years. Hopefully it's only 4 years.",
                "I remember saying to multiple people that this exact thing would happen, and was told that I was exaggerating and catastrophizing.\n\nAnd people wonder why I don't take Republicans seriously anymore.",
                "RIP to the first amendment. If this works for trump, Americans are next.",
                "The state department can’t revoke a green card.  They also can’t revoke somebody’s authorized stay once they’ve entered the country.",
                "One of the basic, and most important rights, that we have in America is that Constitutional rights apply to all people within America. There is a reason why Bush sent terrorist to Gitmo and not an American prison on the mainland. The idea that we disagree with someone’s political view, despite their immigration stance, and want to deport them is both illegal and contrary to our laws. Hell, one of John Adam’s first famous acts was being the defense lawyer for the british soldiers in the Boston massacre. He did it not because he agreed with their actions but that our laws are universal or they are worthless. You don’t pick and choose when you want laws to apply. And before down votes happen. Imagine a democratic president doing the same thing to a conservative person. I’m sure that would go down just as smootgly."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "03/11/2025 12:44:43 UTC"
}