{
    "posts": [
        {
            "category": "HOT",
            "title": "U.S. Peace Corps says Musk's DOGE has arrived at its HQ",
            "external_url": "https://www.reuters.com/world/us/us-peace-corps-says-musks-cost-cutting-team-has-arrived-its-hq-2025-04-04/",
            "upvotes": 13345,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This administration is amplifying everything people dislike about the US while simultaneously destroying everything people do like about the US.",
                "So, what exactly happens if an agency simply doesn’t cooperate with DOGE?",
                "I can't imagine an agency with less fat than the Peace Corps; the stipends are miniscule.",
                "That is easily the dumbest hat I've seen in quite a while and we've all seen a LOT of MAGA hats.",
                "The Musk/Trump administration doesn't understand the concept of 'soft power'. Furthermore, they're entirely unwilling to listen to the argument for it. America's greatness (such that it ever existed) comes in large part to it's effective use of soft power. The Marshall Plan, the Peace Corps and NASA all have a roll in advancing America's interest abroad. Dollar-for-dollar these programs grew the brand of America more than it's military or direct diplomacy ever could on its own. Wait two years to see.",
                "The grim reaper has arrived. Aside from Trump , Netanyahu and Putin,  Elon is the most unpopular person in the world today.",
                "It's painfully obvious that the whole administration has bought into some absolute bullshit lie from Elon Musk about his, garbage tier, Grok AI being ready to take over most of the federal government's functions. Elon is a great con man when dealing with people who understand tech. When he starts selling shit to the types of people in the Trump admin it is like shooting fish in a barrel. This whole experiment is going to destroy the US standing in the world, it's economy, and the US tech industry. We are getting Xed at a national scale. If you voted for this you are an absolute fucking dipshit.",
                "Have you noticed that DOGE does the worst things on Friday afternoons? DOGE fears accountability",
                "You have to be truly evil and dead inside to dismantle the Peace Corps. There’s a special place in hell reserved for Elon Musk.",
                "It’s like the bureaucracy version of the fucking mongols arriving at your city gates"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Federal judge rules return of Maryland man mistakenly deported to El Salvador prison",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/04/maryland-deported-el-salvador-kilmar-abrego-garcia",
            "upvotes": 26638,
            "date": "04/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/c20b3ba9e18add1958ec77d0ca363335b3355628/0_100_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=07a4e4739e53960824a55ef20b2d1e0b",
            "top_comments": [
                "if we lived in a sane country, he and his family would be able to sue for tens of millions. the entire saga is fucking ridiculous. \n\n\"we know we fucked up, but it would be against our shit plan to undo it so cope ig\"",
                "It's not over till he's home.",
                "an innocent man just can be held in jail?  What kind of crazy idea is that ... oh due process?  human rights?...huh I am pretty sure the Republican party gave those up",
                "Interesting how the Trump admin indicates it can do nothing about retrieving this man from El Salvador with whom it has very friendly relations, yet it was able to get Mexico to bring back the 2 Caucasian people who were in jail for defrauding a timeshare company in Mexico after 2 weeks of negotiating (as they were apparently guilty of the fraud).\n\nSo all that is really at play here is that the Trump admin does not want to bring this person back, because they are not white.  It is as simple as that.",
                "The truth is this Nazi admin doesn't want this man back because he'll be able to speak on how terrible and inhumane the treatment is at this death camp. They could get him back no problem, its that it would not bode well for them if they did.",
                "Republicans would call this judicial overreach",
                "And for every story like this we see, you just *know* there's a hundred cataclysmic fuck-ups that we're not seeing. \n\nLast time this ape was in charge his equivocating gibberish and asinine policies exacerbated a deadly pandemic [leading to many, many unnecessary COVID deaths] (https://www.businessinsider.com/analysis-trump-covid-19-response-40-percent-us-deaths-avoidable-2021-2?op=1) and [dead Americans in general](https://www.forbes.com/sites/tommybeer/2021/02/11/trumps-policies-resulted-in-the-unnecessary-deaths-of-hundreds-of-thousands-of-americans-lancet-report/) but none of this ever gets brought up and he surely sleeps like a baby.\n\nI shudder to think of what we don't know.",
                "How sad that it had to go to a judge and they refused to correct their tragic mistake in the first place.",
                "I hope he's returned swiftly and safely, but I doubt part of disappearing people is keeping track of where they wind up at the other end. I've never worked as a human trafficker, so idk.",
                "They should all be returned and if there was evidence of crimes committed in the US. Put them on trial in the US. Otherwise free them. No one, not even criminals should be sent overseas to a death camp of a prison"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Woman, 20, sentenced for false rape report that jailed innocent man for a month",
            "external_url": "https://local12.com/news/nation-world/anjela-borisova-urumova-woman-sentenced-for-false-rape-report-that-jailed-innocent-man-month-sexual-violence-bucks-county-correctional-facility-worst-crimes-criminal-activity-claims-evaluation-falsification-physical-evidence-mental-health-evaluation",
            "upvotes": 13228,
            "date": "04/04/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/737/986/1x0/90/ff255216-5015-45e2-91a8-1ec3cf6cfad2-SuspectFinal.JPG",
            "top_comments": [
                "Feel so bad for this guy, anyone who has tried to get a search result taken off of google knows how impossible it is through their bots. On top of the false charge he will have to explain this surely emotionally draining charge to any employer or future girlfriend",
                "Many years ago (I was around 17) I was accused of assault and rape by a woman I had never met, never seen before. I was arrested and detained and sent to Juvenile Detention. My parents lawyered up, Bailed me out 3 days or so later. It ended when her story kept changing and I had no wounds on my hands or face the night I was booked.  Can go much deeper in to the story but I won’t bore y’all. It was scary. She knew my address, phone number (land line back then) my vehicle, my overall everything. I was at my GF’s house after school, did some day boozing, walked 2 blocks home, and went to bed. Then I was “woken up” about 4 hours later. Lots of people I’ve told the story too have said “I’ve had handled it this way”. But I was woken up from a dead sleep, completely confused, 3 cops screaming at me, my dad freaking out, my mom in hysterics. \n\nThere were no consequences for the accuser. I moved across country for school and that was it. That was around ‘89 or ‘90. Fucking sucked.",
                "I was a victim of a girl who raped me and stalked me.  I avoided her at all costs, and she eventually moved on.  I suspect she had the same sort of relationship with the next guy she started dating - because I know she was very upset with him.  showed up at a bar, and acted all drunk, and brought him out to her car, where she had sex with him.  he went back into the bar and she ran in and said he raped her.  \n\nThe guy was taken away in handcuffs, and couldn't believe what was happening to him.  She eventually came clean, but the damage was done - the dude had mugshots, and was arrested in the middle of a crowded bar.  she didn't get so much as a slap on the wrist.  From what I understand, the guy was just so happy to have the charges dropped against him.  But he should have pressed charges against her for the damage she did to him.  \n\nThis was about 20 years ago that this happened.  and I still worry about how I was just a few months away from being 'the guy' in this story.",
                "I'm actually surprised she went to jail...",
                "I'm sure the 41 year old guy who faced a month in jail with his name and picture plastered over press releases will never face any ongoing discrimination when his name comes up in job searches",
                "I used to be a college professor and told freshmen over and over:  Rape can happen to you; false rape allegations can happen to you. Never put yourself in a vulnerable position.  If you are drinking, go with friends and STAY with friends.\n\nThat isn’t a surefire preventative but it helps.",
                "As a woman - I'm glad to see this.\n\nScumbags like her are a big reason why actual victims aren't believed. Her punishment is way too light, in my opinion, though.",
                "My question is why did it take a month to free him. I went and found the reporting of his original arrest\n\nhttps://www.cbsnews.com/philadelphia/news/daniel-pierson-arrest-attempted-rape-kidnapping-middletown-township-grocery-store-parking-lot/\n\n>\"Pierson is known to police to be a methamphetamine user,\" the release said.\n\nGuess they thought they had to add that in there. Bail was set at somewhere under a million so that is why he was in jail...",
                ">  and pay $3,600 in restitution to the victim.\n\nStraight to civil court for me! I’m asking for no less than $50k, that’s assuming there are no other damages besides my time for a month.",
                "$3,600 in restitution for destroying this man's life?  She should receive the same sentence he would have got if guilty and owe him a hell of a lot more money than that."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Elon Musk's DOGE teams cut critical funding from America's libraries, officials say",
            "external_url": "https://www.cbsnews.com/news/elon-musk-doge-cuts-libraries/",
            "upvotes": 838,
            "date": "04/05/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/04/11f1c4ff-9a5e-4263-9399-e351b94120c7/thumbnail/1200x630/0dfc4742d464fbc09b89b672ffd70123/gettyimages-90748529.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "America made him the richest man in the world.  You'd think he'd be so happy and grateful he'd try to GIVE BACK?\n\nNope.  THIS is how he repays our generosity:\n\nDestroying American Institutions, Chainsawing through our assets and  investments, Terminating those working to keep the government's pact with The People, Threatening those who defy him with prison or illegal rendition.\n\nHe's proud of it.  And with billions in the bank, this compulsive liar and grifter throws bribes at American voters to recruit MORE devils to do his bidding.\n\nMusk is THE most grotesque Potter (\"It's a Wonderful Life\"), whose only friend and family is money, whose only aim in life is replacing our best hopes for America - the source of his wealth - with a dark, evil, dystopian nightmare.",
                "I kind of miss the days when rich people donated to libraries, museums, research, universities, and hospitals in hopes they will be remembered for their contributions to society.",
                "If anyone is wondering why Musk and Friends are targeting schools and libraries so viciously, history holds the answer. Slavery \"officially\" ended in America in 1865, but it continued for decades thanks to loopholes in the form of predatory contracts. African Americans who had been kept illiterate by slavery were tricked into signing contracts with their former masters in which they were sold land in exchange for a percentage of their crops. The contracts were routinely altered, however, to make it impossible to actually pay off that land, creating a cycle of permanent debt slavery. It wasn't until reformers from the North started opening Black schools, and the people became educated, that African Americans were able to read and understand the contracts they were signing, seek legal counsel, find representation in Washington, etc. In other words, slavery doesn't end with an amendment. It ends with education.",
                "So in DOGE’s assessment libraries are waste, fraud or abuse. Libraries!\n\nBasically whichever program they don’t like is deemed to be waste.\n\nIn the past rich people would donate large sums of money for the establishment of institutions of  learning. But now the richest guy in the world is gutting libraries.  And getting off on it. (“Chainsaw!”)",
                "Well that sucks didn't libraries just get to a point of stability to where they werent going to totally dissapear? On another note it makes sense the reps don't want people to have unregulated access to books...",
                "Well, I, for one, am shocked.",
                "Elon just doesn't want those pesky books distracting him from staying on top of the Path of Exile leaderboard.",
                "“ I love the poorly educated”- trump \n\n‘",
                "I live alone and paycheck to paycheck. I don’t have family I can rely on financially, and I earn JUST enough to be disqualified from food stamps, internet subsidies, and most other assistance programs. I even considered asking my employers to pay me less.\n\nThe public library has been a lifeline for me. I get free internet there (hotspot I can take home), access to the graphic design software I use for work, and even borrow kitchen and hardware tools. Unlike many programs, the library doesn’t require you to prove you’re poor — it just helps.\n\nThis is why cutting funding or undermining libraries is not just shortsighted — it’s harmful. The library gave me hope when I had to cancel my internet service. It continues to fill gaps that our safety net leaves behind.\n\nI’m attending a protest today because these “smaller” cuts and policy changes are easy for people to ignore. Part of me fears it’ll take something as big as Social Security or Medicare being touched before people realize what’s at stake.",
                "These people are a disgrace to Washington's vision."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "DACA recipient and Kansas City father of 3 deported to Mexico despite valid documentation",
            "external_url": "https://www.cbsnews.com/news/daca-recipient-kansas-city-father-deported-mexico-despite-valid-documentation/",
            "upvotes": 2931,
            "date": "04/05/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/21/135d73e3-b4d4-4af3-89c8-8922a88d6caf/thumbnail/1200x630/2190c836194bbde9541ee0a89011d5f4/gettyimages-2162517300.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Why taking the time for due process matters.  A lot.",
                "Maga is too stupid to know that you can't unmix the chocolate from the cake.\n\nSo it's just a theater of pain and humiliation for immigrants till \"The Stupidest Generation\" dies out.",
                "The objective was always cruelty.",
                "Can they even do this?",
                "Whatever your feeling on immigration is, it's insane how much DACA recipients' lives have been played with.\n\nApparently people want countries not to send their \"worst.\" Well they were/are the definition of it. They are people who were ready to better their lives thru education.\n\nBoth sides of the team sports have let them down and it has been a travesty. If you're going to invest anything into a goal, why not see the goal thru to the logical end. If you don't, what was the point of wasted resources",
                "Wow. For legal residents to be cautioned against traveling is frightening beyond belief. Pretty soon, passport holding, US born citizens, (like myself ) will be cautioned against speaking or writing comments protected by the US Constitution for fear of being sent to a re-education 'camp'.\n\nIf you think it's funny, would you have believed 5 months ago that things like this would/could happen ?\n\nThe things we hold dear and believe to be natural rights are being burned bit by bit...and it's getting hotter by the second.",
                "immigrants enrich america. if not all you got are dumb red nec…. oh i get it",
                "I see nothing (says Sgt Schultz)",
                "Remember when they said it wasn't a racist thing because he was only going to go after the illegal immigrants?",
                "God I wish I was an attorney. I legit would spend the next 4 years fighting these fucking idiots in court"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Eli Lilly, Novo Stocks Dive After Medicare Excludes Weight-Loss Drugs",
            "external_url": "https://www.investors.com/news/technology/eli-lilly-stock-novo-nordisk-stock-weight-loss-drugs-medicare/",
            "upvotes": 279,
            "date": "04/05/2025",
            "thumbnail": "https://www.investors.com/wp-content/uploads/2020/10/Stock-EliLilly-03-shutt.jpg",
            "top_comments": [
                "Penny rich, pound foolish\n\nThese drugs are cheap compared to cardiac rehab, knee replacements, dialysis, and the things they can reduce.",
                "Wonder how much insider trading surrounded that.",
                "If you stack ranked all of the policies that could actually be helpful to the American people including access to life saving medicine, FEMA, social security, jobs for veterans, inexpensive groceries, clean energy, school lunches, globally competitive education, bank regulations reducing junk fees, mental health services etc… every single one is being thrown aside by a government that makes Stalin look like a good guy…. It is just consummate evil for evil’s sake.",
                "Fat maga got to hate this",
                "The title is a bit misleading, Medicare has always excluded weight loss drugs. \nBiden attempted to change that before leaving office but that's not happening apparently and Medicare will continue excluding them."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Tech megacaps lose $1.8 trillion in 2 days as Trump tariffs lead Nasdaq to worst weekly drop in 5 years",
            "external_url": "https://www.cnbc.com/2025/04/04/technology-stocks-fall-for-a-second-session-led-by-tesla-and-nvidia.html",
            "upvotes": 3498,
            "date": "04/04/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108120393-1742835357354-gettyimages-2206691913-wm100366_kl5aayk2.jpeg?v=1743786921&w=1920&h=1080",
            "top_comments": [
                ">...worst weekly drop in 5 years.\n\nThe worst drop since the last time he was in office.",
                "From the article:\n\n\\- Apple has nosedived the most, shaving off more than $533 billion in market capitalization.\n\n\\- Tesla shaved off more than $89 in market cap, bringing its two-day tally to more than $139 billion\n\n\\- Meta plummeted more than $200 billion\n\n\\- [Amazon](https://www.cnbc.com/quotes/AMZN/) dropped $265 billion\n\n\\- Alphabet:  $139 billion\n\n\\- Microsoft: $165 billion\n\nThat's some unbelievable destruction of wealth!",
                "We are WINNING! THIS IS THE GREATEST WINNING. 🤡",
                "Trump Tax causing the Trump Recession",
                "Headline should say the worst weekly drop since the last time Trump was in office.",
                "Worst drop in 5 years, wasn’t rump the president 5 years ago lmao",
                "You act like they aren't also buying this dip to consolidate and concentrate more wealth away from the masses.",
                "When Biden was in office Faux News pundits all said you can tell how good a job a president is doing by reading the Stock Market. When the market under Biden was doing great Faux News barely covered the story. When Trump was inaugurated the market went up and Faux News said see how great the market is going knowing Trump is president. Now Faux News pundits are saying the market is not a good indicator on how well a president is performing. Also, not one word from Faux News on the rise in unemployment. Hypocrisy and morons are reporting on our countries free fall into the next Great Depression. Will need a new name for all those out of work people who camp out in DC, Hooverville has already been used.",
                "Three Months In $5 Trillion Destroyed.\n\nGo defensive - protect what you have left. The bottom is still ways away.\n\nAnd don't suffer quietly. Keep calling your congressmouse and ask it to do its job.",
                "Small price to pay to \"own the libs\"\n\nWhoever voted for this administration can hurt and hurt and continue hurting."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Comedian Russell Brand charged with rape",
            "external_url": "https://www.bbc.co.uk/news/articles/c0457d02e9go",
            "upvotes": 18961,
            "date": "04/04/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8110/live/58dc9480-1167-11f0-ba12-8d27eb561761.jpg",
            "top_comments": [
                "This is the least surprising news story I've seen all week.",
                "It's always the ones you most suspect",
                "Yeah that's why he became super Christian all of a sudden. He knew this was coming",
                "Some people say the worst part was the hypocrisy.\n\n\nI think it was the rape.\n\n\n/To paraphrase a real comedian ",
                "The Onion just reposted this[https://theonion.com/nation-could-have-sworn-russell-brand-was-already-convi-1850849838/](https://theonion.com/nation-could-have-sworn-russell-brand-was-already-convi-1850849838/)",
                "I read this headline and thought it was old news, honestly.\n\nWhen he started freaking out about woke people after MeToo I knew something was up with the dude",
                "Well I see someone wants to join the Trump administration",
                "Rapist Russell Brand charged with trying to be comedian",
                "Insane he made it to 2025. Him making it through the me too era is like getting an rpg past TSA in your backpack",
                "Get Him to the Greek stared Russel Brand, P Diddy and Jonah Hill."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "HOT",
            "title": "Supreme Court allows Trump to freeze dozens of teacher training grants",
            "external_url": "https://www.cnn.com/2025/04/04/politics/supreme-court-trump-teacher-grants/index.html",
            "upvotes": 3196,
            "date": "04/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2205531023.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If Congress no longer controls the power of the purse, what is their Constitutional reason to even exist?",
                "You think this is bad? Just wait until they rule he can rewrite the Constitution via Executive Order.",
                "There was no textual authority for President Trump to freeze these grants. There was textual authority for President Biden to forgive student loans. But textualism only matters when it leads to the outcome this activist Court wants.",
                "Education is the enemy of authoritarianism.\n\nProve me wrong.\n\nWhat’s one of the first groups fascists and authoritarians always go after? The educated. The intelligentsia.\n\nDictators love their people dumb and emotionally-led. Easier to control, easier to manipulate.",
                "Split 5-4 decision with Roberts siding with the liberal justices.",
                "No need for them . Education department is being dismantled so no more need for teachers !",
                ">But, the court said, the Trump administration made a compelling case that it would not be able to recover any funds spent while the lower court’s order remained in place.\n\n>If the states ultimately win the case, the court said, “they can recover any wrongfully withheld funds through” further litigation.\n\nIf they bothered to explain why the states can sue to get their money but the feds *can’t,* it is not in the article.",
                "Man I got my teaching license through one of these programs. It’s pretty prohibitive to be certified in my state (you have to have a Masters degree in education). I worked in one of the poorest districts in the country for 7 years (I’m in a different district now). I felt a lot of loyalty to the school system, because they invested a lot of money into me. Even more important, these programs allow people to enter the field that might have been blocked by the economic fetters towards becoming certified, like say people of color. Which is probably why Trump wants to end them. They also cycle teachers into certifications that are hard to fill like special education and English as a New Language. I NEVER would have become a special education teacher had I not kind of had to become one. And I love special education. And god the ENL teacher shortage is already really, really, really bad.",
                "So wait, help me understand, I might be stupid. The purpose of the tariffs is to bring back manufacturing to America, which will take years. During those years, some would think it would be wise to educate & train up the future generations, correct? Based on this & the events of the past ::checks notes:: not even 3 months yet, future generations will be dumber than rocks. How are we supposed to manufacture anything?",
                "Yes, because one thing we have way too many of is teachers. /S"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "USA Fencing disqualifies athlete for refusing to compete against transgender woman",
            "external_url": "https://abcnews.go.com/US/usa-fencing-disqualifies-stephanie-turner-refusing-fence-transgender/story?id=120462854",
            "upvotes": 14114,
            "date": "04/04/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1ec66efa-8d15-4e68-bb23-e0a4ce5dfad3/fencer-gty-er-250403_1743708715102_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Perhaps not in an actual competition, but fencing is often coed… I’ve definitely fenced against as many women as I have men. There isn’t some radical sex based advantage in fencing the way you might argue there is in many other supports, so this is totally ridiculous.",
                "So this is what the distraction is gonna be while the economy collapses, people are pulled off the streets by masked police and flown off without trial, and our allies abandon us? This is the important shit right here, huh?",
                "> Prior to 1990, separate men’s championships were held, but since then, fencing has been a coed sport with teams having men’s and women’s squads, although some schools field only a women’s team. Fencing is a single-division sport with schools from all three NCAA divisions competing against each other.\n\nHere’s some facts for all the morons talking about the “biological advantage” men have in fencing. It’s been a coed sport at the national competition level for nearly FOURTY YEARS. This is nothing but more conservative performative outrage, and your excuses is what encourage this kind of behavior.",
                "If all fails throw in a bit of trans panic so MAGA has something to be outraged about",
                "I’m sure the comments and discourse will be very positive",
                "Journalists suck.\n\nThis article should have at a minimum explained USA fencing's policy [outlined here](https://www.usafencing.org/transgender-and-nonbinary-policy). They couldn't be bothered to even look up what the policy was apparently, or provide information around why USA fencing felt that policy was actually ok.\n\nThis article comes across as, \"Hey I'm some dude and I want to poke women with my sword.\" Not, \"I identify as a woman and I've been on HRT for 12 months and because of that have lost most of my muscle tone.\" I'd even think it was great if they explained the counterpoint as well which is that most of the physical advantage of men comes from their height which is something they gain in puberty.\n\nI know this is a challenging topic for a lot of people, but holy fuck mainstream journalism is garbage.\n\n  \nedit: This is not an endorsement of alt-media (which is nothing but a sewage plant). It's a plea for journalists to do better.",
                "I'm still on the fence about the whole thing.",
                "Name one professional fencer off the top of your head.",
                "Look, I'd like to care about the stock market, having a house, people being disappeared, but this lady didn't get to fence who she wanted!!  This is truly the crisis of our time.",
                "All these folks so worried about women's (and girl's) sports don't seem too concerned that the Department of Education is being dismantled and that the DOE oversees compliance for Title IX.  Pre-Title IX --1 in 27 girls participated in sports, now it's is 2 in 5.  If you really do care about \"protecting\" opportunities for girls and women in sports, Title IX would be your focus.  NOTE, the same pols so obsessed with trans women in sports are the same ones who'd eliminate Title IX in a heartbeat. \n\n[https://www.womenssportsfoundation.org/wp-content/uploads/2022/04/FINAL6\\_WSF-Title-IX-Infographic-2022.pdf](https://www.womenssportsfoundation.org/wp-content/uploads/2022/04/FINAL6_WSF-Title-IX-Infographic-2022.pdf)"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Trans student’s arrest for violating Florida bathroom law is thought to be a first",
            "external_url": "https://www.nbcnews.com/nbc-out/out-news/trans-students-arrest-violating-florida-bathroom-law-thought-first-rcna199697",
            "upvotes": 42,
            "date": "04/05/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250404-Marcy-Rheintgen-mb-1502-a7e4b7.jpg",
            "top_comments": [
                "Utter madness that such a law could even exist.",
                "US actually ARREST people for this?  \n\nWhat a country.",
                "This is the problem with Florida? Not the children and mental ill people being executed still in 2025",
                "Fuck you, Florida. JFC, leave people in the bathroom alone.",
                "Transgender bathroom bans do absolutely nothing to help others. Their only purpose is to harm Transgender people.\n\nIf you don't stand up for the rights of LGBTQ+ Americans, what makes you think there will be anyone to stand up for your rights when someone decides you should be oppressed?",
                "He’s gonna have fun in jail if the max sentence gets carried out."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Evidence of ‘execution-style’ killings of Palestinian aid workers by Israeli forces, doctor says",
            "external_url": "https://www.theguardian.com/world/2025/apr/02/evidence-execution-style-killings-palestinian-workers-israeli-forces-doctor-says",
            "upvotes": 67,
            "date": "04/05/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e2d61f0824dfd9080650cb43ffccda394fd9e8ac/0_152_3497_2100/master/3497.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2361b08abee61a26a943f842db821052",
            "top_comments": [
                "To the surprise of no one",
                "I'm not going to say anything bad about Zionism because last time saying that it's a toxic ideology that dehumanizes people and justifies murder, earned me a 3-day ban. Apparently saying the obvious isn't allowed. I guess we don't get to express our distaste for genocide or murder without it being labeled as hate."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Eli Lilly, Novo Stocks Dive After Medicare Excludes Weight-Loss Drugs",
            "external_url": "https://www.investors.com/news/technology/eli-lilly-stock-novo-nordisk-stock-weight-loss-drugs-medicare/",
            "upvotes": 278,
            "date": "04/05/2025",
            "thumbnail": "https://www.investors.com/wp-content/uploads/2020/10/Stock-EliLilly-03-shutt.jpg",
            "top_comments": [
                "Penny rich, pound foolish\n\nThese drugs are cheap compared to cardiac rehab, knee replacements, dialysis, and the things they can reduce.",
                "Wonder how much insider trading surrounded that.",
                "If you stack ranked all of the policies that could actually be helpful to the American people including access to life saving medicine, FEMA, social security, jobs for veterans, inexpensive groceries, clean energy, school lunches, globally competitive education, bank regulations reducing junk fees, mental health services etc… every single one is being thrown aside by a government that makes Stalin look like a good guy…. It is just consummate evil for evil’s sake.",
                "Fat maga got to hate this",
                "The title is a bit misleading, Medicare has always excluded weight loss drugs. \nBiden attempted to change that before leaving office but that's not happening apparently and Medicare will continue excluding them."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Elon Musk's DOGE teams cut critical funding from America's libraries, officials say",
            "external_url": "https://www.cbsnews.com/news/elon-musk-doge-cuts-libraries/",
            "upvotes": 836,
            "date": "04/05/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/04/11f1c4ff-9a5e-4263-9399-e351b94120c7/thumbnail/1200x630/0dfc4742d464fbc09b89b672ffd70123/gettyimages-90748529.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "America made him the richest man in the world.  You'd think he'd be so happy and grateful he'd try to GIVE BACK?\n\nNope.  THIS is how he repays our generosity:\n\nDestroying American Institutions, Chainsawing through our assets and  investments, Terminating those working to keep the government's pact with The People, Threatening those who defy him with prison or illegal rendition.\n\nHe's proud of it.  And with billions in the bank, this compulsive liar and grifter throws bribes at American voters to recruit MORE devils to do his bidding.\n\nMusk is THE most grotesque Potter (\"It's a Wonderful Life\"), whose only friend and family is money, whose only aim in life is replacing our best hopes for America - the source of his wealth - with a dark, evil, dystopian nightmare.",
                "I kind of miss the days when rich people donated to libraries, museums, research, universities, and hospitals in hopes they will be remembered for their contributions to society.",
                "If anyone is wondering why Musk and Friends are targeting schools and libraries so viciously, history holds the answer. Slavery \"officially\" ended in America in 1865, but it continued for decades thanks to loopholes in the form of predatory contracts. African Americans who had been kept illiterate by slavery were tricked into signing contracts with their former masters in which they were sold land in exchange for a percentage of their crops. The contracts were routinely altered, however, to make it impossible to actually pay off that land, creating a cycle of permanent debt slavery. It wasn't until reformers from the North started opening Black schools, and the people became educated, that African Americans were able to read and understand the contracts they were signing, seek legal counsel, find representation in Washington, etc. In other words, slavery doesn't end with an amendment. It ends with education.",
                "So in DOGE’s assessment libraries are waste, fraud or abuse. Libraries!\n\nBasically whichever program they don’t like is deemed to be waste.\n\nIn the past rich people would donate large sums of money for the establishment of institutions of  learning. But now the richest guy in the world is gutting libraries.  And getting off on it. (“Chainsaw!”)",
                "Well that sucks didn't libraries just get to a point of stability to where they werent going to totally dissapear? On another note it makes sense the reps don't want people to have unregulated access to books...",
                "Well, I, for one, am shocked.",
                "Elon just doesn't want those pesky books distracting him from staying on top of the Path of Exile leaderboard.",
                "“ I love the poorly educated”- trump \n\n‘",
                "I live alone and paycheck to paycheck. I don’t have family I can rely on financially, and I earn JUST enough to be disqualified from food stamps, internet subsidies, and most other assistance programs. I even considered asking my employers to pay me less.\n\nThe public library has been a lifeline for me. I get free internet there (hotspot I can take home), access to the graphic design software I use for work, and even borrow kitchen and hardware tools. Unlike many programs, the library doesn’t require you to prove you’re poor — it just helps.\n\nThis is why cutting funding or undermining libraries is not just shortsighted — it’s harmful. The library gave me hope when I had to cancel my internet service. It continues to fill gaps that our safety net leaves behind.\n\nI’m attending a protest today because these “smaller” cuts and policy changes are easy for people to ignore. Part of me fears it’ll take something as big as Social Security or Medicare being touched before people realize what’s at stake.",
                "These people are a disgrace to Washington's vision."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "DACA recipient and Kansas City father of 3 deported to Mexico despite valid documentation",
            "external_url": "https://www.cbsnews.com/news/daca-recipient-kansas-city-father-deported-mexico-despite-valid-documentation/",
            "upvotes": 2928,
            "date": "04/05/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/21/135d73e3-b4d4-4af3-89c8-8922a88d6caf/thumbnail/1200x630/2190c836194bbde9541ee0a89011d5f4/gettyimages-2162517300.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Why taking the time for due process matters.  A lot.",
                "Maga is too stupid to know that you can't unmix the chocolate from the cake.\n\nSo it's just a theater of pain and humiliation for immigrants till \"The Stupidest Generation\" dies out.",
                "The objective was always cruelty.",
                "Can they even do this?",
                "Whatever your feeling on immigration is, it's insane how much DACA recipients' lives have been played with.\n\nApparently people want countries not to send their \"worst.\" Well they were/are the definition of it. They are people who were ready to better their lives thru education.\n\nBoth sides of the team sports have let them down and it has been a travesty. If you're going to invest anything into a goal, why not see the goal thru to the logical end. If you don't, what was the point of wasted resources",
                "Wow. For legal residents to be cautioned against traveling is frightening beyond belief. Pretty soon, passport holding, US born citizens, (like myself ) will be cautioned against speaking or writing comments protected by the US Constitution for fear of being sent to a re-education 'camp'.\n\nIf you think it's funny, would you have believed 5 months ago that things like this would/could happen ?\n\nThe things we hold dear and believe to be natural rights are being burned bit by bit...and it's getting hotter by the second.",
                "immigrants enrich america. if not all you got are dumb red nec…. oh i get it",
                "I see nothing (says Sgt Schultz)",
                "Remember when they said it wasn't a racist thing because he was only going to go after the illegal immigrants?",
                "God I wish I was an attorney. I legit would spend the next 4 years fighting these fucking idiots in court"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Disgraced former Cardinal Theodore McCarrick has died at age 94",
            "external_url": "https://www.nbcnews.com/news/us-news/disgraced-former-cardinal-theodore-mccarrick-dead-rcna199779",
            "upvotes": 465,
            "date": "04/04/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250404-Theodore-McCarrick-ew-351p-285335.jpg",
            "top_comments": [
                "Guess the pedo is finding out if Hell exists. 👹🔱🔥",
                "🙏 start a trend start a trend",
                "Drive a stake through his heart, just to be sure.",
                "Doesn't sound like he died in prison?",
                "It's true:  Only the good die young.",
                "Good riddance. It’s times like this that I hope the hell he supposedly believed in actually exists.",
                "*Shitbag finally succumbs",
                "And the world was just a little bit better",
                "“Disgraced” is what they’re calling a serial rapists in headlines now?",
                "He was left on Earth for so long because the Devil didn’t want him either."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Tech megacaps lose $1.8 trillion in 2 days as Trump tariffs lead Nasdaq to worst weekly drop in 5 years",
            "external_url": "https://www.cnbc.com/2025/04/04/technology-stocks-fall-for-a-second-session-led-by-tesla-and-nvidia.html",
            "upvotes": 3494,
            "date": "04/04/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108120393-1742835357354-gettyimages-2206691913-wm100366_kl5aayk2.jpeg?v=1743786921&w=1920&h=1080",
            "top_comments": [
                ">...worst weekly drop in 5 years.\n\nThe worst drop since the last time he was in office.",
                "From the article:\n\n\\- Apple has nosedived the most, shaving off more than $533 billion in market capitalization.\n\n\\- Tesla shaved off more than $89 in market cap, bringing its two-day tally to more than $139 billion\n\n\\- Meta plummeted more than $200 billion\n\n\\- [Amazon](https://www.cnbc.com/quotes/AMZN/) dropped $265 billion\n\n\\- Alphabet:  $139 billion\n\n\\- Microsoft: $165 billion\n\nThat's some unbelievable destruction of wealth!",
                "We are WINNING! THIS IS THE GREATEST WINNING. 🤡",
                "Trump Tax causing the Trump Recession",
                "Headline should say the worst weekly drop since the last time Trump was in office.",
                "Worst drop in 5 years, wasn’t rump the president 5 years ago lmao",
                "You act like they aren't also buying this dip to consolidate and concentrate more wealth away from the masses.",
                "When Biden was in office Faux News pundits all said you can tell how good a job a president is doing by reading the Stock Market. When the market under Biden was doing great Faux News barely covered the story. When Trump was inaugurated the market went up and Faux News said see how great the market is going knowing Trump is president. Now Faux News pundits are saying the market is not a good indicator on how well a president is performing. Also, not one word from Faux News on the rise in unemployment. Hypocrisy and morons are reporting on our countries free fall into the next Great Depression. Will need a new name for all those out of work people who camp out in DC, Hooverville has already been used.",
                "Three Months In $5 Trillion Destroyed.\n\nGo defensive - protect what you have left. The bottom is still ways away.\n\nAnd don't suffer quietly. Keep calling your congressmouse and ask it to do its job.",
                "Small price to pay to \"own the libs\"\n\nWhoever voted for this administration can hurt and hurt and continue hurting."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Supreme Court allows Trump to freeze dozens of teacher training grants",
            "external_url": "https://www.cnn.com/2025/04/04/politics/supreme-court-trump-teacher-grants/index.html",
            "upvotes": 3197,
            "date": "04/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2205531023.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If Congress no longer controls the power of the purse, what is their Constitutional reason to even exist?",
                "You think this is bad? Just wait until they rule he can rewrite the Constitution via Executive Order.",
                "There was no textual authority for President Trump to freeze these grants. There was textual authority for President Biden to forgive student loans. But textualism only matters when it leads to the outcome this activist Court wants.",
                "Education is the enemy of authoritarianism.\n\nProve me wrong.\n\nWhat’s one of the first groups fascists and authoritarians always go after? The educated. The intelligentsia.\n\nDictators love their people dumb and emotionally-led. Easier to control, easier to manipulate.",
                "Split 5-4 decision with Roberts siding with the liberal justices.",
                "No need for them . Education department is being dismantled so no more need for teachers !",
                ">But, the court said, the Trump administration made a compelling case that it would not be able to recover any funds spent while the lower court’s order remained in place.\n\n>If the states ultimately win the case, the court said, “they can recover any wrongfully withheld funds through” further litigation.\n\nIf they bothered to explain why the states can sue to get their money but the feds *can’t,* it is not in the article.",
                "Man I got my teaching license through one of these programs. It’s pretty prohibitive to be certified in my state (you have to have a Masters degree in education). I worked in one of the poorest districts in the country for 7 years (I’m in a different district now). I felt a lot of loyalty to the school system, because they invested a lot of money into me. Even more important, these programs allow people to enter the field that might have been blocked by the economic fetters towards becoming certified, like say people of color. Which is probably why Trump wants to end them. They also cycle teachers into certifications that are hard to fill like special education and English as a New Language. I NEVER would have become a special education teacher had I not kind of had to become one. And I love special education. And god the ENL teacher shortage is already really, really, really bad.",
                "So wait, help me understand, I might be stupid. The purpose of the tariffs is to bring back manufacturing to America, which will take years. During those years, some would think it would be wise to educate & train up the future generations, correct? Based on this & the events of the past ::checks notes:: not even 3 months yet, future generations will be dumber than rocks. How are we supposed to manufacture anything?",
                "Yes, because one thing we have way too many of is teachers. /S"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "U.S. Peace Corps says Musk's DOGE has arrived at its HQ",
            "external_url": "https://www.reuters.com/world/us/us-peace-corps-says-musks-cost-cutting-team-has-arrived-its-hq-2025-04-04/",
            "upvotes": 13350,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This administration is amplifying everything people dislike about the US while simultaneously destroying everything people do like about the US.",
                "So, what exactly happens if an agency simply doesn’t cooperate with DOGE?",
                "I can't imagine an agency with less fat than the Peace Corps; the stipends are miniscule.",
                "That is easily the dumbest hat I've seen in quite a while and we've all seen a LOT of MAGA hats.",
                "The Musk/Trump administration doesn't understand the concept of 'soft power'. Furthermore, they're entirely unwilling to listen to the argument for it. America's greatness (such that it ever existed) comes in large part to it's effective use of soft power. The Marshall Plan, the Peace Corps and NASA all have a roll in advancing America's interest abroad. Dollar-for-dollar these programs grew the brand of America more than it's military or direct diplomacy ever could on its own. Wait two years to see.",
                "The grim reaper has arrived. Aside from Trump , Netanyahu and Putin,  Elon is the most unpopular person in the world today.",
                "It's painfully obvious that the whole administration has bought into some absolute bullshit lie from Elon Musk about his, garbage tier, Grok AI being ready to take over most of the federal government's functions. Elon is a great con man when dealing with people who understand tech. When he starts selling shit to the types of people in the Trump admin it is like shooting fish in a barrel. This whole experiment is going to destroy the US standing in the world, it's economy, and the US tech industry. We are getting Xed at a national scale. If you voted for this you are an absolute fucking dipshit.",
                "Have you noticed that DOGE does the worst things on Friday afternoons? DOGE fears accountability",
                "You have to be truly evil and dead inside to dismantle the Peace Corps. There’s a special place in hell reserved for Elon Musk.",
                "It’s like the bureaucracy version of the fucking mongols arriving at your city gates"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Woman, 20, sentenced for false rape report that jailed innocent man for a month",
            "external_url": "https://local12.com/news/nation-world/anjela-borisova-urumova-woman-sentenced-for-false-rape-report-that-jailed-innocent-man-month-sexual-violence-bucks-county-correctional-facility-worst-crimes-criminal-activity-claims-evaluation-falsification-physical-evidence-mental-health-evaluation",
            "upvotes": 13220,
            "date": "04/04/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/737/986/1x0/90/ff255216-5015-45e2-91a8-1ec3cf6cfad2-SuspectFinal.JPG",
            "top_comments": [
                "Feel so bad for this guy, anyone who has tried to get a search result taken off of google knows how impossible it is through their bots. On top of the false charge he will have to explain this surely emotionally draining charge to any employer or future girlfriend",
                "Many years ago (I was around 17) I was accused of assault and rape by a woman I had never met, never seen before. I was arrested and detained and sent to Juvenile Detention. My parents lawyered up, Bailed me out 3 days or so later. It ended when her story kept changing and I had no wounds on my hands or face the night I was booked.  Can go much deeper in to the story but I won’t bore y’all. It was scary. She knew my address, phone number (land line back then) my vehicle, my overall everything. I was at my GF’s house after school, did some day boozing, walked 2 blocks home, and went to bed. Then I was “woken up” about 4 hours later. Lots of people I’ve told the story too have said “I’ve had handled it this way”. But I was woken up from a dead sleep, completely confused, 3 cops screaming at me, my dad freaking out, my mom in hysterics. \n\nThere were no consequences for the accuser. I moved across country for school and that was it. That was around ‘89 or ‘90. Fucking sucked.",
                "I was a victim of a girl who raped me and stalked me.  I avoided her at all costs, and she eventually moved on.  I suspect she had the same sort of relationship with the next guy she started dating - because I know she was very upset with him.  showed up at a bar, and acted all drunk, and brought him out to her car, where she had sex with him.  he went back into the bar and she ran in and said he raped her.  \n\nThe guy was taken away in handcuffs, and couldn't believe what was happening to him.  She eventually came clean, but the damage was done - the dude had mugshots, and was arrested in the middle of a crowded bar.  she didn't get so much as a slap on the wrist.  From what I understand, the guy was just so happy to have the charges dropped against him.  But he should have pressed charges against her for the damage she did to him.  \n\nThis was about 20 years ago that this happened.  and I still worry about how I was just a few months away from being 'the guy' in this story.",
                "I'm actually surprised she went to jail...",
                "I'm sure the 41 year old guy who faced a month in jail with his name and picture plastered over press releases will never face any ongoing discrimination when his name comes up in job searches",
                "I used to be a college professor and told freshmen over and over:  Rape can happen to you; false rape allegations can happen to you. Never put yourself in a vulnerable position.  If you are drinking, go with friends and STAY with friends.\n\nThat isn’t a surefire preventative but it helps.",
                "As a woman - I'm glad to see this.\n\nScumbags like her are a big reason why actual victims aren't believed. Her punishment is way too light, in my opinion, though.",
                "My question is why did it take a month to free him. I went and found the reporting of his original arrest\n\nhttps://www.cbsnews.com/philadelphia/news/daniel-pierson-arrest-attempted-rape-kidnapping-middletown-township-grocery-store-parking-lot/\n\n>\"Pierson is known to police to be a methamphetamine user,\" the release said.\n\nGuess they thought they had to add that in there. Bail was set at somewhere under a million so that is why he was in jail...",
                ">  and pay $3,600 in restitution to the victim.\n\nStraight to civil court for me! I’m asking for no less than $50k, that’s assuming there are no other damages besides my time for a month.",
                "$3,600 in restitution for destroying this man's life?  She should receive the same sentence he would have got if guilty and owe him a hell of a lot more money than that."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk's DOGE teams cut critical funding from America's libraries, officials say",
            "external_url": "https://www.cbsnews.com/news/elon-musk-doge-cuts-libraries/",
            "upvotes": 837,
            "date": "04/05/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/04/11f1c4ff-9a5e-4263-9399-e351b94120c7/thumbnail/1200x630/0dfc4742d464fbc09b89b672ffd70123/gettyimages-90748529.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "America made him the richest man in the world.  You'd think he'd be so happy and grateful he'd try to GIVE BACK?\n\nNope.  THIS is how he repays our generosity:\n\nDestroying American Institutions, Chainsawing through our assets and  investments, Terminating those working to keep the government's pact with The People, Threatening those who defy him with prison or illegal rendition.\n\nHe's proud of it.  And with billions in the bank, this compulsive liar and grifter throws bribes at American voters to recruit MORE devils to do his bidding.\n\nMusk is THE most grotesque Potter (\"It's a Wonderful Life\"), whose only friend and family is money, whose only aim in life is replacing our best hopes for America - the source of his wealth - with a dark, evil, dystopian nightmare.",
                "I kind of miss the days when rich people donated to libraries, museums, research, universities, and hospitals in hopes they will be remembered for their contributions to society.",
                "If anyone is wondering why Musk and Friends are targeting schools and libraries so viciously, history holds the answer. Slavery \"officially\" ended in America in 1865, but it continued for decades thanks to loopholes in the form of predatory contracts. African Americans who had been kept illiterate by slavery were tricked into signing contracts with their former masters in which they were sold land in exchange for a percentage of their crops. The contracts were routinely altered, however, to make it impossible to actually pay off that land, creating a cycle of permanent debt slavery. It wasn't until reformers from the North started opening Black schools, and the people became educated, that African Americans were able to read and understand the contracts they were signing, seek legal counsel, find representation in Washington, etc. In other words, slavery doesn't end with an amendment. It ends with education.",
                "So in DOGE’s assessment libraries are waste, fraud or abuse. Libraries!\n\nBasically whichever program they don’t like is deemed to be waste.\n\nIn the past rich people would donate large sums of money for the establishment of institutions of  learning. But now the richest guy in the world is gutting libraries.  And getting off on it. (“Chainsaw!”)",
                "Well that sucks didn't libraries just get to a point of stability to where they werent going to totally dissapear? On another note it makes sense the reps don't want people to have unregulated access to books...",
                "Well, I, for one, am shocked.",
                "Elon just doesn't want those pesky books distracting him from staying on top of the Path of Exile leaderboard.",
                "“ I love the poorly educated”- trump \n\n‘",
                "I live alone and paycheck to paycheck. I don’t have family I can rely on financially, and I earn JUST enough to be disqualified from food stamps, internet subsidies, and most other assistance programs. I even considered asking my employers to pay me less.\n\nThe public library has been a lifeline for me. I get free internet there (hotspot I can take home), access to the graphic design software I use for work, and even borrow kitchen and hardware tools. Unlike many programs, the library doesn’t require you to prove you’re poor — it just helps.\n\nThis is why cutting funding or undermining libraries is not just shortsighted — it’s harmful. The library gave me hope when I had to cancel my internet service. It continues to fill gaps that our safety net leaves behind.\n\nI’m attending a protest today because these “smaller” cuts and policy changes are easy for people to ignore. Part of me fears it’ll take something as big as Social Security or Medicare being touched before people realize what’s at stake.",
                "These people are a disgrace to Washington's vision."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Eli Lilly, Novo Stocks Dive After Medicare Excludes Weight-Loss Drugs",
            "external_url": "https://www.investors.com/news/technology/eli-lilly-stock-novo-nordisk-stock-weight-loss-drugs-medicare/",
            "upvotes": 280,
            "date": "04/05/2025",
            "thumbnail": "https://www.investors.com/wp-content/uploads/2020/10/Stock-EliLilly-03-shutt.jpg",
            "top_comments": [
                "Penny rich, pound foolish\n\nThese drugs are cheap compared to cardiac rehab, knee replacements, dialysis, and the things they can reduce.",
                "Wonder how much insider trading surrounded that.",
                "If you stack ranked all of the policies that could actually be helpful to the American people including access to life saving medicine, FEMA, social security, jobs for veterans, inexpensive groceries, clean energy, school lunches, globally competitive education, bank regulations reducing junk fees, mental health services etc… every single one is being thrown aside by a government that makes Stalin look like a good guy…. It is just consummate evil for evil’s sake.",
                "Fat maga got to hate this",
                "The title is a bit misleading, Medicare has always excluded weight loss drugs. \nBiden attempted to change that before leaving office but that's not happening apparently and Medicare will continue excluding them."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "U.S. Peace Corps says Musk's DOGE has arrived at its HQ",
            "external_url": "https://www.reuters.com/world/us/us-peace-corps-says-musks-cost-cutting-team-has-arrived-its-hq-2025-04-04/",
            "upvotes": 13363,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This administration is amplifying everything people dislike about the US while simultaneously destroying everything people do like about the US.",
                "So, what exactly happens if an agency simply doesn’t cooperate with DOGE?",
                "I can't imagine an agency with less fat than the Peace Corps; the stipends are miniscule.",
                "That is easily the dumbest hat I've seen in quite a while and we've all seen a LOT of MAGA hats.",
                "The Musk/Trump administration doesn't understand the concept of 'soft power'. Furthermore, they're entirely unwilling to listen to the argument for it. America's greatness (such that it ever existed) comes in large part to it's effective use of soft power. The Marshall Plan, the Peace Corps and NASA all have a roll in advancing America's interest abroad. Dollar-for-dollar these programs grew the brand of America more than it's military or direct diplomacy ever could on its own. Wait two years to see.",
                "The grim reaper has arrived. Aside from Trump , Netanyahu and Putin,  Elon is the most unpopular person in the world today.",
                "It's painfully obvious that the whole administration has bought into some absolute bullshit lie from Elon Musk about his, garbage tier, Grok AI being ready to take over most of the federal government's functions. Elon is a great con man when dealing with people who understand tech. When he starts selling shit to the types of people in the Trump admin it is like shooting fish in a barrel. This whole experiment is going to destroy the US standing in the world, it's economy, and the US tech industry. We are getting Xed at a national scale. If you voted for this you are an absolute fucking dipshit.",
                "Have you noticed that DOGE does the worst things on Friday afternoons? DOGE fears accountability",
                "You have to be truly evil and dead inside to dismantle the Peace Corps. There’s a special place in hell reserved for Elon Musk.",
                "It’s like the bureaucracy version of the fucking mongols arriving at your city gates"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Federal judge rules return of Maryland man mistakenly deported to El Salvador prison",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/04/maryland-deported-el-salvador-kilmar-abrego-garcia",
            "upvotes": 26646,
            "date": "04/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/c20b3ba9e18add1958ec77d0ca363335b3355628/0_100_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=07a4e4739e53960824a55ef20b2d1e0b",
            "top_comments": [
                "if we lived in a sane country, he and his family would be able to sue for tens of millions. the entire saga is fucking ridiculous. \n\n\"we know we fucked up, but it would be against our shit plan to undo it so cope ig\"",
                "It's not over till he's home.",
                "an innocent man just can be held in jail?  What kind of crazy idea is that ... oh due process?  human rights?...huh I am pretty sure the Republican party gave those up",
                "Interesting how the Trump admin indicates it can do nothing about retrieving this man from El Salvador with whom it has very friendly relations, yet it was able to get Mexico to bring back the 2 Caucasian people who were in jail for defrauding a timeshare company in Mexico after 2 weeks of negotiating (as they were apparently guilty of the fraud).\n\nSo all that is really at play here is that the Trump admin does not want to bring this person back, because they are not white.  It is as simple as that.",
                "The truth is this Nazi admin doesn't want this man back because he'll be able to speak on how terrible and inhumane the treatment is at this death camp. They could get him back no problem, its that it would not bode well for them if they did.",
                "Republicans would call this judicial overreach",
                "And for every story like this we see, you just *know* there's a hundred cataclysmic fuck-ups that we're not seeing. \n\nLast time this ape was in charge his equivocating gibberish and asinine policies exacerbated a deadly pandemic [leading to many, many unnecessary COVID deaths] (https://www.businessinsider.com/analysis-trump-covid-19-response-40-percent-us-deaths-avoidable-2021-2?op=1) and [dead Americans in general](https://www.forbes.com/sites/tommybeer/2021/02/11/trumps-policies-resulted-in-the-unnecessary-deaths-of-hundreds-of-thousands-of-americans-lancet-report/) but none of this ever gets brought up and he surely sleeps like a baby.\n\nI shudder to think of what we don't know.",
                "How sad that it had to go to a judge and they refused to correct their tragic mistake in the first place.",
                "I hope he's returned swiftly and safely, but I doubt part of disappearing people is keeping track of where they wind up at the other end. I've never worked as a human trafficker, so idk.",
                "They should all be returned and if there was evidence of crimes committed in the US. Put them on trial in the US. Otherwise free them. No one, not even criminals should be sent overseas to a death camp of a prison"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Woman, 20, sentenced for false rape report that jailed innocent man for a month",
            "external_url": "https://local12.com/news/nation-world/anjela-borisova-urumova-woman-sentenced-for-false-rape-report-that-jailed-innocent-man-month-sexual-violence-bucks-county-correctional-facility-worst-crimes-criminal-activity-claims-evaluation-falsification-physical-evidence-mental-health-evaluation",
            "upvotes": 13229,
            "date": "04/04/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/737/986/1x0/90/ff255216-5015-45e2-91a8-1ec3cf6cfad2-SuspectFinal.JPG",
            "top_comments": [
                "Feel so bad for this guy, anyone who has tried to get a search result taken off of google knows how impossible it is through their bots. On top of the false charge he will have to explain this surely emotionally draining charge to any employer or future girlfriend",
                "Many years ago (I was around 17) I was accused of assault and rape by a woman I had never met, never seen before. I was arrested and detained and sent to Juvenile Detention. My parents lawyered up, Bailed me out 3 days or so later. It ended when her story kept changing and I had no wounds on my hands or face the night I was booked.  Can go much deeper in to the story but I won’t bore y’all. It was scary. She knew my address, phone number (land line back then) my vehicle, my overall everything. I was at my GF’s house after school, did some day boozing, walked 2 blocks home, and went to bed. Then I was “woken up” about 4 hours later. Lots of people I’ve told the story too have said “I’ve had handled it this way”. But I was woken up from a dead sleep, completely confused, 3 cops screaming at me, my dad freaking out, my mom in hysterics. \n\nThere were no consequences for the accuser. I moved across country for school and that was it. That was around ‘89 or ‘90. Fucking sucked.",
                "I was a victim of a girl who raped me and stalked me.  I avoided her at all costs, and she eventually moved on.  I suspect she had the same sort of relationship with the next guy she started dating - because I know she was very upset with him.  showed up at a bar, and acted all drunk, and brought him out to her car, where she had sex with him.  he went back into the bar and she ran in and said he raped her.  \n\nThe guy was taken away in handcuffs, and couldn't believe what was happening to him.  She eventually came clean, but the damage was done - the dude had mugshots, and was arrested in the middle of a crowded bar.  she didn't get so much as a slap on the wrist.  From what I understand, the guy was just so happy to have the charges dropped against him.  But he should have pressed charges against her for the damage she did to him.  \n\nThis was about 20 years ago that this happened.  and I still worry about how I was just a few months away from being 'the guy' in this story.",
                "I'm actually surprised she went to jail...",
                "I'm sure the 41 year old guy who faced a month in jail with his name and picture plastered over press releases will never face any ongoing discrimination when his name comes up in job searches",
                "I used to be a college professor and told freshmen over and over:  Rape can happen to you; false rape allegations can happen to you. Never put yourself in a vulnerable position.  If you are drinking, go with friends and STAY with friends.\n\nThat isn’t a surefire preventative but it helps.",
                "As a woman - I'm glad to see this.\n\nScumbags like her are a big reason why actual victims aren't believed. Her punishment is way too light, in my opinion, though.",
                "My question is why did it take a month to free him. I went and found the reporting of his original arrest\n\nhttps://www.cbsnews.com/philadelphia/news/daniel-pierson-arrest-attempted-rape-kidnapping-middletown-township-grocery-store-parking-lot/\n\n>\"Pierson is known to police to be a methamphetamine user,\" the release said.\n\nGuess they thought they had to add that in there. Bail was set at somewhere under a million so that is why he was in jail...",
                ">  and pay $3,600 in restitution to the victim.\n\nStraight to civil court for me! I’m asking for no less than $50k, that’s assuming there are no other damages besides my time for a month.",
                "$3,600 in restitution for destroying this man's life?  She should receive the same sentence he would have got if guilty and owe him a hell of a lot more money than that."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "DACA recipient and Kansas City father of 3 deported to Mexico despite valid documentation",
            "external_url": "https://www.cbsnews.com/news/daca-recipient-kansas-city-father-deported-mexico-despite-valid-documentation/",
            "upvotes": 2927,
            "date": "04/05/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/21/135d73e3-b4d4-4af3-89c8-8922a88d6caf/thumbnail/1200x630/2190c836194bbde9541ee0a89011d5f4/gettyimages-2162517300.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Why taking the time for due process matters.  A lot.",
                "Maga is too stupid to know that you can't unmix the chocolate from the cake.\n\nSo it's just a theater of pain and humiliation for immigrants till \"The Stupidest Generation\" dies out.",
                "The objective was always cruelty.",
                "Can they even do this?",
                "Whatever your feeling on immigration is, it's insane how much DACA recipients' lives have been played with.\n\nApparently people want countries not to send their \"worst.\" Well they were/are the definition of it. They are people who were ready to better their lives thru education.\n\nBoth sides of the team sports have let them down and it has been a travesty. If you're going to invest anything into a goal, why not see the goal thru to the logical end. If you don't, what was the point of wasted resources",
                "Wow. For legal residents to be cautioned against traveling is frightening beyond belief. Pretty soon, passport holding, US born citizens, (like myself ) will be cautioned against speaking or writing comments protected by the US Constitution for fear of being sent to a re-education 'camp'.\n\nIf you think it's funny, would you have believed 5 months ago that things like this would/could happen ?\n\nThe things we hold dear and believe to be natural rights are being burned bit by bit...and it's getting hotter by the second.",
                "immigrants enrich america. if not all you got are dumb red nec…. oh i get it",
                "I see nothing (says Sgt Schultz)",
                "Remember when they said it wasn't a racist thing because he was only going to go after the illegal immigrants?",
                "God I wish I was an attorney. I legit would spend the next 4 years fighting these fucking idiots in court"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Tech megacaps lose $1.8 trillion in 2 days as Trump tariffs lead Nasdaq to worst weekly drop in 5 years",
            "external_url": "https://www.cnbc.com/2025/04/04/technology-stocks-fall-for-a-second-session-led-by-tesla-and-nvidia.html",
            "upvotes": 3490,
            "date": "04/04/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108120393-1742835357354-gettyimages-2206691913-wm100366_kl5aayk2.jpeg?v=1743786921&w=1920&h=1080",
            "top_comments": [
                ">...worst weekly drop in 5 years.\n\nThe worst drop since the last time he was in office.",
                "From the article:\n\n\\- Apple has nosedived the most, shaving off more than $533 billion in market capitalization.\n\n\\- Tesla shaved off more than $89 in market cap, bringing its two-day tally to more than $139 billion\n\n\\- Meta plummeted more than $200 billion\n\n\\- [Amazon](https://www.cnbc.com/quotes/AMZN/) dropped $265 billion\n\n\\- Alphabet:  $139 billion\n\n\\- Microsoft: $165 billion\n\nThat's some unbelievable destruction of wealth!",
                "We are WINNING! THIS IS THE GREATEST WINNING. 🤡",
                "Trump Tax causing the Trump Recession",
                "Headline should say the worst weekly drop since the last time Trump was in office.",
                "Worst drop in 5 years, wasn’t rump the president 5 years ago lmao",
                "You act like they aren't also buying this dip to consolidate and concentrate more wealth away from the masses.",
                "When Biden was in office Faux News pundits all said you can tell how good a job a president is doing by reading the Stock Market. When the market under Biden was doing great Faux News barely covered the story. When Trump was inaugurated the market went up and Faux News said see how great the market is going knowing Trump is president. Now Faux News pundits are saying the market is not a good indicator on how well a president is performing. Also, not one word from Faux News on the rise in unemployment. Hypocrisy and morons are reporting on our countries free fall into the next Great Depression. Will need a new name for all those out of work people who camp out in DC, Hooverville has already been used.",
                "Three Months In $5 Trillion Destroyed.\n\nGo defensive - protect what you have left. The bottom is still ways away.\n\nAnd don't suffer quietly. Keep calling your congressmouse and ask it to do its job.",
                "Small price to pay to \"own the libs\"\n\nWhoever voted for this administration can hurt and hurt and continue hurting."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Comedian Russell Brand charged with rape",
            "external_url": "https://www.bbc.co.uk/news/articles/c0457d02e9go",
            "upvotes": 18960,
            "date": "04/04/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8110/live/58dc9480-1167-11f0-ba12-8d27eb561761.jpg",
            "top_comments": [
                "This is the least surprising news story I've seen all week.",
                "It's always the ones you most suspect",
                "Yeah that's why he became super Christian all of a sudden. He knew this was coming",
                "Some people say the worst part was the hypocrisy.\n\n\nI think it was the rape.\n\n\n/To paraphrase a real comedian ",
                "The Onion just reposted this[https://theonion.com/nation-could-have-sworn-russell-brand-was-already-convi-1850849838/](https://theonion.com/nation-could-have-sworn-russell-brand-was-already-convi-1850849838/)",
                "I read this headline and thought it was old news, honestly.\n\nWhen he started freaking out about woke people after MeToo I knew something was up with the dude",
                "Well I see someone wants to join the Trump administration",
                "Rapist Russell Brand charged with trying to be comedian",
                "Insane he made it to 2025. Him making it through the me too era is like getting an rpg past TSA in your backpack",
                "Get Him to the Greek stared Russel Brand, P Diddy and Jonah Hill."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court allows Trump to freeze dozens of teacher training grants",
            "external_url": "https://www.cnn.com/2025/04/04/politics/supreme-court-trump-teacher-grants/index.html",
            "upvotes": 3187,
            "date": "04/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2205531023.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If Congress no longer controls the power of the purse, what is their Constitutional reason to even exist?",
                "You think this is bad? Just wait until they rule he can rewrite the Constitution via Executive Order.",
                "There was no textual authority for President Trump to freeze these grants. There was textual authority for President Biden to forgive student loans. But textualism only matters when it leads to the outcome this activist Court wants.",
                "Education is the enemy of authoritarianism.\n\nProve me wrong.\n\nWhat’s one of the first groups fascists and authoritarians always go after? The educated. The intelligentsia.\n\nDictators love their people dumb and emotionally-led. Easier to control, easier to manipulate.",
                "Split 5-4 decision with Roberts siding with the liberal justices.",
                "No need for them . Education department is being dismantled so no more need for teachers !",
                ">But, the court said, the Trump administration made a compelling case that it would not be able to recover any funds spent while the lower court’s order remained in place.\n\n>If the states ultimately win the case, the court said, “they can recover any wrongfully withheld funds through” further litigation.\n\nIf they bothered to explain why the states can sue to get their money but the feds *can’t,* it is not in the article.",
                "Man I got my teaching license through one of these programs. It’s pretty prohibitive to be certified in my state (you have to have a Masters degree in education). I worked in one of the poorest districts in the country for 7 years (I’m in a different district now). I felt a lot of loyalty to the school system, because they invested a lot of money into me. Even more important, these programs allow people to enter the field that might have been blocked by the economic fetters towards becoming certified, like say people of color. Which is probably why Trump wants to end them. They also cycle teachers into certifications that are hard to fill like special education and English as a New Language. I NEVER would have become a special education teacher had I not kind of had to become one. And I love special education. And god the ENL teacher shortage is already really, really, really bad.",
                "So wait, help me understand, I might be stupid. The purpose of the tariffs is to bring back manufacturing to America, which will take years. During those years, some would think it would be wise to educate & train up the future generations, correct? Based on this & the events of the past ::checks notes:: not even 3 months yet, future generations will be dumber than rocks. How are we supposed to manufacture anything?",
                "Yes, because one thing we have way too many of is teachers. /S"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "USA Fencing disqualifies athlete for refusing to compete against transgender woman",
            "external_url": "https://abcnews.go.com/US/usa-fencing-disqualifies-stephanie-turner-refusing-fence-transgender/story?id=120462854",
            "upvotes": 14112,
            "date": "04/04/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1ec66efa-8d15-4e68-bb23-e0a4ce5dfad3/fencer-gty-er-250403_1743708715102_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Perhaps not in an actual competition, but fencing is often coed… I’ve definitely fenced against as many women as I have men. There isn’t some radical sex based advantage in fencing the way you might argue there is in many other supports, so this is totally ridiculous.",
                "So this is what the distraction is gonna be while the economy collapses, people are pulled off the streets by masked police and flown off without trial, and our allies abandon us? This is the important shit right here, huh?",
                "> Prior to 1990, separate men’s championships were held, but since then, fencing has been a coed sport with teams having men’s and women’s squads, although some schools field only a women’s team. Fencing is a single-division sport with schools from all three NCAA divisions competing against each other.\n\nHere’s some facts for all the morons talking about the “biological advantage” men have in fencing. It’s been a coed sport at the national competition level for nearly FOURTY YEARS. This is nothing but more conservative performative outrage, and your excuses is what encourage this kind of behavior.",
                "If all fails throw in a bit of trans panic so MAGA has something to be outraged about",
                "I’m sure the comments and discourse will be very positive",
                "Journalists suck.\n\nThis article should have at a minimum explained USA fencing's policy [outlined here](https://www.usafencing.org/transgender-and-nonbinary-policy). They couldn't be bothered to even look up what the policy was apparently, or provide information around why USA fencing felt that policy was actually ok.\n\nThis article comes across as, \"Hey I'm some dude and I want to poke women with my sword.\" Not, \"I identify as a woman and I've been on HRT for 12 months and because of that have lost most of my muscle tone.\" I'd even think it was great if they explained the counterpoint as well which is that most of the physical advantage of men comes from their height which is something they gain in puberty.\n\nI know this is a challenging topic for a lot of people, but holy fuck mainstream journalism is garbage.\n\n  \nedit: This is not an endorsement of alt-media (which is nothing but a sewage plant). It's a plea for journalists to do better.",
                "I'm still on the fence about the whole thing.",
                "Name one professional fencer off the top of your head.",
                "Look, I'd like to care about the stock market, having a house, people being disappeared, but this lady didn't get to fence who she wanted!!  This is truly the crisis of our time.",
                "All these folks so worried about women's (and girl's) sports don't seem too concerned that the Department of Education is being dismantled and that the DOE oversees compliance for Title IX.  Pre-Title IX --1 in 27 girls participated in sports, now it's is 2 in 5.  If you really do care about \"protecting\" opportunities for girls and women in sports, Title IX would be your focus.  NOTE, the same pols so obsessed with trans women in sports are the same ones who'd eliminate Title IX in a heartbeat. \n\n[https://www.womenssportsfoundation.org/wp-content/uploads/2022/04/FINAL6\\_WSF-Title-IX-Infographic-2022.pdf](https://www.womenssportsfoundation.org/wp-content/uploads/2022/04/FINAL6_WSF-Title-IX-Infographic-2022.pdf)"
            ],
            "aggregate_sentiment": 80.0
        }
    ],
    "last_updated": "04/05/2025 12:13:47 UTC"
}