{
    "posts": [
        {
            "category": "HOT",
            "title": "Feds accidentally publish secret plan to kill NYC congestion pricing",
            "external_url": "https://gothamist.com/news/feds-accidentally-publish-secret-plan-to-kill-nyc-congestion-pricing",
            "upvotes": 17015,
            "date": "04/24/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350872/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "Anyone know how to be deleted from Signal group chat, I keep getting added",
                "States' rights, except for those we do not like, amirite?",
                ">The internal 11-page letter, sent from attorneys in the Southern District of New York to a lawyer for the federal transportation department, was taken down less than an hour after it was erroneously put online.\n\nUh…you can’t put the toothpaste back in the tube.",
                "The one good thing about this administration is they are so unbelievably incompetent.    \n\nImagine the damage they were just as sinister AND competent.",
                "Trump's whole argument is BS.  He only cares about congestion pricing because he wants to hurt a blue state.   If Trump really thinks tolling interstate highways is illegal then what about Florida, New Jersey and Texas collecting a combined $5,000,000,000 annually in \"unfair\" tolls on interstate highways that we paid to build with tax dollars?   The Pennsylvania Turnpike was built and paid for 50 years ago and they still keep collecting those tolls.",
                "I knew all about this.Someone named Pete texted me about this yesterday! I don’t know how I got on that text chain but I think the poster is pretty tipsy;)",
                "I had to double take that it didn't say congressman.",
                "Fitting for an administration that destroys everything and accomplishes nothing.",
                "I'd love to say this is shockingly incompetent, but it's just par for the course at this point. Thankfully their stupidity undercuts the effectiveness of their authoritarianism a bit.",
                "Their administration is so chaotic and unorganized that they can’t keep anything a secret it seems"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Texas creates its own DOGE in attempt to make the state more business-friendly",
            "external_url": "https://www.keranews.org/texas-news/2025-04-24/texas-creates-its-own-doge-in-attempt-to-make-the-state-more-business-friendly",
            "upvotes": 5854,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What is it going to cut?  Republicans in Texas have been in charge of the budgetfor decades.",
                "Isn't Texas one of those states that's been controlled by republicans for decades? ",
                "Gross. Texas proving once again that it's a total shithole",
                "The irony of signing a bill for \"government efficiency\", while using dozens of different pens to hand off as souvenirs for your corporate masters",
                "Texas can't even keep their power grid functioning 🙄 cuts to spending should be the last thing on their mind",
                "Business friendly = human miserable",
                "Is business friendly the impression they got from this? Wow",
                "So you have a federal level DOGE and a state level DOGE? That sounds like inefficiency to me, one of them will have to go.",
                "Businesses and tech can come crawling back to CA. I expect your tail between your legs, but happy to have them back (also, for anyone who thinks CA isn’t doing well, we’re now the 4th largest global economy… up from 5th)",
                "Here's hoping it's going to shut down Operation Lone Star. The $11 Billion border fiasco arrests a ton of people only to let them go after a small misdemeanor charge. Also, Texas is already among the top \"business-friendly\" states with it's low corporate tax rate."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "After a scathing rebuke, judge grants DOJ an extension in deportation case",
            "external_url": "https://www.npr.org/2025/04/23/nx-s1-5373746/federal-judge-blasts-trump-stonewalling-deportation-case",
            "upvotes": 1084,
            "date": "04/24/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fae%2Fda%2F3d30708646a89f452f8371e3de32%2Fgettyimages-2210399552.jpg",
            "top_comments": [
                "Yeah, sounds about right. Absolutely worthless.",
                ">\"Defendants have failed to respond in good faith, and their refusal to do so can only be viewed as willful and intentional noncompliance,\" Xinis wrote.\n\n>\"That ends now,\" Judge Xinis declared as she rejected the administration's arguments so far as \"specious\" and condemned their \"mischaracterization\" of the Supreme Court's directive to facilitate Abrego Garcia's return to the U.S.\n\nJudge Xinis should have clarified, \"That ends...in another week\". What a joke.",
                "To be clear, the lawyers representing Abrego Garcia *also* signed off on this pause. We don't know *what* the deal is, but the Trump administration floating something that apparently offered the possibility of resolution. We'll see what ultimately happens, but I don't think this is actually *bad* news, per se.",
                "Soooo, “That ends now” meant…what, exactly?\n\nFor fuck sake - either just let this man turn into Hitler reincarnate or don’t. But fucking pick a lane. Let me know what I’m dealing with already. These repeated facades of holding these mother fuckers to account is exhausting and deflating. What the fuck else do they need to show you? These fascists have so little regard for the law and the constitution that they would wipe their asses with Xinis’s robe if given the chance. \n\nBut sure - go ahead and give them another week after demanding that “this ends now”.  Jesus Christ…",
                "A delay for what? We have Congress people going there. We have the creepy President of El Salvador coming here. We have Trump making many statements about how he refuses to comply with the Supreme Court. Do we just not care that democracy is dying? The man that our government said was mistakenly sent there, paid for by the US to be kidnapped and jailed in that country, could be back here tonight.",
                "And still nothing happens.",
                "There’s a special place in hell for Trump and his enablers.",
                "man i wish i could repeatedly blatantly break the law and suffer nothing but a fucking scathing rebuke",
                "You're fucking kidding me",
                "Oh look! They did exactly what everyone expected. \n\nNothing."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Maryland judge orders return of Venezuelan asylum seeker deported to El Salvador | CNN Politics",
            "external_url": "https://www.cnn.com/2025/04/24/politics/maryland-judge-return-venezuelan-asylum-seeker/index.html",
            "upvotes": 1365,
            "date": "04/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/08-04-2025-03-16t233141z-1466303683-rc25edablquk-rtrmadp-3-usa-trump-migration-el-salvador-jpg.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Yes. Due process for every last person that we've sent. Every single human that we've deported there is protected under the constitution and the day we stop defending that is the day that we all surrender our own constitutional rights.",
                "Add it to the list of shit they'll ignore because who's gonna do anything about it?",
                "Donald Trump thinks that asylum means \"insane asylum\" and that's why he says it all the time. I really do believe this.",
                "But have we looked at his tattoos. According to our gov, tattoos are the fundamental principle of fairness.",
                "Order schmorder, you have no power over the king.\n\nI HATE this timeline.",
                "Trump: No, thanks for the suggestion though.",
                "> The Trump administration, according to the order, has argued Cristian’s deportation did not violate the settlement, asserting “his designation as an alien enemy pursuant to the AEA results in him ceasing to be a member” of the class action. The government invoked the Alien Enemies Act, an 18th-century wartime authority, on March 15 to deport alleged members of Tren de Aragua, a Venezuelan gang Trump accuses of “perpetrating an invasion of and predatory incursion into the United States.”\nA sworn declaration from Robert Cerna, the ICE acting Field Office Director for Enforcement and Removal Operations, said Cristian had been arrested in Texas in January.\n“On January 6, 2025, (‘Cristian’) was convicted in the 482nd District Court at Harris County, Texas, for the offense of possession of cocaine,” Cerna stated in the filing. Cerna added that Immigration and Customs Enforcement determined Cristian was subject to removal following the invocation of the AEA.\n\nSo he was deported to El Salvador when he was from Venezuela. Against orders of a legal settlement that gave him protection. To be placed in CECOT, but the only detailed claim against him is he had cocaine. Are we going to be arresting every college kid who does cocaine and tossing them in a US Supermax without due process? Due process must be upheld for all, or it is too easy for our government to incarcerate anyone on a whim.",
                "It's easy to forget but we sent a man with no due process, who was ordered to be PROTECTED by our courts... to a death camp.\n\nThe foundations of everything are fucked if the laws don't prevail.",
                "Well, didn't the supreme court also order the return of the one wrongfully sent to El Salvador a while ago. Does anyone really believe that will happen?\n\nThe constitution crisis is here now. When an order of the supreme court is ignored, the house of cards is going to come crashing down because the only thing holding up our constitution is the belief that it should be. There is no real power being allocated to the judicial.",
                "Can we use names. Whats this person's name?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Benin admits that 54 soldiers killed in border attack by Jnim",
            "external_url": "https://www.bbc.com/news/articles/c4grjgkxn9vo",
            "upvotes": 1644,
            "date": "04/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/631e/live/bb40e620-20fe-11f0-9060-674316cb3a1f.jpg",
            "top_comments": [
                "For those curious like myself, Jnim is a terror org from Mali but active in a lot of west africa. They’re 4 groups that combined with a leader that pledged allegiance to the leader of the Taliban among others",
                "By the time the world pays attention, half of North and Central/West Africa will have these problems. Feels like Isis just moved from Syria to the Sahel.",
                "TIL Benin is a country I'd never heard of.  Really gotta improve my knowledge of African geography.",
                "Update: another attack happened today, this time an attack  on a French Supplied Vab.   key info is this happened in Borgu department which is far south of the attack which killed the 54 soldiers.",
                "[removed]",
                " [Had to look it up …](https://www.britannica.com/place/Benin)"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Judge rules federal government owes nearly $28 million to North Dakota for pipeline protests",
            "external_url": "https://www.nbcnews.com/news/us-news/judge-rules-federal-government-owes-nearly-28-million-north-dakota-pip-rcna202738",
            "upvotes": 2964,
            "date": "04/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-dakota-access-pipeline-mb-0909-90917d.jpg",
            "top_comments": [
                ">The sometimes-chaotic demonstrations drew international attention for the Standing Rock Sioux Tribe’s opposition to the pipeline’s Missouri River crossing upstream of the tribe’s reservation. The tribe has long opposed the pipeline, fearing an oil spill polluting its water supply.\n\nAnd sure enough [the pipeline ruptured spilling 3,500 gallons of oil a couple weeks ago](https://www.kvrr.com/2025/04/08/update-3500-barrels-of-oil-spilled-after-keystone-pipeline-rupture-near-fort-ransom/) but good news for the cops who policed the protests I guess",
                "“federal government owes state government millions for doing the violent suppression for them”",
                "Wow this is so corrupt it's ridiculous. Suing the government to pay the state for illegally using state law enforcement to break up a protest against a private company.",
                "Dude they were using private security to set dogs on Native Americans. How fucked up is that. Those dogs weren’t even real cops.",
                "Why isn’t the company paying for this? Maybe if there was an actual economic impact to using your money and influence to lobby for projects in your favor. We’d see corporations less likely to engage in this kind of hell or high water engagement of local communities.",
                "Which political party was in power in Feb 2017 when the protests were over  and it came time to pay up? What a mystery.",
                "This right here.\n\nThis.\n\nThis is sinclairs jungle. ",
                "We’ve learned judges’ ruling are all toothless",
                "Can't sue the government unless the government lets you."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Pete Hegseth orders makeup studio installed at Pentagon.",
            "external_url": "https://www.cbsnews.com/news/hegseth-orders-makeup-studio-installed-pentagon/",
            "upvotes": 14766,
            "date": "04/24/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/22/11a3d5f1-6474-45f7-9b25-ba260adf85c3/thumbnail/1200x630/ca22e91bcfeff562b946ad603109d829/gettyimages-2210086493.jpg?v=8e9dede207b29c97b32974c53e32aabc",
            "top_comments": [
                "Army Regulation 670-1 3-2b.(1)  (Cosmetics) \n>* Males are prohibited from wearing cosmetics, except when medically prescribed\n\nDoctors note, please?\n\nTrump's doctor excluded.",
                "He’s an abject failure of a human.",
                "I’m eagerly waiting for Fox entertainment to report out on this one",
                "I never want to hear about Pete Buttigieg being too gay for office again.",
                "Where is Doge when you actually have waste.",
                "First it was the leaks, now he has gone rouge.",
                "This sounds like a waste doge can actually handle.\nCome on democrats, he’s giving you gold on a platter and nothing? \n\n- is he transitioning?\n- or example of wrong hire?\n-or corruption?\n\nNothing?\n\n(Answer: 2 and 3)",
                "His sideburns are still drunk",
                "Trump and Drunk Pete wear more makeup than Ru Paul and then lecture everyone on being manly men, warfighters. JD is going to have to expand beyond mascara if he wants to be fabulously vain like those  dipshits. Maybe Pete can give him a makeover and spill the classified tea.",
                "# Pete Hegseth orders a gender affirming makeup studio to be set up in the pentagon"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Tornado victims blocked from federal recovery aid after Trump denied request",
            "external_url": "https://edition.cnn.com/2025/04/23/weather/trump-denied-disaster-aid-arkansas-tornadoes/index.html",
            "upvotes": 14145,
            "date": "04/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/img-2960.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This nugget shocked me..\n\nTrump easily carried the state or Arkansas for the third time in a row in 2024, this time by a 30.64% margin, the largest since 1972.\n\nFrom article-\n\nDisaster survivors in Arkansas left homeless by recent tornadoes have been blocked from receiving federal recovery aid after President Donald Trump rejected the state’s request to declare a major disaster in March.\n\nThe Trump administration denied Republican Gov. Sarah Huckabee Sanders’ request for individual and public assistance following an outbreak of severe storms and tornadoes that also affected neighboring Mississippi and Missouri and left more than 40 people dead.",
                "Gonna start selling MAGA bootstraps on every religious radio station in that state.",
                "God, remember when conservatives were whining about Biden not “funding FEMA” while voting for the republican Congress members who campaigned on defunding FEMA? \n\nI’m sick of maga cult members not understanding their own fucking politics.",
                "YUP. There is only one way for all this to go, going forward. NOT looking forward to the wildfires and hurricane season later in the year.",
                "All the Leopards eating faces would be pretty entertaining if it wasn't for the fact that good people who didn't vote for this are also suffering.",
                "Where is the outcry from the ignorant conservatives who were super pissed when they believed the lie that Biden was cutting fema to red states?",
                "Red state asks for help because they can’t afford a few billion to cover a disaster.  So, like a \\*\\*communist\\*\\* state, they ask the rest of us to pay for their misfortune.    \n\n\nMaybe their god can share some of those prosperity dollars they have collected to help out. \n\n/s.  I don’t want to see people suffer.  I really don’t. But it is incredibly hard not to turn a blind eye to the plight of people who continue to dig their own graves while screaming to bring the rest of us down as well.",
                "Thanks for voting for me Arkansas... but tornadoes are your problem.",
                "Another red state discovers leopards.",
                "Is this going to get the same play on MSM that trump's attacks on Biden/Harris in '24 about North Carolina got?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Dozen states sue Trump in bid to block new tariffs",
            "external_url": "https://www.cnbc.com/2025/04/23/states-sue-trump-in-bid-to-block-new-tariffs.html",
            "upvotes": 47314,
            "date": "04/23/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108102916-1739560760118-gettyimages-2199659780-mms20867_kamriiiu.jpeg?v=1745437525&w=1920&h=1080",
            "top_comments": [
                "In addition to New York, the plaintiffs in the new lawsuit filed Wednesday include Arizona, Colorado, Connecticut, Delaware, Illinois, Maine, Minnesota, New Mexico, Oregon, and Vermont",
                "Good, because this shit is weeks away from causing about half my industry to disappear.",
                "Take me back to 2024 before this administration",
                "There was clip of powerful bankers in his office and he  was saying he made 900 million yesterday, and this other guy made 2.5 billion. He’s causing dips on purpose so him and rich friends can buy low and then sell later. He announced some tariffs a while back then walked them back 90 days later. This is market manipulation.",
                "I work for a solar company who everyone here (aside from me) are Trump voters. Yet they’re all still licking his boot.",
                "Couldn't they just get their congress members to, do their job instead?",
                "Thank you to every single state doing this, sadly I'm not in one.",
                "Taxation without representation!  Throw it all into the harbor, boys!",
                "It’s one of the single dumbest things I’ve ever seen an individual do. And he happens to be the most powerful individual in the world. Pretty amazing, in a weird way",
                "If you live in a red state (like me) and are thinking of moving somewhere away from the madness (at least a little bit) then you now have a list of states that will at least try to stand up for their citizens in the face of this insanity. \n\n\"In addition to New York, the plaintiffs in the new lawsuit filed Wednesday include Arizona, Colorado, Connecticut, Delaware, Illinois, Maine, Minnesota, New Mexico, Oregon, and Vermont.\"\n\nNot saying there's not crazy to be had everywhere, but I'm going to assume most of these states are not trying to make it illegal to speak badly about Trump, make Trump's birthday a holiday, rename major airport after him, and ask his administration with help in ensuring they'll be able to keep the billions in federal tax subsidies for public education after they pass an unconstitutional bill to ban undocumented kids from public schools. All of this and more is happening in Tennessee- and the news says the tariffs will hurt TN too- but our spineless and horrid super majority GOP state government is too busy doing racist, bigoted victory laps to care."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "2 men detained at Albemarle courthouse in alleged ICE raid",
            "external_url": "https://www.vpm.org/news/2025-04-23/albemarle-courthouse-ice-raid-nicholas-reppucci-teodoro-dominguez-rodriguez",
            "upvotes": 907,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Cville resident here. They were going after people taking care of minor traffic violations. At least one of the ICE \"officers\" was wearing a balaclava. All they're missing are the brown shirts. It's sickening.\n\n\nPeople I've talked to about it are *livid*. This is a fairly blue town in a sea of red. It's only a matter of time until someone does something stupid and then they'll have all the justification they need.",
                "This is domestic terrorism. They have a almost complete disregard for our constitution. Anybody that is supportive of this behavior is complicit, not just morally bankrupt.\n\nThis administration has corporations, news media outlets, and cult followers bending the knee. \n\nThere is a reason that this administration has all the personnel in place with zero experience outside of loyalty.\n\n\"Were gonna make this a Christian Nation.\" Give the population more latitude on free religion, and the administration has better control on the populace. Ex: A 33 time felon fucking pornstars,...they don't care.\n\n.... I mean,..c'mon, a military parade in his honor?\n\nAnybody that doesn't see the reality of what is happening at this point is not ignorant. They know.",
                "We keep hearing about them rounding up a few people here and there in dramatic ways but has Trump actually made any impact on illegal immigrants as a whole? I wouldn’t be surprised if Biden deported more immigrants.",
                "First they came for the brown people, yet I did nothing cause I was not brown.\n\nThen they came for the transgender, yet I did nothing cause I was not transgender.\n\nThen they came for......\n\n  \nYou see where I'm going with this? Will Europe have to invade the USA to liberate those in the detention camps?",
                "They're doing this stuff without warrants or any identification that they're ICE/Homeland Security. There's no way for a bystander to tell the difference between this and a kidnapping. Eventually someone will pull out a gun and start shooting, which might be the goal of doing things in such an unofficial manner. More crackdowns and use of force can be justified if they can have some event they can label as terrorism.",
                "\"Gicetapo.\"\n\nAlways and forever."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Feds accidentally publish secret plan to kill NYC congestion pricing",
            "external_url": "https://gothamist.com/news/feds-accidentally-publish-secret-plan-to-kill-nyc-congestion-pricing",
            "upvotes": 16982,
            "date": "04/24/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350872/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "Anyone know how to be deleted from Signal group chat, I keep getting added",
                "States' rights, except for those we do not like, amirite?",
                ">The internal 11-page letter, sent from attorneys in the Southern District of New York to a lawyer for the federal transportation department, was taken down less than an hour after it was erroneously put online.\n\nUh…you can’t put the toothpaste back in the tube.",
                "The one good thing about this administration is they are so unbelievably incompetent.    \n\nImagine the damage they were just as sinister AND competent.",
                "Trump's whole argument is BS.  He only cares about congestion pricing because he wants to hurt a blue state.   If Trump really thinks tolling interstate highways is illegal then what about Florida, New Jersey and Texas collecting a combined $5,000,000,000 annually in \"unfair\" tolls on interstate highways that we paid to build with tax dollars?   The Pennsylvania Turnpike was built and paid for 50 years ago and they still keep collecting those tolls.",
                "I knew all about this.Someone named Pete texted me about this yesterday! I don’t know how I got on that text chain but I think the poster is pretty tipsy;)",
                "I had to double take that it didn't say congressman.",
                "Fitting for an administration that destroys everything and accomplishes nothing.",
                "I'd love to say this is shockingly incompetent, but it's just par for the course at this point. Thankfully their stupidity undercuts the effectiveness of their authoritarianism a bit.",
                "Their administration is so chaotic and unorganized that they can’t keep anything a secret it seems"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Man charged with arson after authorities say he sparked New Jersey Pine Barrens fire",
            "external_url": "https://apnews.com/article/new-jersey-wildfire-smoke-ny-air-quality-67b146ae19bef2cb111d7efc3d0b563d",
            "upvotes": 262,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Obviously not an interior decorator.",
                "If we held people financially accountable for this stuff (when it’s accidental but preventable and causes massive damage like this) I bet people would be a lot more careful. This is clearly accidental but from idiocy. Who the heck just walks away from a bonfire? It’s one thing if it’s your little patio thing that’s well contained and dying out. It’s another when you’re burning piles of rubbish in your yard",
                "I wonder if Pauli's Russian made it out.",
                "Teen-aged-man accidentally starts fire by making a stupid bonfire.     \n\nOh, look, my headline contains information they could have easily added as well.  I wonder why thy didn't?",
                "Isn't that where the goodfellas buried the bodies back in the day?\n\nhttps://www.nytimes.com/1973/02/05/archives/mob-favors-pinelands-for-burials.html",
                "tldr: it wasn't on purpose. dude had a bon fire and didn't extinguish it all the way before leaving. Fire flared back up and started to spread through the woods.",
                "If he’s guilty he should be locked up for a year…set a precedent for anyone else messing with the same ideas. Also a huge fine….pay for the damages.",
                "And here I thought I was an asshole by accidentally setting a trash can outside of Target on fire.",
                "Did Jesus make him do it?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "After a scathing rebuke, judge grants DOJ an extension in deportation case",
            "external_url": "https://www.npr.org/2025/04/23/nx-s1-5373746/federal-judge-blasts-trump-stonewalling-deportation-case",
            "upvotes": 1085,
            "date": "04/24/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fae%2Fda%2F3d30708646a89f452f8371e3de32%2Fgettyimages-2210399552.jpg",
            "top_comments": [
                "Yeah, sounds about right. Absolutely worthless.",
                ">\"Defendants have failed to respond in good faith, and their refusal to do so can only be viewed as willful and intentional noncompliance,\" Xinis wrote.\n\n>\"That ends now,\" Judge Xinis declared as she rejected the administration's arguments so far as \"specious\" and condemned their \"mischaracterization\" of the Supreme Court's directive to facilitate Abrego Garcia's return to the U.S.\n\nJudge Xinis should have clarified, \"That ends...in another week\". What a joke.",
                "To be clear, the lawyers representing Abrego Garcia *also* signed off on this pause. We don't know *what* the deal is, but the Trump administration floating something that apparently offered the possibility of resolution. We'll see what ultimately happens, but I don't think this is actually *bad* news, per se.",
                "Soooo, “That ends now” meant…what, exactly?\n\nFor fuck sake - either just let this man turn into Hitler reincarnate or don’t. But fucking pick a lane. Let me know what I’m dealing with already. These repeated facades of holding these mother fuckers to account is exhausting and deflating. What the fuck else do they need to show you? These fascists have so little regard for the law and the constitution that they would wipe their asses with Xinis’s robe if given the chance. \n\nBut sure - go ahead and give them another week after demanding that “this ends now”.  Jesus Christ…",
                "A delay for what? We have Congress people going there. We have the creepy President of El Salvador coming here. We have Trump making many statements about how he refuses to comply with the Supreme Court. Do we just not care that democracy is dying? The man that our government said was mistakenly sent there, paid for by the US to be kidnapped and jailed in that country, could be back here tonight.",
                "And still nothing happens.",
                "There’s a special place in hell for Trump and his enablers.",
                "man i wish i could repeatedly blatantly break the law and suffer nothing but a fucking scathing rebuke",
                "You're fucking kidding me",
                "Oh look! They did exactly what everyone expected. \n\nNothing."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Maryland judge orders return of Venezuelan asylum seeker deported to El Salvador | CNN Politics",
            "external_url": "https://www.cnn.com/2025/04/24/politics/maryland-judge-return-venezuelan-asylum-seeker/index.html",
            "upvotes": 1366,
            "date": "04/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/08-04-2025-03-16t233141z-1466303683-rc25edablquk-rtrmadp-3-usa-trump-migration-el-salvador-jpg.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Yes. Due process for every last person that we've sent. Every single human that we've deported there is protected under the constitution and the day we stop defending that is the day that we all surrender our own constitutional rights.",
                "Add it to the list of shit they'll ignore because who's gonna do anything about it?",
                "Donald Trump thinks that asylum means \"insane asylum\" and that's why he says it all the time. I really do believe this.",
                "But have we looked at his tattoos. According to our gov, tattoos are the fundamental principle of fairness.",
                "Order schmorder, you have no power over the king.\n\nI HATE this timeline.",
                "Trump: No, thanks for the suggestion though.",
                "> The Trump administration, according to the order, has argued Cristian’s deportation did not violate the settlement, asserting “his designation as an alien enemy pursuant to the AEA results in him ceasing to be a member” of the class action. The government invoked the Alien Enemies Act, an 18th-century wartime authority, on March 15 to deport alleged members of Tren de Aragua, a Venezuelan gang Trump accuses of “perpetrating an invasion of and predatory incursion into the United States.”\nA sworn declaration from Robert Cerna, the ICE acting Field Office Director for Enforcement and Removal Operations, said Cristian had been arrested in Texas in January.\n“On January 6, 2025, (‘Cristian’) was convicted in the 482nd District Court at Harris County, Texas, for the offense of possession of cocaine,” Cerna stated in the filing. Cerna added that Immigration and Customs Enforcement determined Cristian was subject to removal following the invocation of the AEA.\n\nSo he was deported to El Salvador when he was from Venezuela. Against orders of a legal settlement that gave him protection. To be placed in CECOT, but the only detailed claim against him is he had cocaine. Are we going to be arresting every college kid who does cocaine and tossing them in a US Supermax without due process? Due process must be upheld for all, or it is too easy for our government to incarcerate anyone on a whim.",
                "It's easy to forget but we sent a man with no due process, who was ordered to be PROTECTED by our courts... to a death camp.\n\nThe foundations of everything are fucked if the laws don't prevail.",
                "Well, didn't the supreme court also order the return of the one wrongfully sent to El Salvador a while ago. Does anyone really believe that will happen?\n\nThe constitution crisis is here now. When an order of the supreme court is ignored, the house of cards is going to come crashing down because the only thing holding up our constitution is the belief that it should be. There is no real power being allocated to the judicial.",
                "Can we use names. Whats this person's name?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "German beer sales down at home and abroad",
            "external_url": "https://www.dw.com/en/german-beer-sales-down-at-home-and-abroad/a-72306658",
            "upvotes": 314,
            "date": "04/24/2025",
            "thumbnail": "https://static.dw.com/image/69689805_6.jpg",
            "top_comments": [
                ">Non-alcoholic beer has, however, been seeing a huge increase in sales in Germany as those of alcoholic beverages fall.\n\nPeople are just switching to non alcoholic drinks.",
                "2024 and 2025 already feels like im drunk without having any beer.",
                "According to my bank account, yep. I used to buy about $200 in Weihensptephaner, Hofbrau, Spaten and Fruh every month. Now it's down to less than $100.",
                "Weed is legal in Germany, so that would track.",
                "Personally I enjoy a good German pilsner or dunkel.  Craft breweries in the US only want to make IPAs.  I don't like IPAs, they hide any taste they might have behind way too much hops.",
                "US brewer here: sales are down domestically too. Everyone across the board has pretty much been struggling since Covid to regain their footing, particularly with on-premise sales (draft accounts). Things just aren’t the same anymore, and demand is way down\n\nYounger generations just aren’t drinking like previous generations also and, if they are drinking,  trends have shown beverages like Twisted Tea, seltzers, and session (or ‘mini’) beers that are sub 5% abv have been popular.",
                "It’s because I quit drinking. Damn I miss German beer",
                "Dab drinking Canadian here doing my part.  It’s the best beer for the low price here.",
                "Beer quality abroad has surged. \n\nI used to buy German beers because the purity laws gave me some confidence I wasn't just drinking a pint of preservatives sure to give me a mega hangover, but there's so many good local micro to medium sized brewers now, it makes more sense to support local businesses.",
                "Deleted because replied wrong, was meant for a commentator, not OP\n\nEdit: thank you, kind redditor, for the award."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Texas creates its own DOGE in attempt to make the state more business-friendly",
            "external_url": "https://www.keranews.org/texas-news/2025-04-24/texas-creates-its-own-doge-in-attempt-to-make-the-state-more-business-friendly",
            "upvotes": 5855,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What is it going to cut?  Republicans in Texas have been in charge of the budgetfor decades.",
                "Isn't Texas one of those states that's been controlled by republicans for decades? ",
                "Gross. Texas proving once again that it's a total shithole",
                "The irony of signing a bill for \"government efficiency\", while using dozens of different pens to hand off as souvenirs for your corporate masters",
                "Texas can't even keep their power grid functioning 🙄 cuts to spending should be the last thing on their mind",
                "Business friendly = human miserable",
                "Is business friendly the impression they got from this? Wow",
                "So you have a federal level DOGE and a state level DOGE? That sounds like inefficiency to me, one of them will have to go.",
                "Businesses and tech can come crawling back to CA. I expect your tail between your legs, but happy to have them back (also, for anyone who thinks CA isn’t doing well, we’re now the 4th largest global economy… up from 5th)",
                "Here's hoping it's going to shut down Operation Lone Star. The $11 Billion border fiasco arrests a ton of people only to let them go after a small misdemeanor charge. Also, Texas is already among the top \"business-friendly\" states with it's low corporate tax rate."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Benin admits that 54 soldiers killed in border attack by Jnim",
            "external_url": "https://www.bbc.com/news/articles/c4grjgkxn9vo",
            "upvotes": 1638,
            "date": "04/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/631e/live/bb40e620-20fe-11f0-9060-674316cb3a1f.jpg",
            "top_comments": [
                "For those curious like myself, Jnim is a terror org from Mali but active in a lot of west africa. They’re 4 groups that combined with a leader that pledged allegiance to the leader of the Taliban among others",
                "By the time the world pays attention, half of North and Central/West Africa will have these problems. Feels like Isis just moved from Syria to the Sahel.",
                "TIL Benin is a country I'd never heard of.  Really gotta improve my knowledge of African geography.",
                "Update: another attack happened today, this time an attack  on a French Supplied Vab.   key info is this happened in Borgu department which is far south of the attack which killed the 54 soldiers.",
                "[removed]",
                " [Had to look it up …](https://www.britannica.com/place/Benin)"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "2 men detained at Albemarle courthouse in alleged ICE raid",
            "external_url": "https://www.vpm.org/news/2025-04-23/albemarle-courthouse-ice-raid-nicholas-reppucci-teodoro-dominguez-rodriguez",
            "upvotes": 903,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Cville resident here. They were going after people taking care of minor traffic violations. At least one of the ICE \"officers\" was wearing a balaclava. All they're missing are the brown shirts. It's sickening.\n\n\nPeople I've talked to about it are *livid*. This is a fairly blue town in a sea of red. It's only a matter of time until someone does something stupid and then they'll have all the justification they need.",
                "This is domestic terrorism. They have a almost complete disregard for our constitution. Anybody that is supportive of this behavior is complicit, not just morally bankrupt.\n\nThis administration has corporations, news media outlets, and cult followers bending the knee. \n\nThere is a reason that this administration has all the personnel in place with zero experience outside of loyalty.\n\n\"Were gonna make this a Christian Nation.\" Give the population more latitude on free religion, and the administration has better control on the populace. Ex: A 33 time felon fucking pornstars,...they don't care.\n\n.... I mean,..c'mon, a military parade in his honor?\n\nAnybody that doesn't see the reality of what is happening at this point is not ignorant. They know.",
                "We keep hearing about them rounding up a few people here and there in dramatic ways but has Trump actually made any impact on illegal immigrants as a whole? I wouldn’t be surprised if Biden deported more immigrants.",
                "First they came for the brown people, yet I did nothing cause I was not brown.\n\nThen they came for the transgender, yet I did nothing cause I was not transgender.\n\nThen they came for......\n\n  \nYou see where I'm going with this? Will Europe have to invade the USA to liberate those in the detention camps?",
                "They're doing this stuff without warrants or any identification that they're ICE/Homeland Security. There's no way for a bystander to tell the difference between this and a kidnapping. Eventually someone will pull out a gun and start shooting, which might be the goal of doing things in such an unofficial manner. More crackdowns and use of force can be justified if they can have some event they can label as terrorism.",
                "\"Gicetapo.\"\n\nAlways and forever."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Judge rules federal government owes nearly $28 million to North Dakota for pipeline protests",
            "external_url": "https://www.nbcnews.com/news/us-news/judge-rules-federal-government-owes-nearly-28-million-north-dakota-pip-rcna202738",
            "upvotes": 2972,
            "date": "04/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-dakota-access-pipeline-mb-0909-90917d.jpg",
            "top_comments": [
                ">The sometimes-chaotic demonstrations drew international attention for the Standing Rock Sioux Tribe’s opposition to the pipeline’s Missouri River crossing upstream of the tribe’s reservation. The tribe has long opposed the pipeline, fearing an oil spill polluting its water supply.\n\nAnd sure enough [the pipeline ruptured spilling 3,500 gallons of oil a couple weeks ago](https://www.kvrr.com/2025/04/08/update-3500-barrels-of-oil-spilled-after-keystone-pipeline-rupture-near-fort-ransom/) but good news for the cops who policed the protests I guess",
                "“federal government owes state government millions for doing the violent suppression for them”",
                "Wow this is so corrupt it's ridiculous. Suing the government to pay the state for illegally using state law enforcement to break up a protest against a private company.",
                "Dude they were using private security to set dogs on Native Americans. How fucked up is that. Those dogs weren’t even real cops.",
                "Why isn’t the company paying for this? Maybe if there was an actual economic impact to using your money and influence to lobby for projects in your favor. We’d see corporations less likely to engage in this kind of hell or high water engagement of local communities.",
                "Which political party was in power in Feb 2017 when the protests were over  and it came time to pay up? What a mystery.",
                "This right here.\n\nThis.\n\nThis is sinclairs jungle. ",
                "We’ve learned judges’ ruling are all toothless",
                "Can't sue the government unless the government lets you."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Tornado victims blocked from federal recovery aid after Trump denied request",
            "external_url": "https://edition.cnn.com/2025/04/23/weather/trump-denied-disaster-aid-arkansas-tornadoes/index.html",
            "upvotes": 14143,
            "date": "04/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/img-2960.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This nugget shocked me..\n\nTrump easily carried the state or Arkansas for the third time in a row in 2024, this time by a 30.64% margin, the largest since 1972.\n\nFrom article-\n\nDisaster survivors in Arkansas left homeless by recent tornadoes have been blocked from receiving federal recovery aid after President Donald Trump rejected the state’s request to declare a major disaster in March.\n\nThe Trump administration denied Republican Gov. Sarah Huckabee Sanders’ request for individual and public assistance following an outbreak of severe storms and tornadoes that also affected neighboring Mississippi and Missouri and left more than 40 people dead.",
                "Gonna start selling MAGA bootstraps on every religious radio station in that state.",
                "God, remember when conservatives were whining about Biden not “funding FEMA” while voting for the republican Congress members who campaigned on defunding FEMA? \n\nI’m sick of maga cult members not understanding their own fucking politics.",
                "YUP. There is only one way for all this to go, going forward. NOT looking forward to the wildfires and hurricane season later in the year.",
                "All the Leopards eating faces would be pretty entertaining if it wasn't for the fact that good people who didn't vote for this are also suffering.",
                "Where is the outcry from the ignorant conservatives who were super pissed when they believed the lie that Biden was cutting fema to red states?",
                "Red state asks for help because they can’t afford a few billion to cover a disaster.  So, like a \\*\\*communist\\*\\* state, they ask the rest of us to pay for their misfortune.    \n\n\nMaybe their god can share some of those prosperity dollars they have collected to help out. \n\n/s.  I don’t want to see people suffer.  I really don’t. But it is incredibly hard not to turn a blind eye to the plight of people who continue to dig their own graves while screaming to bring the rest of us down as well.",
                "Thanks for voting for me Arkansas... but tornadoes are your problem.",
                "Another red state discovers leopards.",
                "Is this going to get the same play on MSM that trump's attacks on Biden/Harris in '24 about North Carolina got?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Maryland judge orders return of Venezuelan asylum seeker deported to El Salvador | CNN Politics",
            "external_url": "https://www.cnn.com/2025/04/24/politics/maryland-judge-return-venezuelan-asylum-seeker/index.html",
            "upvotes": 1373,
            "date": "04/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/08-04-2025-03-16t233141z-1466303683-rc25edablquk-rtrmadp-3-usa-trump-migration-el-salvador-jpg.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Yes. Due process for every last person that we've sent. Every single human that we've deported there is protected under the constitution and the day we stop defending that is the day that we all surrender our own constitutional rights.",
                "Add it to the list of shit they'll ignore because who's gonna do anything about it?",
                "Donald Trump thinks that asylum means \"insane asylum\" and that's why he says it all the time. I really do believe this.",
                "But have we looked at his tattoos. According to our gov, tattoos are the fundamental principle of fairness.",
                "Order schmorder, you have no power over the king.\n\nI HATE this timeline.",
                "Trump: No, thanks for the suggestion though.",
                "> The Trump administration, according to the order, has argued Cristian’s deportation did not violate the settlement, asserting “his designation as an alien enemy pursuant to the AEA results in him ceasing to be a member” of the class action. The government invoked the Alien Enemies Act, an 18th-century wartime authority, on March 15 to deport alleged members of Tren de Aragua, a Venezuelan gang Trump accuses of “perpetrating an invasion of and predatory incursion into the United States.”\nA sworn declaration from Robert Cerna, the ICE acting Field Office Director for Enforcement and Removal Operations, said Cristian had been arrested in Texas in January.\n“On January 6, 2025, (‘Cristian’) was convicted in the 482nd District Court at Harris County, Texas, for the offense of possession of cocaine,” Cerna stated in the filing. Cerna added that Immigration and Customs Enforcement determined Cristian was subject to removal following the invocation of the AEA.\n\nSo he was deported to El Salvador when he was from Venezuela. Against orders of a legal settlement that gave him protection. To be placed in CECOT, but the only detailed claim against him is he had cocaine. Are we going to be arresting every college kid who does cocaine and tossing them in a US Supermax without due process? Due process must be upheld for all, or it is too easy for our government to incarcerate anyone on a whim.",
                "It's easy to forget but we sent a man with no due process, who was ordered to be PROTECTED by our courts... to a death camp.\n\nThe foundations of everything are fucked if the laws don't prevail.",
                "Well, didn't the supreme court also order the return of the one wrongfully sent to El Salvador a while ago. Does anyone really believe that will happen?\n\nThe constitution crisis is here now. When an order of the supreme court is ignored, the house of cards is going to come crashing down because the only thing holding up our constitution is the belief that it should be. There is no real power being allocated to the judicial.",
                "Can we use names. Whats this person's name?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Feds accidentally publish secret plan to kill NYC congestion pricing",
            "external_url": "https://gothamist.com/news/feds-accidentally-publish-secret-plan-to-kill-nyc-congestion-pricing",
            "upvotes": 17016,
            "date": "04/24/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350872/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "Anyone know how to be deleted from Signal group chat, I keep getting added",
                "States' rights, except for those we do not like, amirite?",
                ">The internal 11-page letter, sent from attorneys in the Southern District of New York to a lawyer for the federal transportation department, was taken down less than an hour after it was erroneously put online.\n\nUh…you can’t put the toothpaste back in the tube.",
                "The one good thing about this administration is they are so unbelievably incompetent.    \n\nImagine the damage they were just as sinister AND competent.",
                "Trump's whole argument is BS.  He only cares about congestion pricing because he wants to hurt a blue state.   If Trump really thinks tolling interstate highways is illegal then what about Florida, New Jersey and Texas collecting a combined $5,000,000,000 annually in \"unfair\" tolls on interstate highways that we paid to build with tax dollars?   The Pennsylvania Turnpike was built and paid for 50 years ago and they still keep collecting those tolls.",
                "I knew all about this.Someone named Pete texted me about this yesterday! I don’t know how I got on that text chain but I think the poster is pretty tipsy;)",
                "I had to double take that it didn't say congressman.",
                "Fitting for an administration that destroys everything and accomplishes nothing.",
                "I'd love to say this is shockingly incompetent, but it's just par for the course at this point. Thankfully their stupidity undercuts the effectiveness of their authoritarianism a bit.",
                "Their administration is so chaotic and unorganized that they can’t keep anything a secret it seems"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Man charged with arson after authorities say he sparked New Jersey Pine Barrens fire",
            "external_url": "https://apnews.com/article/new-jersey-wildfire-smoke-ny-air-quality-67b146ae19bef2cb111d7efc3d0b563d",
            "upvotes": 261,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Obviously not an interior decorator.",
                "If we held people financially accountable for this stuff (when it’s accidental but preventable and causes massive damage like this) I bet people would be a lot more careful. This is clearly accidental but from idiocy. Who the heck just walks away from a bonfire? It’s one thing if it’s your little patio thing that’s well contained and dying out. It’s another when you’re burning piles of rubbish in your yard",
                "I wonder if Pauli's Russian made it out.",
                "Teen-aged-man accidentally starts fire by making a stupid bonfire.     \n\nOh, look, my headline contains information they could have easily added as well.  I wonder why thy didn't?",
                "Isn't that where the goodfellas buried the bodies back in the day?\n\nhttps://www.nytimes.com/1973/02/05/archives/mob-favors-pinelands-for-burials.html",
                "tldr: it wasn't on purpose. dude had a bon fire and didn't extinguish it all the way before leaving. Fire flared back up and started to spread through the woods.",
                "If he’s guilty he should be locked up for a year…set a precedent for anyone else messing with the same ideas. Also a huge fine….pay for the damages.",
                "And here I thought I was an asshole by accidentally setting a trash can outside of Target on fire.",
                "Did Jesus make him do it?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "After a scathing rebuke, judge grants DOJ an extension in deportation case",
            "external_url": "https://www.npr.org/2025/04/23/nx-s1-5373746/federal-judge-blasts-trump-stonewalling-deportation-case",
            "upvotes": 1082,
            "date": "04/24/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fae%2Fda%2F3d30708646a89f452f8371e3de32%2Fgettyimages-2210399552.jpg",
            "top_comments": [
                "Yeah, sounds about right. Absolutely worthless.",
                ">\"Defendants have failed to respond in good faith, and their refusal to do so can only be viewed as willful and intentional noncompliance,\" Xinis wrote.\n\n>\"That ends now,\" Judge Xinis declared as she rejected the administration's arguments so far as \"specious\" and condemned their \"mischaracterization\" of the Supreme Court's directive to facilitate Abrego Garcia's return to the U.S.\n\nJudge Xinis should have clarified, \"That ends...in another week\". What a joke.",
                "To be clear, the lawyers representing Abrego Garcia *also* signed off on this pause. We don't know *what* the deal is, but the Trump administration floating something that apparently offered the possibility of resolution. We'll see what ultimately happens, but I don't think this is actually *bad* news, per se.",
                "Soooo, “That ends now” meant…what, exactly?\n\nFor fuck sake - either just let this man turn into Hitler reincarnate or don’t. But fucking pick a lane. Let me know what I’m dealing with already. These repeated facades of holding these mother fuckers to account is exhausting and deflating. What the fuck else do they need to show you? These fascists have so little regard for the law and the constitution that they would wipe their asses with Xinis’s robe if given the chance. \n\nBut sure - go ahead and give them another week after demanding that “this ends now”.  Jesus Christ…",
                "A delay for what? We have Congress people going there. We have the creepy President of El Salvador coming here. We have Trump making many statements about how he refuses to comply with the Supreme Court. Do we just not care that democracy is dying? The man that our government said was mistakenly sent there, paid for by the US to be kidnapped and jailed in that country, could be back here tonight.",
                "And still nothing happens.",
                "There’s a special place in hell for Trump and his enablers.",
                "man i wish i could repeatedly blatantly break the law and suffer nothing but a fucking scathing rebuke",
                "You're fucking kidding me",
                "Oh look! They did exactly what everyone expected. \n\nNothing."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Texas creates its own DOGE in attempt to make the state more business-friendly",
            "external_url": "https://www.keranews.org/texas-news/2025-04-24/texas-creates-its-own-doge-in-attempt-to-make-the-state-more-business-friendly",
            "upvotes": 5851,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What is it going to cut?  Republicans in Texas have been in charge of the budgetfor decades.",
                "Isn't Texas one of those states that's been controlled by republicans for decades? ",
                "Gross. Texas proving once again that it's a total shithole",
                "The irony of signing a bill for \"government efficiency\", while using dozens of different pens to hand off as souvenirs for your corporate masters",
                "Texas can't even keep their power grid functioning 🙄 cuts to spending should be the last thing on their mind",
                "Business friendly = human miserable",
                "Is business friendly the impression they got from this? Wow",
                "So you have a federal level DOGE and a state level DOGE? That sounds like inefficiency to me, one of them will have to go.",
                "Businesses and tech can come crawling back to CA. I expect your tail between your legs, but happy to have them back (also, for anyone who thinks CA isn’t doing well, we’re now the 4th largest global economy… up from 5th)",
                "Here's hoping it's going to shut down Operation Lone Star. The $11 Billion border fiasco arrests a ton of people only to let them go after a small misdemeanor charge. Also, Texas is already among the top \"business-friendly\" states with it's low corporate tax rate."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "RISING",
            "title": "Judge rules federal government owes nearly $28 million to North Dakota for pipeline protests",
            "external_url": "https://www.nbcnews.com/news/us-news/judge-rules-federal-government-owes-nearly-28-million-north-dakota-pip-rcna202738",
            "upvotes": 2963,
            "date": "04/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-dakota-access-pipeline-mb-0909-90917d.jpg",
            "top_comments": [
                ">The sometimes-chaotic demonstrations drew international attention for the Standing Rock Sioux Tribe’s opposition to the pipeline’s Missouri River crossing upstream of the tribe’s reservation. The tribe has long opposed the pipeline, fearing an oil spill polluting its water supply.\n\nAnd sure enough [the pipeline ruptured spilling 3,500 gallons of oil a couple weeks ago](https://www.kvrr.com/2025/04/08/update-3500-barrels-of-oil-spilled-after-keystone-pipeline-rupture-near-fort-ransom/) but good news for the cops who policed the protests I guess",
                "“federal government owes state government millions for doing the violent suppression for them”",
                "Wow this is so corrupt it's ridiculous. Suing the government to pay the state for illegally using state law enforcement to break up a protest against a private company.",
                "Dude they were using private security to set dogs on Native Americans. How fucked up is that. Those dogs weren’t even real cops.",
                "Why isn’t the company paying for this? Maybe if there was an actual economic impact to using your money and influence to lobby for projects in your favor. We’d see corporations less likely to engage in this kind of hell or high water engagement of local communities.",
                "Which political party was in power in Feb 2017 when the protests were over  and it came time to pay up? What a mystery.",
                "This right here.\n\nThis.\n\nThis is sinclairs jungle. ",
                "We’ve learned judges’ ruling are all toothless",
                "Can't sue the government unless the government lets you."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "German beer sales down at home and abroad",
            "external_url": "https://www.dw.com/en/german-beer-sales-down-at-home-and-abroad/a-72306658",
            "upvotes": 312,
            "date": "04/24/2025",
            "thumbnail": "https://static.dw.com/image/69689805_6.jpg",
            "top_comments": [
                ">Non-alcoholic beer has, however, been seeing a huge increase in sales in Germany as those of alcoholic beverages fall.\n\nPeople are just switching to non alcoholic drinks.",
                "2024 and 2025 already feels like im drunk without having any beer.",
                "According to my bank account, yep. I used to buy about $200 in Weihensptephaner, Hofbrau, Spaten and Fruh every month. Now it's down to less than $100.",
                "Weed is legal in Germany, so that would track.",
                "Personally I enjoy a good German pilsner or dunkel.  Craft breweries in the US only want to make IPAs.  I don't like IPAs, they hide any taste they might have behind way too much hops.",
                "US brewer here: sales are down domestically too. Everyone across the board has pretty much been struggling since Covid to regain their footing, particularly with on-premise sales (draft accounts). Things just aren’t the same anymore, and demand is way down\n\nYounger generations just aren’t drinking like previous generations also and, if they are drinking,  trends have shown beverages like Twisted Tea, seltzers, and session (or ‘mini’) beers that are sub 5% abv have been popular.",
                "It’s because I quit drinking. Damn I miss German beer",
                "Dab drinking Canadian here doing my part.  It’s the best beer for the low price here.",
                "Beer quality abroad has surged. \n\nI used to buy German beers because the purity laws gave me some confidence I wasn't just drinking a pint of preservatives sure to give me a mega hangover, but there's so many good local micro to medium sized brewers now, it makes more sense to support local businesses.",
                "Deleted because replied wrong, was meant for a commentator, not OP\n\nEdit: thank you, kind redditor, for the award."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "Benin admits that 54 soldiers killed in border attack by Jnim",
            "external_url": "https://www.bbc.com/news/articles/c4grjgkxn9vo",
            "upvotes": 1643,
            "date": "04/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/631e/live/bb40e620-20fe-11f0-9060-674316cb3a1f.jpg",
            "top_comments": [
                "For those curious like myself, Jnim is a terror org from Mali but active in a lot of west africa. They’re 4 groups that combined with a leader that pledged allegiance to the leader of the Taliban among others",
                "By the time the world pays attention, half of North and Central/West Africa will have these problems. Feels like Isis just moved from Syria to the Sahel.",
                "TIL Benin is a country I'd never heard of.  Really gotta improve my knowledge of African geography.",
                "Update: another attack happened today, this time an attack  on a French Supplied Vab.   key info is this happened in Borgu department which is far south of the attack which killed the 54 soldiers.",
                "[removed]",
                " [Had to look it up …](https://www.britannica.com/place/Benin)"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "2 men detained at Albemarle courthouse in alleged ICE raid",
            "external_url": "https://www.vpm.org/news/2025-04-23/albemarle-courthouse-ice-raid-nicholas-reppucci-teodoro-dominguez-rodriguez",
            "upvotes": 903,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Cville resident here. They were going after people taking care of minor traffic violations. At least one of the ICE \"officers\" was wearing a balaclava. All they're missing are the brown shirts. It's sickening.\n\n\nPeople I've talked to about it are *livid*. This is a fairly blue town in a sea of red. It's only a matter of time until someone does something stupid and then they'll have all the justification they need.",
                "This is domestic terrorism. They have a almost complete disregard for our constitution. Anybody that is supportive of this behavior is complicit, not just morally bankrupt.\n\nThis administration has corporations, news media outlets, and cult followers bending the knee. \n\nThere is a reason that this administration has all the personnel in place with zero experience outside of loyalty.\n\n\"Were gonna make this a Christian Nation.\" Give the population more latitude on free religion, and the administration has better control on the populace. Ex: A 33 time felon fucking pornstars,...they don't care.\n\n.... I mean,..c'mon, a military parade in his honor?\n\nAnybody that doesn't see the reality of what is happening at this point is not ignorant. They know.",
                "We keep hearing about them rounding up a few people here and there in dramatic ways but has Trump actually made any impact on illegal immigrants as a whole? I wouldn’t be surprised if Biden deported more immigrants.",
                "First they came for the brown people, yet I did nothing cause I was not brown.\n\nThen they came for the transgender, yet I did nothing cause I was not transgender.\n\nThen they came for......\n\n  \nYou see where I'm going with this? Will Europe have to invade the USA to liberate those in the detention camps?",
                "They're doing this stuff without warrants or any identification that they're ICE/Homeland Security. There's no way for a bystander to tell the difference between this and a kidnapping. Eventually someone will pull out a gun and start shooting, which might be the goal of doing things in such an unofficial manner. More crackdowns and use of force can be justified if they can have some event they can label as terrorism.",
                "\"Gicetapo.\"\n\nAlways and forever."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "Pete Hegseth orders makeup studio installed at Pentagon.",
            "external_url": "https://www.cbsnews.com/news/hegseth-orders-makeup-studio-installed-pentagon/",
            "upvotes": 14767,
            "date": "04/24/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/22/11a3d5f1-6474-45f7-9b25-ba260adf85c3/thumbnail/1200x630/ca22e91bcfeff562b946ad603109d829/gettyimages-2210086493.jpg?v=8e9dede207b29c97b32974c53e32aabc",
            "top_comments": [
                "Army Regulation 670-1 3-2b.(1)  (Cosmetics) \n>* Males are prohibited from wearing cosmetics, except when medically prescribed\n\nDoctors note, please?\n\nTrump's doctor excluded.",
                "He’s an abject failure of a human.",
                "I’m eagerly waiting for Fox entertainment to report out on this one",
                "I never want to hear about Pete Buttigieg being too gay for office again.",
                "Where is Doge when you actually have waste.",
                "First it was the leaks, now he has gone rouge.",
                "This sounds like a waste doge can actually handle.\nCome on democrats, he’s giving you gold on a platter and nothing? \n\n- is he transitioning?\n- or example of wrong hire?\n-or corruption?\n\nNothing?\n\n(Answer: 2 and 3)",
                "His sideburns are still drunk",
                "Trump and Drunk Pete wear more makeup than Ru Paul and then lecture everyone on being manly men, warfighters. JD is going to have to expand beyond mascara if he wants to be fabulously vain like those  dipshits. Maybe Pete can give him a makeover and spill the classified tea.",
                "# Pete Hegseth orders a gender affirming makeup studio to be set up in the pentagon"
            ],
            "aggregate_sentiment": 0.0
        }
    ],
    "last_updated": "04/24/2025 20:10:02 UTC"
}