{
    "posts": [
        {
            "category": "HOT",
            "title": "EU retaliates against Trump's trade moves and slaps tariffs on produce from Republican states",
            "external_url": "https://www.cbc.ca/news/world/trump-europe-trade-retaliaton-1.7481215",
            "upvotes": 7174,
            "date": "03/12/2025",
            "thumbnail": "https://i.cbc.ca/1.5392012.1741773258!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/belfium-eu-green-deal.jpg?im=Resize%3D620",
            "top_comments": [
                "Just to be clear, the tariffs are on all US imports but happen to be hitting a number of red states.  Goods from blue states will be affected as well.  \n\n>The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson’s Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nVirginia has voted consistently blue in presidential elections and while the governor is Republican, the state house is Dem.  And yes I am aware of the NoVA-southern VA demographics but I doubt the EU cares whether Arlington voted for Trump or not.",
                "> The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson's Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nThe current administration is trying to bully our long-standing allies, and anyone in our country who doesn't comply with them. I'm not shocked the world is starting to fight back.",
                "The bourbon industry is not going to have a good time.  They weren't too happy when Canada took their products out of provincially controlled stores.",
                "Cut to 24 hours later when Trump puts a hold on the EU tariffs.",
                "I love the awareness abroad that these horrific policies are not the will of all Americans. Eff those red states!",
                "Please, all, may we have some more? Fuck the red states.",
                "As a blue stater that has paid for red state subsidies my whole life while they continuously attack all our liberties for no sane reason... we love you.",
                "I love that they're going after republican states the most. Punishing everyone in the country risks uniting more people behind trump. I get it can effect every state but the distinction is nice. Also, from a selfish standpoint, it's fucking amazing to not get lumped in with the smooth brain morons who voted for this traitor. I, as an American, support the hell out of these retaliatory measures.",
                "Heheh… take that Florida and Idaho and Iowa.",
                "I’d love it if California could create its own trade agreements with the EU. Not sure if that’s possible but if we can we should"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Arrested ship's captain is Russian national",
            "external_url": "https://www.bbc.co.uk/news/articles/c30mj5gq9d5o",
            "upvotes": 16624,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/14bf/live/25cd65b0-ff4c-11ef-a8b1-950887ddc6e5.jpg",
            "top_comments": [
                "So this will be the last we’ll hear of it then.",
                ">The Stena Immaculate was carrying 220,000 barrels of aviation fuel to be used by the US military.\n\nHoly crap. Is the US military going to respond to this?",
                "The only group of people trying to start WW3 are the Russians. Cutting communication lines across the region and now purposefully attacking other vessels.",
                "The sinking of a boat was what got the US involved in both world wars. \n\nA shame the only balls Trump has are the set in his mouth, attached to Putin.",
                "China does the same, ramming Philippine, Taiwan, Vietnam, Japan etc's ships with their fake fishing boats then pretending they were the ones attacked. Brace for similar allegations from Russia.\n\n[https://youtu.be/lv031K\\_lV4I?si=9T-KbHK6SxSAPAxp](https://youtu.be/lv031K_lV4I?si=9T-KbHK6SxSAPAxp)\n\n[https://youtu.be/JxhjHAFwcd4?si=9FxKO3Z6Mz2tVr2f](https://youtu.be/JxhjHAFwcd4?si=9FxKO3Z6Mz2tVr2f)",
                "I’m no conspiracy theorist but the coincidences here are astounding. Hope this guy doesn’t mysteriously die in custody.",
                "In what world is this not considered an attack on a U.S. military vessel?",
                "Unfortunately when Besiktas-M accidentally ran into the USS Harry S. Truman, it showed how easy it is to just ram a ship into a US asset. Just like 'accidentally' dragging anchors can cut underwater cables, I'm sure we're about to see a spike in 'accidental' ship collisions.",
                "Russians and boats don’t seem to mix well.",
                "Trump is going to pardon him and send him on his way to Russia.  Also a nice apology letter for wrecking a Russian ship."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "EPA terminates Biden-era climate grants worth $20 billion",
            "external_url": "https://apnews.com/article/epa-green-bank-zeldin-climate-trump-5168d11b7f63aeaf72001b50221c3c19",
            "upvotes": 1733,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "All the roadblocks that were in place last term have been replaced with sycophants.\n\nEdit:typo",
                "So more jobs lost. Weren't we supposed to be improving unemployment under a healthy economy?",
                "https://www.project2025.observer/",
                "Why is Congress even debating passing a budget right now when Republicans seem to have decided that the President can do whatever the fuck he wants with the money regardless of what Congress approves into law?",
                "Republican voters:  “choke me harder daddy, make me drink, eat, and breathe toxins, anything you say daddy!”",
                "I don't understand why so many things are able to be undone. This is negating so many things Biden did/awarded etc. Organizations/States/Localities that were allocated these funds relied upon them to start this work just to have it yanked away.",
                "So destroy the environment, tank the flourishing Biden economy, ruin our National Parks, desecrate domestic education, foreign aid and assistance for  our allies under siege, fire essential workers for no cause and all to just give tax cuts to folks with Yachts that have smaller yachts attached to them. Oh and also make enemies out of our best friends by implementing the “stupidest tariffs of all time” according to conservative WSJ",
                "What a piece of shit government y’all elected. Pure evil. You should be fucking embarrassed.",
                "I know double-speak is a core tenant of fascism; but if they keep doing this, as they did in the first term, they eventually need to rename the Environmental PROTECTION Agency (EPA) to the Environmental DESTRUCTION Agency (EDA). Their moves are just no longer accurate to the department's name or purpose.\n\nIt'd be like continuing to call Burger King \"Burger King\" if they only served salads...",
                "Yeah man!!! Take that planet earth!! Get ready to once again taste the sweet-sweet poison by the corporate republicans will be pouring down your gullet. Also - America, get ready for the stunning and beautiful thick grey/gray clouds of repugnant smog. China will soon be in second place. Take that!!"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "French nuclear attack submarine docked in Halifax, Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/video/2025/03/12/french-nuclear-attack-submarine-docked-in-halifax/",
            "upvotes": 899,
            "date": "03/12/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/https%3A%2F%2Fd3g70guqh4mw9g.cloudfront.net%2F03-12-2025%2Ft_54fd9ebceea143a096852a37f7d34d41_name_11_ATL_SUBMARINE23_VO_frame_0.jpeg?smart=true&auth=83b21a885db7d00d504abfd54a754edecc941e240651702f0ed5f7f16dd08dda&width=1200&height=630",
            "top_comments": [
                "Excellent. \n\nPerhaps we could get British nuclear attack subs based here permanently since we are still a part of the Commonwealth.",
                "they definitely worded that headline in a very specific way to garner views, which is nothing new, but this seems to be a pretty extreme case. “Let’s use the public’s fear of a nuclear attack as a way to engage readers!” This is a standard operation for this submarine and it’s being used to further fuel fears of WW3. \n\n“Nuclear attack submarine” is not common terminology. “Nuclear-powered attack submarine” is typically the description. I know it’s pedantic but at a glance (which is how most folks read headlines), one could easily assume a nuclear attack had occurred in France.",
                "Halifax being about 600 km from St Pierre et Miquelon, a territorial overseas collectivity of France.",
                "Clearly a baguette class submarine",
                "THEY DO THIS EVERY YEAR!!! ignore the rage bait.",
                "Is an annoying French knight on board?",
                "I hope it stays there until trump is out of office",
                "And yet another repost. Awesome 👍",
                "I guess we’re doing star ocean 4’s intro instead of fallout.\n\n\nThe long term result is good, at least.\n\nStar ocean 4 intro:\n\nhttps://m.youtube.com/watch?v=OBAAqtJL8RM\n\n\n\nFallout 1 intro:\n\nhttps://m.youtube.com/watch?v=hG3uBgQmTnk",
                "Good. Now use it to fire on the US; Trump's going to attack sooner or later, so you might as well have the element of surprise and force him into WWIII before he's ready."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Brittany Holberg, inmate on Texas death row for 27 years, has her conviction tossed by federal appeals court",
            "external_url": "https://www.cbsnews.com/news/texas-death-row-brittany-holberg-conviction-reversed-federal-appeals-court/",
            "upvotes": 1372,
            "date": "03/12/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/12/539875d6-099e-4ff1-8391-45d7b4dfefe2/thumbnail/1200x630/7adcdd7a181df287d03ce5cf2b8ee9e6/texas-death-row-glwolrtwgaa8c3v.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "Holy hell. How do you recover from losing all that time. I’m sure Texas has some laws limiting restitution to some embarrassingly small amount.",
                "The conviction relied on the testimony of a jailhouse informant who recanted in 2011, but the Texas appeals court and the federal district court decided that this key testimony basically being a lie wasn't enough to overturn the conviction.",
                ">In securing her conviction in 1998, Randall County prosecutors heavily relied on testimony from a jail inmate who was working as a confidential informant for the City of Amarillo police. That informant recanted her testimony in 2011, but neither a Texas Court of Criminal Appeals or a federal district court found that prosecutors had violated Holberg’s constitutional right to a fair trial.\n\nSeems shady, but consider\n\n>During trial, Holberg asserted that she acted in self-defense and that she stabbed Towery because she feared for her life and sought to protect herself after he struck her on the back of the head and refused to relent.\n\n>“The jury was presented with graphic physical evidence that Holberg sadistically butchered a sick old man-with a lamp rammed down his throat as the coup de grâce,” Duncan wrote. “That evidence doomed Holberg’s self-defense theory and there is no chance that impeaching Kirkpatrick would have resurrected it.”\n\nSelf defense does not usually include having a lamp shoved down your throat. I’m inclined to not lean too heavily on that tainted testimony. Would I say it’s first degree murder? No. But it was murder, or manslaughter at the very least. Time served does seem appropriate.",
                "She was let off on a technicality. After reading the article, I really doubt she was actually innocent. How does a lamp get shoved down somebody's throat in self-defense?",
                "And imagine if at any time during those 27 years it was her turn. Disgusting. This is why the death penalty needs to be abolished",
                "Honestly I'm surprised anyone bothered to pay attention to a sex worker's case. Good for her.",
                "Exhibit ‘too many to count’ why I’ll never support death penalty",
                "I'm not inclined to believe any \"jailhouse confession\" revealed by another inmate. I'm supposed to believe that a person in jail decided to confess to a crime to someone they just met? And I'm supposed to believe this other person already in jail is somehow an honest person and should be believed; and that they're not getting some kind of benefit for their testimony? No thanks.\n\nWhat I don't understand is that in this case, the nature of the murder was clearly not completely self-defense. It seems like they could have gotten a conviction anyway, so I don't understand why they decided they needed this tainted testimony other than they wanted to get a death penalty conviction for personal reasons.",
                "I’m of two minds on this, there was definitely legal malpractice here and that should be rectified but I also don’t think she’s innocent.\n I don’t know what the right answer is but we can’t  have a system where the state ignores the rules because then were all in jeopardy.",
                "Idiot prosecution. Very unfortunate for her.\n\n\nBut killing a man and shoving a lamp down his throat? Can that really be self defense? He was probably unconscious when she lamped him. Why not just walk out when he is unconscious?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "US Military cancels climate change studies that Pentagon chief calls 'crap'",
            "external_url": "https://www.reuters.com/world/us/us-military-cancels-climate-change-studies-that-pentagon-chief-calls-crap-2025-03-10/",
            "upvotes": 10966,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Pretty sure for 2 decades or so DoD has said climate change is one of our biggest threats.",
                "It's fine, it's not like climate change ruins crop growth, which fluffs up food production, which elevates food prices, which causes civil unrest, which causes social-political collapse, which overthrows regimes.\nEG Syria.",
                "A Secretary of Defense that achieved a high rank in the military would have finished required studies and known how important this issue is towards geopolitics going forward.  Our country is run my idiots that think they know everything.",
                "Save 30 million, lose 100 billion. Math is mathing.\n\n\n\"In 2023, the United States experienced 28 separate weather or climate disasters that each resulted in at least $1 billion in damages. Damages from the 2023 disasters totaled $92.9 billion.\"",
                "\"If you ignore the problem, it will just go away.\"\n\n- Alberto Einstein",
                "I'm sure he came to that conclusion based on a thorough review of the available literature, conference proceedings, analysis of the raw data, and discussion with academic experts who have spent decades studying the topic.",
                "Most unqualified Sec of Defense in history.",
                "In the future, any Americans devastated due to climate change have full rights to pillage the homes of rich fucks who denied it.",
                "Literally a DEI hire generic white dude lmao",
                "it's truly one of the most pathetic sins of our species that the global powers seemed to, in as brief of a space as about five years, go from denying climate change-- to saying it's real but admitting they simply wont be doing anything."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Amazon rainforest cut down to build highway for COP climate summit",
            "external_url": "https://www.bbc.co.uk/news/articles/c9vy191rgn1o",
            "upvotes": 2599,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1c4d/live/c42f5a20-ff32-11ef-a8b1-950887ddc6e5.jpg",
            "top_comments": [
                "\"Scrutiny is growing over whether flying thousands of them across the world, and the infrastructure required to host them, is undermining the cause.\"\n\nNo shit.",
                "Genius idea. Absolutely flawless with the PR and optics on this one. \n\nAlmost if you could had this meeting, literally anywhere else with road access but no, let’s build a brand new road and destroy trees and the eco system.\n\nSome times I could swear people have their last two brain cells fighting it out for third place.",
                "I thought this was posted in r/nottheonion",
                "A road paved with irony.",
                "How do these people know when to inhale and exhale?",
                "Remind me why people can't just zoom or video call to these things? Why do they HAVE to be there physically?",
                "Just as bad when everyone flies their private jets to a climate summit and not just do a zoom meeting.",
                "🤦‍♂️We are speedrunning the demise of life on this planet",
                "Sacrifice and rules and laws and limits for the littles and the poors, for those on the 'commanding heights' only the most opulent consumption, destruction, waste and gluttony.  \n\nThere should be - but aren't - real karmic-level consequences and cost to this kind of hypocrisy and and betrayal for those who perpetrate it and those who profit from it.  \n\nMost of the actual agenda and action I see on 'climate change' and 'sustainability' is focused on profiting from it while consolidating power and wealth and resources.  \n\nShame and retribution!  ",
                "anytime I hear climate summit or like g20 meeting or paris accord or whatever...I just feel like taxpayers pay a bunch of douchebags to fly somewhere and waste their time and our money then do absolutely nothing."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Mom missing for 6 days found alive stranded in car: 'She had given up hope'",
            "external_url": "https://abcnews.go.com/US/mom-missing-6-days-found-alive-stranded-car/story?id=119707268",
            "upvotes": 622,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/38739dbe-36b3-475e-afe1-de3c91bffbbc/rescue-ht-gmh-250312_1741782471865_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">She was stuck in the car and could not get out. But she was able to reach the water from the car, Caldwell said. The only way she was able to survive was using her hoodie and dipping it into the water in a ditch and sucking the water, or bringing the water into her mouth from the ditch.\n\nWow. What a strong and smart woman. It's shocking how often this happens.",
                ">Cassell had been trapped since Thursday night when she fell asleep at the wheel and veered off the road into a deep ditch under a bridge, according to her father, Delmar Caldwell.\n\nPlease don't drive tired. If you're sleepy, find a place to stop and make a phone call to someone to let them know where you stopped.",
                "So thankful someone found her in time. Something similar happened to my coworker’s husband some years ago. They were relocating to a new state for a job. Husband was the last to travel alone after closing up the old house. He was driving through a mountainous area and veered off the road. His car landed in a very wooded area many feet below the highway and not visible. He was pinned hanging upside down and could not get down or out of the car. Couldn’t reach the phone and the battery eventually died. Authorities were reluctant to do deep search because he had not been missing 24 hours. They said he could have stopped off to eat or rest. She reached out to friends and family and anyone who would help. They were able to narrow down the search area on the basis of his last conversation with his wife. The only reason they finally found him was a bright red dolly fell out of his truck during the accident and the handle was sticking out of a visible area. This is why you should always let someone know of your travel plans and check in once in a while and keep your phone charged.",
                "Johnny Martinez is the man who saw her from atop a large tractor. An incredible stroke of luck that he saw her and to quickly take action. What a hero.",
                "Years ago my mom and dad were volunteer EMTs in Indiana. They responded to a call of an accident found after several days in an overgrown ditch. The driver had maggots in his wounds but was alert. Occasionally, this happens in Indiana. ",
                ">\"She was stuck in the car and could not get out. But she was able to reach the water from the car,\".  \n    \nI wish they had more details, or even a picture. I’m trying to imagine the situation.",
                "\"Everybody that helped to find her and the volunteers and everything ... it was a wonderful miracle,\"  Good to hear some good news .",
                ">Vanderwall said Martinez could spot the car because he was driving a tall tractor.\n\n>\"I myself had traveled that road at least three to four times since she crashed and did not see her,\" Vanderwall noted.\n\nThat's some serious luck right there, or just fate.",
                "Whoa…Amazing how she improvised getting water in her system an effort to live",
                "Our phones track us and share our locations all the time. Is there no reason the phone company couldn't have shared her last known point with investigators?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Department of Education lays off nearly 50% of its workforce",
            "external_url": "https://abcnews.go.com/US/department-education-faces-50-layoffs-after-closure-notice/story?id=119690524&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 40913,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/63d5aa42-9003-48c5-b937-5f4e3fa8c88f/dept-education-1-epa-gmh-250311_1741707004175_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "From the contacts I know at the Dept of Ed, the compliance department has been more or less decimated, and the ombudsman's office has also taken a massive hit if not completely destroyed as well. \n\nThese departments served as guide rails, keeping people on track and providing accountability. Things are going to get very very messy.\n\nDepts with firings: \n\n • National Center for Education Statistics\n\n • Institute of Education Sciences\n\n • Federal Student Aid\n\n • Office for Civil Rights\n\n • Office of Postsecondary Education \n\n • Office of General Counsel Ethics Division\n\nBoston, New York, Atlanta, Chicago, Cleveland, Dallas, San Francisco have been abolished.  The offices spared are Denver, Kansas City, Seattle and DC Metro. DOED Office for Civil Rights\n\nOver 1800 people gone. \n\nThis is gonna have a MASSIVE down stream impact on K-12, Hs, and college level Education, data, compliance, and special education programs. \n\nPeople aren't really aware of what this will do. It's like being on a plane 20000ft jn the air and ripping out random wires because you dont think you need them.",
                "Time out. Less than 4000 people work at DOE?",
                "Woman who's never worked in education and enrolled her own kids in private schools has strong feelings on how little funding should go to programs helping special needs students.",
                "As a disabled person that benefited from DoE policy to get my high school and college diplomas I worry for the younger generation that will lose access.",
                "This is the kind of thing that should set off alarm bells, but somehow it just feels like another day in the slow dismantling of public services. Cutting nearly half a department overnight, with barely a warning, is not streamlining, it is sabotage. Even if you believe the Department of Education is bloated, you do not fix a system by gutting it in a way that leaves staff terrified and scrambling. \n\nPeople do not work well under fear, and a government that rules through uncertainty is more interested in control than competence. The bigger question is what comes next. If this is just the warm-up act for dismantling the department altogether, what does that mean for the millions of students and families who rely on federal education programmes? Anyone cheering this move might want to ask themselves whether they trust their local politicians to handle education funding fairly and effectively because that is where this is headed.",
                "Everything Trump is doing weakens America, and hurts Americans.",
                "\"Six communications offices are going to be consolidated, they explained, and leases will end in major cities including San Francisco, New York, Cleveland, Boston, Chicago and Dallas.\"\n\nSeem a little targeted to anyone else?",
                "I hate how the worst possible news reports don't even get a sigh out of me anymore. Not that I'm accepting this as normal, but at this point my reaction to this headline is just 'of course it is'.",
                "Being in college right now is weird. Not a lot of political discussions allowed/welcome in the classrooms. Instead of organizing (maybe out of fear) everyone is in self preservation mode due to midterms. This news doesn’t make it easy to lock in on my own studying.",
                "I didn’t realize the Ed Dept was that small, less than 4,000 people? You always hear about how the DoD is 1.3 million civilians and the VA is 435,000. But the entire Ed Dept is 4,000 people? TIL."
            ],
            "aggregate_sentiment": 32.0
        },
        {
            "category": "HOT",
            "title": "Astronauts launching to space will finally relieve the pair who flew on Boeing's troubled capsule",
            "external_url": "https://www.nbcnews.com/science/space/astronauts-space-station-launch-nasa-boeing-return-rcna194880",
            "upvotes": 544,
            "date": "03/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250307-spacex-nasa-ISS-crew-10-mn-0905-582721.jpg",
            "top_comments": [
                "will “hopefully” relieve\n\nI have zero faith in any of these groups anymore.",
                "Standing by for what happens when they return to Earth. I expect Trump will brag he had to rescue them because Biden had stranded them on purpose. Now, when the decision was made for them to extend their stay and return the malfunctioning Boeing brick unmanned, it was stated at  that time they would return in March 2025.",
                "They're *still* up there?",
                "I cannot imagine anyone thinking space travel is a good idea with Trump in office and President Musk bulldozing our institutions.  What happens when NASA ceases to function, with no funding and no leadership, while these people are living in a failing structure miles from Earth?  \n\nYeah.  This sounds like a failure waiting to happen.",
                "Sure they will. Just like the dozen previous attempts would bring them home. And that's assuming that Emperor Musk doesn't order the mission sabotaged after the astronauts contradicted his statements about this whole shitshow (we know how much he love silencing critics and blowing up his own rockets, after all).",
                "These astronauts did not Boeing back to Earth. ",
                "With Space X being involved.... anyone else concerned about the whole, Space X launches keep exploding... issue?",
                "I just want to know the financial compensation",
                "Yeah, SpaceX is doing it. \n\nMeaning, in some way, shape, or form, Elson Mursk can take credit for this.",
                "This ain’t gonna go good. I hate to be a pessimist, but I have a *real* bad feeling about this!"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Palestinian activist Mahmoud Khalil will remain in ICE detention in Louisiana after first court hearing | CNN",
            "external_url": "https://www.cnn.com/2025/03/12/us/mahmoud-khalil-trump-columbia-university/index.html",
            "upvotes": 69,
            "date": "03/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-23150134.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Fascism, pure and simple",
                "Someone tell me what exactly this man had been charged with to justify removing his legal green card status and separating him his wife who is herself a US citizen? Cause I still have not been given any clear answer on that front.",
                "Remember, kids, if you say a Wrong Thought (as he defines it), the President may send the federal authorities out to ruin your life.",
                "Im rather interested to see how this will play out, one way or another it’s going to set legal precedent. This is the sort of case that makes its way to the Supreme Court.",
                "For what? He hasn't been charged with anything as far as I know other than being a political pawn.",
                "Violating constitutional rights on behalf of a foreign state.",
                "Why did they send him to Louisiana?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Grief stricken father speaks out",
            "external_url": "https://www.wwnytv.com/2025/03/11/grief-stricken-man-speaks-out-after-prison-nurse-wife-loses-baby/?fbclid=IwZXh0bgNhZW0CMTEAAR196z8Gq1xriXH4iWBK3-hr5QpagZOHjqZ2cUDaF9-OgI24ZWOzpzoS5xs_aem_nXBD9PnITdaDTQMHxGmDmw#fz6tre575zhl6jat0z8efc6amomrtg4q",
            "upvotes": 0,
            "date": "03/12/2025",
            "thumbnail": "https://gray-wwny-prod.gtv-cdn.com/resizer/v2/55EPHXWBKZHPBE2MWBVRCEX4F4.jpg?auth=4764824514518daf4aad28ee1d8680bb59c9292cd7c76f18cc8408993d1e87a7&width=1200&height=600&smart=true",
            "top_comments": [
                "I don't think this is a sufficient headline. \n\n> Grief-stricken man speaks out after prison nurse wife loses baby",
                "*No one is sure what is causing the issues. Hazmat teams and state investigators responded to the prison but didn’t find anything. The state says it’s still under investigation. (Watertown ch. 7)* \n\nIs it the mystery substance or is it all the narcan given in response that's the problem?  If there's an answer, I must have missed it."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "French nuclear attack submarine docked in Halifax, Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/video/2025/03/12/french-nuclear-attack-submarine-docked-in-halifax/",
            "upvotes": 897,
            "date": "03/12/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/https%3A%2F%2Fd3g70guqh4mw9g.cloudfront.net%2F03-12-2025%2Ft_54fd9ebceea143a096852a37f7d34d41_name_11_ATL_SUBMARINE23_VO_frame_0.jpeg?smart=true&auth=83b21a885db7d00d504abfd54a754edecc941e240651702f0ed5f7f16dd08dda&width=1200&height=630",
            "top_comments": [
                "Excellent. \n\nPerhaps we could get British nuclear attack subs based here permanently since we are still a part of the Commonwealth.",
                "they definitely worded that headline in a very specific way to garner views, which is nothing new, but this seems to be a pretty extreme case. “Let’s use the public’s fear of a nuclear attack as a way to engage readers!” This is a standard operation for this submarine and it’s being used to further fuel fears of WW3. \n\n“Nuclear attack submarine” is not common terminology. “Nuclear-powered attack submarine” is typically the description. I know it’s pedantic but at a glance (which is how most folks read headlines), one could easily assume a nuclear attack had occurred in France.",
                "Halifax being about 600 km from St Pierre et Miquelon, a territorial overseas collectivity of France.",
                "Clearly a baguette class submarine",
                "THEY DO THIS EVERY YEAR!!! ignore the rage bait.",
                "Is an annoying French knight on board?",
                "I hope it stays there until trump is out of office",
                "And yet another repost. Awesome 👍",
                "I guess we’re doing star ocean 4’s intro instead of fallout.\n\n\nThe long term result is good, at least.\n\nStar ocean 4 intro:\n\nhttps://m.youtube.com/watch?v=OBAAqtJL8RM\n\n\n\nFallout 1 intro:\n\nhttps://m.youtube.com/watch?v=hG3uBgQmTnk",
                "Good. Now use it to fire on the US; Trump's going to attack sooner or later, so you might as well have the element of surprise and force him into WWIII before he's ready."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "EPA terminates Biden-era climate grants worth $20 billion",
            "external_url": "https://apnews.com/article/epa-green-bank-zeldin-climate-trump-5168d11b7f63aeaf72001b50221c3c19",
            "upvotes": 1725,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "All the roadblocks that were in place last term have been replaced with sycophants.\n\nEdit:typo",
                "So more jobs lost. Weren't we supposed to be improving unemployment under a healthy economy?",
                "https://www.project2025.observer/",
                "Why is Congress even debating passing a budget right now when Republicans seem to have decided that the President can do whatever the fuck he wants with the money regardless of what Congress approves into law?",
                "Republican voters:  “choke me harder daddy, make me drink, eat, and breathe toxins, anything you say daddy!”",
                "I don't understand why so many things are able to be undone. This is negating so many things Biden did/awarded etc. Organizations/States/Localities that were allocated these funds relied upon them to start this work just to have it yanked away.",
                "So destroy the environment, tank the flourishing Biden economy, ruin our National Parks, desecrate domestic education, foreign aid and assistance for  our allies under siege, fire essential workers for no cause and all to just give tax cuts to folks with Yachts that have smaller yachts attached to them. Oh and also make enemies out of our best friends by implementing the “stupidest tariffs of all time” according to conservative WSJ",
                "What a piece of shit government y’all elected. Pure evil. You should be fucking embarrassed.",
                "I know double-speak is a core tenant of fascism; but if they keep doing this, as they did in the first term, they eventually need to rename the Environmental PROTECTION Agency (EPA) to the Environmental DESTRUCTION Agency (EDA). Their moves are just no longer accurate to the department's name or purpose.\n\nIt'd be like continuing to call Burger King \"Burger King\" if they only served salads...",
                "Yeah man!!! Take that planet earth!! Get ready to once again taste the sweet-sweet poison by the corporate republicans will be pouring down your gullet. Also - America, get ready for the stunning and beautiful thick grey/gray clouds of repugnant smog. China will soon be in second place. Take that!!"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "German spy agency concluded COVID virus likely leaked from lab, papers say",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/german-spy-agency-concluded-covid-virus-likely-leaked-lab-papers-say-2025-03-12/",
            "upvotes": 178,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That virus appears to be a comical string of incompetence.\n\nThe city not informing the govt of the virus outbreak so they could have their yearly outdoor celebration in November 2019 was another part of that...\n\nGreat job.",
                "...and the crowd goes mild...",
                "Why even put this out, if it is low confidence?\n\n\nThe Vikings will win the superbowl next year.  \n\n\nEventhough I have low confidence with that declaration you should bet your life savings on it.",
                "I still think that “investigations” that claim it’s a lab leak are more concerned with politics than actually determining the source of the virus and how the reduce the possibility of another virus mutating and becoming a worldwide pandemic (essentially inevitable now).",
                "Cool that changes nothing. \n\nwould that knowledge have made anyone take it more seriously? \n\nwould right wingers across the country have accepted minor inconvenience in order to reduce the chance that their neighbor's grandma was going to die?",
                "Crazy how saying this back in 2021 would paint you as a wacko conspiracy theorist.",
                "Whatever happened to the Chinese protests that filled the streets and seemed never ending ?",
                "To the surprise of no one.",
                "How can we know that they are not just saying this as a facet of part of the greater political rivalry with China? The truth does not matter.",
                "there is no way lmaoooo this is like a fucking bond movie."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Cheating scandal shocks ski jumping, topples Olympic champions and shakes Norway's lofty reputation",
            "external_url": "https://apnews.com/article/ski-jumping-norway-cheating-scandal-fb1e88e41298a917f9d80406bfeb2bc0",
            "upvotes": 129,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Lolololol they made the crotches extra baggy so their crotch sail would make them fly farther. The honor of Norway is in tatters!",
                "Bulge claims yet another Olympic dream.",
                "Odd that it's crotch stuffing that has appararently toppled their 'lofty' reputation and not the fact that over half of their winter athletes claim to have asthma.",
                "TLDR: buffed bulge. Straight to jail.\n\n\"revealed in footage secretly filmed from behind a curtain then sent by a whistleblower to international media. A FIS official said the illegal alterations were only subsequently confirmed by tearing apart the seams of the crotch area on the offending Norwegian ski suits\"",
                ">Extra material in the same color had been inserted that added weight and helped to lower the material between an athlete’s legs as they took off into the flight phase. More surface area hitting the air helps add to flight time, Pertile said.\n\n>FIS previously said a 5% bigger surface area of a suit helps an athlete fly further, though the exact distance added is not known, Pertile said.\n\nTerrible...now let's make winged-suit ski jumping its own, amazing, Olympic event!",
                "High five if you also misread topples.",
                "Reminds me of when a e-bike motor was found in a bike tire at a race. 😝🫤😞",
                "Now do the cross country team",
                "This is nothing compared to the ones who eat beans before the competition, so they can propel themselves by farting.",
                "Oh no, cheating in competitive sports? I am shocked!! /s"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Mom missing for 6 days found alive stranded in car: 'She had given up hope'",
            "external_url": "https://abcnews.go.com/US/mom-missing-6-days-found-alive-stranded-car/story?id=119707268",
            "upvotes": 623,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/38739dbe-36b3-475e-afe1-de3c91bffbbc/rescue-ht-gmh-250312_1741782471865_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">She was stuck in the car and could not get out. But she was able to reach the water from the car, Caldwell said. The only way she was able to survive was using her hoodie and dipping it into the water in a ditch and sucking the water, or bringing the water into her mouth from the ditch.\n\nWow. What a strong and smart woman. It's shocking how often this happens.",
                ">Cassell had been trapped since Thursday night when she fell asleep at the wheel and veered off the road into a deep ditch under a bridge, according to her father, Delmar Caldwell.\n\nPlease don't drive tired. If you're sleepy, find a place to stop and make a phone call to someone to let them know where you stopped.",
                "So thankful someone found her in time. Something similar happened to my coworker’s husband some years ago. They were relocating to a new state for a job. Husband was the last to travel alone after closing up the old house. He was driving through a mountainous area and veered off the road. His car landed in a very wooded area many feet below the highway and not visible. He was pinned hanging upside down and could not get down or out of the car. Couldn’t reach the phone and the battery eventually died. Authorities were reluctant to do deep search because he had not been missing 24 hours. They said he could have stopped off to eat or rest. She reached out to friends and family and anyone who would help. They were able to narrow down the search area on the basis of his last conversation with his wife. The only reason they finally found him was a bright red dolly fell out of his truck during the accident and the handle was sticking out of a visible area. This is why you should always let someone know of your travel plans and check in once in a while and keep your phone charged.",
                "Johnny Martinez is the man who saw her from atop a large tractor. An incredible stroke of luck that he saw her and to quickly take action. What a hero.",
                "Years ago my mom and dad were volunteer EMTs in Indiana. They responded to a call of an accident found after several days in an overgrown ditch. The driver had maggots in his wounds but was alert. Occasionally, this happens in Indiana. ",
                ">\"She was stuck in the car and could not get out. But she was able to reach the water from the car,\".  \n    \nI wish they had more details, or even a picture. I’m trying to imagine the situation.",
                "\"Everybody that helped to find her and the volunteers and everything ... it was a wonderful miracle,\"  Good to hear some good news .",
                ">Vanderwall said Martinez could spot the car because he was driving a tall tractor.\n\n>\"I myself had traveled that road at least three to four times since she crashed and did not see her,\" Vanderwall noted.\n\nThat's some serious luck right there, or just fate.",
                "Whoa…Amazing how she improvised getting water in her system an effort to live",
                "Our phones track us and share our locations all the time. Is there no reason the phone company couldn't have shared her last known point with investigators?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Astronauts launching to space will finally relieve the pair who flew on Boeing's troubled capsule",
            "external_url": "https://www.nbcnews.com/science/space/astronauts-space-station-launch-nasa-boeing-return-rcna194880",
            "upvotes": 546,
            "date": "03/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250307-spacex-nasa-ISS-crew-10-mn-0905-582721.jpg",
            "top_comments": [
                "will “hopefully” relieve\n\nI have zero faith in any of these groups anymore.",
                "Standing by for what happens when they return to Earth. I expect Trump will brag he had to rescue them because Biden had stranded them on purpose. Now, when the decision was made for them to extend their stay and return the malfunctioning Boeing brick unmanned, it was stated at  that time they would return in March 2025.",
                "They're *still* up there?",
                "I cannot imagine anyone thinking space travel is a good idea with Trump in office and President Musk bulldozing our institutions.  What happens when NASA ceases to function, with no funding and no leadership, while these people are living in a failing structure miles from Earth?  \n\nYeah.  This sounds like a failure waiting to happen.",
                "Sure they will. Just like the dozen previous attempts would bring them home. And that's assuming that Emperor Musk doesn't order the mission sabotaged after the astronauts contradicted his statements about this whole shitshow (we know how much he love silencing critics and blowing up his own rockets, after all).",
                "These astronauts did not Boeing back to Earth. ",
                "With Space X being involved.... anyone else concerned about the whole, Space X launches keep exploding... issue?",
                "I just want to know the financial compensation",
                "Yeah, SpaceX is doing it. \n\nMeaning, in some way, shape, or form, Elson Mursk can take credit for this.",
                "This ain’t gonna go good. I hate to be a pessimist, but I have a *real* bad feeling about this!"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Brittany Holberg, inmate on Texas death row for 27 years, has her conviction tossed by federal appeals court",
            "external_url": "https://www.cbsnews.com/news/texas-death-row-brittany-holberg-conviction-reversed-federal-appeals-court/",
            "upvotes": 1378,
            "date": "03/12/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/12/539875d6-099e-4ff1-8391-45d7b4dfefe2/thumbnail/1200x630/7adcdd7a181df287d03ce5cf2b8ee9e6/texas-death-row-glwolrtwgaa8c3v.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "Holy hell. How do you recover from losing all that time. I’m sure Texas has some laws limiting restitution to some embarrassingly small amount.",
                "The conviction relied on the testimony of a jailhouse informant who recanted in 2011, but the Texas appeals court and the federal district court decided that this key testimony basically being a lie wasn't enough to overturn the conviction.",
                ">In securing her conviction in 1998, Randall County prosecutors heavily relied on testimony from a jail inmate who was working as a confidential informant for the City of Amarillo police. That informant recanted her testimony in 2011, but neither a Texas Court of Criminal Appeals or a federal district court found that prosecutors had violated Holberg’s constitutional right to a fair trial.\n\nSeems shady, but consider\n\n>During trial, Holberg asserted that she acted in self-defense and that she stabbed Towery because she feared for her life and sought to protect herself after he struck her on the back of the head and refused to relent.\n\n>“The jury was presented with graphic physical evidence that Holberg sadistically butchered a sick old man-with a lamp rammed down his throat as the coup de grâce,” Duncan wrote. “That evidence doomed Holberg’s self-defense theory and there is no chance that impeaching Kirkpatrick would have resurrected it.”\n\nSelf defense does not usually include having a lamp shoved down your throat. I’m inclined to not lean too heavily on that tainted testimony. Would I say it’s first degree murder? No. But it was murder, or manslaughter at the very least. Time served does seem appropriate.",
                "She was let off on a technicality. After reading the article, I really doubt she was actually innocent. How does a lamp get shoved down somebody's throat in self-defense?",
                "And imagine if at any time during those 27 years it was her turn. Disgusting. This is why the death penalty needs to be abolished",
                "Honestly I'm surprised anyone bothered to pay attention to a sex worker's case. Good for her.",
                "Exhibit ‘too many to count’ why I’ll never support death penalty",
                "I'm not inclined to believe any \"jailhouse confession\" revealed by another inmate. I'm supposed to believe that a person in jail decided to confess to a crime to someone they just met? And I'm supposed to believe this other person already in jail is somehow an honest person and should be believed; and that they're not getting some kind of benefit for their testimony? No thanks.\n\nWhat I don't understand is that in this case, the nature of the murder was clearly not completely self-defense. It seems like they could have gotten a conviction anyway, so I don't understand why they decided they needed this tainted testimony other than they wanted to get a death penalty conviction for personal reasons.",
                "I’m of two minds on this, there was definitely legal malpractice here and that should be rectified but I also don’t think she’s innocent.\n I don’t know what the right answer is but we can’t  have a system where the state ignores the rules because then were all in jeopardy.",
                "Idiot prosecution. Very unfortunate for her.\n\n\nBut killing a man and shoving a lamp down his throat? Can that really be self defense? He was probably unconscious when she lamped him. Why not just walk out when he is unconscious?"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "NEW",
            "title": "Trump administration halts $1 billion program that keeps aging affordable housing livable",
            "external_url": "https://apnews.com/article/trump-doge-affordable-housing-preservation-crisis-de27d7846271779157550fcec0a78ea6",
            "upvotes": 284,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Step 1:  let affordable housing degrade so badly that it becomes unlivable.\n\nStep 2:  come out and say how badly government is at maintaining such housing.\n\nStep 3:  evict everyone out of said housing because it is not livable.\n\nStep 4:  sell to private equity real estate firms for pennies on the dollar.\n\nStep 5:  convert to low-end apartments and charge a fortune for rent.",
                "Remember that cruelty is the point. Or, in the aims of Project 2025, to enshittify the infrastructure to the point that people clamor for private services to take over. And at that point private services will charge more for an inferior service.",
                "When the economy takes the nosedive its expected to, this bullshit austerity will hurt a whole lot more.",
                "Are groceries cheaper yet?",
                "One step closer to the populace rising up with violence.",
                "HUD is such a woefully underfunded and maligned Department as it is. And they’re hacking away at it. \n\nThey’re taking crumbs off a dude’s stale crust.",
                "We are going to be in an apocalyptic wasteland. MAGA will still be riding around with trump flags and still yelling about the (now all deceased/enslaved) liberals.",
                "Just a reminder, $1 billion is *nothing* compared to last year’s $1.83 trillion deficit. This is like saving $1 off your $183,000 student loan.",
                "But both parties are the same were repeatedly told. ",
                "You don't need affordable housing anymore in Trumps America. it will be replaced by government run camps where you're forced to work for a dollar a day at one of Musks factories."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "EPA terminates Biden-era climate grants worth $20 billion",
            "external_url": "https://apnews.com/article/epa-green-bank-zeldin-climate-trump-5168d11b7f63aeaf72001b50221c3c19",
            "upvotes": 1742,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "All the roadblocks that were in place last term have been replaced with sycophants.\n\nEdit:typo",
                "So more jobs lost. Weren't we supposed to be improving unemployment under a healthy economy?",
                "https://www.project2025.observer/",
                "Why is Congress even debating passing a budget right now when Republicans seem to have decided that the President can do whatever the fuck he wants with the money regardless of what Congress approves into law?",
                "Republican voters:  “choke me harder daddy, make me drink, eat, and breathe toxins, anything you say daddy!”",
                "I don't understand why so many things are able to be undone. This is negating so many things Biden did/awarded etc. Organizations/States/Localities that were allocated these funds relied upon them to start this work just to have it yanked away.",
                "So destroy the environment, tank the flourishing Biden economy, ruin our National Parks, desecrate domestic education, foreign aid and assistance for  our allies under siege, fire essential workers for no cause and all to just give tax cuts to folks with Yachts that have smaller yachts attached to them. Oh and also make enemies out of our best friends by implementing the “stupidest tariffs of all time” according to conservative WSJ",
                "What a piece of shit government y’all elected. Pure evil. You should be fucking embarrassed.",
                "I know double-speak is a core tenant of fascism; but if they keep doing this, as they did in the first term, they eventually need to rename the Environmental PROTECTION Agency (EPA) to the Environmental DESTRUCTION Agency (EDA). Their moves are just no longer accurate to the department's name or purpose.\n\nIt'd be like continuing to call Burger King \"Burger King\" if they only served salads...",
                "Yeah man!!! Take that planet earth!! Get ready to once again taste the sweet-sweet poison by the corporate republicans will be pouring down your gullet. Also - America, get ready for the stunning and beautiful thick grey/gray clouds of repugnant smog. China will soon be in second place. Take that!!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "French nuclear attack submarine docked in Halifax, Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/video/2025/03/12/french-nuclear-attack-submarine-docked-in-halifax/",
            "upvotes": 896,
            "date": "03/12/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/https%3A%2F%2Fd3g70guqh4mw9g.cloudfront.net%2F03-12-2025%2Ft_54fd9ebceea143a096852a37f7d34d41_name_11_ATL_SUBMARINE23_VO_frame_0.jpeg?smart=true&auth=83b21a885db7d00d504abfd54a754edecc941e240651702f0ed5f7f16dd08dda&width=1200&height=630",
            "top_comments": [
                "Excellent. \n\nPerhaps we could get British nuclear attack subs based here permanently since we are still a part of the Commonwealth.",
                "they definitely worded that headline in a very specific way to garner views, which is nothing new, but this seems to be a pretty extreme case. “Let’s use the public’s fear of a nuclear attack as a way to engage readers!” This is a standard operation for this submarine and it’s being used to further fuel fears of WW3. \n\n“Nuclear attack submarine” is not common terminology. “Nuclear-powered attack submarine” is typically the description. I know it’s pedantic but at a glance (which is how most folks read headlines), one could easily assume a nuclear attack had occurred in France.",
                "Halifax being about 600 km from St Pierre et Miquelon, a territorial overseas collectivity of France.",
                "Clearly a baguette class submarine",
                "THEY DO THIS EVERY YEAR!!! ignore the rage bait.",
                "Is an annoying French knight on board?",
                "I hope it stays there until trump is out of office",
                "And yet another repost. Awesome 👍",
                "I guess we’re doing star ocean 4’s intro instead of fallout.\n\n\nThe long term result is good, at least.\n\nStar ocean 4 intro:\n\nhttps://m.youtube.com/watch?v=OBAAqtJL8RM\n\n\n\nFallout 1 intro:\n\nhttps://m.youtube.com/watch?v=hG3uBgQmTnk",
                "Good. Now use it to fire on the US; Trump's going to attack sooner or later, so you might as well have the element of surprise and force him into WWIII before he's ready."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "EU retaliates against Trump's trade moves and slaps tariffs on produce from Republican states",
            "external_url": "https://www.cbc.ca/news/world/trump-europe-trade-retaliaton-1.7481215",
            "upvotes": 7187,
            "date": "03/12/2025",
            "thumbnail": "https://i.cbc.ca/1.5392012.1741773258!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/belfium-eu-green-deal.jpg?im=Resize%3D620",
            "top_comments": [
                "Just to be clear, the tariffs are on all US imports but happen to be hitting a number of red states.  Goods from blue states will be affected as well.  \n\n>The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson’s Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nVirginia has voted consistently blue in presidential elections and while the governor is Republican, the state house is Dem.  And yes I am aware of the NoVA-southern VA demographics but I doubt the EU cares whether Arlington voted for Trump or not.",
                "> The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson's Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nThe current administration is trying to bully our long-standing allies, and anyone in our country who doesn't comply with them. I'm not shocked the world is starting to fight back.",
                "The bourbon industry is not going to have a good time.  They weren't too happy when Canada took their products out of provincially controlled stores.",
                "Cut to 24 hours later when Trump puts a hold on the EU tariffs.",
                "I love the awareness abroad that these horrific policies are not the will of all Americans. Eff those red states!",
                "Please, all, may we have some more? Fuck the red states.",
                "As a blue stater that has paid for red state subsidies my whole life while they continuously attack all our liberties for no sane reason... we love you.",
                "I love that they're going after republican states the most. Punishing everyone in the country risks uniting more people behind trump. I get it can effect every state but the distinction is nice. Also, from a selfish standpoint, it's fucking amazing to not get lumped in with the smooth brain morons who voted for this traitor. I, as an American, support the hell out of these retaliatory measures.",
                "Heheh… take that Florida and Idaho and Iowa.",
                "I’d love it if California could create its own trade agreements with the EU. Not sure if that’s possible but if we can we should"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Astronauts launching to space will finally relieve the pair who flew on Boeing's troubled capsule",
            "external_url": "https://www.nbcnews.com/science/space/astronauts-space-station-launch-nasa-boeing-return-rcna194880",
            "upvotes": 546,
            "date": "03/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250307-spacex-nasa-ISS-crew-10-mn-0905-582721.jpg",
            "top_comments": [
                "will “hopefully” relieve\n\nI have zero faith in any of these groups anymore.",
                "Standing by for what happens when they return to Earth. I expect Trump will brag he had to rescue them because Biden had stranded them on purpose. Now, when the decision was made for them to extend their stay and return the malfunctioning Boeing brick unmanned, it was stated at  that time they would return in March 2025.",
                "They're *still* up there?",
                "I cannot imagine anyone thinking space travel is a good idea with Trump in office and President Musk bulldozing our institutions.  What happens when NASA ceases to function, with no funding and no leadership, while these people are living in a failing structure miles from Earth?  \n\nYeah.  This sounds like a failure waiting to happen.",
                "Sure they will. Just like the dozen previous attempts would bring them home. And that's assuming that Emperor Musk doesn't order the mission sabotaged after the astronauts contradicted his statements about this whole shitshow (we know how much he love silencing critics and blowing up his own rockets, after all).",
                "These astronauts did not Boeing back to Earth. ",
                "With Space X being involved.... anyone else concerned about the whole, Space X launches keep exploding... issue?",
                "I just want to know the financial compensation",
                "Yeah, SpaceX is doing it. \n\nMeaning, in some way, shape, or form, Elson Mursk can take credit for this.",
                "This ain’t gonna go good. I hate to be a pessimist, but I have a *real* bad feeling about this!"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Mom missing for 6 days found alive stranded in car: 'She had given up hope'",
            "external_url": "https://abcnews.go.com/US/mom-missing-6-days-found-alive-stranded-car/story?id=119707268",
            "upvotes": 623,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/38739dbe-36b3-475e-afe1-de3c91bffbbc/rescue-ht-gmh-250312_1741782471865_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">She was stuck in the car and could not get out. But she was able to reach the water from the car, Caldwell said. The only way she was able to survive was using her hoodie and dipping it into the water in a ditch and sucking the water, or bringing the water into her mouth from the ditch.\n\nWow. What a strong and smart woman. It's shocking how often this happens.",
                ">Cassell had been trapped since Thursday night when she fell asleep at the wheel and veered off the road into a deep ditch under a bridge, according to her father, Delmar Caldwell.\n\nPlease don't drive tired. If you're sleepy, find a place to stop and make a phone call to someone to let them know where you stopped.",
                "So thankful someone found her in time. Something similar happened to my coworker’s husband some years ago. They were relocating to a new state for a job. Husband was the last to travel alone after closing up the old house. He was driving through a mountainous area and veered off the road. His car landed in a very wooded area many feet below the highway and not visible. He was pinned hanging upside down and could not get down or out of the car. Couldn’t reach the phone and the battery eventually died. Authorities were reluctant to do deep search because he had not been missing 24 hours. They said he could have stopped off to eat or rest. She reached out to friends and family and anyone who would help. They were able to narrow down the search area on the basis of his last conversation with his wife. The only reason they finally found him was a bright red dolly fell out of his truck during the accident and the handle was sticking out of a visible area. This is why you should always let someone know of your travel plans and check in once in a while and keep your phone charged.",
                "Johnny Martinez is the man who saw her from atop a large tractor. An incredible stroke of luck that he saw her and to quickly take action. What a hero.",
                "Years ago my mom and dad were volunteer EMTs in Indiana. They responded to a call of an accident found after several days in an overgrown ditch. The driver had maggots in his wounds but was alert. Occasionally, this happens in Indiana. ",
                ">\"She was stuck in the car and could not get out. But she was able to reach the water from the car,\".  \n    \nI wish they had more details, or even a picture. I’m trying to imagine the situation.",
                "\"Everybody that helped to find her and the volunteers and everything ... it was a wonderful miracle,\"  Good to hear some good news .",
                ">Vanderwall said Martinez could spot the car because he was driving a tall tractor.\n\n>\"I myself had traveled that road at least three to four times since she crashed and did not see her,\" Vanderwall noted.\n\nThat's some serious luck right there, or just fate.",
                "Whoa…Amazing how she improvised getting water in her system an effort to live",
                "Our phones track us and share our locations all the time. Is there no reason the phone company couldn't have shared her last known point with investigators?"
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "German spy agency concluded COVID virus likely leaked from lab, papers say",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/german-spy-agency-concluded-covid-virus-likely-leaked-lab-papers-say-2025-03-12/",
            "upvotes": 176,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That virus appears to be a comical string of incompetence.\n\nThe city not informing the govt of the virus outbreak so they could have their yearly outdoor celebration in November 2019 was another part of that...\n\nGreat job.",
                "...and the crowd goes mild...",
                "Why even put this out, if it is low confidence?\n\n\nThe Vikings will win the superbowl next year.  \n\n\nEventhough I have low confidence with that declaration you should bet your life savings on it.",
                "I still think that “investigations” that claim it’s a lab leak are more concerned with politics than actually determining the source of the virus and how the reduce the possibility of another virus mutating and becoming a worldwide pandemic (essentially inevitable now).",
                "Cool that changes nothing. \n\nwould that knowledge have made anyone take it more seriously? \n\nwould right wingers across the country have accepted minor inconvenience in order to reduce the chance that their neighbor's grandma was going to die?",
                "Crazy how saying this back in 2021 would paint you as a wacko conspiracy theorist.",
                "Whatever happened to the Chinese protests that filled the streets and seemed never ending ?",
                "To the surprise of no one.",
                "How can we know that they are not just saying this as a facet of part of the greater political rivalry with China? The truth does not matter.",
                "there is no way lmaoooo this is like a fucking bond movie."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Oklahoma State Department of Health reports first 2 measles cases",
            "external_url": "https://www.kosu.org/health/2025-03-11/oklahoma-state-department-of-health-reports-first-two-measles-cases",
            "upvotes": 227,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oklahoma. Tornadoes, dust storms and now measles! Not to mention, flat as a board with no topography at all. Exciting state! ( This message brought to you by Oklahoma dept of tourism)",
                "Don't worry folks, they'll pray the measles away...",
                "According to RFk, we should all get measles. So this is all according to plan with this new administration",
                "I'm getting 2020 vibes\\*\n\n  \n^(\\*1 star, would not recommend..)",
                "Red states - 2\n\nBlue states - 0\n\nI have seen this movie before",
                "Idiocy is self regulating.",
                "Let's get some faith healers in here stat!"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Amazon rainforest cut down to build highway for COP climate summit",
            "external_url": "https://www.bbc.co.uk/news/articles/c9vy191rgn1o",
            "upvotes": 2594,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1c4d/live/c42f5a20-ff32-11ef-a8b1-950887ddc6e5.jpg",
            "top_comments": [
                "\"Scrutiny is growing over whether flying thousands of them across the world, and the infrastructure required to host them, is undermining the cause.\"\n\nNo shit.",
                "Genius idea. Absolutely flawless with the PR and optics on this one. \n\nAlmost if you could had this meeting, literally anywhere else with road access but no, let’s build a brand new road and destroy trees and the eco system.\n\nSome times I could swear people have their last two brain cells fighting it out for third place.",
                "I thought this was posted in r/nottheonion",
                "A road paved with irony.",
                "How do these people know when to inhale and exhale?",
                "Remind me why people can't just zoom or video call to these things? Why do they HAVE to be there physically?",
                "Just as bad when everyone flies their private jets to a climate summit and not just do a zoom meeting.",
                "🤦‍♂️We are speedrunning the demise of life on this planet",
                "Sacrifice and rules and laws and limits for the littles and the poors, for those on the 'commanding heights' only the most opulent consumption, destruction, waste and gluttony.  \n\nThere should be - but aren't - real karmic-level consequences and cost to this kind of hypocrisy and and betrayal for those who perpetrate it and those who profit from it.  \n\nMost of the actual agenda and action I see on 'climate change' and 'sustainability' is focused on profiting from it while consolidating power and wealth and resources.  \n\nShame and retribution!  ",
                "anytime I hear climate summit or like g20 meeting or paris accord or whatever...I just feel like taxpayers pay a bunch of douchebags to fly somewhere and waste their time and our money then do absolutely nothing."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Brittany Holberg, inmate on Texas death row for 27 years, has her conviction tossed by federal appeals court",
            "external_url": "https://www.cbsnews.com/news/texas-death-row-brittany-holberg-conviction-reversed-federal-appeals-court/",
            "upvotes": 1375,
            "date": "03/12/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/12/539875d6-099e-4ff1-8391-45d7b4dfefe2/thumbnail/1200x630/7adcdd7a181df287d03ce5cf2b8ee9e6/texas-death-row-glwolrtwgaa8c3v.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "Holy hell. How do you recover from losing all that time. I’m sure Texas has some laws limiting restitution to some embarrassingly small amount.",
                "The conviction relied on the testimony of a jailhouse informant who recanted in 2011, but the Texas appeals court and the federal district court decided that this key testimony basically being a lie wasn't enough to overturn the conviction.",
                ">In securing her conviction in 1998, Randall County prosecutors heavily relied on testimony from a jail inmate who was working as a confidential informant for the City of Amarillo police. That informant recanted her testimony in 2011, but neither a Texas Court of Criminal Appeals or a federal district court found that prosecutors had violated Holberg’s constitutional right to a fair trial.\n\nSeems shady, but consider\n\n>During trial, Holberg asserted that she acted in self-defense and that she stabbed Towery because she feared for her life and sought to protect herself after he struck her on the back of the head and refused to relent.\n\n>“The jury was presented with graphic physical evidence that Holberg sadistically butchered a sick old man-with a lamp rammed down his throat as the coup de grâce,” Duncan wrote. “That evidence doomed Holberg’s self-defense theory and there is no chance that impeaching Kirkpatrick would have resurrected it.”\n\nSelf defense does not usually include having a lamp shoved down your throat. I’m inclined to not lean too heavily on that tainted testimony. Would I say it’s first degree murder? No. But it was murder, or manslaughter at the very least. Time served does seem appropriate.",
                "She was let off on a technicality. After reading the article, I really doubt she was actually innocent. How does a lamp get shoved down somebody's throat in self-defense?",
                "And imagine if at any time during those 27 years it was her turn. Disgusting. This is why the death penalty needs to be abolished",
                "Honestly I'm surprised anyone bothered to pay attention to a sex worker's case. Good for her.",
                "Exhibit ‘too many to count’ why I’ll never support death penalty",
                "I'm not inclined to believe any \"jailhouse confession\" revealed by another inmate. I'm supposed to believe that a person in jail decided to confess to a crime to someone they just met? And I'm supposed to believe this other person already in jail is somehow an honest person and should be believed; and that they're not getting some kind of benefit for their testimony? No thanks.\n\nWhat I don't understand is that in this case, the nature of the murder was clearly not completely self-defense. It seems like they could have gotten a conviction anyway, so I don't understand why they decided they needed this tainted testimony other than they wanted to get a death penalty conviction for personal reasons.",
                "I’m of two minds on this, there was definitely legal malpractice here and that should be rectified but I also don’t think she’s innocent.\n I don’t know what the right answer is but we can’t  have a system where the state ignores the rules because then were all in jeopardy.",
                "Idiot prosecution. Very unfortunate for her.\n\n\nBut killing a man and shoving a lamp down his throat? Can that really be self defense? He was probably unconscious when she lamped him. Why not just walk out when he is unconscious?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US annual inflation rate in February remains relatively stable at 2.8%",
            "external_url": "https://www.theguardian.com/business/2025/mar/12/februrary-inflation-rate",
            "upvotes": 529,
            "date": "03/12/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e84a87963931440eadb434b71cd5fc183568b25d/0_63_6000_3599/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d1a602151fbbf6453ca3092e3248922f",
            "top_comments": [
                "Tariffs just got implemented today. I expect the next CPI report will show inflation ticking up.",
                "No one is buying anything in case the economy crashes.  With the tariffs no one is buying a car so inflation may not jump how we expect.",
                "March's report will be fun.",
                "Thank you, President Biden, for turning the economy around during your 4 years.",
                "The CPI comes from the Bureau of Labor Statistics. Shouldn't we be looking at any figures coming from a federal bureau with deep skepticism at this point?",
                "How long til they start cooking the books though?",
                "Lame street media hides the detail inside the article. “Relatively stable” in the headline. \n\nHeadline could have also said that inflation has dropped from the same time last year since that’s what the underlying article states.",
                "Any word on all the Republicans who gnashed their teeth for 4 years about how prices needed to be lowered back to what they were in 2019?",
                "I work for a company that does logistics and warehouse management globally. In a call with executives just yesterday we were told we're being asked by our customers if we can decrease our prices to help the increase in cost of operations they are seeing and they expect from tariffs. March and April will be ugly numbers-wise.",
                "The report also indicated that the current and future tariffs do not factor in to the February numbers."
            ],
            "aggregate_sentiment": 42.0
        }
    ],
    "last_updated": "03/12/2025 20:24:24 UTC"
}