{
    "posts": [
        {
            "category": "HOT",
            "title": "South Korean court overturns impeachment of Prime Minister Han, reinstating him as acting president",
            "external_url": "https://apnews.com/article/south-korea-impeachment-han-ducksoo-20daed0fb3c90c02ca229c977d230b06",
            "upvotes": 2720,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This guy isn't Yoon (The president who started the Martial Law Order), he is up for sentencing next. If he doesn't get impeached, then shit will go down.",
                "Context on the quorum bit, since AP doesn’t provide it - Korea’s national assembly has 300 seats. A simple majority is enough to impeach most officials, but a 2/3 majority is required to impeach the president. It was (and maybe still is) an open question what the requirement was to impeach an acting president - 151 because he is the prime minister, or 200 because he is (acting) president? Apparently some of the justices think it’s the latter, (edit) but it seems like the majority ruled that it’s 151.\n\nThis feels like it was the weakest of the cases, for what it’s worth. He was consistently saying he was against the martial law, and it seems like they failed to prove he was actually involved with it.",
                ">On Monday, seven of the court’s eight justices overturned or dismissed Han’s impeachment. They ruled the accusations against him weren’t against the law or weren’t serious enough to remove him from office or his impeachment motion didn’t even meet a required quorum when it passed through the assembly.\n\nNot having a quorum seems sketchy. The other parts of South Korean law, I can't comment on.",
                "The amount of people who are r/confidentlyincorrect here is astonishing...",
                "If you didn't read the article before commenting, you're part of the problem.",
                "Wow the world is going crazy",
                "Not the guy most people are assuming, but very interesting that the court can overturn an impeachment.",
                "This is misleading as most individuals are thinking of the South Korean president that tried to invoke an insurrection.",
                "TIL that South Korea has both a PM and a President",
                "Impeachment of Han was kinda sketchy so this isn't surprising at all."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "HOT",
            "title": "IRS braces for $500bn drop in revenue as taxpayers skip filings in wake of DOGE cuts",
            "external_url": "https://www.independent.co.uk/news/world/americas/us-politics/irs-doge-cuts-tax-filing-b2719911.html",
            "upvotes": 15586,
            "date": "03/23/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/20/20/26/Pictures-of-the-Week-Global-Photo-Gallery-e8cfpnw5.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "Simple tax returns are audited by computer.  It's the difficult returns that need analysis.  The rich will get away with more as intended.",
                "For anyone considering this - just be aware that the fines for not filing are quite high: “The failure-to-file penalty is usually 5% of the tax owed for each month your return is overdue, up to 25% of the bill.” ([IRS policy here](https://www.irs.gov/payments/failure-to-file-penalty))\n\nI’m not sure if they’ll have the staff to go after folks later but tax issues are known to pop up and bite you many years later. You may not hear anything for a decade and then suddenly get a bill.",
                "Tax accountant here - This is not for people who have simple returns with a W-2 or small Schedule C business.  This is for the complicated filers.  People using business loans from their pass-through S-Corp instead of having proper Officer wages.  People claiming losses without proper basis tracking.  People using shell companies to hide or officiate income sources.  People claiming improper foreign tax credits.\n\nNot your average Joe and Jane.  Enforcement is already at record lows for audits.  Now people will push harder and less ethical accountants will try to save their clients more money.  A lot of my industry revolves around people doing grey-area things getting their hands slapped every so often to remind them \"don't do that\".  As those stop, the more people will cheat and trim the edges.",
                "Republicans would be happy to starve to federal government and use that as an excuse to cut programs and services",
                "I feel like an idiot paying for estimated taxes",
                "Do they even have the resources to go after non-payers?",
                "So let's see\n\nWe have citizens saying we shouldn't pay taxes, we won't get caught. We have states saying we should withhold fed taxes if trump plays games with funding, especially in giver states. We have federal officials ignoring federal judges rulings because they thought they could ignore a verbal judgement (latest excuse) and illegally deporting people. We are dismantling the department of education. The president did a car advertisement for a ketamine addict at the white house. All of our allies are breaking off trade, opting for non american weapons and tech, and are issuing travel warnings to dissuade tourists from going to the US.\n\nIn short we have a major breakdown in both rule of law as well as respect for the federal government and democracy.\n\nIt has only been 60 days since Jan 20th.",
                "I decided if they are going to cut the Dept. of Education, I'm not going to worry about paying my DOE loans...seems fair.",
                ">\"New hires in taxpayer services and enforcement divisions have been targeted **and the agency has dropped investigations of high-value corporations and taxpayers**\"\n\nThat's the highlight of the article, That's the sole reason that people are angry and are writing about not paying taxes, not cause doge is 'cutting IRS jobs' or any of that other shit, Poor people are saying \"If those rich bastards ain't paying then neither am i\" and agree with the sentiment as a threat, obviously neglecting your taxes is not advisable in the long run, but do people have any other means to voice their opinions at the moment?",
                "We saved $50 million. It just cost $1 trillion."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Couple sentenced to hundreds of years in prison for forcing adopted Black children to work as 'slaves'",
            "external_url": "https://www.nbcnews.com/news/us-news/couple-sentenced-hundreds-years-forcing-black-children-work-slaves-rcna197533",
            "upvotes": 22843,
            "date": "03/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250319-west-virginia-abuse-mb-0743-4120e9.jpg",
            "top_comments": [
                "And then they tried to blame the real estate agent for not finding them a house secluded enough.\n\nHow can people be so evil.",
                "> Whitefeather apologized to the children during the sentencing.\n\"I just want the court to know that I have made mistakes I am very sorry for that and I love my children and I have never, ever, done anything to my ... children to harm them intentionally,” she said, according to WSAZ. “Children, I do love you.”\n\nImagine forcing children into slavery, locking them in sheds, and abusing them horribly. Keeping them dirty, cold, and hungry. Then trying to tell your victims you didn't hurt them, and you love them. Lying and manipulation from an absolute monster. I hope those kids get the best support and help they possibly can, they've been through hell. May they find some happiness while these two rot.",
                ">\"May God have mercy on your souls, because this court will not,” Circuit Court Judge Mary Claire Akers said...\n\nThat is a badass line.",
                "How many times must I ask WTF is wrong with people? How did this world just produce so many pieces of shit. Sigh.",
                "Meanwhile my wife and I can't adopt a kid because I'm a contractor and my job \"isn't stable enough\".\n\nFuck this timeline.",
                "Every time I see people who abuse children and teens in their care and someone chides me about doing foster care when I retire \"Are you SURE YOU could handle being a foster mom?\" \n\nAnd I think \"At least I'm not planning to abuse them as SLAVES and at worst mayne build them a savings account, feed and clothe them, tutor them, then help them go to college or join the military at 18?\"",
                "Meanwhile in pennsylvania... Two judges ran a scheme called Kids for Cash. They sentenced children, as young as eight, to for-profit prisons. For millions in kickbacks from the prisons. Crimes such as jaywalking, truancy, and petty theft. 2300 children. The judges went to jail. Briefly. They were disgracefully pardoned and are currently out enjoying their freedoms. Two tier justice.",
                "Please say 400 years....it'd be so...  appropriate",
                "*The oldest child told Whitefeather and Lantz in an impact statement that they were “monsters,” the news station reported.*\n\n*“I will be something amazing,” another child said. “I will be strong and beautiful. You will always be exactly what you are — horrible.”*\n\nI hope these children can heal and thrive. The absolute ghouls of humans (the parents) to even think of this as a valid idea.",
                "Sounds like they need to arrest the friend whose house the 5th kid was staying at, too."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "‘There's a pattern': Ukrainian man is 3rd to die in ICE custody at Krome Detention Center",
            "external_url": "https://www.nbcmiami.com/news/local/theres-a-pattern-ukrainian-man-is-3rd-to-die-in-ice-custody-at-krome-detention-center/3556811/",
            "upvotes": 7240,
            "date": "03/23/2025",
            "thumbnail": "https://media.nbcmiami.com/2019/09/Jail-Generic-Photo1.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Many people do not seem to appreciate the duty of care the State owes to those in its custody. The minimum expectation for someone in the custody of the State is that they stay alive.",
                "When people start dropping dead when in custody, there needs to be an investigation. People causing deaths needs to be prosecuted.",
                "MAGAs get their noses twisted out of joint when they are compared to Nazis for some reason. ThEy BrOkE tHe lAW! So does every speeder, but we don't send traffic violators to death camps.",
                "Why the hell was he turned over to ICE while on a valid visa and having not been convinced of a crime?!",
                "\"The wife of 44-year-old Maksym Chernyak, who spoke to NBC6 on condition of anonymity\"  \n\nHuh.",
                "Articles like this are exactly why the Trump administration is so desperate to ship its victims to El Salvador. El Salvador authorities are routinely enabled by Bukele-appointed judges to [deny information about prisoners](https://www.hrw.org/news/2024/10/15/el-salvador-experts-question-account-death-custody). [Hundreds of prisoners](https://www.nbcnews.com/news/world/el-salvadors-prisons-deaths-anti-gang-crackdown-rcna161327) have been killed in El Salvadoran custody under Bukele, and the details of prisoner deaths are often covered up. \n\nTrump wants to ship his enemies to El Salvador to die horrific deaths from torture, malnourishment, and abuse, while his [drug lord-loving](https://elfaro.net/en/202401/el_salvador/27225/salvadoran-government-conspired-with-gang-leader-to-recapture-lsquo-crook-rsquo-through-jalisco-cartel) fixer covers it all up.",
                "> The wife of 44-year-old Maksym Chernyak, who spoke to NBC6 on condition of anonymity, claims her husband did not suffer from any pre-existing medical condition. She alleges that he was not properly cared for at the Krome Detention Center when he started to feel sick.\n\n> Chernyak died on Feb. 20 at HCA Kendall Hospital in Miami while in ICE custody, according to the agency's website, which also notes that he was vomiting and having seizures. A doctor determined that the preliminary cause of death was a cerebral hemorrhage.\n\nIs this the new falling out of a window.",
                "From the article..\n\n> ..he was vomiting and having seizures. A doctor determined that the preliminary cause of death was a **cerebral hemorrhage**\n\nAccording to WebMD..\n\n> Head trauma. Injury is the most common cause of brain bleeds in people younger than age 50.\n\nIt’s not difficult to imagine that this man *may* have sustained head trauma at the hands of ICE goons. ",
                "Well well well it seems as if the death camps are already here now.",
                "Oh, it sure sounds like they have \"access to medical appointments and 24-hour emergency care. And At no time during detention is a detained illegal alien denied emergent care.\" apparently , yet the husband is transferred on Feb 18th and dies the 19th, and all they have to say is \"Vomiting, seizures, stroke, brain death.\" EVEN THOUGH THIS POOR POOR COUPLE WAS AUTHORIZED TO BE HERE?!?!? why was he sent in there!!? I barely fathom the heartbreak."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "For over a century, a U.S.-Canada cross-border library used a single entrance. Now, the U.S. says Canadians must build their own.",
            "external_url": "https://www.cbsnews.com/news/haskell-free-library-and-opera-house-canada-u-s-cross-border-separate-entrances/",
            "upvotes": 8255,
            "date": "03/23/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/21/8dc50eaf-f71f-4ef3-ad59-17cb4c44129b/thumbnail/1200x630/2e3602234428d190cf25e851d1a67bcd/gettyimages-646354910.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "They should start thinking about how they’re gonna build a road to Alaska",
                "\"drug smuggling\"\n\nWTF? \n\nYou'd have to be on drugs to think this library could or would be an effective drug smuggling route.  This is just animosity towards Canada for no logistical or logical reason other than to be ass.\n\nAnd to be honest this constant drug smuggling claim levied towards Canada makes me nervous, I get the distinct feeling trump wants a guns and boots conflict with Canada",
                ">A Department of Homeland Security spokesperson told Reuters that the U.S. decision was in response [to drug trafficking](https://www.cbsnews.com/news/trump-tariffs-canada-trade-fact-check/). \n\n>\"Drug traffickers and smugglers were exploiting the fact that Canadians could use the U.S. entrance without going through customs. We are ending such exploitation by criminals and protecting Americans,\" the statement said. \n\nSo you're telling me that they are trafficking drugs through a library? That's amazing.",
                "What I find most irritating about the MAGA government is just how petty they are. If they had a coherent plan and stuck to it it would be crap but at least understandable. But their actions are anything but coherent. They just seem to want to piss off as many people as they can.",
                "I think the US's canary died a while ago. At this point, it's just a bunch of toxic gas in this coal mine.",
                "Nice folks you have down there",
                "Such needless aggression and division.",
                "Trumpism is synonymous with pettiness and belligerence. Complete and utter assholes are running the United States now.",
                "Meanwhile, Alaska:  \nI’m sure they can survive on air freight alone, Berlin Airlift style.",
                "The same place that the Secretary of Homeland Security Kristi Noem childishly taunted Canadians at earlier in the month.\n\n[Kristi Noem Takes Bizarre Revenge on Canadians at Library She Used as a Stunt](https://www.yahoo.com/news/kristi-noem-takes-bizarre-revenge-194755346.html)"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Pa. fire chief charged after dropping baby, fracturing her skull",
            "external_url": "https://www.nbcphiladelphia.com/news/local/brian-salt-falls-township-fire-chief-arrested/4140937/",
            "upvotes": 3779,
            "date": "03/23/2025",
            "thumbnail": "https://media.nbcphiladelphia.com/2025/03/image-2025-03-21T210542.899.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "Not a great headline. Dropping would imply he lost control of her weight and accidentally let her fall to the ground. That would be tragic, but understandable since babies can often throw themselves unpredictably if you are not careful. I have two of my own and have had both of them attempt to yeet from my arms.\n\nNo, this guy THREW his 3-month-old daughter to the ground after pulling her roughly out of a swing, hard enough to crack her skull. Because she was crying. Fuck this guy! Straight to jail!",
                "He THREW his infant on the ground.  He didn't drop her.",
                "> It was divulged during that interview that he in fact had taken the child from what’s being described as a swing forcefully and then took the child out and then threw the child on the ground as being overly frustrated and child wouldn’t stop crying and was being very fussy at the time,\" Falls Township Police Detective Dennis O'Connell said.\n\nImagine the horror mom felt going to work, and then finding out her husband did this to their baby instead of caring for her.",
                "Do people not know that you can just put the baby in a crib and shut the door for a while if you can’t deal with a baby crying. \nIt’s that easy.",
                "Not all first responders are heroes.\n\nNot by a long shot.",
                ">Investigators said that Falls Township Fire Chief Brian Salt admitted to **intentionally letting his three-month-old daughter fall from his arms** and hitting her head on the ground on March 11.\n\nWhat the fuck kind of reporting is this. He *intentionally let* her fall?!",
                "Who wrote that headline? He threw his own 3 month old baby to the ground because the baby was \"fussy\". Being a fire chief has sweet fuck all to do with it. Jesus fucking keerist.",
                "Threw. He threw his own 3 month old. ",
                "Are NBC journalists and editors unaware of what “dropping” means and how that’s different from “throwing”?",
                "It doesnt mention in the article if the child lived or is okay"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Trump administration cuts legal help for migrant children traveling alone",
            "external_url": "https://apnews.com/article/trump-legal-aid-unaccompanied-children-immigration-court-127a69ce69573d2d16c72a74dacef3ab",
            "upvotes": 1302,
            "date": "03/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "He’ll send them to Children’s prison in Salvador",
                "Nothing says Jesus like cutting migrant children's legal help while traveling alone. What a fucken dumpster fire the US has become.",
                "Cruelty and hate is the *point*.\n\nThat is what the GOP and Trumpists live for. Cruelty and hate. Period.",
                "I just wish we could somehow get the word out that America is not the country you think it is and to stop trying to migrate there.",
                "Why do they have to be so evil?",
                "Migrant children should not be traveling alone. But i guess that is a different issue.\n\nCorrection. Children, migrant or not, should not be traveling alone. Period.",
                "The prolife party taking great care of children",
                "Protect the kids!!\n\nRight? \n\nOh...I forgot \n\nProtect* the kids \n\n\n\n*unless they are: \n\nGay \n\nTrans \n\nBlack \n\nBrown, \n\nHave foreign names \n\nHave hard to pronounce names \n\nSpeak different language \n\nHave bad opinions about the president \n\nfrom a different country \n\nHave a different worldview, or opinion \n\nParents voted democrat \n\nParents are liberals\n\nParents made donations to left causes \n\nParents have negative opinion of trump \n\n\nAnd many more reasons to come I'm sure",
                "I have a friend who worked in this department. They all got their pink slips. \n\nI remember during his first administration, she told me how she represented a toddler that the administration wanted to just deport back to wherever while the kid's parents were still being detained in the US.",
                "I'm ignorant on the subject. Why are migrant children traveling alone?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "IRS nearing agreement to use its data to help ICE locate undocumented migrants | CNN Politics",
            "external_url": "https://www.cnn.com/2025/03/23/politics/irs-ice-data-undocumented-immigrants/index.html",
            "upvotes": 1126,
            "date": "03/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-20t180531z-963080443-rc2hycask8jh-rtrmadp-3-usa-trump-irs.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Time to crack down on those damn tax-payers.",
                "So in the future when anyone says that it's safe to give your data because it won't be used for immigration enforcment, only an idiot would believe those assurances?",
                "This is going to be bad for the budget. Currently the fact that the IRS promises not to share data with immigration enforcement for people who voluntarily report taxes is responsible for almost $100b in revenue from people who can't claim most benefits of their tax dollars. Letting these people pay taxes benefits other taxpayers and breaking this trust just vindicates those who chose to hide their income.\n\nIt seems (numbers aren't forthcoming) that the administration never intended to follow through on its promise of targeting criminals first, because those engaging with the system in good faith (going to all their immigration/asylum hearings, paying their taxes, etc.) are easier to track down to pad the numbers.",
                "I cannot stress how horrifically stupid this decision is because at the end of the day, the IRS must be an apolitical agency to even function; the moment your tax statements can be used for political persecution of any kind, is a moment where the entire tax system collapses.\n\nNever mind the fact that illegal immigrants who pay into social security through fake identities are literally a net benefit to social security because they can't collect those benefits so its just a positive to the system (still messed up to be clear, but its the reality of our situation).\n\nThere's only one reason to do this sort of thing: to further the collapse of social security and sow immense distrust in the American taxation system for income tax. There's also the simpler fact that, due the nature of *how* illegal immigrants file their taxes, any attempt to scoop them up through the IRS data is going to scoop up a *lot* of US citizens that happen to \"fit the profile\" assuming they maintain their current \"move fast and break things\" attitude about civil rights.",
                "If they are illegal and paying taxes. Shouldn't they be going after their employers?",
                "So the assurances from the IRS they won't won't share information on your taxes with others no longer applies. If someone is a sex worker they better not report any earnings from tips since law enforcement could ask the IRS to voluntarily give information on people who received tips from possible sex work so that they can arrest them. A politician could request information from the IRS on people who have donated to a rival political organization in order to place these people on a political retaliation hit list.",
                "If the IRS has a file on them, how undocumented are they?",
                "Whoa I thought these \"illeguls\" were just freeloaders who didn't pay taxes! /S",
                "Trump promised repeatedly to deport tens of millions. Some rationalized it by saying he would only really go after the criminals. Turns out he’s going after the lowest hanging fruit, which is not criminals.",
                "See, they complained that illegal immigrants are stealing benefits and don't want to work. But they also will punish illegal immigrants who really do want to work or have been very successful. \n\nThe true offense, to them, is being brown and foreign born, not immigration status."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Mark Carney triggers federal election for Canada - National | Globalnews.ca",
            "external_url": "https://globalnews.ca/news/11094267/canada-election-2025-begins/",
            "upvotes": 1278,
            "date": "03/23/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/03/mark-carney-election_2b8ed5.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "The bots are out in force, saying that Mark Carney was not elected properly as prime minister.\n\nThis is perfectly acceptable — in Canada, like in the UK, we elect the PARTY not the Prime Minister. The party leader becomes prime minister.\n\nAdditional context.\n\nIn the UK, Rishi Sunak became Prime Minister after Liz Truss stepped down, and then stayed as Prime Minister from 2022-2024 — a total of two years of being an \"unelected\" Conservative PM.\n\nIn Canada, Brian Mulroney stepped down in 1993 and Kim Campbell became head of the Conservative party, and thus Prime Minister, in June 1993. She was an \"unelected\" Conservative PM until October 25, 1993 — a total of 132 days.\n\nMark Carney was sworn in as PM of Canada on March 14, and called an election 9 days later, on March 23. The election will take place on April 28. From March 14 to April 28, 2025, is 45 days. This was completely expected for him to do.\n\nUnlike what the disinfo bots are going to tell us, It is not a surprise election, and it is not a coup.",
                "As a dual citizen I love Canadian elections! In the U.S. they are now measured in years. Here they’re just a few weeks :)",
                "\\*Holds a finger up in the air\\*\n\nOh look it feels like a liberal wind blowing.\n\nGive Trump hell Canada!",
                "Hahah watching PPs address in the video in the article is both hilarious and painful to watch. Uses same phrasing as trump and even trips up by saying Carney and trump are in total “disagreement” and then tries to correct himself. Such a weak traitor. Make no mistake guys, a vote for PP is a vote for Trump and a vote against Canada.",
                "This is smart. It's not a given that the Liberal Party will maintain their momentum, so best to pull the trigger now, rather than in October.",
                "If he wins do you think he could make the US the eleventh province?",
                "The U.S. needs to ditch it’s “democracy in name only” and go to something similar to Canada’s.",
                "In coming crazy month in Canada",
                "So how long until PP complains the election is too early, after calling for an election for months and months?",
                "Why was P.Poilievre cut from every basketball team? Couldn't pivot."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Woman accused of killing her California fire captain wife captured in Mexico",
            "external_url": "https://www.nbcnews.com/news/us-news/woman-accused-killing-california-fire-captain-wife-captured-mexico-rcna193772",
            "upvotes": 3898,
            "date": "03/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250221-Rebecca-Marodi-ew-1110a-a7eed4.jpg",
            "top_comments": [
                "Wow she also killed her husband in 2000. Both stabbed to death.",
                ">In 2003, Yolanda Marodi pleaded guilty to voluntary manslaughter in the stabbing death of husband Jim Olejniczak in 2000, the station reported. She was released from custody a decade later.\n\n\n*Only to commit the same murder again.*",
                "Not blaming the victim but I don’t think I’d marry anyone convicted of killing their previous spouse…",
                "Man, that was a dizzy of a title. Let's play a game of \"where do we put a comma so it makes sense\".",
                "Why do we have a list for sex offenders but not murderers? They reoffend as well. I truly do not understand. She probably knew about her wife’s previous conviction but I just don’t understand why murderers are not on a registry as well?",
                "RIP. She didn't deserve this.",
                "Absolutely horrible. I hope they throw that monster under the jail.",
                "I can’t believe she’d do this. I figured when she killed her husband that she got it out of her system.",
                "Nothing says innocence like a fugitive run",
                "This Yolanda character sounds like a real jerk."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "South Korean court overturns impeachment of Prime Minister Han, reinstating him as acting president",
            "external_url": "https://apnews.com/article/south-korea-impeachment-han-ducksoo-20daed0fb3c90c02ca229c977d230b06",
            "upvotes": 2722,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This guy isn't Yoon (The president who started the Martial Law Order), he is up for sentencing next. If he doesn't get impeached, then shit will go down.",
                "Context on the quorum bit, since AP doesn’t provide it - Korea’s national assembly has 300 seats. A simple majority is enough to impeach most officials, but a 2/3 majority is required to impeach the president. It was (and maybe still is) an open question what the requirement was to impeach an acting president - 151 because he is the prime minister, or 200 because he is (acting) president? Apparently some of the justices think it’s the latter, (edit) but it seems like the majority ruled that it’s 151.\n\nThis feels like it was the weakest of the cases, for what it’s worth. He was consistently saying he was against the martial law, and it seems like they failed to prove he was actually involved with it.",
                ">On Monday, seven of the court’s eight justices overturned or dismissed Han’s impeachment. They ruled the accusations against him weren’t against the law or weren’t serious enough to remove him from office or his impeachment motion didn’t even meet a required quorum when it passed through the assembly.\n\nNot having a quorum seems sketchy. The other parts of South Korean law, I can't comment on.",
                "The amount of people who are r/confidentlyincorrect here is astonishing...",
                "If you didn't read the article before commenting, you're part of the problem.",
                "Wow the world is going crazy",
                "Not the guy most people are assuming, but very interesting that the court can overturn an impeachment.",
                "This is misleading as most individuals are thinking of the South Korean president that tried to invoke an insurrection.",
                "TIL that South Korea has both a PM and a President",
                "Impeachment of Han was kinda sketchy so this isn't surprising at all."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Customers mourn Silver Moon Bakery on Upper West Side, closing soon over lease dispute",
            "external_url": "https://gothamist.com/news/customers-mourn-silver-moon-bakery-on-upper-west-side-closing-soon-over-rent-dispute",
            "upvotes": 72,
            "date": "03/23/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350101/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "Mostly bad news for New Yorkers. This was an exceptionial bakery. But it shows what's happening all over with landlords raising even commercial rents over what the market can bear.",
                "New York City is basically only for lawyers, traders and bankers now. And there's still a shit ton of empty apartment buildings owned by Russians and Chinese",
                "Sorry for the people there who like that bakery, but this story doesn’t seem to belong in this sub.",
                "For me it was when the Second Avenue Deli (2nd Ave and 10th Street) closed bc they raised the lease. Sure that was more than 15 years ago but that was a one of a kind place. Copycats emerged but they were never close to being as good. I never really loved Katz's. Its good but no 2nd!",
                "[deleted]",
                "Upper west side of what? What am I reading?"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Trump administration cuts legal help for migrant children traveling alone",
            "external_url": "https://apnews.com/article/trump-legal-aid-unaccompanied-children-immigration-court-127a69ce69573d2d16c72a74dacef3ab",
            "upvotes": 1301,
            "date": "03/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "He’ll send them to Children’s prison in Salvador",
                "Nothing says Jesus like cutting migrant children's legal help while traveling alone. What a fucken dumpster fire the US has become.",
                "Cruelty and hate is the *point*.\n\nThat is what the GOP and Trumpists live for. Cruelty and hate. Period.",
                "I just wish we could somehow get the word out that America is not the country you think it is and to stop trying to migrate there.",
                "Why do they have to be so evil?",
                "Migrant children should not be traveling alone. But i guess that is a different issue.\n\nCorrection. Children, migrant or not, should not be traveling alone. Period.",
                "The prolife party taking great care of children",
                "Protect the kids!!\n\nRight? \n\nOh...I forgot \n\nProtect* the kids \n\n\n\n*unless they are: \n\nGay \n\nTrans \n\nBlack \n\nBrown, \n\nHave foreign names \n\nHave hard to pronounce names \n\nSpeak different language \n\nHave bad opinions about the president \n\nfrom a different country \n\nHave a different worldview, or opinion \n\nParents voted democrat \n\nParents are liberals\n\nParents made donations to left causes \n\nParents have negative opinion of trump \n\n\nAnd many more reasons to come I'm sure",
                "I have a friend who worked in this department. They all got their pink slips. \n\nI remember during his first administration, she told me how she represented a toddler that the administration wanted to just deport back to wherever while the kid's parents were still being detained in the US.",
                "I'm ignorant on the subject. Why are migrant children traveling alone?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "IRS nearing agreement to use its data to help ICE locate undocumented migrants | CNN Politics",
            "external_url": "https://www.cnn.com/2025/03/23/politics/irs-ice-data-undocumented-immigrants/index.html",
            "upvotes": 1128,
            "date": "03/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-20t180531z-963080443-rc2hycask8jh-rtrmadp-3-usa-trump-irs.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Time to crack down on those damn tax-payers.",
                "So in the future when anyone says that it's safe to give your data because it won't be used for immigration enforcment, only an idiot would believe those assurances?",
                "This is going to be bad for the budget. Currently the fact that the IRS promises not to share data with immigration enforcement for people who voluntarily report taxes is responsible for almost $100b in revenue from people who can't claim most benefits of their tax dollars. Letting these people pay taxes benefits other taxpayers and breaking this trust just vindicates those who chose to hide their income.\n\nIt seems (numbers aren't forthcoming) that the administration never intended to follow through on its promise of targeting criminals first, because those engaging with the system in good faith (going to all their immigration/asylum hearings, paying their taxes, etc.) are easier to track down to pad the numbers.",
                "I cannot stress how horrifically stupid this decision is because at the end of the day, the IRS must be an apolitical agency to even function; the moment your tax statements can be used for political persecution of any kind, is a moment where the entire tax system collapses.\n\nNever mind the fact that illegal immigrants who pay into social security through fake identities are literally a net benefit to social security because they can't collect those benefits so its just a positive to the system (still messed up to be clear, but its the reality of our situation).\n\nThere's only one reason to do this sort of thing: to further the collapse of social security and sow immense distrust in the American taxation system for income tax. There's also the simpler fact that, due the nature of *how* illegal immigrants file their taxes, any attempt to scoop them up through the IRS data is going to scoop up a *lot* of US citizens that happen to \"fit the profile\" assuming they maintain their current \"move fast and break things\" attitude about civil rights.",
                "If they are illegal and paying taxes. Shouldn't they be going after their employers?",
                "So the assurances from the IRS they won't won't share information on your taxes with others no longer applies. If someone is a sex worker they better not report any earnings from tips since law enforcement could ask the IRS to voluntarily give information on people who received tips from possible sex work so that they can arrest them. A politician could request information from the IRS on people who have donated to a rival political organization in order to place these people on a political retaliation hit list.",
                "If the IRS has a file on them, how undocumented are they?",
                "Whoa I thought these \"illeguls\" were just freeloaders who didn't pay taxes! /S",
                "Trump promised repeatedly to deport tens of millions. Some rationalized it by saying he would only really go after the criminals. Turns out he’s going after the lowest hanging fruit, which is not criminals.",
                "See, they complained that illegal immigrants are stealing benefits and don't want to work. But they also will punish illegal immigrants who really do want to work or have been very successful. \n\nThe true offense, to them, is being brown and foreign born, not immigration status."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "‘There's a pattern': Ukrainian man is 3rd to die in ICE custody at Krome Detention Center",
            "external_url": "https://www.nbcmiami.com/news/local/theres-a-pattern-ukrainian-man-is-3rd-to-die-in-ice-custody-at-krome-detention-center/3556811/",
            "upvotes": 7247,
            "date": "03/23/2025",
            "thumbnail": "https://media.nbcmiami.com/2019/09/Jail-Generic-Photo1.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Many people do not seem to appreciate the duty of care the State owes to those in its custody. The minimum expectation for someone in the custody of the State is that they stay alive.",
                "When people start dropping dead when in custody, there needs to be an investigation. People causing deaths needs to be prosecuted.",
                "MAGAs get their noses twisted out of joint when they are compared to Nazis for some reason. ThEy BrOkE tHe lAW! So does every speeder, but we don't send traffic violators to death camps.",
                "Why the hell was he turned over to ICE while on a valid visa and having not been convinced of a crime?!",
                "\"The wife of 44-year-old Maksym Chernyak, who spoke to NBC6 on condition of anonymity\"  \n\nHuh.",
                "Articles like this are exactly why the Trump administration is so desperate to ship its victims to El Salvador. El Salvador authorities are routinely enabled by Bukele-appointed judges to [deny information about prisoners](https://www.hrw.org/news/2024/10/15/el-salvador-experts-question-account-death-custody). [Hundreds of prisoners](https://www.nbcnews.com/news/world/el-salvadors-prisons-deaths-anti-gang-crackdown-rcna161327) have been killed in El Salvadoran custody under Bukele, and the details of prisoner deaths are often covered up. \n\nTrump wants to ship his enemies to El Salvador to die horrific deaths from torture, malnourishment, and abuse, while his [drug lord-loving](https://elfaro.net/en/202401/el_salvador/27225/salvadoran-government-conspired-with-gang-leader-to-recapture-lsquo-crook-rsquo-through-jalisco-cartel) fixer covers it all up.",
                "> The wife of 44-year-old Maksym Chernyak, who spoke to NBC6 on condition of anonymity, claims her husband did not suffer from any pre-existing medical condition. She alleges that he was not properly cared for at the Krome Detention Center when he started to feel sick.\n\n> Chernyak died on Feb. 20 at HCA Kendall Hospital in Miami while in ICE custody, according to the agency's website, which also notes that he was vomiting and having seizures. A doctor determined that the preliminary cause of death was a cerebral hemorrhage.\n\nIs this the new falling out of a window.",
                "From the article..\n\n> ..he was vomiting and having seizures. A doctor determined that the preliminary cause of death was a **cerebral hemorrhage**\n\nAccording to WebMD..\n\n> Head trauma. Injury is the most common cause of brain bleeds in people younger than age 50.\n\nIt’s not difficult to imagine that this man *may* have sustained head trauma at the hands of ICE goons. ",
                "Well well well it seems as if the death camps are already here now.",
                "Oh, it sure sounds like they have \"access to medical appointments and 24-hour emergency care. And At no time during detention is a detained illegal alien denied emergent care.\" apparently , yet the husband is transferred on Feb 18th and dies the 19th, and all they have to say is \"Vomiting, seizures, stroke, brain death.\" EVEN THOUGH THIS POOR POOR COUPLE WAS AUTHORIZED TO BE HERE?!?!? why was he sent in there!!? I barely fathom the heartbreak."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "IRS braces for $500bn drop in revenue as taxpayers skip filings in wake of DOGE cuts",
            "external_url": "https://www.independent.co.uk/news/world/americas/us-politics/irs-doge-cuts-tax-filing-b2719911.html",
            "upvotes": 15585,
            "date": "03/23/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/20/20/26/Pictures-of-the-Week-Global-Photo-Gallery-e8cfpnw5.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "Simple tax returns are audited by computer.  It's the difficult returns that need analysis.  The rich will get away with more as intended.",
                "For anyone considering this - just be aware that the fines for not filing are quite high: “The failure-to-file penalty is usually 5% of the tax owed for each month your return is overdue, up to 25% of the bill.” ([IRS policy here](https://www.irs.gov/payments/failure-to-file-penalty))\n\nI’m not sure if they’ll have the staff to go after folks later but tax issues are known to pop up and bite you many years later. You may not hear anything for a decade and then suddenly get a bill.",
                "Tax accountant here - This is not for people who have simple returns with a W-2 or small Schedule C business.  This is for the complicated filers.  People using business loans from their pass-through S-Corp instead of having proper Officer wages.  People claiming losses without proper basis tracking.  People using shell companies to hide or officiate income sources.  People claiming improper foreign tax credits.\n\nNot your average Joe and Jane.  Enforcement is already at record lows for audits.  Now people will push harder and less ethical accountants will try to save their clients more money.  A lot of my industry revolves around people doing grey-area things getting their hands slapped every so often to remind them \"don't do that\".  As those stop, the more people will cheat and trim the edges.",
                "Republicans would be happy to starve to federal government and use that as an excuse to cut programs and services",
                "I feel like an idiot paying for estimated taxes",
                "Do they even have the resources to go after non-payers?",
                "So let's see\n\nWe have citizens saying we shouldn't pay taxes, we won't get caught. We have states saying we should withhold fed taxes if trump plays games with funding, especially in giver states. We have federal officials ignoring federal judges rulings because they thought they could ignore a verbal judgement (latest excuse) and illegally deporting people. We are dismantling the department of education. The president did a car advertisement for a ketamine addict at the white house. All of our allies are breaking off trade, opting for non american weapons and tech, and are issuing travel warnings to dissuade tourists from going to the US.\n\nIn short we have a major breakdown in both rule of law as well as respect for the federal government and democracy.\n\nIt has only been 60 days since Jan 20th.",
                "I decided if they are going to cut the Dept. of Education, I'm not going to worry about paying my DOE loans...seems fair.",
                ">\"New hires in taxpayer services and enforcement divisions have been targeted **and the agency has dropped investigations of high-value corporations and taxpayers**\"\n\nThat's the highlight of the article, That's the sole reason that people are angry and are writing about not paying taxes, not cause doge is 'cutting IRS jobs' or any of that other shit, Poor people are saying \"If those rich bastards ain't paying then neither am i\" and agree with the sentiment as a threat, obviously neglecting your taxes is not advisable in the long run, but do people have any other means to voice their opinions at the moment?",
                "We saved $50 million. It just cost $1 trillion."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Mark Carney triggers federal election for Canada - National | Globalnews.ca",
            "external_url": "https://globalnews.ca/news/11094267/canada-election-2025-begins/",
            "upvotes": 1282,
            "date": "03/23/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/03/mark-carney-election_2b8ed5.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "The bots are out in force, saying that Mark Carney was not elected properly as prime minister.\n\nThis is perfectly acceptable — in Canada, like in the UK, we elect the PARTY not the Prime Minister. The party leader becomes prime minister.\n\nAdditional context.\n\nIn the UK, Rishi Sunak became Prime Minister after Liz Truss stepped down, and then stayed as Prime Minister from 2022-2024 — a total of two years of being an \"unelected\" Conservative PM.\n\nIn Canada, Brian Mulroney stepped down in 1993 and Kim Campbell became head of the Conservative party, and thus Prime Minister, in June 1993. She was an \"unelected\" Conservative PM until October 25, 1993 — a total of 132 days.\n\nMark Carney was sworn in as PM of Canada on March 14, and called an election 9 days later, on March 23. The election will take place on April 28. From March 14 to April 28, 2025, is 45 days. This was completely expected for him to do.\n\nUnlike what the disinfo bots are going to tell us, It is not a surprise election, and it is not a coup.",
                "As a dual citizen I love Canadian elections! In the U.S. they are now measured in years. Here they’re just a few weeks :)",
                "\\*Holds a finger up in the air\\*\n\nOh look it feels like a liberal wind blowing.\n\nGive Trump hell Canada!",
                "Hahah watching PPs address in the video in the article is both hilarious and painful to watch. Uses same phrasing as trump and even trips up by saying Carney and trump are in total “disagreement” and then tries to correct himself. Such a weak traitor. Make no mistake guys, a vote for PP is a vote for Trump and a vote against Canada.",
                "This is smart. It's not a given that the Liberal Party will maintain their momentum, so best to pull the trigger now, rather than in October.",
                "If he wins do you think he could make the US the eleventh province?",
                "The U.S. needs to ditch it’s “democracy in name only” and go to something similar to Canada’s.",
                "In coming crazy month in Canada",
                "So how long until PP complains the election is too early, after calling for an election for months and months?",
                "Why was P.Poilievre cut from every basketball team? Couldn't pivot."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Pa. fire chief charged after dropping baby, fracturing her skull",
            "external_url": "https://www.nbcphiladelphia.com/news/local/brian-salt-falls-township-fire-chief-arrested/4140937/",
            "upvotes": 3782,
            "date": "03/23/2025",
            "thumbnail": "https://media.nbcphiladelphia.com/2025/03/image-2025-03-21T210542.899.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "Not a great headline. Dropping would imply he lost control of her weight and accidentally let her fall to the ground. That would be tragic, but understandable since babies can often throw themselves unpredictably if you are not careful. I have two of my own and have had both of them attempt to yeet from my arms.\n\nNo, this guy THREW his 3-month-old daughter to the ground after pulling her roughly out of a swing, hard enough to crack her skull. Because she was crying. Fuck this guy! Straight to jail!",
                "He THREW his infant on the ground.  He didn't drop her.",
                "> It was divulged during that interview that he in fact had taken the child from what’s being described as a swing forcefully and then took the child out and then threw the child on the ground as being overly frustrated and child wouldn’t stop crying and was being very fussy at the time,\" Falls Township Police Detective Dennis O'Connell said.\n\nImagine the horror mom felt going to work, and then finding out her husband did this to their baby instead of caring for her.",
                "Do people not know that you can just put the baby in a crib and shut the door for a while if you can’t deal with a baby crying. \nIt’s that easy.",
                "Not all first responders are heroes.\n\nNot by a long shot.",
                ">Investigators said that Falls Township Fire Chief Brian Salt admitted to **intentionally letting his three-month-old daughter fall from his arms** and hitting her head on the ground on March 11.\n\nWhat the fuck kind of reporting is this. He *intentionally let* her fall?!",
                "Who wrote that headline? He threw his own 3 month old baby to the ground because the baby was \"fussy\". Being a fire chief has sweet fuck all to do with it. Jesus fucking keerist.",
                "Threw. He threw his own 3 month old. ",
                "Are NBC journalists and editors unaware of what “dropping” means and how that’s different from “throwing”?",
                "It doesnt mention in the article if the child lived or is okay"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Walk-in cooler fire causes smoke plume above France Pavilion at Disney World’s Epcot park",
            "external_url": "https://apnews.com/article/fire-epcot-disney-world-d9c94bf53dbca7357167b5f503352141",
            "upvotes": 300,
            "date": "03/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Did Disney elect a new Pope?",
                "Management has asked us to remind kitchen staff that only one employee may use the walk in for smoke break at a time. If everyone goes at once, accidents like this happen.",
                "As a refrigeration technician, I wonder if this system was using an A2L refrigerant. A2L's are mildly flammable. Keep in mind smaller refrigeration systems have been using propane as a refrigerant for a few years now.",
                "The French pavilion? Just tell the guests it's cigarette smoke.",
                "So who let Goofy cook.",
                "Used to work in this pavilion, those walk ins were dated 10 years ago. I can only imagine how bad they got by now. I remember one time I got trapped in one for an hour before someone came to look for me.",
                "A new line chef has been chosen",
                "Oh no, the grey stuff is black now",
                "Ironic... It could save others from heat, but not itself.",
                "Not very cool of them"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Colorado woman with dementia attacked, killed by daughter's sick dogs, police say; daughter charged",
            "external_url": "https://www.cbsnews.com/colorado/news/colorado-woman-dementia-attacked-killed-daughters-sick-dogs-police-say/",
            "upvotes": 1332,
            "date": "03/23/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/23/bbf3cd81-f120-4a7e-8ef7-098afa661e07/thumbnail/1200x630/5ffbd69d5d94ed235758a65de71714ad/dogs-attack-dementia-mom-jessica-hoff-arrested-from-pueblo-cnty-so-on-fb.png?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "Was wondering what sort of dog and then found out that she had like fifty dogs. So. Yeah. Absolutely some unhinged shit going on there.",
                "What in the entire fuck?\n50+ dogs?\nThat place smells like a waste landfill.",
                "TLDR: Animal hoarder 54 dogs at the property where mother was attacked some in really bad shape.",
                "I hate how this title is worded!",
                "I hate animal hoarders so much.",
                "It’s hoarding. I have a dog from a hoarder who had eighty dogs on his property, some found dead. My pup is eight now, took a year for her to adjust, but some dogs had to be euthanized. Hoarding is a mental illness. Thankfully the sick shit in my case went to jail for animal cruelty in pike county Ohio.",
                "Hopefully the daughter is charged and held accountable for this.",
                "Police found a total of 54 dogs, including about two dozen in the home where the attack allegedly occurred, and the rest at a second property she owned. Some of them were in poor health, according to investigators.\n\n\nWell sheeeeeet!!!",
                "The daughter is for sure an animal hoarder. They take terrible care of their animals. The hoarders show has all kinds of dead and dying animals on it. It’s really sad.",
                "We have 10 dogs currently and it’s a major work to keep them"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Trump administration cuts legal help for migrant children traveling alone",
            "external_url": "https://apnews.com/article/trump-legal-aid-unaccompanied-children-immigration-court-127a69ce69573d2d16c72a74dacef3ab",
            "upvotes": 1302,
            "date": "03/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "He’ll send them to Children’s prison in Salvador",
                "Nothing says Jesus like cutting migrant children's legal help while traveling alone. What a fucken dumpster fire the US has become.",
                "Cruelty and hate is the *point*.\n\nThat is what the GOP and Trumpists live for. Cruelty and hate. Period.",
                "I just wish we could somehow get the word out that America is not the country you think it is and to stop trying to migrate there.",
                "Why do they have to be so evil?",
                "Migrant children should not be traveling alone. But i guess that is a different issue.\n\nCorrection. Children, migrant or not, should not be traveling alone. Period.",
                "The prolife party taking great care of children",
                "Protect the kids!!\n\nRight? \n\nOh...I forgot \n\nProtect* the kids \n\n\n\n*unless they are: \n\nGay \n\nTrans \n\nBlack \n\nBrown, \n\nHave foreign names \n\nHave hard to pronounce names \n\nSpeak different language \n\nHave bad opinions about the president \n\nfrom a different country \n\nHave a different worldview, or opinion \n\nParents voted democrat \n\nParents are liberals\n\nParents made donations to left causes \n\nParents have negative opinion of trump \n\n\nAnd many more reasons to come I'm sure",
                "I have a friend who worked in this department. They all got their pink slips. \n\nI remember during his first administration, she told me how she represented a toddler that the administration wanted to just deport back to wherever while the kid's parents were still being detained in the US.",
                "I'm ignorant on the subject. Why are migrant children traveling alone?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "South Korean court overturns impeachment of Prime Minister Han, reinstating him as acting president",
            "external_url": "https://apnews.com/article/south-korea-impeachment-han-ducksoo-20daed0fb3c90c02ca229c977d230b06",
            "upvotes": 2724,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This guy isn't Yoon (The president who started the Martial Law Order), he is up for sentencing next. If he doesn't get impeached, then shit will go down.",
                "Context on the quorum bit, since AP doesn’t provide it - Korea’s national assembly has 300 seats. A simple majority is enough to impeach most officials, but a 2/3 majority is required to impeach the president. It was (and maybe still is) an open question what the requirement was to impeach an acting president - 151 because he is the prime minister, or 200 because he is (acting) president? Apparently some of the justices think it’s the latter, (edit) but it seems like the majority ruled that it’s 151.\n\nThis feels like it was the weakest of the cases, for what it’s worth. He was consistently saying he was against the martial law, and it seems like they failed to prove he was actually involved with it.",
                ">On Monday, seven of the court’s eight justices overturned or dismissed Han’s impeachment. They ruled the accusations against him weren’t against the law or weren’t serious enough to remove him from office or his impeachment motion didn’t even meet a required quorum when it passed through the assembly.\n\nNot having a quorum seems sketchy. The other parts of South Korean law, I can't comment on.",
                "The amount of people who are r/confidentlyincorrect here is astonishing...",
                "If you didn't read the article before commenting, you're part of the problem.",
                "Not the guy most people are assuming, but very interesting that the court can overturn an impeachment.",
                "Wow the world is going crazy",
                "This is misleading as most individuals are thinking of the South Korean president that tried to invoke an insurrection.",
                "TIL that South Korea has both a PM and a President",
                "Impeachment of Han was kinda sketchy so this isn't surprising at all."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "IRS braces for $500bn drop in revenue as taxpayers skip filings in wake of DOGE cuts",
            "external_url": "https://www.independent.co.uk/news/world/americas/us-politics/irs-doge-cuts-tax-filing-b2719911.html",
            "upvotes": 15585,
            "date": "03/23/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/20/20/26/Pictures-of-the-Week-Global-Photo-Gallery-e8cfpnw5.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "Simple tax returns are audited by computer.  It's the difficult returns that need analysis.  The rich will get away with more as intended.",
                "For anyone considering this - just be aware that the fines for not filing are quite high: “The failure-to-file penalty is usually 5% of the tax owed for each month your return is overdue, up to 25% of the bill.” ([IRS policy here](https://www.irs.gov/payments/failure-to-file-penalty))\n\nI’m not sure if they’ll have the staff to go after folks later but tax issues are known to pop up and bite you many years later. You may not hear anything for a decade and then suddenly get a bill.",
                "Tax accountant here - This is not for people who have simple returns with a W-2 or small Schedule C business.  This is for the complicated filers.  People using business loans from their pass-through S-Corp instead of having proper Officer wages.  People claiming losses without proper basis tracking.  People using shell companies to hide or officiate income sources.  People claiming improper foreign tax credits.\n\nNot your average Joe and Jane.  Enforcement is already at record lows for audits.  Now people will push harder and less ethical accountants will try to save their clients more money.  A lot of my industry revolves around people doing grey-area things getting their hands slapped every so often to remind them \"don't do that\".  As those stop, the more people will cheat and trim the edges.",
                "Republicans would be happy to starve to federal government and use that as an excuse to cut programs and services",
                "I feel like an idiot paying for estimated taxes",
                "Do they even have the resources to go after non-payers?",
                "So let's see\n\nWe have citizens saying we shouldn't pay taxes, we won't get caught. We have states saying we should withhold fed taxes if trump plays games with funding, especially in giver states. We have federal officials ignoring federal judges rulings because they thought they could ignore a verbal judgement (latest excuse) and illegally deporting people. We are dismantling the department of education. The president did a car advertisement for a ketamine addict at the white house. All of our allies are breaking off trade, opting for non american weapons and tech, and are issuing travel warnings to dissuade tourists from going to the US.\n\nIn short we have a major breakdown in both rule of law as well as respect for the federal government and democracy.\n\nIt has only been 60 days since Jan 20th.",
                "I decided if they are going to cut the Dept. of Education, I'm not going to worry about paying my DOE loans...seems fair.",
                ">\"New hires in taxpayer services and enforcement divisions have been targeted **and the agency has dropped investigations of high-value corporations and taxpayers**\"\n\nThat's the highlight of the article, That's the sole reason that people are angry and are writing about not paying taxes, not cause doge is 'cutting IRS jobs' or any of that other shit, Poor people are saying \"If those rich bastards ain't paying then neither am i\" and agree with the sentiment as a threat, obviously neglecting your taxes is not advisable in the long run, but do people have any other means to voice their opinions at the moment?",
                "We saved $50 million. It just cost $1 trillion."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Couple sentenced to hundreds of years in prison for forcing adopted Black children to work as 'slaves'",
            "external_url": "https://www.nbcnews.com/news/us-news/couple-sentenced-hundreds-years-forcing-black-children-work-slaves-rcna197533",
            "upvotes": 22846,
            "date": "03/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250319-west-virginia-abuse-mb-0743-4120e9.jpg",
            "top_comments": [
                "And then they tried to blame the real estate agent for not finding them a house secluded enough.\n\nHow can people be so evil.",
                "> Whitefeather apologized to the children during the sentencing.\n\"I just want the court to know that I have made mistakes I am very sorry for that and I love my children and I have never, ever, done anything to my ... children to harm them intentionally,” she said, according to WSAZ. “Children, I do love you.”\n\nImagine forcing children into slavery, locking them in sheds, and abusing them horribly. Keeping them dirty, cold, and hungry. Then trying to tell your victims you didn't hurt them, and you love them. Lying and manipulation from an absolute monster. I hope those kids get the best support and help they possibly can, they've been through hell. May they find some happiness while these two rot.",
                ">\"May God have mercy on your souls, because this court will not,” Circuit Court Judge Mary Claire Akers said...\n\nThat is a badass line.",
                "How many times must I ask WTF is wrong with people? How did this world just produce so many pieces of shit. Sigh.",
                "Meanwhile my wife and I can't adopt a kid because I'm a contractor and my job \"isn't stable enough\".\n\nFuck this timeline.",
                "Every time I see people who abuse children and teens in their care and someone chides me about doing foster care when I retire \"Are you SURE YOU could handle being a foster mom?\" \n\nAnd I think \"At least I'm not planning to abuse them as SLAVES and at worst mayne build them a savings account, feed and clothe them, tutor them, then help them go to college or join the military at 18?\"",
                "Meanwhile in pennsylvania... Two judges ran a scheme called Kids for Cash. They sentenced children, as young as eight, to for-profit prisons. For millions in kickbacks from the prisons. Crimes such as jaywalking, truancy, and petty theft. 2300 children. The judges went to jail. Briefly. They were disgracefully pardoned and are currently out enjoying their freedoms. Two tier justice.",
                "Please say 400 years....it'd be so...  appropriate",
                "*The oldest child told Whitefeather and Lantz in an impact statement that they were “monsters,” the news station reported.*\n\n*“I will be something amazing,” another child said. “I will be strong and beautiful. You will always be exactly what you are — horrible.”*\n\nI hope these children can heal and thrive. The absolute ghouls of humans (the parents) to even think of this as a valid idea.",
                "Sounds like they need to arrest the friend whose house the 5th kid was staying at, too."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "‘There's a pattern': Ukrainian man is 3rd to die in ICE custody at Krome Detention Center",
            "external_url": "https://www.nbcmiami.com/news/local/theres-a-pattern-ukrainian-man-is-3rd-to-die-in-ice-custody-at-krome-detention-center/3556811/",
            "upvotes": 7244,
            "date": "03/23/2025",
            "thumbnail": "https://media.nbcmiami.com/2019/09/Jail-Generic-Photo1.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Many people do not seem to appreciate the duty of care the State owes to those in its custody. The minimum expectation for someone in the custody of the State is that they stay alive.",
                "When people start dropping dead when in custody, there needs to be an investigation. People causing deaths needs to be prosecuted.",
                "MAGAs get their noses twisted out of joint when they are compared to Nazis for some reason. ThEy BrOkE tHe lAW! So does every speeder, but we don't send traffic violators to death camps.",
                "Why the hell was he turned over to ICE while on a valid visa and having not been convinced of a crime?!",
                "\"The wife of 44-year-old Maksym Chernyak, who spoke to NBC6 on condition of anonymity\"  \n\nHuh.",
                "Articles like this are exactly why the Trump administration is so desperate to ship its victims to El Salvador. El Salvador authorities are routinely enabled by Bukele-appointed judges to [deny information about prisoners](https://www.hrw.org/news/2024/10/15/el-salvador-experts-question-account-death-custody). [Hundreds of prisoners](https://www.nbcnews.com/news/world/el-salvadors-prisons-deaths-anti-gang-crackdown-rcna161327) have been killed in El Salvadoran custody under Bukele, and the details of prisoner deaths are often covered up. \n\nTrump wants to ship his enemies to El Salvador to die horrific deaths from torture, malnourishment, and abuse, while his [drug lord-loving](https://elfaro.net/en/202401/el_salvador/27225/salvadoran-government-conspired-with-gang-leader-to-recapture-lsquo-crook-rsquo-through-jalisco-cartel) fixer covers it all up.",
                "> The wife of 44-year-old Maksym Chernyak, who spoke to NBC6 on condition of anonymity, claims her husband did not suffer from any pre-existing medical condition. She alleges that he was not properly cared for at the Krome Detention Center when he started to feel sick.\n\n> Chernyak died on Feb. 20 at HCA Kendall Hospital in Miami while in ICE custody, according to the agency's website, which also notes that he was vomiting and having seizures. A doctor determined that the preliminary cause of death was a cerebral hemorrhage.\n\nIs this the new falling out of a window.",
                "From the article..\n\n> ..he was vomiting and having seizures. A doctor determined that the preliminary cause of death was a **cerebral hemorrhage**\n\nAccording to WebMD..\n\n> Head trauma. Injury is the most common cause of brain bleeds in people younger than age 50.\n\nIt’s not difficult to imagine that this man *may* have sustained head trauma at the hands of ICE goons. ",
                "Well well well it seems as if the death camps are already here now.",
                "Oh, it sure sounds like they have \"access to medical appointments and 24-hour emergency care. And At no time during detention is a detained illegal alien denied emergent care.\" apparently , yet the husband is transferred on Feb 18th and dies the 19th, and all they have to say is \"Vomiting, seizures, stroke, brain death.\" EVEN THOUGH THIS POOR POOR COUPLE WAS AUTHORIZED TO BE HERE?!?!? why was he sent in there!!? I barely fathom the heartbreak."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "For over a century, a U.S.-Canada cross-border library used a single entrance. Now, the U.S. says Canadians must build their own.",
            "external_url": "https://www.cbsnews.com/news/haskell-free-library-and-opera-house-canada-u-s-cross-border-separate-entrances/",
            "upvotes": 8248,
            "date": "03/23/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/21/8dc50eaf-f71f-4ef3-ad59-17cb4c44129b/thumbnail/1200x630/2e3602234428d190cf25e851d1a67bcd/gettyimages-646354910.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "They should start thinking about how they’re gonna build a road to Alaska",
                "\"drug smuggling\"\n\nWTF? \n\nYou'd have to be on drugs to think this library could or would be an effective drug smuggling route.  This is just animosity towards Canada for no logistical or logical reason other than to be ass.\n\nAnd to be honest this constant drug smuggling claim levied towards Canada makes me nervous, I get the distinct feeling trump wants a guns and boots conflict with Canada",
                ">A Department of Homeland Security spokesperson told Reuters that the U.S. decision was in response [to drug trafficking](https://www.cbsnews.com/news/trump-tariffs-canada-trade-fact-check/). \n\n>\"Drug traffickers and smugglers were exploiting the fact that Canadians could use the U.S. entrance without going through customs. We are ending such exploitation by criminals and protecting Americans,\" the statement said. \n\nSo you're telling me that they are trafficking drugs through a library? That's amazing.",
                "What I find most irritating about the MAGA government is just how petty they are. If they had a coherent plan and stuck to it it would be crap but at least understandable. But their actions are anything but coherent. They just seem to want to piss off as many people as they can.",
                "I think the US's canary died a while ago. At this point, it's just a bunch of toxic gas in this coal mine.",
                "Nice folks you have down there",
                "Such needless aggression and division.",
                "Trumpism is synonymous with pettiness and belligerence. Complete and utter assholes are running the United States now.",
                "Meanwhile, Alaska:  \nI’m sure they can survive on air freight alone, Berlin Airlift style.",
                "The same place that the Secretary of Homeland Security Kristi Noem childishly taunted Canadians at earlier in the month.\n\n[Kristi Noem Takes Bizarre Revenge on Canadians at Library She Used as a Stunt](https://www.yahoo.com/news/kristi-noem-takes-bizarre-revenge-194755346.html)"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Pa. fire chief charged after dropping baby, fracturing her skull",
            "external_url": "https://www.nbcphiladelphia.com/news/local/brian-salt-falls-township-fire-chief-arrested/4140937/",
            "upvotes": 3773,
            "date": "03/23/2025",
            "thumbnail": "https://media.nbcphiladelphia.com/2025/03/image-2025-03-21T210542.899.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "Not a great headline. Dropping would imply he lost control of her weight and accidentally let her fall to the ground. That would be tragic, but understandable since babies can often throw themselves unpredictably if you are not careful. I have two of my own and have had both of them attempt to yeet from my arms.\n\nNo, this guy THREW his 3-month-old daughter to the ground after pulling her roughly out of a swing, hard enough to crack her skull. Because she was crying. Fuck this guy! Straight to jail!",
                "He THREW his infant on the ground.  He didn't drop her.",
                "> It was divulged during that interview that he in fact had taken the child from what’s being described as a swing forcefully and then took the child out and then threw the child on the ground as being overly frustrated and child wouldn’t stop crying and was being very fussy at the time,\" Falls Township Police Detective Dennis O'Connell said.\n\nImagine the horror mom felt going to work, and then finding out her husband did this to their baby instead of caring for her.",
                "Do people not know that you can just put the baby in a crib and shut the door for a while if you can’t deal with a baby crying. \nIt’s that easy.",
                "Not all first responders are heroes.\n\nNot by a long shot.",
                ">Investigators said that Falls Township Fire Chief Brian Salt admitted to **intentionally letting his three-month-old daughter fall from his arms** and hitting her head on the ground on March 11.\n\nWhat the fuck kind of reporting is this. He *intentionally let* her fall?!",
                "Who wrote that headline? He threw his own 3 month old baby to the ground because the baby was \"fussy\". Being a fire chief has sweet fuck all to do with it. Jesus fucking keerist.",
                "Threw. He threw his own 3 month old. ",
                "Are NBC journalists and editors unaware of what “dropping” means and how that’s different from “throwing”?",
                "It doesnt mention in the article if the child lived or is okay"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "IRS nearing agreement to use its data to help ICE locate undocumented migrants | CNN Politics",
            "external_url": "https://www.cnn.com/2025/03/23/politics/irs-ice-data-undocumented-immigrants/index.html",
            "upvotes": 1123,
            "date": "03/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-20t180531z-963080443-rc2hycask8jh-rtrmadp-3-usa-trump-irs.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Time to crack down on those damn tax-payers.",
                "So in the future when anyone says that it's safe to give your data because it won't be used for immigration enforcment, only an idiot would believe those assurances?",
                "This is going to be bad for the budget. Currently the fact that the IRS promises not to share data with immigration enforcement for people who voluntarily report taxes is responsible for almost $100b in revenue from people who can't claim most benefits of their tax dollars. Letting these people pay taxes benefits other taxpayers and breaking this trust just vindicates those who chose to hide their income.\n\nIt seems (numbers aren't forthcoming) that the administration never intended to follow through on its promise of targeting criminals first, because those engaging with the system in good faith (going to all their immigration/asylum hearings, paying their taxes, etc.) are easier to track down to pad the numbers.",
                "I cannot stress how horrifically stupid this decision is because at the end of the day, the IRS must be an apolitical agency to even function; the moment your tax statements can be used for political persecution of any kind, is a moment where the entire tax system collapses.\n\nNever mind the fact that illegal immigrants who pay into social security through fake identities are literally a net benefit to social security because they can't collect those benefits so its just a positive to the system (still messed up to be clear, but its the reality of our situation).\n\nThere's only one reason to do this sort of thing: to further the collapse of social security and sow immense distrust in the American taxation system for income tax. There's also the simpler fact that, due the nature of *how* illegal immigrants file their taxes, any attempt to scoop them up through the IRS data is going to scoop up a *lot* of US citizens that happen to \"fit the profile\" assuming they maintain their current \"move fast and break things\" attitude about civil rights.",
                "If they are illegal and paying taxes. Shouldn't they be going after their employers?",
                "So the assurances from the IRS they won't won't share information on your taxes with others no longer applies. If someone is a sex worker they better not report any earnings from tips since law enforcement could ask the IRS to voluntarily give information on people who received tips from possible sex work so that they can arrest them. A politician could request information from the IRS on people who have donated to a rival political organization in order to place these people on a political retaliation hit list.",
                "If the IRS has a file on them, how undocumented are they?",
                "Whoa I thought these \"illeguls\" were just freeloaders who didn't pay taxes! /S",
                "Trump promised repeatedly to deport tens of millions. Some rationalized it by saying he would only really go after the criminals. Turns out he’s going after the lowest hanging fruit, which is not criminals.",
                "See, they complained that illegal immigrants are stealing benefits and don't want to work. But they also will punish illegal immigrants who really do want to work or have been very successful. \n\nThe true offense, to them, is being brown and foreign born, not immigration status."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Mark Carney triggers federal election for Canada - National | Globalnews.ca",
            "external_url": "https://globalnews.ca/news/11094267/canada-election-2025-begins/",
            "upvotes": 1277,
            "date": "03/23/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/03/mark-carney-election_2b8ed5.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "The bots are out in force, saying that Mark Carney was not elected properly as prime minister.\n\nThis is perfectly acceptable — in Canada, like in the UK, we elect the PARTY not the Prime Minister. The party leader becomes prime minister.\n\nAdditional context.\n\nIn the UK, Rishi Sunak became Prime Minister after Liz Truss stepped down, and then stayed as Prime Minister from 2022-2024 — a total of two years of being an \"unelected\" Conservative PM.\n\nIn Canada, Brian Mulroney stepped down in 1993 and Kim Campbell became head of the Conservative party, and thus Prime Minister, in June 1993. She was an \"unelected\" Conservative PM until October 25, 1993 — a total of 132 days.\n\nMark Carney was sworn in as PM of Canada on March 14, and called an election 9 days later, on March 23. The election will take place on April 28. From March 14 to April 28, 2025, is 45 days. This was completely expected for him to do.\n\nUnlike what the disinfo bots are going to tell us, It is not a surprise election, and it is not a coup.",
                "As a dual citizen I love Canadian elections! In the U.S. they are now measured in years. Here they’re just a few weeks :)",
                "\\*Holds a finger up in the air\\*\n\nOh look it feels like a liberal wind blowing.\n\nGive Trump hell Canada!",
                "Hahah watching PPs address in the video in the article is both hilarious and painful to watch. Uses same phrasing as trump and even trips up by saying Carney and trump are in total “disagreement” and then tries to correct himself. Such a weak traitor. Make no mistake guys, a vote for PP is a vote for Trump and a vote against Canada.",
                "This is smart. It's not a given that the Liberal Party will maintain their momentum, so best to pull the trigger now, rather than in October.",
                "If he wins do you think he could make the US the eleventh province?",
                "The U.S. needs to ditch it’s “democracy in name only” and go to something similar to Canada’s.",
                "In coming crazy month in Canada",
                "So how long until PP complains the election is too early, after calling for an election for months and months?",
                "Why was P.Poilievre cut from every basketball team? Couldn't pivot."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Woman accused of killing her California fire captain wife captured in Mexico",
            "external_url": "https://www.nbcnews.com/news/us-news/woman-accused-killing-california-fire-captain-wife-captured-mexico-rcna193772",
            "upvotes": 3899,
            "date": "03/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250221-Rebecca-Marodi-ew-1110a-a7eed4.jpg",
            "top_comments": [
                "Wow she also killed her husband in 2000. Both stabbed to death.",
                ">In 2003, Yolanda Marodi pleaded guilty to voluntary manslaughter in the stabbing death of husband Jim Olejniczak in 2000, the station reported. She was released from custody a decade later.\n\n\n*Only to commit the same murder again.*",
                "Not blaming the victim but I don’t think I’d marry anyone convicted of killing their previous spouse…",
                "Man, that was a dizzy of a title. Let's play a game of \"where do we put a comma so it makes sense\".",
                "Why do we have a list for sex offenders but not murderers? They reoffend as well. I truly do not understand. She probably knew about her wife’s previous conviction but I just don’t understand why murderers are not on a registry as well?",
                "RIP. She didn't deserve this.",
                "Absolutely horrible. I hope they throw that monster under the jail.",
                "I can’t believe she’d do this. I figured when she killed her husband that she got it out of her system.",
                "Nothing says innocence like a fugitive run",
                "This Yolanda character sounds like a real jerk."
            ],
            "aggregate_sentiment": 14.0
        }
    ],
    "last_updated": "03/24/2025 08:12:31 UTC"
}