{
    "posts": [
        {
            "category": "HOT",
            "title": "Rejected at her door, ICE nabs a Maryland woman in her car after smashing her window",
            "external_url": "https://www.thebaltimorebanner.com/community/local-news/video-ice-arrest-wesminster-elsy-noemi-berrios-QJ7CIME76ZGPZEBW5C3REEPZ6E/",
            "upvotes": 10943,
            "date": "04/10/2025",
            "thumbnail": "https://www.thebaltimorebanner.com/resizer/v2/5IW27W3VKBHKBIUARZZRHZYYJI.jpg?auth=bc1d934ab8edc7efbfbb8726ad05f705954e34e4697fc5de01ed8c7d8c9d0c3f&width=900&smart=true&quality=85",
            "top_comments": [
                "Call me paranoid but wouldn't something like this be a kidnapper and trafficker's wet dream? Being able to just snatch a person off the street, claim you're government and they're illegal. Then whisk them away to some undisclosed location where both them and you would be impossible to track because there's no oversight whatsoever.",
                "I'm still amazed how there seems to be multitude of people in law-enforcement who were just waiting for the moment they could turn against their neighbours.",
                "I'm a little surprised nobody's shot an ICE agent yet.",
                "And how we burned in the camps later, thinking: What would things have been like if every Security operative, when he went out at night to make an arrest, had been uncertain whether he would return alive and had to say good-bye to his family? Or if, during periods of mass arrests, as for example in Leningrad, when they arrested a quarter of the entire city, people had not simply sat there in their lairs, paling with terror at every bang of the downstairs door and at every step on the staircase, but had understood they had nothing left to lose and had boldly set up in the downstairs hall an ambush of half a dozen people with axes, hammers, pokers, or whatever else was at hand?... The Organs would very quickly have suffered a shortage of officers and transport and, notwithstanding all of Stalin's thirst, the cursed machine would have ground to a halt! If...if...We didn't love freedom enough. And even more – we had no awareness of the real situation.... We purely and simply deserved everything that happened afterward.\n\n\n\n\nAleksandr I. Solzhenitsyn , The Gulag Archipelago 1918–1956",
                "Just call em what they are, the fucking modern American gestapo. Nazi punks can fuck off.",
                "Jesus Christ that ski mask makes him look like a common thug",
                "Bunch of fucking terrorists.\n\n Can you imagine how it feels being a legal green card holder in this country right now?\n\n When they are done going after the Hispanics , and the Muslims, what religion/nationality will be next?? Eventually it will be you.",
                "I always said that they would go for the low hanging fruit to meet their targets. Law abiding brown people are easy to identify and target.",
                "I can see people turning on specifically ICE here in the next few months. It'll go from judges locking them up to people outright engaging them in combat.",
                "Apparently, according to ICE, if you are fleeing from a gang to come to America, because you believe your life is in danger,  then technically you are associated with a gang.\n\nI maybe am being a bit sarcastic with the above statement, but I would not be surprised if that IS the logic, or something like it, that is being used to round up grandparents, and others who have no connection whatsoever to gang-activity, other than they were trying to escape their home, and come here to avoid being killed."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Dramatic sell-off of US government bonds as tariff war panic deepens | Bonds",
            "external_url": "https://www.theguardian.com/business/2025/apr/09/dramatic-sell-off-of-us-government-bonds-as-tariff-war-panic-deepens",
            "upvotes": 6127,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a2f63b4a2b6881319e7daba96702e5b867fa7474/0_261_7837_4703/master/7837.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8e6ad02d29bd98f16e70bf59bab06db6",
            "top_comments": [
                "imagine starting a tariff war as a bluff and destroying the basis of your economy (for over 100 years) in one go.",
                "I’ve been thinking about this really old Reddit comment from 10 years ago about what to do if you win the lottery. \n\nhttps://www.reddit.com/r/AskReddit/s/RshgA8abNn\n\nParticularly these passages:\n\n> Right now, you’ll get around 3.5% on the 10 year U.S. treasury. With $18.2 million (20% of $91.2 mil after your absurdly generous family gift) invested in those you will pull down $638,400 per year. If everything else blows up, you still have that, and you will be in the top 1% of income in the United States. So how about you not fuck with it. Eh? And that’s income that is damn safe. **If we get to the point where the United States defaults on those instruments, we are in far worse shape than worrying about money.**\n\n> If you are really paranoid, you might consider picking another G7 or otherwise mainstream country other than the U.S. according to where you want to live **if the United States dissolves into anarchy or Britney Spears is elected to the United States Senate.**\n\n> You have provided for your family beyond your wildest dreams. And you still have $36.4 million in “cash.” You know you will be getting $638,400 per year **unless the capital building is burning**",
                "Didn’t Trump pussy out of his tariffs because of the bond sell off?",
                "Who’d thought there’d be consequences for dramatically changing policy multiple times over the last two months with little rhyme or reason?!",
                "The stock indices rebounding are more smoke and mirrors than anything and reflect terrible policy and reversal with this 90 day reprieve. But the capriciousness of this debacle will continue to destabilize markets. Bottom line is the US economy has suffered irreparable harm with countries no longer wanting to buy our debt as a result. This is the lasting impact not one day of stock market bounce back.",
                "Trump's **Seventh** bankruptcy...",
                "Why would any reasonable nation trust this demented ogre of a narcissist",
                "Hey that's a thing my money is based off of!\n\n\nSure am glad this will cost me nothing!",
                ">“I could stand in the middle of Fifth Avenue and shoot somebody, and I wouldn’t lose any voters, OK?”\n\nOnce you’ve normalized Corruption and don’t fear any consequences from anyone. It’s inevitable that you’ll push the envelope and take advantage of the opportunities. A simple phone call to your family and acquaintances letting them in on your thoughts, and millions are in play. So raise your hand if you think there were questionable if downright corrupt actions taken prior to his announcement. If I don’t see a sea of hands raised, I have a Bridge to Nowhere for sale.",
                "So let me get this straight.\n\nWhat returned confidence to the markets is that Trump wasn't going to implement the tariffs; it was all just a market manipulation?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Elon Musk’s xAI powering its facility in Memphis with ‘illegal’ generators",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/09/elon-musk-xai-memphis",
            "upvotes": 992,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1de7b9823a50c8556a5bbbf321475f37f23f0a1d/0_200_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3e836e9ed9df4c53d833c4600e85acf5",
            "top_comments": [
                "It's okay.\n\nfElon is just going to buy more Carbon Tax credits from this Tesla company so they can just approve the permits!",
                "Once you become an oligarch, legality is a mere inconvenience and laws are polite suggestions!\n\nIn this particular scenario, DOGE will perhaps  identify some relevant government organizations that are in an urgent need for \"efficiency improvements\".",
                "Musk himself is “illegal” can’t stand the sight of him",
                "The rich get richer, the poor get cancer",
                "Tennessee politicians already opening their hands for the \"donations\" needed to allow this to become legalized",
                "Has Elon even doing anything that's legal?\n\nHe's making poor quality vehicles\n\nHis SpaceX has had lot of crashes\n\nHis Twitter is shit\n\nHis own DOGE is not showing proofs of what government waste is deleted\n\nHe is a shit gamer\n\nHe is a shit father to all.\n\nDoesn't pay child support.\n\nHas openly supported \"Nazis\"\n\nHow is he STILL after all this, is not in jail?",
                ">“I’m here because today we’ve learned that xAI is using 35 methane gas burning turbines,” said Pearson, who is the director of the advocacy group Memphis Community Against Pollution. “They have submitted a permit to our Shelby county health department for 15, yet they are using double that amount with no permit.”\n\nI applaud this activist that believes in breathing as a human right.\n\nBut Musk believes otherwise, and really, money makes right.\n\n(not /s that's how the USA works)",
                "It's fun when there is clearly a two tier system to rules and laws in the US. If you are rich, you play by completely different rules than us plebs.",
                "Well of course they are because in his mind, everything he and his companies do is okay because he’s on a mission to “save the world.” \n\nThe irony is the world does need saving from him and other billionaires who want to rule the entire planet. \n\nIf the sideshow freak had it his way, we’d all have to drive a Tesla, only use twitter (what’s an X?!), only use Starlink and send him an email every week telling him what 5 things we did that week in service to his “great vision.”",
                "you can really just get away with anything as long as you're a billionaire huh."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Kash Patel removed as acting ATF director, replaced by Army Secretary",
            "external_url": "https://www.reuters.com/world/us/kash-patel-removed-acting-atf-director-replaced-by-army-secretary-sources-say-2025-04-09/",
            "upvotes": 21070,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait. So, is the Army Secretary holding both roles? So ATF and a branch of the military report to the same person?\n\n\nI'm not sure that makes me feel all warm and fuzzy...",
                "I’m beginning to think there’s a bit of chaos going on within this current administration…",
                "Guys, this administration is a cornucopia of shit. ",
                "On threads they reported Kash simply stopped coming into work (at the ATF, not the FBI). I’ll take my karma wins where I can.",
                "How many Scaramuccis did he last?",
                "Patel is not fit to run anything.",
                "Removed because he wasn't doing the job and didn't show up.\n\nOn that note, does anyone know if he's been doing his FBI job or showing up there?",
                "Ok, so what's this a distraction for?",
                "Got fired for being there for Ovechkin's 895th goal.",
                "Did they realize he was a DEI hire as well? 🥸"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Ice director wants to run deportations like ‘Amazon Prime for human beings’",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/09/ice-todd-lyons-deporation-amazon",
            "upvotes": 3165,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/859c33001990f401c9456143c4275fddf3f21c02/0_207_6219_3731/master/6219.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e4d70ae77846cf21d58ce3666624a675",
            "top_comments": [
                "He has his list. Someone should be keeping our list.",
                "That's odd: my Amazon packages were never  \"entitled to notice and an opportunity to challenge their removal\"\n\nDo you think the Director of ICE has heard about the legal requirement to notify these 'packages', or a requirement they're allowed a court hearing?\n\nThe dehumanizing language this 'person' uses is nauseating.  This \"great\" country has been handed to slithering snakes.",
                "What the fuck.... ಠ⁠_⁠ಠ How depraved can some people be.",
                "Does anyone still doubt the holocaust could happen again tomorrow?",
                "I'm surprised he acknowledged they are human beings.",
                "I wish we lived in a movie so I know at some point these villains get what is coming for them. ",
                "Jesus Christ, the fact that this came out of his mouth...my Nazi killing grandfather is spinning in his grave.",
                "satan is going to read this back to him when welcoming him to hell.",
                "So we are just going to sleep walk into a grim dark future.",
                "He wants it to get so busy they end up with traffic.\n\nLike human traffic!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Video shows 4 captive Ukrainian troops killed by men identified as Russian forces",
            "external_url": "https://apnews.com/article/russia-ukraine-pows-war-crimes-putin-zelenskyy-a2185297338af410fb5122448e62db76",
            "upvotes": 824,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So warcrimes then the Russian soldiers did warcrimes.\n\nWonder what bullshit excuse Vlad has for this.\n\nNo word on Rubio being stern with russia yet either.",
                "The event was filmed by two drones. One Russian, One Ukranian. The Russian video was posted in Russian media showing the men surrendering and lying on the ground, ending there, and reporting they were taken alive. The Ukrainian video goes on to show the men shot in their heads after lying on the ground. These war crimes must be answered for one day. The sooner the better. Long live the Sovreign'd state of Ukraine. May its flag fly one day over Red Square.",
                "This probably happens every day",
                "Vile - but is there a reason Ukrainian troops keep surrendering after 3 years of footage of them then being shot? ",
                "I wonder if these russian soldiers were specifically ordered to do this or that they're genuinely evil. \n\nKilling POW is literally another flight of stairs downwards to hell.\n\nI can only imagine that the common soldier is just a dude with no intentions to straight-up murder people who aren't a threat and that they, too, would hope to stay alive and treated accordingly, should they ever be captured by the enemy.",
                "Yes, that is what happens in war, each side kills the other side’s troops - and sometimes their own. \n\nWarcrimes."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "China orders its banks to reduce US dollar purchases.",
            "external_url": "https://www.reuters.com/world/china/chinas-central-bank-asks-state-lenders-reduce-dollar-purchases-sources-say-2025-04-09/",
            "upvotes": 31158,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And 10yr treasure bonds above 4.5%.\n\nChina said fuck this tit for tat tariff bullshit.  They are using all their tools.",
                "There goes the infinite money hack the federal budget depends on. How long before the entire government collapses due to a total lack of funds?",
                "Wow, this is going much quicker than I expected. I thought we'd have to go through the recession before we had to print money. Looks like this is a speed run.",
                "Things are looking good, MAGA. It looks like you're going to get what you wanted. The rest of the world will be just fine without you.",
                "So I have a question what happens when all that US debt that China has bought up over the last 20 years or so what happens if they want to cash it in.",
                "All this because we won't just tax billionaires",
                "Turns out you don’t have the cards, Donald.",
                "Economic pressure is not going to work against China. They felt the impacts of the trade war that Trump started in 2018 and continued under Biden and started to quickly de-couple themselves from the dollar and critical imports. The increased tariffs will hurt everyone globally, but the ones that'll feel the impacts most both short-term and long-term are Americans.",
                "No problem. Trump will just order an intern to ask chatGPT to come up with a new executive order declaring that the Chinese are not allowed to stop investing in America. And then he'll threaten them with more tariffs.\n\nProblem solved.",
                "I did not understand a single word in this article, can someone way smarter than me translate what this means and how it will affect the average American?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump announces 90 day tariff pause",
            "external_url": "https://www.cnbc.com/2025/04/09/trump-announces-90-day-tariff-pause-for-at-least-some-countries.html",
            "upvotes": 17067,
            "date": "04/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108129074-1744205767394-gettyimages-2208184612-_s019698_miuhqrg1.jpeg?v=1744205822&w=1920&h=1080",
            "top_comments": [
                "Can you imagine working at customs this week",
                "These tariffs are supposed to bring good manufacturing jobs back to the USA. Why is he putting a pause on that? Doesn't he care about our jobs? /s",
                "This market manipulation is so fucking obvious its insane. Insider trading to levels never before seen.",
                "This is open corruption. They release the news on tariffs to short the market, then pause them so they can sell them.\n\nrinse and repeat. They aren't even trying to hide it now.\n\nffs",
                "Trump timed his comment so his rich friends get richer on the market.",
                "If we ever get this country back, one of the first things we need to do is strip the presdiency of having this much power.",
                "This is exactly why Congress should never have given this power to the executive branch.",
                "At some point, there begins to be no other rational explanation other than these tariff headlines are for insider trading.\n\nThis is the most inconsistent trade policy I have ever seen...",
                "Trump told Truth social \"it's a great time to buy\" ahead of the new tariff delay announcement\n\nAfter Trump's term, he should be investigated for stock manipulation.",
                "It's just market manipulation. It would be amazing to see who bought a ton of stock right before he announced this \"pause\"."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "El Salvador says it shares gang intel with the US — and requests specific deportees | CNN",
            "external_url": "https://www.cnn.com/2025/04/09/americas/el-salvador-shares-gang-intel-with-us-intl-latam/index.html",
            "upvotes": 314,
            "date": "04/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-05t040942z-1661266844-rc2brda67x5y-rtrmadp-3-usa-trump-migration-el-salvador.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So they are the ones who gave names of non-Salvadorans? \n\nSure, Jan.",
                "So in other words, gangs in El Salvador can pay to have their enemies brought back to El Salvador and placed in a prison where they can be dealt with anyway they desire. \n\nWelcome to manufactured hell on earth.",
                "They’re telling on themselves",
                "Sounds like a system perfectly built for abuse.",
                "Requesting specific deportees to be handed over without due process so they they can perform labour without volition, pay or any means of escape....\n\nSo yeah, the USA is just openly providing slave labour now....",
                "So a bunch of these people they're calling gang members are just political prisoners.",
                "Sounds like theyre shopping to me.",
                "So El Salvador can request specific people to be sent there, but the Trump administration would like us believe it would be impossible to have certain people (i.e. Kilmar Abrego Garcia) returned to the USA?",
                "people trump paid millions to put deportees in slave concentration camp are very reliable source /s"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Trump tariffs spark US government debt sell-off",
            "external_url": "https://www.bbc.com/news/articles/c5yrr0e7499o",
            "upvotes": 27085,
            "date": "04/09/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4e4c/live/1d4d0e70-1533-11f0-bc17-dfa4f8dfee61.jpg",
            "top_comments": [
                "Fucking Christ if US bonds go off a cliff, what else is left. That shit is supposed to be a gold standard in investment.",
                "Don’t forget - Trump is only able to do this because Republicans refuse to rein him in. This is a Republican problem. ",
                "Trump said if I voted for Kamala the economy would be in ruin. And I gotta say, he clocked it right. I voted for her and the economy is in shambles.",
                "Donald Trump has broken his own record as the worst president of All time.\n\nHe has betrayed the American people including his voters who were hoping that the prices would go down.",
                "China has a LOT or Treasuries to offload - no interest rate cuts",
                "*Some analysts suggested that America's central bank - the US Federal Reserve - might be forced to step in if turbulence continues, in a move reminiscent of the Bank of England's emergency action in 2022 following Liz Truss's mini-Budget.*\n\n*”We see no other option for the Fed but to step in with emergency purchases of US Treasuries to stabilise the bond market,\" said George Saravelos, global head of FX research at Deutsche Bank.*\n\nLoL, all the pro-Trump “sound money” folks railed against exactly this during the quantitative easing of 2008+. Now they’ll turn around on a dime and be all for it. Anything to defend the Trump regime.\n\nQuacks, every last one of them.",
                "I am not informed enough to understand how one person has that much power in the United States.\n\nCongress is currently talking about limiting the President's power over tariffs and my reaction is... why didn't they have power over this to begin with?\n\nHow can we not cancel $10k in student loans without congressional approval, but the President can trigger a great depression and global recession without congressional approval?",
                "The GOP budget resolution adds 5 trillion to the debt ceiling. People are understanding USA has no intention on paying off its debt. That's 5 trillion uncollected taxes from the rich. To put it in easier to understand numbers: 5,000,000,000,000/150,000,000 taxpayers = about $32,000 debt increase per person who filed taxes last year. The tariffs are a smokescreen and we are getting robbed.",
                "Guys, I think it’s very clear that loomer sucked whatever little intelligence Trump had, right out of his baby carrot. This man defies logic every time he opens his mouth. ",
                "For the MAGA people, Trump could burn your house down and shit in your mouth and you'd thank him for the warmth and what he ate beforehand."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "El Salvador says it shares gang intel with the US — and requests specific deportees | CNN",
            "external_url": "https://www.cnn.com/2025/04/09/americas/el-salvador-shares-gang-intel-with-us-intl-latam/index.html",
            "upvotes": 314,
            "date": "04/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-05t040942z-1661266844-rc2brda67x5y-rtrmadp-3-usa-trump-migration-el-salvador.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So they are the ones who gave names of non-Salvadorans? \n\nSure, Jan.",
                "So in other words, gangs in El Salvador can pay to have their enemies brought back to El Salvador and placed in a prison where they can be dealt with anyway they desire. \n\nWelcome to manufactured hell on earth.",
                "They’re telling on themselves",
                "Sounds like a system perfectly built for abuse.",
                "Requesting specific deportees to be handed over without due process so they they can perform labour without volition, pay or any means of escape....\n\nSo yeah, the USA is just openly providing slave labour now....",
                "So a bunch of these people they're calling gang members are just political prisoners.",
                "Sounds like theyre shopping to me.",
                "So El Salvador can request specific people to be sent there, but the Trump administration would like us believe it would be impossible to have certain people (i.e. Kilmar Abrego Garcia) returned to the USA?",
                "people trump paid millions to put deportees in slave concentration camp are very reliable source /s"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Elon Musk’s xAI powering its facility in Memphis with ‘illegal’ generators",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/09/elon-musk-xai-memphis",
            "upvotes": 988,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1de7b9823a50c8556a5bbbf321475f37f23f0a1d/0_200_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3e836e9ed9df4c53d833c4600e85acf5",
            "top_comments": [
                "It's okay.\n\nfElon is just going to buy more Carbon Tax credits from this Tesla company so they can just approve the permits!",
                "Once you become an oligarch, legality is a mere inconvenience and laws are polite suggestions!\n\nIn this particular scenario, DOGE will perhaps  identify some relevant government organizations that are in an urgent need for \"efficiency improvements\".",
                "Musk himself is “illegal” can’t stand the sight of him",
                "The rich get richer, the poor get cancer",
                "Tennessee politicians already opening their hands for the \"donations\" needed to allow this to become legalized",
                "Has Elon even doing anything that's legal?\n\nHe's making poor quality vehicles\n\nHis SpaceX has had lot of crashes\n\nHis Twitter is shit\n\nHis own DOGE is not showing proofs of what government waste is deleted\n\nHe is a shit gamer\n\nHe is a shit father to all.\n\nDoesn't pay child support.\n\nHas openly supported \"Nazis\"\n\nHow is he STILL after all this, is not in jail?",
                ">“I’m here because today we’ve learned that xAI is using 35 methane gas burning turbines,” said Pearson, who is the director of the advocacy group Memphis Community Against Pollution. “They have submitted a permit to our Shelby county health department for 15, yet they are using double that amount with no permit.”\n\nI applaud this activist that believes in breathing as a human right.\n\nBut Musk believes otherwise, and really, money makes right.\n\n(not /s that's how the USA works)",
                "It's fun when there is clearly a two tier system to rules and laws in the US. If you are rich, you play by completely different rules than us plebs.",
                "Well of course they are because in his mind, everything he and his companies do is okay because he’s on a mission to “save the world.” \n\nThe irony is the world does need saving from him and other billionaires who want to rule the entire planet. \n\nIf the sideshow freak had it his way, we’d all have to drive a Tesla, only use twitter (what’s an X?!), only use Starlink and send him an email every week telling him what 5 things we did that week in service to his “great vision.”",
                "you can really just get away with anything as long as you're a billionaire huh."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Missouri woman accused of trading child for monkey",
            "external_url": "https://www.nbcnews.com/video/missouri-woman-accused-of-trading-child-for-monkey-236946501547",
            "upvotes": 159,
            "date": "04/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/mpx/2704722219/2025_04/nc_pkg_ksdk_foster_mom_monkey_250409-0h7ds0.jpg",
            "top_comments": [
                "I don't know wtf i'm reading anymore.  It's like the world went crazy.",
                "I didn't realize this was an option",
                "Fuck, that was an option?",
                "Haven't you always wanted a monkey?",
                "The good old Missouri monkey trade. ",
                "This is like one of those classic mom threats, except this one actually did it",
                "Finally a worthy match for Florida man.",
                "Parents, who among us hasn’t entertained this idea once or twice ",
                "I want to see this monkey",
                "I’m going to need to see a side-by-side pic before I pass judgment."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Video shows 4 captive Ukrainian troops killed by men identified as Russian forces",
            "external_url": "https://apnews.com/article/russia-ukraine-pows-war-crimes-putin-zelenskyy-a2185297338af410fb5122448e62db76",
            "upvotes": 833,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So warcrimes then the Russian soldiers did warcrimes.\n\nWonder what bullshit excuse Vlad has for this.\n\nNo word on Rubio being stern with russia yet either.",
                "The event was filmed by two drones. One Russian, One Ukranian. The Russian video was posted in Russian media showing the men surrendering and lying on the ground, ending there, and reporting they were taken alive. The Ukrainian video goes on to show the men shot in their heads after lying on the ground. These war crimes must be answered for one day. The sooner the better. Long live the Sovreign'd state of Ukraine. May its flag fly one day over Red Square.",
                "This probably happens every day",
                "Vile - but is there a reason Ukrainian troops keep surrendering after 3 years of footage of them then being shot? ",
                "I wonder if these russian soldiers were specifically ordered to do this or that they're genuinely evil. \n\nKilling POW is literally another flight of stairs downwards to hell.\n\nI can only imagine that the common soldier is just a dude with no intentions to straight-up murder people who aren't a threat and that they, too, would hope to stay alive and treated accordingly, should they ever be captured by the enemy.",
                "Yes, that is what happens in war, each side kills the other side’s troops - and sometimes their own. \n\nWarcrimes."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "‘Grubby’ treaty principles bill voted down in New Zealand parliament",
            "external_url": "https://www.theguardian.com/world/2025/apr/10/treaty-principles-bill-voted-down-in-new-zealand-parliament-maori",
            "upvotes": 108,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4e6175af3f58d8beb177ffc374d317684b0fa3b5/0_385_5911_3548/master/5911.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=da710e5d5c422c0c35c165bf16a7ba77",
            "top_comments": [
                "A lot of international articles about the Treaty have been bad, but this one is actually quite good. This bill, if passed, would have - among many bad things - allowed one man, a member of a minority party (ACT) to unilaterally rewrite the founding document of our country at the detriment of indigenous people. \n\nWhen the time came for consultation on the proposal, more people wrote submissions against the bill than voted for ACT in the first place.\n\nI am so glad that it was stopped",
                "Well, now kiwis know which 11 people in their parliament to never vote for again.",
                "As a Kiwi, I’m so proud of how New Zealand has embraced the Māori culture and language so fully, especially since I now live in the US, where they tend to treat Native Americans and their cultures in a very different way. Mostly as mascots for their sports teams or cigarette brands. I miss Aotearoa.",
                "More people submitted opposition to the bill than voted for ACT.\n\nBy around 20,000 people.",
                "fucking aye!!! fuck outta here you racist cunts, fuck off out of NZ, proud if my country telling these dog cunts to fuck right off David Seymore is a piece of garbage the dude doesn’t deserve the right to call himself kiwi hes a coward racist with zero policy’s that matter and a face that only fists could love",
                "Some info about the guy who fronted the bill, David Seymour:\n- Ties to Atlas network, a global right wing libertarian “think tank” that he continues to deny has any influence on him despite starting his political career working in one of their organisations and appearing at their events. One of his biggest donors, a matter of public record, is the mother of the Atlas CEO, but whenever one of them is asked about if they feign ignorance and call it a conspiracy theory. \n- New Zealand has extremely high rates of child poverty, the previous government set up a school lunch scheme. David Seymours first large political act after getting into government was to dismantle the school food programme and replace it with slop from a company that was found to be serving horse meat. \n\nTheres so much more, unfortunately.\n\nHis party still appeals to way too many voters, especially fringe voters who feel unheard by the progressive parties or the very old and stale moderate conservatives."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Davis Moturi reflects on being shot in his own yard after asking police for help",
            "external_url": "https://www.mprnews.org/story/2025/04/08/davis-moturi-reflects-on-being-shot-by-neighbor-john-sawchak-in-minneapolis",
            "upvotes": 217,
            "date": "04/10/2025",
            "thumbnail": "https://img.apmcdn.org/bf464053b2b9447224d14d9fb06fb32452b2ecde/widescreen/3a0618-20250325-davismoturi02-2000.jpg",
            "top_comments": [
                "To clarify that headline, Moturi had been asking the police for help for a year in dealing with his racist neighbor. They didn’t intervene, and he was shot by said neighbor.",
                "So five years after George Floyd, the Minneapolis police department is still racist as hell?\n\nhttps://en.wikipedia.org/wiki/George_Floyd?wprov=sfla1"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Rejected at her door, ICE nabs a Maryland woman in her car after smashing her window",
            "external_url": "https://www.thebaltimorebanner.com/community/local-news/video-ice-arrest-wesminster-elsy-noemi-berrios-QJ7CIME76ZGPZEBW5C3REEPZ6E/",
            "upvotes": 10957,
            "date": "04/10/2025",
            "thumbnail": "https://www.thebaltimorebanner.com/resizer/v2/5IW27W3VKBHKBIUARZZRHZYYJI.jpg?auth=bc1d934ab8edc7efbfbb8726ad05f705954e34e4697fc5de01ed8c7d8c9d0c3f&width=900&smart=true&quality=85",
            "top_comments": [
                "Call me paranoid but wouldn't something like this be a kidnapper and trafficker's wet dream? Being able to just snatch a person off the street, claim you're government and they're illegal. Then whisk them away to some undisclosed location where both them and you would be impossible to track because there's no oversight whatsoever.",
                "I'm still amazed how there seems to be multitude of people in law-enforcement who were just waiting for the moment they could turn against their neighbours.",
                "I'm a little surprised nobody's shot an ICE agent yet.",
                "And how we burned in the camps later, thinking: What would things have been like if every Security operative, when he went out at night to make an arrest, had been uncertain whether he would return alive and had to say good-bye to his family? Or if, during periods of mass arrests, as for example in Leningrad, when they arrested a quarter of the entire city, people had not simply sat there in their lairs, paling with terror at every bang of the downstairs door and at every step on the staircase, but had understood they had nothing left to lose and had boldly set up in the downstairs hall an ambush of half a dozen people with axes, hammers, pokers, or whatever else was at hand?... The Organs would very quickly have suffered a shortage of officers and transport and, notwithstanding all of Stalin's thirst, the cursed machine would have ground to a halt! If...if...We didn't love freedom enough. And even more – we had no awareness of the real situation.... We purely and simply deserved everything that happened afterward.\n\n\n\n\nAleksandr I. Solzhenitsyn , The Gulag Archipelago 1918–1956",
                "Just call em what they are, the fucking modern American gestapo. Nazi punks can fuck off.",
                "Jesus Christ that ski mask makes him look like a common thug",
                "Bunch of fucking terrorists.\n\n Can you imagine how it feels being a legal green card holder in this country right now?\n\n When they are done going after the Hispanics , and the Muslims, what religion/nationality will be next?? Eventually it will be you.",
                "I always said that they would go for the low hanging fruit to meet their targets. Law abiding brown people are easy to identify and target.",
                "I can see people turning on specifically ICE here in the next few months. It'll go from judges locking them up to people outright engaging them in combat.",
                "Apparently, according to ICE, if you are fleeing from a gang to come to America, because you believe your life is in danger,  then technically you are associated with a gang.\n\nI maybe am being a bit sarcastic with the above statement, but I would not be surprised if that IS the logic, or something like it, that is being used to round up grandparents, and others who have no connection whatsoever to gang-activity, other than they were trying to escape their home, and come here to avoid being killed."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Ice director wants to run deportations like ‘Amazon Prime for human beings’",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/09/ice-todd-lyons-deporation-amazon",
            "upvotes": 3158,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/859c33001990f401c9456143c4275fddf3f21c02/0_207_6219_3731/master/6219.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e4d70ae77846cf21d58ce3666624a675",
            "top_comments": [
                "He has his list. Someone should be keeping our list.",
                "That's odd: my Amazon packages were never  \"entitled to notice and an opportunity to challenge their removal\"\n\nDo you think the Director of ICE has heard about the legal requirement to notify these 'packages', or a requirement they're allowed a court hearing?\n\nThe dehumanizing language this 'person' uses is nauseating.  This \"great\" country has been handed to slithering snakes.",
                "What the fuck.... ಠ⁠_⁠ಠ How depraved can some people be.",
                "Does anyone still doubt the holocaust could happen again tomorrow?",
                "I'm surprised he acknowledged they are human beings.",
                "I wish we lived in a movie so I know at some point these villains get what is coming for them. ",
                "Jesus Christ, the fact that this came out of his mouth...my Nazi killing grandfather is spinning in his grave.",
                "satan is going to read this back to him when welcoming him to hell.",
                "So we are just going to sleep walk into a grim dark future.",
                "He wants it to get so busy they end up with traffic.\n\nLike human traffic!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "US, Vietnam agree to launch trade deal talks as tariffs paused",
            "external_url": "https://www.reuters.com/world/asia-pacific/us-vietnam-agree-launch-trade-deal-talks-tariffs-paused-2025-04-10/",
            "upvotes": 439,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I, for one, am excited for my low-paid factory job making cheap manufactured goods that Vietnamese consumers will be able to afford.",
                "Vietnam has been trying to get a trade deal with us ever since we changed our minds on the TPP, which was cancelled in part due to Trump. The amount of schizophrenia Trump has on trade deals is unreal.",
                "The irony: the major manufacturers in China own and operate a shit load of the factories and manufacturing in Vietnam. \n\nSo this is a back door to working around the insane tariffs placed on China.",
                "This administration is a cornucopia of incompetence and shit, making America look like a joke. ",
                "Nintendo switch 2 fans will be so happy",
                "I can’t wait for this deal with Vietnam to make the price of groceries go down.",
                "I wonder how much begging the Vietnamese did to get this agreement.",
                "“Talks” - SpaceX transferred their manufacturing there recently, tariff impact will be negligible.",
                "Hey Reuters, what got paused? As far as I’m aware, 10% tariffs still went into affect against Vietnam.",
                "If I were Vietnam, I would not put my rare minerals on the table.  Just tighten up a little on the \"trade fraud.\""
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Attorney representing a student protestor detained by federal immigration agents",
            "external_url": "https://www.npr.org/2025/04/09/nx-s1-5357455/attorney-detained-by-immigration-authorities",
            "upvotes": 1261,
            "date": "04/09/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1638x921+0+201/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffb%2F1d%2F7e2e76fd4e98926d3eafe5439585%2Famir.jpeg",
            "top_comments": [
                "Dystopian. The agents that are following Trumps orders are terrible human beings. I can’t imagine detaining innocent people knowing the impact it may have on them and their loved ones",
                "ICE is the new Gestapo now.",
                "If there's a next president, every single person serving this administration needs to be fired. No severance, no letter of recommendation, no nothing. Just gone.",
                "You have to understand that he wasn’t detained for his political activity or support for immigrants, this has all been just a big misunderstanding. \n\nHe was detained for the simple reason that he is brown",
                "In before we see comments defending the agents by saying, “He refused to show his phone. If he showed his phone, he wouldn’t have remained detained.” Or my favorite, “We don’t know the fully story. He could’ve been a terrorist, we just don’t know,” yet was allowed to leave after an unjust and racist detainment",
                "They're just trying to scare all of us at this point.",
                "[ Removed by Reddit ]",
                "Fuck Ice! Soulless evil vile creatures"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk’s xAI powering its facility in Memphis with ‘illegal’ generators",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/09/elon-musk-xai-memphis",
            "upvotes": 992,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1de7b9823a50c8556a5bbbf321475f37f23f0a1d/0_200_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3e836e9ed9df4c53d833c4600e85acf5",
            "top_comments": [
                "It's okay.\n\nfElon is just going to buy more Carbon Tax credits from this Tesla company so they can just approve the permits!",
                "Once you become an oligarch, legality is a mere inconvenience and laws are polite suggestions!\n\nIn this particular scenario, DOGE will perhaps  identify some relevant government organizations that are in an urgent need for \"efficiency improvements\".",
                "Musk himself is “illegal” can’t stand the sight of him",
                "The rich get richer, the poor get cancer",
                "Tennessee politicians already opening their hands for the \"donations\" needed to allow this to become legalized",
                "Has Elon even doing anything that's legal?\n\nHe's making poor quality vehicles\n\nHis SpaceX has had lot of crashes\n\nHis Twitter is shit\n\nHis own DOGE is not showing proofs of what government waste is deleted\n\nHe is a shit gamer\n\nHe is a shit father to all.\n\nDoesn't pay child support.\n\nHas openly supported \"Nazis\"\n\nHow is he STILL after all this, is not in jail?",
                ">“I’m here because today we’ve learned that xAI is using 35 methane gas burning turbines,” said Pearson, who is the director of the advocacy group Memphis Community Against Pollution. “They have submitted a permit to our Shelby county health department for 15, yet they are using double that amount with no permit.”\n\nI applaud this activist that believes in breathing as a human right.\n\nBut Musk believes otherwise, and really, money makes right.\n\n(not /s that's how the USA works)",
                "It's fun when there is clearly a two tier system to rules and laws in the US. If you are rich, you play by completely different rules than us plebs.",
                "Well of course they are because in his mind, everything he and his companies do is okay because he’s on a mission to “save the world.” \n\nThe irony is the world does need saving from him and other billionaires who want to rule the entire planet. \n\nIf the sideshow freak had it his way, we’d all have to drive a Tesla, only use twitter (what’s an X?!), only use Starlink and send him an email every week telling him what 5 things we did that week in service to his “great vision.”",
                "you can really just get away with anything as long as you're a billionaire huh."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "El Salvador says it shares gang intel with the US — and requests specific deportees | CNN",
            "external_url": "https://www.cnn.com/2025/04/09/americas/el-salvador-shares-gang-intel-with-us-intl-latam/index.html",
            "upvotes": 316,
            "date": "04/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-05t040942z-1661266844-rc2brda67x5y-rtrmadp-3-usa-trump-migration-el-salvador.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So they are the ones who gave names of non-Salvadorans? \n\nSure, Jan.",
                "So in other words, gangs in El Salvador can pay to have their enemies brought back to El Salvador and placed in a prison where they can be dealt with anyway they desire. \n\nWelcome to manufactured hell on earth.",
                "They’re telling on themselves",
                "Sounds like a system perfectly built for abuse.",
                "Requesting specific deportees to be handed over without due process so they they can perform labour without volition, pay or any means of escape....\n\nSo yeah, the USA is just openly providing slave labour now....",
                "So a bunch of these people they're calling gang members are just political prisoners.",
                "Sounds like theyre shopping to me.",
                "So El Salvador can request specific people to be sent there, but the Trump administration would like us believe it would be impossible to have certain people (i.e. Kilmar Abrego Garcia) returned to the USA?",
                "people trump paid millions to put deportees in slave concentration camp are very reliable source /s"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Video shows 4 captive Ukrainian troops killed by men identified as Russian forces",
            "external_url": "https://apnews.com/article/russia-ukraine-pows-war-crimes-putin-zelenskyy-a2185297338af410fb5122448e62db76",
            "upvotes": 820,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So warcrimes then the Russian soldiers did warcrimes.\n\nWonder what bullshit excuse Vlad has for this.\n\nNo word on Rubio being stern with russia yet either.",
                "The event was filmed by two drones. One Russian, One Ukranian. The Russian video was posted in Russian media showing the men surrendering and lying on the ground, ending there, and reporting they were taken alive. The Ukrainian video goes on to show the men shot in their heads after lying on the ground. These war crimes must be answered for one day. The sooner the better. Long live the Sovreign'd state of Ukraine. May its flag fly one day over Red Square.",
                "This probably happens every day",
                "Vile - but is there a reason Ukrainian troops keep surrendering after 3 years of footage of them then being shot? ",
                "I wonder if these russian soldiers were specifically ordered to do this or that they're genuinely evil. \n\nKilling POW is literally another flight of stairs downwards to hell.\n\nI can only imagine that the common soldier is just a dude with no intentions to straight-up murder people who aren't a threat and that they, too, would hope to stay alive and treated accordingly, should they ever be captured by the enemy.",
                "Yes, that is what happens in war, each side kills the other side’s troops - and sometimes their own. \n\nWarcrimes."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Rejected at her door, ICE nabs a Maryland woman in her car after smashing her window",
            "external_url": "https://www.thebaltimorebanner.com/community/local-news/video-ice-arrest-wesminster-elsy-noemi-berrios-QJ7CIME76ZGPZEBW5C3REEPZ6E/",
            "upvotes": 10973,
            "date": "04/10/2025",
            "thumbnail": "https://www.thebaltimorebanner.com/resizer/v2/5IW27W3VKBHKBIUARZZRHZYYJI.jpg?auth=bc1d934ab8edc7efbfbb8726ad05f705954e34e4697fc5de01ed8c7d8c9d0c3f&width=900&smart=true&quality=85",
            "top_comments": [
                "Call me paranoid but wouldn't something like this be a kidnapper and trafficker's wet dream? Being able to just snatch a person off the street, claim you're government and they're illegal. Then whisk them away to some undisclosed location where both them and you would be impossible to track because there's no oversight whatsoever.",
                "I'm still amazed how there seems to be multitude of people in law-enforcement who were just waiting for the moment they could turn against their neighbours.",
                "I'm a little surprised nobody's shot an ICE agent yet.",
                "And how we burned in the camps later, thinking: What would things have been like if every Security operative, when he went out at night to make an arrest, had been uncertain whether he would return alive and had to say good-bye to his family? Or if, during periods of mass arrests, as for example in Leningrad, when they arrested a quarter of the entire city, people had not simply sat there in their lairs, paling with terror at every bang of the downstairs door and at every step on the staircase, but had understood they had nothing left to lose and had boldly set up in the downstairs hall an ambush of half a dozen people with axes, hammers, pokers, or whatever else was at hand?... The Organs would very quickly have suffered a shortage of officers and transport and, notwithstanding all of Stalin's thirst, the cursed machine would have ground to a halt! If...if...We didn't love freedom enough. And even more – we had no awareness of the real situation.... We purely and simply deserved everything that happened afterward.\n\n\n\n\nAleksandr I. Solzhenitsyn , The Gulag Archipelago 1918–1956",
                "Just call em what they are, the fucking modern American gestapo. Nazi punks can fuck off.",
                "Jesus Christ that ski mask makes him look like a common thug",
                "Bunch of fucking terrorists.\n\n Can you imagine how it feels being a legal green card holder in this country right now?\n\n When they are done going after the Hispanics , and the Muslims, what religion/nationality will be next?? Eventually it will be you.",
                "I always said that they would go for the low hanging fruit to meet their targets. Law abiding brown people are easy to identify and target.",
                "I can see people turning on specifically ICE here in the next few months. It'll go from judges locking them up to people outright engaging them in combat.",
                "Apparently, according to ICE, if you are fleeing from a gang to come to America, because you believe your life is in danger,  then technically you are associated with a gang.\n\nI maybe am being a bit sarcastic with the above statement, but I would not be surprised if that IS the logic, or something like it, that is being used to round up grandparents, and others who have no connection whatsoever to gang-activity, other than they were trying to escape their home, and come here to avoid being killed."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Davis Moturi reflects on being shot in his own yard after asking police for help",
            "external_url": "https://www.mprnews.org/story/2025/04/08/davis-moturi-reflects-on-being-shot-by-neighbor-john-sawchak-in-minneapolis",
            "upvotes": 222,
            "date": "04/10/2025",
            "thumbnail": "https://img.apmcdn.org/bf464053b2b9447224d14d9fb06fb32452b2ecde/widescreen/3a0618-20250325-davismoturi02-2000.jpg",
            "top_comments": [
                "To clarify that headline, Moturi had been asking the police for help for a year in dealing with his racist neighbor. They didn’t intervene, and he was shot by said neighbor.",
                "So five years after George Floyd, the Minneapolis police department is still racist as hell?\n\nhttps://en.wikipedia.org/wiki/George_Floyd?wprov=sfla1"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Ice director wants to run deportations like ‘Amazon Prime for human beings’",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/09/ice-todd-lyons-deporation-amazon",
            "upvotes": 3159,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/859c33001990f401c9456143c4275fddf3f21c02/0_207_6219_3731/master/6219.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e4d70ae77846cf21d58ce3666624a675",
            "top_comments": [
                "He has his list. Someone should be keeping our list.",
                "That's odd: my Amazon packages were never  \"entitled to notice and an opportunity to challenge their removal\"\n\nDo you think the Director of ICE has heard about the legal requirement to notify these 'packages', or a requirement they're allowed a court hearing?\n\nThe dehumanizing language this 'person' uses is nauseating.  This \"great\" country has been handed to slithering snakes.",
                "What the fuck.... ಠ⁠_⁠ಠ How depraved can some people be.",
                "Does anyone still doubt the holocaust could happen again tomorrow?",
                "I'm surprised he acknowledged they are human beings.",
                "I wish we lived in a movie so I know at some point these villains get what is coming for them. ",
                "Jesus Christ, the fact that this came out of his mouth...my Nazi killing grandfather is spinning in his grave.",
                "satan is going to read this back to him when welcoming him to hell.",
                "So we are just going to sleep walk into a grim dark future.",
                "He wants it to get so busy they end up with traffic.\n\nLike human traffic!"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Dramatic sell-off of US government bonds as tariff war panic deepens | Bonds",
            "external_url": "https://www.theguardian.com/business/2025/apr/09/dramatic-sell-off-of-us-government-bonds-as-tariff-war-panic-deepens",
            "upvotes": 6125,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a2f63b4a2b6881319e7daba96702e5b867fa7474/0_261_7837_4703/master/7837.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8e6ad02d29bd98f16e70bf59bab06db6",
            "top_comments": [
                "imagine starting a tariff war as a bluff and destroying the basis of your economy (for over 100 years) in one go.",
                "I’ve been thinking about this really old Reddit comment from 10 years ago about what to do if you win the lottery. \n\nhttps://www.reddit.com/r/AskReddit/s/RshgA8abNn\n\nParticularly these passages:\n\n> Right now, you’ll get around 3.5% on the 10 year U.S. treasury. With $18.2 million (20% of $91.2 mil after your absurdly generous family gift) invested in those you will pull down $638,400 per year. If everything else blows up, you still have that, and you will be in the top 1% of income in the United States. So how about you not fuck with it. Eh? And that’s income that is damn safe. **If we get to the point where the United States defaults on those instruments, we are in far worse shape than worrying about money.**\n\n> If you are really paranoid, you might consider picking another G7 or otherwise mainstream country other than the U.S. according to where you want to live **if the United States dissolves into anarchy or Britney Spears is elected to the United States Senate.**\n\n> You have provided for your family beyond your wildest dreams. And you still have $36.4 million in “cash.” You know you will be getting $638,400 per year **unless the capital building is burning**",
                "Didn’t Trump pussy out of his tariffs because of the bond sell off?",
                "Who’d thought there’d be consequences for dramatically changing policy multiple times over the last two months with little rhyme or reason?!",
                "The stock indices rebounding are more smoke and mirrors than anything and reflect terrible policy and reversal with this 90 day reprieve. But the capriciousness of this debacle will continue to destabilize markets. Bottom line is the US economy has suffered irreparable harm with countries no longer wanting to buy our debt as a result. This is the lasting impact not one day of stock market bounce back.",
                "Trump's **Seventh** bankruptcy...",
                "Why would any reasonable nation trust this demented ogre of a narcissist",
                "Hey that's a thing my money is based off of!\n\n\nSure am glad this will cost me nothing!",
                ">“I could stand in the middle of Fifth Avenue and shoot somebody, and I wouldn’t lose any voters, OK?”\n\nOnce you’ve normalized Corruption and don’t fear any consequences from anyone. It’s inevitable that you’ll push the envelope and take advantage of the opportunities. A simple phone call to your family and acquaintances letting them in on your thoughts, and millions are in play. So raise your hand if you think there were questionable if downright corrupt actions taken prior to his announcement. If I don’t see a sea of hands raised, I have a Bridge to Nowhere for sale.",
                "So let me get this straight.\n\nWhat returned confidence to the markets is that Trump wasn't going to implement the tariffs; it was all just a market manipulation?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "US, Vietnam agree to launch trade deal talks as tariffs paused",
            "external_url": "https://www.reuters.com/world/asia-pacific/us-vietnam-agree-launch-trade-deal-talks-tariffs-paused-2025-04-10/",
            "upvotes": 441,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I, for one, am excited for my low-paid factory job making cheap manufactured goods that Vietnamese consumers will be able to afford.",
                "Vietnam has been trying to get a trade deal with us ever since we changed our minds on the TPP, which was cancelled in part due to Trump. The amount of schizophrenia Trump has on trade deals is unreal.",
                "The irony: the major manufacturers in China own and operate a shit load of the factories and manufacturing in Vietnam. \n\nSo this is a back door to working around the insane tariffs placed on China.",
                "This administration is a cornucopia of incompetence and shit, making America look like a joke. ",
                "Nintendo switch 2 fans will be so happy",
                "I can’t wait for this deal with Vietnam to make the price of groceries go down.",
                "I wonder how much begging the Vietnamese did to get this agreement.",
                "“Talks” - SpaceX transferred their manufacturing there recently, tariff impact will be negligible.",
                "Hey Reuters, what got paused? As far as I’m aware, 10% tariffs still went into affect against Vietnam.",
                "If I were Vietnam, I would not put my rare minerals on the table.  Just tighten up a little on the \"trade fraud.\""
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "RISING",
            "title": "AI-generated lawyer sparks courtroom controversy in New York",
            "external_url": "https://www.fox5ny.com/news/ny-ai-generated-lawyer-courtroom",
            "upvotes": 319,
            "date": "04/10/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5ny.com/www.fox5ny.com/content/uploads/2025/04/1280/720/snapshot-2025-04-07t181723.616.jpg?ve=1&tl=1",
            "top_comments": [
                "I just imagined a world in which two AI lawyers present to an AI judge and suddenly people are being convicted and sent to prison on the basis of two AIs trying to convince another AI to do what they want without any human oversight whatsoever.",
                "The AI Glen Powell Esq. got about five seconds into \"I come before this panel a humble pro-se....\" before the presiding judge stopped it.\n\nThis guy got permission to present a recorded oral argument, because he had throat cancer 25 years ago and says he has difficulty speaking.  But he's been before a trial court and this appeals court in the past, and spoken with the court staff at length.\n\n\nHe proceeded to deliver his scripted argument, with little difficulty.   The other party's attorney stammered more than the appellant did.\n\nHe didn't make a terrible argument about arbitration clauses in employment contracts, but he could have left out the Mangione reference and the three-card monte allegory.\n\nTurns out this guy's got a colorful history as a marijuana activist, an expat in Russia, and a non-profit fraud felony convict.",
                "Misleading headline.\n\n> Plaintiff Jerome Dewald was in court two weeks ago for an employment dispute when he tried to play a video to present his case. The video featured an AI-generated avatar he created to act as his legal representative.\n\nIt wasn’t an AI arguing his case in real time. It was a video he made with AI.",
                "[I knew I didn't start that fire...](https://youtu.be/XL2RLTmqG4w?si=f07Fk39TfO18-BvS)",
                "A horrific AI written article….",
                "[deleted]",
                "These judges need to protect their own kind.",
                "[removed]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Kash Patel removed as acting ATF director, replaced by Army Secretary",
            "external_url": "https://www.reuters.com/world/us/kash-patel-removed-acting-atf-director-replaced-by-army-secretary-sources-say-2025-04-09/",
            "upvotes": 21071,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait. So, is the Army Secretary holding both roles? So ATF and a branch of the military report to the same person?\n\n\nI'm not sure that makes me feel all warm and fuzzy...",
                "I’m beginning to think there’s a bit of chaos going on within this current administration…",
                "Guys, this administration is a cornucopia of shit. ",
                "On threads they reported Kash simply stopped coming into work (at the ATF, not the FBI). I’ll take my karma wins where I can.",
                "How many Scaramuccis did he last?",
                "Patel is not fit to run anything.",
                "Removed because he wasn't doing the job and didn't show up.\n\nOn that note, does anyone know if he's been doing his FBI job or showing up there?",
                "Ok, so what's this a distraction for?",
                "Got fired for being there for Ovechkin's 895th goal.",
                "Did they realize he was a DEI hire as well? 🥸"
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "04/10/2025 12:15:51 UTC"
}