{
    "posts": [
        {
            "category": "HOT",
            "title": "'They are Russian-speaking, and there have been referendums,' — Witkoff parrots Russian propaganda, legitimizing Putin's claim",
            "external_url": "https://kyivindependent.com/i-dont-regard-putin-as-a-bad-guy-witkoff-says-on-negotiations-with-russia/",
            "upvotes": 1434,
            "date": "03/23/2025",
            "thumbnail": "https://assets.kyivindependent.com/content/images/2025/02/GettyImages-2196945288.jpg",
            "top_comments": [
                "Thought they are against homosexuality. Why are they sucking Putin’s cock?",
                "Americans are English speaking, does that mean America should cede control back to parliament ?",
                "That's his argument? He wants the Russian speaking parts of Ukraine to be handed over to Russia just like that. That's like saying Germany should grab Austria and the German speaking parts of Switzerland. And he's using rigged referendums as his backup. If he's unaware certain parts of the world rig elections and referendums, then he is unqualified for his job.",
                "Just blatantly parroting boss’ messaging. \nShould he just start responding in Russian? Just save everyone time and effort.",
                "Who the fuck is this human garbage?",
                "The people of the Sudetenland speak German,  we must liberate them from the Czechs to get more living room  - Adolf Hitler.",
                ">\"They are Russian-speaking, and there have been referendums where the overwhelming majority of the people have indicated that they want to be under Russian rule,\" Witkoff added\n\nAnywhere that was forcibly part of the USSR has Russian-speaking people.\n\nAny referendum run by the Russians will naturally conclude that 101% of the people want to be under Russian rule.\n\nIf this man Witkoff does not understand this then he does not meet the job requirements for an American Special Envoy position.",
                "A lot of the Ukrainian soldiers in Kursk speak Ukrainian. Maybe Kursk wants to vote on being part of Ukraine? Or all other regions in Russia where other languages dominates? Maybe more referendums of independence all over Russia is idea?",
                "The U.S. should rejoin the UK now, hold the referendums too. They’re English-speaking after all",
                "I wonder how he will feel if some of America wants to leave the US because maybe they are Spanish speaking and they took a vote."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Former US attorney for Eastern District of Virginia Jessica Aber found dead at 43",
            "external_url": "https://www.nbcwashington.com/news/local/former-us-attorney-for-eastern-district-of-virginia-jessica-aber-found-dead-at-43/3874185/",
            "upvotes": 32928,
            "date": "03/23/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/03/GettyImages-1827676825.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "[deleted]",
                "Hopefully we don’t look back at this as the “first” of anything…",
                "She had been investigating [Russian billionaires' money laundering](https://databreaches.net/2024/09/26/two-russian-nationals-charged-in-connection-with-operating-billion-dollar-money-laundering-services/) and [Russian war crimes against a US national living in Ukraine](https://www.nbcwashington.com/news/local/former-us-attorney-for-eastern-district-of-virginia-jessica-aber-found-dead-at-43/3874185/?_osource=SocialFlowTwt_DCBrand)",
                "I hope this isn't our version of \"falling out a window\"",
                "Ugh this is horrible ..may she rest in peace",
                "That's just entirely too young for this day and age.",
                "Initially suspicious.\n\nHopefully subsequent news dispels it.",
                "Rest in peace. That is a very young age to go.",
                "This woman testified for first way ever used in *war crime* actions of Russians *against US Citizen* in Ukraine on **12/6/23**\n\n\n\nThis is war if so. \n\n\n\n\n > WASHINGTON, DC – DECEMBER 6: U.S. Attorney for the Eastern District of Virginia Jessica Aber speaks during a press conference at the U.S. Department of Justice on December 6, 2023 in Washington, DC. The Department of Justice announced today that four Russian military personnel have been indicted for war crimes committed against a U.S. national living in Ukraine, the first of such charges ever to be brought under the U.S. war crimes statute. (Photo by Samuel Corum/Getty Images)\nJessica",
                "Im not making any definitive statements on this but im already seeing the radicalized maga psychopaths saying she had it coming & its Joe Biden's fault on \"twitter\" so.. \n\nI think redemption or a legitimate awakening to reality is off the table - They're so far gone they are actively supporting death of their perceived enemies. "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "For over a century, a U.S.-Canada cross-border library used a single entrance. Now, the U.S. says Canadians must build their own.",
            "external_url": "https://www.cbsnews.com/news/haskell-free-library-and-opera-house-canada-u-s-cross-border-separate-entrances/",
            "upvotes": 1039,
            "date": "03/23/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/21/8dc50eaf-f71f-4ef3-ad59-17cb4c44129b/thumbnail/1200x630/2e3602234428d190cf25e851d1a67bcd/gettyimages-646354910.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "They should start thinking about how they’re gonna build a road to Alaska",
                "I think the US's canary died a while ago. At this point, it's just a bunch of toxic gas in this coal mine.",
                ">A Department of Homeland Security spokesperson told Reuters that the U.S. decision was in response [to drug trafficking](https://www.cbsnews.com/news/trump-tariffs-canada-trade-fact-check/). \n\n>\"Drug traffickers and smugglers were exploiting the fact that Canadians could use the U.S. entrance without going through customs. We are ending such exploitation by criminals and protecting Americans,\" the statement said. \n\nSo you're telling me that they are trafficking drugs through a library? That's amazing.",
                "Nice folks you have down there",
                "What I find most irritating about the MAGA government is just how petty they are. If they had a coherent plan and stuck to it it would be crap but at least understandable. But their actions are anything but coherent. They just seem to want to piss off as many people as they can.",
                "Canadians should just demolish the 1/2 of the library on Canadian soil.\n\nThe Americans can just go and rebuild the missing 1/2 on their soil then.",
                "Such needless aggression and division.",
                "If I was Canada I would look into backing up copies of the books in that library. Before Trump decides to get rid of them in an abrupt manner like he’s been doing.",
                "\"drug smuggling\"\n\nWTF? \n\nYou'd have to be on drugs to think this library could or would be an effective drug smuggling route.  This is just animosity towards Canada for no logistical or logical reason other than to be ass.\n\nAnd to be honest this constant drug smuggling claim levied towards Canada makes me nervous, I get the distinct feeling trump wants a guns and boots conflict with Canada",
                "Trumpism is synonymous with pettiness and belligerence. Complete and utter assholes are running the United States now."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Woman accused of killing her California fire captain wife captured in Mexico",
            "external_url": "https://www.nbcnews.com/news/us-news/woman-accused-killing-california-fire-captain-wife-captured-mexico-rcna193772",
            "upvotes": 1453,
            "date": "03/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250221-Rebecca-Marodi-ew-1110a-a7eed4.jpg",
            "top_comments": [
                "Wow she also killed her husband in 2000. Both stabbed to death.",
                ">In 2003, Yolanda Marodi pleaded guilty to voluntary manslaughter in the stabbing death of husband Jim Olejniczak in 2000, the station reported. She was released from custody a decade later.\n\n\n*Only to commit the same murder again.*",
                "Not blaming the victim but I don’t think I’d marry anyone convicted of killing their previous spouse…",
                "Why do we have a list for sex offenders but not murderers? They reoffend as well. I truly do not understand. She probably knew about her wife’s previous conviction but I just don’t understand why murderers are not on a registry as well?",
                "Man, that was a dizzy of a title. Let's play a game of \"where do we put a comma so it makes sense\".",
                "Absolutely horrible. I hope they throw that monster under the jail.",
                "RIP. She didn't deserve this.",
                "I can’t believe she’d do this. I figured when she killed her husband that she got it out of her system.",
                "You just can't satisfy some people.",
                "Tragic. Hoping the mom and the pets she took while she was on the run are doing ok."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Five year old among killed in Russian attack on Kyiv, Ukraine says.",
            "external_url": "https://www.reuters.com/world/europe/russian-drone-hits-apartment-building-kyiv-ukrainian-officials-say-2025-03-22/",
            "upvotes": 1482,
            "date": "03/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "These headlines don’t shock anyone anymore because we’re so used to seeing them.  If you know a 5 year-old, picture finding out they just died.  That can help stimulate that feeling that you’re supposed to feel when you read something like this.  So fucking sad.",
                "What, but I just heard trump saying that putin is a goodest boy",
                "Or as Witkoff put it: \"I don't regard Putin as a bad guy, he's super smart.\"",
                "There’s a special place in hell for these Russian fuck heads.",
                "Genuine Question: Why is this seen as unacceptable in Ukraine but acceptable in Palestine? ",
                "1 five YO in Ukraine > dozens in Palestine when it comes to reporting apparently",
                "This is so upsetting; every child's death is such a tragedy, regardless of their ethinicity or the color of their skin. Imagine to be the mom or dad of these unfortunate souls. This is so, so heartbreaking -- just like the news that dozens of little children were murdered the other day in Gaza. There's no hell deep enough for Putin, Netanyahu and all their enablers.",
                "​Russias idea of 'sending gifts' to Kyiv involves drones and destruction. Someone should tell them that surprise visits are rarely appreciated, especially when they come with explosions",
                "And yet my country in the EU has real life people saying how this is all Ukraine’s fault even after caving to Trump’s “great deal”. These people could have bombs landing on their house the next day and still be this bended and spineless.",
                "Putin needs to die. I fucking hate this so fucking much."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "United pilot attacked passenger for taking too long in the bathroom, lawsuit alleges | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/22/united-pilot-attacks-passenger",
            "upvotes": 3598,
            "date": "03/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/587e60049d651d0fa4221718e074d34b7f9b7281/0_0_5149_3090/master/5149.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2698b5b29e80cb05b580a1aaf52f760e",
            "top_comments": [
                ">\tLiebb said when he asked why they were being detained, an officer tightened his handcuffs and responded: “This isn’t county or state. We are homeland. You have no rights here.”\n\nWhat is this 1984 shit?",
                "Every time I take a united flight, I joke about brushing up on street fighting skills, because we all know “fLight club” is real at united.",
                "The pilots would’ve used the lav nearer the flight deck, not the one in the back",
                "I’m shocked SHOCKED that an airline famous for [breaking guitars](https://youtu.be/5YGc4zOqozo) and [dragging a doctor off a plane](https://youtu.be/VrDWY6C1178) would do something so callous. ",
                "That sucks but there’s a small part of me that wants to do this whenever someone is in there taking way too long because they’re just scrolling…\n\nLike please bro, I accidentally had some milk and now my ass is gonna explode.",
                "Yeahhh, I think people need to wait and see where this leads. The article is strictly from the plaintiffs perspective because the airline won't comment.\n\nI have a hard time believing a pilot would break a door down to pull a man out who was just using the restroom. There had to be something else going on. \n\nLike was the guy being belligerent? Was he actually suffering from an issue or was he doing something else in the bathroom? Obviously he's not going to say \"yeah I wasn't really going to the bathroom, I was hanging out for 30+ minutes and being a dickhead to the staff.\" Also the plaintiff doesn't specify when it happened, perhaps the plane was close to landing? As everyone knows you can't be in the bathroom during that. Maybe the pilot/flight attendants were concerned he was lying because he was in there for 30+ minutes.\n\nA pilot isn't going to risk their license/job by attacking a passenger and doing damage to the plane. Something had to be going on.",
                "The pilot did not break the lock. The bathroom door on an airplane can be unlocked very easily from the outside.",
                "Ok but 30 minutes? Cmon.",
                "This headline and story seem doubtful",
                "Was it an off duty pilot that went and did that? As a pilot you never go back during flight to get involved in a passenger issue, especially a potential security one. "
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Man who planned hospital terror attack jailed",
            "external_url": "https://www.bbc.com/news/articles/c3e4yx1gjj1o",
            "upvotes": 208,
            "date": "03/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/73c1/live/d96e4080-0596-11f0-97d3-37df2b293ed1.jpg",
            "top_comments": [
                "What type of dumb fuck thinks killing nurses is god's work.",
                "Dude looks like an overfilled water balloon",
                "Good, what kinda fucking coward actively tries to murder nurses. If they really thought their phoney balogna god would protect them on their righteous endeavor then they wouldn't need to attack defenseless healthcare workers right?",
                "Ah yes nurses, the universally agreed upon “infidel.” How dare they exist and keep people alive.",
                "Did he hide the bomb under that muskrat on his head?",
                "Dude sure didn’t miss a meal while planning his jihad.",
                "This particular haircut seems to...do things to people.",
                "May this pathetic excuse for a human never see the light of day again",
                "he wanted to \"kill as many nurses as possible\" by detonating a pressure cooker bomb.\n\n\nIt’s hard enough that nurses are underpaid and overworked in a thankless job in an ungrateful world. Now they have to be worried about such individuals too?\n\nWhere is all this hatred coming from? My prayers to the entire nursing community everywhere in the world. You’re angels of mercy.",
                "Hamster Kanye West with a hair looking cock sucker"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Nova Scotia legislators vote unanimously to scrap electric car rebates for Tesla",
            "external_url": "https://www.thecanadianpressnews.ca/politics/nova-scotia-legislators-vote-unanimously-to-scrap-electric-car-rebates-for-tesla/article_644f9fd5-46b5-5b39-9032-772de4b37f7c.html",
            "upvotes": 5692,
            "date": "03/22/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/thecanadianpressnews.ca/content/tncms/assets/v3/editorial/d/bd/dbdbe4b2-efe8-50e1-9af3-4f193ff5b396/67ded0c011d58.image.jpg?crop=1400%2C735%2C0%2C99&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "Good.  \n\nDrive TSLA stock into the ground.  Have it go from the highest market cap company to bankrupt in less than 4 years.",
                "Is this at all related to Tesla being under investigation for suspicious claims on the federal EV rebate?",
                "Good.\n\nNow lobby the federal government to drop the 100% tariff on Chinese EVs. If they actually care about climate change then they'll do it, and Canadians will be able to quickly adopt very affordable and stylish EVs.",
                "🇨🇦 Elbows up my Canadian friends! 🇨🇦",
                "I admit, I am happily watching this company go the way of ayds diet pills",
                "You've got to hit him where it hurts, in the wallet.",
                "But they still use Twitter as part of their communication strategy and pay for a blue check mark.",
                "Sigh.   I get the protest completely..  but we shouldn't be discouraging electic vehicles.  Sure promote other ones.  But don't harm those making the investment to the betterment of our futures.",
                "So the climate is so important until it’s not. What’s more important, the survivability of our planet or a stupid political stunt?",
                "> \"There are other options for us here in Canada for electric vehicles,\" she said.\n\nAh yes, all the other good options such as... that Porsche EV that costs $200k? A bolt (who wants to drive a GM vehicle)? Um. That garbage BMW that gets like 60mi of range? \n\n---\n\n> trade war\n\nThis is funny because apparently the different providences in Canada put tariffs on each other. Wonder if they'll ban each other for engaging in a trade war."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Pope Francis makes first public appearance in five weeks, ahead of leaving hospital",
            "external_url": "https://www.abc.net.au/news/2025-03-23/pope-francis-discharged-from-hospital/105086490",
            "upvotes": 327,
            "date": "03/23/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/e68cc37fc638ee9423089fa82b1f84cf?impolicy=wcms_watermark_news&cropH=2135&cropW=3795&xPos=0&yPos=26&width=862&height=485&imformat=generic",
            "top_comments": [
                "This reminds me of Pope JPII's final public appearance after he was discharged from Gemelli hospital appx March twenty years ago. He passed away not long after. I hope and pray Francis will recover but at his age, anything can happen, sadly.",
                "The Pope’s doctor never gets any credit",
                "He looks about the same. Crazy after everything he's been through.",
                "Conclave! Conclave! Conclave!",
                "Dead man walking..or rather rollin 🦽",
                "Would he be absolutely fucking buzzing to be nearly dead because he can't wait to get to heaven and meet God and stuff?",
                "Go to the light. The red red light.",
                "He looks like the little girl in the yellow jacket running"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "The Pentagon's DEI purge: Officials describe a scramble to remove and then restore online content",
            "external_url": "https://apnews.com/article/pentagon-dei-diversity-social-media-purge-fb15996733408a8122a97acd3baa6820",
            "upvotes": 4798,
            "date": "03/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*While the pages of some well-known veterans... are now back up on Pentagon websites, officials warn that many posts tagged for removal in error may be gone forever.*\n\nSounds familiar:  they're great at razing but not at raising.",
                "A great use of our tax dollars for sure! /s",
                "What are the odds they will quietly remove them again in a few months, hoping people will be distracted by another thing?",
                "These revisionists deemed the Enola Gay, the Tuskegee airmen, and Major General Charles Rogers's Medal of Honor DEI. They are trying to scrub the history of the military and they call themselves patriots and America First. People really should have paid attention to Project 2025 since now, we have to wait until 2026 to change the Congress.",
                "They also took down the web pages concerning the most decorated military unit in US history, the 442nd Regimental Combat Team. An outcry from veterans restored it.",
                "Racist, homophobic assholes.",
                "Why would people that want to overthrow our democracy spend this much time and effort pissing off the military FOR NO TANGIBLE BENEFIT?\n\nWell I suppose if these people were smart they wouldn’t be racist..",
                "Can’t have anyone thinking women, gays, or the blacks materially participated in our military. /s",
                "It's almost like big balls wrote an algorithm that checks everything against a keyword list of things that this admin wants to erase from history.",
                "I know that they're sworn to obedience, and they are being given lawful orders.\n\nBut the orders echo the Nazi purges of the past century. They are actions that mirror the policies of our enemies. The nation mobilized against such things, pouring out blood and treasure to stop them. It was one of our proudest moments, and one that serves to define how we see ourselves as a nation.\n\nThe Pentagon shouldn't be \"scrambling\" to obey such orders, however technically lawful they may be. This purge impresses a stain on the honor of our Armed Forces that will never be expunged. I would expect them to be slow-walking every step. Every order should be met by the impenetrable bureaucracy and red tape that military organizations are famous for. Every signature should be obtained only after each word of the orders and plans are inspected in detail, reviewed by committees, stamped, filed, lost, found, encoded with reference numbers, and distributed to each relevant department. If a form must be filled out, pens should be requisitioned for the purpose. When the pens arrive, they should be deemed unsuitable because the ink viscosity doesn't comply with procurement regulations. The rejected shipment should be returned, and a refund from the contracted vendor obtained and accounted before a new requisition is originated. And once pens are obtained, the forms can be filled out in proper triplicate, to be separated and filed in their widespread destinations. \n\nUn-American orders need not be expedited; they should be completed with \"all deliberate speed\". Emphasis on \"deliberation\". If the \"Received\" stamp is crooked in its little square, the paperwork should be rejected without explanation until a communication is established to convey that the papers need to be re-done, with a proper cross-reference number linking the rejected paperwork with the replacement.\n\nRemoving an entry on a website *ought to take MONTHS.*"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Couple sentenced to hundreds of years in prison for forcing adopted Black children to work as 'slaves'",
            "external_url": "https://www.nbcnews.com/news/us-news/couple-sentenced-hundreds-years-forcing-black-children-work-slaves-rcna197533",
            "upvotes": 42,
            "date": "03/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250319-west-virginia-abuse-mb-0743-4120e9.jpg",
            "top_comments": [
                "Please say 400 years....it'd be so...  appropriate",
                "How many times must I ask WTF is wrong with people? How did this world just produce so many pieces of shit. Sigh.",
                "America: still a world leader as long as were talkin racists per capita"
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "NEW",
            "title": "Death toll in Gaza rises to 50,000, territory's health ministry says, as Israel orders new strikes, evacuations",
            "external_url": "https://www.cbsnews.com/news/gaza-israel-hamas-death-toll-strikes-continue/",
            "upvotes": 142,
            "date": "03/23/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/23/913582f4-74d3-44b9-9d45-25e9572a02c6/thumbnail/1200x630/69c7cadcea64f0155515668ec08bf340/gettyimages-2205900998.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "Is it just me or is that relatively a small number for the amount of coverage it gets?  Just as a comparison the Congo has average ~300,000 dead per year for the last twenty years and is still ongoing\n\nhttps://www.amnesty.org/en/latest/campaigns/2024/10/why-is-the-democratic-republic-of-congo-wracked-by-conflict/\n\nWe literally never hear about it",
                "At least 50k dead, over 100k injured, tens of thousands missing under rubble. 2.3 million people in Gaza before the war and something like 1.9 million now. \nThe numbers don’t add up and I’m betting way more people are dead and missing but we don’t know because Gaza is still being bombed.",
                "“One day, everyone will always have been against this”",
                "Israel would just nuke Gaza if they could.",
                "Just sad to see that this kind of stuff has to take place at all. No matter which side you believe is right or wrong.",
                "To all those that didn't vote in protest over Gaza, how is that moral superiority feeling about now.",
                "[deleted]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Man who planned hospital terror attack jailed",
            "external_url": "https://www.bbc.com/news/articles/c3e4yx1gjj1o",
            "upvotes": 208,
            "date": "03/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/73c1/live/d96e4080-0596-11f0-97d3-37df2b293ed1.jpg",
            "top_comments": [
                "What type of dumb fuck thinks killing nurses is god's work.",
                "Dude looks like an overfilled water balloon",
                "Good, what kinda fucking coward actively tries to murder nurses. If they really thought their phoney balogna god would protect them on their righteous endeavor then they wouldn't need to attack defenseless healthcare workers right?",
                "Ah yes nurses, the universally agreed upon “infidel.” How dare they exist and keep people alive.",
                "Did he hide the bomb under that muskrat on his head?",
                "Dude sure didn’t miss a meal while planning his jihad.",
                "This particular haircut seems to...do things to people.",
                "May this pathetic excuse for a human never see the light of day again",
                "he wanted to \"kill as many nurses as possible\" by detonating a pressure cooker bomb.\n\n\nIt’s hard enough that nurses are underpaid and overworked in a thankless job in an ungrateful world. Now they have to be worried about such individuals too?\n\nWhere is all this hatred coming from? My prayers to the entire nursing community everywhere in the world. You’re angels of mercy.",
                "Hamster Kanye West with a hair looking cock sucker"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "'They are Russian-speaking, and there have been referendums,' — Witkoff parrots Russian propaganda, legitimizing Putin's claim",
            "external_url": "https://kyivindependent.com/i-dont-regard-putin-as-a-bad-guy-witkoff-says-on-negotiations-with-russia/",
            "upvotes": 1432,
            "date": "03/23/2025",
            "thumbnail": "https://assets.kyivindependent.com/content/images/2025/02/GettyImages-2196945288.jpg",
            "top_comments": [
                "Thought they are against homosexuality. Why are they sucking Putin’s cock?",
                "Americans are English speaking, does that mean America should cede control back to parliament ?",
                "That's his argument? He wants the Russian speaking parts of Ukraine to be handed over to Russia just like that. That's like saying Germany should grab Austria and the German speaking parts of Switzerland. And he's using rigged referendums as his backup. If he's unaware certain parts of the world rig elections and referendums, then he is unqualified for his job.",
                "Just blatantly parroting boss’ messaging. \nShould he just start responding in Russian? Just save everyone time and effort.",
                "Who the fuck is this human garbage?",
                "The people of the Sudetenland speak German,  we must liberate them from the Czechs to get more living room  - Adolf Hitler.",
                ">\"They are Russian-speaking, and there have been referendums where the overwhelming majority of the people have indicated that they want to be under Russian rule,\" Witkoff added\n\nAnywhere that was forcibly part of the USSR has Russian-speaking people.\n\nAny referendum run by the Russians will naturally conclude that 101% of the people want to be under Russian rule.\n\nIf this man Witkoff does not understand this then he does not meet the job requirements for an American Special Envoy position.",
                "A lot of the Ukrainian soldiers in Kursk speak Ukrainian. Maybe Kursk wants to vote on being part of Ukraine? Or all other regions in Russia where other languages dominates? Maybe more referendums of independence all over Russia is idea?",
                "The U.S. should rejoin the UK now, hold the referendums too. They’re English-speaking after all",
                "I wonder how he will feel if some of America wants to leave the US because maybe they are Spanish speaking and they took a vote."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "For over a century, a U.S.-Canada cross-border library used a single entrance. Now, the U.S. says Canadians must build their own.",
            "external_url": "https://www.cbsnews.com/news/haskell-free-library-and-opera-house-canada-u-s-cross-border-separate-entrances/",
            "upvotes": 1035,
            "date": "03/23/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/21/8dc50eaf-f71f-4ef3-ad59-17cb4c44129b/thumbnail/1200x630/2e3602234428d190cf25e851d1a67bcd/gettyimages-646354910.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "They should start thinking about how they’re gonna build a road to Alaska",
                "I think the US's canary died a while ago. At this point, it's just a bunch of toxic gas in this coal mine.",
                ">A Department of Homeland Security spokesperson told Reuters that the U.S. decision was in response [to drug trafficking](https://www.cbsnews.com/news/trump-tariffs-canada-trade-fact-check/). \n\n>\"Drug traffickers and smugglers were exploiting the fact that Canadians could use the U.S. entrance without going through customs. We are ending such exploitation by criminals and protecting Americans,\" the statement said. \n\nSo you're telling me that they are trafficking drugs through a library? That's amazing.",
                "Nice folks you have down there",
                "What I find most irritating about the MAGA government is just how petty they are. If they had a coherent plan and stuck to it it would be crap but at least understandable. But their actions are anything but coherent. They just seem to want to piss off as many people as they can.",
                "Canadians should just demolish the 1/2 of the library on Canadian soil.\n\nThe Americans can just go and rebuild the missing 1/2 on their soil then.",
                "Such needless aggression and division.",
                "If I was Canada I would look into backing up copies of the books in that library. Before Trump decides to get rid of them in an abrupt manner like he’s been doing.",
                "\"drug smuggling\"\n\nWTF? \n\nYou'd have to be on drugs to think this library could or would be an effective drug smuggling route.  This is just animosity towards Canada for no logistical or logical reason other than to be ass.\n\nAnd to be honest this constant drug smuggling claim levied towards Canada makes me nervous, I get the distinct feeling trump wants a guns and boots conflict with Canada",
                "Trumpism is synonymous with pettiness and belligerence. Complete and utter assholes are running the United States now."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Woman accused of killing her California fire captain wife captured in Mexico",
            "external_url": "https://www.nbcnews.com/news/us-news/woman-accused-killing-california-fire-captain-wife-captured-mexico-rcna193772",
            "upvotes": 1444,
            "date": "03/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250221-Rebecca-Marodi-ew-1110a-a7eed4.jpg",
            "top_comments": [
                "Wow she also killed her husband in 2000. Both stabbed to death.",
                ">In 2003, Yolanda Marodi pleaded guilty to voluntary manslaughter in the stabbing death of husband Jim Olejniczak in 2000, the station reported. She was released from custody a decade later.\n\n\n*Only to commit the same murder again.*",
                "Not blaming the victim but I don’t think I’d marry anyone convicted of killing their previous spouse…",
                "Why do we have a list for sex offenders but not murderers? They reoffend as well. I truly do not understand. She probably knew about her wife’s previous conviction but I just don’t understand why murderers are not on a registry as well?",
                "Man, that was a dizzy of a title. Let's play a game of \"where do we put a comma so it makes sense\".",
                "Absolutely horrible. I hope they throw that monster under the jail.",
                "RIP. She didn't deserve this.",
                "I can’t believe she’d do this. I figured when she killed her husband that she got it out of her system.",
                "You just can't satisfy some people.",
                "Tragic. Hoping the mom and the pets she took while she was on the run are doing ok."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Pope Francis makes first public appearance in five weeks, ahead of leaving hospital",
            "external_url": "https://www.abc.net.au/news/2025-03-23/pope-francis-discharged-from-hospital/105086490",
            "upvotes": 326,
            "date": "03/23/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/e68cc37fc638ee9423089fa82b1f84cf?impolicy=wcms_watermark_news&cropH=2135&cropW=3795&xPos=0&yPos=26&width=862&height=485&imformat=generic",
            "top_comments": [
                "This reminds me of Pope JPII's final public appearance after he was discharged from Gemelli hospital appx March twenty years ago. He passed away not long after. I hope and pray Francis will recover but at his age, anything can happen, sadly.",
                "The Pope’s doctor never gets any credit",
                "He looks about the same. Crazy after everything he's been through.",
                "Conclave! Conclave! Conclave!",
                "Dead man walking..or rather rollin 🦽",
                "Would he be absolutely fucking buzzing to be nearly dead because he can't wait to get to heaven and meet God and stuff?",
                "Go to the light. The red red light.",
                "He looks like the little girl in the yellow jacket running"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Five year old among killed in Russian attack on Kyiv, Ukraine says.",
            "external_url": "https://www.reuters.com/world/europe/russian-drone-hits-apartment-building-kyiv-ukrainian-officials-say-2025-03-22/",
            "upvotes": 1483,
            "date": "03/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "These headlines don’t shock anyone anymore because we’re so used to seeing them.  If you know a 5 year-old, picture finding out they just died.  That can help stimulate that feeling that you’re supposed to feel when you read something like this.  So fucking sad.",
                "What, but I just heard trump saying that putin is a goodest boy",
                "Or as Witkoff put it: \"I don't regard Putin as a bad guy, he's super smart.\"",
                "There’s a special place in hell for these Russian fuck heads.",
                "Genuine Question: Why is this seen as unacceptable in Ukraine but acceptable in Palestine? ",
                "1 five YO in Ukraine > dozens in Palestine when it comes to reporting apparently",
                "This is so upsetting; every child's death is such a tragedy, regardless of their ethinicity or the color of their skin. Imagine to be the mom or dad of these unfortunate souls. This is so, so heartbreaking -- just like the news that dozens of little children were murdered the other day in Gaza. There's no hell deep enough for Putin, Netanyahu and all their enablers.",
                "​Russias idea of 'sending gifts' to Kyiv involves drones and destruction. Someone should tell them that surprise visits are rarely appreciated, especially when they come with explosions",
                "And yet my country in the EU has real life people saying how this is all Ukraine’s fault even after caving to Trump’s “great deal”. These people could have bombs landing on their house the next day and still be this bended and spineless.",
                "Putin needs to die. I fucking hate this so fucking much."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Istanbul mayor testifies in court as protesters across Turkey defy ban on gatherings | CNN",
            "external_url": "https://edition.cnn.com/2025/03/21/middleeast/turkey-protests-erdogan-mayor-intl-latam/index.html",
            "upvotes": 417,
            "date": "03/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2205793785.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                " The ban on gatherings is completely unlawful, the constitution clearly says \"people can gather and protest without needing permission\". They're trying to look big and strong to scare us and it's failing miserably.",
                "Turkey's officially a healthier democracy than the US; at least they're fighting back.",
                "For those in US, pay close attention to news from Turkey.\n\nI guarantee that Trump is watching this too and I am pretty sure Trump will instruct DoJ to investigate Democrat candidates in risky red districts next year so that congress remains under republican control.\n\nPlease don't tell me it won't happen here. It can and will happen and we no longer have checks and balances to stop it when it happens. They are already detaining legal permanent residents for what seems to be political ideas based on news that came out today.\n\nPeople in Turkey are now planning for general strikes and ways to slow down economy because today that's really the only form of protest that works without getting into civil war.",
                "EU completely silent, bunch of hypocrites",
                "I visited Istanbul a few months ago. Absolutely  in love with history and culture of this land. I hate seeing, what is going on politically"
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "NEW",
            "title": "Car Thieves Steal 8 Corvettes From GM Plant",
            "external_url": "https://www.wbko.com/2025/03/23/8-corvettes-stolen-gm-assembly-plant-bowling-green/",
            "upvotes": 639,
            "date": "03/23/2025",
            "thumbnail": "https://gray-wbko-prod.gtv-cdn.com/resizer/v2/4BP2Q4I2M5A67HWXGDEHOBJY7A.jpg?auth=dc595f785604ab91ae299db6cee41ab3ee63f16240265815c46c42ca62270545&width=1200&height=600&smart=false&focal=362%2C406",
            "top_comments": [
                "Police spotted one clearly from the factory and called to ask if they were missing a $160,000 Corvette. It hadn't been reported stolen yet",
                "So that brand new Corvette I just bought for $40,000 cash was hot?",
                "GM wouldn't miss just one little piece.",
                "Wait until they find out that there’s no Apple CarPlay in them. They’ll be Furious.",
                "Was somebody doing an irl Gone in 60 Seconds?",
                "Is this domestic terrorism also?",
                "What’s the market for these if they are stolen? Honest question, aren’t there quite a bit of technology that would make this futile? Or are piecing them out an option?",
                "Pretty simple when they leave the keys in the ignition.",
                "Stealing eight Corvettes from the GM Assembly Plant? That's one way to accelerate your criminal record",
                "i would watch this movie"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "'They are Russian-speaking, and there have been referendums,' — Witkoff parrots Russian propaganda, legitimizing Putin's claim",
            "external_url": "https://kyivindependent.com/i-dont-regard-putin-as-a-bad-guy-witkoff-says-on-negotiations-with-russia/",
            "upvotes": 1429,
            "date": "03/23/2025",
            "thumbnail": "https://assets.kyivindependent.com/content/images/2025/02/GettyImages-2196945288.jpg",
            "top_comments": [
                "Thought they are against homosexuality. Why are they sucking Putin’s cock?",
                "Americans are English speaking, does that mean America should cede control back to parliament ?",
                "That's his argument? He wants the Russian speaking parts of Ukraine to be handed over to Russia just like that. That's like saying Germany should grab Austria and the German speaking parts of Switzerland. And he's using rigged referendums as his backup. If he's unaware certain parts of the world rig elections and referendums, then he is unqualified for his job.",
                "Just blatantly parroting boss’ messaging. \nShould he just start responding in Russian? Just save everyone time and effort.",
                "Who the fuck is this human garbage?",
                "The people of the Sudetenland speak German,  we must liberate them from the Czechs to get more living room  - Adolf Hitler.",
                ">\"They are Russian-speaking, and there have been referendums where the overwhelming majority of the people have indicated that they want to be under Russian rule,\" Witkoff added\n\nAnywhere that was forcibly part of the USSR has Russian-speaking people.\n\nAny referendum run by the Russians will naturally conclude that 101% of the people want to be under Russian rule.\n\nIf this man Witkoff does not understand this then he does not meet the job requirements for an American Special Envoy position.",
                "A lot of the Ukrainian soldiers in Kursk speak Ukrainian. Maybe Kursk wants to vote on being part of Ukraine? Or all other regions in Russia where other languages dominates? Maybe more referendums of independence all over Russia is idea?",
                "The U.S. should rejoin the UK now, hold the referendums too. They’re English-speaking after all",
                "I wonder how he will feel if some of America wants to leave the US because maybe they are Spanish speaking and they took a vote."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "For over a century, a U.S.-Canada cross-border library used a single entrance. Now, the U.S. says Canadians must build their own.",
            "external_url": "https://www.cbsnews.com/news/haskell-free-library-and-opera-house-canada-u-s-cross-border-separate-entrances/",
            "upvotes": 1026,
            "date": "03/23/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/21/8dc50eaf-f71f-4ef3-ad59-17cb4c44129b/thumbnail/1200x630/2e3602234428d190cf25e851d1a67bcd/gettyimages-646354910.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "They should start thinking about how they’re gonna build a road to Alaska",
                "I think the US's canary died a while ago. At this point, it's just a bunch of toxic gas in this coal mine.",
                ">A Department of Homeland Security spokesperson told Reuters that the U.S. decision was in response [to drug trafficking](https://www.cbsnews.com/news/trump-tariffs-canada-trade-fact-check/). \n\n>\"Drug traffickers and smugglers were exploiting the fact that Canadians could use the U.S. entrance without going through customs. We are ending such exploitation by criminals and protecting Americans,\" the statement said. \n\nSo you're telling me that they are trafficking drugs through a library? That's amazing.",
                "Nice folks you have down there",
                "What I find most irritating about the MAGA government is just how petty they are. If they had a coherent plan and stuck to it it would be crap but at least understandable. But their actions are anything but coherent. They just seem to want to piss off as many people as they can.",
                "Canadians should just demolish the 1/2 of the library on Canadian soil.\n\nThe Americans can just go and rebuild the missing 1/2 on their soil then.",
                "Such needless aggression and division.",
                "If I was Canada I would look into backing up copies of the books in that library. Before Trump decides to get rid of them in an abrupt manner like he’s been doing.",
                "\"drug smuggling\"\n\nWTF? \n\nYou'd have to be on drugs to think this library could or would be an effective drug smuggling route.  This is just animosity towards Canada for no logistical or logical reason other than to be ass.\n\nAnd to be honest this constant drug smuggling claim levied towards Canada makes me nervous, I get the distinct feeling trump wants a guns and boots conflict with Canada",
                "Trumpism is synonymous with pettiness and belligerence. Complete and utter assholes are running the United States now."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Death toll in Gaza rises to 50,000, territory's health ministry says, as Israel orders new strikes, evacuations",
            "external_url": "https://www.cbsnews.com/news/gaza-israel-hamas-death-toll-strikes-continue/",
            "upvotes": 140,
            "date": "03/23/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/23/913582f4-74d3-44b9-9d45-25e9572a02c6/thumbnail/1200x630/69c7cadcea64f0155515668ec08bf340/gettyimages-2205900998.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "Is it just me or is that relatively a small number for the amount of coverage it gets?  Just as a comparison the Congo has average ~300,000 dead per year for the last twenty years and is still ongoing\n\nhttps://www.amnesty.org/en/latest/campaigns/2024/10/why-is-the-democratic-republic-of-congo-wracked-by-conflict/\n\nWe literally never hear about it",
                "At least 50k dead, over 100k injured, tens of thousands missing under rubble. 2.3 million people in Gaza before the war and something like 1.9 million now. \nThe numbers don’t add up and I’m betting way more people are dead and missing but we don’t know because Gaza is still being bombed.",
                "“One day, everyone will always have been against this”",
                "Israel would just nuke Gaza if they could.",
                "Just sad to see that this kind of stuff has to take place at all. No matter which side you believe is right or wrong.",
                "To all those that didn't vote in protest over Gaza, how is that moral superiority feeling about now.",
                "[deleted]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Five year old among killed in Russian attack on Kyiv, Ukraine says.",
            "external_url": "https://www.reuters.com/world/europe/russian-drone-hits-apartment-building-kyiv-ukrainian-officials-say-2025-03-22/",
            "upvotes": 1483,
            "date": "03/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "These headlines don’t shock anyone anymore because we’re so used to seeing them.  If you know a 5 year-old, picture finding out they just died.  That can help stimulate that feeling that you’re supposed to feel when you read something like this.  So fucking sad.",
                "What, but I just heard trump saying that putin is a goodest boy",
                "Or as Witkoff put it: \"I don't regard Putin as a bad guy, he's super smart.\"",
                "There’s a special place in hell for these Russian fuck heads.",
                "Genuine Question: Why is this seen as unacceptable in Ukraine but acceptable in Palestine? ",
                "1 five YO in Ukraine > dozens in Palestine when it comes to reporting apparently",
                "This is so upsetting; every child's death is such a tragedy, regardless of their ethinicity or the color of their skin. Imagine to be the mom or dad of these unfortunate souls. This is so, so heartbreaking -- just like the news that dozens of little children were murdered the other day in Gaza. There's no hell deep enough for Putin, Netanyahu and all their enablers.",
                "​Russias idea of 'sending gifts' to Kyiv involves drones and destruction. Someone should tell them that surprise visits are rarely appreciated, especially when they come with explosions",
                "And yet my country in the EU has real life people saying how this is all Ukraine’s fault even after caving to Trump’s “great deal”. These people could have bombs landing on their house the next day and still be this bended and spineless.",
                "Putin needs to die. I fucking hate this so fucking much."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Woman accused of killing her California fire captain wife captured in Mexico",
            "external_url": "https://www.nbcnews.com/news/us-news/woman-accused-killing-california-fire-captain-wife-captured-mexico-rcna193772",
            "upvotes": 1445,
            "date": "03/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250221-Rebecca-Marodi-ew-1110a-a7eed4.jpg",
            "top_comments": [
                "Wow she also killed her husband in 2000. Both stabbed to death.",
                ">In 2003, Yolanda Marodi pleaded guilty to voluntary manslaughter in the stabbing death of husband Jim Olejniczak in 2000, the station reported. She was released from custody a decade later.\n\n\n*Only to commit the same murder again.*",
                "Not blaming the victim but I don’t think I’d marry anyone convicted of killing their previous spouse…",
                "Why do we have a list for sex offenders but not murderers? They reoffend as well. I truly do not understand. She probably knew about her wife’s previous conviction but I just don’t understand why murderers are not on a registry as well?",
                "Man, that was a dizzy of a title. Let's play a game of \"where do we put a comma so it makes sense\".",
                "Absolutely horrible. I hope they throw that monster under the jail.",
                "RIP. She didn't deserve this.",
                "I can’t believe she’d do this. I figured when she killed her husband that she got it out of her system.",
                "You just can't satisfy some people.",
                "Tragic. Hoping the mom and the pets she took while she was on the run are doing ok."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Pope Francis makes first public appearance in five weeks, ahead of leaving hospital",
            "external_url": "https://www.abc.net.au/news/2025-03-23/pope-francis-discharged-from-hospital/105086490",
            "upvotes": 332,
            "date": "03/23/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/e68cc37fc638ee9423089fa82b1f84cf?impolicy=wcms_watermark_news&cropH=2135&cropW=3795&xPos=0&yPos=26&width=862&height=485&imformat=generic",
            "top_comments": [
                "This reminds me of Pope JPII's final public appearance after he was discharged from Gemelli hospital appx March twenty years ago. He passed away not long after. I hope and pray Francis will recover but at his age, anything can happen, sadly.",
                "The Pope’s doctor never gets any credit",
                "He looks about the same. Crazy after everything he's been through.",
                "Conclave! Conclave! Conclave!",
                "Dead man walking..or rather rollin 🦽",
                "Would he be absolutely fucking buzzing to be nearly dead because he can't wait to get to heaven and meet God and stuff?",
                "Go to the light. The red red light.",
                "He looks like the little girl in the yellow jacket running"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "Man who planned hospital terror attack jailed",
            "external_url": "https://www.bbc.com/news/articles/c3e4yx1gjj1o",
            "upvotes": 211,
            "date": "03/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/73c1/live/d96e4080-0596-11f0-97d3-37df2b293ed1.jpg",
            "top_comments": [
                "What type of dumb fuck thinks killing nurses is god's work.",
                "Dude looks like an overfilled water balloon",
                "Good, what kinda fucking coward actively tries to murder nurses. If they really thought their phoney balogna god would protect them on their righteous endeavor then they wouldn't need to attack defenseless healthcare workers right?",
                "Ah yes nurses, the universally agreed upon “infidel.” How dare they exist and keep people alive.",
                "Did he hide the bomb under that muskrat on his head?",
                "Dude sure didn’t miss a meal while planning his jihad.",
                "This particular haircut seems to...do things to people.",
                "May this pathetic excuse for a human never see the light of day again",
                "he wanted to \"kill as many nurses as possible\" by detonating a pressure cooker bomb.\n\n\nIt’s hard enough that nurses are underpaid and overworked in a thankless job in an ungrateful world. Now they have to be worried about such individuals too?\n\nWhere is all this hatred coming from? My prayers to the entire nursing community everywhere in the world. You’re angels of mercy.",
                "Hamster Kanye West with a hair looking cock sucker"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Istanbul mayor testifies in court as protesters across Turkey defy ban on gatherings | CNN",
            "external_url": "https://edition.cnn.com/2025/03/21/middleeast/turkey-protests-erdogan-mayor-intl-latam/index.html",
            "upvotes": 420,
            "date": "03/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2205793785.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                " The ban on gatherings is completely unlawful, the constitution clearly says \"people can gather and protest without needing permission\". They're trying to look big and strong to scare us and it's failing miserably.",
                "Turkey's officially a healthier democracy than the US; at least they're fighting back.",
                "For those in US, pay close attention to news from Turkey.\n\nI guarantee that Trump is watching this too and I am pretty sure Trump will instruct DoJ to investigate Democrat candidates in risky red districts next year so that congress remains under republican control.\n\nPlease don't tell me it won't happen here. It can and will happen and we no longer have checks and balances to stop it when it happens. They are already detaining legal permanent residents for what seems to be political ideas based on news that came out today.\n\nPeople in Turkey are now planning for general strikes and ways to slow down economy because today that's really the only form of protest that works without getting into civil war.",
                "EU completely silent, bunch of hypocrites",
                "I visited Istanbul a few months ago. Absolutely  in love with history and culture of this land. I hate seeing, what is going on politically"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Former US attorney for Eastern District of Virginia Jessica Aber found dead at 43",
            "external_url": "https://www.nbcwashington.com/news/local/former-us-attorney-for-eastern-district-of-virginia-jessica-aber-found-dead-at-43/3874185/",
            "upvotes": 32918,
            "date": "03/23/2025",
            "thumbnail": "https://media.nbcwashington.com/2025/03/GettyImages-1827676825.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "[deleted]",
                "Hopefully we don’t look back at this as the “first” of anything…",
                "She had been investigating [Russian billionaires' money laundering](https://databreaches.net/2024/09/26/two-russian-nationals-charged-in-connection-with-operating-billion-dollar-money-laundering-services/) and [Russian war crimes against a US national living in Ukraine](https://www.nbcwashington.com/news/local/former-us-attorney-for-eastern-district-of-virginia-jessica-aber-found-dead-at-43/3874185/?_osource=SocialFlowTwt_DCBrand)",
                "I hope this isn't our version of \"falling out a window\"",
                "Ugh this is horrible ..may she rest in peace",
                "That's just entirely too young for this day and age.",
                "Initially suspicious.\n\nHopefully subsequent news dispels it.",
                "Rest in peace. That is a very young age to go.",
                "This woman testified for first way ever used in *war crime* actions of Russians *against US Citizen* in Ukraine on **12/6/23**\n\n\n\nThis is war if so. \n\n\n\n\n > WASHINGTON, DC – DECEMBER 6: U.S. Attorney for the Eastern District of Virginia Jessica Aber speaks during a press conference at the U.S. Department of Justice on December 6, 2023 in Washington, DC. The Department of Justice announced today that four Russian military personnel have been indicted for war crimes committed against a U.S. national living in Ukraine, the first of such charges ever to be brought under the U.S. war crimes statute. (Photo by Samuel Corum/Getty Images)\nJessica",
                "Im not making any definitive statements on this but im already seeing the radicalized maga psychopaths saying she had it coming & its Joe Biden's fault on \"twitter\" so.. \n\nI think redemption or a legitimate awakening to reality is off the table - They're so far gone they are actively supporting death of their perceived enemies. "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "United pilot attacked passenger for taking too long in the bathroom, lawsuit alleges | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/22/united-pilot-attacks-passenger",
            "upvotes": 3598,
            "date": "03/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/587e60049d651d0fa4221718e074d34b7f9b7281/0_0_5149_3090/master/5149.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2698b5b29e80cb05b580a1aaf52f760e",
            "top_comments": [
                ">\tLiebb said when he asked why they were being detained, an officer tightened his handcuffs and responded: “This isn’t county or state. We are homeland. You have no rights here.”\n\nWhat is this 1984 shit?",
                "Every time I take a united flight, I joke about brushing up on street fighting skills, because we all know “fLight club” is real at united.",
                "The pilots would’ve used the lav nearer the flight deck, not the one in the back",
                "I’m shocked SHOCKED that an airline famous for [breaking guitars](https://youtu.be/5YGc4zOqozo) and [dragging a doctor off a plane](https://youtu.be/VrDWY6C1178) would do something so callous. ",
                "That sucks but there’s a small part of me that wants to do this whenever someone is in there taking way too long because they’re just scrolling…\n\nLike please bro, I accidentally had some milk and now my ass is gonna explode.",
                "Yeahhh, I think people need to wait and see where this leads. The article is strictly from the plaintiffs perspective because the airline won't comment.\n\nI have a hard time believing a pilot would break a door down to pull a man out who was just using the restroom. There had to be something else going on. \n\nLike was the guy being belligerent? Was he actually suffering from an issue or was he doing something else in the bathroom? Obviously he's not going to say \"yeah I wasn't really going to the bathroom, I was hanging out for 30+ minutes and being a dickhead to the staff.\" Also the plaintiff doesn't specify when it happened, perhaps the plane was close to landing? As everyone knows you can't be in the bathroom during that. Maybe the pilot/flight attendants were concerned he was lying because he was in there for 30+ minutes.\n\nA pilot isn't going to risk their license/job by attacking a passenger and doing damage to the plane. Something had to be going on.",
                "The pilot did not break the lock. The bathroom door on an airplane can be unlocked very easily from the outside.",
                "Ok but 30 minutes? Cmon.",
                "This headline and story seem doubtful",
                "Was it an off duty pilot that went and did that? As a pilot you never go back during flight to get involved in a passenger issue, especially a potential security one. "
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "03/23/2025 16:08:31 UTC"
}