{
    "posts": [
        {
            "category": "HOT",
            "title": "Woman dies and another in hospital after cryotherapy session at Paris gym",
            "external_url": "https://www.theguardian.com/world/2025/apr/15/woman-dies-hospital-cryotherapy-paris-gym",
            "upvotes": 1636,
            "date": "04/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e1c914d11deb040a2daddb7e7a32308330b4ddbd/0_579_8688_5213/master/8688.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=59b89eb461ff34a2bee6fe69205abf6a",
            "top_comments": [
                "Inhaled nitrogen displaces the oxygen in your lungs.  Because it is not carbon dioxide, your body does not realize it is being oxygen starved.  You just breath it in and pass out, then die if you do not have assistance.\n\nScary stuff.",
                "> The dead woman, a 29-year-old employee of the gym, collapsed after a nitrogen leak from a cold chamber that had been repaired earlier in the day, sources close to the inquiry said. The colourless and odourless gas is used to create an atmosphere of extreme subzero temperatures.\n\nIf the repair they did was dealing with a leak, this is a tragedy that could have easily been prevented. They could have taken the time to make sure the equipment was indeed safe.",
                "This was completely unnecessary and should have been prevented. I used to work with cryogens and there should have been a risk assessment, and safety measures in place. This is so sad.",
                "This happened in Vegas a decade or so ago. \n\nWeeks after a spa worker was found dead at a Las Vegas cryotherapy center, authorities said Tuesday she suffocated in the chamber chilled by liquid nitrogen.\n\nChelsea Patricia Ake-Salvacion, 24, died accidentally from the asphyxia caused by low oxygen levels, the Clark County coroner’s office said.\n\nThe death drew scrutiny to the treatment where people are subjected to extremely low temperatures not found anywhere on Earth.\n\nBackers claim it can ease pain and inflammation, aid blood flow and weight loss, improve skin and even ward off aging and depression.\n\nThe treatments, however, have not been approved for medical use by the U.S. Food and Drug Administration.\n\n[Link](https://apnews.com/general-news-4b2b9b54c046443694b83bb002e39164#:~:text=LAS%20VEGAS%20(AP)%20—%20Weeks,Clark%20County%20coroner's%20office%20said)",
                "This shit is a pseudo science scam and needs to be banned. These clowns will claim that these chambers that essentially flash freeze your body force your body to expend 100s of calories worth of energy in an extremely short window to fight off the cold and give you the benefits of an extended cardio workout in a very short period of time.\n\nThis is one of the countless scams that, if there were any evidence that this actually worked, would have become a widespread common practice decades ago.",
                ">Modern cryotherapy involves using liquid nitrogen or nitrous oxide to expose the body to temperatures between -110C and -140C (-166F and -230F) in baths or cabins.\n\nSeems they added a 1 in front of the temps.\n\nExposed skin in -230f would break off like the T-1000 at the end of Terminator 2.",
                "Water ice is cold enough for most purposes. And its vapor is harmless.",
                "Why are people playing with liquid nitrogen?",
                "Maybe it was organic nitrogen for maximum health benefits?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Trump officials cut billions in Harvard funds after university defies demands | Trump administration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/14/trump-harvard-funding-freeze",
            "upvotes": 27672,
            "date": "04/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/afd6a3bcc0691545d7f8e402764158b7fa57d58a/0_91_4971_2983/master/4971.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b23276720d3bbb147424850c0c5c17f2",
            "top_comments": [
                "Kinda funny that Trump wants to ban students from wearing masks while federal agents conducting deportations wear them.",
                "Actually reading the demands they sent to Harvard is frighting. Basically they demanded total control over the hiring of staff and admissions. No university in their right mind would do that. The fact that they would even ask these things is absolutely insane.",
                "It's really interesting, the way conservative voters never shut the fuck up about tyranny when they believe the government is serving anyone except exclusively them. But when the government starts cutting aid as punishment for defiance - an example of actual tyranny, for the record - it's fucking crickets from the conservative voter base.",
                "He can withhold money RIGHT AWAY. But go retrieve a human he trafficked? That's not possible.",
                "About to meet the real deep state.",
                "The actions of a vengeful man who never learned to regulate his emotions beyond the toddler stage.",
                "This is the hallmark of a totalitarian dictator.  Any university that caves to this, especially with the massive endowments that Harvard has deserves to lose their reputation.",
                "Harvard are rich enough and old enough (388 years) to tell this tinpot dictator to go fuck himself. \n\nAt least someone in power is doing it.",
                "You can tell he just hears news about something that pisses him off and makes a snap emotional decision that compensates for his ego. Scary potential.",
                "Not an administration, a REGIME. Trump is not a leader, he's a dictator. Say what it really is."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "In a first, Japan issues cease-and-desist order against Google",
            "external_url": "https://www.japantimes.co.jp/business/2025/04/15/companies/google-anti-monopoly-law/",
            "upvotes": 1188,
            "date": "04/15/2025",
            "thumbnail": "https://www.japantimes.co.jp/japantimes/uploads/images/2025/04/15/463652.jpg?v=3.1",
            "top_comments": [
                "I’m all for reining in big tech. Going by the article though, if there is no default choice, then these “at least 6” of the manufacturers would lose search revenue sharing that is cited… which then i assume would lower overall choice in the market from a phone manufacturer perspective further consolidating the market to Google and Apple",
                "I agree with this, even Microsoft got the heat in the 90's. But, how has Apple been so immune to this?",
                "Can you buy a laptop without either Windows or Apple on it? I don't understand, unless this is just the beginning...",
                "Wow this must really hurt after getting fined $2 undecillion by Russia"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Columbia Activist Arrested by ICE at His Appointment for Citizenship",
            "external_url": "https://www.nytimes.com/2025/04/14/nyregion/columbia-student-palestinian-arrested-ice.html?unlocked_article_code=1._k4.cex1.lATs6MwweUmU&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 20626,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Mr. Mahdawi has not been accused of a crime. According to his lawyers, the Trump administration appears to be seeking his removal from the country under the same legal provision that it is using to detain another recent Columbia student and Palestinian, Mahmoud Khalil, contending that his presence is a threat to the foreign policy and national security interests of the United States. Immigration officials have argued that pro-Palestinian demonstrators have enabled the spread of antisemitism, but they have not offered evidence to substantiate the claim.\n\nThis is the real issue. Rubio can just say this guy’s presence harms our foreign policy agenda and SCOTUS has already said a judge can’t overrule that or challenge it in any way, despite Rubio not presenting any evidence to support it. \n\nSo, once again, if the government says you’re a terrorist, they can deport you without any evidence of that, and ~~SCOTUS has affirmed that somehow that’s legal and constitutional!~~\n\nEDIT: Clarifying one point (corrected above) - SCOTUS has not (yet) ruled on Khalil’s case, that was a judge in Louisiana. That ruling is in the process of being appealed.",
                "4th amendment protects “people” (not citizens) from unreasonable arrests, without charging him with a crime this is kidnapping and false imprisonment; and if they can do it to him they can do it to anyone.",
                "Brownshirts disappear another person in broad daylight.",
                "Honestly, me as a legal immigrant, with a good education and positively contributing to my community,  I feel in danger, I can’t imagine how the other human beings who came to this country to try a better life as many did in the last century feels right now.\n\nAnd honestly again, it does not look like the base of US society cares on what he does, if he doesn’t harm the economy.",
                "Representatives for Columbia declined to comment, citing federal student privacy regulations.. \nLOL the fucking irony with them.",
                "Disband ICE.\n\nThe new secret police.",
                "Trump is using the DOJ to disappear non-citizens now, but nothing is stopping him from doing it to citizens.",
                "Guys they told you it will be bloodless if you allow it to be.",
                "This is what people voted for.",
                "This so so scary. I was a green card holder for ten years until I went to college and was eligible for citizenship.  Back then, I had political positions that differed from the Bush administration.  I can’t imagine being led away because I had a common, fundamental disagreement with governmental policy.  I bet a lot of maga are cheering this on, not realizing some day, the same process can be used against them.  The system protects us, not the dictator."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Columbia University associate of Mahmoud Khalil arrested by DHS",
            "external_url": "https://abcnews.go.com/US/columbia-university-associate-mahmoud-khalil-arrested-dhs/story?id=120800223",
            "upvotes": 1892,
            "date": "04/15/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/976f57fb-ea5a-49e6-918e-6344e0df982c/Mohsen-Mahdawi-ht-gmh-250414_1744661888780_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "We have elected an administration which is morally reprehensible and it’s difficult to understand how American can ever recover. ",
                "I had a different comment in mind but I actually thought it might legitimately be dangerous to post that. This timeline sucks.",
                "[removed]",
                "Can't be arrested on not even suspicion of crime, just feelings.  \n\n\nHe was kidnapped by the state.",
                "Elect Nazis you get Nazis.",
                ">Mr. Mahdawi is fearful that, if he loses his lawful permanent resident status and he is removed to the West Bank, he will experience the same harassment, detention, and torture that his family has experienced....\n\n\nGood news: he'll be getting sent to el salvador, not the west bank. /s\n\n ...fuck.",
                "[removed]",
                "The second amendment people were always saying it’s there to protect us from an oppressive government. Why are they dead silent right now?",
                "watch white people twitter and leopards ate my face to circle up for their circle jerks with glee at this even though neither voted for trump",
                "We should be thankful that a kind and intelligent man like Mahmoud wants to live and study in our country, but instead we kidnap him and treat him like shit. What a fucking embarrassment of a country"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "US sees biggest drop in Australian visitors since Covid as travellers avoid Trump’s America",
            "external_url": "https://www.theguardian.com/australia-news/2025/apr/15/us-sees-biggest-drop-in-australian-visitors-since-covid-as-travellers-avoid-trumps-america",
            "upvotes": 33864,
            "date": "04/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/32eb6410fc03cf6fbe66f73498734b5e15bbcbce/0_0_5150_3091/master/5150.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a710af17fcfae470b219b576ff0e3974",
            "top_comments": [
                "why risk being deported to a El Salvador prison for life?",
                "Even Americans want to avoid Trump’s America.",
                "Sorry America but your president is a cunt.",
                "Twice a year, I attend an international conference for engineers. It's always held in the U.S. and attendance can sometimes be as high as 50,000 people. Our last conference was an absolute ghost town. Id be surprised if we cracked 8000 people. We had to cancel committee meetings due to lack of attendance. Literally, not a single Canadian attended that I'm aware of. And I'm used to running into many.",
                "Don't come to America. Please. Stay away. It's not that I don't like you, I just don't want you to end up in a torture prison in El Salvador with no due process.",
                "If not dictatorship, why dictatorship shaped?",
                "I'd like to remind everyone that Trump said that the world wouldn't respect the US with Kamala Harris as the president.  \n\nSo many of his supporters believed him too.  \"Kamala will embarrass us on the world stage!!\" they said.\n\nIt makes me so angry to think about the fact that all the ruin that Kamala was supposedly going to cause, Trump is doing a million times worse.  And his supporters just keep saying, \"Give him time.\" \n\nIf we give him any time, we won't have a country left.",
                "Just imagine going to visit a new country, tasting the food, and ending up in a prison in El Salvador, without due process. The land of freedom, yeah...",
                "Didn’t the US just have an incident where an Australian citizen got interrogated and their shit taken and the officier who did it was just like “Lol Trump won I do what I want to who I want now.” \n\nNo shit Australians aren’t coming here. Fucking hours on a flight just to get thrown in a jail cell or vanished into a gulag? They might as well just visit Iran at that point. It’s at least closer if not safer.",
                "No shit, who wants to visit a country where non citizens can be grabbed and deported on a whim to a slave labor camp."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "West Point graduate becomes the first woman to compete in the grueling Army Ranger contest",
            "external_url": "https://apnews.com/article/army-ranger-competition-female-first-7182c5659e04162a4476eae2113b15d7",
            "upvotes": 339,
            "date": "04/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Her team came in 14th of 52.  Nice job.",
                "Great... now she will be canned because of DEI.",
                "Surprised the current leadership allowed it."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "HOT",
            "title": "Harvard University rejects Trump administration's proposed conditions for federal funding",
            "external_url": "https://www.cbsnews.com/boston/news/harvard-university-trump-federal-funding/",
            "upvotes": 14354,
            "date": "04/14/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/09/11/5ac72c51-54d4-468b-85ad-ab4e6c6498d1/thumbnail/1200x630/e8eea82be00e3f7cadfd3999429d4642/harvard-university.jpg?v=22a842e47fa1552047fb956f78e1acf0",
            "top_comments": [
                ">A letter sent to Harvard on April 11 outlined a series of conditions Harvard needed to meet to maintain a \"financial relationship\" with the federal government. The demands included leadership reforms, an immediate halt to diversity, equity and inclusion policies, an audit of \"viewpoint diversity\" among students and faculty, and \"meaningful discipline\" for students who violated school policies when a pro-Palestinian tent encampment went up on Harvard Yard. \n\nFor those who wondered what the conditions were.",
                "I was really concerned after Columbia that they would all fold. I am happy to see at least some arent for now",
                "It’s about time. I hope more universities soon follow!",
                "This is what “fuck you” money looks like. ",
                "Read the letter from the government to Harvard. Insane that the federal government tried to dictate to a private university things like the following: \n\n+ Harvard must ban specific student clubs and discipline their members\n\n+ Harvard must enforce \"viewpoint diversity\" (that is, make sure that every department hires more Republican faculty and admits more Republican students) \n\n+ Harvard must ban masks",
                "Harvard knows game theory.  If more universities follow suit, there are going to be a whole lot of pissed off parents and employers.  And they won't be pissed off at the universities.",
                "This should sound the alarm in any democracy. They are threatening defunding of one of the most prestigious universities if they don't fall in line with the narrative of the administration.",
                "It's almost like Harvard has a massive endowment and a shitload of Harvard-trained lawyers they can call on.",
                "Republicans have gone off the deep end. I’ve never been a Republican but past conservative presidents just never would have done any of this shit.",
                "Comply with a bully they'll bully you some more. "
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "U.S. businesses sue to block Trump tariffs, say trade deficits are not an emergency",
            "external_url": "https://www.cnbc.com/2025/04/14/us-businesses-sue-to-block-trump-tariffs-say-trade-deficits-are-not-an-emergency.html",
            "upvotes": 15281,
            "date": "04/14/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108130239-17443060692025-04-10t171901z_1554291057_rc25vda791jm_rtrmadp_0_usa-trump.jpeg?v=1744664864&w=1920&h=1080",
            "top_comments": [
                "[deleted]",
                "By any reasonable definition Trump is _very clearly_ (as in beyond a shadow of a doubt) abusing emergency powers. And abusing them badly. Dictatorially.\n\nReasonable definitions no longer apply in this country, though.",
                "Only matters if 2/3rds of the Senate agree. Sooo get used to a tanking economy.",
                "Trump is ignoring the Supreme Court, your lawsuits won't matter to him at all",
                "Shame he will ignore the judges. A bribe might be more effective. ",
                "They are absolutely correct, of course. That said, I'm skeptical that a judge is going to allow private business to overrule what the federal government decides is a national emergency.",
                "This will be an interesting lawsuit. I believe they are seeking an injunction as well. Since this is court of International Trade it would have jurisdiction to issue the injunction. Secretly Republicans are hoping courts rules against Trump so they don’t have to reign him in",
                "It's as if their Congressional Reps are devoid of any legal power on their behalf. I wonder if any of these said businesses donated money to Republican reps who sit idly by as Trump jeopardizes their constituents' livelihoods.",
                "Good thing that Congress paused \"the concept of days passing\" so that they don't have to vote on ending the emergency powers granted to Trump that he's using to enact all these tariffs.",
                "[https://www.theguardian.com/us-news/2025/apr/07/trump-tariffs-lawsuit](https://www.theguardian.com/us-news/2025/apr/07/trump-tariffs-lawsuit)\n\nfun fact the Koch brothers are suing the government. Yes those Koch brother republican mega-donors."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Panama opposition party accuses US of ‘camouflaged invasion’",
            "external_url": "https://www.theguardian.com/world/2025/apr/12/panama-hegseth-us-invasion-canal",
            "upvotes": 4867,
            "date": "04/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7bf75c775d223205be1dc61e405462971266fcc2/0_322_4827_2895/master/4827.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=560d918d4f7f03ff4d73c54f899d89e6",
            "top_comments": [
                "Nothing camo about it. Trump wants territory, resist or you'll find policy more aggressive by the year. ",
                "Why are countries losing trust in us? It must be DEI.",
                "The silver lining is that while the Trump administration is corrupt and fascist, it's also stunningly incompetent.\n\nIt's Stalin mixed with simple Jack.",
                "*For many Panamanians, the return of US armed forces – even for supposed “joint operations” – will bring back uncomfortable memories of 1989’s Operation Just Cause, when* [*American troops killed hundreds of civilians*](https://www.theguardian.com/world/2025/jan/12/panama-canal-trump)\n\nAdd this to Trump's imperial big mouth threats to take it over--and then sending troops back into the abandoned US bases, which Panamanians are not permitted to enter, and you do a \"camouflaged invasion.\"",
                "No Panama, this is open invasion",
                "Panama, we're just as concerned here in the US. The day will come when the Trump cult \"disappears\" us to some foreign prison. That's where we're headed.",
                "Don't let the greedy pasty crusty old gringos touch your land",
                "Hostile action from the United States in a Latin American country over economic benefits?  Hmm, where have I heard that one before for an entire century?",
                "Like the “little green men” that invaded Crimea in 2014",
                "Translation, they want to control Panama. They will close Panama to \"hostile shipping\". This is very concerning. They are planning for war."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Tax Day 2025: Food Freebies and Discounts Today Only – April 15",
            "external_url": "https://frugalhunters.com/tax-day-2025-get-food-freebies-and-discounts-today-only-april-15/",
            "upvotes": 1,
            "date": "04/15/2025",
            "thumbnail": "https://frugalhunters.com/wp-content/uploads/2025/04/Tax-Day-2025-Get-Food-Freebies-and-Discounts-Today-Only-–-April-15.png",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Florida women arrested for selling human remains on Facebook Marketplace: Police",
            "external_url": "https://abcnews.go.com/US/florida-woman-arrested-selling-human-remains-facebook-marketplace/story?id=120787595",
            "upvotes": 123,
            "date": "04/15/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/9a03cf68-2e8b-4824-9252-74404fd65df8/Kymberlee-Schopper-ht-gmh-250414_1744648529293_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The title really is trying to go all “Florida Man” on this story. The lady was selling very old human bones in a store and wasn’t aware it was illegal because she claimed they were educational in nature. ",
                "Is this still available?",
                ">Police spoke to Lelesi, the co-owner of Wicked Wonderland, who said the store had been selling human bones for \"several years and was unaware that it was prohibited in the state of Florida,\" the affidavit said.\n\nIt's not illegal in every state and not illegal federally.[ Florida is one of those states](https://theconversation.com/is-it-legal-to-sell-human-remains-171192), however.",
                "While I’m out looking for deals on RC cars and trucks…",
                "Shauna Shipman has gone too far…",
                "The bones were her money. ",
                "Gotta keep those chemtrails in line, Florida.",
                "“Life, love, death and family.”\n\n\nSounds like a charming little shop for death cults and psychopaths.",
                "Ugh, and it's Florida.",
                "Just another day in Florida…"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "West Point graduate becomes the first woman to compete in the grueling Army Ranger contest",
            "external_url": "https://apnews.com/article/army-ranger-competition-female-first-7182c5659e04162a4476eae2113b15d7",
            "upvotes": 342,
            "date": "04/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Her team came in 14th of 52.  Nice job.",
                "Great... now she will be canned because of DEI.",
                "Surprised the current leadership allowed it."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "Woman dies and another in hospital after cryotherapy session at Paris gym",
            "external_url": "https://www.theguardian.com/world/2025/apr/15/woman-dies-hospital-cryotherapy-paris-gym",
            "upvotes": 1640,
            "date": "04/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e1c914d11deb040a2daddb7e7a32308330b4ddbd/0_579_8688_5213/master/8688.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=59b89eb461ff34a2bee6fe69205abf6a",
            "top_comments": [
                "Inhaled nitrogen displaces the oxygen in your lungs.  Because it is not carbon dioxide, your body does not realize it is being oxygen starved.  You just breath it in and pass out, then die if you do not have assistance.\n\nScary stuff.",
                "> The dead woman, a 29-year-old employee of the gym, collapsed after a nitrogen leak from a cold chamber that had been repaired earlier in the day, sources close to the inquiry said. The colourless and odourless gas is used to create an atmosphere of extreme subzero temperatures.\n\nIf the repair they did was dealing with a leak, this is a tragedy that could have easily been prevented. They could have taken the time to make sure the equipment was indeed safe.",
                "This was completely unnecessary and should have been prevented. I used to work with cryogens and there should have been a risk assessment, and safety measures in place. This is so sad.",
                "This happened in Vegas a decade or so ago. \n\nWeeks after a spa worker was found dead at a Las Vegas cryotherapy center, authorities said Tuesday she suffocated in the chamber chilled by liquid nitrogen.\n\nChelsea Patricia Ake-Salvacion, 24, died accidentally from the asphyxia caused by low oxygen levels, the Clark County coroner’s office said.\n\nThe death drew scrutiny to the treatment where people are subjected to extremely low temperatures not found anywhere on Earth.\n\nBackers claim it can ease pain and inflammation, aid blood flow and weight loss, improve skin and even ward off aging and depression.\n\nThe treatments, however, have not been approved for medical use by the U.S. Food and Drug Administration.\n\n[Link](https://apnews.com/general-news-4b2b9b54c046443694b83bb002e39164#:~:text=LAS%20VEGAS%20(AP)%20—%20Weeks,Clark%20County%20coroner's%20office%20said)",
                "This shit is a pseudo science scam and needs to be banned. These clowns will claim that these chambers that essentially flash freeze your body force your body to expend 100s of calories worth of energy in an extremely short window to fight off the cold and give you the benefits of an extended cardio workout in a very short period of time.\n\nThis is one of the countless scams that, if there were any evidence that this actually worked, would have become a widespread common practice decades ago.",
                ">Modern cryotherapy involves using liquid nitrogen or nitrous oxide to expose the body to temperatures between -110C and -140C (-166F and -230F) in baths or cabins.\n\nSeems they added a 1 in front of the temps.\n\nExposed skin in -230f would break off like the T-1000 at the end of Terminator 2.",
                "Water ice is cold enough for most purposes. And its vapor is harmless.",
                "Why are people playing with liquid nitrogen?",
                "Maybe it was organic nitrogen for maximum health benefits?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "FAA to conduct drone-detection testing in New Jersey",
            "external_url": "https://www.reuters.com/world/us/faa-conduct-drone-detection-testing-new-jersey-2025-04-11/",
            "upvotes": 83,
            "date": "04/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So they're just going to pretend that radar and radio frequency signal mapping tech hasn't existed for decades already? This article, this premise, this press release from the government...it makes absolutely no sense and can't be true.\n\n\nThe tech required to track and detect drones already exists and is public facing. You cannot pretend that the government hasn't been working on this non-stop for the past 50+ years. Reuters should be ashamed of themselves for being willing to publish this.",
                "Did they ever figure out where those drones were from last year?",
                "It sounds like this is long overdue."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "In a first, Japan issues cease-and-desist order against Google",
            "external_url": "https://www.japantimes.co.jp/business/2025/04/15/companies/google-anti-monopoly-law/",
            "upvotes": 1188,
            "date": "04/15/2025",
            "thumbnail": "https://www.japantimes.co.jp/japantimes/uploads/images/2025/04/15/463652.jpg?v=3.1",
            "top_comments": [
                "I’m all for reining in big tech. Going by the article though, if there is no default choice, then these “at least 6” of the manufacturers would lose search revenue sharing that is cited… which then i assume would lower overall choice in the market from a phone manufacturer perspective further consolidating the market to Google and Apple",
                "I agree with this, even Microsoft got the heat in the 90's. But, how has Apple been so immune to this?",
                "Can you buy a laptop without either Windows or Apple on it? I don't understand, unless this is just the beginning...",
                "Wow this must really hurt after getting fined $2 undecillion by Russia"
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "NEW",
            "title": "Columbia University associate of Mahmoud Khalil arrested by DHS",
            "external_url": "https://abcnews.go.com/US/columbia-university-associate-mahmoud-khalil-arrested-dhs/story?id=120800223",
            "upvotes": 1891,
            "date": "04/15/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/976f57fb-ea5a-49e6-918e-6344e0df982c/Mohsen-Mahdawi-ht-gmh-250414_1744661888780_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "We have elected an administration which is morally reprehensible and it’s difficult to understand how American can ever recover. ",
                "I had a different comment in mind but I actually thought it might legitimately be dangerous to post that. This timeline sucks.",
                "[removed]",
                "Can't be arrested on not even suspicion of crime, just feelings.  \n\n\nHe was kidnapped by the state.",
                "Elect Nazis you get Nazis.",
                ">Mr. Mahdawi is fearful that, if he loses his lawful permanent resident status and he is removed to the West Bank, he will experience the same harassment, detention, and torture that his family has experienced....\n\n\nGood news: he'll be getting sent to el salvador, not the west bank. /s\n\n ...fuck.",
                "[removed]",
                "The second amendment people were always saying it’s there to protect us from an oppressive government. Why are they dead silent right now?",
                "watch white people twitter and leopards ate my face to circle up for their circle jerks with glee at this even though neither voted for trump",
                "We should be thankful that a kind and intelligent man like Mahmoud wants to live and study in our country, but instead we kidnap him and treat him like shit. What a fucking embarrassment of a country"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "\"Black Lives Matter\" posters taken down at Lakeville schools; district settles lawsuit",
            "external_url": "https://www.cbsnews.com/minnesota/news/lakeville-schools-black-lives-matter-posters-down-settlement/",
            "upvotes": 395,
            "date": "04/15/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/01/27/b24ecf4e-17dc-473e-8f0e-5b7e39e93d18/thumbnail/1200x630/03ee0c618e68e7a908dd5a648d06ea5e/12p-vo-lakeville-blm-lawsuit-wcco6yry-00-00-4012.jpg?v=22a842e47fa1552047fb956f78e1acf0",
            "top_comments": [
                "You can read an opinion from the eighth circuit on the case [here](https://cases.justia.com/federal/appellate-courts/ca8/23-3115/23-3115-2024-06-26.pdf?ts=1719415825)\n\nBasically: the school board just needed better lawyers when crafting the policy.  The school board originally stated that Black Lives Matter posters were not allowed under their policy forbidding “conduct that is intended to or reasonably could be perceived as endorsing or opposing specific political issues or political candidates”.\n\nLater on, the district made a series of Black Lives Matter posters that teachers could *choose to display*.  This created a “limited public forum”, since they were no longer adhering to their stated policy.  If the government creates a limited public forum then they can’t discriminate on the basis of view point, which means that they would have to allow all / blue lives matter posters as well.\n\nThere are a few different ways the school could have avoided this problem, but it makes sense to settle given the facts of the case and the circuit court decision.",
                "$30k to the predatory law firm that did this",
                "Get your shit together, Lakeville.",
                "I would send out an email telling all the parents that thanks to the racist fucks at their school they will have $30k less for their school budget. Then\nattach a copy of the lawsuit with all appropriate names.",
                "Not long before the protestors themselves will get \"taken down\" to the Trump Death Camps. \n\nWelcome to Germany circa 1933."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Trump officials cut billions in Harvard funds after university defies demands | Trump administration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/14/trump-harvard-funding-freeze",
            "upvotes": 27672,
            "date": "04/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/afd6a3bcc0691545d7f8e402764158b7fa57d58a/0_91_4971_2983/master/4971.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b23276720d3bbb147424850c0c5c17f2",
            "top_comments": [
                "Kinda funny that Trump wants to ban students from wearing masks while federal agents conducting deportations wear them.",
                "Actually reading the demands they sent to Harvard is frighting. Basically they demanded total control over the hiring of staff and admissions. No university in their right mind would do that. The fact that they would even ask these things is absolutely insane.",
                "It's really interesting, the way conservative voters never shut the fuck up about tyranny when they believe the government is serving anyone except exclusively them. But when the government starts cutting aid as punishment for defiance - an example of actual tyranny, for the record - it's fucking crickets from the conservative voter base.",
                "He can withhold money RIGHT AWAY. But go retrieve a human he trafficked? That's not possible.",
                "About to meet the real deep state.",
                "The actions of a vengeful man who never learned to regulate his emotions beyond the toddler stage.",
                "This is the hallmark of a totalitarian dictator.  Any university that caves to this, especially with the massive endowments that Harvard has deserves to lose their reputation.",
                "Harvard are rich enough and old enough (388 years) to tell this tinpot dictator to go fuck himself. \n\nAt least someone in power is doing it.",
                "You can tell he just hears news about something that pisses him off and makes a snap emotional decision that compensates for his ego. Scary potential.",
                "Not an administration, a REGIME. Trump is not a leader, he's a dictator. Say what it really is."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "NEW",
            "title": "Panama opposition party accuses US of ‘camouflaged invasion’",
            "external_url": "https://www.theguardian.com/world/2025/apr/12/panama-hegseth-us-invasion-canal",
            "upvotes": 4873,
            "date": "04/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7bf75c775d223205be1dc61e405462971266fcc2/0_322_4827_2895/master/4827.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=560d918d4f7f03ff4d73c54f899d89e6",
            "top_comments": [
                "Nothing camo about it. Trump wants territory, resist or you'll find policy more aggressive by the year. ",
                "Why are countries losing trust in us? It must be DEI.",
                "The silver lining is that while the Trump administration is corrupt and fascist, it's also stunningly incompetent.\n\nIt's Stalin mixed with simple Jack.",
                "*For many Panamanians, the return of US armed forces – even for supposed “joint operations” – will bring back uncomfortable memories of 1989’s Operation Just Cause, when* [*American troops killed hundreds of civilians*](https://www.theguardian.com/world/2025/jan/12/panama-canal-trump)\n\nAdd this to Trump's imperial big mouth threats to take it over--and then sending troops back into the abandoned US bases, which Panamanians are not permitted to enter, and you do a \"camouflaged invasion.\"",
                "No Panama, this is open invasion",
                "Panama, we're just as concerned here in the US. The day will come when the Trump cult \"disappears\" us to some foreign prison. That's where we're headed.",
                "Don't let the greedy pasty crusty old gringos touch your land",
                "Hostile action from the United States in a Latin American country over economic benefits?  Hmm, where have I heard that one before for an entire century?",
                "Like the “little green men” that invaded Crimea in 2014",
                "Translation, they want to control Panama. They will close Panama to \"hostile shipping\". This is very concerning. They are planning for war."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "West Point graduate becomes the first woman to compete in the grueling Army Ranger contest",
            "external_url": "https://apnews.com/article/army-ranger-competition-female-first-7182c5659e04162a4476eae2113b15d7",
            "upvotes": 342,
            "date": "04/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Her team came in 14th of 52.  Nice job.",
                "Great... now she will be canned because of DEI.",
                "Surprised the current leadership allowed it."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "In a first, Japan issues cease-and-desist order against Google",
            "external_url": "https://www.japantimes.co.jp/business/2025/04/15/companies/google-anti-monopoly-law/",
            "upvotes": 1189,
            "date": "04/15/2025",
            "thumbnail": "https://www.japantimes.co.jp/japantimes/uploads/images/2025/04/15/463652.jpg?v=3.1",
            "top_comments": [
                "I’m all for reining in big tech. Going by the article though, if there is no default choice, then these “at least 6” of the manufacturers would lose search revenue sharing that is cited… which then i assume would lower overall choice in the market from a phone manufacturer perspective further consolidating the market to Google and Apple",
                "I agree with this, even Microsoft got the heat in the 90's. But, how has Apple been so immune to this?",
                "Can you buy a laptop without either Windows or Apple on it? I don't understand, unless this is just the beginning...",
                "Wow this must really hurt after getting fined $2 undecillion by Russia"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Woman dies and another in hospital after cryotherapy session at Paris gym",
            "external_url": "https://www.theguardian.com/world/2025/apr/15/woman-dies-hospital-cryotherapy-paris-gym",
            "upvotes": 1636,
            "date": "04/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e1c914d11deb040a2daddb7e7a32308330b4ddbd/0_579_8688_5213/master/8688.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=59b89eb461ff34a2bee6fe69205abf6a",
            "top_comments": [
                "Inhaled nitrogen displaces the oxygen in your lungs.  Because it is not carbon dioxide, your body does not realize it is being oxygen starved.  You just breath it in and pass out, then die if you do not have assistance.\n\nScary stuff.",
                "> The dead woman, a 29-year-old employee of the gym, collapsed after a nitrogen leak from a cold chamber that had been repaired earlier in the day, sources close to the inquiry said. The colourless and odourless gas is used to create an atmosphere of extreme subzero temperatures.\n\nIf the repair they did was dealing with a leak, this is a tragedy that could have easily been prevented. They could have taken the time to make sure the equipment was indeed safe.",
                "This was completely unnecessary and should have been prevented. I used to work with cryogens and there should have been a risk assessment, and safety measures in place. This is so sad.",
                "This happened in Vegas a decade or so ago. \n\nWeeks after a spa worker was found dead at a Las Vegas cryotherapy center, authorities said Tuesday she suffocated in the chamber chilled by liquid nitrogen.\n\nChelsea Patricia Ake-Salvacion, 24, died accidentally from the asphyxia caused by low oxygen levels, the Clark County coroner’s office said.\n\nThe death drew scrutiny to the treatment where people are subjected to extremely low temperatures not found anywhere on Earth.\n\nBackers claim it can ease pain and inflammation, aid blood flow and weight loss, improve skin and even ward off aging and depression.\n\nThe treatments, however, have not been approved for medical use by the U.S. Food and Drug Administration.\n\n[Link](https://apnews.com/general-news-4b2b9b54c046443694b83bb002e39164#:~:text=LAS%20VEGAS%20(AP)%20—%20Weeks,Clark%20County%20coroner's%20office%20said)",
                "This shit is a pseudo science scam and needs to be banned. These clowns will claim that these chambers that essentially flash freeze your body force your body to expend 100s of calories worth of energy in an extremely short window to fight off the cold and give you the benefits of an extended cardio workout in a very short period of time.\n\nThis is one of the countless scams that, if there were any evidence that this actually worked, would have become a widespread common practice decades ago.",
                ">Modern cryotherapy involves using liquid nitrogen or nitrous oxide to expose the body to temperatures between -110C and -140C (-166F and -230F) in baths or cabins.\n\nSeems they added a 1 in front of the temps.\n\nExposed skin in -230f would break off like the T-1000 at the end of Terminator 2.",
                "Water ice is cold enough for most purposes. And its vapor is harmless.",
                "Why are people playing with liquid nitrogen?",
                "Maybe it was organic nitrogen for maximum health benefits?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Columbia University associate of Mahmoud Khalil arrested by DHS",
            "external_url": "https://abcnews.go.com/US/columbia-university-associate-mahmoud-khalil-arrested-dhs/story?id=120800223",
            "upvotes": 1892,
            "date": "04/15/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/976f57fb-ea5a-49e6-918e-6344e0df982c/Mohsen-Mahdawi-ht-gmh-250414_1744661888780_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "We have elected an administration which is morally reprehensible and it’s difficult to understand how American can ever recover. ",
                "I had a different comment in mind but I actually thought it might legitimately be dangerous to post that. This timeline sucks.",
                "[removed]",
                "Can't be arrested on not even suspicion of crime, just feelings.  \n\n\nHe was kidnapped by the state.",
                "Elect Nazis you get Nazis.",
                ">Mr. Mahdawi is fearful that, if he loses his lawful permanent resident status and he is removed to the West Bank, he will experience the same harassment, detention, and torture that his family has experienced....\n\n\nGood news: he'll be getting sent to el salvador, not the west bank. /s\n\n ...fuck.",
                "[removed]",
                "The second amendment people were always saying it’s there to protect us from an oppressive government. Why are they dead silent right now?",
                "watch white people twitter and leopards ate my face to circle up for their circle jerks with glee at this even though neither voted for trump",
                "We should be thankful that a kind and intelligent man like Mahmoud wants to live and study in our country, but instead we kidnap him and treat him like shit. What a fucking embarrassment of a country"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Trump officials cut billions in Harvard funds after university defies demands | Trump administration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/14/trump-harvard-funding-freeze",
            "upvotes": 27673,
            "date": "04/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/afd6a3bcc0691545d7f8e402764158b7fa57d58a/0_91_4971_2983/master/4971.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b23276720d3bbb147424850c0c5c17f2",
            "top_comments": [
                "Kinda funny that Trump wants to ban students from wearing masks while federal agents conducting deportations wear them.",
                "Actually reading the demands they sent to Harvard is frighting. Basically they demanded total control over the hiring of staff and admissions. No university in their right mind would do that. The fact that they would even ask these things is absolutely insane.",
                "It's really interesting, the way conservative voters never shut the fuck up about tyranny when they believe the government is serving anyone except exclusively them. But when the government starts cutting aid as punishment for defiance - an example of actual tyranny, for the record - it's fucking crickets from the conservative voter base.",
                "He can withhold money RIGHT AWAY. But go retrieve a human he trafficked? That's not possible.",
                "About to meet the real deep state.",
                "The actions of a vengeful man who never learned to regulate his emotions beyond the toddler stage.",
                "This is the hallmark of a totalitarian dictator.  Any university that caves to this, especially with the massive endowments that Harvard has deserves to lose their reputation.",
                "Harvard are rich enough and old enough (388 years) to tell this tinpot dictator to go fuck himself. \n\nAt least someone in power is doing it.",
                "You can tell he just hears news about something that pisses him off and makes a snap emotional decision that compensates for his ego. Scary potential.",
                "Not an administration, a REGIME. Trump is not a leader, he's a dictator. Say what it really is."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Columbia Activist Arrested by ICE at His Appointment for Citizenship",
            "external_url": "https://www.nytimes.com/2025/04/14/nyregion/columbia-student-palestinian-arrested-ice.html?unlocked_article_code=1._k4.cex1.lATs6MwweUmU&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 20623,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Mr. Mahdawi has not been accused of a crime. According to his lawyers, the Trump administration appears to be seeking his removal from the country under the same legal provision that it is using to detain another recent Columbia student and Palestinian, Mahmoud Khalil, contending that his presence is a threat to the foreign policy and national security interests of the United States. Immigration officials have argued that pro-Palestinian demonstrators have enabled the spread of antisemitism, but they have not offered evidence to substantiate the claim.\n\nThis is the real issue. Rubio can just say this guy’s presence harms our foreign policy agenda and SCOTUS has already said a judge can’t overrule that or challenge it in any way, despite Rubio not presenting any evidence to support it. \n\nSo, once again, if the government says you’re a terrorist, they can deport you without any evidence of that, and ~~SCOTUS has affirmed that somehow that’s legal and constitutional!~~\n\nEDIT: Clarifying one point (corrected above) - SCOTUS has not (yet) ruled on Khalil’s case, that was a judge in Louisiana. That ruling is in the process of being appealed.",
                "4th amendment protects “people” (not citizens) from unreasonable arrests, without charging him with a crime this is kidnapping and false imprisonment; and if they can do it to him they can do it to anyone.",
                "Brownshirts disappear another person in broad daylight.",
                "Honestly, me as a legal immigrant, with a good education and positively contributing to my community,  I feel in danger, I can’t imagine how the other human beings who came to this country to try a better life as many did in the last century feels right now.\n\nAnd honestly again, it does not look like the base of US society cares on what he does, if he doesn’t harm the economy.",
                "Representatives for Columbia declined to comment, citing federal student privacy regulations.. \nLOL the fucking irony with them.",
                "Disband ICE.\n\nThe new secret police.",
                "Trump is using the DOJ to disappear non-citizens now, but nothing is stopping him from doing it to citizens.",
                "Guys they told you it will be bloodless if you allow it to be.",
                "This is what people voted for.",
                "This so so scary. I was a green card holder for ten years until I went to college and was eligible for citizenship.  Back then, I had political positions that differed from the Bush administration.  I can’t imagine being led away because I had a common, fundamental disagreement with governmental policy.  I bet a lot of maga are cheering this on, not realizing some day, the same process can be used against them.  The system protects us, not the dictator."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US sees biggest drop in Australian visitors since Covid as travellers avoid Trump’s America",
            "external_url": "https://www.theguardian.com/australia-news/2025/apr/15/us-sees-biggest-drop-in-australian-visitors-since-covid-as-travellers-avoid-trumps-america",
            "upvotes": 33856,
            "date": "04/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/32eb6410fc03cf6fbe66f73498734b5e15bbcbce/0_0_5150_3091/master/5150.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a710af17fcfae470b219b576ff0e3974",
            "top_comments": [
                "why risk being deported to a El Salvador prison for life?",
                "Even Americans want to avoid Trump’s America.",
                "Sorry America but your president is a cunt.",
                "Twice a year, I attend an international conference for engineers. It's always held in the U.S. and attendance can sometimes be as high as 50,000 people. Our last conference was an absolute ghost town. Id be surprised if we cracked 8000 people. We had to cancel committee meetings due to lack of attendance. Literally, not a single Canadian attended that I'm aware of. And I'm used to running into many.",
                "Don't come to America. Please. Stay away. It's not that I don't like you, I just don't want you to end up in a torture prison in El Salvador with no due process.",
                "If not dictatorship, why dictatorship shaped?",
                "I'd like to remind everyone that Trump said that the world wouldn't respect the US with Kamala Harris as the president.  \n\nSo many of his supporters believed him too.  \"Kamala will embarrass us on the world stage!!\" they said.\n\nIt makes me so angry to think about the fact that all the ruin that Kamala was supposedly going to cause, Trump is doing a million times worse.  And his supporters just keep saying, \"Give him time.\" \n\nIf we give him any time, we won't have a country left.",
                "Just imagine going to visit a new country, tasting the food, and ending up in a prison in El Salvador, without due process. The land of freedom, yeah...",
                "Didn’t the US just have an incident where an Australian citizen got interrogated and their shit taken and the officier who did it was just like “Lol Trump won I do what I want to who I want now.” \n\nNo shit Australians aren’t coming here. Fucking hours on a flight just to get thrown in a jail cell or vanished into a gulag? They might as well just visit Iran at that point. It’s at least closer if not safer.",
                "No shit, who wants to visit a country where non citizens can be grabbed and deported on a whim to a slave labor camp."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Harvard University rejects Trump administration's proposed conditions for federal funding",
            "external_url": "https://www.cbsnews.com/boston/news/harvard-university-trump-federal-funding/",
            "upvotes": 14345,
            "date": "04/14/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/09/11/5ac72c51-54d4-468b-85ad-ab4e6c6498d1/thumbnail/1200x630/e8eea82be00e3f7cadfd3999429d4642/harvard-university.jpg?v=22a842e47fa1552047fb956f78e1acf0",
            "top_comments": [
                ">A letter sent to Harvard on April 11 outlined a series of conditions Harvard needed to meet to maintain a \"financial relationship\" with the federal government. The demands included leadership reforms, an immediate halt to diversity, equity and inclusion policies, an audit of \"viewpoint diversity\" among students and faculty, and \"meaningful discipline\" for students who violated school policies when a pro-Palestinian tent encampment went up on Harvard Yard. \n\nFor those who wondered what the conditions were.",
                "I was really concerned after Columbia that they would all fold. I am happy to see at least some arent for now",
                "It’s about time. I hope more universities soon follow!",
                "This is what “fuck you” money looks like. ",
                "Read the letter from the government to Harvard. Insane that the federal government tried to dictate to a private university things like the following: \n\n+ Harvard must ban specific student clubs and discipline their members\n\n+ Harvard must enforce \"viewpoint diversity\" (that is, make sure that every department hires more Republican faculty and admits more Republican students) \n\n+ Harvard must ban masks",
                "Harvard knows game theory.  If more universities follow suit, there are going to be a whole lot of pissed off parents and employers.  And they won't be pissed off at the universities.",
                "This should sound the alarm in any democracy. They are threatening defunding of one of the most prestigious universities if they don't fall in line with the narrative of the administration.",
                "It's almost like Harvard has a massive endowment and a shitload of Harvard-trained lawyers they can call on.",
                "Republicans have gone off the deep end. I’ve never been a Republican but past conservative presidents just never would have done any of this shit.",
                "Comply with a bully they'll bully you some more. "
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "U.S. businesses sue to block Trump tariffs, say trade deficits are not an emergency",
            "external_url": "https://www.cnbc.com/2025/04/14/us-businesses-sue-to-block-trump-tariffs-say-trade-deficits-are-not-an-emergency.html",
            "upvotes": 15288,
            "date": "04/14/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108130239-17443060692025-04-10t171901z_1554291057_rc25vda791jm_rtrmadp_0_usa-trump.jpeg?v=1744664864&w=1920&h=1080",
            "top_comments": [
                "[deleted]",
                "By any reasonable definition Trump is _very clearly_ (as in beyond a shadow of a doubt) abusing emergency powers. And abusing them badly. Dictatorially.\n\nReasonable definitions no longer apply in this country, though.",
                "Only matters if 2/3rds of the Senate agree. Sooo get used to a tanking economy.",
                "Trump is ignoring the Supreme Court, your lawsuits won't matter to him at all",
                "Shame he will ignore the judges. A bribe might be more effective. ",
                "They are absolutely correct, of course. That said, I'm skeptical that a judge is going to allow private business to overrule what the federal government decides is a national emergency.",
                "This will be an interesting lawsuit. I believe they are seeking an injunction as well. Since this is court of International Trade it would have jurisdiction to issue the injunction. Secretly Republicans are hoping courts rules against Trump so they don’t have to reign him in",
                "It's as if their Congressional Reps are devoid of any legal power on their behalf. I wonder if any of these said businesses donated money to Republican reps who sit idly by as Trump jeopardizes their constituents' livelihoods.",
                "Good thing that Congress paused \"the concept of days passing\" so that they don't have to vote on ending the emergency powers granted to Trump that he's using to enact all these tariffs.",
                "[https://www.theguardian.com/us-news/2025/apr/07/trump-tariffs-lawsuit](https://www.theguardian.com/us-news/2025/apr/07/trump-tariffs-lawsuit)\n\nfun fact the Koch brothers are suing the government. Yes those Koch brother republican mega-donors."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Panama opposition party accuses US of ‘camouflaged invasion’",
            "external_url": "https://www.theguardian.com/world/2025/apr/12/panama-hegseth-us-invasion-canal",
            "upvotes": 4874,
            "date": "04/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7bf75c775d223205be1dc61e405462971266fcc2/0_322_4827_2895/master/4827.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=560d918d4f7f03ff4d73c54f899d89e6",
            "top_comments": [
                "Nothing camo about it. Trump wants territory, resist or you'll find policy more aggressive by the year. ",
                "Why are countries losing trust in us? It must be DEI.",
                "The silver lining is that while the Trump administration is corrupt and fascist, it's also stunningly incompetent.\n\nIt's Stalin mixed with simple Jack.",
                "*For many Panamanians, the return of US armed forces – even for supposed “joint operations” – will bring back uncomfortable memories of 1989’s Operation Just Cause, when* [*American troops killed hundreds of civilians*](https://www.theguardian.com/world/2025/jan/12/panama-canal-trump)\n\nAdd this to Trump's imperial big mouth threats to take it over--and then sending troops back into the abandoned US bases, which Panamanians are not permitted to enter, and you do a \"camouflaged invasion.\"",
                "No Panama, this is open invasion",
                "Panama, we're just as concerned here in the US. The day will come when the Trump cult \"disappears\" us to some foreign prison. That's where we're headed.",
                "Don't let the greedy pasty crusty old gringos touch your land",
                "Hostile action from the United States in a Latin American country over economic benefits?  Hmm, where have I heard that one before for an entire century?",
                "Like the “little green men” that invaded Crimea in 2014",
                "Translation, they want to control Panama. They will close Panama to \"hostile shipping\". This is very concerning. They are planning for war."
            ],
            "aggregate_sentiment": 18.0
        }
    ],
    "last_updated": "04/15/2025 16:09:10 UTC"
}