{
    "posts": [
        {
            "category": "HOT",
            "title": "Australia reelects Labor party",
            "external_url": "https://www.abc.net.au/news/elections/federal/2025/results",
            "upvotes": 2566,
            "date": "05/03/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/5cead005ccec832c8b67962996764ab6?impolicy=wcms_crop_resize&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
            "top_comments": [
                "For non-Australians, the Labor party is our left-leaning party. The Liberal Party (which is the conservative party) tried to take a page out of Trump’s book in its campaign, which resulted in this outcome. Honestly they would have had a much better chance if they’d stuck to their usual guns – Trump is not a popular figure among the majority of the populace (although this year a new party ran called “Trumpet of Patriots”, which has an undeniable “Make Australia Great Again” air to it. That party has so far earned over 2% of the vote… take from that what you will).",
                "I love how being seen as having anything in common with Trump is the recipe for losing an election, and even losing their own seat. \n\nHe’s a loser of a man, and is contagious.",
                "And! Dutton likely to lose his seat. This is the #trumpeffect",
                "Just as significant is that conservative party leader Peter Dutton (Temu Trump) has had about a 10% swing against him, so is now trailing in his own electorate and may lose his own seat\n\nEdit: the media has now called that Dutton has lost his seat. Polls closed at 6pm, it’s now 8:50pm - it’s such a bloodbath that both of these have already been called.",
                "Dickson had the opportunity to do the funniest thing possible, and they delivered.\n\nAfter Poilievre, it’s now Dutton’s turn to lose his own seat.",
                "Was real nervous that Liberal was gonna actually have a substantial turnout, thank god it was just in my head",
                "Common sense returning to the Commonwealth.",
                "Fuck Murdoch!!\n\nSuck a fat one Spud, you abandoned your electorate during floods to attend billionaire fundraisers. Karma's a bitch",
                "Welp, *that* potato is cooked.",
                "The leader of the opposition lost his own seat. Not an ideal result for him, great for Australia though"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "National Science Foundation Halts Funding Indefinitely",
            "external_url": "https://www.scientificamerican.com/article/under-trump-national-science-foundation-cuts-off-all-funding-to-scientists/",
            "upvotes": 2804,
            "date": "05/03/2025",
            "thumbnail": "https://static.scientificamerican.com/dam/m/2737c995ce342838/original/NSF_Logo_on-HQ.jpg?m=1746204485.782&w=1200",
            "top_comments": [
                "This is so fucked! What's the point of taking intellectualism back to the fucking stone age?!??",
                "Oh God...they told us right there in print what they were going to do and people laughed.  \"Trump just being Trump\" was the most common excuse I heard \n\n\"He doesn't really mean it\"  \n\nYeah none of us are laughing now...more like screaming in terror.",
                "With all this \"cost savings\" they conveniently neglect to mention how much investment they're torching by preventing the completion of these studies.  Many years of scientific research and the funding that supported it will rot on the vine because they're effectively preventing the harvest.  They're f@#$&# liquidating taxpayer investments before they mature... At best to claim they saved a buck.  At worst to intentionally sabotage the government, the dollar, the country, and modern western society.",
                "All of these things are traps set for anyone in the future who would try to fix the damage: they would have to spend a LOT of money to restart all these programs.",
                "This is how you truly crash the economy.\n\nCut all funding to science, thus stifling the innovation and invention that drives the economy.",
                "\"Hell is empty, and all the devils are here.\"",
                "If you don't have a sense for scale, this is IMO the biggest news in weeks. Smart people can't do stuff without their NSF grants. Wow. ",
                "Wow, I don't think ppl understand the gravity of this news. Sadly, without scientists they won't have anyone to explain it to them either. This would shutdown most University STEM research programs.",
                "Looks like we just maxed the tech tree for this playthrough.",
                "I'm funded through the NSF. Overall, the atmosphere in research has been incredibly dim. No one sees even the slightest light at the end of the tunnel."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Man sentenced to 53 years in prison in hate crime murder of 6-year-old Palestinian-American boy",
            "external_url": "https://abcnews.go.com/US/man-sentenced-53-years-prison-hate-crime-murder/story?id=121400634",
            "upvotes": 29488,
            "date": "05/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6d0db2c2-7dbe-4bf7-a781-e7a9021e5fb2/Alfayoumi-ap-er-250502_1746199431318_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "An Illinois man has been sentenced to 53 years in prison for the 2023 fatal stabbing of a 6-year-old Palestinian-American boy.\n\nWadee Alfayoumi was stabbed 26 times and his mother more than a dozen in the Oct. 14, 2023, attack inside their home in the Chicago suburb of Plainfield.\n\nTheir landlord, 73-year-old Joseph Czuba, was convicted in February on multiple murder charges, as well as attempted murder, aggravated battery and hate crime counts. A Will County jury found Czuba guilty of all counts after deliberating for less than two hours.\n\nAuthorities said he targeted his tenants because they were Muslim and in response to the war between Israel and Hamas that had just ignited after Hamas' Oct. 7, 2023, attack on Israel.\n\nWadee's great uncle, Mahmoud Yousef, addressed the sentencing outside the courthouse, telling reporters, \"It doesn't matter what numbers are. He took a life from us. He took a future.\"\n\nThe child's mother, Hanan Shaheen, was the first to take the stand in the weeklong trial.\n\nShe said Czuba attacked her first with a knife, stabbing her multiple times, saying, \"You devil Muslim, you must die,\" as her son watched, according  to WLS, which was in the courtroom.\n\nShe testified that she called 911 from the bathroom when he appeared to leave, but then she started to hear her son screaming, according to WLS.\n\n\"I started hearing my son screaming, screaming, screaming, 'Oh no, stop,'\" Shaheen said, according to WLS.\n\nJurors also listened to the mother's 911 call from the bathroom, in which she was heard telling the dispatcher, \"He's killing my baby,\" WLS reported.\n\nJurors additionally heard remarks Czuba made in a law enforcement vehicle following the attack.\n\n\"I thought they were going to do jihad on me,\" Czuba said, according to WLS.\n\nHe also said he was \"afraid for my life\" and his wife and said the family was \"just like infested rats,\" according to WLS.",
                "No matter what your political, social, cultural or religious views are, if you are killing a 6 year old as result of it, you are wrong.",
                "I initially thought, “damn, only 53 years?” But then I realized he’s already an old POS.",
                "\"I thought they were going to do jihad on me,\" Czuba said, according to WLS.\n\n\nWorld's smartest islamophobe",
                "[removed]",
                "There is a special circle of hell for people like this.",
                "It’s amazing how religious fanatics claim they love god, and think they are better than everyone else, but yet they do the work of the devil, or whatever they call him in their religion.",
                "Omg poor little boy. May he RIP.  Anyone that hurts a child is just a monster \n\nI really wish reddit didn’t have the news just in the middle of scrolling and saw this post, it’s so depressing and heartbreaking. As someone with a young son it just brings me such anxiety and pain to read stories of kids being killed :(",
                "This guy can rot in hell, murdering a 5-year old for his religion, there are no words",
                "You can thank Fox News and all the other right wing media for the death of this child."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "US criticizes Germany for labeling AfD 'extremist'",
            "external_url": "https://www.dw.com/en/us-criticizes-germany-for-labeling-afd-extremist/a-72423560",
            "upvotes": 273,
            "date": "05/03/2025",
            "thumbnail": "https://static.dw.com/image/72413892_6.jpg",
            "top_comments": [
                "If the Trump Administration says it, you can safely bet the opposite is true.",
                "Racists saying don't call racists racists.",
                "Europeans, and especielly germans know what those kind of parties lead to. America is finding out as we speak. \n\n  \nOf course fascists defend other fascists.",
                "[Yeah, this party definitely seems like a normal party in Germany after WWII](https://www.francetvinfo.fr/pictures/1OlwfrVcCJ34l87kBo-nDB63rSc/1200x900/2025/02/15/afd-67b0b001d471c936176354.png)\n\nFor those curious, it says “we protect your kids”",
                "Trump thinks AfD is short for the Aflac Duck",
                "Well if Vance and Rubio disagree you made the right choice.",
                "The US defending literal Nazis tells you what you need to know about what the Americans are today.",
                "No, the idiots that the idiots put in charge are criticizing Germany. The rest of us think this is totally reasonable.",
                "Well the US government is full of fascists so yea of course they would",
                "“Neo-Nazi government criticizes Germany for calling out Neo-Nazis”\n\nThe US is going to go through decades of rebuilding trust once this bullshit era is over with. How are our allies (not the Axis ones) supposed to believe everything’s all good after this? We’ve got half the voting block ready to throw on red patches and pay subscription fees to watch minorities starve in internment camps, and it feels like it’s getting worse every day."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "CDC reports 216 child deaths this flu season, the most in 15 years.",
            "external_url": "https://www.nbcnews.com/health/cold-and-flu/cdc-reports-216-child-deaths-flu-season-15-years-rcna204468",
            "upvotes": 7392,
            "date": "05/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-12/241217-covid-ch-0958-6da6ba.jpg",
            "top_comments": [
                "Time to do away with the CDC child death reporting department.",
                ">There are likely several contributors to this season’s severity, but a big one is that fewer children get flu shots, added O’Leary, a University of Colorado pediatric infectious diseases specialist.\n\n>The flu vaccination rate for U.S. children has plummeted from about 64% five years ago to 49% this season.\n\nDamn, really? That’s an alarming trend.",
                "It was a bad flu season. :/ - signed a pediatrician",
                "If only medicine could come up with a way to prevent children from getting the flu...",
                "People really gonna have to learn all over again why these vaccinations are a thing.",
                "Surely we'll be fine next year\n\nhttps://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-confirms-cancellation-vaccine-advisers-meeting-2025-02-27/",
                "The most in 15 years SO FAR",
                "Republicans: \"There are no amount of kids deaths that is more immportant then me not getting stuck with a needle.\" ",
                "If children are dying of flu in 2025 without extenuating medical circumstances, then their parents are guilty of neglect. Simple as that.",
                " Next year we’ll surely beat this number… since we may not even get a vaccine."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Conservative MP will resign Alberta riding so Poilievre can run again | Globalnews.ca",
            "external_url": "https://globalnews.ca/news/11161267/pierre-poilievre-running-again-alberta/",
            "upvotes": 6028,
            "date": "05/02/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/04/b6dae6fca70b2303a683a628bd7e02b6102a36b480a1c8e090066858390ee6fe_1ba569.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "Say what you want, but this is a little bit embarrassing for him.",
                "Nothing says personal responsibility like blowing a 27-point lead, losing your own seat, then getting someone else to take the fall.",
                "Doesn’t really seem right, losing your riding so just picking another, guaranteed riding. Not really the will of the people who voted against you.",
                "I know this is common in Westminster parliamentary systems but I don't like this. If you lose, you lose. He's not really a resident of that Alberta riding/district. He's just pretending to be. (Yes I know district shopping happens in America too. I don't like it either).\n\nA MMP legislature with party lists would solve this issue and have the added effect of allowing voters to be better represented in parliament.",
                "God damn it. This is my riding. \nI guess I'll get the chance to call him a cunt in person.",
                "Here's hoping Poilievre gets embarrassed again!",
                "It would be fucking hilarious if he loses again",
                "Things are turning up milhouse",
                "Let him run\n\nLet him run for PM for the rest of his life\n\nHis policies suck, he sucks, he's a shit person and a has a shitty personality.",
                "My boss is super conservative and just before the election he was very vocal about \"if you lose your seat you should be fired\". You lose your out mentality.\n\nStrangely, he hasn't brought it up since the election!"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Weekly measles cases hit new record amid worst outbreak since 1990s",
            "external_url": "https://www.cbsnews.com/news/weekly-measles-cases-hit-new-record-amid-worst-outbreak-since-1990s/",
            "upvotes": 236,
            "date": "05/03/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/10/9cd3b00e-2d7a-4b8c-951b-4ef66e6dfc31/thumbnail/1200x630/afe989398a5be129028acb84db47ac36/measles-0409.png?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "“Modern Americans behave as if intelligence were some sort of hideous deformity.” - Frank Zappa",
                "Great job, Republicans 👏",
                "I will never understand why people deliberately endanger their children with a preventable disease",
                "It’s sad to see the USA which used to be the leading nation in quite a lot of areas fall down without grace.",
                "Not in Europe, strangely enough. What are they doing differently over there? /s",
                "absolutely no correlation whatsoever. https://www.scientificamerican.com/article/under-trump-national-science-foundation-cuts-off-all-funding-to-scientists/",
                "But RFK jr knows what he’s doing…",
                "It’s Biden’s fault, or Hillary, or Obama. It’s so hard to keep up with MAGA insanity.",
                "This is awful, if only there were a way to stop it 😓"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "RFK Jr plans placebo-trial testing for 'all new vaccines'",
            "external_url": "https://www.bbc.co.uk/news/articles/crkx3egk3ygo?fbclid=PAQ0xDSwKBlMBleHRuA2FlbQIxMQABpxz-vcbOrpXyUIHbPkD3JoXLspK0TLUXLuOcteBADjQhncwVIbIUdrNn0JIM_aem_7pfTbvCYLxHUeeNvWyACMQ",
            "upvotes": 11757,
            "date": "05/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/37c6/live/d61a2670-26a6-11f0-b505-55b7c1f611de.jpg",
            "top_comments": [
                "Give him the placebos and us the vaccines.",
                "Aren't clinical trials for new vaccines double-blind with placebo controls anyways? Like this is standard practice.",
                "Using a true placebo is actually a terrible research design when there is an existing standard vaccine. Dude is a fucking idiot.",
                "\"some of you may die but that's a price I am willing to pay\" -L. Farquot",
                "The Kennedy’s lobotomized the wrong one",
                "I think RFK is the best choice for a test subject. Be sure to send him in the most virulent environment to have thorough result.",
                "This is extremely unethical behavior…and it also won’t convince skeptics. If they don’t believe the huge effect sizes MMR vaccine adoption shows, they won’t believe anything.",
                "Can we please get Bobbie Brainworms out and an actual medical professional to make critical care decisions. Why are we allowing this clearly crazy man to dictate health policy. He is literally brain damaged. The US is insane.",
                "RFK is the mengele of the magas",
                "Are these “trials” going to be actual trials or just fake experiments to confirm their bias against"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Former Illinois Gov. George Ryan dies at 91. He halted executions and went to prison for corruption",
            "external_url": "https://apnews.com/article/illinois-governor-george-ryan-hospice-executions-46a5ec5191e8820dd6905d57c8e3cd8a",
            "upvotes": 176,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "TLDR; Former Illinois Governor George Ryan passed away on May 2, 2025, at the age of 91 in Kankakee, Illinois, while under hospice care. A Republican known for his pragmatism, Ryan served as governor from 1999 to 2003. He gained international recognition for halting executions and commuting all death row sentences in Illinois, citing systemic injustices in the capital punishment system. However, his career was marred by a corruption scandal dating back to his tenure as secretary of state, leading to a 2006 conviction for racketeering, bribery, extortion, money laundering, and tax fraud. He served over five years in federal prison and was released in 2013.",
                "A relative met him and he was quite kind, goofy, and grandfatherly - at a time when we had just lost ours. It's a shame he marred his name with corruption. IL's 'wiretap' laws (all party consent everywhere audio recording) basically exist to protect this kind of crap, so it's no wonder IL's history of corruption is long and deep.",
                "At the time, I cynically though that clearing death row was a bid for some kind of legacy to distract from licenses for bribes. The ordering of his obituary suggests it worked."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Sean 'Diddy' Combs rejects plea deal ahead of sex trafficking trial",
            "external_url": "https://abcnews.go.com/US/sean-diddy-combs-rejects-plea-deal-ahead-sex/story?id=121371141",
            "upvotes": 2207,
            "date": "05/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6cffb08e-de0f-45e2-b3da-d733b13eadd0/Diddy-ap-er-250501_1746127092174_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Great news. That means he’ll never get out.",
                ">Maurene Comey, an assistant United States attorney, said a guilty plea would have reduced the amount of prison time Combs would be exposed to compared to a trial conviction on all counts, which could result in what is effectively a life sentence.\n\nHe brought on a new lawyer earlier this week. And is first lawyer was allowed to leave in February.",
                "Diddy is one of those people who will just continue being a creep. He shouldn't be in society at any age.",
                "While most regular people would take a plea from the feds, someone of Diddy's level of fame and wealth usually never does so this is not surprising.",
                "Prosecutors better not mess this up.",
                "[removed]",
                "Dude's 55. Considering the seriousness of the allegations, it might be a life sentence for him regardless. I'd bet the best he could've gotten was the potential for parole, but he's almost certainly not getting that now.",
                "The thing a lot of people seem to miss is that Diddy is the lone defendant named in the case involving racketeering, conspiracy, sex trafficking and prostitution, according to the [US DOJ] (https://www.justice.gov/usao-sdny/media/1368556/dl) criminal filing.\n\nConvincing a jury that he didn't have any help or  no one else involved \nin a criminal enterprise was worthy of being named as defendants in a RICO case is wild.  \n\nGonna be interesting to see how this all plays out.",
                "I wonder what kind of leverage he has in order to pursue this route",
                "He really is one of those people who should do the *opposite* of whatever they think they should do."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Worker safety agency NIOSH lays off most remaining staff",
            "external_url": "https://www.cbsnews.com/news/worker-safety-agency-niosh-lays-off-most-remaining-staff/",
            "upvotes": 40,
            "date": "05/03/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2022/12/08/b885b605-fee8-4460-8e82-953d055fc677/thumbnail/1200x630/785fa9b659fe75c9b1f0fe90a651ac14/hypatia-h-4ffc665b28f6f1b8c6eab2cc6e053777-h-b8d48384c916d7e0fdacd908de250f1a.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "Finally I can work without a helmet, safety glasses and harness. /s",
                "\"New requests for investigations of firefighter injuries and workplace health hazards had already stopped being accepted. A CDC plan to help Texas schools curb the spread of measles infections was also scrapped due to the layoffs. \n\nNIOSH employees receiving layoff notices late Friday included some workers for the World Trade Center Health Program, miner safety, and firefighter health programs\" \n\nThis shit gets worse every day.  Trash country full of trash people."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "US criticizes Germany for labeling AfD 'extremist'",
            "external_url": "https://www.dw.com/en/us-criticizes-germany-for-labeling-afd-extremist/a-72423560",
            "upvotes": 272,
            "date": "05/03/2025",
            "thumbnail": "https://static.dw.com/image/72413892_6.jpg",
            "top_comments": [
                "If the Trump Administration says it, you can safely bet the opposite is true.",
                "Racists saying don't call racists racists.",
                "Europeans, and especielly germans know what those kind of parties lead to. America is finding out as we speak. \n\n  \nOf course fascists defend other fascists.",
                "[Yeah, this party definitely seems like a normal party in Germany after WWII](https://www.francetvinfo.fr/pictures/1OlwfrVcCJ34l87kBo-nDB63rSc/1200x900/2025/02/15/afd-67b0b001d471c936176354.png)\n\nFor those curious, it says “we protect your kids”",
                "Trump thinks AfD is short for the Aflac Duck",
                "Well if Vance and Rubio disagree you made the right choice.",
                "The US defending literal Nazis tells you what you need to know about what the Americans are today.",
                "No, the idiots that the idiots put in charge are criticizing Germany. The rest of us think this is totally reasonable.",
                "Well the US government is full of fascists so yea of course they would",
                "“Neo-Nazi government criticizes Germany for calling out Neo-Nazis”\n\nThe US is going to go through decades of rebuilding trust once this bullshit era is over with. How are our allies (not the Axis ones) supposed to believe everything’s all good after this? We’ve got half the voting block ready to throw on red patches and pay subscription fees to watch minorities starve in internment camps, and it feels like it’s getting worse every day."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Australia reelects Labor party",
            "external_url": "https://www.abc.net.au/news/elections/federal/2025/results",
            "upvotes": 2576,
            "date": "05/03/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/5cead005ccec832c8b67962996764ab6?impolicy=wcms_crop_resize&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
            "top_comments": [
                "For non-Australians, the Labor party is our left-leaning party. The Liberal Party (which is the conservative party) tried to take a page out of Trump’s book in its campaign, which resulted in this outcome. Honestly they would have had a much better chance if they’d stuck to their usual guns – Trump is not a popular figure among the majority of the populace (although this year a new party ran called “Trumpet of Patriots”, which has an undeniable “Make Australia Great Again” air to it. That party has so far earned over 2% of the vote… take from that what you will).",
                "I love how being seen as having anything in common with Trump is the recipe for losing an election, and even losing their own seat. \n\nHe’s a loser of a man, and is contagious.",
                "And! Dutton likely to lose his seat. This is the #trumpeffect",
                "Just as significant is that conservative party leader Peter Dutton (Temu Trump) has had about a 10% swing against him, so is now trailing in his own electorate and may lose his own seat\n\nEdit: the media has now called that Dutton has lost his seat. Polls closed at 6pm, it’s now 8:50pm - it’s such a bloodbath that both of these have already been called.",
                "Dickson had the opportunity to do the funniest thing possible, and they delivered.\n\nAfter Poilievre, it’s now Dutton’s turn to lose his own seat.",
                "Was real nervous that Liberal was gonna actually have a substantial turnout, thank god it was just in my head",
                "Common sense returning to the Commonwealth.",
                "Fuck Murdoch!!\n\nSuck a fat one Spud, you abandoned your electorate during floods to attend billionaire fundraisers. Karma's a bitch",
                "Welp, *that* potato is cooked.",
                "The leader of the opposition lost his own seat. Not an ideal result for him, great for Australia though"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Idaho: seven people killed in highway crash near Yellowstone, police say",
            "external_url": "https://www.theguardian.com/us-news/2025/may/02/idaho-yellowstone-national-park-car-crash",
            "upvotes": 75,
            "date": "05/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7085d58f5dbcfab95e85acbed7a7229c0d6a102c/0_101_3024_1814/master/3024.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9de79548ffc5876a8a0247cb3a3c4293",
            "top_comments": [
                "That stretch is fucking dangerous. Near head on collisions by idiots happening all the time. Should have been widened to four lanes two decades ago.",
                "Let me guess, lifted pickup driven by lifted ego went for an unsafe pass in a passing zone."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Federal judge strikes down Trump order targeting the law firm Perkins Coie",
            "external_url": "https://www.npr.org/2025/05/02/nx-s1-5385355/perkins-coie-trump-executive-order-law-firms",
            "upvotes": 97,
            "date": "05/03/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5293x2977+0+276/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6a%2F09%2Fecebb2d54658be17e43bdc44399e%2Fgettyimages-2203670416.jpg",
            "top_comments": [
                "A sliver of hope is left. All politicians have stopped doing their jobs. Trump has over a billion dollars in pro bono work strong armed from massive law firms. We need this branch to step it the fuck up, together."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "State Department labels Haitian gangs as terrorist organizations",
            "external_url": "https://www.nbcnews.com/news/us-news/state-department-labels-haitian-gangs-terrorists-rcna204475",
            "upvotes": 17,
            "date": "05/03/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250502-haiti-gangs-mn-1305-9ccd6f.jpg",
            "top_comments": [
                "We the people label the current American regime and entire GOP and their allies (heritage foundation, federalist society, etc) as terrorist organizations. Trump and republicans hate America, the constitution and Americans. Al Qaeda and ISIS could never have dreamed to have harmed America and Americans as much as republicans and the trump regime have and further intend.  \n\nWHEN, not if, when we have our own version of the Nuremberg trials, these monsters will meet their just desserts. “I was just following orders” will not be accepted at all. The difference between us and them, is that even though we know they’re monsters and explicitly guilty, they will still get due process and be judged by the law.  \n\nThis bumbling kakistocracy cannot and will not survive the test of time. We the people will rise. We demand justice and an adherence the constitution and the rule of law. If one man is above the law, then all people are and anarchy will rein. Return order and end this corrupt, fascist regime."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "NEW",
            "title": "Australians vote in election, with high prices and housing shortage major issues",
            "external_url": "https://www.npr.org/2025/05/02/g-s1-64141/australia-election-anthony-albanese-peter-dutton",
            "upvotes": 10,
            "date": "05/03/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7614x4281+0+795/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa6%2Fd8%2F34a131ff4cfca3a8aedfc03b9090%2Fap25122816500046.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump to cut 1,200 CIA positions within larger plan to shrink spy workforce: report",
            "external_url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-cia-job-cuts-nsa-b2744123.html",
            "upvotes": 254,
            "date": "05/03/2025",
            "thumbnail": "https://static.independent.co.uk/2024/12/11/21/United-States-Israel-Documents_46281.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "But why? Oh that’s right, he’s Putins bottom. ",
                "I wonder which exact/particular people he is going to lay off?",
                "Putin loves this guy ,Trump is a traitor. Russia will not have to fire a shot to control our government.",
                "JFK tried this once.......once.",
                "“Make America Russian Pretty SoonNow”",
                "Somebody has to know that can make a difference, that he is purposely destroying America.",
                "MAGA - Moscow Agent Grifting America",
                "Will be interesting to see how that affects Reddit posts and comments🤔",
                "The news report I heard was they were doing this over several years by not backfilling every position, so not as bad as what is going on at many agencies.",
                "Leaking the names of spy's also shrank the workforce..."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Leak: EU governments double down on penalising privacy-friendly and encrypted messaging services with chat control bulk scanning orders",
            "external_url": "https://www.patrick-breyer.de/en/leak-eu-governments-double-down-on-penalising-privacy-friendly-and-encrypted-messaging-services-with-chat-control-bulk-scanning-orders/",
            "upvotes": 80,
            "date": "05/03/2025",
            "thumbnail": "https://www.patrick-breyer.de/wp-content/uploads/2023/07/logo_regular_vertical.png",
            "top_comments": [
                "The fact that they never had any issue with Whatsapp despite it being by far the largest messaging platform in the EU with claims of End to end encryption tells you exactly how secure it is.",
                "The EU wants to keep an eye on how people use cryptocurrencies and is not happy with privacy tools like VPNs, Signal, TOR, and encrypted email services.",
                "there is a tom scott video about this topic. \n\nhttps://youtu.be/CINVwWHlzTY?si=GuRohk1PBFVfqJqC\n\ntldw, should police/government be able to break down a locked door to rescue someone? read a terrorists physical mail to find the location of a bomb after getting a legal search warrant? \n\none way to view encryption laws are to view them as an extension of these existing laws. this is a steel man argument ie the strongest defence of the idea. it's worth thinking about the possible utility as well as the drawbacks."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Weekly measles cases hit new record amid worst outbreak since 1990s",
            "external_url": "https://www.cbsnews.com/news/weekly-measles-cases-hit-new-record-amid-worst-outbreak-since-1990s/",
            "upvotes": 237,
            "date": "05/03/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/10/9cd3b00e-2d7a-4b8c-951b-4ef66e6dfc31/thumbnail/1200x630/afe989398a5be129028acb84db47ac36/measles-0409.png?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "“Modern Americans behave as if intelligence were some sort of hideous deformity.” - Frank Zappa",
                "Great job, Republicans 👏",
                "I will never understand why people deliberately endanger their children with a preventable disease",
                "It’s sad to see the USA which used to be the leading nation in quite a lot of areas fall down without grace.",
                "Not in Europe, strangely enough. What are they doing differently over there? /s",
                "absolutely no correlation whatsoever. https://www.scientificamerican.com/article/under-trump-national-science-foundation-cuts-off-all-funding-to-scientists/",
                "But RFK jr knows what he’s doing…",
                "It’s Biden’s fault, or Hillary, or Obama. It’s so hard to keep up with MAGA insanity.",
                "This is awful, if only there were a way to stop it 😓"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Australia reelects Labor party",
            "external_url": "https://www.abc.net.au/news/elections/federal/2025/results",
            "upvotes": 2577,
            "date": "05/03/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/5cead005ccec832c8b67962996764ab6?impolicy=wcms_crop_resize&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
            "top_comments": [
                "For non-Australians, the Labor party is our left-leaning party. The Liberal Party (which is the conservative party) tried to take a page out of Trump’s book in its campaign, which resulted in this outcome. Honestly they would have had a much better chance if they’d stuck to their usual guns – Trump is not a popular figure among the majority of the populace (although this year a new party ran called “Trumpet of Patriots”, which has an undeniable “Make Australia Great Again” air to it. That party has so far earned over 2% of the vote… take from that what you will).",
                "I love how being seen as having anything in common with Trump is the recipe for losing an election, and even losing their own seat. \n\nHe’s a loser of a man, and is contagious.",
                "And! Dutton likely to lose his seat. This is the #trumpeffect",
                "Just as significant is that conservative party leader Peter Dutton (Temu Trump) has had about a 10% swing against him, so is now trailing in his own electorate and may lose his own seat\n\nEdit: the media has now called that Dutton has lost his seat. Polls closed at 6pm, it’s now 8:50pm - it’s such a bloodbath that both of these have already been called.",
                "Dickson had the opportunity to do the funniest thing possible, and they delivered.\n\nAfter Poilievre, it’s now Dutton’s turn to lose his own seat.",
                "Was real nervous that Liberal was gonna actually have a substantial turnout, thank god it was just in my head",
                "Common sense returning to the Commonwealth.",
                "Fuck Murdoch!!\n\nSuck a fat one Spud, you abandoned your electorate during floods to attend billionaire fundraisers. Karma's a bitch",
                "Welp, *that* potato is cooked.",
                "The leader of the opposition lost his own seat. Not an ideal result for him, great for Australia though"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "US criticizes Germany for labeling AfD 'extremist'",
            "external_url": "https://www.dw.com/en/us-criticizes-germany-for-labeling-afd-extremist/a-72423560",
            "upvotes": 275,
            "date": "05/03/2025",
            "thumbnail": "https://static.dw.com/image/72413892_6.jpg",
            "top_comments": [
                "If the Trump Administration says it, you can safely bet the opposite is true.",
                "Racists saying don't call racists racists.",
                "Europeans, and especielly germans know what those kind of parties lead to. America is finding out as we speak. \n\n  \nOf course fascists defend other fascists.",
                "[Yeah, this party definitely seems like a normal party in Germany after WWII](https://www.francetvinfo.fr/pictures/1OlwfrVcCJ34l87kBo-nDB63rSc/1200x900/2025/02/15/afd-67b0b001d471c936176354.png)\n\nFor those curious, it says “we protect your kids”",
                "Trump thinks AfD is short for the Aflac Duck",
                "Well if Vance and Rubio disagree you made the right choice.",
                "The US defending literal Nazis tells you what you need to know about what the Americans are today.",
                "No, the idiots that the idiots put in charge are criticizing Germany. The rest of us think this is totally reasonable.",
                "Well the US government is full of fascists so yea of course they would",
                "“Neo-Nazi government criticizes Germany for calling out Neo-Nazis”\n\nThe US is going to go through decades of rebuilding trust once this bullshit era is over with. How are our allies (not the Axis ones) supposed to believe everything’s all good after this? We’ve got half the voting block ready to throw on red patches and pay subscription fees to watch minorities starve in internment camps, and it feels like it’s getting worse every day."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Weekly measles cases hit new record amid worst outbreak since 1990s",
            "external_url": "https://www.cbsnews.com/news/weekly-measles-cases-hit-new-record-amid-worst-outbreak-since-1990s/",
            "upvotes": 237,
            "date": "05/03/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/10/9cd3b00e-2d7a-4b8c-951b-4ef66e6dfc31/thumbnail/1200x630/afe989398a5be129028acb84db47ac36/measles-0409.png?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "“Modern Americans behave as if intelligence were some sort of hideous deformity.” - Frank Zappa",
                "Great job, Republicans 👏",
                "I will never understand why people deliberately endanger their children with a preventable disease",
                "It’s sad to see the USA which used to be the leading nation in quite a lot of areas fall down without grace.",
                "Not in Europe, strangely enough. What are they doing differently over there? /s",
                "absolutely no correlation whatsoever. https://www.scientificamerican.com/article/under-trump-national-science-foundation-cuts-off-all-funding-to-scientists/",
                "But RFK jr knows what he’s doing…",
                "It’s Biden’s fault, or Hillary, or Obama. It’s so hard to keep up with MAGA insanity.",
                "This is awful, if only there were a way to stop it 😓"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "National Science Foundation Halts Funding Indefinitely",
            "external_url": "https://www.scientificamerican.com/article/under-trump-national-science-foundation-cuts-off-all-funding-to-scientists/",
            "upvotes": 2808,
            "date": "05/03/2025",
            "thumbnail": "https://static.scientificamerican.com/dam/m/2737c995ce342838/original/NSF_Logo_on-HQ.jpg?m=1746204485.782&w=1200",
            "top_comments": [
                "This is so fucked! What's the point of taking intellectualism back to the fucking stone age?!??",
                "Oh God...they told us right there in print what they were going to do and people laughed.  \"Trump just being Trump\" was the most common excuse I heard \n\n\"He doesn't really mean it\"  \n\nYeah none of us are laughing now...more like screaming in terror.",
                "With all this \"cost savings\" they conveniently neglect to mention how much investment they're torching by preventing the completion of these studies.  Many years of scientific research and the funding that supported it will rot on the vine because they're effectively preventing the harvest.  They're f@#$&# liquidating taxpayer investments before they mature... At best to claim they saved a buck.  At worst to intentionally sabotage the government, the dollar, the country, and modern western society.",
                "All of these things are traps set for anyone in the future who would try to fix the damage: they would have to spend a LOT of money to restart all these programs.",
                "This is how you truly crash the economy.\n\nCut all funding to science, thus stifling the innovation and invention that drives the economy.",
                "\"Hell is empty, and all the devils are here.\"",
                "If you don't have a sense for scale, this is IMO the biggest news in weeks. Smart people can't do stuff without their NSF grants. Wow. ",
                "Wow, I don't think ppl understand the gravity of this news. Sadly, without scientists they won't have anyone to explain it to them either. This would shutdown most University STEM research programs.",
                "Looks like we just maxed the tech tree for this playthrough.",
                "I'm funded through the NSF. Overall, the atmosphere in research has been incredibly dim. No one sees even the slightest light at the end of the tunnel."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Trump to cut 1,200 CIA positions within larger plan to shrink spy workforce: report",
            "external_url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-cia-job-cuts-nsa-b2744123.html",
            "upvotes": 253,
            "date": "05/03/2025",
            "thumbnail": "https://static.independent.co.uk/2024/12/11/21/United-States-Israel-Documents_46281.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "But why? Oh that’s right, he’s Putins bottom. ",
                "I wonder which exact/particular people he is going to lay off?",
                "Putin loves this guy ,Trump is a traitor. Russia will not have to fire a shot to control our government.",
                "JFK tried this once.......once.",
                "“Make America Russian Pretty SoonNow”",
                "Somebody has to know that can make a difference, that he is purposely destroying America.",
                "MAGA - Moscow Agent Grifting America",
                "Will be interesting to see how that affects Reddit posts and comments🤔",
                "The news report I heard was they were doing this over several years by not backfilling every position, so not as bad as what is going on at many agencies.",
                "Leaking the names of spy's also shrank the workforce..."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Man sentenced to 53 years in prison in hate crime murder of 6-year-old Palestinian-American boy",
            "external_url": "https://abcnews.go.com/US/man-sentenced-53-years-prison-hate-crime-murder/story?id=121400634",
            "upvotes": 29495,
            "date": "05/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6d0db2c2-7dbe-4bf7-a781-e7a9021e5fb2/Alfayoumi-ap-er-250502_1746199431318_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "An Illinois man has been sentenced to 53 years in prison for the 2023 fatal stabbing of a 6-year-old Palestinian-American boy.\n\nWadee Alfayoumi was stabbed 26 times and his mother more than a dozen in the Oct. 14, 2023, attack inside their home in the Chicago suburb of Plainfield.\n\nTheir landlord, 73-year-old Joseph Czuba, was convicted in February on multiple murder charges, as well as attempted murder, aggravated battery and hate crime counts. A Will County jury found Czuba guilty of all counts after deliberating for less than two hours.\n\nAuthorities said he targeted his tenants because they were Muslim and in response to the war between Israel and Hamas that had just ignited after Hamas' Oct. 7, 2023, attack on Israel.\n\nWadee's great uncle, Mahmoud Yousef, addressed the sentencing outside the courthouse, telling reporters, \"It doesn't matter what numbers are. He took a life from us. He took a future.\"\n\nThe child's mother, Hanan Shaheen, was the first to take the stand in the weeklong trial.\n\nShe said Czuba attacked her first with a knife, stabbing her multiple times, saying, \"You devil Muslim, you must die,\" as her son watched, according  to WLS, which was in the courtroom.\n\nShe testified that she called 911 from the bathroom when he appeared to leave, but then she started to hear her son screaming, according to WLS.\n\n\"I started hearing my son screaming, screaming, screaming, 'Oh no, stop,'\" Shaheen said, according to WLS.\n\nJurors also listened to the mother's 911 call from the bathroom, in which she was heard telling the dispatcher, \"He's killing my baby,\" WLS reported.\n\nJurors additionally heard remarks Czuba made in a law enforcement vehicle following the attack.\n\n\"I thought they were going to do jihad on me,\" Czuba said, according to WLS.\n\nHe also said he was \"afraid for my life\" and his wife and said the family was \"just like infested rats,\" according to WLS.",
                "No matter what your political, social, cultural or religious views are, if you are killing a 6 year old as result of it, you are wrong.",
                "I initially thought, “damn, only 53 years?” But then I realized he’s already an old POS.",
                "\"I thought they were going to do jihad on me,\" Czuba said, according to WLS.\n\n\nWorld's smartest islamophobe",
                "[removed]",
                "There is a special circle of hell for people like this.",
                "It’s amazing how religious fanatics claim they love god, and think they are better than everyone else, but yet they do the work of the devil, or whatever they call him in their religion.",
                "Omg poor little boy. May he RIP.  Anyone that hurts a child is just a monster \n\nI really wish reddit didn’t have the news just in the middle of scrolling and saw this post, it’s so depressing and heartbreaking. As someone with a young son it just brings me such anxiety and pain to read stories of kids being killed :(",
                "This guy can rot in hell, murdering a 5-year old for his religion, there are no words",
                "You can thank Fox News and all the other right wing media for the death of this child."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "CDC reports 216 child deaths this flu season, the most in 15 years.",
            "external_url": "https://www.nbcnews.com/health/cold-and-flu/cdc-reports-216-child-deaths-flu-season-15-years-rcna204468",
            "upvotes": 7385,
            "date": "05/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-12/241217-covid-ch-0958-6da6ba.jpg",
            "top_comments": [
                "Time to do away with the CDC child death reporting department.",
                ">There are likely several contributors to this season’s severity, but a big one is that fewer children get flu shots, added O’Leary, a University of Colorado pediatric infectious diseases specialist.\n\n>The flu vaccination rate for U.S. children has plummeted from about 64% five years ago to 49% this season.\n\nDamn, really? That’s an alarming trend.",
                "It was a bad flu season. :/ - signed a pediatrician",
                "If only medicine could come up with a way to prevent children from getting the flu...",
                "People really gonna have to learn all over again why these vaccinations are a thing.",
                "Surely we'll be fine next year\n\nhttps://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-confirms-cancellation-vaccine-advisers-meeting-2025-02-27/",
                "The most in 15 years SO FAR",
                "Republicans: \"There are no amount of kids deaths that is more immportant then me not getting stuck with a needle.\" ",
                "If children are dying of flu in 2025 without extenuating medical circumstances, then their parents are guilty of neglect. Simple as that.",
                " Next year we’ll surely beat this number… since we may not even get a vaccine."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Conservative MP will resign Alberta riding so Poilievre can run again | Globalnews.ca",
            "external_url": "https://globalnews.ca/news/11161267/pierre-poilievre-running-again-alberta/",
            "upvotes": 6019,
            "date": "05/02/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/04/b6dae6fca70b2303a683a628bd7e02b6102a36b480a1c8e090066858390ee6fe_1ba569.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "Say what you want, but this is a little bit embarrassing for him.",
                "Nothing says personal responsibility like blowing a 27-point lead, losing your own seat, then getting someone else to take the fall.",
                "Doesn’t really seem right, losing your riding so just picking another, guaranteed riding. Not really the will of the people who voted against you.",
                "I know this is common in Westminster parliamentary systems but I don't like this. If you lose, you lose. He's not really a resident of that Alberta riding/district. He's just pretending to be. (Yes I know district shopping happens in America too. I don't like it either).\n\nA MMP legislature with party lists would solve this issue and have the added effect of allowing voters to be better represented in parliament.",
                "God damn it. This is my riding. \nI guess I'll get the chance to call him a cunt in person.",
                "Here's hoping Poilievre gets embarrassed again!",
                "It would be fucking hilarious if he loses again",
                "Things are turning up milhouse",
                "Let him run\n\nLet him run for PM for the rest of his life\n\nHis policies suck, he sucks, he's a shit person and a has a shitty personality.",
                "My boss is super conservative and just before the election he was very vocal about \"if you lose your seat you should be fired\". You lose your out mentality.\n\nStrangely, he hasn't brought it up since the election!"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "RFK Jr plans placebo-trial testing for 'all new vaccines'",
            "external_url": "https://www.bbc.co.uk/news/articles/crkx3egk3ygo?fbclid=PAQ0xDSwKBlMBleHRuA2FlbQIxMQABpxz-vcbOrpXyUIHbPkD3JoXLspK0TLUXLuOcteBADjQhncwVIbIUdrNn0JIM_aem_7pfTbvCYLxHUeeNvWyACMQ",
            "upvotes": 11751,
            "date": "05/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/37c6/live/d61a2670-26a6-11f0-b505-55b7c1f611de.jpg",
            "top_comments": [
                "Give him the placebos and us the vaccines.",
                "Aren't clinical trials for new vaccines double-blind with placebo controls anyways? Like this is standard practice.",
                "Using a true placebo is actually a terrible research design when there is an existing standard vaccine. Dude is a fucking idiot.",
                "\"some of you may die but that's a price I am willing to pay\" -L. Farquot",
                "The Kennedy’s lobotomized the wrong one",
                "I think RFK is the best choice for a test subject. Be sure to send him in the most virulent environment to have thorough result.",
                "This is extremely unethical behavior…and it also won’t convince skeptics. If they don’t believe the huge effect sizes MMR vaccine adoption shows, they won’t believe anything.",
                "Can we please get Bobbie Brainworms out and an actual medical professional to make critical care decisions. Why are we allowing this clearly crazy man to dictate health policy. He is literally brain damaged. The US is insane.",
                "RFK is the mengele of the magas",
                "Are these “trials” going to be actual trials or just fake experiments to confirm their bias against"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Former Illinois Gov. George Ryan dies at 91. He halted executions and went to prison for corruption",
            "external_url": "https://apnews.com/article/illinois-governor-george-ryan-hospice-executions-46a5ec5191e8820dd6905d57c8e3cd8a",
            "upvotes": 176,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "TLDR; Former Illinois Governor George Ryan passed away on May 2, 2025, at the age of 91 in Kankakee, Illinois, while under hospice care. A Republican known for his pragmatism, Ryan served as governor from 1999 to 2003. He gained international recognition for halting executions and commuting all death row sentences in Illinois, citing systemic injustices in the capital punishment system. However, his career was marred by a corruption scandal dating back to his tenure as secretary of state, leading to a 2006 conviction for racketeering, bribery, extortion, money laundering, and tax fraud. He served over five years in federal prison and was released in 2013.",
                "A relative met him and he was quite kind, goofy, and grandfatherly - at a time when we had just lost ours. It's a shame he marred his name with corruption. IL's 'wiretap' laws (all party consent everywhere audio recording) basically exist to protect this kind of crap, so it's no wonder IL's history of corruption is long and deep.",
                "At the time, I cynically though that clearing death row was a bid for some kind of legacy to distract from licenses for bribes. The ordering of his obituary suggests it worked."
            ],
            "aggregate_sentiment": 18.0
        }
    ],
    "last_updated": "05/03/2025 12:14:23 UTC"
}