{
    "posts": [
        {
            "category": "HOT",
            "title": "CIA director says US has paused intelligence support to Ukraine",
            "external_url": "https://www.cnn.com/2025/03/05/politics/us-pause-intelligence-support-ukraine?utm_medium=social&amp;utm_source=whatsappCNN&amp;utm_content=2025-03-05T13%3A51%3A35",
            "upvotes": 14593,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2200569649.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "&gt;In the lead up to Trump’s inauguration, Ratcliffe and the Trump transition team were told of the value of intelligence sharing with Ukraine by US officials who stressed that it was a hallmark of their achievements on the battlefield, according to a source familiar with the discussions.\n\nWell, that's something, isn't it.",
                "The whole world is about to shift away from America and conservatives are going to wonder what happened in a decade.",
                "Just in case anyone believed that it was ever actually about the money and not an ideological desire to support Russia in the war.",
                "Sooner or later the US will share their intelligence support to its new closest ally: Russia.",
                "Intelligence in the United States has been paused as well.",
                "If not Russian asset, why Russian asset shaped?",
                "we are the baddies, its official",
                "Better headline:  \n\\&gt; Russian Agent has paused US intelligence sharing with Ukraine",
                "There won't be future support from the US to Ukraine at all. It's over. Trump is going to start a manufactured fight with the entire EU I imagine to use it as a pretense to leave NATO and The UN.",
                "Ukraine should expel all CIA assets in their country to prevent the US from sharing intelligence data with Russia. Maybe expel US diplomats and close the US embassy, too.  It's obvious, that the US has chosen sides against Ukraine, so just make it official and kick the US out."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "China says it is ready for 'any type of war' with US",
            "external_url": "https://www.bbc.com/news/articles/c4gmd3g2nzqo",
            "upvotes": 10309,
            "date": "03/05/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/00c6/live/68e23460-f9d5-11ef-8c03-7dfdbeeb2526.jpg",
            "top_comments": [
                "This will surely lower the cost of my groceries, medications and housing.",
                "Only 44 days Trump has been in office. This is both exhausting and terrifying 🤷‍♂️",
                "Why are we doing this.",
                "As a millennial, I'm tired.",
                "This is crazy lol. \n\n\"If war is what the US wants, be it a tariff war, a trade war or any other type of war, we're ready to fight till the end,\" China's embassy said on X",
                "Dance off it is, then.",
                "Yes, lets attack all of our largest trading partners. That will go great for us.",
                "As a lib, I feel owned.",
                "Is this going to help my ‘cheaper eggs’?",
                "Trump making the world less safe and our food more expensive. I don’t think he’s making it four years."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Supreme Court rejects Trump’s request to keep billions in foreign aid frozen",
            "external_url": "https://www.cnn.com/2025/03/05/politics/supreme-court-usaid-foreign-aid/index.html",
            "upvotes": 6636,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-24t143153z-1113666480-rc2bl8a8wu4b-rtrmadp-3-usa-court-abortion-clinics.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Alito’s dissent is some choice bullshit. “How dare a lower court override the president!”\n\nThe lower court found that congress had specified money to be spent, and the executive branch can’t just say “Nah.” They can slow walk it, they can do some other shady shit - but in the end they gotta pay out that money. \n\nAlito’s so concerned about someone overturning the president he’s saying the statutes congress passed don’t matter.",
                "It’s kind of mind boggling that 4 Supreme Court Justices support the idea that the Executive branch can just deicide not to pay their bills when the Legislative branch has allocated the funding and the recipients have already done what they were to be paid to do.",
                "OK, so now let’s see if trump complies and if he doesn’t, then what?",
                "Damn Justice Amy Coney Barrett doing justice.",
                "That there are only five SCOTUS votes for paying congressionally mandated invoices for work *already* done!? This should be as basic a test of Article I as you can get. And that does not bode well for decisions to come",
                "“Four of the court’s conservatives — Justices Clarence Thomas, Samuel Alito, Neil Gorsuch and Brett Kavanaugh — dissented.”\n\nThese are the men who will dismantle our democracy. \n\nSo shocked by Coney Barrett. I guess he does understand the Constitution and the benefit of rule of law. \n\nBTW- this ruling merely states that the USG must pay for work already done by implementers. This is money owed to them.",
                "Hallelujah. I haven’t been keeping up too much with which justices vote for what so maybe this is normal, but I was surprised to see Amy Coney Barrett voted with the liberal justices.",
                "Interesting that 2 conservatives, including 1 Trump appointee in Barrett ruled against Trump. Though maybe not so much considering how relatively extreme this case is. The decision to spend this money is made by Congress and the executive branch, in theory, shouldn't be able to stop it for long.\n\nWhat will be more interesting(albeit also scary and dangerous) is what happens if the executive branch starts to ignore judicial rulings that they don't like.\n\nIf Congress sits around and concedes authority to the executive branch and the judicial branch turns out to be toothless, that kind of defeats the whole checks and balances concept that we've leaned on for so long. From there the executive can do whatever, no?",
                "So, it looks like this isn't a particularly strong ruling against Trump, despite the headline, given that it basically shifts responsibility back down to the lower court.\n\nAt least that's something, I guess?\n\nIn any case, we'll see if Trump decides to Jackson this.",
                "Whenever I hear even moderately good news from SCOTUS, I immediately fear that it's a bone being thrown to the Left right before an awful ruling for Trump."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Piglets left to starve as part of a controversial art exhibition in Denmark have been stolen",
            "external_url": "https://abcnews.go.com/International/wireStory/piglets-left-starve-part-controversial-art-exhibition-denmark-119470901",
            "upvotes": 2481,
            "date": "03/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0fb06c2d-556c-48e1-814e-38334a5535a3/wirestory_4ed7e96f9274f68dd9f202ed9955748a_16x9.jpg?w=1600",
            "top_comments": [
                "Good on the activists who stole them and the guy who helped. This artist is nuts. What an awful person.\n\n This just seems extra cruel for no real end game, like its not going to stop anyone from anything, it was suffering for the sake of \"art\".",
                "This the same artist that did the goldfish in blenders?",
                "This is not art it’s animal cruelty",
                "&gt; Chilean-born Marco Evaristti said he had been aiming to raise awareness of the suffering caused by mass meat production with his art installation that opened last week in Copenhagen. The piglets were being denied food and water and would have been allowed to starve to death.\n\nI don't think the way to advocate against animal cruelty, is to cause more animal cruelty. Especially when you're subjecting a creature to a slow death that is initially pretty agonizing.",
                "Suffering for his art is probably a good thing. Replace the missing pigs in the cage with the artist - maybe it will make the same point.",
                "It is kind of interesting that everyone is very upset by this but not upset when it is done in factory farms. I think that is the point of this. Not defending it but I wish some of you would reflect on how this mirrors industrial farming techniques.",
                "I’m inclined to think this artist is actually a psychopath.  Performing animal cruelty to point out other people’s cruelty is certainly a choice.",
                "There was an artist a while back who did something like this with a dog. Guillermo Vargas brought in a starving street dog from outside and had it in the art gallery for 3 hours - the gallery reported that he did feed it food and water while it was there, before it \"escaped.\" Guests were shocked and complained about it, and the artist's point was basically, it's the same dog you walked past outside but didn't give a shit about.",
                "I'm going out on a limb here and braving the wall of downvotes.\n\n\nThe provocation artist achived what he wanted without harming the piglets. They were never starved, they were not even showcased.\n\n\nYet he managed to upset so many people, that it sparked an outrage highlighting the fact most people don't give two shits about animals dying, as long as they are out of sight. What can be more artful than getting people to reflect on issues they normally wouldn't?\n\n\nThe comments in this post are beyond disappointing and shows they have no grasp on art at all.",
                "Maybe, just maybe, the theft of the piglets is all part of the art exhibition. I’m not sure this is the case given that the exhibition opened last week. \n\nIf the intention was to allow three piglets to die from thirst there is a special place in hell for the artist. \n\n“Chilean-born Marco Evaristti said he had been aiming to raise awareness of the suffering caused by mass meat production with his art installation that opened last week in Copenhagen. The piglets were being denied food and water and would have been allowed to starve to death.”\n\nThey wouldn’t have starved to death, they would have died of thirst."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Private employers added just 77,000 jobs in February, far below expectations, ADP says",
            "external_url": "https://www.cnbc.com/2025/03/05/adp-jobs-report-february-2025-.html",
            "upvotes": 2804,
            "date": "03/05/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108108397-1740666394856-gettyimages-2202188375-homedepotquarterlyreport0013.jpeg?v=1740666491&w=1920&h=1080",
            "top_comments": [
                "Feel like lots of people cheering on the federal government layoffs are going to be in for a rude awakening when suddenly there's 10x as many people applying for each open private sector job.",
                "Virginia's governor had a whole press conference where he unveiled this website to help federal workers who had been laid off to find new jobs. \n\nThe website is literally just links to LinkedIn and Indeed.",
                "Y’all better buckle tf up because we are headed straight for a massive recession. \n\n✅Hundreds of thousands of newly out of work employees competing for a shrinking pool of private sector jobs\n\n✅Tariffs causing inflation \n\n✅Government accountability and enforcement on financial institutions becoming non-existent\n\nCannot overstate how perfect of an economic storm is brewing right now. But thank god the right finally owned us queer-loving liberal pansies.",
                "This is exactly what so many people wanted. \n\nTo get fired from their well paying and financially sound government employment so they can : *checks notes* work at Home Depot. \n\nAwesome.",
                "Our country is being crippled by the current administration and our economy is in a downward spiral. Of course there are fewer jobs being offered.",
                "First time in memory a new administration has intentionally crashed the economy. Typically, it's hard to pinpoint exactly how an administration moves the needle. There won't be any guesswork this time.",
                "Did you like the Great Depression? Well, good news, it's back! We've got isolationism! We've got protectionism! We've got the rise of fascism! All the greatest hits!",
                "Won't a flood of applicants drive down wages",
                "Giant agribusiness Corp I'm at is on an indefinite hiring freeze because of tariffs. Guess where their PAC $ went.",
                "The government is about to start shutting down reporting of these unemployment numbers. Trump will say “take my word for it, America is doing great!” Ignore the problem.."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Russia’s river gamble fails near Kupyansk as Ukrainian forces hold the line",
            "external_url": "https://english.nv.ua/russian-war/russian-troops-fail-to-cross-oskil-river-near-kupyansk-as-ukrainian-forces-hold-the-line-50495280.html",
            "upvotes": 2471,
            "date": "03/05/2025",
            "thumbnail": "https://static.nv.ua/shared/system/Article/posters/003/048/932/original/28b4bfea0a7978891d7deb7b8f69d2ae.jpg?q=85&stamp=20250305121340",
            "top_comments": [
                "Whoa, I didn’t think good news existed anymore!",
                "To the brave Ukrainian troops, well done (from the US with shameful apologies for our president and his party of cowards)",
                "What was it Trump said? 3 days?\n\nWhat was it Putin said? 2 weeks?",
                "Brave courageous Ukrainians, fighting for all our freedom.",
                "Slava Ukraini! Heroyam Slava!",
                "Hold the the line! Hol the line! Hol line! Holine! Holine!",
                "It's hilarious how much russia absolutely fucking sucks at this.",
                "Jeff Lynne is so great",
                "But... the Russians didn't cross in Kupyansk?\n\nThey crossed the Oskil river to it's north and are taking km's worth of ground a day. \n\nSeems like misinformation to me.",
                "Hold the line is relative, russia has a foothold across the Oskil not far north of Kupyansk. "
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "RFK Jr sparks alarm after backing vitamins to treat measles amid outbreak",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/04/rfk-jr-vitamins-measles-outbreak",
            "upvotes": 15417,
            "date": "03/05/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3035a085c46a31b4ca76636ee32f88dabe9fd753/0_171_5174_3105/master/5174.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c79f04229516887391a37ded6863c479",
            "top_comments": [
                "Elect clowns, expect a circus.",
                "This is what you MAGA fucks voted for.  Now we can all be sick, poor, and hated by the world. Good job, you assholes.",
                "Nothing to see here, the brain worm is in command",
                "It's beginning to feel like the Secretary of Health and Human Services doesn't know anything about health.\n\nMust be a DEI hire 🤷‍♂️",
                "I'm curious why a non medical professional is allowed to have this cabinet position. There should be a law requiring MD or DO credentials. \n\nIf a licensed doctor gave misinformation publicly, he could be sanctioned by the medical board, making the MD requirement a safeguard against abuse.",
                "At a time when parents are staging measles parties, we need someone who advocates for proper prevention via vaccination. Instead we get this guy. The measles parties are absolutely insane to me, and I am so pissed at parents putting their kids at risk like that.",
                "I love how Trump surrounds himself with the best and brightest people unlike Biden who chose merely competent people. /s",
                "If only there was a way to prevent measles\n\ngee, i wonder why the rest of the developed world doesnt have this problem",
                "CEOs, politicians, public figures, etc, need to practice what they preach.  \n  \nRFK should host a measles party.   \nElon should try to live on a bus driver's wage.  \nMarco Rubio should move to Ukraine.\n\nDo that for a month and then we'll entertain your harebrained ideas.",
                "Bunch of drooling MAGA idiots. You've enabled the downfall of America and have done irreversible damage."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Florida attorney general opens criminal investigation of Andrew Tate and brother",
            "external_url": "https://www.theguardian.com/news/2025/mar/04/andrew-tate-criminal-investigation-florida",
            "upvotes": 59254,
            "date": "03/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/2b3659e6217da41d89cbb148ac8b446d85840e4c/820_0_3980_2388/master/3980.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7269406192944aafbfa5a3ecdba74007",
            "top_comments": [
                "I can't believe I'm actually rooting for Florida's attorney general.",
                "Man, how bad are these guys that the AG of fucking FLORIDA is coming after them? Like, that's the pedophile human trafficker retirement home of the world!",
                "Hell yeah, fuck this dude forever",
                "Hopefully this won't be swept under the rug the way previous Florida attorney generals swept the Epstein and then Trump University investigations.",
                "I truly don't understand this. But I'm supportive of criminals being prosecuted.",
                "Prediction: \"After a thorough investigation, we've found no wrong-doing from Andrew and Tristan Tate and will not be pursuing any charges. In the eyes of the Florida legal system, we consider this case closed—and so should everyone else.\"",
                "[deleted]",
                "Of all the places in the world they could have gone to. They went to Florida.",
                "So where's the investigation of Matt Gaetz??? Is he the guv's buddy or something?",
                "It’s pathetic they’re even here. They’re going to be used to indoctrinate an entire group of boys and young men with no strong male role model to help turn this country to shit."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Air Force leaders issue new warning about China-backed recruitment efforts by private companies",
            "external_url": "https://defensescoop.com/2025/02/28/air-force-leaders-warning-chinese-recruitment-efforts-pilots-aviation-companies/",
            "upvotes": 418,
            "date": "03/05/2025",
            "thumbnail": "https://defensescoop.com/wp-content/uploads/sites/8/2025/02/F-35-Red-Flag.jpg",
            "top_comments": [
                "I bet the active duty guys love seeing how veterans are currently being treated, must be doing wonders for morale.",
                "But, no longer anything about the receuitment efforts of russia.",
                "Hmm since it’s dog eat dog politics I think it’s fair to work for the highest bidder",
                "\"We're going to arbitrarily fire you, and bad-mouth you while doing so. \n\nBut don't go work for those guys!\"\n\n\n\nA little reductive, but creating a bunch of negative sentiment then wringing hands about some people acting on that sentiment feels disingenuous.",
                "You'd think the restarted \"best businessman\" would know opposing companies/countries will take your disgruntled talent. Almost like he's purposefully sabotaging the country :) Americans will just complain on socials while it happens tho.",
                "It's almost as if the careless firing of tens of thousands of government employees and contractors could have fully expected consequences",
                "Well..wtf did they think was going to happen.  They flood the zone with unemployed govt workers and now China want the skills so they can build up their govt etc.  These fucks do stupid shit and wonder why stuff happens.  People won't sit around and suffer after you fire them.  They have families to feed.  They don't give a fk.  Whoever pay will get their services. I don't blame them. The US is unstable",
                "At this point they might be better off defecting, and that's in no way an endorsement of China.",
                "I keep saying it, but all of this private industry push is **profoundly** anti-American. There are private companies and money *all over the world.* The GOP in America *says* they are pro-America, but there isn't, and will never be, a policy that restricts private companies (and their money) to come to America and stay--because the world is big. There will always, always be money elsewhere and companies elsewhere. \n\nYou want to make America great? Improve America's ability to compete. That's all you can do."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Trump Suddenly Reverses Order on Mass Firing of Federal Employees",
            "external_url": "https://newrepublic.com/post/192301/trump-opm-order-mass-firings-federal-probationary-employees",
            "upvotes": 38943,
            "date": "03/04/2025",
            "thumbnail": "https://images.newrepublic.com/4bdb51c6421dfde1a68eb061b0d614e6256c2c4b.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
            "top_comments": [
                "So is this the part where they try to rehire people and put them through political screening first? Or is this the part where they pretend like the mass firings never happened so that they can't get sued?",
                "\"The [memo](https://docs.google.com/viewerng/viewer?url=https://big.assets.huffingtonpost.com/athena/files/2025/03/04/67c74950e4b0b4e940709591.pdf) states that instead, federal offices now have until September 13 to determine how to reduce staff.\"\n\nNot reversed but delayed. IE my bullshit is tanking the economy so we need to spread out the bullshit.",
                "He will reverse it again.",
                "How much more evidence does anyone need that *these fucking idiots have no idea what they’re doing, and have no actual plan*?",
                "Trump is not mentally capable to manage a small convenient store.\n\nWhat kind of president is this?",
                "Whether he reverses it again or not - hopefully by now people can see this man and his cabinet are not qualified. They are not working in the interests of Americans who elected confessional representatives for the services they wanted and needed. \n\nPeople can disagree about what those are and what extent they should be - but for one man to appoint an unelected man who was *not* vetted by Congress to just fire people or remove entire sections of government established to serve the citizens proves Trump and his group are not just unqualified but dangerous idiots who serve corporate, billionaire, and Russian interests before ours. \n\nIf your house and senators oppose impeaching him and his crew - then it should be the obligation of every American to make it clear *their* jobs are on the line.",
                "it would be hilarious if he blames Elon for the stock market tanking and puts apartheid clyde in jail.",
                "At this point, can we 25th amendment him? He clearly has no idea WTF he's doing.",
                "THE ARTICLE TITLE IS MISLEADING AND A LIE. \n\nTrump didnt do anything and the EOs and Presidential memorandums directing for a massive downsizing of the federal government are still in place. All that happened was that the Office of Personnel and Management (OPM), which is kinda like the whole governments HR and who makes policies, rescinded a memo that they wrote implementing the Presidential EOs and Memoranda. This was done because OPM can’t legally tell other departments to fire people and the Courts have pointed that out in some injunctions and court cases that have been brought. \n\nTHIS MEMO BEING RESCINDED DOES NOTHING OTHER THAN TELL AGENCIES THEY NEED TO MAKE THE DETERMINATION TO FIRE PROBATIONARY (new) EMPLOYEES ‘THEMSELVES’. The government is still going to fire all these new employees just it would be at ‘agency discretion’.  And just removes a very low hanging fruit for these wrongfully terminated employees to be fired over. \n\nand we are already seeing this happen. The DoD yesterday signed a memo that says “ the Department is taking independent steps to reduce the size of the civilian workforce.”",
                "That’s what we call an admission of failure"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Tariffs on cars from Mexico and Canada delayed by one month",
            "external_url": "https://edition.cnn.com/2025/03/05/business/tariffs-autos-mexico-canada-paused/index.html",
            "upvotes": 210,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2199678771.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Thank God we have a businessman like Trump running the show. I was worried that things would spiral out of control and our leadership would look incompetent and become an international punchline",
                "I must have skipped this part of 'Art of the Deal' where the effete businessperson flip flops after not fully understanding the basic rules of upmanship.",
                "This extortion style diplomacy is most likely going to fail and only serves to piss off everyone. Domestic companies are going to add in fees to their costs structure to put up with the amount of extra work required to deal with the chaos, forgetting that it simply costs more to produce here. International companies and governments are just going to stop doing business with us wherever they can. We need to stop thinking that America is required for the global economy to flourish. Our influence was already in decline after Trump 1.0 and v2.0 is setting us up to be completely irrelevant.",
                "Nah. This is because a Canadian candidate for PM proposed  to put 100% tariffs on Tesla. Elon not liking where that’s going ",
                "How did they guy bankrupt a casino?",
                "Yeah, constantly walking back your threats will totally make them respect you.",
                "Trump is confused about the meaning of \"winning\". He keeps confusing it with \"chaos\".",
                "Make up your freaking mind. This throw shit on the wall to see if it sticks bullshit is going to fail. Let's just get it over with.",
                "I hope there is no delay for their retaliation. The only way forward is to hit the bully back. Trump is not a serious person. Show him that he is dealing with serious people.",
                "And now the Dow Jones is rising cause of this news. Even though the rest of the tariffs on both sides are still going.\n\nClearly nothing more than “pump and dump” schemes by Trump’s inner circle."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "NYS Corrections enters its third weeks of wildcat strikes; more than 8000 COs still on strike",
            "external_url": "https://www.northcountrypublicradio.org/news/story/51365/20250305/more-than-half-of-corrections-officers-still-on-ny-prison-strike-statewide",
            "upvotes": 79,
            "date": "03/05/2025",
            "thumbnail": "https://www.northcountrypublicradio.org/news/images/prisonrally030525.webp",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "FIRE files federal lawsuit against top Texas A&amp;M administrators",
            "external_url": "https://thebatt.com/news/fire-files-federal-lawsuit-against-texas-am/",
            "upvotes": 136,
            "date": "03/05/2025",
            "thumbnail": "https://thebatt.com/wp-content/uploads/2024/03/ASHB1317.jpg",
            "top_comments": [
                "“The Foundation for Individual Rights and Expression, or FIRE, has filed a federal lawsuit against the nine members of the Board of Regents, Chancellor John Sharp and Texas A&amp;M President Mark A. Welsh III on behalf of the Queer Empowerment Council, the student organization that hosts and organizes Draggieland.”\n\nKeep the lawsuits coming. Freedom of speech, freedom from persecution and discrimination are the building blocks of our democracy.",
                "What ever happened to just not attending if you're not interested? I mean, it's not the sort of thing I'd go out of my way to see, but I can always just... you know... not attend. When I was in college there would occasionally be some wandering preacher guy who'd show up on campus for a couple days. I wasn't really interested in his message, so I just kept walking. A very simple and elegant solution that didn't involve me trying to impose my personal beliefs on anyone else. I just would have appreciated someone from the campus security doing a bit of crowd control since people listening would often block the entire sidewalk which was a major thoroughfare.\n\nAnd honestly, nothing beats the name of a SF group: The Sisters of Perpetual Indulgence"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Air Force leaders issue new warning about China-backed recruitment efforts by private companies",
            "external_url": "https://defensescoop.com/2025/02/28/air-force-leaders-warning-chinese-recruitment-efforts-pilots-aviation-companies/",
            "upvotes": 422,
            "date": "03/05/2025",
            "thumbnail": "https://defensescoop.com/wp-content/uploads/sites/8/2025/02/F-35-Red-Flag.jpg",
            "top_comments": [
                "I bet the active duty guys love seeing how veterans are currently being treated, must be doing wonders for morale.",
                "But, no longer anything about the receuitment efforts of russia.",
                "Hmm since it’s dog eat dog politics I think it’s fair to work for the highest bidder",
                "\"We're going to arbitrarily fire you, and bad-mouth you while doing so. \n\nBut don't go work for those guys!\"\n\n\n\nA little reductive, but creating a bunch of negative sentiment then wringing hands about some people acting on that sentiment feels disingenuous.",
                "You'd think the restarted \"best businessman\" would know opposing companies/countries will take your disgruntled talent. Almost like he's purposefully sabotaging the country :) Americans will just complain on socials while it happens tho.",
                "It's almost as if the careless firing of tens of thousands of government employees and contractors could have fully expected consequences",
                "Well..wtf did they think was going to happen.  They flood the zone with unemployed govt workers and now China want the skills so they can build up their govt etc.  These fucks do stupid shit and wonder why stuff happens.  People won't sit around and suffer after you fire them.  They have families to feed.  They don't give a fk.  Whoever pay will get their services. I don't blame them. The US is unstable",
                "At this point they might be better off defecting, and that's in no way an endorsement of China.",
                "I keep saying it, but all of this private industry push is **profoundly** anti-American. There are private companies and money *all over the world.* The GOP in America *says* they are pro-America, but there isn't, and will never be, a policy that restricts private companies (and their money) to come to America and stay--because the world is big. There will always, always be money elsewhere and companies elsewhere. \n\nYou want to make America great? Improve America's ability to compete. That's all you can do."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Florida jewelry thief swallows $770K worth of Tiffany earrings just before arrest, police say",
            "external_url": "https://www.nbcnews.com/news/us-news/florida-jewelry-thief-swallows-770k-tiffany-earrings-just-arrest-polic-rcna194879",
            "upvotes": 175,
            "date": "03/05/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250305-jewelry-scan-ch-1112-14ce69.jpg",
            "top_comments": [
                "Good way to puncture your stomach and die.",
                "Take him to the airport, they have a special machine they strap them to until they poop and sort it out . They do this for drug smugglers who swallow drugs.",
                "does the resale value goe down after it has passed through someone's anus? like how a new car loses a lot of value if you drive it off the lot?",
                "Honey I got a great deal on some earrings for you!!!",
                "\"Private Pile: You had best square your ass away and start shitting me Tiffany cuff links or I will definitely fuck you up!\"",
                "Someone took Breakfast at Tiffany's too literally.",
                "Give him a ton of Miralax.",
                "This shit is gonna get messy.",
                "He'll just be hungry in an hour.",
                "Some poor rookie cop is probably going to be the one assigned to fish whatever's left out of his shit."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Human ancestors made the oldest known bone tools 1.5 million years ago",
            "external_url": "https://www.sciencenews.org/article/human-ancestors-oldest-bone-tools",
            "upvotes": 287,
            "date": "03/05/2025",
            "thumbnail": "https://i0.wp.com/www.sciencenews.org/wp-content/uploads/2025/03/030425_bb_oldest-bone-tools_feat.jpg",
            "top_comments": [
                "The idea the the oldest bone tools ever discovered could have been made by a hominin species that is not a direct ancestor to modern humans is so cool. Paranthropus Boisei was an australopithecine. We already know they probably used bone tools around 1.3 million years ago but this is an amazing find that pushes that date back further.\n\n  \nI wish we knew more about the exchange of technology between different hominin species. Although I think both species would be intelligent enough to find a hippo femur and think \"hell yeah look at this massive bone!\" and keep it.",
                "&gt;Ancient human relatives crafted sharp-edged tools out of animal bones around 1.5 million years ago, researchers say.\n\n&gt;Discoveries at Tanzania’s Olduvai Gorge, a famous East African fossil location, represent the oldest known evidence of systematic bone tool production by hominids, according to archaeologist Ignacio de la Torre of CSIC-Spanish National Research Council in Madrid and colleagues.\n\n&gt;Excavations conducted from 2015 through 2022 [unearthed 27 bone tools](https://www.nature.com/articles/s41586-025-08652-5) in sediment that had already been dated, the scientists report March 5 in *Nature*. Either of two fossil hominids known to have lived at Olduvai Gorge around 1.5 million years ago — a possible direct human ancestor called *Homo erectus* or [a side-branch species dubbed *Paranthropus boisei*](https://www.sciencenews.org/article/no-nuts-you-nutcracker-man) — could have created the bone artifacts, they say.\n\nRead [more here ](https://www.sciencenews.org/article/human-ancestors-oldest-bone-tools)and the [research article ](https://www.nature.com/articles/s41586-025-08652-5)here.",
                "Now I'm gonna have Strauss stick in my head all day.",
                "Well yeah.. when bob die, pinky toe make for great toothpick.",
                "Interesting. I hope I get to use my bone tool tonight.",
                "Ha, some deny the planet is that old.",
                "And it was all downhill from there"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Tesla signs deal for first India showroom to sell imported EVs",
            "external_url": "https://www.reuters.com/business/autos-transportation/tesla-signs-deal-first-india-showroom-sell-imported-evs-2025-03-05/",
            "upvotes": 0,
            "date": "03/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "You’ll be sorry, India",
                "Sounds like a fire sale .",
                "Just as Trump  puts tariffs  on India. Surely  they aren't  that stupid",
                "Well they aren’t selling many in Europe…\n\n(Which is good. Fuck Elmo)",
                "They will improve the smog until they catch on fire. Then we will likely point and make fun. Just saying.",
                "Musk has been DESPERATE to get Teslas into India for *years* now.  Obsessed.  \n\nModi, an anti-woke hindu-nationalist (and a history of complicity with genocide) linked to Russia/Putin in all the same ways (and same times) as Trump is/was, has leveraged that to his advantage.  He used Musk to shut down/suspend Twitter accounts of his political rivals during very critical operations and Musk happily obliged.\n\nWhen Modi came the white house, Musk was the first to rush up and meet him.  \n\nModi despises Musk.  He knows how lucrative the EV market is and wants to capitalize on it himself, not with China or Musk.\n\nBut now he's fucked.  Everyone has to do what Musk says.  Because people didn't bother voting in November in America.",
                "The good news is that swastikas are a positive symbol over there.",
                "invest in fire extinguishers"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "BSO returned handgun used in Tamarac killing spree to accused killer: Records",
            "external_url": "https://www.nbcmiami.com/news/local/bso-returned-handgun-used-in-tamarac-killing-spree-to-accused-killer-records/3558411/",
            "upvotes": 78,
            "date": "03/05/2025",
            "thumbnail": "https://media.nbcmiami.com/2025/02/021825-Nathan-Gingles-Tamarac-triple-murder-surveillance-Mary-Gingles.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "More than a dozen guns and a cache of ammunition were seized from Nathan Gingles, but it was all returned to him after Mary Catherine Gingles dropped the first domestic violence injunction.\n\nThe handgun and suppressor police believe was used to kill a Tamarac mother, her father and her neighbor last month was returned to the accused killer by the Broward Sheriff’s Office, according to recently obtained records.\n\nThe handgun and suppressor police believe was used to kill a Tamarac mother, her father and her neighbor last month was returned to the accused killer by the Broward Sheriff's Office, according to recently obtained records.\n\nNBC6 Investigates confirmed Tuesday that in all, more than a dozen guns were seized along with a cache of ammunition – but it was all returned to Nathan Gingles in August after Mary Catherine Gingles dropped the first domestic violence injunction.\n\nBut in January, deputies were ordered by a judge to re-confiscate them after a second injunction was granted, but they did not.\n\nThat failure and others in the case have led to eight deputies being suspended and a captain demoted, pending an internal investigation.\n\nRecords released Tuesday show 18 police calls to the house in the year before the killings.\n\nMary Gingles and her father, David Ponzer, were both killed in front of her 4-year-old daughter, along with a neighbor, Andrew Ferrin, whose house Mary Gingles ran to for help.",
                "I have always wondered why a silencer is required for self defence."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Piglets left to starve as part of a controversial art exhibition in Denmark have been stolen",
            "external_url": "https://abcnews.go.com/International/wireStory/piglets-left-starve-part-controversial-art-exhibition-denmark-119470901",
            "upvotes": 2479,
            "date": "03/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0fb06c2d-556c-48e1-814e-38334a5535a3/wirestory_4ed7e96f9274f68dd9f202ed9955748a_16x9.jpg?w=1600",
            "top_comments": [
                "Good on the activists who stole them and the guy who helped. This artist is nuts. What an awful person.\n\n This just seems extra cruel for no real end game, like its not going to stop anyone from anything, it was suffering for the sake of \"art\".",
                "This the same artist that did the goldfish in blenders?",
                "This is not art it’s animal cruelty",
                "&gt; Chilean-born Marco Evaristti said he had been aiming to raise awareness of the suffering caused by mass meat production with his art installation that opened last week in Copenhagen. The piglets were being denied food and water and would have been allowed to starve to death.\n\nI don't think the way to advocate against animal cruelty, is to cause more animal cruelty. Especially when you're subjecting a creature to a slow death that is initially pretty agonizing.",
                "Suffering for his art is probably a good thing. Replace the missing pigs in the cage with the artist - maybe it will make the same point.",
                "It is kind of interesting that everyone is very upset by this but not upset when it is done in factory farms. I think that is the point of this. Not defending it but I wish some of you would reflect on how this mirrors industrial farming techniques.",
                "I’m inclined to think this artist is actually a psychopath.  Performing animal cruelty to point out other people’s cruelty is certainly a choice.",
                "There was an artist a while back who did something like this with a dog. Guillermo Vargas brought in a starving street dog from outside and had it in the art gallery for 3 hours - the gallery reported that he did feed it food and water while it was there, before it \"escaped.\" Guests were shocked and complained about it, and the artist's point was basically, it's the same dog you walked past outside but didn't give a shit about.",
                "I'm going out on a limb here and braving the wall of downvotes.\n\n\nThe provocation artist achived what he wanted without harming the piglets. They were never starved, they were not even showcased.\n\n\nYet he managed to upset so many people, that it sparked an outrage highlighting the fact most people don't give two shits about animals dying, as long as they are out of sight. What can be more artful than getting people to reflect on issues they normally wouldn't?\n\n\nThe comments in this post are beyond disappointing and shows they have no grasp on art at all.",
                "Maybe, just maybe, the theft of the piglets is all part of the art exhibition. I’m not sure this is the case given that the exhibition opened last week. \n\nIf the intention was to allow three piglets to die from thirst there is a special place in hell for the artist. \n\n“Chilean-born Marco Evaristti said he had been aiming to raise awareness of the suffering caused by mass meat production with his art installation that opened last week in Copenhagen. The piglets were being denied food and water and would have been allowed to starve to death.”\n\nThey wouldn’t have starved to death, they would have died of thirst."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Supreme Court rejects Trump’s request to keep billions in foreign aid frozen",
            "external_url": "https://www.cnn.com/2025/03/05/politics/supreme-court-usaid-foreign-aid/index.html",
            "upvotes": 6653,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-24t143153z-1113666480-rc2bl8a8wu4b-rtrmadp-3-usa-court-abortion-clinics.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Alito’s dissent is some choice bullshit. “How dare a lower court override the president!”\n\nThe lower court found that congress had specified money to be spent, and the executive branch can’t just say “Nah.” They can slow walk it, they can do some other shady shit - but in the end they gotta pay out that money. \n\nAlito’s so concerned about someone overturning the president he’s saying the statutes congress passed don’t matter.",
                "It’s kind of mind boggling that 4 Supreme Court Justices support the idea that the Executive branch can just deicide not to pay their bills when the Legislative branch has allocated the funding and the recipients have already done what they were to be paid to do.",
                "OK, so now let’s see if trump complies and if he doesn’t, then what?",
                "Damn Justice Amy Coney Barrett doing justice.",
                "That there are only five SCOTUS votes for paying congressionally mandated invoices for work *already* done!? This should be as basic a test of Article I as you can get. And that does not bode well for decisions to come",
                "“Four of the court’s conservatives — Justices Clarence Thomas, Samuel Alito, Neil Gorsuch and Brett Kavanaugh — dissented.”\n\nThese are the men who will dismantle our democracy. \n\nSo shocked by Coney Barrett. I guess he does understand the Constitution and the benefit of rule of law. \n\nBTW- this ruling merely states that the USG must pay for work already done by implementers. This is money owed to them.",
                "Hallelujah. I haven’t been keeping up too much with which justices vote for what so maybe this is normal, but I was surprised to see Amy Coney Barrett voted with the liberal justices.",
                "Interesting that 2 conservatives, including 1 Trump appointee in Barrett ruled against Trump. Though maybe not so much considering how relatively extreme this case is. The decision to spend this money is made by Congress and the executive branch, in theory, shouldn't be able to stop it for long.\n\nWhat will be more interesting(albeit also scary and dangerous) is what happens if the executive branch starts to ignore judicial rulings that they don't like.\n\nIf Congress sits around and concedes authority to the executive branch and the judicial branch turns out to be toothless, that kind of defeats the whole checks and balances concept that we've leaned on for so long. From there the executive can do whatever, no?",
                "So, it looks like this isn't a particularly strong ruling against Trump, despite the headline, given that it basically shifts responsibility back down to the lower court.\n\nAt least that's something, I guess?\n\nIn any case, we'll see if Trump decides to Jackson this.",
                "Whenever I hear even moderately good news from SCOTUS, I immediately fear that it's a bone being thrown to the Left right before an awful ruling for Trump."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Air Force leaders issue new warning about China-backed recruitment efforts by private companies",
            "external_url": "https://defensescoop.com/2025/02/28/air-force-leaders-warning-chinese-recruitment-efforts-pilots-aviation-companies/",
            "upvotes": 421,
            "date": "03/05/2025",
            "thumbnail": "https://defensescoop.com/wp-content/uploads/sites/8/2025/02/F-35-Red-Flag.jpg",
            "top_comments": [
                "I bet the active duty guys love seeing how veterans are currently being treated, must be doing wonders for morale.",
                "But, no longer anything about the receuitment efforts of russia.",
                "Hmm since it’s dog eat dog politics I think it’s fair to work for the highest bidder",
                "\"We're going to arbitrarily fire you, and bad-mouth you while doing so. \n\nBut don't go work for those guys!\"\n\n\n\nA little reductive, but creating a bunch of negative sentiment then wringing hands about some people acting on that sentiment feels disingenuous.",
                "You'd think the restarted \"best businessman\" would know opposing companies/countries will take your disgruntled talent. Almost like he's purposefully sabotaging the country :) Americans will just complain on socials while it happens tho.",
                "It's almost as if the careless firing of tens of thousands of government employees and contractors could have fully expected consequences",
                "Well..wtf did they think was going to happen.  They flood the zone with unemployed govt workers and now China want the skills so they can build up their govt etc.  These fucks do stupid shit and wonder why stuff happens.  People won't sit around and suffer after you fire them.  They have families to feed.  They don't give a fk.  Whoever pay will get their services. I don't blame them. The US is unstable",
                "At this point they might be better off defecting, and that's in no way an endorsement of China.",
                "I keep saying it, but all of this private industry push is **profoundly** anti-American. There are private companies and money *all over the world.* The GOP in America *says* they are pro-America, but there isn't, and will never be, a policy that restricts private companies (and their money) to come to America and stay--because the world is big. There will always, always be money elsewhere and companies elsewhere. \n\nYou want to make America great? Improve America's ability to compete. That's all you can do."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Tariffs on cars from Mexico and Canada delayed by one month",
            "external_url": "https://edition.cnn.com/2025/03/05/business/tariffs-autos-mexico-canada-paused/index.html",
            "upvotes": 213,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2199678771.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Thank God we have a businessman like Trump running the show. I was worried that things would spiral out of control and our leadership would look incompetent and become an international punchline",
                "I must have skipped this part of 'Art of the Deal' where the effete businessperson flip flops after not fully understanding the basic rules of upmanship.",
                "This extortion style diplomacy is most likely going to fail and only serves to piss off everyone. Domestic companies are going to add in fees to their costs structure to put up with the amount of extra work required to deal with the chaos, forgetting that it simply costs more to produce here. International companies and governments are just going to stop doing business with us wherever they can. We need to stop thinking that America is required for the global economy to flourish. Our influence was already in decline after Trump 1.0 and v2.0 is setting us up to be completely irrelevant.",
                "Nah. This is because a Canadian candidate for PM proposed  to put 100% tariffs on Tesla. Elon not liking where that’s going ",
                "How did they guy bankrupt a casino?",
                "Yeah, constantly walking back your threats will totally make them respect you.",
                "Trump is confused about the meaning of \"winning\". He keeps confusing it with \"chaos\".",
                "Make up your freaking mind. This throw shit on the wall to see if it sticks bullshit is going to fail. Let's just get it over with.",
                "I hope there is no delay for their retaliation. The only way forward is to hit the bully back. Trump is not a serious person. Show him that he is dealing with serious people.",
                "And now the Dow Jones is rising cause of this news. Even though the rest of the tariffs on both sides are still going.\n\nClearly nothing more than “pump and dump” schemes by Trump’s inner circle."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Florida jewelry thief swallows $770K worth of Tiffany earrings just before arrest, police say",
            "external_url": "https://www.nbcnews.com/news/us-news/florida-jewelry-thief-swallows-770k-tiffany-earrings-just-arrest-polic-rcna194879",
            "upvotes": 175,
            "date": "03/05/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250305-jewelry-scan-ch-1112-14ce69.jpg",
            "top_comments": [
                "Good way to puncture your stomach and die.",
                "Take him to the airport, they have a special machine they strap them to until they poop and sort it out . They do this for drug smugglers who swallow drugs.",
                "does the resale value goe down after it has passed through someone's anus? like how a new car loses a lot of value if you drive it off the lot?",
                "Honey I got a great deal on some earrings for you!!!",
                "\"Private Pile: You had best square your ass away and start shitting me Tiffany cuff links or I will definitely fuck you up!\"",
                "Someone took Breakfast at Tiffany's too literally.",
                "Give him a ton of Miralax.",
                "This shit is gonna get messy.",
                "He'll just be hungry in an hour.",
                "Some poor rookie cop is probably going to be the one assigned to fish whatever's left out of his shit."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "FIRE files federal lawsuit against top Texas A&amp;M administrators",
            "external_url": "https://thebatt.com/news/fire-files-federal-lawsuit-against-texas-am/",
            "upvotes": 135,
            "date": "03/05/2025",
            "thumbnail": "https://thebatt.com/wp-content/uploads/2024/03/ASHB1317.jpg",
            "top_comments": [
                "“The Foundation for Individual Rights and Expression, or FIRE, has filed a federal lawsuit against the nine members of the Board of Regents, Chancellor John Sharp and Texas A&amp;M President Mark A. Welsh III on behalf of the Queer Empowerment Council, the student organization that hosts and organizes Draggieland.”\n\nKeep the lawsuits coming. Freedom of speech, freedom from persecution and discrimination are the building blocks of our democracy.",
                "What ever happened to just not attending if you're not interested? I mean, it's not the sort of thing I'd go out of my way to see, but I can always just... you know... not attend. When I was in college there would occasionally be some wandering preacher guy who'd show up on campus for a couple days. I wasn't really interested in his message, so I just kept walking. A very simple and elegant solution that didn't involve me trying to impose my personal beliefs on anyone else. I just would have appreciated someone from the campus security doing a bit of crowd control since people listening would often block the entire sidewalk which was a major thoroughfare.\n\nAnd honestly, nothing beats the name of a SF group: The Sisters of Perpetual Indulgence"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "NYS Corrections enters its third weeks of wildcat strikes; more than 8000 COs still on strike",
            "external_url": "https://www.northcountrypublicradio.org/news/story/51365/20250305/more-than-half-of-corrections-officers-still-on-ny-prison-strike-statewide",
            "upvotes": 79,
            "date": "03/05/2025",
            "thumbnail": "https://www.northcountrypublicradio.org/news/images/prisonrally030525.webp",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "CIA director says US has paused intelligence support to Ukraine",
            "external_url": "https://www.cnn.com/2025/03/05/politics/us-pause-intelligence-support-ukraine?utm_medium=social&amp;utm_source=whatsappCNN&amp;utm_content=2025-03-05T13%3A51%3A35",
            "upvotes": 14623,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2200569649.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "&gt;In the lead up to Trump’s inauguration, Ratcliffe and the Trump transition team were told of the value of intelligence sharing with Ukraine by US officials who stressed that it was a hallmark of their achievements on the battlefield, according to a source familiar with the discussions.\n\nWell, that's something, isn't it.",
                "The whole world is about to shift away from America and conservatives are going to wonder what happened in a decade.",
                "Just in case anyone believed that it was ever actually about the money and not an ideological desire to support Russia in the war.",
                "Sooner or later the US will share their intelligence support to its new closest ally: Russia.",
                "Intelligence in the United States has been paused as well.",
                "If not Russian asset, why Russian asset shaped?",
                "we are the baddies, its official",
                "Better headline:  \n\\&gt; Russian Agent has paused US intelligence sharing with Ukraine",
                "There won't be future support from the US to Ukraine at all. It's over. Trump is going to start a manufactured fight with the entire EU I imagine to use it as a pretense to leave NATO and The UN.",
                "Ukraine should expel all CIA assets in their country to prevent the US from sharing intelligence data with Russia. Maybe expel US diplomats and close the US embassy, too.  It's obvious, that the US has chosen sides against Ukraine, so just make it official and kick the US out."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "China says it is ready for 'any type of war' with US",
            "external_url": "https://www.bbc.com/news/articles/c4gmd3g2nzqo",
            "upvotes": 10324,
            "date": "03/05/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/00c6/live/68e23460-f9d5-11ef-8c03-7dfdbeeb2526.jpg",
            "top_comments": [
                "This will surely lower the cost of my groceries, medications and housing.",
                "Only 44 days Trump has been in office. This is both exhausting and terrifying 🤷‍♂️",
                "Why are we doing this.",
                "As a millennial, I'm tired.",
                "This is crazy lol. \n\n\"If war is what the US wants, be it a tariff war, a trade war or any other type of war, we're ready to fight till the end,\" China's embassy said on X",
                "Dance off it is, then.",
                "Yes, lets attack all of our largest trading partners. That will go great for us.",
                "As a lib, I feel owned.",
                "Is this going to help my ‘cheaper eggs’?",
                "Trump making the world less safe and our food more expensive. I don’t think he’s making it four years."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court rejects Trump’s request to keep billions in foreign aid frozen",
            "external_url": "https://www.cnn.com/2025/03/05/politics/supreme-court-usaid-foreign-aid/index.html",
            "upvotes": 6653,
            "date": "03/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-24t143153z-1113666480-rc2bl8a8wu4b-rtrmadp-3-usa-court-abortion-clinics.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Alito’s dissent is some choice bullshit. “How dare a lower court override the president!”\n\nThe lower court found that congress had specified money to be spent, and the executive branch can’t just say “Nah.” They can slow walk it, they can do some other shady shit - but in the end they gotta pay out that money. \n\nAlito’s so concerned about someone overturning the president he’s saying the statutes congress passed don’t matter.",
                "It’s kind of mind boggling that 4 Supreme Court Justices support the idea that the Executive branch can just deicide not to pay their bills when the Legislative branch has allocated the funding and the recipients have already done what they were to be paid to do.",
                "OK, so now let’s see if trump complies and if he doesn’t, then what?",
                "Damn Justice Amy Coney Barrett doing justice.",
                "That there are only five SCOTUS votes for paying congressionally mandated invoices for work *already* done!? This should be as basic a test of Article I as you can get. And that does not bode well for decisions to come",
                "“Four of the court’s conservatives — Justices Clarence Thomas, Samuel Alito, Neil Gorsuch and Brett Kavanaugh — dissented.”\n\nThese are the men who will dismantle our democracy. \n\nSo shocked by Coney Barrett. I guess he does understand the Constitution and the benefit of rule of law. \n\nBTW- this ruling merely states that the USG must pay for work already done by implementers. This is money owed to them.",
                "Hallelujah. I haven’t been keeping up too much with which justices vote for what so maybe this is normal, but I was surprised to see Amy Coney Barrett voted with the liberal justices.",
                "Interesting that 2 conservatives, including 1 Trump appointee in Barrett ruled against Trump. Though maybe not so much considering how relatively extreme this case is. The decision to spend this money is made by Congress and the executive branch, in theory, shouldn't be able to stop it for long.\n\nWhat will be more interesting(albeit also scary and dangerous) is what happens if the executive branch starts to ignore judicial rulings that they don't like.\n\nIf Congress sits around and concedes authority to the executive branch and the judicial branch turns out to be toothless, that kind of defeats the whole checks and balances concept that we've leaned on for so long. From there the executive can do whatever, no?",
                "So, it looks like this isn't a particularly strong ruling against Trump, despite the headline, given that it basically shifts responsibility back down to the lower court.\n\nAt least that's something, I guess?\n\nIn any case, we'll see if Trump decides to Jackson this.",
                "Whenever I hear even moderately good news from SCOTUS, I immediately fear that it's a bone being thrown to the Left right before an awful ruling for Trump."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Piglets left to starve as part of a controversial art exhibition in Denmark have been stolen",
            "external_url": "https://abcnews.go.com/International/wireStory/piglets-left-starve-part-controversial-art-exhibition-denmark-119470901",
            "upvotes": 2484,
            "date": "03/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0fb06c2d-556c-48e1-814e-38334a5535a3/wirestory_4ed7e96f9274f68dd9f202ed9955748a_16x9.jpg?w=1600",
            "top_comments": [
                "Good on the activists who stole them and the guy who helped. This artist is nuts. What an awful person.\n\n This just seems extra cruel for no real end game, like its not going to stop anyone from anything, it was suffering for the sake of \"art\".",
                "This the same artist that did the goldfish in blenders?",
                "This is not art it’s animal cruelty",
                "&gt; Chilean-born Marco Evaristti said he had been aiming to raise awareness of the suffering caused by mass meat production with his art installation that opened last week in Copenhagen. The piglets were being denied food and water and would have been allowed to starve to death.\n\nI don't think the way to advocate against animal cruelty, is to cause more animal cruelty. Especially when you're subjecting a creature to a slow death that is initially pretty agonizing.",
                "Suffering for his art is probably a good thing. Replace the missing pigs in the cage with the artist - maybe it will make the same point.",
                "It is kind of interesting that everyone is very upset by this but not upset when it is done in factory farms. I think that is the point of this. Not defending it but I wish some of you would reflect on how this mirrors industrial farming techniques.",
                "I’m inclined to think this artist is actually a psychopath.  Performing animal cruelty to point out other people’s cruelty is certainly a choice.",
                "There was an artist a while back who did something like this with a dog. Guillermo Vargas brought in a starving street dog from outside and had it in the art gallery for 3 hours - the gallery reported that he did feed it food and water while it was there, before it \"escaped.\" Guests were shocked and complained about it, and the artist's point was basically, it's the same dog you walked past outside but didn't give a shit about.",
                "I'm going out on a limb here and braving the wall of downvotes.\n\n\nThe provocation artist achived what he wanted without harming the piglets. They were never starved, they were not even showcased.\n\n\nYet he managed to upset so many people, that it sparked an outrage highlighting the fact most people don't give two shits about animals dying, as long as they are out of sight. What can be more artful than getting people to reflect on issues they normally wouldn't?\n\n\nThe comments in this post are beyond disappointing and shows they have no grasp on art at all.",
                "Maybe, just maybe, the theft of the piglets is all part of the art exhibition. I’m not sure this is the case given that the exhibition opened last week. \n\nIf the intention was to allow three piglets to die from thirst there is a special place in hell for the artist. \n\n“Chilean-born Marco Evaristti said he had been aiming to raise awareness of the suffering caused by mass meat production with his art installation that opened last week in Copenhagen. The piglets were being denied food and water and would have been allowed to starve to death.”\n\nThey wouldn’t have starved to death, they would have died of thirst."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Private employers added just 77,000 jobs in February, far below expectations, ADP says",
            "external_url": "https://www.cnbc.com/2025/03/05/adp-jobs-report-february-2025-.html",
            "upvotes": 2809,
            "date": "03/05/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108108397-1740666394856-gettyimages-2202188375-homedepotquarterlyreport0013.jpeg?v=1740666491&w=1920&h=1080",
            "top_comments": [
                "Feel like lots of people cheering on the federal government layoffs are going to be in for a rude awakening when suddenly there's 10x as many people applying for each open private sector job.",
                "Virginia's governor had a whole press conference where he unveiled this website to help federal workers who had been laid off to find new jobs. \n\nThe website is literally just links to LinkedIn and Indeed.",
                "Y’all better buckle tf up because we are headed straight for a massive recession. \n\n✅Hundreds of thousands of newly out of work employees competing for a shrinking pool of private sector jobs\n\n✅Tariffs causing inflation \n\n✅Government accountability and enforcement on financial institutions becoming non-existent\n\nCannot overstate how perfect of an economic storm is brewing right now. But thank god the right finally owned us queer-loving liberal pansies.",
                "This is exactly what so many people wanted. \n\nTo get fired from their well paying and financially sound government employment so they can : *checks notes* work at Home Depot. \n\nAwesome.",
                "Our country is being crippled by the current administration and our economy is in a downward spiral. Of course there are fewer jobs being offered.",
                "First time in memory a new administration has intentionally crashed the economy. Typically, it's hard to pinpoint exactly how an administration moves the needle. There won't be any guesswork this time.",
                "Did you like the Great Depression? Well, good news, it's back! We've got isolationism! We've got protectionism! We've got the rise of fascism! All the greatest hits!",
                "Won't a flood of applicants drive down wages",
                "Giant agribusiness Corp I'm at is on an indefinite hiring freeze because of tariffs. Guess where their PAC $ went.",
                "The government is about to start shutting down reporting of these unemployment numbers. Trump will say “take my word for it, America is doing great!” Ignore the problem.."
            ],
            "aggregate_sentiment": 18.0
        }
    ],
    "last_updated": "03/05/2025 20:02:59 UTC"
}