{
    "posts": [
        {
            "category": "HOT",
            "title": "Former US Rep. Charles Rangel, who spent nearly 50 years representing New York, has died",
            "external_url": "https://apnews.com/article/charles-rangel-dies-9902b608e33aeb7db30478be00a77acc",
            "upvotes": 4856,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Rep Rangel fought with the 2d Division in the Battle of Chongchon, some of the most intense fighting during the Korean War. This was the battle in late November 1959 when the Chinese surprised the US military by entering into the war on North Korea’s side. Here is his interview on his experience: https://koreanwarlegacy.org/interviews/charles-rangel/\nRIP Rep Rangel.",
                "Rangel did a lot of work for the Harlem community, esp culturally in terms of the research library there, the arts, and Harlem history.",
                "For anyone who only knows about politics through The Daily Show and other comedy programming, you may recognize Rep. Charlie Rangel from [this photo.](https://vip.nypost.com/wp-content/uploads/sites/2/2014/06/rangel5.jpg)",
                "It's quite amazing that Harlem has only had three people represent them in Congress in 80 years. Rangel defeated Adam Clayton Powell, Jr. in 1970 who was a legend in the community but by the time the mid-60s came around, he had all but checked out of the job and was under investigation for misusing public money. And he was spending more time in his second home in Bimini than Washington or New York. And Rangel became a legend in his own right but probably stayed too long as well before finally retiring in 2017.",
                "No one reads the articles.",
                "Democrats are falling like flies lately. Quite unfortunate, RIP.",
                "https://youtu.be/a_GRMQ9H6IU?si=XyLCIaRvxWn-40-7",
                "He helped Nixon lead the war on drugs. \n\nhttps://www.northcountrypublicradio.org/news/story/22550/20130819/charles-rangel-america-s-front-line-general-in-the-drug-war",
                "RIP but a fifty year career politician? This is exactly the problem.",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Mary Lou Retton arrested for DUI",
            "external_url": "https://www.wdtv.com/2025/05/26/mary-lou-retton-arrested-dui-marion-county/",
            "upvotes": 6548,
            "date": "05/26/2025",
            "thumbnail": "https://gray-wdtv-prod.gtv-cdn.com/resizer/v2/LRXBURX27RGONAM34KNDBKXDQQ.jpg?auth=06dde6adb7b85990a69e4984ffdab2c6bbf8a9788c86af1cae05d7b26a2c2483&width=1200&height=600&smart=true",
            "top_comments": [
                "She blew a 6.0, but the Russian judge cut it down to 5.4.",
                "Thought she was dying in the hospital recently? Either way sucks don’t drink and drive.",
                "Fuck her. She campaigned AGAINST a bill calling for reform in gymnastics after the whole Nasser sexual assault scandal. Vile.",
                "She was leaving the Uneven Bar",
                "For anyone who doesn’t know who she is: [Mary Lou Retton](https://en.m.wikipedia.org/wiki/Mary_Lou_Retton)\n\nJudging from the current comments, her current reputation is sub-par to say the least.",
                "I guess her crowded funded half million from a few years ago won't cover an Uber.",
                "For those keeping track at home, we've got:  \n\\- Abuse apologizer / Larry Nassar supporter  \n\\- Anti-SafeSport Act  \n\\- Anti-universal healthcare (and subsequent leech of others' generosity to expense her medical bills due to being anti-Obamacare, all the while living in a mansion and having received $2 million in her divorce settlement only a few years prior)  \n\\- Face of reverse mortgage ads  \nAnd now,  \n\\- Selfish and dangerous driver with a DUI on her record\n\nQuite the fall from grace imho, really failed to stick the landing on her post-Olympic life.",
                "She cried about not having insurance when she was near death a few years back, but doesn’t vote for the party that would’ve helped her.\n\nAnd the  Nassar  stuff. F her",
                "That's a rough 57. Too bad. She was America's sweetheart. On the box of Wheaties and everything.",
                "She yelled at me once for blocking her view while I was covering an event as a photographer. Class act"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Sentencing hearing scheduled for Myrtle Beach Safari owner highlighted in ‘Tiger King’",
            "external_url": "https://www.wmbfnews.com/2025/05/26/sentencing-hearing-scheduled-myrtle-beach-safari-owner-highlighted-tiger-king/",
            "upvotes": 3419,
            "date": "05/26/2025",
            "thumbnail": "https://gray-wmbf-prod.gtv-cdn.com/resizer/v2/VQSOJZS435AF3NCVAUBXYVLD74.jpg?auth=956150d40cdfb7bd084074507ad21f87db4903f5f733efd55225dd3987999637&width=1200&height=600&smart=true",
            "top_comments": [
                "Just as big of a piece of shit as Joe, but with more intelligence.",
                "What stuck with me about this guy after watching Tiger King were the women he \"employed\". They had to be virginal or really close to it, young and willing to work seven days a week for the roof over their head. He's a disgusting piece of garbage and I hope he gets max sentencing.",
                "*The investigation also uncovered evidence of money laundering between Feb. and April 2022, when Antle and his co-conspirator conducted financial transactions with cash they believed was obtained from transporting and harboring undocumented immigrants.*\n\nWhat da hell",
                "He's got ~~Betty Davis~~ Methamphetamine Eyes.",
                "Who the fuck operates a “safari” in Myrtle fucking beach?!",
                "Is Carol Baskins the only main character that isn’t in jail?",
                "That guy was such an insufferable douche. That guy is gonna need both hands to pull his head out of his ass.",
                "Didn't he do tourist photos with heavily drugged tigers at his Myrtle Beach Safari?",
                "I watched that train wreck...I'll never get that time back.",
                "In the paraphrased words of L. Ron Hubbard, the real grift is in religion. You make up some mumbo jumbo and get some marks to believe it. Hubbard did set the standard though, if your money laundering sci-fi sex cult doesn't have a boat, are you even trying?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "2 dead, 9 hurt in mass shooting in Fairmount Park",
            "external_url": "https://www.nbcphiladelphia.com/news/local/fairmount-park-police-activity-shooting-memorial-day-philadelphia/4194340/",
            "upvotes": 363,
            "date": "05/27/2025",
            "thumbnail": "https://media.nbcphiladelphia.com/2025/05/Police-activity-shuts-down-Fairmount-Park-on-Memorial-Day-1.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The sounds of summer are gunshots.",
                "Jesus fucking Christ man",
                "There are two types of mass shootings. This is the other one.",
                "Once upon a time in America. And the world shakes its head.",
                "Just another Tuesday in America.  Damn it.",
                "The US is pathetic, how many more ppl will die before we regulate firearms?",
                "_'No Way to Prevent This,'_ Says Only Nation Where This Regularly Happens",
                "Just another day in the USA.",
                "A normal day in the Fascist States of America! The President is a Felon and a convicted rapist!!",
                "Likely a stupid kid with a gun popping off over nonsense."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Duck Dynasty founding father Phil Robertson dies at 79",
            "external_url": "https://www.nbcnews.com/news/obituaries/duck-dynasty-founding-father-phil-robertson-dies-79-rcna209035",
            "upvotes": 10134,
            "date": "05/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250526-Phil-Robertson-DD-RS-408024.jpg",
            "top_comments": [
                "[deleted]",
                "What's crazy is he went to college and played QB and a very high level",
                "Goldnecks: rich people who like pretending they're just some country boys",
                "Claims to be Pro-Life, dies.",
                "“Two guys break into an atheist’s home, he has a little atheist wife and two little atheist daughters. Two guys break into his home, and tie him up in a chair and gag him. And then they take his two daughters in front of him and rape both of ‘em and then shoot ‘em. And they take his wife and decapitate her head off in front of him. And then they can look at him and say “Isn’t it great that I didn’t have to worry about being judged? Isn’t it great that there’s nothing wrong with this? There’s no right or wrong. Now is it, dude?” And then you take a sharp knife and take his manhood and hold it in front of him and say “Wouldn’t it be something if there was something wrong with this? But you’re the one who says there’s no god, there’s no right, there’s no wrong, so we’re just having fun! We’re sick in the head. Have a nice day.”\n\n-Phil Robertson\n\nYeah this is the thought process of a piece of garbage. Nothing was lost on this day. Good riddance, prick.",
                "The Hillbilly Kardashians",
                "Is that the super racist one?",
                "Wasn’t this the same dumbass that said we don’t need universal healthcare because he’s got eternal life through the blood of Jesus Christ?",
                "Hmmmm… a grifting father of a family of grifters no longer alive to grift. \n\nSo, what’s everyone doing for Memorial Day?",
                "He’s visiting Rush Limbaugh."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "11 hospitalized, including 2 kids, after boat explosion in Florida",
            "external_url": "https://www.nbcnews.com/news/us-news/11-hospitalized-2-kids-boat-explosion-florida-rcna209138",
            "upvotes": 254,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25527-florida-boat-explosion-rc1218a-1aa219.jpg",
            "top_comments": [
                "Antonio Rivero said he was with family members on the boat when it went up in flames.\n\n“Tried to fuel up the boat, and must have been a gas leak and, you know, spark went off and explosion,” Rivero said. “One of the guys' pants were blown off, so it was bad.”",
                "The greatest point in the whole story is the dog was rescued uninjured."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Police responding to incident at Liverpool FC parade after reports of car collision with pedestrians | UK News",
            "external_url": "https://news.sky.com/story/police-responding-to-incident-at-liverpool-fc-parade-after-reports-of-car-collision-with-pedestrians-13374978",
            "upvotes": 1550,
            "date": "05/26/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-liverpool-car-crash_6928124.jpg?20250526194011",
            "top_comments": [
                "[removed]",
                "In case anybody was unsure: \"closed the damned streets with car-proof barriers\"\n\nMy God how does this keep happening.",
                "53 year old white male\nhttps://news.sky.com/story/police-responding-to-incident-at-liverpool-fc-parade-after-reports-of-car-collision-with-pedestrians-13374978",
                "That's got to be a police fail. Yes, the guy lost it, but how he was allowed to get his car into that area is inexcusable. \n\nIt is then a series of panicked decisions (just get out of the car and give it up, it'll be fine) followed by utter psychosis, literally deliberately driving into people. \n\nIt is GBH and possibly attempted murder BTW, fucking idiot.",
                "First one I’ve experienced where I had family at the event. They’re fine, thank god. No where near it. \n\nFirst one, but at this rate, probably not the last. We all responded so immediately and calmly with calls to make sure everyone was fine? Like it was drilled? Fuck.",
                "Think we should be careful about speculation. Especially in the wake of what happened following the Southport killings.",
                "It looked like Road Rage to me. The guy just lost the plot",
                "The bastard is lucky the crowd didn’t tear them limb from limb. Definitely deliberate. ",
                "Looks like the cops were protecting the perpetrator from the crowd after he plowed into them. Seems like they would of dragged his ass out and put the boots to him.",
                "How did that car even get there "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Deputies fatally shoot Florida man who survived apparent gator attack and tried to steal their gun, sheriff says",
            "external_url": "https://www.nbcnews.com/news/us-news/deputies-fatally-shoot-florida-man-gator-attack-tried-steal-gun-rcna209128",
            "upvotes": 121,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25526-florida-fatal-police-shooting-gator-attack-rc-925p-b8907f.jpg",
            "top_comments": [
                "It’s like they used a “Florida man” random headline generator",
                "booked and released for meth charges a week ago (⊙\\_⊙;) might explain his behavior",
                "Two deputies, including a trainee, opened fire on Timothy Schulz, 42, after they deployed a stun gun that appeared to have no effect and after Schulz tried to remove a firearm from their patrol cruiser, Polk County Sheriff Grady Judd told reporters.",
                "I thought gta6 was still a year away",
                "Are they still using bath salts in Florida?",
                "I see they're already working on the first GTA 6 expansion",
                "id like to see the dashcam/bodycam footage on that please. .. gator attacks man, man survives only to be killed later by cops? sounds fishy",
                "Trump is looking at a pardon prior to capture, checking to see if social media comments were pro tangerine."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "WWII bomber crash left 11 dead and ‘non-recoverable.’ 4 are finally coming home",
            "external_url": "https://apnews.com/article/american-bomber-wwii-remains-divers-212ba07efdab40941f09026c79fdb5c0",
            "upvotes": 1743,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Sheppick, 26, and Tennyson, 24, each left behind pregnant wives who would sometimes write them two or three letters a day. Darrigan, 26, also was married, and had been able to attend his son’s baptism while on leave. A photo shows him in uniform, smiling as he holds the boy.\n\n>Darrigan’s wife, Florence, remarried but quietly held on to photos of her late husband, as well as a telegram informing her of his death.\n\n>Tennyson’s wife, Jean, lived until age 96 and never remarried.\n\n>“She never stopped believing that he was going to come home,” said her grandson, Scott Jefferson.\n\nSo rough on the families too. Glad they were able to help bring closure for some of them.",
                "From the title I thought another restored aircraft went down.",
                "Their bomber was called *'Heaven Can Wait'*. Thank you gentlemen. Youe wait is over.",
                "If anyone has American ancestors who were MIA in WW1, WW2, Korea, Vietnam, the Gulf Wars, or anytime during the Cold War that are unidentified, you can reach out to the [Defense POW/MIA Accounting Agency](http://dpaa.mil/Resources/FAQs/) (Look at WHO IS ELIGIBLE TO DONATE MITOCHONDRIAL DNA?)",
                "Welcome home gentlemen. Rest in peace - your service shall not be forgotten.",
                "cant imagine theres many remains left to find after being at the bottom of the ocean for 80 years.  surely their bones would have been scattered by scavengers? i doubt the wreck was perfectly sealed",
                "Welcome home gentleman.    R.I.P.",
                "All of you did what was necessary and paid the ultimate price and sacrifice.  Thank you very much for your service and welcome home.  \n\nHope you and the loved one left behind are together again upstair.\n\nGod bless you all."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Ex-police chief escapes from Arkansas prison where he was serving murder, rape sentences",
            "external_url": "https://www.cbsnews.com/news/grant-hardin-arkansas-prison-escape/",
            "upvotes": 7989,
            "date": "05/26/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/26/c4e4b220-3f6d-437e-87ce-45f405a660b9/thumbnail/1200x630/0dae33da6db213d4a59f739177cb86f5/screenshot-2025-05-25-at-9-50-46-pm.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                ">[KFSM reported in 2019](https://www.5newsonline.com/article/news/local/outreach/back-to-school/former-police-chief-convicted-murderer-pleads-guilty-to-raping-rogers-teacher-in-1997/527-accc272d-e94b-4c00-b9cb-6a4ee5e42125) that police in 2003 used DNA samples from the rape victim's clothes to apply for a \"John Doe\" warrant since the statute of limitations was close to expiring. Investigators eventually got a match after Hardin was imprisoned for Appleton's killing.\n\nMurders someone, then his DNA sample during processing matches a rape case.\n\nWinning through and through.",
                "Hardin pleaded guilty in October 2017 to first-degree murder in connection with the shooting death of 59-year-old James Appleton. According to an affidavit filed in the case, Appleton worked for the Gateway water department and was talking to his brother-in-law, then-Gateway Mayor Andrew Tillman, when he was shot in the head on Feb. 23, 2017, near Garfield. Police found Appleton's body inside a car.",
                "“Ex-police chief, who escaped from prison for rape and murder sentences, is found as the new police chief a town in a neighboring state”",
                "Totally “accidentally”",
                "What's with all the prison breaks that have been happening lately? Have there actually been more of them, or is the news just reporting on them because they're trending? Or is the *Prison Break* reboot going hard with its marketing?",
                "I bet he had inside help.",
                "Wouldn't he have been out of genpop for being a former cop anyway? How he escaped has to either be a serious fuck up or extremely daring.",
                "he likely just knew the layout and knew exactly what was needed to go with no fuss. \n\ni worked in a psych ward for a few years and realize im not exempt to being subjected to a place like this if i decided on a whim that i was done. if i had landed in the facility i worked i'd probably beg them not to take me to this particular place, mostly out of embarrassment, specifically telling them that i know the entire layout and how to get out if i needed to. this highlights the flaw in the system. if i told them this en route, they wouldnt care. its not their problem. the intake department might have some concerns, but the facility manager would likely pass it off as some random manic episode. they certainly wouldnt check records, because the paycheck of holding someone is the single most important factor for them.\n\ni left that job btw, because someone on another unit successfully committed suicide on their watch. this is literally the most important part of our job, but they wanted to cut corners, and go against doctors orders to save a few dollars. the only positive takeaway i have from the entire situation that it wasnt my unit. i only heard things. never interacted with the individual myself...",
                "So according to sources:\n\n\"[Hardin worked for at least four separate law enforcement departments in Northwest Arkansas before the murder he is serving prison time for.](https://www.4029tv.com/article/rape-suspect-worked-for-four-local-police-departments/18154261) He was also elected constable for Benton County Township One.\"\n\nAs often as this guy was moved along, police departments had to know this guy was a problem, and yet still he kept getting hired!\n\nThen again..nothing should surprise me these days...after all America voted a convicted felon into the WH!",
                "Gonna end up dead soon."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Deputies fatally shoot Florida man who survived apparent gator attack and tried to steal their gun, sheriff says",
            "external_url": "https://www.nbcnews.com/news/us-news/deputies-fatally-shoot-florida-man-gator-attack-tried-steal-gun-rcna209128",
            "upvotes": 120,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25526-florida-fatal-police-shooting-gator-attack-rc-925p-b8907f.jpg",
            "top_comments": [
                "It’s like they used a “Florida man” random headline generator",
                "booked and released for meth charges a week ago (⊙\\_⊙;) might explain his behavior",
                "Two deputies, including a trainee, opened fire on Timothy Schulz, 42, after they deployed a stun gun that appeared to have no effect and after Schulz tried to remove a firearm from their patrol cruiser, Polk County Sheriff Grady Judd told reporters.",
                "I thought gta6 was still a year away",
                "Are they still using bath salts in Florida?",
                "I see they're already working on the first GTA 6 expansion",
                "id like to see the dashcam/bodycam footage on that please. .. gator attacks man, man survives only to be killed later by cops? sounds fishy",
                "Trump is looking at a pardon prior to capture, checking to see if social media comments were pro tangerine."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "2 dead, 9 hurt in mass shooting in Fairmount Park",
            "external_url": "https://www.nbcphiladelphia.com/news/local/fairmount-park-police-activity-shooting-memorial-day-philadelphia/4194340/",
            "upvotes": 361,
            "date": "05/27/2025",
            "thumbnail": "https://media.nbcphiladelphia.com/2025/05/Police-activity-shuts-down-Fairmount-Park-on-Memorial-Day-1.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The sounds of summer are gunshots.",
                "Jesus fucking Christ man",
                "There are two types of mass shootings. This is the other one.",
                "Once upon a time in America. And the world shakes its head.",
                "Just another Tuesday in America.  Damn it.",
                "The US is pathetic, how many more ppl will die before we regulate firearms?",
                "_'No Way to Prevent This,'_ Says Only Nation Where This Regularly Happens",
                "Just another day in the USA.",
                "A normal day in the Fascist States of America! The President is a Felon and a convicted rapist!!",
                "Likely a stupid kid with a gun popping off over nonsense."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Nepal's 'Everest Man' sets record with 31st summit",
            "external_url": "https://www.bbc.com/news/articles/cm2y70xknnyo",
            "upvotes": 79,
            "date": "05/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/40ef/live/68c2fd30-3abb-11f0-a226-6feb158da452.jpg",
            "top_comments": [
                "He's 55 and has summited it almost every year since 1994. Twice in some years. I wonder how much longer his career will last. This is his job after all.",
                "Well with the Disney Fast Pass it’s quite easy to /s",
                "i have a feeling next year this guy breaks the record for most summits of Mount Everest",
                "He has broken his own record",
                "At this point, it must be a walk in the glacial park for this guy",
                "How many times do the Sherpa's do it?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "11 hospitalized, including 2 kids, after boat explosion in Florida",
            "external_url": "https://www.nbcnews.com/news/us-news/11-hospitalized-2-kids-boat-explosion-florida-rcna209138",
            "upvotes": 252,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25527-florida-boat-explosion-rc1218a-1aa219.jpg",
            "top_comments": [
                "Antonio Rivero said he was with family members on the boat when it went up in flames.\n\n“Tried to fuel up the boat, and must have been a gas leak and, you know, spark went off and explosion,” Rivero said. “One of the guys' pants were blown off, so it was bad.”",
                "The greatest point in the whole story is the dog was rescued uninjured."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Former US Rep. Charles Rangel, who spent nearly 50 years representing New York, has died",
            "external_url": "https://apnews.com/article/charles-rangel-dies-9902b608e33aeb7db30478be00a77acc",
            "upvotes": 4854,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Rep Rangel fought with the 2d Division in the Battle of Chongchon, some of the most intense fighting during the Korean War. This was the battle in late November 1959 when the Chinese surprised the US military by entering into the war on North Korea’s side. Here is his interview on his experience: https://koreanwarlegacy.org/interviews/charles-rangel/\nRIP Rep Rangel.",
                "Rangel did a lot of work for the Harlem community, esp culturally in terms of the research library there, the arts, and Harlem history.",
                "For anyone who only knows about politics through The Daily Show and other comedy programming, you may recognize Rep. Charlie Rangel from [this photo.](https://vip.nypost.com/wp-content/uploads/sites/2/2014/06/rangel5.jpg)",
                "It's quite amazing that Harlem has only had three people represent them in Congress in 80 years. Rangel defeated Adam Clayton Powell, Jr. in 1970 who was a legend in the community but by the time the mid-60s came around, he had all but checked out of the job and was under investigation for misusing public money. And he was spending more time in his second home in Bimini than Washington or New York. And Rangel became a legend in his own right but probably stayed too long as well before finally retiring in 2017.",
                "No one reads the articles.",
                "Democrats are falling like flies lately. Quite unfortunate, RIP.",
                "https://youtu.be/a_GRMQ9H6IU?si=XyLCIaRvxWn-40-7",
                "He helped Nixon lead the war on drugs. \n\nhttps://www.northcountrypublicradio.org/news/story/22550/20130819/charles-rangel-america-s-front-line-general-in-the-drug-war",
                "RIP but a fifty year career politician? This is exactly the problem.",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Mary Lou Retton arrested for DUI",
            "external_url": "https://www.wdtv.com/2025/05/26/mary-lou-retton-arrested-dui-marion-county/",
            "upvotes": 6550,
            "date": "05/26/2025",
            "thumbnail": "https://gray-wdtv-prod.gtv-cdn.com/resizer/v2/LRXBURX27RGONAM34KNDBKXDQQ.jpg?auth=06dde6adb7b85990a69e4984ffdab2c6bbf8a9788c86af1cae05d7b26a2c2483&width=1200&height=600&smart=true",
            "top_comments": [
                "She blew a 6.0, but the Russian judge cut it down to 5.4.",
                "Thought she was dying in the hospital recently? Either way sucks don’t drink and drive.",
                "Fuck her. She campaigned AGAINST a bill calling for reform in gymnastics after the whole Nasser sexual assault scandal. Vile.",
                "She was leaving the Uneven Bar",
                "For anyone who doesn’t know who she is: [Mary Lou Retton](https://en.m.wikipedia.org/wiki/Mary_Lou_Retton)\n\nJudging from the current comments, her current reputation is sub-par to say the least.",
                "I guess her crowded funded half million from a few years ago won't cover an Uber.",
                "For those keeping track at home, we've got:  \n\\- Abuse apologizer / Larry Nassar supporter  \n\\- Anti-SafeSport Act  \n\\- Anti-universal healthcare (and subsequent leech of others' generosity to expense her medical bills due to being anti-Obamacare, all the while living in a mansion and having received $2 million in her divorce settlement only a few years prior)  \n\\- Face of reverse mortgage ads  \nAnd now,  \n\\- Selfish and dangerous driver with a DUI on her record\n\nQuite the fall from grace imho, really failed to stick the landing on her post-Olympic life.",
                "She cried about not having insurance when she was near death a few years back, but doesn’t vote for the party that would’ve helped her.\n\nAnd the  Nassar  stuff. F her",
                "That's a rough 57. Too bad. She was America's sweetheart. On the box of Wheaties and everything.",
                "She yelled at me once for blocking her view while I was covering an event as a photographer. Class act"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Sentencing hearing scheduled for Myrtle Beach Safari owner highlighted in ‘Tiger King’",
            "external_url": "https://www.wmbfnews.com/2025/05/26/sentencing-hearing-scheduled-myrtle-beach-safari-owner-highlighted-tiger-king/",
            "upvotes": 3406,
            "date": "05/26/2025",
            "thumbnail": "https://gray-wmbf-prod.gtv-cdn.com/resizer/v2/VQSOJZS435AF3NCVAUBXYVLD74.jpg?auth=956150d40cdfb7bd084074507ad21f87db4903f5f733efd55225dd3987999637&width=1200&height=600&smart=true",
            "top_comments": [
                "Just as big of a piece of shit as Joe, but with more intelligence.",
                "What stuck with me about this guy after watching Tiger King were the women he \"employed\". They had to be virginal or really close to it, young and willing to work seven days a week for the roof over their head. He's a disgusting piece of garbage and I hope he gets max sentencing.",
                "*The investigation also uncovered evidence of money laundering between Feb. and April 2022, when Antle and his co-conspirator conducted financial transactions with cash they believed was obtained from transporting and harboring undocumented immigrants.*\n\nWhat da hell",
                "He's got ~~Betty Davis~~ Methamphetamine Eyes.",
                "Who the fuck operates a “safari” in Myrtle fucking beach?!",
                "Is Carol Baskins the only main character that isn’t in jail?",
                "That guy was such an insufferable douche. That guy is gonna need both hands to pull his head out of his ass.",
                "Didn't he do tourist photos with heavily drugged tigers at his Myrtle Beach Safari?",
                "I watched that train wreck...I'll never get that time back.",
                "In the paraphrased words of L. Ron Hubbard, the real grift is in religion. You make up some mumbo jumbo and get some marks to believe it. Hubbard did set the standard though, if your money laundering sci-fi sex cult doesn't have a boat, are you even trying?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Police responding to incident at Liverpool FC parade after reports of car collision with pedestrians | UK News",
            "external_url": "https://news.sky.com/story/police-responding-to-incident-at-liverpool-fc-parade-after-reports-of-car-collision-with-pedestrians-13374978",
            "upvotes": 1556,
            "date": "05/26/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-liverpool-car-crash_6928124.jpg?20250526194011",
            "top_comments": [
                "[removed]",
                "In case anybody was unsure: \"closed the damned streets with car-proof barriers\"\n\nMy God how does this keep happening.",
                "53 year old white male\nhttps://news.sky.com/story/police-responding-to-incident-at-liverpool-fc-parade-after-reports-of-car-collision-with-pedestrians-13374978",
                "That's got to be a police fail. Yes, the guy lost it, but how he was allowed to get his car into that area is inexcusable. \n\nIt is then a series of panicked decisions (just get out of the car and give it up, it'll be fine) followed by utter psychosis, literally deliberately driving into people. \n\nIt is GBH and possibly attempted murder BTW, fucking idiot.",
                "First one I’ve experienced where I had family at the event. They’re fine, thank god. No where near it. \n\nFirst one, but at this rate, probably not the last. We all responded so immediately and calmly with calls to make sure everyone was fine? Like it was drilled? Fuck.",
                "Think we should be careful about speculation. Especially in the wake of what happened following the Southport killings.",
                "It looked like Road Rage to me. The guy just lost the plot",
                "The bastard is lucky the crowd didn’t tear them limb from limb. Definitely deliberate. ",
                "Looks like the cops were protecting the perpetrator from the crowd after he plowed into them. Seems like they would of dragged his ass out and put the boots to him.",
                "How did that car even get there "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "WWII bomber crash left 11 dead and ‘non-recoverable.’ 4 are finally coming home",
            "external_url": "https://apnews.com/article/american-bomber-wwii-remains-divers-212ba07efdab40941f09026c79fdb5c0",
            "upvotes": 1745,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Sheppick, 26, and Tennyson, 24, each left behind pregnant wives who would sometimes write them two or three letters a day. Darrigan, 26, also was married, and had been able to attend his son’s baptism while on leave. A photo shows him in uniform, smiling as he holds the boy.\n\n>Darrigan’s wife, Florence, remarried but quietly held on to photos of her late husband, as well as a telegram informing her of his death.\n\n>Tennyson’s wife, Jean, lived until age 96 and never remarried.\n\n>“She never stopped believing that he was going to come home,” said her grandson, Scott Jefferson.\n\nSo rough on the families too. Glad they were able to help bring closure for some of them.",
                "From the title I thought another restored aircraft went down.",
                "Their bomber was called *'Heaven Can Wait'*. Thank you gentlemen. Youe wait is over.",
                "If anyone has American ancestors who were MIA in WW1, WW2, Korea, Vietnam, the Gulf Wars, or anytime during the Cold War that are unidentified, you can reach out to the [Defense POW/MIA Accounting Agency](http://dpaa.mil/Resources/FAQs/) (Look at WHO IS ELIGIBLE TO DONATE MITOCHONDRIAL DNA?)",
                "Welcome home gentlemen. Rest in peace - your service shall not be forgotten.",
                "cant imagine theres many remains left to find after being at the bottom of the ocean for 80 years.  surely their bones would have been scattered by scavengers? i doubt the wreck was perfectly sealed",
                "Welcome home gentleman.    R.I.P.",
                "All of you did what was necessary and paid the ultimate price and sacrifice.  Thank you very much for your service and welcome home.  \n\nHope you and the loved one left behind are together again upstair.\n\nGod bless you all."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Duck Dynasty founding father Phil Robertson dies at 79",
            "external_url": "https://www.nbcnews.com/news/obituaries/duck-dynasty-founding-father-phil-robertson-dies-79-rcna209035",
            "upvotes": 10131,
            "date": "05/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250526-Phil-Robertson-DD-RS-408024.jpg",
            "top_comments": [
                "[deleted]",
                "What's crazy is he went to college and played QB and a very high level",
                "Goldnecks: rich people who like pretending they're just some country boys",
                "Claims to be Pro-Life, dies.",
                "“Two guys break into an atheist’s home, he has a little atheist wife and two little atheist daughters. Two guys break into his home, and tie him up in a chair and gag him. And then they take his two daughters in front of him and rape both of ‘em and then shoot ‘em. And they take his wife and decapitate her head off in front of him. And then they can look at him and say “Isn’t it great that I didn’t have to worry about being judged? Isn’t it great that there’s nothing wrong with this? There’s no right or wrong. Now is it, dude?” And then you take a sharp knife and take his manhood and hold it in front of him and say “Wouldn’t it be something if there was something wrong with this? But you’re the one who says there’s no god, there’s no right, there’s no wrong, so we’re just having fun! We’re sick in the head. Have a nice day.”\n\n-Phil Robertson\n\nYeah this is the thought process of a piece of garbage. Nothing was lost on this day. Good riddance, prick.",
                "The Hillbilly Kardashians",
                "Is that the super racist one?",
                "Wasn’t this the same dumbass that said we don’t need universal healthcare because he’s got eternal life through the blood of Jesus Christ?",
                "Hmmmm… a grifting father of a family of grifters no longer alive to grift. \n\nSo, what’s everyone doing for Memorial Day?",
                "He’s visiting Rush Limbaugh."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "11 hospitalized, including 2 kids, after boat explosion in Florida",
            "external_url": "https://www.nbcnews.com/news/us-news/11-hospitalized-2-kids-boat-explosion-florida-rcna209138",
            "upvotes": 253,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25527-florida-boat-explosion-rc1218a-1aa219.jpg",
            "top_comments": [
                "Antonio Rivero said he was with family members on the boat when it went up in flames.\n\n“Tried to fuel up the boat, and must have been a gas leak and, you know, spark went off and explosion,” Rivero said. “One of the guys' pants were blown off, so it was bad.”",
                "The greatest point in the whole story is the dog was rescued uninjured."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "2 dead, 9 hurt in mass shooting in Fairmount Park",
            "external_url": "https://www.nbcphiladelphia.com/news/local/fairmount-park-police-activity-shooting-memorial-day-philadelphia/4194340/",
            "upvotes": 359,
            "date": "05/27/2025",
            "thumbnail": "https://media.nbcphiladelphia.com/2025/05/Police-activity-shuts-down-Fairmount-Park-on-Memorial-Day-1.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "The sounds of summer are gunshots.",
                "Jesus fucking Christ man",
                "There are two types of mass shootings. This is the other one.",
                "Once upon a time in America. And the world shakes its head.",
                "Just another Tuesday in America.  Damn it.",
                "The US is pathetic, how many more ppl will die before we regulate firearms?",
                "_'No Way to Prevent This,'_ Says Only Nation Where This Regularly Happens",
                "Just another day in the USA.",
                "A normal day in the Fascist States of America! The President is a Felon and a convicted rapist!!",
                "Likely a stupid kid with a gun popping off over nonsense."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Former US Rep. Charles Rangel, who spent nearly 50 years representing New York, has died",
            "external_url": "https://apnews.com/article/charles-rangel-dies-9902b608e33aeb7db30478be00a77acc",
            "upvotes": 4854,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Rep Rangel fought with the 2d Division in the Battle of Chongchon, some of the most intense fighting during the Korean War. This was the battle in late November 1959 when the Chinese surprised the US military by entering into the war on North Korea’s side. Here is his interview on his experience: https://koreanwarlegacy.org/interviews/charles-rangel/\nRIP Rep Rangel.",
                "Rangel did a lot of work for the Harlem community, esp culturally in terms of the research library there, the arts, and Harlem history.",
                "For anyone who only knows about politics through The Daily Show and other comedy programming, you may recognize Rep. Charlie Rangel from [this photo.](https://vip.nypost.com/wp-content/uploads/sites/2/2014/06/rangel5.jpg)",
                "It's quite amazing that Harlem has only had three people represent them in Congress in 80 years. Rangel defeated Adam Clayton Powell, Jr. in 1970 who was a legend in the community but by the time the mid-60s came around, he had all but checked out of the job and was under investigation for misusing public money. And he was spending more time in his second home in Bimini than Washington or New York. And Rangel became a legend in his own right but probably stayed too long as well before finally retiring in 2017.",
                "No one reads the articles.",
                "Democrats are falling like flies lately. Quite unfortunate, RIP.",
                "https://youtu.be/a_GRMQ9H6IU?si=XyLCIaRvxWn-40-7",
                "He helped Nixon lead the war on drugs. \n\nhttps://www.northcountrypublicradio.org/news/story/22550/20130819/charles-rangel-america-s-front-line-general-in-the-drug-war",
                "RIP but a fifty year career politician? This is exactly the problem.",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Mary Lou Retton arrested for DUI",
            "external_url": "https://www.wdtv.com/2025/05/26/mary-lou-retton-arrested-dui-marion-county/",
            "upvotes": 6548,
            "date": "05/26/2025",
            "thumbnail": "https://gray-wdtv-prod.gtv-cdn.com/resizer/v2/LRXBURX27RGONAM34KNDBKXDQQ.jpg?auth=06dde6adb7b85990a69e4984ffdab2c6bbf8a9788c86af1cae05d7b26a2c2483&width=1200&height=600&smart=true",
            "top_comments": [
                "She blew a 6.0, but the Russian judge cut it down to 5.4.",
                "Thought she was dying in the hospital recently? Either way sucks don’t drink and drive.",
                "Fuck her. She campaigned AGAINST a bill calling for reform in gymnastics after the whole Nasser sexual assault scandal. Vile.",
                "She was leaving the Uneven Bar",
                "For anyone who doesn’t know who she is: [Mary Lou Retton](https://en.m.wikipedia.org/wiki/Mary_Lou_Retton)\n\nJudging from the current comments, her current reputation is sub-par to say the least.",
                "I guess her crowded funded half million from a few years ago won't cover an Uber.",
                "For those keeping track at home, we've got:  \n\\- Abuse apologizer / Larry Nassar supporter  \n\\- Anti-SafeSport Act  \n\\- Anti-universal healthcare (and subsequent leech of others' generosity to expense her medical bills due to being anti-Obamacare, all the while living in a mansion and having received $2 million in her divorce settlement only a few years prior)  \n\\- Face of reverse mortgage ads  \nAnd now,  \n\\- Selfish and dangerous driver with a DUI on her record\n\nQuite the fall from grace imho, really failed to stick the landing on her post-Olympic life.",
                "She cried about not having insurance when she was near death a few years back, but doesn’t vote for the party that would’ve helped her.\n\nAnd the  Nassar  stuff. F her",
                "That's a rough 57. Too bad. She was America's sweetheart. On the box of Wheaties and everything.",
                "She yelled at me once for blocking her view while I was covering an event as a photographer. Class act"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Sentencing hearing scheduled for Myrtle Beach Safari owner highlighted in ‘Tiger King’",
            "external_url": "https://www.wmbfnews.com/2025/05/26/sentencing-hearing-scheduled-myrtle-beach-safari-owner-highlighted-tiger-king/",
            "upvotes": 3405,
            "date": "05/26/2025",
            "thumbnail": "https://gray-wmbf-prod.gtv-cdn.com/resizer/v2/VQSOJZS435AF3NCVAUBXYVLD74.jpg?auth=956150d40cdfb7bd084074507ad21f87db4903f5f733efd55225dd3987999637&width=1200&height=600&smart=true",
            "top_comments": [
                "Just as big of a piece of shit as Joe, but with more intelligence.",
                "What stuck with me about this guy after watching Tiger King were the women he \"employed\". They had to be virginal or really close to it, young and willing to work seven days a week for the roof over their head. He's a disgusting piece of garbage and I hope he gets max sentencing.",
                "*The investigation also uncovered evidence of money laundering between Feb. and April 2022, when Antle and his co-conspirator conducted financial transactions with cash they believed was obtained from transporting and harboring undocumented immigrants.*\n\nWhat da hell",
                "He's got ~~Betty Davis~~ Methamphetamine Eyes.",
                "Who the fuck operates a “safari” in Myrtle fucking beach?!",
                "Is Carol Baskins the only main character that isn’t in jail?",
                "That guy was such an insufferable douche. That guy is gonna need both hands to pull his head out of his ass.",
                "Didn't he do tourist photos with heavily drugged tigers at his Myrtle Beach Safari?",
                "I watched that train wreck...I'll never get that time back.",
                "In the paraphrased words of L. Ron Hubbard, the real grift is in religion. You make up some mumbo jumbo and get some marks to believe it. Hubbard did set the standard though, if your money laundering sci-fi sex cult doesn't have a boat, are you even trying?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Duck Dynasty founding father Phil Robertson dies at 79",
            "external_url": "https://www.nbcnews.com/news/obituaries/duck-dynasty-founding-father-phil-robertson-dies-79-rcna209035",
            "upvotes": 10137,
            "date": "05/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250526-Phil-Robertson-DD-RS-408024.jpg",
            "top_comments": [
                "[deleted]",
                "What's crazy is he went to college and played QB and a very high level",
                "Goldnecks: rich people who like pretending they're just some country boys",
                "Claims to be Pro-Life, dies.",
                "“Two guys break into an atheist’s home, he has a little atheist wife and two little atheist daughters. Two guys break into his home, and tie him up in a chair and gag him. And then they take his two daughters in front of him and rape both of ‘em and then shoot ‘em. And they take his wife and decapitate her head off in front of him. And then they can look at him and say “Isn’t it great that I didn’t have to worry about being judged? Isn’t it great that there’s nothing wrong with this? There’s no right or wrong. Now is it, dude?” And then you take a sharp knife and take his manhood and hold it in front of him and say “Wouldn’t it be something if there was something wrong with this? But you’re the one who says there’s no god, there’s no right, there’s no wrong, so we’re just having fun! We’re sick in the head. Have a nice day.”\n\n-Phil Robertson\n\nYeah this is the thought process of a piece of garbage. Nothing was lost on this day. Good riddance, prick.",
                "The Hillbilly Kardashians",
                "Is that the super racist one?",
                "Wasn’t this the same dumbass that said we don’t need universal healthcare because he’s got eternal life through the blood of Jesus Christ?",
                "Hmmmm… a grifting father of a family of grifters no longer alive to grift. \n\nSo, what’s everyone doing for Memorial Day?",
                "He’s visiting Rush Limbaugh."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Police responding to incident at Liverpool FC parade after reports of car collision with pedestrians | UK News",
            "external_url": "https://news.sky.com/story/police-responding-to-incident-at-liverpool-fc-parade-after-reports-of-car-collision-with-pedestrians-13374978",
            "upvotes": 1556,
            "date": "05/26/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-liverpool-car-crash_6928124.jpg?20250526194011",
            "top_comments": [
                "[removed]",
                "In case anybody was unsure: \"closed the damned streets with car-proof barriers\"\n\nMy God how does this keep happening.",
                "53 year old white male\nhttps://news.sky.com/story/police-responding-to-incident-at-liverpool-fc-parade-after-reports-of-car-collision-with-pedestrians-13374978",
                "That's got to be a police fail. Yes, the guy lost it, but how he was allowed to get his car into that area is inexcusable. \n\nIt is then a series of panicked decisions (just get out of the car and give it up, it'll be fine) followed by utter psychosis, literally deliberately driving into people. \n\nIt is GBH and possibly attempted murder BTW, fucking idiot.",
                "First one I’ve experienced where I had family at the event. They’re fine, thank god. No where near it. \n\nFirst one, but at this rate, probably not the last. We all responded so immediately and calmly with calls to make sure everyone was fine? Like it was drilled? Fuck.",
                "Think we should be careful about speculation. Especially in the wake of what happened following the Southport killings.",
                "It looked like Road Rage to me. The guy just lost the plot",
                "The bastard is lucky the crowd didn’t tear them limb from limb. Definitely deliberate. ",
                "Looks like the cops were protecting the perpetrator from the crowd after he plowed into them. Seems like they would of dragged his ass out and put the boots to him.",
                "How did that car even get there "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Deputies fatally shoot Florida man who survived apparent gator attack and tried to steal their gun, sheriff says",
            "external_url": "https://www.nbcnews.com/news/us-news/deputies-fatally-shoot-florida-man-gator-attack-tried-steal-gun-rcna209128",
            "upvotes": 121,
            "date": "05/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/25526-florida-fatal-police-shooting-gator-attack-rc-925p-b8907f.jpg",
            "top_comments": [
                "It’s like they used a “Florida man” random headline generator",
                "booked and released for meth charges a week ago (⊙\\_⊙;) might explain his behavior",
                "Two deputies, including a trainee, opened fire on Timothy Schulz, 42, after they deployed a stun gun that appeared to have no effect and after Schulz tried to remove a firearm from their patrol cruiser, Polk County Sheriff Grady Judd told reporters.",
                "I thought gta6 was still a year away",
                "Are they still using bath salts in Florida?",
                "I see they're already working on the first GTA 6 expansion",
                "id like to see the dashcam/bodycam footage on that please. .. gator attacks man, man survives only to be killed later by cops? sounds fishy",
                "Trump is looking at a pardon prior to capture, checking to see if social media comments were pro tangerine."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "WWII bomber crash left 11 dead and ‘non-recoverable.’ 4 are finally coming home",
            "external_url": "https://apnews.com/article/american-bomber-wwii-remains-divers-212ba07efdab40941f09026c79fdb5c0",
            "upvotes": 1742,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Sheppick, 26, and Tennyson, 24, each left behind pregnant wives who would sometimes write them two or three letters a day. Darrigan, 26, also was married, and had been able to attend his son’s baptism while on leave. A photo shows him in uniform, smiling as he holds the boy.\n\n>Darrigan’s wife, Florence, remarried but quietly held on to photos of her late husband, as well as a telegram informing her of his death.\n\n>Tennyson’s wife, Jean, lived until age 96 and never remarried.\n\n>“She never stopped believing that he was going to come home,” said her grandson, Scott Jefferson.\n\nSo rough on the families too. Glad they were able to help bring closure for some of them.",
                "From the title I thought another restored aircraft went down.",
                "Their bomber was called *'Heaven Can Wait'*. Thank you gentlemen. Youe wait is over.",
                "If anyone has American ancestors who were MIA in WW1, WW2, Korea, Vietnam, the Gulf Wars, or anytime during the Cold War that are unidentified, you can reach out to the [Defense POW/MIA Accounting Agency](http://dpaa.mil/Resources/FAQs/) (Look at WHO IS ELIGIBLE TO DONATE MITOCHONDRIAL DNA?)",
                "Welcome home gentlemen. Rest in peace - your service shall not be forgotten.",
                "cant imagine theres many remains left to find after being at the bottom of the ocean for 80 years.  surely their bones would have been scattered by scavengers? i doubt the wreck was perfectly sealed",
                "Welcome home gentleman.    R.I.P.",
                "All of you did what was necessary and paid the ultimate price and sacrifice.  Thank you very much for your service and welcome home.  \n\nHope you and the loved one left behind are together again upstair.\n\nGod bless you all."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Ex-police chief escapes from Arkansas prison where he was serving murder, rape sentences",
            "external_url": "https://www.cbsnews.com/news/grant-hardin-arkansas-prison-escape/",
            "upvotes": 7988,
            "date": "05/26/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/26/c4e4b220-3f6d-437e-87ce-45f405a660b9/thumbnail/1200x630/0dae33da6db213d4a59f739177cb86f5/screenshot-2025-05-25-at-9-50-46-pm.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                ">[KFSM reported in 2019](https://www.5newsonline.com/article/news/local/outreach/back-to-school/former-police-chief-convicted-murderer-pleads-guilty-to-raping-rogers-teacher-in-1997/527-accc272d-e94b-4c00-b9cb-6a4ee5e42125) that police in 2003 used DNA samples from the rape victim's clothes to apply for a \"John Doe\" warrant since the statute of limitations was close to expiring. Investigators eventually got a match after Hardin was imprisoned for Appleton's killing.\n\nMurders someone, then his DNA sample during processing matches a rape case.\n\nWinning through and through.",
                "Hardin pleaded guilty in October 2017 to first-degree murder in connection with the shooting death of 59-year-old James Appleton. According to an affidavit filed in the case, Appleton worked for the Gateway water department and was talking to his brother-in-law, then-Gateway Mayor Andrew Tillman, when he was shot in the head on Feb. 23, 2017, near Garfield. Police found Appleton's body inside a car.",
                "“Ex-police chief, who escaped from prison for rape and murder sentences, is found as the new police chief a town in a neighboring state”",
                "Totally “accidentally”",
                "What's with all the prison breaks that have been happening lately? Have there actually been more of them, or is the news just reporting on them because they're trending? Or is the *Prison Break* reboot going hard with its marketing?",
                "I bet he had inside help.",
                "Wouldn't he have been out of genpop for being a former cop anyway? How he escaped has to either be a serious fuck up or extremely daring.",
                "he likely just knew the layout and knew exactly what was needed to go with no fuss. \n\ni worked in a psych ward for a few years and realize im not exempt to being subjected to a place like this if i decided on a whim that i was done. if i had landed in the facility i worked i'd probably beg them not to take me to this particular place, mostly out of embarrassment, specifically telling them that i know the entire layout and how to get out if i needed to. this highlights the flaw in the system. if i told them this en route, they wouldnt care. its not their problem. the intake department might have some concerns, but the facility manager would likely pass it off as some random manic episode. they certainly wouldnt check records, because the paycheck of holding someone is the single most important factor for them.\n\ni left that job btw, because someone on another unit successfully committed suicide on their watch. this is literally the most important part of our job, but they wanted to cut corners, and go against doctors orders to save a few dollars. the only positive takeaway i have from the entire situation that it wasnt my unit. i only heard things. never interacted with the individual myself...",
                "So according to sources:\n\n\"[Hardin worked for at least four separate law enforcement departments in Northwest Arkansas before the murder he is serving prison time for.](https://www.4029tv.com/article/rape-suspect-worked-for-four-local-police-departments/18154261) He was also elected constable for Benton County Township One.\"\n\nAs often as this guy was moved along, police departments had to know this guy was a problem, and yet still he kept getting hired!\n\nThen again..nothing should surprise me these days...after all America voted a convicted felon into the WH!",
                "Gonna end up dead soon."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/27/2025 08:12:47 UTC"
}