{
    "posts": [
        {
            "category": "HOT",
            "title": "Pentagon webpage for Black Medal of Honor winner restored after outcry",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/defense-department-black-medal-honor-webpage-restored",
            "upvotes": 43578,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "But Navajo code talkers are gone, among other major subjects",
                "Good, fuck whichever idiot removed it in the first damn place.",
                "Now tell us why the link was changed to include \"dei\" in the URL.",
                "So, what was the message here sent to every US soldier? \n\nA: \"Honor is temporary.\"\n\nB: \"We ain't loyal.\"\n\nC: \"Y'all ain't worth the boots we gave you.\"",
                "I'm a pacifist, and I'm not impressed by the military in general, but even I am moved by a Medal of Honor recipient. It's not handed out for no reason, and certainly not as a participation award, or \"DEI\" as this man's page was labeled.\n\nI read his wikipedia entry, and he basically rallied and coordinated a position that was under siege and went through what sounds like around 14 hours of chaos and hell, was injured 3 times, refused to stop for medical treatment, and managed to defeat the enemy.\n\nHe signed up to put his life on the line, did so, saved the lives of others, and never gave up. He's a quintessential hero. The people who pushed for his erasure could never dream of being half the man that Charles C. Rogers was.",
                "Auto removal, my arse. If that's the case, they would have restored his status almost instantly when it was figured out.\n\nEdit: some commenters added that they did restore the original status relatively quickly.",
                "UPDATE to yesterday's post, it's back online after some \"online fury\". See DoD explanation below:\n\n>In a statement Monday that did not elaborate, a defense department spokesperson told the Guardian: “The department has restored the Medal of Honor story about army Maj Gen Charles Calvin Rogers … The story was removed during auto removal process.”",
                "We Germans know a thing or two about 'auto removal'—it was called Nazism and racism.",
                "This is great news, but this shit is happening ALL OVER the federal government and has been for last 8 weeks.  Women and people of color are being erased from history - from museums, web pages, and official documents.  Getting one instance restored due to public outcry is fantastic, but there are thousands of other instances of this.  The outcry needs to be for this entire targeted attack against minorities of all types. U.S. history is being whitewashed in real time and we're watching it happen.",
                "Let’s get government employees their jobs back now."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Pride group founder raped boy, 12, he met on Grindr",
            "external_url": "https://www.bbc.com/news/articles/cx28yj34zgpo.amp",
            "upvotes": 3707,
            "date": "03/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2dee/live/acb4cce0-0027-11f0-a94c-6986d2348378.png",
            "top_comments": [
                "I don't care who they are affiliated with; pride org, Catholic church, government, or the BBC itself; anyone harming a child like this deserves as much time as it's legal to give them. This is a lifetime of therapy for this poor kid.",
                "Yeah affiliation doesn’t matter. Don’t rape children.",
                "I hope he and his partner get the maximum punishment. See how easy it is to not support sexual predators, MAGA?",
                "Piece of shit exists, more at 10.\n\nIf he was protected by his community despite it being obvious he was a piece of shit, then fuck that community.",
                "Why was a 12 year old on Grindr in the first place?\n\nAnd who chats with a 12 year old on Grindr?",
                "[removed]"
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "HOT",
            "title": "PepsiCo buys prebiotic soda brand Poppi to gain a foothold in functional drinks",
            "external_url": "https://apnews.com/article/pepsico-poppi-prebiotic-soda-f1fdb1103b5d8ad6a9e6d8c37e5ab713",
            "upvotes": 6922,
            "date": "03/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I will never forgive Pepsi for killing SoBe!",
                "*Allison Ellsworth, the co-founder of Austin, Texas-based Poppi, said the combination with PepsiCo will expand Poppi’s reach.*\n\nOh it will expand its reach alright, but sooner rather than later, its ingredients will need to change to meet the \"demands\" of the larger market as in more sugar and less vinegar.",
                "Functional drink? Poppi? The ones who had to remove all health branding from their products and had to settle a class action suit because their products didn’t actually do anything?",
                "Are they going to rename it Popsi?",
                "Guess I’ll stop drinking that now, thanks",
                "\"Functional Drink\" holy shit that's some corpo speak",
                "This is the life of almost all non-alcoholic beverages. Start up the company, gain investors, work your balls off for a couple years and rack up debt in advertising and retail agreements to establish the brand with the overall goal to sell to Pepsi or Coke and cash out and go home. For some companies like Poppi, it works. For others like BioSteel who can’t find a buyer, they inevitably go bankrupt.",
                "Functional drinks? What?\n\nIt's just overpriced meh flavored soda..\n\n\nSomeone just got the bag.",
                "Big corporations buying up smaller companies. Capitalism at it's finest.",
                "let the enshittification begin"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Last Surviving Pilot of Battle of Britain Passes at 105",
            "external_url": "https://www.bbc.com/news/articles/cvg1z42pkj8o",
            "upvotes": 2639,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8ab7/live/1852cac0-0388-11f0-bee4-a1264feab608.jpg",
            "top_comments": [
                "I knew these days would come eventually, when that War passes from living memory, it's still hard to see it arrive. Its our duty as part of the younger generations to not forget their sacrifices and work to preserve the great peace that it brought.",
                ">Never has so much been owed by so many to so few.\n\n \\- Winston Churchill",
                "Ireland maintained neutrality during WWII, but quite a few Irishmen fought with the British. 'Paddy' Hemingway was one who joined the RAF.",
                "In related news, fascism is coming back now that all the dudes who fought against it are dead.",
                "Most of these pilots were teenagers. I can see the spark is still in his eyes. Rest In Peace, Sir.",
                "I'm glad he got so many years of peace after.",
                "Rip to the brave men and women who made victory and peace possible",
                "Thank you.\nYou will live on in my heart and head forever",
                "RIP, sir. Thank you for your service.",
                "Those pilots were the most badass groups of people to ever live prove me wrong"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "Trump revokes secret service protection for Biden's children Hunter and Ashley",
            "external_url": "https://www.reuters.com/world/us/trump-revokes-secret-service-protection-bidens-children-hunter-ashley-2025-03-17/",
            "upvotes": 2496,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">In the days before he left office, President Donald Trump instructed that his family get the best security available in the world for the next six months, at no cost — the protection of the U.S. Secret Service.\n\n>According to three people briefed on the plan, Trump issued a directive to extend post-presidency Secret Service protection to his four adult children and two of their spouses, who were not automatically entitled to receive it.\n\nhttps://www.washingtonpost.com/politics/trump-extended-secret-service-protection-for-13-members-of-his-family-as-he-left-office/2021/01/20/31ef3e9e-5b3c-11eb-b8bd-ee36b1cd18bf_story.html",
                "Imagine if Biden had revoked the secret service protection of Trump before his speech in PA.\n\nTrump is the most vindictive person you will ever see in your life.",
                "> Trump's announcement came hours after a reporter asked Trump about Hunter Biden's Secret Service detail. The president said he had not been aware of it but would look into it.\n\nThis was obviously a top priority issue, he heard the word \"Biden\" and immediately jumped to do something about that.\n\nNow, how about the six months of protection that Ivanka received after Trump left office: https://www.mercurynews.com/2021/09/17/ivanka-trumps-vacations-cost-secret-service-347000-after-dad-left-office/",
                "I've never seen a more insecure man as Trump. Men who are insecure are typically hurtful and petty. They think it makes them look powerful when they hurt others. What men like Trump don't understand is that if you are confident and strong, you don't have to lash out, because you're better than that... above that. He is not.",
                "I hope trump gets exactly what he deserves. You piss enough people off, better watch your back.",
                "Literally every single peice of news that comes out about Trump, he’s doing the polar opposite of the right thing. It’s fucking WILD people support such a deeply troubled human being.",
                "Meanwhile, a billionaire is using air force one to fly his family around",
                "I think people are missing the truly evil part here....making this public is also a call to the magas out there.  Same as his call to them which caused J6.  Something horrible is going to happen.",
                "Remember how big a deal maga made of RFK not having SS protection for a time? I sure do.",
                "Trump and MAGA have spent a long time making Hunter into a bogeyman. Hunter’s going to need some security."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "HOT",
            "title": "Forever 21 files for bankruptcy again, plans to close all US stores",
            "external_url": "https://www.denver7.com/business/company-news/forever-21-files-for-bankruptcy-again-plans-to-close-all-us-stores",
            "upvotes": 13877,
            "date": "03/17/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/5071f19/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F7b%2Fb6%2F2d90f847436d8f13ff42e436582e%2Fshutterstock-2156779941.jpg",
            "top_comments": [
                "Owned by Authentic Brands, who would be quite glad once it's shuttered for good. They'll just make cheap clothes with the Forever 21 label and sell it to other stores. \n\nThey also bought and shuttered Sports Illustrated just so they'd have the naming rights for Sports Illustrated  merchandise. \n\nThey also own a large part of JCPenney whom they force to buy all the Authentic Brands licensed merchandise and clothing.\n\nThat's all they do they buy naming rights to shuttered brands (air walk shoes) then license it to people or force their other children companies to buy it from themselves.",
                "How many times has this company filed for bankruptcy?",
                "[removed]",
                "“I don’t know about you, but I’m feeling 22!”",
                "\"Add another one to the pile,\" he said from inside a Big Lots store.",
                "Not so forever anymore.",
                "I have never gone into a Forever21 and not found it to be a mess, half stocked, with like 1 employee. So I guess the writing was on the wall for a while.",
                "Oh nooooo. The mall SHEIN is gonna be gone! 😱",
                "JCPenney store section, here they come.\n\nThese are two-story layouts in most malls. It's gonna take a lot of escape rooms, arcade, and mini golf to fill this spot.\n\nMaybe Spirit of Halloween will get bold and start renting out mall space each year.",
                "A business that depends on importing clothing during Trump tariffs is doomed."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Harvard offers free tuition to families earning less than $200,000",
            "external_url": "https://www.bbc.com/news/articles/cm2d5jllx60o",
            "upvotes": 8334,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3687/live/03c20590-0341-11f0-bd89-c3fdf6bb272d.jpg",
            "top_comments": [
                "“So you’re telling me there's a chance...\"",
                "So like...most of the population?",
                "This isn't a new thing. If you get into Harvard and can prove you can't afford it, you basically get a free ride. The problem is it's insanely hard to get into Harvard and the kids that have the advantage of money, top tier education, and connections have a huge advantage.",
                "In before “Federal judge halts”",
                "For those who may not be aware, you still have to be ACCEPTED into Harvard, which is insanely difficult to do. This just means that if you are accepted, you may not have to pay if your family isn’t already wealthy. Honestly, this is better for everyone as it means that we’re not just furthering the education of the same wealthy families and now are spreading the knowledge into the general population.",
                "This is really anything new, most of the top Ivys have something in place like this where families below a certain income get free tuition.\n\nHarvard was actually dragging their feet I believe their previous policy was like below 90k, while other places like Stanford were doing below 150k.",
                "Good luck getting accepted.",
                "For the 15% of places that aren't legacy. Still, well done them!    \n   \nHarvard is a hedge fund with a charitable education charity on the side.",
                "Now that millennials are crushed with debt universities are offering free tuition.... Good for the next generation.",
                "How does a family making $200k afford a child going to Harvard?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Israel hits Gaza with 'extensive strikes,' killing dozens and ending ceasefire",
            "external_url": "https://abcnews.go.com/International/israel-conducts-extensive-strikes-gaza-strip-idf/story?id=119894645",
            "upvotes": 1318,
            "date": "03/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0eaea812-3f95-4369-ac05-bbce265f5bc1/gaza-1-rt-er-250325_1740503280078_hpMain_2_16x9.jpg?w=1600",
            "top_comments": [
                "Daily reminder that Israel has socialized medicine using American tax dollars, yet we in America do not.",
                "\"Tonight we returned to fighting in Gaza due to Hamas' refusal to release the hostages and threats to harm IDF soldiers and Israeli communities,\" Katz said in a statement. \"If Hamas does not release all the hostages, the gates of hell will open in Gaza,\" he added.",
                "Remember when Republicans cried out that we should be funding our problems at home and not foreign countries? Does that apply to Israel's genocide as well? How is Medicaid, Social Security, libraries, education, etc,. a waste, but the billions and billions worth of resources and equipment we gleefully give over to Israel so they can murder Palestinian children and infants aren't a waste?",
                "Ugh. This shit is never going to end, is it",
                "Let’s see… sounds like Israel is refusing to cooperate towards peace like Ukraine… So this means no more aide or intelligence sharing for Israel, right? 🙄",
                "\"It's actually antisemitism to believe that any Palestinians should be alive at all.\"--the ADL and AIPAC",
                "Israel broke the ceasefire.",
                "Israel is a genocidal apartheid state. The sooner we all realize this the better.",
                "There was never a ceasefire because Israel kept violating it",
                "So I guess trump didn't mention he'd be OK with this restarting . Just another lie from his campaigning"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Texas AG announces arrest of woman for allegedly illegally providing abortions in Houston",
            "external_url": "https://abcnews.go.com/US/texas-ag-announces-arrest-woman-allegedly-illegally-providing/story?id=119888542",
            "upvotes": 3160,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/553b1cdc-8add-461f-80d4-06fd20cfbc75/paxton-gty-er-250317_1742242201847_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I can't wait to hear all the details from someone other than Ken Paxton.",
                "> Abortions are banned in Texas except if the woman has a life-threatening condition or is at risk of \"substantial impairment of a major bodily function.\"\nPatients are required to make two trips, one for an in-person counseling session and then 24 hours later for the abortion, according to the Guttmacher Institute, a research group that focuses on sexual and reproductive health.\n\n\n\n\n\nNothing says amazing life saving treatment in emergency situations like giving a minimum of 24 hours to wait. ",
                "IIRC, to get a legal abortion in Texas the doctor is arrested and then must prove to the jury that it was medically necessary. You can't prove to a court and then have the court order an abortion. This was attempted early on and this AG said he would ignore any court and arrest the doctor anyway because this was the procedure. There isn't some standard to be met where a woman's life is sufficiently at risk or the fetus is nonviable. Doctor gets arrested and argues in a court of law to a jury that it was medically necessary. Remember that when one of those pro-birth anti-women people try to tell you it's a doctor's fault when a woman dies because she couldn't get an abortion.",
                "*\"In Texas, life is sacred,\" Paxton said in a statement. \"I will always do everything in my power to protect the unborn, defend our state's pro-life laws, and work to ensure that unlicensed individuals endangering the lives of women by performing illegal abortions are fully prosecuted.\"*\n\nTexas leads the country every year in executions. And this \"unlicensed individual\" is a woman helping other women, who have been denied abortion in Texas.",
                "Wow, it’s like we are moving back in time 100 years …….the Republican Party is insane ….",
                "Offhand, it looks like a \"midwife\" of questionable credentials practicing medicine without a license in a back alley clinic. \n\nIf you make abortion illegal, abortion doesn't go away, it just goes underground.",
                "[from another article:](https://www.texastribune.org/2025/03/17/texas-abortion-midwife-arrested/)\n\n\n>Holly Shearman, a midwife who runs Tomball Birth Center, where Rojas worked part-time providing prenatal care, said she was “shocked” by the news of her arrest. She described Rojas as a devout Catholic and skilled midwife whose clinics provided health care to a primarily Spanish-speaking, low-income community.\n\n\nWill be interested to see what they consider \"practicing medicine.\"",
                "Why do all high-ranking Republicans lately look like the villain in an 80s action movie?",
                ">\"In Texas, life is sacred,\" Paxton said in a statement.\n\nIs that supposed to be a joke?  Unless the kids are dying of measles or getting shot in school, right?\n\nAh, is there even a point pointing out the hypocrisy anymore?  I wish they'd just say they want to control women and save us all the hassle of that dog & pony show.",
                "If life is sacred how about doing something to help the actually alive children?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "White House denies defying judge's order over deportations to El Salvador",
            "external_url": "https://www.bbc.co.uk/news/articles/cr5219ezjrpo",
            "upvotes": 24341,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bfbd/live/8481df30-0331-11f0-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "Alternative facts. Their own DOJ memo indicated that they were aware that they were violating the judges orders.",
                "\"The [court] order, which had no lawful basis,...\" - WH Press Secretary\n\nThey're openly trying to suggest that federal courts have no legal basis to adjudicate. This is insane.",
                "So we’re there. “Let them enforce it” is now reality.",
                "It’s pretty clear he doesn’t listen to the courts anymore. He also had a Lebanese medical doctor / professor with a valid visa deported for no apparent reason, against a judge’s explicit order: https://www.cnn.com/2025/03/17/us/brown-university-doctor-deported-hnk/index.html",
                "Even if they acknowledge defying the judges orders, what are we expecting the judges/judicial system to do to him? He never has to deal with any consequences of doing illegal things, no one is going to start imposing consequences on him now at this level. I don't think the government is equipped to deal with a president who just straight up defies laws.",
                "The most dangerous people to our country (world?) are the current administration.\n\nThe call is coming from inside the WH, and it doesn't appear that anyone plans on stopping them. \n\nDeflection and projection is their game.",
                "So if I'm understanding this entire situation correctly, the Trump Administration initiated an 18th century Act, corralled a bunch of alleged \"gang members\" (I'm putting this in quotes because literally nobody even verified they really were gang members, but that's not the point here), violated their due process (this is the point here!), loaded them on a plane WHILE this situation was being reviewed by a judge, let that plane take off while this situation was being ruled on by a judge, then claimed \"Oops, well the plane already left before the ruling so therefore it doesn't count AND we didn't defy a court order!\"?\n\nAnd we are supposed to believe this wasn't done maliciously? They knew the judge was ruling on this situation. They knew they could have had the plane wait until the ruling came down to have it deport these people IF it was legal. They knew what they were doing was illegal anyways. **They still did it**.\n\nLet me also be clear, this is not about gang members. If these people truly were members of a Venezuelan gang, then go through due process AND THEN deport them. Same result. This is about pushing our due process to it's limits to see what you can get away with, then justifying it with \"Oh well it was gang members, you don't want gang members here DO YOU?\", and the entire point is \"How do WE know they were gang members if you rounded them up and deported them without any due process?\".\n\nTHAT'S THE ENTIRE POINT. This is how they're allowed to make people disappear, because they are violating your rights and using the cover of \"it's gang members!\" to do it, just like previous administrations did with \"Oh they're terrorists!\".",
                "Ah we're at the we didn't do that stage, soon to be at the we did it but they deserved it stage...",
                "This isn't deporting people to El Salvador. This is imprisoning people in El Salvador. No crimes, no charges, no sentences. They could be there for the rest of their lives, as long as they might be living in a place like that. And no legal way to get them out.\n\nWe're going to see stories of this of US protesters, journalists and others being carted off to these prisons.",
                "They'd probably have a better case to make if our dipshit Secretary of State wasn't laughing about it on Twitter"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Gaza ceasefire shattered as Israel carries out wave of deadly strikes",
            "external_url": "https://www.cnn.com/world/live-news/gaza-israel-hamas-strikes-03-18-25/index.html",
            "upvotes": 133,
            "date": "03/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2024-09-13t202739z-1743600386-rc2qz9az5m1k-rtrmadp-3-israel-palestinians-gaza.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Well thank god we Americans elected the pro peace candidate last November!",
                "And this round is going to be worse with Trump cheering to turn Gaza into a resort. At least Biden was advocating and organizing increased aid while sanctioning Israeli West Bank settlers (Sanctions that Trump overturned on his first day in office). The entire ceasefire was negotiated for months under Biden's presidency. \n\nCongratulations to anti-Biden \"\"\"Pro\"\"\"-Palestine protesters for helping elect the one objectively worse for Palestine.",
                "Hamas was trying to use the hostages as leverage to secure a favorable resolution of the conflict. Their goal was to remain in control of Gaza, rearm and attack Israel again. Given their position in the negotiations, Hamas gave Israel no alternative but to resume the war.",
                "Hamas wasn't holding up their end of the agreement to return hostages.  \n\nIn reality I don't think Hamas knows where many hostages are because many were taken by \"non combatants\"",
                "I’m completely and utterly…not shocked. If you thought the conflict was bloody before get ready cause Gaza is about to become one of the world’s largest graveyards. \n\nGood job protest voters, I hope it was worth it.",
                "[deleted]",
                "Them Palestinian student protesters getting deported that withheld their vote, love when leopards eat that face.\n\nDemocrats aren’t a “big tent party” it’s a weak coalition of people who don’t like each other, and would rather turn responsibility over to literal wannabe Christian tech bro fascist and/or racists. \n\nWe’re too lazy to fight for liberty. Give me Netflix and Amazon or give me death is our new motto."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Gaza truce shatters as Israel carries out ‘extensive’ strikes and Netanyahu vows to hit Hamas with ‘increasing strength’",
            "external_url": "https://edition.cnn.com/2025/03/17/middleeast/israel-strikes-gaza-hamas-ceasefire-intl-hnk/index.html",
            "upvotes": 136,
            "date": "03/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21466596-1282110-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "When there are no consequences for breaking a truce, agreeing to one seems to be pretty much pointless.",
                "and suprising no one. its the israeli government that broke the deal.",
                "The Gaza truce didn’t just “shatter”\n\nIsrael broke the ceasefire.",
                "\"Never Again\" comes with an asterisk, apparently.",
                "Silence in the face of a genocide, becomes complicity under the light of justice.",
                "r/worldnews would be in shambles if every mention of this wasn't deleted",
                "Will God's chosen be watching from the riverside eating meals and enjoying wine?",
                "No better than the terrorists they claim to be bombing",
                "after Hamas refused to release hostages, why are people kept cutting off the important part(s) from news in an attempt to think for the readers?",
                "All Reddit posts on this conveniently leaving out the fact that Hamas has not held up their end of the truce, meaning that once again, THEY are the ones who broke the agreement.\n\nWhat a bunch of terrorist sympathizers."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Israel attacks targets in Gaza as ceasefire deadlock breaks",
            "external_url": "https://www.reuters.com/world/middle-east/israeli-military-conducts-strikes-hamas-targets-gaza-army-says-2025-03-18/",
            "upvotes": 83,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That ceasefire just spontaneously broke all by itself, did it, Reuters?",
                "Passive headline. Should be:\n\n\nIsrael breaks ceasefire with attacks on Gaza.",
                "“Israel breaks ceasefire in Gaza, resuming their genocidal campaign”",
                "When will this end ????????? I hate war ….",
                "If I believed in evil Israel would be it.",
                "No ceasefire without returning hostages!",
                "So Americans that have been paying attention to the DOJ and Trump administration rhetoric regarding a certain country just have to sit these threads out?? \"Free Speech\" baby!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Israel hits Gaza with 'extensive strikes,' killing dozens and ending ceasefire",
            "external_url": "https://abcnews.go.com/International/israel-conducts-extensive-strikes-gaza-strip-idf/story?id=119894645",
            "upvotes": 1322,
            "date": "03/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0eaea812-3f95-4369-ac05-bbce265f5bc1/gaza-1-rt-er-250325_1740503280078_hpMain_2_16x9.jpg?w=1600",
            "top_comments": [
                "Daily reminder that Israel has socialized medicine using American tax dollars, yet we in America do not.",
                "\"Tonight we returned to fighting in Gaza due to Hamas' refusal to release the hostages and threats to harm IDF soldiers and Israeli communities,\" Katz said in a statement. \"If Hamas does not release all the hostages, the gates of hell will open in Gaza,\" he added.",
                "Remember when Republicans cried out that we should be funding our problems at home and not foreign countries? Does that apply to Israel's genocide as well? How is Medicaid, Social Security, libraries, education, etc,. a waste, but the billions and billions worth of resources and equipment we gleefully give over to Israel so they can murder Palestinian children and infants aren't a waste?",
                "Ugh. This shit is never going to end, is it",
                "Let’s see… sounds like Israel is refusing to cooperate towards peace like Ukraine… So this means no more aide or intelligence sharing for Israel, right? 🙄",
                "\"It's actually antisemitism to believe that any Palestinians should be alive at all.\"--the ADL and AIPAC",
                "Israel broke the ceasefire.",
                "Israel is a genocidal apartheid state. The sooner we all realize this the better.",
                "There was never a ceasefire because Israel kept violating it",
                "So I guess trump didn't mention he'd be OK with this restarting . Just another lie from his campaigning"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Trump revokes secret service protection for Biden's children Hunter and Ashley",
            "external_url": "https://www.reuters.com/world/us/trump-revokes-secret-service-protection-bidens-children-hunter-ashley-2025-03-17/",
            "upvotes": 2493,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">In the days before he left office, President Donald Trump instructed that his family get the best security available in the world for the next six months, at no cost — the protection of the U.S. Secret Service.\n\n>According to three people briefed on the plan, Trump issued a directive to extend post-presidency Secret Service protection to his four adult children and two of their spouses, who were not automatically entitled to receive it.\n\nhttps://www.washingtonpost.com/politics/trump-extended-secret-service-protection-for-13-members-of-his-family-as-he-left-office/2021/01/20/31ef3e9e-5b3c-11eb-b8bd-ee36b1cd18bf_story.html",
                "Imagine if Biden had revoked the secret service protection of Trump before his speech in PA.\n\nTrump is the most vindictive person you will ever see in your life.",
                "> Trump's announcement came hours after a reporter asked Trump about Hunter Biden's Secret Service detail. The president said he had not been aware of it but would look into it.\n\nThis was obviously a top priority issue, he heard the word \"Biden\" and immediately jumped to do something about that.\n\nNow, how about the six months of protection that Ivanka received after Trump left office: https://www.mercurynews.com/2021/09/17/ivanka-trumps-vacations-cost-secret-service-347000-after-dad-left-office/",
                "I've never seen a more insecure man as Trump. Men who are insecure are typically hurtful and petty. They think it makes them look powerful when they hurt others. What men like Trump don't understand is that if you are confident and strong, you don't have to lash out, because you're better than that... above that. He is not.",
                "I hope trump gets exactly what he deserves. You piss enough people off, better watch your back.",
                "Literally every single peice of news that comes out about Trump, he’s doing the polar opposite of the right thing. It’s fucking WILD people support such a deeply troubled human being.",
                "Meanwhile, a billionaire is using air force one to fly his family around",
                "I think people are missing the truly evil part here....making this public is also a call to the magas out there.  Same as his call to them which caused J6.  Something horrible is going to happen.",
                "Remember how big a deal maga made of RFK not having SS protection for a time? I sure do.",
                "Trump and MAGA have spent a long time making Hunter into a bogeyman. Hunter’s going to need some security."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Peru declares emergency as crime wave grips capital, singer shot dead | Reuters",
            "external_url": "https://www.reuters.com/world/americas/peru-declares-emergency-capital-tackle-crime-wave-2025-03-17/",
            "upvotes": 103,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This might explain why prices on trips to Peru just dropped dramatically."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Navajo Code Talkers disappear from military websites after Trump DEI order",
            "external_url": "https://www.axios.com/local/salt-lake-city/2025/03/17/navajo-code-talkers-trump-dei-military-websites-wwii",
            "upvotes": 1503,
            "date": "03/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is it me or is this the most insecure shit you’ve ever seen?",
                "Isn't this the same party that cries about \"erasing history\" when a community tries to remove Confederate monuments?",
                "What a colossal waste of time and tax payer's money Hegseth\n\nYou know we're going to put it all back when you're gone you dickhead",
                "https://en.m.wikipedia.org/wiki/Choctaw_code_talkers\n\nI'm the great grandson of Solomon Bond Louis\n\nMy family has always served in some unit of the military until my generation where they sat us down and warned us in 2002 that things have changed. Considering most are Vietnam vets in the Marines it made sense. Also my dad constantly reminded me as a kid that if his CO hadn't give him the leave to get married to my mom who also served(higher rank as well) he would of been in Beirut when it was bombed. \n\nAll I can say is this is fucking crazy, I'm genuinely lost for words at this point",
                "My grandfather was a lifelong Republican who spent decades working in the Bureau of Indian Affairs and Bureau of Land Management, serving many Navajo communities and other tribes in the Southwest US, continuing to field calls well after his retirement. Here they are undermining his life's work, the communities he and these agencies served, and utterly besmirching one of the most important, selfless, and **undeserving** contributions to our country by a community of its people.\n\nLike many people, I felt pretty hollow after the election, and for my own sanity decided to step back from political efforts. \"Americans voted for this, let them reap what they sow.\" I cannot in good conscience, maintaining civility and patience, just watch our country steer into a landslide intent on corrupting and twisting what we built. It is controversial, problematic, but nonetheless hard-earned history that we built together.\n\nI choose to resist in any way I can, so that my children may have a future and that the legacy of people who chose to serve our country will cease its diminishment and thrive. I hope you join me in the protests and whatever else is to come.",
                "Whitewashing of America. Another stupid effing order.",
                "This is so fucked up. These are the worst people doing the worst things to America.",
                "Petty, childish, insecure, petulant. Just like Pumpkin Spice Palpatine.",
                "He is SUCH a piece of shit 😡",
                "He’s the most insecure man on the face of the planet."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Israel launches new strikes against Hamas and promises ‘increasing military force’ after talks stall",
            "external_url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-03-17-2025-b8753b9458a44f10ab08aa9b12582780",
            "upvotes": 394,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ugh, here we go again",
                "It’s amazing how the price of eggs somehow has taken over this war’s place in nightly news coverage here in the states",
                "We know what Trump and Netanyahu want. Trump posted it to his Instagram. Mow them all down Bibi, so I can make some real estate money. This world is sick. I feel so powerless.",
                "So they’re breaking the ceasefire again?",
                "well it was a couple weeks of uneasy peace but the horrific photos and videos coming from gaza from civilians are already starting to trickle in on social media again again.",
                "Back to commiting genocide as the world continues to turn a blind eye",
                "And somehow this isn't a violation of the ceasefire? Or yet another one I should say. Cool cool. I don't wanna hear shit if the Palestinians hit back then even tho I already know how that'll go",
                "Israel resumes genocide after violating the phase 1 ceasefire many times* \n\nFixed headline",
                "Are the Israelis giving us 500billion in mineral rights?",
                "Israel has been breaking the ceasefire since the day it began, but now they've fully restarted the genocide. Just absolutely disgusting, indefensible."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Pride group founder raped boy, 12, he met on Grindr",
            "external_url": "https://www.bbc.com/news/articles/cx28yj34zgpo.amp",
            "upvotes": 3709,
            "date": "03/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2dee/live/acb4cce0-0027-11f0-a94c-6986d2348378.png",
            "top_comments": [
                "I don't care who they are affiliated with; pride org, Catholic church, government, or the BBC itself; anyone harming a child like this deserves as much time as it's legal to give them. This is a lifetime of therapy for this poor kid.",
                "Yeah affiliation doesn’t matter. Don’t rape children.",
                "I hope he and his partner get the maximum punishment. See how easy it is to not support sexual predators, MAGA?",
                "Piece of shit exists, more at 10.\n\nIf he was protected by his community despite it being obvious he was a piece of shit, then fuck that community.",
                "Why was a 12 year old on Grindr in the first place?\n\nAnd who chats with a 12 year old on Grindr?",
                "[removed]"
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "NEW",
            "title": "Last Surviving Pilot of Battle of Britain Passes at 105",
            "external_url": "https://www.bbc.com/news/articles/cvg1z42pkj8o",
            "upvotes": 2640,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8ab7/live/1852cac0-0388-11f0-bee4-a1264feab608.jpg",
            "top_comments": [
                "I knew these days would come eventually, when that War passes from living memory, it's still hard to see it arrive. Its our duty as part of the younger generations to not forget their sacrifices and work to preserve the great peace that it brought.",
                ">Never has so much been owed by so many to so few.\n\n \\- Winston Churchill",
                "Ireland maintained neutrality during WWII, but quite a few Irishmen fought with the British. 'Paddy' Hemingway was one who joined the RAF.",
                "In related news, fascism is coming back now that all the dudes who fought against it are dead.",
                "Most of these pilots were teenagers. I can see the spark is still in his eyes. Rest In Peace, Sir.",
                "I'm glad he got so many years of peace after.",
                "Rip to the brave men and women who made victory and peace possible",
                "Thank you.\nYou will live on in my heart and head forever",
                "RIP, sir. Thank you for your service.",
                "Those pilots were the most badass groups of people to ever live prove me wrong"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Texas AG announces arrest of woman for allegedly illegally providing abortions in Houston",
            "external_url": "https://abcnews.go.com/US/texas-ag-announces-arrest-woman-allegedly-illegally-providing/story?id=119888542",
            "upvotes": 3162,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/553b1cdc-8add-461f-80d4-06fd20cfbc75/paxton-gty-er-250317_1742242201847_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I can't wait to hear all the details from someone other than Ken Paxton.",
                "> Abortions are banned in Texas except if the woman has a life-threatening condition or is at risk of \"substantial impairment of a major bodily function.\"\nPatients are required to make two trips, one for an in-person counseling session and then 24 hours later for the abortion, according to the Guttmacher Institute, a research group that focuses on sexual and reproductive health.\n\n\n\n\n\nNothing says amazing life saving treatment in emergency situations like giving a minimum of 24 hours to wait. ",
                "IIRC, to get a legal abortion in Texas the doctor is arrested and then must prove to the jury that it was medically necessary. You can't prove to a court and then have the court order an abortion. This was attempted early on and this AG said he would ignore any court and arrest the doctor anyway because this was the procedure. There isn't some standard to be met where a woman's life is sufficiently at risk or the fetus is nonviable. Doctor gets arrested and argues in a court of law to a jury that it was medically necessary. Remember that when one of those pro-birth anti-women people try to tell you it's a doctor's fault when a woman dies because she couldn't get an abortion.",
                "*\"In Texas, life is sacred,\" Paxton said in a statement. \"I will always do everything in my power to protect the unborn, defend our state's pro-life laws, and work to ensure that unlicensed individuals endangering the lives of women by performing illegal abortions are fully prosecuted.\"*\n\nTexas leads the country every year in executions. And this \"unlicensed individual\" is a woman helping other women, who have been denied abortion in Texas.",
                "Wow, it’s like we are moving back in time 100 years …….the Republican Party is insane ….",
                "Offhand, it looks like a \"midwife\" of questionable credentials practicing medicine without a license in a back alley clinic. \n\nIf you make abortion illegal, abortion doesn't go away, it just goes underground.",
                "[from another article:](https://www.texastribune.org/2025/03/17/texas-abortion-midwife-arrested/)\n\n\n>Holly Shearman, a midwife who runs Tomball Birth Center, where Rojas worked part-time providing prenatal care, said she was “shocked” by the news of her arrest. She described Rojas as a devout Catholic and skilled midwife whose clinics provided health care to a primarily Spanish-speaking, low-income community.\n\n\nWill be interested to see what they consider \"practicing medicine.\"",
                "Why do all high-ranking Republicans lately look like the villain in an 80s action movie?",
                ">\"In Texas, life is sacred,\" Paxton said in a statement.\n\nIs that supposed to be a joke?  Unless the kids are dying of measles or getting shot in school, right?\n\nAh, is there even a point pointing out the hypocrisy anymore?  I wish they'd just say they want to control women and save us all the hassle of that dog & pony show.",
                "If life is sacred how about doing something to help the actually alive children?"
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "RISING",
            "title": "Last Surviving Pilot of Battle of Britain Passes at 105",
            "external_url": "https://www.bbc.com/news/articles/cvg1z42pkj8o",
            "upvotes": 2640,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8ab7/live/1852cac0-0388-11f0-bee4-a1264feab608.jpg",
            "top_comments": [
                "I knew these days would come eventually, when that War passes from living memory, it's still hard to see it arrive. Its our duty as part of the younger generations to not forget their sacrifices and work to preserve the great peace that it brought.",
                ">Never has so much been owed by so many to so few.\n\n \\- Winston Churchill",
                "Ireland maintained neutrality during WWII, but quite a few Irishmen fought with the British. 'Paddy' Hemingway was one who joined the RAF.",
                "In related news, fascism is coming back now that all the dudes who fought against it are dead.",
                "Most of these pilots were teenagers. I can see the spark is still in his eyes. Rest In Peace, Sir.",
                "I'm glad he got so many years of peace after.",
                "Rip to the brave men and women who made victory and peace possible",
                "Thank you.\nYou will live on in my heart and head forever",
                "RIP, sir. Thank you for your service.",
                "Those pilots were the most badass groups of people to ever live prove me wrong"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "Pentagon webpage for Black Medal of Honor winner restored after outcry",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/defense-department-black-medal-honor-webpage-restored",
            "upvotes": 43575,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "But Navajo code talkers are gone, among other major subjects",
                "Good, fuck whichever idiot removed it in the first damn place.",
                "Now tell us why the link was changed to include \"dei\" in the URL.",
                "So, what was the message here sent to every US soldier? \n\nA: \"Honor is temporary.\"\n\nB: \"We ain't loyal.\"\n\nC: \"Y'all ain't worth the boots we gave you.\"",
                "I'm a pacifist, and I'm not impressed by the military in general, but even I am moved by a Medal of Honor recipient. It's not handed out for no reason, and certainly not as a participation award, or \"DEI\" as this man's page was labeled.\n\nI read his wikipedia entry, and he basically rallied and coordinated a position that was under siege and went through what sounds like around 14 hours of chaos and hell, was injured 3 times, refused to stop for medical treatment, and managed to defeat the enemy.\n\nHe signed up to put his life on the line, did so, saved the lives of others, and never gave up. He's a quintessential hero. The people who pushed for his erasure could never dream of being half the man that Charles C. Rogers was.",
                "Auto removal, my arse. If that's the case, they would have restored his status almost instantly when it was figured out.\n\nEdit: some commenters added that they did restore the original status relatively quickly.",
                "UPDATE to yesterday's post, it's back online after some \"online fury\". See DoD explanation below:\n\n>In a statement Monday that did not elaborate, a defense department spokesperson told the Guardian: “The department has restored the Medal of Honor story about army Maj Gen Charles Calvin Rogers … The story was removed during auto removal process.”",
                "We Germans know a thing or two about 'auto removal'—it was called Nazism and racism.",
                "This is great news, but this shit is happening ALL OVER the federal government and has been for last 8 weeks.  Women and people of color are being erased from history - from museums, web pages, and official documents.  Getting one instance restored due to public outcry is fantastic, but there are thousands of other instances of this.  The outcry needs to be for this entire targeted attack against minorities of all types. U.S. history is being whitewashed in real time and we're watching it happen.",
                "Let’s get government employees their jobs back now."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "San Diego officers among hundreds in California stripped of their badges under recent law, but large backlog remains",
            "external_url": "https://www.kpbs.org/news/2025/03/17/san-diego-officers-among-hundreds-in-california-stripped-of-their-badges-under-recent-law-but-large-backlog-remains",
            "upvotes": 4066,
            "date": "03/17/2025",
            "thumbnail": "https://cdn.kpbs.org/dims4/default/c7e126c/2147483647/strip/true/crop/4032x2117+0+454/resize/1200x630!/quality/90/?url=http%3A%2F%2Fkpbs-brightspot.s3.us-west-2.amazonaws.com%2Fdb%2F69%2Fe61a502748efbc8f802122ce0dd6%2Fpxl-20220314-144133383.PORTRAIT.jpg",
            "top_comments": [
                "I love this example. I bet that one's still talked about down at the station.\n\n>Anthony Hair, a former San Diego Police officer who [locked himself in the back of his squad car](https://post.ca.gov/Portals/0/post_docs/Certification_Actions/Statement_of_Findings/Hair_Anthony_Statement_of_Findings.pdf) with a woman he had arrested for an outstanding warrant. Hair’s body-worn camera recorded them having a sexually suggestive conversation as he drove her to a detention center. Hair later pulled over, turned off the camera and got in the back of the cruiser with the woman. Over an hour later, after realizing he locked himself in, he called a supervisor to unlock the door. Hair resigned the day before a scheduled administrative interrogation. \n\nAnyway, while there are flaws with this system, like a 3-year time limit to investigate and make a decision, it's at least a step in the right direction to getting these people off the force. They have to move to a new state, presumably go through a police academy again, not to mention explain why they didn't just go to the next town or county over in California.",
                "Accountability for officer misconduct? What a crazy idea.",
                "I live in East County SD. My mom lives near where these riots took place. I'm glad to see some accountability for cops within the state being implemented, but this needs a federal push. Otherwise these guys can just leave the state and terrorize a small town somewhere else. A federal database for this info would be a great start.",
                "I assume there are some good decent hard-working officers out there.\n\nSo I assume those officers would support this, because they don't want the bad apples spoiling the bunch.\n\n.. because that is what a few bad apples do. They spoil the entire bunch.",
                "I heard the cop mentioned even had to change his last name.  He was Hair today, Gone tomorrow.\n\n\nI'll see myself out.",
                "I'm from San Diego. If you want to understand policing there, just remember Sagon Penn and Cara Knott. \n\nThousands of other abuses go unreported or uninvestigated.",
                "Now do the LASD. And, good luck with it.",
                "Federal database needed .",
                "That is a good start.... but they need to start prosecuting rogue police officers, not just firing them. We need to get rid of qualified immunity. That is what has created the problem.",
                "Lest we not talk about what the “domestic abuse perps not allowed to use firearms” laws would do to the police force. Halve it nationwide last statistics available."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "4 dead and 142 injured in Oklahoma wildfires; more than 400 homes damaged statewide",
            "external_url": "https://abcnews.go.com/US/wildfires-oklahoma-texas-amid-extreme-fire-weather-conditions/story?id=119811373",
            "upvotes": 2130,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c71f86a4-9f48-4a01-a437-56ec77317262/wildfire-smoke-car-crash-ht-jt-250314_1741984758204_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "*In Kansas, a major crash on Interstate 70 in western Kansas near the border with Colorado, involved over 50 vehicles and left eight people dead, according to the Kansas Highway Patrol. Several other people were injured*\n\nEither dust or smoke are causing these multiple vehicle accidents across the midwest and southwest.",
                "Did they try turning the water spigot on?",
                "one sec gotta just make sure there are no trans athletes swimming in Montana before we deal with that",
                ">More than 400 homes and structures have been destroyed and at least 170,000 acres burned in Oklahoma after several wildfires broke out, prompting evacuations amid extreme fire weather conditions through the weekend.\n\nFEMA, a federal agency, has granted federal assistance to 13 counties in Oklahoma. Rendering much needed aid.",
                "Fire... in the winter?!? That cant be true because a Ex-Oklahoma Senator James Inhofe told me Climate Change is fake because there was snow in DC in Febuary. Surely he must have been telling the truth.",
                "Have they thought about putting tariffs on the fire?",
                "Damn. If only there was a northern ally with large and highly effective wildfire crews.",
                "And all those tariffs just in time for rebuilding.",
                "Why doesn’t Oklahoma manage this better?  They need to rake the ground.  Also please do not let FEMA do any work as Oklahoma uses more tax dollars than they provide.",
                "Good news is trump won an imaginary golf tournament that he probably cheated at.  I can’t believe I just typed that.  What a world."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "PepsiCo buys prebiotic soda brand Poppi to gain a foothold in functional drinks",
            "external_url": "https://apnews.com/article/pepsico-poppi-prebiotic-soda-f1fdb1103b5d8ad6a9e6d8c37e5ab713",
            "upvotes": 6931,
            "date": "03/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I will never forgive Pepsi for killing SoBe!",
                "*Allison Ellsworth, the co-founder of Austin, Texas-based Poppi, said the combination with PepsiCo will expand Poppi’s reach.*\n\nOh it will expand its reach alright, but sooner rather than later, its ingredients will need to change to meet the \"demands\" of the larger market as in more sugar and less vinegar.",
                "Functional drink? Poppi? The ones who had to remove all health branding from their products and had to settle a class action suit because their products didn’t actually do anything?",
                "Are they going to rename it Popsi?",
                "Guess I’ll stop drinking that now, thanks",
                "\"Functional Drink\" holy shit that's some corpo speak",
                "This is the life of almost all non-alcoholic beverages. Start up the company, gain investors, work your balls off for a couple years and rack up debt in advertising and retail agreements to establish the brand with the overall goal to sell to Pepsi or Coke and cash out and go home. For some companies like Poppi, it works. For others like BioSteel who can’t find a buyer, they inevitably go bankrupt.",
                "Functional drinks? What?\n\nIt's just overpriced meh flavored soda..\n\n\nSomeone just got the bag.",
                "Big corporations buying up smaller companies. Capitalism at it's finest.",
                "let the enshittification begin"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Harvard offers free tuition to families earning less than $200,000",
            "external_url": "https://www.bbc.com/news/articles/cm2d5jllx60o",
            "upvotes": 8337,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3687/live/03c20590-0341-11f0-bd89-c3fdf6bb272d.jpg",
            "top_comments": [
                "“So you’re telling me there's a chance...\"",
                "So like...most of the population?",
                "This isn't a new thing. If you get into Harvard and can prove you can't afford it, you basically get a free ride. The problem is it's insanely hard to get into Harvard and the kids that have the advantage of money, top tier education, and connections have a huge advantage.",
                "In before “Federal judge halts”",
                "For those who may not be aware, you still have to be ACCEPTED into Harvard, which is insanely difficult to do. This just means that if you are accepted, you may not have to pay if your family isn’t already wealthy. Honestly, this is better for everyone as it means that we’re not just furthering the education of the same wealthy families and now are spreading the knowledge into the general population.",
                "This is really anything new, most of the top Ivys have something in place like this where families below a certain income get free tuition.\n\nHarvard was actually dragging their feet I believe their previous policy was like below 90k, while other places like Stanford were doing below 150k.",
                "Good luck getting accepted.",
                "For the 15% of places that aren't legacy. Still, well done them!    \n   \nHarvard is a hedge fund with a charitable education charity on the side.",
                "Now that millennials are crushed with debt universities are offering free tuition.... Good for the next generation.",
                "How does a family making $200k afford a child going to Harvard?"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Air Force shoots down Houthi drones launched at Navy carrier strike group",
            "external_url": "https://taskandpurpose.com/news/air-force-truman-houthi-drones/",
            "upvotes": 467,
            "date": "03/17/2025",
            "thumbnail": "https://taskandpurpose.com/wp-content/uploads/2025/03/USS-Gettysburg-March-2025.jpg",
            "top_comments": [
                "Don’t touch the boats!",
                "Imagine thinking that your shitty drone can bypass US Navy carrier group anti-air defenses",
                "Don't shoot at shipping or naval vessels and that won't happen. Simple.",
                "They’re gonna get themselves obliterated. They _can’t_ be feeling like they have some advantage here. I remember the Houthis m saying they’d specifically be targeting US ships after that bomb drop the other day, but what kind of tech are they using to identify ships and verify hits? I’m imagining they’re using a telescope to spot ships and go after them.",
                "Air Medals for everybody!",
                "The Houthi blockade of the Red Sea resumed after the 2nd of March 2025 when Israel imposed a total siege on Gaza, preventing all humanitarian aid from entering, in egregious violation of the ceasefire agreement and international law.\n\n\n>The Houthis, who began their attacks on shipping containers in response to Israel’s war on Gaza in 2023, and in defense of the Palestinians, reiterated on Sunday in separate comments that the “naval operation will continue until [the] Gaza blockade is lifted and aid is let in”.\n\n\n>The Houthis had halted the attacks when the Gaza ceasefire took effect in January and have not launched any attacks in the two months since. \n\n\n> [Source](https://www.aljazeera.com/news/2025/3/16/houthis-vow-response-as-us-says-unrelenting-strikes-to-continue-in-yemen)",
                "The Japanese have a saying \n\nThe nail that stands out, is the one that gets pounded down.",
                "This will Darin $$$$$ like no tmw",
                "Houthis: -$30k\n\nUSA: -$900k",
                "Are they sure it was the Air Force?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Employee charged in killing of trucking CEO found after fire in Chicago suburb",
            "external_url": "https://www.cbsnews.com/chicago/news/employee-charged-killing-of-trucking-ceo-crestwood/",
            "upvotes": 965,
            "date": "03/17/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/17/1a39fdd1-24a5-49c7-8cd7-6b5888b0951e/thumbnail/1200x630/997c6d131cae3dc65a5c8e0ee40dc028/untitled-2025-03-17t093958-944.png?v=0f810147b409d4839bb6b9850f758494",
            "top_comments": [
                "[removed]",
                "Just gonna put it out there, anyone in the trucking industry who knows anything about brokering loads knows that EVERY Chicago based Trucking company is a scam operation.\n\nMost freight brokers will automatically ban a company based out of Chicago because they are notoriously always scamers.",
                "framing an innocent employee for fire+accident death of ceo is peak USA,\nI think the ceo was not putting enough hours into his work and made a silly mistake that led to this.\nif they cut the salary of the CEO to the lowest earner of the company, then the real ceos who are in for the work and not to make money will succeed",
                "Jeramie Bizzle.\n\nI wonder how it went growing up with that name?",
                "You don’t use dental floss on your throat. He also stored flammable materials in his house. Sounds like the employee is innocent and the CEO was just incompetent.",
                "The CEO probably died accidentally from a lack of diligence, not being hardcore enough, or giving it less than 110%. We should take this as a learning opportunity and get back to work.",
                "Oh no! Not a job creator! Who’s going to create the jobs now?",
                "I’m not buyin it. Sounds like the guy was framed",
                "These guys don't truck around.",
                "I knew a trucking CEO, they can be pretty ruthless just like the rest of them. They’ll make all sorts of promises just to get through the quarter then layoff 2/3rd’s of their staff for the winter and IF they bring them back it’s for less money."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Pride group founder raped boy, 12, he met on Grindr",
            "external_url": "https://www.bbc.com/news/articles/cx28yj34zgpo.amp",
            "upvotes": 3710,
            "date": "03/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2dee/live/acb4cce0-0027-11f0-a94c-6986d2348378.png",
            "top_comments": [
                "I don't care who they are affiliated with; pride org, Catholic church, government, or the BBC itself; anyone harming a child like this deserves as much time as it's legal to give them. This is a lifetime of therapy for this poor kid.",
                "Yeah affiliation doesn’t matter. Don’t rape children.",
                "I hope he and his partner get the maximum punishment. See how easy it is to not support sexual predators, MAGA?",
                "Piece of shit exists, more at 10.\n\nIf he was protected by his community despite it being obvious he was a piece of shit, then fuck that community.",
                "Why was a 12 year old on Grindr in the first place?\n\nAnd who chats with a 12 year old on Grindr?",
                "[removed]"
            ],
            "aggregate_sentiment": 12.0
        }
    ],
    "last_updated": "03/18/2025 04:10:49 UTC"
}