{
    "posts": [
        {
            "category": "HOT",
            "title": "Grieving husband says \"reckless\" Texas abortion law led to pregnant wife's death",
            "external_url": "https://www.cbsnews.com/news/grieving-husband-says-reckless-texas-abortion-law-led-to-pregnant-wifes-death/",
            "upvotes": 26128,
            "date": "03/24/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/18/af216be8-5956-4f63-b8b7-9e8dc966d779/thumbnail/1200x630/9ae58c7fddc98f25eeb31368aff35331/shamlian-eoa-tx-abortion-en031825-consolidated-01-frame-229.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "The national rate for maternal mortality went up 11%?! What the hell?",
                "He's right.\n\n\nBut JD Vance wants you to forget about your beloved dead wife, get a new one (so you won't be one of those icky single people), and breed breed breed.",
                "Man, if only we had a [historical record](https://foreignpolicy.com/2019/05/16/what-actually-happens-when-a-country-bans-abortion-romania-alabama/) of what happens when you [ban abortion](https://en.wikipedia.org/wiki/Death_of_Savita_Halappanavar), then perhaps we would have known that the Supreme Court put a gun to the heads of so many pregnant women on June 24, 2022 and that an appropriate response is necessary.",
                "And people actually voted for this to be implemented. Speechless",
                "Welcome to American Christian nationalist laws",
                "Republicans will bend over backwards to make excuses for this and try to say it was the doctors’ fault instead of the law. But they know deep down this is what they wanted and they don’t care about the women who have to lose their lives for it.",
                ">Between 2019 and 2022, the (maternal mortality) rate increased by 56% after the state outlawed abortions, according to Gender Equity Policy Institute. During the same period, the rate increased by just 11% on a national scale.\n\nThis is exactly what EVERYONE with a brain and a conscience said would happen.",
                "I hope the birth rate plummets",
                "It’s what every Republican voter wanted, or they wouldn’t have supported it.",
                "This is the reason my only daughters got their tubes tied. They’re very scared of complications. I had major complications and it would of been a death sentence in states like Texas. \n\nThis should’ve never happened. It’s infuriating this happens in America."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Woman says United Airlines crew tried to make her remove son's ventilator",
            "external_url": "https://www.nbcnews.com/news/us-news/woman-united-airlines-crew-tried-make-remove-sons-ventilator-rcna197695",
            "upvotes": 10277,
            "date": "03/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-01/250108-united-airlines-ch-1424-5c7329.jpg",
            "top_comments": [
                "> United said it has contacted Sotomayor \"to address her concerns and apologized for any frustration she may have experienced.\" The airline did not provide further details.\n\n\n> Sotomayor told NBC...the airline’s apology “was not sincere.”\n\n\nObviously, because that wasn't a real apology.  \"I'm sorry you felt bad\" is not an acknowledgement of any wrongdoing.  \n\n\nThat said, they have to know they are toast if they are sued over this so maybe not admitting wrongdoing is part of their litigation damage control.  She even went the extra mile \"she shared the documentation with the airline before the trip and that the airline cleared her son's medical equipment with no problem.\"  Combine that with the flight attendants providing B.S. medical advice that the son would \"be OK until we're in the air at a high enough altitude.\"  This whole incident stinks.",
                "United Airlines 🤜🤛 United Healthcare\n\n\"One way or another that two-year old has to go.\"",
                "This is actually nuts. The whole plane crew working together really trying to kill that kid",
                "My baseline for United customer service is \"better or worse than beating up a doctor and dragging him off the plane?\"",
                "Ma'am, he'll need that to live.",
                "Sounds like the flight attendants need to attend a little training course.",
                "Wow. It’s a trach tube not an earring. Thank God the mom stuck to her documentation and did not take away her son’s lifeline until they got to cruising altitude.",
                "So many of these crazy stories come from United Airlines",
                "I’m just thinking about that poor child just trying to survive the flight and the audacity of an airline attendant to suggest he would be ok without oxygen is insane. Hopefully she makes millions in her lawsuit and have plenty of funds to take care of herself and her child.",
                "It’s not even remotely the same, but when our son was two - we were taking him on a flight in his airline approved car seat. \n\nThe flight attendant demanded we remove him from the car seat before take off. We argued it was literally the safest place for him and provided the documents that it was approved - and she still threatened to kick us off.\n\nIt’s like these flight attendants are being trained to be the most self righteous cunts possible."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "FBI launches Tesla threats task force",
            "external_url": "https://www.cnbc.com/2025/03/24/fbi-tesla-elon-musk-task-force-threats-trump-doge.html",
            "upvotes": 1564,
            "date": "03/24/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118254-1742392318191-gettyimages-2205773069-em043847_2025031824339609.jpeg?v=1742844317&w=1920&h=1080",
            "top_comments": [
                "It's like that clip from the Simpsons where an FBI agent goes running past a bunch of doors like \"Joint Terrorism Taskforce\" and \"Hostage Negotiation\" to arrive at this huge elaborate set of doors marked \"Movie Piracy\". \n\n[https://forgifs.com/gallery/d/223800-3/Simpsons-movie-piracy-FBI-headquarters.gif](https://forgifs.com/gallery/d/223800-3/Simpsons-movie-piracy-FBI-headquarters.gif)",
                "If only they do as much for school children under the threats of gun violence.",
                "This waste of money, time, and energy is brought to you by DOGE",
                "Rent-a-cops for a car salesman.",
                "They will just find insurance fraud.",
                "The FBI is more concerned with protecting Elmo’s wealth than they are with the lives of kids getting shot at schools.",
                "A government task force to protect a private business.\n\nWe are really living in the bizarro world.",
                "So…not to human trafficking, drugs, child exploitation…a gazillion other more important matters….no, Teslas. Fucken Teslas. \n\nWhat kind of fascist nightmare are we in?",
                "serious question, is there a task force for school shootings??",
                "This sounds like waste, fraud, and abuse to me"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Bumble Bee sued by deep-sea crew who say they were forced into ‘fishing boat slavery’",
            "external_url": "https://www.cnn.com/2025/03/21/business/bumble-bee-forced-labor-fishing-lawsuit-intl-hnk/index.html",
            "upvotes": 3340,
            "date": "03/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/greenpeace-2.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> Last year, Bumble Bee agreed to remove claims of a “fair and safe supply chain” and “fair and responsible working conditions” from its website, social media and other advertising as part of a settlement with Global Labor Justice-International Labor Rights Forum. \n\n\"Oh my god, he admit it!\"",
                "I remember reading how bad it was in shrimp fishing side but its kinda obvious its more wide spread in fishing industry.\n\nOrganised crime is deep in agriculture and fishing and people with debts or just trafficked get caught up in it. Larger companies dont care or turned blind eye to their suppliers or where they get their catch. The scale of demand makes it easier too. If theres money to be made it’s corrupt easily with no oversight\n\nEvery country is one civil war or collapse away to having its population picked off by slavers when fleeing borders",
                "Sadly, [this isn't new](https://www.npr.org/2016/09/13/493801034/ap-report-exposes-slave-like-conditions-on-hawaii-fishing-fleets). The US [fought a war](https://www.archives.gov/publications/prologue/2012/summer/1812-impressment.html) over it as a matter of fact.",
                "Yikes. It’s dolphin safe but not fisherman safe. ",
                "\"Pardon me, your slavery is showing. Bumble Bee tuna!\"",
                "What the fuck. Well no reason to buy their brand ever again, fucking slavers.",
                "It's insane that, at most, Bumble Bee will face *civil* penalties. They turned a blind eye to criminal acts.",
                "But line on index funds must go up.",
                "Shrimp is another big one. I recall seeing a documentary on slave vessels for shrimp. Migrants in south east Asia get kidnapped and you either slave away or get beaten or thrown overboard.",
                "Yeah the huge industrial scale of slavery in the global fishing industry, the conditions that the men are kept in, and the sickeningly high mortality rate have been known for a long time. The problem is getting anyone to care, because they're men, and because they're not white."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Turkey announces 1,133 arrests have been made in relation to protests.",
            "external_url": "https://www.bbc.co.uk/news/live/cq6yde479gdt?post=asset%3Ae185b269-c225-4fbc-802f-6746e2130039#post",
            "upvotes": 1417,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e839/live/bec7c780-08d7-11f0-97d3-37df2b293ed1.jpg",
            "top_comments": [
                "How long until these headlines are about USA?",
                "Is it coup season in Turkey already?",
                "\" . . . Arrests have been made in ~~relation to protests~~. Fascist Crackdown.",
                "wtf has happened in the comments?",
                "But they gave us eggs! Can't be that bad /s",
                "Shall we… applaud? 👏\n\nOk that’s enough\n\nEdit: it was one Applaus for the government with an /s… not as obvious as I thought."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Airlines threaten Heathrow with legal action",
            "external_url": "https://news.sky.com/story/airlines-threaten-heathrow-with-legal-action-13335133",
            "upvotes": 271,
            "date": "03/24/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-heathrow-plane_6865974.jpg?20250324184037",
            "top_comments": [
                "TL;DR: Airlines want money for time they couldn't fly during a fire at the airport.",
                "This seems odd because the fire wasn't at the airport- it was at a large electrical substation that also served surrounding businesses and homes.  \n\nHeathrow really is a victim here not a cause.",
                "Do people not understand how legal stuff works? They have to sue the airport for the airports insurance to kick in. When the doctor fucks up you sue the doctor and then their malpractice insurance kicks in. That’s just the way things are done.",
                "I hope the airport tells them, “sorry, you’re SOL—we’re calling it an ‘Act of God.’” 🤷‍♀️",
                "I hate airlines as much as anyone but they paid for a time slot they did not receive. Why aren't they being refunded?",
                "Heathrow should be liable to the airlines, per their contractual agreement to provide a service/slot. And Heathrow should have insurance to cover instances like this. \n\nThat’s the way the world works."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "South Korean court overturns impeachment of Prime Minister Han, reinstating him as acting president",
            "external_url": "https://apnews.com/article/south-korea-impeachment-han-ducksoo-20daed0fb3c90c02ca229c977d230b06",
            "upvotes": 5679,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This guy isn't Yoon (The president who started the Martial Law Order), he is up for sentencing next. If he doesn't get impeached, then shit will go down.",
                "Context on the quorum bit, since AP doesn’t provide it - Korea’s national assembly has 300 seats. A simple majority is enough to impeach most officials, but a 2/3 majority is required to impeach the president. It was (and maybe still is) an open question what the requirement was to impeach an acting president - 151 because he is the prime minister, or 200 because he is (acting) president? Apparently some of the justices think it’s the latter, (edit) but it seems like the majority ruled that it’s 151.\n\nThis feels like it was the weakest of the cases, for what it’s worth. He was consistently saying he was against the martial law, and it seems like they failed to prove he was actually involved with it.",
                ">On Monday, seven of the court’s eight justices overturned or dismissed Han’s impeachment. They ruled the accusations against him weren’t against the law or weren’t serious enough to remove him from office or his impeachment motion didn’t even meet a required quorum when it passed through the assembly.\n\nNot having a quorum seems sketchy. The other parts of South Korean law, I can't comment on.",
                "The amount of people who are r/confidentlyincorrect here is astonishing...",
                "If you didn't read the article before commenting, you're part of the problem.",
                "Not the guy most people are assuming, but very interesting that the court can overturn an impeachment.",
                "Wow the world is going crazy",
                "[removed]",
                "So I don't know a l9t about the court system in Korea. Is this outrageous, or is this something that sometimes happens?",
                "TIL that South Korea has both a PM and a President"
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "HOT",
            "title": "Top US officials appeared to message a journalist Houthi strike plans",
            "external_url": "https://www.bbc.com/news/articles/cy4v3ndg28jo",
            "upvotes": 173,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/9379/live/b4019cf0-08db-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                ">Jeffrey Goldberg, editor-in-chief of The Atlantic, [reported](https://www.theatlantic.com/politics/archive/2025/03/trump-administration-accidentally-texted-me-its-war-plans/682151) on Monday that he was added to a Signal message group which included accounts labelled as White House National Security Adviser Michael Waltz and Vice-President JD Vance.\n\nWhy are updates on military operations being communicated over Signal rather than secure DoD communications?\n\nEdit:  \nAnyone who remotely (and rightfully) criticized Hillary Clinton for using her own Email server should be furious about this news story.",
                "Old whiskey finger hegseth at it again. To be fair, when you’re that drunk, names just blur together in your phone. ",
                "The defense department has [confirmed.](https://abcnews.go.com/Politics/trump-officials-accidentally-shared-yemen-war-plans-group/story?id=120106043)\n\n\nInsane",
                "Not appeared, they DID message a journalist by mistake on their group text chain discussing war plans.",
                "Thank you, Trump voters, for enabling these many opportunities to see that your people are as embarrassing behind closed doors as they are publicly. \n\n\nIt's going to take decades to recover from just the past 2 months.  Pretty much an entire term to go.",
                "Anyone have odds that the administration tries to blame the journalist?",
                "How about the DEI (Drunk Executive Idiots)!?",
                "Anyone who allowed this man to be confirmed is complicit in my book",
                "Yes, Hegseth accidentally included the Editor of The Atlantic on a Signal chat.",
                "No way he was added by accident. The fucking editor-in-chief?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Three men found guilty of plotting to murder £54m Securitas robber Paul Allen",
            "external_url": "https://news.sky.com/story/three-guilty-of-plot-to-murder-54m-securitas-heist-gang-member-13330360",
            "upvotes": 433,
            "date": "03/24/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-paul-allen-securitas_6858758.jpg?20250316161011",
            "top_comments": [
                "Let’s see Paul Allen’s card",
                "I'm left speculating about what the motive was here. Where is the £54M now? Was the attempted hit related to that or some other job they crossed paths over?",
                "These all read like a movie plot",
                "Try getting a reservation at Dorsia now you stupid fucking bastard",
                "But I had dinner with Paul Allen in London.",
                "Does this Paul Allen like Huey Lewis and The News?",
                "Try getting a reservation at Dorsia now you stupid fucking bastards!",
                "I came to see if people were referencing the movie. Reddit does not disappoint.",
                "Linen textured business cards cited as motive for hit.",
                "You like huey Lewis and the news?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Oscar-winning Palestinian director is attacked by Jewish settlers and detained, activists say",
            "external_url": "https://apnews.com/article/no-other-land-oscar-israel-palestinians-084c63f33e748a3279646759e9b705c2",
            "upvotes": 132,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*“No Other Land,” which won the Oscar this year for best documentary,* [*chronicles the struggle*](https://apnews.com/article/no-other-land-oscar-win-palestinians-3c70e4ea1e7b213849f192dab5620a4c) *by residents of Masafer Yatta to stop the Israeli military from demolishing their villages. It has two Palestinian co-directors, Ballal and Basel Adra, both residents of Masafar Yatta, and two Israeli directors, Yuval Abraham and Rachel Szor.*\n\nThis was a joint Palestinian-Israeli production. Leave it to the expansionist settler thugs to try to sever any connection between Israel and the Palestinians.",
                "The IDF be like, 'can't have another one of these documentaries coming out.'\n\nIsrael does its best to bury the truth about its actions because they know how heinous they actually are. The fucked up reality is that the IDF makes Hamas look like a charity organization.",
                "I’m shocked beyond words. /s\n\nZionism is a disease upon the Earth.",
                "I'm starting to think these Israelis aren't good people.",
                "Jewish settlers or Israeli settlers? Seems to be an important editorialized issue on the title there",
                "The part they cut from the Oscar-winning “Israeli” film\nThe film calls this “rampages and threats on villages.” In reality? Staged clashes and soldier harassment.\nThe No Other Land filmmakers left out this Hebron Council footage—but it says it all.\n\nhttps://x.com/GAZAWOOD1/status/1897275319796867371?t=lnaQuW7nU8xt60UnckFrKA&s=19"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Top US officials appeared to message a journalist Houthi strike plans",
            "external_url": "https://www.bbc.com/news/articles/cy4v3ndg28jo",
            "upvotes": 168,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/9379/live/b4019cf0-08db-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                ">Jeffrey Goldberg, editor-in-chief of The Atlantic, [reported](https://www.theatlantic.com/politics/archive/2025/03/trump-administration-accidentally-texted-me-its-war-plans/682151) on Monday that he was added to a Signal message group which included accounts labelled as White House National Security Adviser Michael Waltz and Vice-President JD Vance.\n\nWhy are updates on military operations being communicated over Signal rather than secure DoD communications?\n\nEdit:  \nAnyone who remotely (and rightfully) criticized Hillary Clinton for using her own Email server should be furious about this news story.",
                "Old whiskey finger hegseth at it again. To be fair, when you’re that drunk, names just blur together in your phone. ",
                "The defense department has [confirmed.](https://abcnews.go.com/Politics/trump-officials-accidentally-shared-yemen-war-plans-group/story?id=120106043)\n\n\nInsane",
                "Not appeared, they DID message a journalist by mistake on their group text chain discussing war plans.",
                "Thank you, Trump voters, for enabling these many opportunities to see that your people are as embarrassing behind closed doors as they are publicly. \n\n\nIt's going to take decades to recover from just the past 2 months.  Pretty much an entire term to go.",
                "Anyone have odds that the administration tries to blame the journalist?",
                "How about the DEI (Drunk Executive Idiots)!?",
                "Anyone who allowed this man to be confirmed is complicit in my book",
                "Yes, Hegseth accidentally included the Editor of The Atlantic on a Signal chat.",
                "No way he was added by accident. The fucking editor-in-chief?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Austin Tesla dealership bomb investigation; suspicious devices found",
            "external_url": "https://www.fox7austin.com/news/austin-tesla-dealership-bomb-investigation-suspicious-devices-found",
            "upvotes": 120,
            "date": "03/24/2025",
            "thumbnail": "https://images.foxtv.com/static.fox7austin.com/www.fox7austin.com/content/uploads/2025/03/1280/720/tesla-showroom-incident-ktbceme001_11_05_23.mpg_ktbca579_132.mpg_.11_06_01_22.still001.jpg?ve=1&tl=1",
            "top_comments": [
                "Since this is Texas, I'm going to assume Ken Paxton paid to set this up.",
                "None of them exploded, false flag?",
                "Looks like the reichstag fire will be at a Tesla dealership this time.",
                "Are they sure the people weren't just tourists looking at the showroom?",
                "That’s just a Roman Firework.",
                "Those aren't bombs, they're just Cybertrucks. I understand why someone might confuse the two",
                "Many of the people I know who bought Teslas are getting rid of them. \n\nThey don't even care about the politics around it all - they just don't want the hassle.",
                "Maybe don't threaten or bomb dealerships...\n\n...but also doesn't LibsofTikTok cause bomb threats at schools regularly, too?",
                "Yikes, we’re at the firebombing stage already? ",
                "Remember that time White Nationalist were caught breaking into AutoZone during the Floyd protests?    Or that White Nationalist started firebombing Police buildings, just so BLM protesters would get blamed for it.\n\n[Source](https://abcnews.go.com/US/man-helped-ignite-george-floyd-riots-identified-white/story?id=72051536)\n\nAnd \n\n[This](https://www.voanews.com/a/usa_whos-behind-violence-george-floyd-protests-us/6190522.html)\n\nOh and this [ONE](https://theblackwallsttimes.com/2021/10/08/white-supremacist-admits-to-firing-ak-47-into-minneapolis-police-station-during-george-floyd-protests/)\n\nDon’t be fooled again into this this is Anti-Tesla peeps, could just be more the same people trying to start a war.  Fooling POTUS into doing what he claims he will do to anyone that protests.   Sending the against their will to El Salvador."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Oscar-winning Palestinian director is attacked by Jewish settlers and detained, activists say",
            "external_url": "https://apnews.com/article/no-other-land-oscar-israel-palestinians-084c63f33e748a3279646759e9b705c2",
            "upvotes": 131,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*“No Other Land,” which won the Oscar this year for best documentary,* [*chronicles the struggle*](https://apnews.com/article/no-other-land-oscar-win-palestinians-3c70e4ea1e7b213849f192dab5620a4c) *by residents of Masafer Yatta to stop the Israeli military from demolishing their villages. It has two Palestinian co-directors, Ballal and Basel Adra, both residents of Masafar Yatta, and two Israeli directors, Yuval Abraham and Rachel Szor.*\n\nThis was a joint Palestinian-Israeli production. Leave it to the expansionist settler thugs to try to sever any connection between Israel and the Palestinians.",
                "The IDF be like, 'can't have another one of these documentaries coming out.'\n\nIsrael does its best to bury the truth about its actions because they know how heinous they actually are. The fucked up reality is that the IDF makes Hamas look like a charity organization.",
                "I’m shocked beyond words. /s\n\nZionism is a disease upon the Earth.",
                "I'm starting to think these Israelis aren't good people.",
                "Jewish settlers or Israeli settlers? Seems to be an important editorialized issue on the title there",
                "The part they cut from the Oscar-winning “Israeli” film\nThe film calls this “rampages and threats on villages.” In reality? Staged clashes and soldier harassment.\nThe No Other Land filmmakers left out this Hebron Council footage—but it says it all.\n\nhttps://x.com/GAZAWOOD1/status/1897275319796867371?t=lnaQuW7nU8xt60UnckFrKA&s=19"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "FBI launches Tesla threats task force",
            "external_url": "https://www.cnbc.com/2025/03/24/fbi-tesla-elon-musk-task-force-threats-trump-doge.html",
            "upvotes": 1571,
            "date": "03/24/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118254-1742392318191-gettyimages-2205773069-em043847_2025031824339609.jpeg?v=1742844317&w=1920&h=1080",
            "top_comments": [
                "It's like that clip from the Simpsons where an FBI agent goes running past a bunch of doors like \"Joint Terrorism Taskforce\" and \"Hostage Negotiation\" to arrive at this huge elaborate set of doors marked \"Movie Piracy\". \n\n[https://forgifs.com/gallery/d/223800-3/Simpsons-movie-piracy-FBI-headquarters.gif](https://forgifs.com/gallery/d/223800-3/Simpsons-movie-piracy-FBI-headquarters.gif)",
                "If only they do as much for school children under the threats of gun violence.",
                "This waste of money, time, and energy is brought to you by DOGE",
                "Rent-a-cops for a car salesman.",
                "They will just find insurance fraud.",
                "The FBI is more concerned with protecting Elmo’s wealth than they are with the lives of kids getting shot at schools.",
                "A government task force to protect a private business.\n\nWe are really living in the bizarro world.",
                "So…not to human trafficking, drugs, child exploitation…a gazillion other more important matters….no, Teslas. Fucken Teslas. \n\nWhat kind of fascist nightmare are we in?",
                "serious question, is there a task force for school shootings??",
                "This sounds like waste, fraud, and abuse to me"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Airlines threaten Heathrow with legal action",
            "external_url": "https://news.sky.com/story/airlines-threaten-heathrow-with-legal-action-13335133",
            "upvotes": 270,
            "date": "03/24/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-heathrow-plane_6865974.jpg?20250324184037",
            "top_comments": [
                "TL;DR: Airlines want money for time they couldn't fly during a fire at the airport.",
                "This seems odd because the fire wasn't at the airport- it was at a large electrical substation that also served surrounding businesses and homes.  \n\nHeathrow really is a victim here not a cause.",
                "Do people not understand how legal stuff works? They have to sue the airport for the airports insurance to kick in. When the doctor fucks up you sue the doctor and then their malpractice insurance kicks in. That’s just the way things are done.",
                "I hope the airport tells them, “sorry, you’re SOL—we’re calling it an ‘Act of God.’” 🤷‍♀️",
                "I hate airlines as much as anyone but they paid for a time slot they did not receive. Why aren't they being refunded?",
                "Heathrow should be liable to the airlines, per their contractual agreement to provide a service/slot. And Heathrow should have insurance to cover instances like this. \n\nThat’s the way the world works."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Bumble Bee sued by deep-sea crew who say they were forced into ‘fishing boat slavery’",
            "external_url": "https://www.cnn.com/2025/03/21/business/bumble-bee-forced-labor-fishing-lawsuit-intl-hnk/index.html",
            "upvotes": 3341,
            "date": "03/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/greenpeace-2.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> Last year, Bumble Bee agreed to remove claims of a “fair and safe supply chain” and “fair and responsible working conditions” from its website, social media and other advertising as part of a settlement with Global Labor Justice-International Labor Rights Forum. \n\n\"Oh my god, he admit it!\"",
                "I remember reading how bad it was in shrimp fishing side but its kinda obvious its more wide spread in fishing industry.\n\nOrganised crime is deep in agriculture and fishing and people with debts or just trafficked get caught up in it. Larger companies dont care or turned blind eye to their suppliers or where they get their catch. The scale of demand makes it easier too. If theres money to be made it’s corrupt easily with no oversight\n\nEvery country is one civil war or collapse away to having its population picked off by slavers when fleeing borders",
                "Sadly, [this isn't new](https://www.npr.org/2016/09/13/493801034/ap-report-exposes-slave-like-conditions-on-hawaii-fishing-fleets). The US [fought a war](https://www.archives.gov/publications/prologue/2012/summer/1812-impressment.html) over it as a matter of fact.",
                "Yikes. It’s dolphin safe but not fisherman safe. ",
                "\"Pardon me, your slavery is showing. Bumble Bee tuna!\"",
                "What the fuck. Well no reason to buy their brand ever again, fucking slavers.",
                "It's insane that, at most, Bumble Bee will face *civil* penalties. They turned a blind eye to criminal acts.",
                "But line on index funds must go up.",
                "Shrimp is another big one. I recall seeing a documentary on slave vessels for shrimp. Migrants in south east Asia get kidnapped and you either slave away or get beaten or thrown overboard.",
                "Yeah the huge industrial scale of slavery in the global fishing industry, the conditions that the men are kept in, and the sickeningly high mortality rate have been known for a long time. The problem is getting anyone to care, because they're men, and because they're not white."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Former Utah Rep. Mia Love, the first Black Republican woman elected to the US House, has died",
            "external_url": "https://apnews.com/article/mia-love-congress-black-republican-died-440edac7923942e9329e0224a3d053c1",
            "upvotes": 182,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I'm impressed Utah has ever had a black representative tbh. Looking at the census, Utah is only 1% black.",
                "Brain cancer for those who don’t click.",
                "She was only 49.  Way too young to go.  Fuck cancer",
                "Hated her politics, but no one should have to face cancer. Fuck cancer."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Man drives car into protesters outside a Tesla dealership, nobody hurt, sheriff says",
            "external_url": "https://apnews.com/article/musk-doge-tesla-trump-protest-car-9c93cf15d863359730298f2729319810",
            "upvotes": 684,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Were they arrested, charged with terrorism and sent to El Salvador?",
                "Is this the same guy? Lol\n\nhttps://www.trumpettesusa.com/andrew-dutil-trumpster/",
                "> The protest on Saturday was interrupted when Andrew Dutil drove his vehicle onto the sidewalk full of protesters at a slow speed, forcing people to scramble out of the way to avoid the being hit, according to the Palm Beach County Sheriff’s Office.\n\n> Dutil was arrested and faces an assault charge, according to court records. An attorney who could speak on Dutil’s behalf wasn’t immediately listed in court records.\n\nBefore I read the article, I was hoping it was something like a Tesla on autonomous mode slow-rolled through a crowd of protesters, but that was not the case. Still, how is the guy facing only one assault charge and not one for every pedestrian that had to move?",
                "That *sick terrorist thug* needs to be sent to prison in El Salvador.",
                "I have to assume he wasn't driving a Tesla because otherwise it would have caught on fire and locked him in.",
                "Protesting the growing power of the oligarchy... terrorism \n\nAttempting to murder those protesters...not terrorism \n\nIt's an utterly corrupted system.",
                "What goes thru someone’s mind and thinks, “yea. This is a good idea”",
                "During the revolutions of 19th century Europe, the protestors would use whatever means they could to erect barricades.\n\nProbably something we will have to start doing here in order to protect our rights to assembly and speech",
                "Now that was a hate crime.",
                "I dont think he should get a lower penalty bc he didn't succeed."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "23andMe files for bankruptcy protection",
            "external_url": "https://www.bbc.com/news/articles/c9q4r9xy9wro",
            "upvotes": 533,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b2ce/live/c88ca8f0-0876-11f0-ae03-eb54c26d2690.jpg",
            "top_comments": [
                "Well, here we go. Time to sell your genetic data to the highest bidder.",
                "The site is already throwing tons of errors and having trouble loading. I assume everyone is trying to download/delete everything right now.",
                "California AG says should think about deleting your account or data if a 23andMe customer.\n\nhttps://www.aol.com/23andme-users-told-consider-deleting-112656399.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuYmluZy5jb20v&guce_referrer_sig=AQAAAD_t7yQ9cHXfiRNpV-5J3hvLBWBPcKbVvc0k8X9kXtw_WT9CysKCxX6W1Bpn26DdVmV1-yx3XzOQdTYzXrSeINFoU0dwKZaCZPGlgIH45CRnNCLnxOX9XrKrPb_1L_f_-BG638jDxB-paiV2l73Wj4jSapK2ANYJiKU5T8tT3GgR\n\nCalifornia privacy rules a little different than other states. One can delete their account or data but what if it's already been sold or transferred?",
                "I'm sure that nothing nefarious will happen to all that genetic data that you had a contract with a company that no longer exists.",
                "DNA up for sale ya'll",
                "How dangerous is sharing your DNA data?",
                "This almost feels like when those cryo-genic body preservation companies went bankrupt and had to \"kill\" their clients.  Millions of y'all's genetic info now gonna be in the hands of the government and massive corpos.  Elon gonna love getting all that data.",
                "Yup. That's why I haven't suggested anyone do a DNA test through them in a while. If anyone is interested in doing a DNA test - only do Ancestry.com. Then you can port your raw data to FamilyTreeDNA, MyHeritage, and GEDMatch.\n\n\nAncestry's the most stable of the big four (well, big three, now) DTC DNA testing companies.",
                "I’m sure they won’t sell all that dna data to save themselves because they aren’t hipaa bound 😂",
                "So now thiae targeted facebook ads will be even more interesting"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Three men found guilty of plotting to murder £54m Securitas robber Paul Allen",
            "external_url": "https://news.sky.com/story/three-guilty-of-plot-to-murder-54m-securitas-heist-gang-member-13330360",
            "upvotes": 434,
            "date": "03/24/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-paul-allen-securitas_6858758.jpg?20250316161011",
            "top_comments": [
                "Let’s see Paul Allen’s card",
                "I'm left speculating about what the motive was here. Where is the £54M now? Was the attempted hit related to that or some other job they crossed paths over?",
                "These all read like a movie plot",
                "Try getting a reservation at Dorsia now you stupid fucking bastard",
                "But I had dinner with Paul Allen in London.",
                "Does this Paul Allen like Huey Lewis and The News?",
                "Try getting a reservation at Dorsia now you stupid fucking bastards!",
                "I came to see if people were referencing the movie. Reddit does not disappoint.",
                "Linen textured business cards cited as motive for hit.",
                "You like huey Lewis and the news?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "FBI launches Tesla threats task force",
            "external_url": "https://www.cnbc.com/2025/03/24/fbi-tesla-elon-musk-task-force-threats-trump-doge.html",
            "upvotes": 1545,
            "date": "03/24/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118254-1742392318191-gettyimages-2205773069-em043847_2025031824339609.jpeg?v=1742844317&w=1920&h=1080",
            "top_comments": [
                "It's like that clip from the Simpsons where an FBI agent goes running past a bunch of doors like \"Joint Terrorism Taskforce\" and \"Hostage Negotiation\" to arrive at this huge elaborate set of doors marked \"Movie Piracy\". \n\n[https://forgifs.com/gallery/d/223800-3/Simpsons-movie-piracy-FBI-headquarters.gif](https://forgifs.com/gallery/d/223800-3/Simpsons-movie-piracy-FBI-headquarters.gif)",
                "If only they do as much for school children under the threats of gun violence.",
                "This waste of money, time, and energy is brought to you by DOGE",
                "Rent-a-cops for a car salesman.",
                "They will just find insurance fraud.",
                "The FBI is more concerned with protecting Elmo’s wealth than they are with the lives of kids getting shot at schools.",
                "A government task force to protect a private business.\n\nWe are really living in the bizarro world.",
                "So…not to human trafficking, drugs, child exploitation…a gazillion other more important matters….no, Teslas. Fucken Teslas. \n\nWhat kind of fascist nightmare are we in?",
                "serious question, is there a task force for school shootings??",
                "This sounds like waste, fraud, and abuse to me"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Bumble Bee sued by deep-sea crew who say they were forced into ‘fishing boat slavery’",
            "external_url": "https://www.cnn.com/2025/03/21/business/bumble-bee-forced-labor-fishing-lawsuit-intl-hnk/index.html",
            "upvotes": 3339,
            "date": "03/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/greenpeace-2.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> Last year, Bumble Bee agreed to remove claims of a “fair and safe supply chain” and “fair and responsible working conditions” from its website, social media and other advertising as part of a settlement with Global Labor Justice-International Labor Rights Forum. \n\n\"Oh my god, he admit it!\"",
                "I remember reading how bad it was in shrimp fishing side but its kinda obvious its more wide spread in fishing industry.\n\nOrganised crime is deep in agriculture and fishing and people with debts or just trafficked get caught up in it. Larger companies dont care or turned blind eye to their suppliers or where they get their catch. The scale of demand makes it easier too. If theres money to be made it’s corrupt easily with no oversight\n\nEvery country is one civil war or collapse away to having its population picked off by slavers when fleeing borders",
                "Sadly, [this isn't new](https://www.npr.org/2016/09/13/493801034/ap-report-exposes-slave-like-conditions-on-hawaii-fishing-fleets). The US [fought a war](https://www.archives.gov/publications/prologue/2012/summer/1812-impressment.html) over it as a matter of fact.",
                "Yikes. It’s dolphin safe but not fisherman safe. ",
                "\"Pardon me, your slavery is showing. Bumble Bee tuna!\"",
                "What the fuck. Well no reason to buy their brand ever again, fucking slavers.",
                "It's insane that, at most, Bumble Bee will face *civil* penalties. They turned a blind eye to criminal acts.",
                "But line on index funds must go up.",
                "Shrimp is another big one. I recall seeing a documentary on slave vessels for shrimp. Migrants in south east Asia get kidnapped and you either slave away or get beaten or thrown overboard.",
                "Yeah the huge industrial scale of slavery in the global fishing industry, the conditions that the men are kept in, and the sickeningly high mortality rate have been known for a long time. The problem is getting anyone to care, because they're men, and because they're not white."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Turkey announces 1,133 arrests have been made in relation to protests.",
            "external_url": "https://www.bbc.co.uk/news/live/cq6yde479gdt?post=asset%3Ae185b269-c225-4fbc-802f-6746e2130039#post",
            "upvotes": 1412,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e839/live/bec7c780-08d7-11f0-97d3-37df2b293ed1.jpg",
            "top_comments": [
                "How long until these headlines are about USA?",
                "Is it coup season in Turkey already?",
                "\" . . . Arrests have been made in ~~relation to protests~~. Fascist Crackdown.",
                "wtf has happened in the comments?",
                "But they gave us eggs! Can't be that bad /s",
                "Shall we… applaud? 👏\n\nOk that’s enough\n\nEdit: it was one Applaus for the government with an /s… not as obvious as I thought."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Airlines threaten Heathrow with legal action",
            "external_url": "https://news.sky.com/story/airlines-threaten-heathrow-with-legal-action-13335133",
            "upvotes": 271,
            "date": "03/24/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-heathrow-plane_6865974.jpg?20250324184037",
            "top_comments": [
                "TL;DR: Airlines want money for time they couldn't fly during a fire at the airport.",
                "This seems odd because the fire wasn't at the airport- it was at a large electrical substation that also served surrounding businesses and homes.  \n\nHeathrow really is a victim here not a cause.",
                "Do people not understand how legal stuff works? They have to sue the airport for the airports insurance to kick in. When the doctor fucks up you sue the doctor and then their malpractice insurance kicks in. That’s just the way things are done.",
                "I hope the airport tells them, “sorry, you’re SOL—we’re calling it an ‘Act of God.’” 🤷‍♀️",
                "I hate airlines as much as anyone but they paid for a time slot they did not receive. Why aren't they being refunded?",
                "Heathrow should be liable to the airlines, per their contractual agreement to provide a service/slot. And Heathrow should have insurance to cover instances like this. \n\nThat’s the way the world works."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Grieving husband says \"reckless\" Texas abortion law led to pregnant wife's death",
            "external_url": "https://www.cbsnews.com/news/grieving-husband-says-reckless-texas-abortion-law-led-to-pregnant-wifes-death/",
            "upvotes": 26132,
            "date": "03/24/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/18/af216be8-5956-4f63-b8b7-9e8dc966d779/thumbnail/1200x630/9ae58c7fddc98f25eeb31368aff35331/shamlian-eoa-tx-abortion-en031825-consolidated-01-frame-229.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "The national rate for maternal mortality went up 11%?! What the hell?",
                "He's right.\n\n\nBut JD Vance wants you to forget about your beloved dead wife, get a new one (so you won't be one of those icky single people), and breed breed breed.",
                "Man, if only we had a [historical record](https://foreignpolicy.com/2019/05/16/what-actually-happens-when-a-country-bans-abortion-romania-alabama/) of what happens when you [ban abortion](https://en.wikipedia.org/wiki/Death_of_Savita_Halappanavar), then perhaps we would have known that the Supreme Court put a gun to the heads of so many pregnant women on June 24, 2022 and that an appropriate response is necessary.",
                "And people actually voted for this to be implemented. Speechless",
                "Welcome to American Christian nationalist laws",
                "Republicans will bend over backwards to make excuses for this and try to say it was the doctors’ fault instead of the law. But they know deep down this is what they wanted and they don’t care about the women who have to lose their lives for it.",
                ">Between 2019 and 2022, the (maternal mortality) rate increased by 56% after the state outlawed abortions, according to Gender Equity Policy Institute. During the same period, the rate increased by just 11% on a national scale.\n\nThis is exactly what EVERYONE with a brain and a conscience said would happen.",
                "I hope the birth rate plummets",
                "It’s what every Republican voter wanted, or they wouldn’t have supported it.",
                "This is the reason my only daughters got their tubes tied. They’re very scared of complications. I had major complications and it would of been a death sentence in states like Texas. \n\nThis should’ve never happened. It’s infuriating this happens in America."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Woman says United Airlines crew tried to make her remove son's ventilator",
            "external_url": "https://www.nbcnews.com/news/us-news/woman-united-airlines-crew-tried-make-remove-sons-ventilator-rcna197695",
            "upvotes": 10274,
            "date": "03/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-01/250108-united-airlines-ch-1424-5c7329.jpg",
            "top_comments": [
                "> United said it has contacted Sotomayor \"to address her concerns and apologized for any frustration she may have experienced.\" The airline did not provide further details.\n\n\n> Sotomayor told NBC...the airline’s apology “was not sincere.”\n\n\nObviously, because that wasn't a real apology.  \"I'm sorry you felt bad\" is not an acknowledgement of any wrongdoing.  \n\n\nThat said, they have to know they are toast if they are sued over this so maybe not admitting wrongdoing is part of their litigation damage control.  She even went the extra mile \"she shared the documentation with the airline before the trip and that the airline cleared her son's medical equipment with no problem.\"  Combine that with the flight attendants providing B.S. medical advice that the son would \"be OK until we're in the air at a high enough altitude.\"  This whole incident stinks.",
                "United Airlines 🤜🤛 United Healthcare\n\n\"One way or another that two-year old has to go.\"",
                "This is actually nuts. The whole plane crew working together really trying to kill that kid",
                "My baseline for United customer service is \"better or worse than beating up a doctor and dragging him off the plane?\"",
                "Ma'am, he'll need that to live.",
                "Sounds like the flight attendants need to attend a little training course.",
                "Wow. It’s a trach tube not an earring. Thank God the mom stuck to her documentation and did not take away her son’s lifeline until they got to cruising altitude.",
                "So many of these crazy stories come from United Airlines",
                "I’m just thinking about that poor child just trying to survive the flight and the audacity of an airline attendant to suggest he would be ok without oxygen is insane. Hopefully she makes millions in her lawsuit and have plenty of funds to take care of herself and her child.",
                "It’s not even remotely the same, but when our son was two - we were taking him on a flight in his airline approved car seat. \n\nThe flight attendant demanded we remove him from the car seat before take off. We argued it was literally the safest place for him and provided the documents that it was approved - and she still threatened to kick us off.\n\nIt’s like these flight attendants are being trained to be the most self righteous cunts possible."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Three men found guilty of plotting to murder £54m Securitas robber Paul Allen",
            "external_url": "https://news.sky.com/story/three-guilty-of-plot-to-murder-54m-securitas-heist-gang-member-13330360",
            "upvotes": 443,
            "date": "03/24/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-paul-allen-securitas_6858758.jpg?20250316161011",
            "top_comments": [
                "Let’s see Paul Allen’s card",
                "I'm left speculating about what the motive was here. Where is the £54M now? Was the attempted hit related to that or some other job they crossed paths over?",
                "These all read like a movie plot",
                "Try getting a reservation at Dorsia now you stupid fucking bastard",
                "But I had dinner with Paul Allen in London.",
                "Does this Paul Allen like Huey Lewis and The News?",
                "Try getting a reservation at Dorsia now you stupid fucking bastards!",
                "I came to see if people were referencing the movie. Reddit does not disappoint.",
                "Linen textured business cards cited as motive for hit.",
                "You like huey Lewis and the news?"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "South Korean court overturns impeachment of Prime Minister Han, reinstating him as acting president",
            "external_url": "https://apnews.com/article/south-korea-impeachment-han-ducksoo-20daed0fb3c90c02ca229c977d230b06",
            "upvotes": 5690,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This guy isn't Yoon (The president who started the Martial Law Order), he is up for sentencing next. If he doesn't get impeached, then shit will go down.",
                "Context on the quorum bit, since AP doesn’t provide it - Korea’s national assembly has 300 seats. A simple majority is enough to impeach most officials, but a 2/3 majority is required to impeach the president. It was (and maybe still is) an open question what the requirement was to impeach an acting president - 151 because he is the prime minister, or 200 because he is (acting) president? Apparently some of the justices think it’s the latter, (edit) but it seems like the majority ruled that it’s 151.\n\nThis feels like it was the weakest of the cases, for what it’s worth. He was consistently saying he was against the martial law, and it seems like they failed to prove he was actually involved with it.",
                ">On Monday, seven of the court’s eight justices overturned or dismissed Han’s impeachment. They ruled the accusations against him weren’t against the law or weren’t serious enough to remove him from office or his impeachment motion didn’t even meet a required quorum when it passed through the assembly.\n\nNot having a quorum seems sketchy. The other parts of South Korean law, I can't comment on.",
                "The amount of people who are r/confidentlyincorrect here is astonishing...",
                "If you didn't read the article before commenting, you're part of the problem.",
                "Not the guy most people are assuming, but very interesting that the court can overturn an impeachment.",
                "Wow the world is going crazy",
                "[removed]",
                "So I don't know a l9t about the court system in Korea. Is this outrageous, or is this something that sometimes happens?",
                "TIL that South Korea has both a PM and a President"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Top US officials appeared to message a journalist Houthi strike plans",
            "external_url": "https://www.bbc.com/news/articles/cy4v3ndg28jo",
            "upvotes": 172,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/9379/live/b4019cf0-08db-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                ">Jeffrey Goldberg, editor-in-chief of The Atlantic, [reported](https://www.theatlantic.com/politics/archive/2025/03/trump-administration-accidentally-texted-me-its-war-plans/682151) on Monday that he was added to a Signal message group which included accounts labelled as White House National Security Adviser Michael Waltz and Vice-President JD Vance.\n\nWhy are updates on military operations being communicated over Signal rather than secure DoD communications?\n\nEdit:  \nAnyone who remotely (and rightfully) criticized Hillary Clinton for using her own Email server should be furious about this news story.",
                "Old whiskey finger hegseth at it again. To be fair, when you’re that drunk, names just blur together in your phone. ",
                "The defense department has [confirmed.](https://abcnews.go.com/Politics/trump-officials-accidentally-shared-yemen-war-plans-group/story?id=120106043)\n\n\nInsane",
                "Not appeared, they DID message a journalist by mistake on their group text chain discussing war plans.",
                "Thank you, Trump voters, for enabling these many opportunities to see that your people are as embarrassing behind closed doors as they are publicly. \n\n\nIt's going to take decades to recover from just the past 2 months.  Pretty much an entire term to go.",
                "Anyone have odds that the administration tries to blame the journalist?",
                "How about the DEI (Drunk Executive Idiots)!?",
                "Anyone who allowed this man to be confirmed is complicit in my book",
                "Yes, Hegseth accidentally included the Editor of The Atlantic on a Signal chat.",
                "No way he was added by accident. The fucking editor-in-chief?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Oscar-winning Palestinian director is attacked by Jewish settlers and detained, activists say",
            "external_url": "https://apnews.com/article/no-other-land-oscar-israel-palestinians-084c63f33e748a3279646759e9b705c2",
            "upvotes": 132,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*“No Other Land,” which won the Oscar this year for best documentary,* [*chronicles the struggle*](https://apnews.com/article/no-other-land-oscar-win-palestinians-3c70e4ea1e7b213849f192dab5620a4c) *by residents of Masafer Yatta to stop the Israeli military from demolishing their villages. It has two Palestinian co-directors, Ballal and Basel Adra, both residents of Masafar Yatta, and two Israeli directors, Yuval Abraham and Rachel Szor.*\n\nThis was a joint Palestinian-Israeli production. Leave it to the expansionist settler thugs to try to sever any connection between Israel and the Palestinians.",
                "The IDF be like, 'can't have another one of these documentaries coming out.'\n\nIsrael does its best to bury the truth about its actions because they know how heinous they actually are. The fucked up reality is that the IDF makes Hamas look like a charity organization.",
                "I’m shocked beyond words. /s\n\nZionism is a disease upon the Earth.",
                "I'm starting to think these Israelis aren't good people.",
                "Jewish settlers or Israeli settlers? Seems to be an important editorialized issue on the title there",
                "The part they cut from the Oscar-winning “Israeli” film\nThe film calls this “rampages and threats on villages.” In reality? Staged clashes and soldier harassment.\nThe No Other Land filmmakers left out this Hebron Council footage—but it says it all.\n\nhttps://x.com/GAZAWOOD1/status/1897275319796867371?t=lnaQuW7nU8xt60UnckFrKA&s=19"
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "03/24/2025 20:08:31 UTC"
}