{
    "posts": [
        {
            "category": "HOT",
            "title": "Two German Teens who Didn’t Have a Hotel Booked were Detained by ICE Officials in Hawaii",
            "external_url": "https://beatofhawaii.com/why-these-hawaii-travelers-were-jailed-and-deported/",
            "upvotes": 17137,
            "date": "04/21/2025",
            "thumbnail": "https://beatofhawaii.com/wp-content/uploads/2025/04/1000005785.jpg",
            "top_comments": [
                "Why is a strip search necessary after a full body scan?\n\n\nI ask fully knowing the answer.",
                "Before the madness of this current admin, they just didn’t let you in. That’s all. Back in the 2000s, we were picking up a travel athlete from Slovenia who didn’t have a return ticket. He was held by CBP in the airport until he bought one. That’s all that happened. They released him as soon as he had the ticket. He wasn’t deported.",
                "Our travel sector is gonna be killed by these clowns.",
                "It is my understanding they were also strip searched, jailed overnight, and deported to Japan",
                "When will this madness stop?",
                "The issue isn't that they were questioned, detained and then flown overseas. If they were had been treated courteously and professionally, as you expect from a supposed first world country, this wouldn't have been newsworthy. Its how they were treated. Instead they were treated like this:\n\n>\"After hours of questioning at Honolulu Airport, they said they were placed in handcuffs, loaded into a transport vehicle, and brought to what they later learned was a deportation detention facility.\"\n\n>\"There, they reported being subjected to full-body scans, strip searches, and issued green prison uniforms. They were placed in a holding cell overnight alongside long-term detainees, including individuals accused of serious crimes.\"\n\n>\"Conditions described included sleeping on thin, moldy mattresses, using rudimentary toilets, and being warned by guards to avoid expired food.\"",
                "So is the goal to shatter any tourism driven industries?",
                "I was detained for a few hours at LAX because the guy wouldn't let me show him my return ticket on my phone. It had to be a paper ticket. I didn't have a paper ticket because I flew with an airline that lets you use their app instead.\n\nWhen I finally got interviewed in the holding pen and explained the guy at the main desk wouldn't let me show him the ticket on my phone, the next guy just rolled his eyes and let me go.",
                "I posted this in another sub when someone asked why/how their accommodations were deemed insufficient, copying and pasting here. I should also note their planned trip was for 5 weeks between Hawai’i and California if that matters for anyone. Also, please remember I was answering a question about why the lodging was considered insufficient and how that led to deportation, not defending the policy and actions: \n\nI live in Hawai’i and the backpackers posted their side of the story on Reddit (available in the backpackers sub). \n\nBasically they only booked for a few days out of their planned trip, with the intention of booking additional as needed. However, they didn’t have the funds on them or something (it’s not clear, they were just asked about how they were going to pay) and when asked how they’ll cover the expense they said they work through virtual employment internationally. They also didn’t have a return flight/connecting flights within the US booked, but they did have an onward flight to Asia booked. \n\nThis flagged them as coming to the country to work illegally and they were deported as a result.\n\nNot defending them being deported or how they were deported but they weren’t aware how strict immigration is for the US and due to their more relaxed travel style in terms of planning, they accidentally answered wrongly (but honestly) in all the wrong places when asked. Even the German consulate got involved but I’m unsure what degree that plays in anything.\n\nThey were sent to Japan instead of Germany because I believe they requested it.",
                "The United States of America is not safe.\n\n\nDo not come here.\n\n\nDon't let them fool you. There's nothing you can do, and you might be shipped off to a prison without due process. You might get sick or hurt and wind up losing everything you own. You might just die.\n\n\nDon't come to America.\n\n\nIt's not safe here."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Defense chief Hegseth shared war plans in second Signal chat, NYT reports",
            "external_url": "https://www.reuters.com/world/us/defense-chief-hegseth-shared-war-plans-second-signal-chat-nyt-reports-2025-04-20",
            "upvotes": 30659,
            "date": "04/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "LOL the NYT article says 4 of 12 people in the chat have ratted him out so far.",
                "Insane this man still has a job …signal gate part 2 is now out ……republicans won’t do ANYTHING",
                "Very interested how his wife and brother were considered to have “need to know” of military intelligence. Not to mention that this is demonstrating a clear pattern that these guys are routinely using unsecured communications to share classified information.\n\nIf this doesn’t get this idiot fired nothing will.",
                "I’m a cleared worker. My entire career revolves around what to do and not to do while having a clearance. If I did this, I’d not only lose my career but I’d be jailed for treason.",
                ">Pete Hegseth shared details of a March attack on Yemen's Iran-aligned Houthis in a message group that included his wife, brother and personal lawyer,\n\nRepublicans win by convincing Americans running the government should be like the Williams family in Bridgeport Nebraska, sitting at a kitchen table, budgeting only what they put into the Bank of Shoebox Under the Bed.\n\nCommon sense family governing.",
                "Sir, a second group chat has hit the pentagon",
                "SECOND Signal chat?  Wtf?! Are the secure communications channels that our tax dollars pay for not good enough, Republicans? You have to go out of your way to compromise our ridiculously expensive security?!",
                "“I know what I am doing”",
                "MAGA – Morons Are Governing America",
                "So like, you know lets pretend for a second that we give this jackass a second chance to stop fucking up so badly for 5 fucking seconds. \n\n\n\nHow the fuck are Republicans in congress up in arms about Hilary's emails, but see no problem with this guy getting caught, not changing his behavior, and then doubling down on his fucking idiocy. \n\n\n\n\nThese fucks all deserve the boot, if not jail time. Fuck em all, hypocritical fuckheads."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "China sends back new Boeing jet made too expensive by tariffs",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/21/china-returns-boeing-737-jet-us-too-expensive-tariffs",
            "upvotes": 3869,
            "date": "04/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/227200971586a3853a06dc29b6592e9d5ec7fbcb/0_101_1658_995/master/1658.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cee2dfd476d3330ba13839c27da81ef6",
            "top_comments": [
                "What's fucking crazy to me is tariffs apply on orders already made.... Planes, or board games, doesn't matter, you get fucked",
                "Did they check the back or bottom of the receipt for the return policy",
                "On the upside, I got to leave Hong Kong on Friday with half the junk my in-laws gave us left behind since the HKPO decided it was going to deal with US for a bit. Downside, I'm sure management at Boeing will use this as an excuse to can more engineers that have ever dared to bring up concerns to management. Or get rid of some suppliers. Regardless my local economy is going to take a hit.",
                "Boeing Tech here, this is bad, like really fuckin bad. Billions of dollars of China bound planes just sitting waiting for delivery is going to stack up quick. Boeing doesn't get the final check until it tickets.",
                "I wonder if those “I did that” stickers come in plane-size?",
                "It has always been funny to me how people type “If it’s it not made in America, I don’t want it” from their (non) American-made smart phone or laptop.",
                "Boeing has to be angry. And we know what happens to people who make Boeing angry..",
                "I flew on Xiamen airlines out of Xiamen island in 2018. I thought it was a really good airline with good economy class accommodations. Sucks to hear tariffs causing this headache.",
                ">(She wrote upon it)  \nReturn to sender, address unknown  \nNo such person, no such zone\n\n\\- Elvis Presley \"[Return To Sender](https://www.youtube.com/watch?v=-Ml1_SLU6x4)\"",
                "is this more \"Art of The Deal \" 5d chess by trump?"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "US citizen wrongfully arrested by border patrol in Arizona held for nearly 10 days | US immigration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/20/us-citizen-jose-hermosillo-border-patrol",
            "upvotes": 1364,
            "date": "04/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/cbfef30392575583987696eeaa4fc2095a168dc7/0_407_6500_3902/master/6500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=777eb2c63672ae9ad29d3e3a28ea5d41",
            "top_comments": [
                "Notice the recurring theme of how the border cops always lie to the court and say that the US citizen confessed to them (with zero evidence) to being an illegal immigrant? \n\n“According to a border patrol criminal complaint, on 8 April, a border patrol official found Hermosillo “without the proper immigration documents” and claimed that the young American had admitted entering the US illegally from Mexico. Two days later, the federal court document notes that Hermosillo continued to claim he was a US citizen. On 17 April, a federal judge dismissed his case.”",
                "This is the 2nd incident of a US citizen being detained. Another US citizen in Florida was detained last week",
                "Yesterday NBC published an article on what to do if you’re a US citizen detained by ICE. Unbelievable that this is happening, and how fast we’ve fallen.\n\nhttps://www.nbcnews.com/news/us-news/us-citizens-email-notice-to-deport-rcna201862",
                "Nothing in America takes 10 days.  They knew after an hour, maybe two.  The other 238 hours were because they didn't like him.",
                "Trump's personal gestapo. There's a reason organizations like border patrol, corrections and homeland security were deployed to Portland during the George Floyd protests. This isn't trump 1.0 with the Drumpf jokes, Rudy's hair peeling off and the four seasons landscaping fiasco. This is organized. They've got a plan and they're putting it into motion. Who knows where this will end.",
                "These ICE agents must have been vetted by Trump staff? Why are they so dumb? Even MTG is smarter.",
                "This BP agent needs to get investigated for lying on the criminal complaint.",
                "One wonders if the US border patrol and ICE are now manned by total idiots or at minimum, being supervised and directed by such.",
                "“…married to a US citizen… arrested after his visa was secretly revoked…”\n\nGee that’s not ominous AT ALL. 🫠",
                "They made a movie about this in 1987. Born In East LA."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Pope Francis has died, Vatican says in video statement",
            "external_url": "https://www.reuters.com/world/pope-francis-has-died-vatican-says-video-statement-2025-04-21/",
            "upvotes": 541,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Meeting Vance was the last nail in his coffin",
                "I hope the next pope is as kind and generous as this one was, we need it right now.",
                "\"Pope dies after meeting Vice Anti-Christ\"",
                "Immediately dying seems like a pretty reasonable response to having to meet JD Vance",
                "Damn, at least he lived to see one last Easter.  Rest in peace big guy.",
                "Well, they Eastered him to death.",
                "Died on Easter, don’t know if there was any better day to go, also JD Vance’s meeting probably killed him from stress you can’t convince me otherwise\nEdit: *Easter Monday \nAlso In Pope We Hoped",
                "Damn JD Vance killed him.",
                "Hope he went peacefully, and I hope the transition to the next pope goes smooth as well.",
                "Imagine your last meeting was with JD fucking Vance 💀"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "El Salvador offers Venezuela prisoner swap involving US deportees",
            "external_url": "https://www.bbc.com/news/articles/cn5xl5ppzr2o",
            "upvotes": 1024,
            "date": "04/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d21e/live/4b500ad0-1e4c-11f0-86e6-e13957bc23df.png",
            "top_comments": [
                "So they can send people to Venezuela, but not the US? Right...",
                "Basically. The US paid Bukele to take over 200 Venezuelan criminals(tbd). Now Bukele gets to keep this money and extort more from Venezuela. Trump really handed over hundreds of people to a human trafficker. What a joke.",
                "What in the fuck is this timeline",
                "Is this slave trading?",
                "If they move the prisoners enough, they'll be easier to disappear.",
                "So America snatches people of the streets, pays private prison storage to detain them, pays El Salvador to imprison them and then El Salvador can use them a bargaining chips?",
                "Are these Venezuelan refugees/migrants now being sent back to Venezuela? Maduro: “Oh so you went USA as a refugee saying we ‘oppressed’ you huh? You gone learn about oppression now boi.” They’ll be tortured and buried in unmarked graves I suspect.",
                "If you could travel back to 2000 and tell everyone this is where the US would be in 25 years people would think you were crazy.",
                "The legal argument that if you are deported from the US and the country you send them to is going to traffic them for political favors is going to end up getting a lot of people asylum status.",
                "So he can get them out?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "‘Professional failures’ led to killing of Palestinian medics in Gaza, says Israeli military",
            "external_url": "https://www.cnn.com/2025/04/20/middleeast/israeli-military-professional-failures-gaza-medics-intl",
            "upvotes": 3864,
            "date": "04/20/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25110487425158.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Because it has to be right? Targeting medics is a war crime. Not that the USA would let any charges from the ICJ actually have any effect\n\nEdit: The ICC already issued arrest warrants and trump invites Netanyahu to the oval. The ICJ has no enforcement capabilities, that goes to the UN and the USA has veto power there. Just for clarity",
                "\"Oops. Not really, though.\" - Israel",
                "I'm sure the IDF must have an office of euphemisms by now.  This was not a professional failure; they murdered medics (a war crime), then buried them in a mass grave, and then \"lied to their command\" about what happened.  Now I'm not sure about that last part.  I'm pretty sure IDF command would have approved of this war crime anyway.",
                "What the fuck? Breaches of orders, blatant lies afterwards and they claim everything the soldiers did was actually fine?\n\nAlso what is with the repeated false statements getting a pass? Its not plausible they did not notice the flashing lights. If they didn't do anything wrong why crush the vehicles or lie about the incident?\n\nFinally if they let their soldiers breach orders but escape punishment when that breach kills medic, the actual message is clear: killing medics is okay with the leadership.",
                "So it’s either their Hamas members or its “professional failures”, awfully convenient.",
                "It's wild seeing a military admit its rules of engagement are looser than an American cop's requisites to use their guns",
                "professional failure is the buzz for for 'war crime' you guys committed a war crime and just admitted to it. if you claim to be the good guys, what do you do? I mean YOU committed the war crime.",
                "This was on video. Imagine what's happening that is not recorded",
                ">Professional failures\n\nMore accurately stated as; 'Murderous intent'.",
                "So…\nIsrael kills women\n\nIsrael kills children\n\nIsrael kills non-combatants \n\nIsrael kills Unrwa workers\n\nIsrael kills AMERICAN CITIZENS in the west bank\n\nIsrael kills culinary aid workers\n\nIsrael kills doctors and medics\n\nIsrael kills journalists\n\nIsrael bombs hospitals\n\nIsrael bombs refugee camps\n\nIsrael denies aid to enter Gaza\n\nIsrael denies food to enter Gaza\n\nIsrael violated the terms of its ceasefire over 700 times\n\nIsrael pays congresspeople in the US to keep their mouths shut\n\nAnd the latest batch of mass killings that they orchestrate is a professional failure? \n\nIf anyone is still believing Israel’s lies in this day and age, especially when online Gazans are creating daily testimonials of how Israel killed their families and ruined their lives, then they need to wake up.\n\nAnd if you don’t believe this incident even happened like ive heard some people don’t, please watch the video provided by the new york times that was recovered from one of the phones of the dead medics in the mass grave that the idf soldiers dumped the bodies in. It’s heartbreaking."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Germany seeks to deport an American and 3 EU citizens after pro-Palestinian protest",
            "external_url": "https://www.npr.org/2025/04/20/g-s1-60984/germany-deportation-protesters",
            "upvotes": 2005,
            "date": "04/20/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8192x4608+0+428/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd7%2F39%2F26354b464ed99275854148e9d511%2Fgettyimages-2208965544.jpg",
            "top_comments": [
                "Wait, can Germany deport EU citizens? Germany is part of EU, right?",
                "Reading the article, it seems to be because of property damage to the university rather than just because of protesting. It looks like they'll all be allowed to stay while they appeal the deportations.",
                "Why is no one ever questioning the concept of staatsräson in the political sphere? Am I going insane or has everyone lost their minds? It's literally just a statement by Merkel, WHY ON EARTH is everyone treating it as a constitutional principle. \n\nI don't even have a strong opinion on israel palestine, but it absolutely scares me how people only use a principled way of arguing when it suits them. It is mind boggling and endemic among all kinds of political strides.",
                ">While Berlin authorities cite criminal proceedings against them, their lawyer Gorski says none have any criminal convictions and haven't been given court dates or other information about the charges against them.  \n...  \nThe second letter sent to Murray cites the concept of [*Staatsräson*](https://www.dw.com/en/israel-and-germanys-reason-of-state-its-complicated/a-67094861) as part of the grounds for the deportation.\n\n>The letter says, \"The right of Israel to exist, its protection, and the integrity of the State of Israel are matters of German state policy\" and that this is \"especially significant given Germany's historical responsibility toward Jewish people in its federal territory and in the State of Israel.\"\n\n>It adds that \"at no time — whether domestically or abroad — should there be any doubt that opposing movements within Germany will be tolerated in any way.\"\n\n>Gorski says this is the first time he's seen the idea used to justify deportation.\n\n>\"It's highly troubling because the *Staatsräson*, meaning the unconditional solidarity of Germany with the Israeli state, is not a legal concept, it's a political concept,\" Gorski says.\n\n\n\nGermany is a weird country",
                "Just going to bury thr lead i guess.  They're not being deported for protesting, they're being deported for masking up, entering a university building and vandalizing the place.",
                "Making it a trend, are we?",
                "In case anyone gets the wrong idea from this one instance, I would note that protest against Israeli actions is legal in Germany. I saw a huge pro-Palestinian demonstration at Alexanderplatz in Berlin last Sunday with the banner \"One Genocide Does Not Justify Another.\"\n   \nWhile Germany's relationship with both anti-Semitism and violent protest is obviously complicated by its history, Germany is also a place where strong protections for free speech and peaceful assembly exist.\n  \nThese deportations are notable because they are a deviation from the norm.",
                "The Berlin chief of police warned Jewish and LGBT people from going into certain neighbourhoods due to violence against them. \n\nPerhaps they had reason to look into these people. Not all protestors are peaceful or with goodwill.",
                "The basic concept that when u go to another country, you should behave and not break things or break the local laws....its like large numbers of people don't actually believe  this and think that they can what they want.\n\nWe should deport more troublemakers when we can",
                "In an email to NPR, a spokesperson for the Berlin Immigration Office, Marcus Jähnke, confirmed it had revoked the residence permits of four \"pro-Palestinian activists\" and this was \"in connection with a pro-Palestinian protest\" where \"masked individuals\" entered a university building and caused \"property damage including graffiti.\"\n\n\nSo... committing crimes?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Man arrested after being found in 9-year-old’s bedroom",
            "external_url": "https://www.wsfa.com/2025/04/12/man-arrested-after-being-found-9-year-olds-bedroom/?utm_source=taboola&utm_medium=organicclicks",
            "upvotes": 11780,
            "date": "04/20/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/QENTVOPCFVCAVCLJETXZUTU4BM.jpg?auth=e2b703a51635834b578a9ac1b1e43c64543e84a891731071f9764323ba4a6401&width=1200&height=600&smart=true",
            "top_comments": [
                ">According to court records in Jackson County, 42-year-old Robert McDowell III has been charged with felony first-degree burglary...\n\nMaybe he was just a burglar who quickly hid in the nearest room\n\n> ...and two counts of possession of child pornography.\n\nOh.",
                "Authorities reported the girl’s father then grabbed McDowell and hit him several times while his wife called police.",
                "How do you go back to life after this? I felt violated when thieves hang out in my car for 10minutes, let alone my kids room being creeps.",
                "The fact they found kiddie porn on the guys phone is terrifying. God knows what he could have done to that kid.",
                "That father showed more restraint than most of us would. Unthinkable situation — he did exactly what a parent should.",
                "The fact that he made it into a child’s bedroom is terrifying. Props to the dad for stepping in fast, but honestly, this man should never see freedom again. Some things are just unforgivable.",
                "This dude was also found to have csam on his phone. I hope the jury throws the book at him when he's tried.",
                "\"Burglars\" who knowingly enter an occupied house aren't just burglars. Most burglars burgle during the day, when the homeowners are away because they're less likely to get caught or shot.",
                "For him to know there was a 9 year old girl in the house tells me he saw her at one point and decided to do this. Which brings in premeditation.\n\nThrow the book at the creep.",
                "As always, FOX News and MAGA will scream about Trans while these creeps are the ones in your kids bedroom-schools-churches"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "Chinese executive linked to Bangkok building collapse arrested",
            "external_url": "https://www.ctvnews.ca/world/article/chinese-executive-linked-to-bangkok-building-collapse-arrested/",
            "upvotes": 1923,
            "date": "04/20/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/3QSXNATHWOIBSBLR6EB6W7ZUAE.jpg?smart=true&auth=470978b9815b6ed72e6915b2efe2b2538b2819409d5ac2c8d6e2c860bc74875a&width=1200&height=630",
            "top_comments": [
                "Good. I'm Chinese. It's good. Fuck these national corporation.",
                "We should be doing this in the US.",
                "Wait, you mean they don't just step down from their position with a 60 million dollar bonus?",
                "*Substandard metal, fake signatures, bid rigging.* All worrying in light of stories we've heard that the abandoned Oceanwide Plaza towers in Downtown Los Angeles, a Chinese funded project halted due to claimed bankruptcy, were not properly built and cannot be finished.",
                "Is this the same building collapse that was censored from Chinese media because, you know, Chinese national pride is too fragile to risk telling the truth?",
                "I was wondering about that building figured it had to do with the fact that it was still under construction didn’t think it should have been able to survive that type of earth quake while not even completely built ",
                "[deleted]",
                "I'd be more impressed if it was a Thai executive, or that the arrest of the Chinese exec had happened in China. You know, when it wasn't an easy domestic political win.\n\n\nBut still better than nothing I guess..."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Ukraine reports Russian drone attacks after 'Easter truce' ends",
            "external_url": "https://www.bbc.com/news/live/c89g8jylk5xt",
            "upvotes": 1,
            "date": "04/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3f94/live/55aa6550-1e76-11f0-b1b3-7358f8d35a35.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Pope Francis, head of Catholic Church, dead aged 88",
            "external_url": "https://www.news.com.au/world/europe/pope-francis-head-of-catholic-church-dead-aged-88/news-story/b15a0ab99ce5c7faeda4d8ec79311907",
            "upvotes": 25,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "He was a good one, definitely the best in my lifetime.\nDoubtful there will be a replacement anywhere as close to the actual teachings of Jesus.\n\nAnd I haven't gone to mass in 20 years.",
                "Now is my chance fellow redditors, expect some white smoke soon!",
                "The People's Pope is no more.",
                "Meets with J.D Vance, dies the next day"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Pope Francis has died, Vatican says.",
            "external_url": "https://www.cnn.com/2025/04/21/europe/pope-francis-dies-intl/index.html?Date=20250421&Profile=cnnbrk",
            "upvotes": 33,
            "date": "04/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/230607172558-02-pope-francis-lead-2022.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Pope Francis dies",
            "external_url": "https://www.bbc.co.uk/news",
            "upvotes": 10,
            "date": "04/21/2025",
            "thumbnail": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png",
            "top_comments": [
                "I hate to say this, but lately, it seems the world grows darker each passing day.",
                "Seemed like a decent man."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Pope Francis has died, Vatican says",
            "external_url": "https://www.cnn.com/2025/04/21/europe/pope-francis-dies-intl/index.html",
            "upvotes": 73,
            "date": "04/21/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/230607172558-02-pope-francis-lead-2022.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Vance was in the Vatican yesterday…..",
                "I liked Pope Francis and I’m not a practicing Catholic.  He’s been the most Jesus-like of any Pope that I recall.",
                "JD Vance was the last person to see him. Coincidence?",
                "He had health issues for a while now. I hope his last moments weren’t in pain.",
                "RIP. You had a good heart.",
                "Guess sending his Cardinal to lecture JD Vance was his mic drop before peacing out\n\nHere's hoping the next guy isn't a giant step backwards 🤞",
                "Jesus rises, pope falls",
                "That'll be the J D Vance Effect.",
                "What interacting with JD Vance does to a mf",
                "Dude said yeah, I've had enough of this bs. "
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "The Pope dies on Easter Monday",
            "external_url": "https://www.bbc.co.uk/news/live/crknlnzlrzdt?post=asset%3A9b3daf20-594e-4e1e-8d13-6da2b5de50d0#post",
            "upvotes": 6,
            "date": "04/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cb17/live/a8001000-1e87-11f0-80b3-83959215671c.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Pope Francis dies aged 88, Vatican says",
            "external_url": "https://www.bbc.com/news/live/crknlnzlrzdt",
            "upvotes": 11,
            "date": "04/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cb17/live/a8001000-1e87-11f0-80b3-83959215671c.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Pope Francis dies aged 88",
            "external_url": "https://www.smh.com.au/world/europe/pope-francis-the-head-of-the-catholic-church-dies-aged-88-20231205-p5epa4.html",
            "upvotes": 27,
            "date": "04/21/2025",
            "thumbnail": "https://static.ffx.io/images/$zoom_0.5295%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_87/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/1da04b41ab4a9899db3549cc4fcf55a3e43fac5e",
            "top_comments": [
                "On Easter and right after meeting Vance. What a way to go out"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Pope Francis has died, Vatican says in video statement",
            "external_url": "https://www.reuters.com/world/pope-francis-has-died-vatican-says-video-statement-2025-04-21/",
            "upvotes": 546,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Meeting Vance was the last nail in his coffin",
                "I hope the next pope is as kind and generous as this one was, we need it right now.",
                "\"Pope dies after meeting Vice Anti-Christ\"",
                "Immediately dying seems like a pretty reasonable response to having to meet JD Vance",
                "Damn, at least he lived to see one last Easter.  Rest in peace big guy.",
                "Well, they Eastered him to death.",
                "Died on Easter, don’t know if there was any better day to go, also JD Vance’s meeting probably killed him from stress you can’t convince me otherwise\nEdit: *Easter Monday \nAlso In Pope We Hoped",
                "Damn JD Vance killed him.",
                "Hope he went peacefully, and I hope the transition to the next pope goes smooth as well.",
                "Imagine your last meeting was with JD fucking Vance 💀"
            ],
            "aggregate_sentiment": 43.0
        },
        {
            "category": "NEW",
            "title": "Hegseth shared attack details in second Signal chat, reports say",
            "external_url": "https://www.bbc.com/news/articles/c4g8r701lrno",
            "upvotes": 30,
            "date": "04/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/de2e/live/34e48830-1e73-11f0-b265-abe347419ae3.jpg",
            "top_comments": [
                "Second chat? At this point he’s running the Pentagon like a family group text.",
                "It wasn't me, it was one of my underlings who will be sacrificed and thrown under the bus. While my days are numbered, I still have some value to Donald Trump even though I'm totally and completely over my head.",
                "Wrong guy for the job. My question to him....Are you  drunk?",
                "You can be sure about them using signal chats all the time. Its not an official tool so no freedom of information act and no back ups to see what these guys were doing in case of consequences..",
                "There were no consequences the first time, so of course he was going to do it again 🤦🏻‍♀️",
                "I have greater hope that this will get the smarmy fuck shit-canned only because this is his greatest humiliation of Trump yet."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Pope Francis has died, Vatican says in video statement",
            "external_url": "https://www.reuters.com/world/pope-francis-has-died-vatican-says-video-statement-2025-04-21/",
            "upvotes": 549,
            "date": "04/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Meeting Vance was the last nail in his coffin",
                "I hope the next pope is as kind and generous as this one was, we need it right now.",
                "\"Pope dies after meeting Vice Anti-Christ\"",
                "Immediately dying seems like a pretty reasonable response to having to meet JD Vance",
                "Damn, at least he lived to see one last Easter.  Rest in peace big guy.",
                "Well, they Eastered him to death.",
                "Died on Easter, don’t know if there was any better day to go, also JD Vance’s meeting probably killed him from stress you can’t convince me otherwise\nEdit: *Easter Monday \nAlso In Pope We Hoped",
                "Damn JD Vance killed him.",
                "Hope he went peacefully, and I hope the transition to the next pope goes smooth as well.",
                "Imagine your last meeting was with JD fucking Vance 💀"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "US citizen wrongfully arrested by border patrol in Arizona held for nearly 10 days | US immigration",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/20/us-citizen-jose-hermosillo-border-patrol",
            "upvotes": 1362,
            "date": "04/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/cbfef30392575583987696eeaa4fc2095a168dc7/0_407_6500_3902/master/6500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=777eb2c63672ae9ad29d3e3a28ea5d41",
            "top_comments": [
                "Notice the recurring theme of how the border cops always lie to the court and say that the US citizen confessed to them (with zero evidence) to being an illegal immigrant? \n\n“According to a border patrol criminal complaint, on 8 April, a border patrol official found Hermosillo “without the proper immigration documents” and claimed that the young American had admitted entering the US illegally from Mexico. Two days later, the federal court document notes that Hermosillo continued to claim he was a US citizen. On 17 April, a federal judge dismissed his case.”",
                "This is the 2nd incident of a US citizen being detained. Another US citizen in Florida was detained last week",
                "Yesterday NBC published an article on what to do if you’re a US citizen detained by ICE. Unbelievable that this is happening, and how fast we’ve fallen.\n\nhttps://www.nbcnews.com/news/us-news/us-citizens-email-notice-to-deport-rcna201862",
                "Nothing in America takes 10 days.  They knew after an hour, maybe two.  The other 238 hours were because they didn't like him.",
                "Trump's personal gestapo. There's a reason organizations like border patrol, corrections and homeland security were deployed to Portland during the George Floyd protests. This isn't trump 1.0 with the Drumpf jokes, Rudy's hair peeling off and the four seasons landscaping fiasco. This is organized. They've got a plan and they're putting it into motion. Who knows where this will end.",
                "These ICE agents must have been vetted by Trump staff? Why are they so dumb? Even MTG is smarter.",
                "This BP agent needs to get investigated for lying on the criminal complaint.",
                "One wonders if the US border patrol and ICE are now manned by total idiots or at minimum, being supervised and directed by such.",
                "“…married to a US citizen… arrested after his visa was secretly revoked…”\n\nGee that’s not ominous AT ALL. 🫠",
                "They made a movie about this in 1987. Born In East LA."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "China sends back new Boeing jet made too expensive by tariffs",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/21/china-returns-boeing-737-jet-us-too-expensive-tariffs",
            "upvotes": 3869,
            "date": "04/21/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/227200971586a3853a06dc29b6592e9d5ec7fbcb/0_101_1658_995/master/1658.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cee2dfd476d3330ba13839c27da81ef6",
            "top_comments": [
                "What's fucking crazy to me is tariffs apply on orders already made.... Planes, or board games, doesn't matter, you get fucked",
                "Did they check the back or bottom of the receipt for the return policy",
                "On the upside, I got to leave Hong Kong on Friday with half the junk my in-laws gave us left behind since the HKPO decided it was going to deal with US for a bit. Downside, I'm sure management at Boeing will use this as an excuse to can more engineers that have ever dared to bring up concerns to management. Or get rid of some suppliers. Regardless my local economy is going to take a hit.",
                "Boeing Tech here, this is bad, like really fuckin bad. Billions of dollars of China bound planes just sitting waiting for delivery is going to stack up quick. Boeing doesn't get the final check until it tickets.",
                "I wonder if those “I did that” stickers come in plane-size?",
                "It has always been funny to me how people type “If it’s it not made in America, I don’t want it” from their (non) American-made smart phone or laptop.",
                "Boeing has to be angry. And we know what happens to people who make Boeing angry..",
                "I flew on Xiamen airlines out of Xiamen island in 2018. I thought it was a really good airline with good economy class accommodations. Sucks to hear tariffs causing this headache.",
                ">(She wrote upon it)  \nReturn to sender, address unknown  \nNo such person, no such zone\n\n\\- Elvis Presley \"[Return To Sender](https://www.youtube.com/watch?v=-Ml1_SLU6x4)\"",
                "is this more \"Art of The Deal \" 5d chess by trump?"
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "RISING",
            "title": "Police investigate shooting on subway platform that led to Harvard students sheltering in place",
            "external_url": "https://abcnews.go.com/US/wireStory/harvard-students-told-shelter-place-police-investigate-shots-120995546",
            "upvotes": 236,
            "date": "04/21/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/ca6586bf-9747-45ea-baf4-557382d188fd/wirestory_39fe5b9e307d42729edaf419b8e64086_16x9.jpg?w=1600",
            "top_comments": [
                "Not going to lie, I am waiting for the MAGA crowd to start shooting up these colleges because they think they are teaching a woke agenda, even if they can't define what that means."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Two German Teens who Didn’t Have a Hotel Booked were Detained by ICE Officials in Hawaii",
            "external_url": "https://beatofhawaii.com/why-these-hawaii-travelers-were-jailed-and-deported/",
            "upvotes": 17143,
            "date": "04/21/2025",
            "thumbnail": "https://beatofhawaii.com/wp-content/uploads/2025/04/1000005785.jpg",
            "top_comments": [
                "Why is a strip search necessary after a full body scan?\n\n\nI ask fully knowing the answer.",
                "Before the madness of this current admin, they just didn’t let you in. That’s all. Back in the 2000s, we were picking up a travel athlete from Slovenia who didn’t have a return ticket. He was held by CBP in the airport until he bought one. That’s all that happened. They released him as soon as he had the ticket. He wasn’t deported.",
                "Our travel sector is gonna be killed by these clowns.",
                "It is my understanding they were also strip searched, jailed overnight, and deported to Japan",
                "When will this madness stop?",
                "The issue isn't that they were questioned, detained and then flown overseas. If they were had been treated courteously and professionally, as you expect from a supposed first world country, this wouldn't have been newsworthy. Its how they were treated. Instead they were treated like this:\n\n>\"After hours of questioning at Honolulu Airport, they said they were placed in handcuffs, loaded into a transport vehicle, and brought to what they later learned was a deportation detention facility.\"\n\n>\"There, they reported being subjected to full-body scans, strip searches, and issued green prison uniforms. They were placed in a holding cell overnight alongside long-term detainees, including individuals accused of serious crimes.\"\n\n>\"Conditions described included sleeping on thin, moldy mattresses, using rudimentary toilets, and being warned by guards to avoid expired food.\"",
                "So is the goal to shatter any tourism driven industries?",
                "I was detained for a few hours at LAX because the guy wouldn't let me show him my return ticket on my phone. It had to be a paper ticket. I didn't have a paper ticket because I flew with an airline that lets you use their app instead.\n\nWhen I finally got interviewed in the holding pen and explained the guy at the main desk wouldn't let me show him the ticket on my phone, the next guy just rolled his eyes and let me go.",
                "I posted this in another sub when someone asked why/how their accommodations were deemed insufficient, copying and pasting here. I should also note their planned trip was for 5 weeks between Hawai’i and California if that matters for anyone. Also, please remember I was answering a question about why the lodging was considered insufficient and how that led to deportation, not defending the policy and actions: \n\nI live in Hawai’i and the backpackers posted their side of the story on Reddit (available in the backpackers sub). \n\nBasically they only booked for a few days out of their planned trip, with the intention of booking additional as needed. However, they didn’t have the funds on them or something (it’s not clear, they were just asked about how they were going to pay) and when asked how they’ll cover the expense they said they work through virtual employment internationally. They also didn’t have a return flight/connecting flights within the US booked, but they did have an onward flight to Asia booked. \n\nThis flagged them as coming to the country to work illegally and they were deported as a result.\n\nNot defending them being deported or how they were deported but they weren’t aware how strict immigration is for the US and due to their more relaxed travel style in terms of planning, they accidentally answered wrongly (but honestly) in all the wrong places when asked. Even the German consulate got involved but I’m unsure what degree that plays in anything.\n\nThey were sent to Japan instead of Germany because I believe they requested it.",
                "The United States of America is not safe.\n\n\nDo not come here.\n\n\nDon't let them fool you. There's nothing you can do, and you might be shipped off to a prison without due process. You might get sick or hurt and wind up losing everything you own. You might just die.\n\n\nDon't come to America.\n\n\nIt's not safe here."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "El Salvador offers Venezuela prisoner swap involving US deportees",
            "external_url": "https://www.bbc.com/news/articles/cn5xl5ppzr2o",
            "upvotes": 1018,
            "date": "04/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d21e/live/4b500ad0-1e4c-11f0-86e6-e13957bc23df.png",
            "top_comments": [
                "So they can send people to Venezuela, but not the US? Right...",
                "Basically. The US paid Bukele to take over 200 Venezuelan criminals(tbd). Now Bukele gets to keep this money and extort more from Venezuela. Trump really handed over hundreds of people to a human trafficker. What a joke.",
                "What in the fuck is this timeline",
                "Is this slave trading?",
                "If they move the prisoners enough, they'll be easier to disappear.",
                "So America snatches people of the streets, pays private prison storage to detain them, pays El Salvador to imprison them and then El Salvador can use them a bargaining chips?",
                "Are these Venezuelan refugees/migrants now being sent back to Venezuela? Maduro: “Oh so you went USA as a refugee saying we ‘oppressed’ you huh? You gone learn about oppression now boi.” They’ll be tortured and buried in unmarked graves I suspect.",
                "If you could travel back to 2000 and tell everyone this is where the US would be in 25 years people would think you were crazy.",
                "The legal argument that if you are deported from the US and the country you send them to is going to traffic them for political favors is going to end up getting a lot of people asylum status.",
                "So he can get them out?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Defense chief Hegseth shared war plans in second Signal chat, NYT reports",
            "external_url": "https://www.reuters.com/world/us/defense-chief-hegseth-shared-war-plans-second-signal-chat-nyt-reports-2025-04-20",
            "upvotes": 30663,
            "date": "04/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "LOL the NYT article says 4 of 12 people in the chat have ratted him out so far.",
                "Insane this man still has a job …signal gate part 2 is now out ……republicans won’t do ANYTHING",
                "Very interested how his wife and brother were considered to have “need to know” of military intelligence. Not to mention that this is demonstrating a clear pattern that these guys are routinely using unsecured communications to share classified information.\n\nIf this doesn’t get this idiot fired nothing will.",
                "I’m a cleared worker. My entire career revolves around what to do and not to do while having a clearance. If I did this, I’d not only lose my career but I’d be jailed for treason.",
                ">Pete Hegseth shared details of a March attack on Yemen's Iran-aligned Houthis in a message group that included his wife, brother and personal lawyer,\n\nRepublicans win by convincing Americans running the government should be like the Williams family in Bridgeport Nebraska, sitting at a kitchen table, budgeting only what they put into the Bank of Shoebox Under the Bed.\n\nCommon sense family governing.",
                "Sir, a second group chat has hit the pentagon",
                "SECOND Signal chat?  Wtf?! Are the secure communications channels that our tax dollars pay for not good enough, Republicans? You have to go out of your way to compromise our ridiculously expensive security?!",
                "“I know what I am doing”",
                "MAGA – Morons Are Governing America",
                "So like, you know lets pretend for a second that we give this jackass a second chance to stop fucking up so badly for 5 fucking seconds. \n\n\n\nHow the fuck are Republicans in congress up in arms about Hilary's emails, but see no problem with this guy getting caught, not changing his behavior, and then doubling down on his fucking idiocy. \n\n\n\n\nThese fucks all deserve the boot, if not jail time. Fuck em all, hypocritical fuckheads."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "4 witnesses shed light on Montgomery woman’s murder, husband’s arrest",
            "external_url": "https://www.wsfa.com/2025/04/18/4-witnesses-shed-light-montgomery-womans-murder-husbands-arrest/",
            "upvotes": 458,
            "date": "04/20/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/E7RUVXFEZRBHZNGLRJCJKETPEY.png?auth=24a3f559c495be9ec0015da8a715f94cd40e6503adffb5e9e213f57a52de03b2&width=1200&height=600&smart=true",
            "top_comments": [
                "The witnesses said they were driving their city-owned vehicle on the Boulevard when an unknown woman ran up to them and tried to get in. They then reported a man firing shots at them, three of which hit the vehicle. While no one was injured, the witnesses said the woman then fled to the wood line and was chased by the man.",
                "The witnesses said they fled the area and didn’t see what happened next, but were able to identify Wright as the suspect through a photographic lineup.",
                "“A motive for the shooting was not immediately clear” — that line always frustrates me in cases like this, that are DV related. Men kill their wives all the time, because they feel entitled to control over these women’s lives. “why does he do that?” By Lundy Bancroft is a very eye opening read about this subject",
                "[deleted]"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "‘Professional failures’ led to killing of Palestinian medics in Gaza, says Israeli military",
            "external_url": "https://www.cnn.com/2025/04/20/middleeast/israeli-military-professional-failures-gaza-medics-intl",
            "upvotes": 3863,
            "date": "04/20/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25110487425158.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Because it has to be right? Targeting medics is a war crime. Not that the USA would let any charges from the ICJ actually have any effect\n\nEdit: The ICC already issued arrest warrants and trump invites Netanyahu to the oval. The ICJ has no enforcement capabilities, that goes to the UN and the USA has veto power there. Just for clarity",
                "\"Oops. Not really, though.\" - Israel",
                "I'm sure the IDF must have an office of euphemisms by now.  This was not a professional failure; they murdered medics (a war crime), then buried them in a mass grave, and then \"lied to their command\" about what happened.  Now I'm not sure about that last part.  I'm pretty sure IDF command would have approved of this war crime anyway.",
                "What the fuck? Breaches of orders, blatant lies afterwards and they claim everything the soldiers did was actually fine?\n\nAlso what is with the repeated false statements getting a pass? Its not plausible they did not notice the flashing lights. If they didn't do anything wrong why crush the vehicles or lie about the incident?\n\nFinally if they let their soldiers breach orders but escape punishment when that breach kills medic, the actual message is clear: killing medics is okay with the leadership.",
                "So it’s either their Hamas members or its “professional failures”, awfully convenient.",
                "It's wild seeing a military admit its rules of engagement are looser than an American cop's requisites to use their guns",
                "professional failure is the buzz for for 'war crime' you guys committed a war crime and just admitted to it. if you claim to be the good guys, what do you do? I mean YOU committed the war crime.",
                "This was on video. Imagine what's happening that is not recorded",
                ">Professional failures\n\nMore accurately stated as; 'Murderous intent'.",
                "So…\nIsrael kills women\n\nIsrael kills children\n\nIsrael kills non-combatants \n\nIsrael kills Unrwa workers\n\nIsrael kills AMERICAN CITIZENS in the west bank\n\nIsrael kills culinary aid workers\n\nIsrael kills doctors and medics\n\nIsrael kills journalists\n\nIsrael bombs hospitals\n\nIsrael bombs refugee camps\n\nIsrael denies aid to enter Gaza\n\nIsrael denies food to enter Gaza\n\nIsrael violated the terms of its ceasefire over 700 times\n\nIsrael pays congresspeople in the US to keep their mouths shut\n\nAnd the latest batch of mass killings that they orchestrate is a professional failure? \n\nIf anyone is still believing Israel’s lies in this day and age, especially when online Gazans are creating daily testimonials of how Israel killed their families and ruined their lives, then they need to wake up.\n\nAnd if you don’t believe this incident even happened like ive heard some people don’t, please watch the video provided by the new york times that was recovered from one of the phones of the dead medics in the mass grave that the idf soldiers dumped the bodies in. It’s heartbreaking."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Germany seeks to deport an American and 3 EU citizens after pro-Palestinian protest",
            "external_url": "https://www.npr.org/2025/04/20/g-s1-60984/germany-deportation-protesters",
            "upvotes": 2010,
            "date": "04/20/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8192x4608+0+428/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd7%2F39%2F26354b464ed99275854148e9d511%2Fgettyimages-2208965544.jpg",
            "top_comments": [
                "Wait, can Germany deport EU citizens? Germany is part of EU, right?",
                "Reading the article, it seems to be because of property damage to the university rather than just because of protesting. It looks like they'll all be allowed to stay while they appeal the deportations.",
                "Why is no one ever questioning the concept of staatsräson in the political sphere? Am I going insane or has everyone lost their minds? It's literally just a statement by Merkel, WHY ON EARTH is everyone treating it as a constitutional principle. \n\nI don't even have a strong opinion on israel palestine, but it absolutely scares me how people only use a principled way of arguing when it suits them. It is mind boggling and endemic among all kinds of political strides.",
                ">While Berlin authorities cite criminal proceedings against them, their lawyer Gorski says none have any criminal convictions and haven't been given court dates or other information about the charges against them.  \n...  \nThe second letter sent to Murray cites the concept of [*Staatsräson*](https://www.dw.com/en/israel-and-germanys-reason-of-state-its-complicated/a-67094861) as part of the grounds for the deportation.\n\n>The letter says, \"The right of Israel to exist, its protection, and the integrity of the State of Israel are matters of German state policy\" and that this is \"especially significant given Germany's historical responsibility toward Jewish people in its federal territory and in the State of Israel.\"\n\n>It adds that \"at no time — whether domestically or abroad — should there be any doubt that opposing movements within Germany will be tolerated in any way.\"\n\n>Gorski says this is the first time he's seen the idea used to justify deportation.\n\n>\"It's highly troubling because the *Staatsräson*, meaning the unconditional solidarity of Germany with the Israeli state, is not a legal concept, it's a political concept,\" Gorski says.\n\n\n\nGermany is a weird country",
                "Just going to bury thr lead i guess.  They're not being deported for protesting, they're being deported for masking up, entering a university building and vandalizing the place.",
                "Making it a trend, are we?",
                "In case anyone gets the wrong idea from this one instance, I would note that protest against Israeli actions is legal in Germany. I saw a huge pro-Palestinian demonstration at Alexanderplatz in Berlin last Sunday with the banner \"One Genocide Does Not Justify Another.\"\n   \nWhile Germany's relationship with both anti-Semitism and violent protest is obviously complicated by its history, Germany is also a place where strong protections for free speech and peaceful assembly exist.\n  \nThese deportations are notable because they are a deviation from the norm.",
                "The Berlin chief of police warned Jewish and LGBT people from going into certain neighbourhoods due to violence against them. \n\nPerhaps they had reason to look into these people. Not all protestors are peaceful or with goodwill.",
                "The basic concept that when u go to another country, you should behave and not break things or break the local laws....its like large numbers of people don't actually believe  this and think that they can what they want.\n\nWe should deport more troublemakers when we can",
                "In an email to NPR, a spokesperson for the Berlin Immigration Office, Marcus Jähnke, confirmed it had revoked the residence permits of four \"pro-Palestinian activists\" and this was \"in connection with a pro-Palestinian protest\" where \"masked individuals\" entered a university building and caused \"property damage including graffiti.\"\n\n\nSo... committing crimes?"
            ],
            "aggregate_sentiment": 23.0
        }
    ],
    "last_updated": "04/21/2025 08:13:00 UTC"
}