{
    "posts": [
        {
            "category": "HOT",
            "title": "Finland is again ranked the happiest country in the world. The US falls to its lowest-ever position",
            "external_url": "https://apnews.com/article/world-happiness-report-ranking-finland-afghanistan-us-b41c1712448762d98fe9e4f80233c15f",
            "upvotes": 1498,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Beyond the actual rankings, there's some good insights here, about what makes for a happy society:\n\n>**Researchers say that beyond health and wealth, some factors that influence happiness sound deceptively simple: sharing meals with others, having somebody to count on for social support, and household size**. In Mexico and Europe, for example, a household size of four to five people predicts the highest levels of happiness, the study said.\n\n>**Believing in the kindness of others is also much more closely tied to happiness than previously thought**, according to the latest findings.\n\n>As an example, the report suggests that **people who believe that others are willing to return their lost wallet is a strong predictor of the overall happiness of a population**.\n\n>Nordic nations rank among the top places for expected and actual return of lost wallets, the study found.\n\n>Overall, researchers said **global evidence on the perceived and actual return of lost wallets shows that people are much too pessimistic about the kindness of their communities compared to reality** — actual rates of wallet return are around twice as high as people expect.\n\n>...\n\n>Experts in economics, psychology, sociology and beyond then seek to explain the variations across countries and over time using factors such as **GDP per capita, healthy life expectancy, having someone to count on, a sense of freedom, generosity and perceptions of corruption**.\n\nIt's a good reminder that a sense of community, personal relationships, and social solidarity add real value to people's lives.\n\nI think that sometimes gets missed, when changes in society are evaluated almost solely by their implications for economics and efficiency.  Those are important too, but they're not everything.",
                "Finnish people have a lot of trust in their government and other public institutions, and trust in their communities in general. They provide access to strong public services like healthcare and education. Finland has a stable economy. And they value work-life balance, comfort, and well-being. It has been this way for a long time. It seems clear that other counties should follow suit",
                "Position  24.  Saved you a click",
                "I was told we were going to be great.",
                "Frankly, the end of the article scares me more than the ranking itself:\n\n\n>In a concerning development, the study said 19% of young adults across the world reported in 2023 that they have no one they could count on for social support. That is a 39% increase compared to 2006.\n\n\nWe already have one generation of people who are effectively islands unto themselves. The fact that the next generation is already starting off alone isn't going to bode well.\n\n\nAlso, Mexico being in #10 despite some of the horiffic things that happen there should raise some alarm bells on how the United States functions as a society. If you're less happy than the country below you that has active cartels with clandestine body disposal facilities, then you have a problem.",
                "Finland Finland finlaaaaaand. That is the country for me",
                "The Netherlands no. 5; it's always Scandinavian countries and The Netherlands in the top 10. I wonder why.",
                "Direct Link to the report: https://worldhappiness.report/ed/2025/",
                "Can confirm, US-based and less happy",
                "Finland: Universal healthcare, work-life balance, and trust in government.   \nThe US: Unlimited breadsticks if you ask nicely."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "French Scientist Reportedly Denied U.S. Entry Due to Trump Criticism",
            "external_url": "https://newrepublic.com/post/192946/french-scientist-denied-us-entry-trump-criticism",
            "upvotes": 29332,
            "date": "03/19/2025",
            "thumbnail": "https://images.newrepublic.com/df32fc6dfc42d5dcddd8933438d7a9a07f5c533f.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
            "top_comments": [
                "Horrifying\n\n>The French newspaper Le Monde reports that on March 9, a space researcher was randomly selected upon arrival in Houston for a search, and CBP found messages criticizing the Trump administration’s treatment of scientists, which, according to the agency, “conveyed hatred of Trump & could be qualified as terrorism.”\n\nI guess around half of america are  terrorists now, according to whoever said that.",
                "So much for freedom of speech.",
                "Good thing he got to back to France and not deported to a concentration camp.",
                "Places people don’t want to go because they’re afraid of being jailed or deported for no reason:\n\n- Russia\n- North Korea\n- Iran\n- USA\n\nCongrats. Too much freedom I guess. ",
                "What a complete shit show.",
                "Anyone that thinks this person is just gonna go willingly after his term is up has another thing coming.",
                "”hatred of Trump & could be qualified as terrorism”. So I guess no one is going to be let into the USA anymore?",
                "USA is now just a fat North Korea",
                "I’ve never seen a country shoot itself in the foot to this degree in such a short span of time. Good luck attracting anyone other than MAGA style idiots at this point.",
                "Yamtits is the biggest man baby in the world with Elon a close second. It's amazing to me that bloated sack of monkey crap is actually president."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "'Out of control' Tesla ploughs into pedestrians on busy London street injuring seven",
            "external_url": "https://www.lbc.co.uk/crime/tesla-crowd-london-stepney-green-east-end/",
            "upvotes": 9861,
            "date": "03/19/2025",
            "thumbnail": "https://images.lbc.co.uk/images/711463?width=692&crop=16_9&signature=2K0o7cbWGdo3vMUBKWoPQ0n4Qm0=",
            "top_comments": [
                "They're sick of being burned , they are revolting!",
                "Out of the way, citizen. Cities are for autonomous vehicles to drive through.",
                "Tessler. It's all computer.",
                "Musk is going to claim this Tesla was hacked by Ukraine.",
                "Oh oh they’re fighting back",
                "I do think its hilarious that Trump has ordered Musk and Boeing to hastily build him 2 new airforce ones. Teslas are garbage and Boeing is killing whistle-blowers on how faulty their shit is.",
                "So is this Counter Terrorism? Donald?",
                "Lidar is an hoax said the \"genius\"!",
                "This will make the stock price go up somehow.",
                "Maybe the Tesla felt threatened"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump fires both Democratic commissioners at FTC",
            "external_url": "https://www.reuters.com/world/us/trump-fires-both-democratic-commissioners-ftc-sources-say-2025-03-18/",
            "upvotes": 17125,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So Biden was for some reason unable to fire FTC chairs but all of a sudden Trump is able to. Interesting.",
                "Everyday is another outrage. Another law violated. And Congress just sits there like meek little sheepdogs. At this point, they all need to go",
                "Trump *illegally* fires both Democratic commissioners at FTC. \n\nFucking complicit media.",
                "If it's removing fraud and corruption and waste why is it only democrats?",
                "He said he’d only be a dictator on day one, wait, did Big Mac lie to us? ",
                "Dictator just doing dictator things, nothing to be alarmed of",
                "what's the consequence if we just ignore him the way he ignores the law? they could say \"oh no im still employed here, he has not fired me because he cannot fire me\" and what would be the functional difference?",
                "\"Illegally gutting the Commission will empower fraudsters and monopolists, and consumers will pay the price,\"\n\nWell we can see his motivation, Mr Mango \"The grift\" Mussolini.",
                "Trump considers every Democrat an enemy and that's why so many families don't talk anymore.",
                "\"The firings drew sharp criticism from Democratic senators...\"\n\nYes, we know, they are all outraged. I wish they did more."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "USDA cancels $1 billion in funding for schools and food banks slated for local farmers, ranchers and producers",
            "external_url": "http://www.cbsnews.com/news/usda-cancels-local-food-purchasing-food-banks-school-meals/",
            "upvotes": 6470,
            "date": "03/19/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/06/13/292c1ec7-31fc-447f-b459-5881c78671b3/thumbnail/1200x630/c42b2f227f9eb0f3da4219bb77f49fee/gettyimages-1243012161.jpg?v=765ef194a4bf4701e45ec9d5712af42f",
            "top_comments": [
                "I’m sure this will help the country.",
                "So we're ~~dropping~~  giving10 billion to farmers for assistance, but dropping money that helps farmers feed our children? What the fuck.\n\n[https://www.usda.gov/about-usda/news/press-releases/2025/03/18/usda-expediting-10-billion-direct-economic-assistance-agricultural-producers](https://www.usda.gov/about-usda/news/press-releases/2025/03/18/usda-expediting-10-billion-direct-economic-assistance-agricultural-producers)",
                "> \"Unlike the Biden Administration, which funneled billions in [Commodity Credit Corporation] funds into short-term programs with no plan for longevity, USDA is prioritizing stable, proven solutions that deliver lasting impact,\"\n\nThe Biden admin actually implemented plans to help the American people.\n\nThe Trump admin either destroys these programs with no alternative plan to action, or a plan to divert funds to personally enrich themselves and their wealthy friends.\n\nNot loudly broadcasting the accomplishments of the Biden admin is one of many misteps the Dems made, because the more programs the Trump admin destroys, the more clear it becomes just how much good Biden actually did.",
                "The Republican party hate the American people and get off by harming us.",
                "Trump voters just keep on winning.",
                "So, tariffs are supposed to encourage domestic production, but he's also slashing everything that actually makes domestic production possible.\n\nWe're going to envy the generation that lived thru the Great Depression because of this imbecile.",
                "If only they would’ve released a manual explaining step by step what their plan was. At least give folk a heads up ya’ know.",
                "Depriving food from children. That is America becoming great again",
                "Thats Donnie, Making America great. Those farmers, yeah they dont matter. Hope the Farmers knew better than to vote for that asshole.",
                "Why is school lunch not a thing? Does the government hate our kids that much?"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "HOT",
            "title": "Germany updates US travel advice after citizens detained",
            "external_url": "https://www.reuters.com/world/europe/germany-updates-us-travel-advice-after-citizens-detained-2025-03-19/",
            "upvotes": 6228,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump is really brilliant. The U.S. tourism market is worth 2.36 trillion dollars annually. \n\n  \nDoes making america great again include decimating its global lead in tourism revenue?",
                "Our tourism industry is about to implode.",
                "FRANCE had citizens rejected entry for anti-Trump messages on their phone just Today. Source: https://www.liberation.fr/international/amerique/un-scientifique-francais-refoule-a-son-entree-aux-etats-unis-pour-des-messages-anti-trump-paris-grince-des-dents-20250319_JD7JAIVY4ZHE5CI33F7TBNR4CI/\n\nTravel advice at this point should be: Level 3: Reconsider Travel due to a limited ability to provide emergency consular services and arbitrary enforcement of local laws, especially if entering from a 3rd country like Mexico or Canada. US Green card holders and those traveling on US visas should be prepared for their status to be canceled upon entry.\n\nGERMANS: CANCEL YOUR NON ESSENTIAL TRAVEL PLANS TO THE USA UNTIL THE POLITICAL CLIMATE REVERTS TO SOMETHING MORE NORMAL.",
                "Were all these customs agents or whatnot just chomping at the bit to detain/torture foreigners all these years but were constrained by presidents following the law/constitution?",
                "Considering under Trump, you can be scooped up and deported to detention centres with zero merit, or worse be unlawfully targeted and illegally detained as a ‘terrorist’, solely by word of mouth and no conviction…… that sure makes for a unsafe / unstable destination for foreign nationals. \n\nI would not travel to the USA under this Administration if you paid me to.",
                "“Don’t. Go. To. America.”\n\nYes. That’s all. \n\nJust fucking avoid it.  \n\nHow long?\n\nTen years minimum.",
                "We'll get like North Korea or Afghanistan or Russia. No reasonable Westerner will visit.",
                "No way will I go to the US in the near future",
                "i am a Canadian, I have a cruise planned for December that leave from Florida, I told my wife that if this keeps up without change until end of April that we are going to Europe or outright cancelling and eating our $1000 deposit",
                "WTF is the point of a fucking Visa or travel document if some customs person can just be like HMMMMMMM NAH"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Ice agents detain woman known for immigration advocacy in Colorado | US immigration",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/19/jeanette-vizguerra-ice-colorado",
            "upvotes": 2756,
            "date": "03/20/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/991982bb6db500e7e1f3657debdf43f0bf1cd9d2/0_100_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=25975fc1089e83dc3916494a8de3e43b",
            "top_comments": [
                "What happened to only going after rapists and murderers?",
                "From the article: \n\nShe pleaded guilty to “attempted possession of a forged instrument”, which the network noted prompted heightened scrutiny from immigration authorities. She spent the next several years appealing multiple deportation orders.\n\nVizguerra has had several stays during her attempts to seek citizenship, per CBS News, and sought refuge at churches.\n\nJordan Garcia of the American Friends Service Committee, who has been in contact with Vizguerra’s lawyer and family and spoke with the Associated Press, said Vizguerra had been trying to gain a visa since leaving sanctuary in churches in 2020.",
                "So we are ruzzia and China now. ",
                ">She gained national attention in 2017 when she took sanctuary in a Denver church to avoid deportation during the first Trump administration.\n\nAhh, so this is just settling another vendetta for Trump. Meanwhile he's got a rapist attacking the Prime Minister of Ireland because he let Rosie O'Donnell move there before he could round her up as well.",
                "Oh, come on.  A woman who entered the country illegally. Was convicted of using false documents (a fact conveniently omitted from this article) And ordered deported over 10 years ago during the Obama administration. \n\nBut let's not call her illegal, let's not call her convicted, let's not mention that she seeks sanctuary in churches to evade the law,  let's just call her \"an advocate\"",
                "She entered the country illegally, broke the law and folks are wondering why she's being deported?",
                "They really are following the manual, aren't they?",
                "What exactly does immigration advocacy mean? If it means she’s teaching people how to circumvent and cheat the immigration process… As a legal immigrant, I say lock her up.",
                "German guy here. I’ve red all about how this started and what it turned into growing up but I wasn’t really anticipating the live action adaption",
                "That’s ICE, go for the person work raising kids and paying their bills, bunch of f***ing losers"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Amtrak CEO Stephen Gardner resigns effective today \"to ensure that Amtrak continues to enjoy the full faith and confidence of this administration.\"",
            "external_url": "https://www.cnn.com/2025/03/19/business/amtrak-ceo-steps-down?cid=external-feeds_iluminar_google",
            "upvotes": 5464,
            "date": "03/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1496428067.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This is the State controlling industries by pressuring them to install loyal leadership.\n\n\nWhere are all the rightists worried about Oscialist boogeyman?",
                "Musk famously despises trains having proposed any number of harebrained train alternatives in order to stall or detail train initiatives.\n\nThis can’t end well.",
                "Prior to the pandemic, Amtrak was projected to hit profitability around 2022-2023 but the setback means that it’ll be a few more years (sans whatever bullshit Trump and Musk do). People yearn for the trains and this is documented significantly by the expansion of rail service in Virginia, The Midwest and elsewhere. \n\nThe Chicago-Twin Cities *Borealis* (aka 2nd round trip between the pairs) service that started last year has beaten ridership expectations and the stakeholders wanna add another trip a few years earlier than planned. Amtrak Virginia service has had ridership soar with each year beating the last. \n\nOne of the biggest issues I think Amtrak faces is, by law, they’re not allowed to fund/operate services less than 750miles (~1200km). Savannah, GA to New York *Palmetto*, Charlotte to New York *Carolinian* services for example are state funded because that’s the law, Amtrak is just the contractor. \n\nNot only this but Amtraks charter requires them to be profitable meaning that LD services are insanely expensive. \n\nIf we want Amtrak to be successful then we need to allow it to be far more independent than it already is. Let it run shorter and medium haul services that can generate a profit for longer distance trains to be subsidized. Expedite the overhaul and replacement of Amtrak equipment. \n\nHigh speed rail is useless without a good network of regional and intercity trains. People yearn for the trains.",
                "Great, I've got a ticket for a trip in a couple of months. I should probably start planning for alternative transportation in case they blow shit up.",
                "“I think we should privatize anything that can be privatized, just so you’ve got a feedback loop for improvement, is what happens when something’s privatized,”  - Musk\n\nWhat he really means is that we need more avenues for the rich to get richer and the poor to get poorer. This is how the country gets better right? After all, we have many examples of services being privatized and then improving greatly... /s",
                "“I think we should privatize anything that can be privatized, just so you’ve got a feedback loop for improvement, is what happens when something’s privatized,” Musk continued. **“Basically something’s got to have some chance of going bankrupt or there’s not a good feedback loop for improvement.”**\n\n\nMusk is a fucking idiot. He thinks that improvement can only be driven by money and not through passion or the desire to improve things in general. Shit stain thinks everything has to be related to money.",
                "Fascists always take control of the railroad companies/railways.\n\n🤷🏻‍♂️",
                "Don’t surrender in advance",
                "Who other than Elon is trusted by this administration?",
                "That spells BAD NEWS for Amtrak employees with what's going on now, think USPS and Dejoy."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Sponsors drop San Francisco Pride as festival decries ‘rights backtracking’",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/18/anheuser-busch-coors-pull-sponsorship-san-francisco-pride?CMP=Share_iOSApp_Other",
            "upvotes": 2582,
            "date": "03/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/32ab4d32c19c3c344770611b49ff8ded0eeaa60e/36_0_1125_675/master/1125.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a73cd9c10171b464b1648dbb375a42f4",
            "top_comments": [
                "As a gay man, let me tell you that most people who celebrate Pride never thought much of corporate sponsorship. The best pride events are local gatherings,  in parks with picnics.  The ones with all the glam and glitz were just that - glam and glitz. I'd much rather spend an afternoon with friends and neighbors just hanging out than have music and glitz being pumped at me. \n\n\nFor those of us who celebrate togetherness and community, the loss of corporate money won't bother us much. Many of us also tend to support local versus corporate as well. ",
                "On the one hand, their \"support\" was always a gross, transparent attempt at profiteering. It was - or should have been - obvious to everyone that they would ditch LGBT stuff the minute social headwinds shifted\n\n\nThe concerning part is WHY they're doing it. The fact that all of these companies are bending the knee to an administration like this one is concerning (and dumb).",
                "Well this was very predictable and exactly why a number of people didn't want them there to begin with",
                "> The president has ordered that the US only recognize two sexes, sought to ban trans people from the military, and repealed policies promoting racial equity and protecting LGBTQ+ people from discrimination. Major US companies from Amazon to Google have announced they will end their diversity, equity and inclusion programs.\n\nI want to live in a world where people are judged on their individual merits and flaws, not as part of a group generalized by something they don't even have a choice over.\n\nApparently, according to POTUS, that makes me a member of the \"radical left\".\n\nFucking Republicans and non-voters (both of which are groups that people make an active choice to be a part of), ruining America.",
                "Time to make Pride a protest again.",
                "It’s the companies that stick around while the others slink away because it no longer benefits them that we should be paying attention to.",
                "It is sad to see from the perspective that these companies did not actually feel the support was the morally right thing to do….to support the community. It was the “cool” thing to do to make their money. The latest gimmick. Now they can go back to their overall concern and true views. \n\nI share that I am not part of the LGBTQ+ community. Companies supporting the community did nothing to affect my life. Meaning, this support they were showing did not influence me to buy or not buy their products/shop at their locations. For example, I didn’t go to the Target  because they supported the community. On the opposite of that, though, now they have shown their moral compass that they will flip and their support was not genuine. And that is more than disturbing and speaks volumes. What a truly sad state the US is in.\n\nI am an American living in Finland and watching all of this from afar and seeing the international perspective and reaction at the same time with the American perspective is really something.",
                "Fuck all these companies. And who gives a shit if they do or don't sponsor anything. Go out and enjoy yourselves and be who you want to be.",
                "They never believed in any of it anyway. Companies make every decision based on money.",
                "Corporate America has never been an ally"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "US ‘deletes evidence’ of Russia’s kidnap of thousands of Ukrainian children",
            "external_url": "https://www.independent.co.uk/news/world/europe/trump-ukraine-children-russia-war-kidnapping-evidence-b2717730.html",
            "upvotes": 53765,
            "date": "03/19/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/18/13/58/SEI244319340.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "Great. Our actions are now complicity.",
                "Just a reminder that Trump pardoned more known pedophiles than any other US President in history",
                "Summary:\n\nThe US State Department allegedly deleted evidence collected by Yale University’s Humanitarian Research Lab, which was tracking Russian war crimes, including the abduction of 35,000 Ukrainian children. The deletion has hindered efforts to rescue the children and prosecute those responsible, including Russian President Vladimir Putin. The Yale project, funded by the US government until last month, monitored 116 sites in Russia using satellite imagery and other surveillance tools.\n\nSources suggest the deletion may have been accidental or intentional, raising potential legal risks for the Trump administration under international war crimes laws. The lost data was also being shared with the EU for its own investigations. The destruction of evidence not only affects legal cases but also complicates ongoing rescue missions.\n\nThe Yale project played a key role in gathering evidence that contributed to six ICC indictments, including against Putin and his commissioner for children’s rights. Russia has been accused of forcibly transferring Ukrainian children, issuing Russian passports in occupied areas, and erasing Ukrainian identity. The loss of the secure “Caesar” database has been described as a violation of the Geneva Convention, which prohibits destroying war crimes evidence. The US State Department has yet to respond.",
                "Greenlighting child abductions. \n\nFeeling free and brave yet, republicans?",
                "Not super familiar with International wartime law... but isn't covering up a war crime a war crime?",
                "Trumps fan boys been real quiet recently haven't they.\nMust be tiring having to generate excuses for things like this around 10 times a day at the moment.",
                "This is disgusting and heartbreaking and I hope every single person that voted for Trump has this shoved in their face. You are part of the reason this war criminal gets to continue to tear families apart and these children, THESE CHILDREN, may never see their families again.",
                "US is no longer a force for good in the world. This is just evil, plain and simple.",
                "MAGA are pro rape, molestation and trafficking.",
                "US goverment supports genocide."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Pope Francis: War is absurd. Let's disarm the Earth - Vatican News",
            "external_url": "https://www.vaticannews.va/en/pope/news/2025-03/pope-letter-corriere-della-sera-newspaper-appeal-disarmament-dip.html",
            "upvotes": 4,
            "date": "03/20/2025",
            "thumbnail": "https://www.vaticannews.va/content/dam/vaticannews/agenzie/images/ansa/2023/10/15/18/1697386122406.jpg/_jcr_content/renditions/cq5dam.thumbnail.cropped.1500.844.jpeg",
            "top_comments": [
                "I hear pissing upwind works too. Good luck on that one.",
                "Lets fight with Russia !",
                "You disarm people and they will fight wars bitchslapping one another. There is a will the is a way.",
                "Everybody love everybody"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Iconic F1 team owner Eddie Jordan passes away aged 76",
            "external_url": "https://www.formula1.com/en/latest/article/iconic-f1-team-owner-eddie-jordan-passes-away-aged-76.4szaKJ44LVwhZsJtPmC2OT",
            "upvotes": 15,
            "date": "03/20/2025",
            "thumbnail": "https://media.formula1.com/image/upload/f_auto/q_auto/v1742460366/fom-website/2025/Miscellaneous/jordan-header.png",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Georgetown professor detained by federal immigration officials &#x2d; WTOP News",
            "external_url": "https://wtop.com/dc/2025/03/georgetown-u-professor-detained-by-federal-immigration-officials-lawsuit-says/",
            "upvotes": 82,
            "date": "03/20/2025",
            "thumbnail": "https://wtop.com/wp-content/uploads/2022/01/GettyImages-1236982823-scaled-e1643594830754.jpg",
            "top_comments": [
                "People are going to say this is justified because of an alleged tie of him promoting Hamas propaganda but if true, how can you support the gov response? It’s like if I jaywalked, the gov can then send masked goons, whisk me at night, and disappear me to another location because I technically did something wrong or perceived as wrong. Also, the next move for the gov here is to then focus on Americans that are born here and stifle their free speech which we see happening on college campuses.",
                "The US has gone full Nazi.",
                "It's getting scarier by the day, don't let yourself think anybody is immune or off limits.."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Ottawa condemns Chinese executions of four Canadians on drug charges",
            "external_url": "https://www.reuters.com/world/ottawa-condemns-recent-chinese-executions-canadian-citizens-2025-03-19/",
            "upvotes": 48,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "When it comes to drug smuggling, SouthEast Asia appears to have a low reward-to-penalty ratio. Execution or life in prison are real outcomes.",
                "So, I really don't get this article.\n\nThey say 4 have been executed, then say some guy has not been executed. Then at the end China never even confirmed they executed them.\n\nSeems a bit of a clickbait to talk more about the reasoning behind tariffs and why. Then it is about drug smuggling and executions that may or may not have happened.",
                "They are still mad at us (yes, us, the Occident) for the opium war and they will make us pay to the last penny.",
                "Yeah, I love Canada, but I live in Japan and they are inundating Asia with drugs.   \nWe don't need that shit here.  \nTime to make a few examples.\n\n[https://apnews.com/article/japan-drug-smuggling-arrest-52c1f63dca0644c0b8a05ff39f4c5a24](https://apnews.com/article/japan-drug-smuggling-arrest-52c1f63dca0644c0b8a05ff39f4c5a24)\n\n\"Japanese police said Friday they have arrested a Canadian national on suspicion of smuggling into Japan hundreds of kilograms of methamphetamine hidden inside large industrial machinery that he had shipped in a container from the United States.\""
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Finland is again ranked the happiest country in the world. The US falls to its lowest-ever position",
            "external_url": "https://apnews.com/article/world-happiness-report-ranking-finland-afghanistan-us-b41c1712448762d98fe9e4f80233c15f",
            "upvotes": 1504,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Beyond the actual rankings, there's some good insights here, about what makes for a happy society:\n\n>**Researchers say that beyond health and wealth, some factors that influence happiness sound deceptively simple: sharing meals with others, having somebody to count on for social support, and household size**. In Mexico and Europe, for example, a household size of four to five people predicts the highest levels of happiness, the study said.\n\n>**Believing in the kindness of others is also much more closely tied to happiness than previously thought**, according to the latest findings.\n\n>As an example, the report suggests that **people who believe that others are willing to return their lost wallet is a strong predictor of the overall happiness of a population**.\n\n>Nordic nations rank among the top places for expected and actual return of lost wallets, the study found.\n\n>Overall, researchers said **global evidence on the perceived and actual return of lost wallets shows that people are much too pessimistic about the kindness of their communities compared to reality** — actual rates of wallet return are around twice as high as people expect.\n\n>...\n\n>Experts in economics, psychology, sociology and beyond then seek to explain the variations across countries and over time using factors such as **GDP per capita, healthy life expectancy, having someone to count on, a sense of freedom, generosity and perceptions of corruption**.\n\nIt's a good reminder that a sense of community, personal relationships, and social solidarity add real value to people's lives.\n\nI think that sometimes gets missed, when changes in society are evaluated almost solely by their implications for economics and efficiency.  Those are important too, but they're not everything.",
                "Finnish people have a lot of trust in their government and other public institutions, and trust in their communities in general. They provide access to strong public services like healthcare and education. Finland has a stable economy. And they value work-life balance, comfort, and well-being. It has been this way for a long time. It seems clear that other counties should follow suit",
                "Position  24.  Saved you a click",
                "I was told we were going to be great.",
                "Frankly, the end of the article scares me more than the ranking itself:\n\n\n>In a concerning development, the study said 19% of young adults across the world reported in 2023 that they have no one they could count on for social support. That is a 39% increase compared to 2006.\n\n\nWe already have one generation of people who are effectively islands unto themselves. The fact that the next generation is already starting off alone isn't going to bode well.\n\n\nAlso, Mexico being in #10 despite some of the horiffic things that happen there should raise some alarm bells on how the United States functions as a society. If you're less happy than the country below you that has active cartels with clandestine body disposal facilities, then you have a problem.",
                "Finland Finland finlaaaaaand. That is the country for me",
                "The Netherlands no. 5; it's always Scandinavian countries and The Netherlands in the top 10. I wonder why.",
                "Direct Link to the report: https://worldhappiness.report/ed/2025/",
                "Can confirm, US-based and less happy",
                "Finland: Universal healthcare, work-life balance, and trust in government.   \nThe US: Unlimited breadsticks if you ask nicely."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Israeli strikes across Gaza hit multiple homes, killing at least 58 Palestinians, medics say",
            "external_url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-03-20-2025-36c07d3dc7c03f66f86f44409d504d43?utm_source=copy&utm_medium=share",
            "upvotes": 141,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I want to draw attention to something important that I think a lot of people gloss over in discussion of Israel's military campaign in Gaza - *combat zones*.\n\nThe associated press recently [put out this map](https://i.imgur.com/Rym5mqu.jpeg), an estimation of the boundaries of the IDF's so called combat zones - invisible lines which the Israeli military draws and declares anyone within as a valid military target by virtue of their presence.\n\nAs you can see by the map, these \"combat zones\" are typically very broad, and also aren't actually well defined. Despite this, the IDF uses their existence to justify civilian casualties by asserting that anyone present in them *must* be Hamas or someone trying to martyr themselves. In case it wasn't obvious, these combat zones often cover neighborhoods home to tens of thousands of people. \n\nImagine if - for instance, the Peoples Liberation Army decided that actually the entirety of Harlem was a combat region (without even making that information available to New Yorkers beforehand) and killed anyone present. I don't think many would regard this as much more than the wanton murder of civilians.\n\nAnd I am not being hyperbolic about these killings - take for instance the case of two elderly Palestinian civilians who were killed as reported originally by [HaMakom](https://www.ha-makom.co.il/1057919-2/) (in Hebrew) and can be read about in English [here](https://euromedmonitor.org/en/article/6621/Euro-Med-Monitor-reveals-details-of-Israeli-army%E2%80%99s-execution-of-elderly-Palestinian-couple-after-it-used-them-as-human-shields) or [here](https://www.haaretz.com/israel-news/2025-02-16/ty-article/idf-reportedly-used-elderly-gazan-as-human-shield-tied-explosive-around-his-neck/00000195-0e56-d1b4-a7fd-cf7742bf0000). Essentially, IDF forces abducted an elderly Palestinian man and forced him to enter suspected booby-trapped buildings (as part of the alleged ***Mosquito Protocol***). Eventually, he and his wife were released; however, the IDF unit that abducted them did not inform the other units operating in the area that they had done so, so shortly after their release, **the 80 year old man and his wife were shot dead by Israeli forces operating in the area**.\n\nAnother report by [Haaertz](https://www.haaretz.com/israel-news/2024-12-18/ty-article-magazine/.premium/idf-soldiers-expose-arbitrary-killings-and-rampant-lawlessness-in-gazas-netzarim-corridor/00000193-da7f-de86-a9f3-fefff2e50000) focuses on the Netzarim corridor, one of the most infamous examples of these kill zones. I will leave you with the following quotes from soldiers:\n\n>*Every woman is a scout, or a man in disguise ... Anyone on a bicycle could be killed, claiming cyclists were terrorists*\n\n...\n\n>\"After shootings, bodies are not collected, attracting packs of dogs who come to eat them.\"\n\n...\n\n>\"One time, guards spotted someone approaching from the south. We responded as if it was a large militant raid. We took positions and just opened fire.\n\n>I'm talking about dozens of bullets, maybe more. For about a minute or two, we just kept shooting at the body. People around me were shooting and laughing.\"\n\n>When they approached the body, the soldier said they discovered that the person they had just gunned down was \"just a boy, maybe 16 (years old).\"\n\n>The battalion commander responded: \"Anyone crossing the line is a terrorist, no exceptions, no civilians. Everyone's a terrorist.\"\n\n...\n\n>\"The sight haunts me,\" said the soldier in his account in the report. Three of the Palestinians were killed in the barrage, while the survived with his hands in the air.\n\n>\"We put him in a cage set up near our position, stripped off his clothes, and left him there,\" the soldier recounts.\n\n>\"Soldiers passing by spat on him. It was disgusting. Finally, a military interrogator came, questioned him briefly while holding a gun to his head, then ordered his release.\"\n\nPerhaps these soldiers are lying. Perhaps the fact that their stories of indiscriminate killing seemingly independently cooberate one another, and reports from [doctors](https://www.nytimes.com/interactive/2024/10/09/opinion/gaza-doctor-interviews.html), [humanitarian organizations](https://www.amnesty.org/en/latest/news/2024/12/amnesty-international-concludes-israel-is-committing-genocide-against-palestinians-in-gaza/), the [UN](https://www.ohchr.org/sites/default/files/documents/countries/opt/20241106-Gaza-Update-Report-OPT.pdf), and the [ICC](https://www.icc-cpi.int/news/statement-icc-prosecutor-karim-aa-khan-kc-applications-arrest-warrants-situation-state) is merely a coincidence. I certainly do not *want* these reports to be true - *it would be preferable to imagine this as some grand antisemetic conspiracy* rather than think that reports like that of:\n\n>\"\tOne Division 99 reservist recalled watching a video feed from a drone showing \"an adult with two children crossing the forbidden line.\" \n\n>\"We had them under complete surveillance with the drone and weapons aimed at them—they couldn't do anything,\" he said. **\"Suddenly we heard a massive explosion. A combat helicopter had fired a missile at them.** Who thinks it's legitimate to fire a missile at children? And with a helicopter? This is pure evil.\" \n\n...are real. But I find evidence that this is an elaborate hoax to be lacking.\n\nI find it disturbing that so few people seem to be aware of these reports - neighborhoods and their residents being so casually designated for termination - dozens of *Bucha*s happening with the West's enthusiastic support, and I hope that having read these accounts you understand why some people find Israel's military operations in Gaza objectionable.",
                ">More than 400 Palestinians were killed on Tuesday alone, mostly women and children, according to Gaza’s Health Ministry. There have been no reports of Hamas firing rockets or carrying out other attacks.\n\n\nRight wingers will self-destruct and take these innocent people with them. Do not tolerate conservatives.",
                ">More than 400 Palestinians were killed on Tuesday alone, mostly women and children, according to Gaza’s Health Ministry. There have been no reports of Hamas firing rockets or carrying out other attacks.\n\nTo the trolls that follow me around like hyenas down-voting anything I say denouncing violence: Have at it! ☺️",
                "Are we allowed to call it genocide yet without being harassed?",
                "I genuinely, truly, cannot wrap my head around the fact that there’s people out there STILL condoning this. There is not a single scenario on earth that makes this justified, not ONE. Striking a UN building, striking charity workers, striking hospitals, striking people as they’re asleep in their beds (many of who are children) it’s fucking abhorrent. Plain and simple, Netanyahu is one of the most evil people on the earth."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Boy, 11, killed by his mother in Santa Ana, police say",
            "external_url": "https://www.sbsun.com/2025/03/19/boy-11-murdered-by-his-mother-in-santa-ana-police-say/",
            "upvotes": 1,
            "date": "03/20/2025",
            "thumbnail": "https://www.sbsun.com/wp-content/uploads/2025/03/OCR-L-CHILDSTAB-0320-03-LO-1.jpg?w=1024&h=691",
            "top_comments": [
                "From a site that isn't total dogshit: \n\nAn investigation is underway after a mother called police to report that her 11-year-old son had been stabbed and killed at a hotel in Santa Ana Wednesday morning.\n\nOfficers were called to the La Quinta Inn at 2721 Hotel Terrace where the boy was found suffering from multiple stab wounds around 9:30 a.m.\n\nThe unidentified victim was pronounced dead at the scene.\n\nThe boy’s mother was taken into custody and then transported to a local hospital after apparently ingesting something, police said.\n\nAn investigation into the circumstances surrounding the stabbing is ongoing.",
                "Tried to read the article but that webpage is a Shit Show!!",
                "OP, none of us can read the article."
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "NEW",
            "title": "DA says he would reconsider resentencing only if Menendez brothers admit to 'lies'",
            "external_url": "https://abcnews.go.com/US/da-reconsider-resentencing-menendez-brothers-admit-lies/story?id=119967273",
            "upvotes": 211,
            "date": "03/20/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d0f4f105-0374-4cd6-9df6-c5eb7faacbdc/hochman-abc-jt-250319_1742422877479_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "In other words, he wants them to confess to perjury so they won't be able to sue for wrongful imprisonment. Classy.",
                "He's saying he will not support the resentencing. Anything else he says is trolling.",
                "I cannot get past how they murdered their mother.  If not for that I could see commuting their sentences but going back to get more bullets and reloading to keep shooting her should keep them in prison for life.",
                "Fuck this guy to. He gets kicked out with trump",
                "[removed]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "European Union lays out how Apple must open its tech up to competitors under bloc's digital rules",
            "external_url": "https://apnews.com/article/apple-google-brussels-european-union-internet-8f1c2f1fda1d3ffeed50322df8093817",
            "upvotes": 289,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Man say what you want about the EU, but them strong arming tech companies into having consistent standards is amazing",
                "TLDR: \n\n- EU wants any smart watch to be able to talk to an iPhone the way the Apple Watch does.\n\nSeems reasonable.\n\n- They also want better BT pairing like the AirPods do.\n\nI think this is a hardware issue that other companies need to figure out - I use a pair of skull candy and AirPod pros on my personal phone and have zero issues connecting them after the initial pairing.\n\n- Airdrop protocol needs to be opened up. \n\nI 100% agree with this - even if it requires an app to be installed on the non-iOS device, they really need to open airdrop up.\n\n- Finally the eu is demanding that Apple opens up access to some of their hardware so apps can take better advantage of it.\n\nKinda agree, but they need to still keep it locked down so that malicious apps aren’t harvesting all our data and sending it onto the “mother ship”.\n\n\n- It seems like one of Apple’s core complaints is they said they put in the time and effort to R&D so they shouldn’t have to give it away for free.\n\nAnd I agree with that sentiment - except for airdrop. So Apple should just license it out.",
                "I would actually like to see anyone \"competing\" with Apple on the 2 main fronts they pretty much dominate.  Just need $500 billion for R&D to start it up.  Or be like China and just steal it.",
                "It will be nice if there is an alternative to iCloud and its ridiculous storage fees.",
                "They could have added:\n BRING BACK THE HEADPHONE JACK",
                "Good. Show the U.S. tech who's the boss in the E.U. Rules are rules.",
                "Terrible idea, security wise. But EU gonna EU",
                "Good. Apple can eat me. They deleted important events from calendars like black history month and international women’s day.",
                "The real question is why does Europe care when Europeans heavily prefer android. It’s like 2/3 Europeans on android. Investing in hardware and software is expensive, but why should other hardware manufacturers be entitled to it when it’s just going to run android anyway. The OS systems are a duopoly anyway and they can’t run iOS.",
                "Fuck I wish I was white. I would move to Europe in a heartbeat\n\nEdit: yo what’s with the downvotes?"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "NEW",
            "title": "Ice agents detain woman known for immigration advocacy in Colorado | US immigration",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/19/jeanette-vizguerra-ice-colorado",
            "upvotes": 2753,
            "date": "03/20/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/991982bb6db500e7e1f3657debdf43f0bf1cd9d2/0_100_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=25975fc1089e83dc3916494a8de3e43b",
            "top_comments": [
                "What happened to only going after rapists and murderers?",
                "From the article: \n\nShe pleaded guilty to “attempted possession of a forged instrument”, which the network noted prompted heightened scrutiny from immigration authorities. She spent the next several years appealing multiple deportation orders.\n\nVizguerra has had several stays during her attempts to seek citizenship, per CBS News, and sought refuge at churches.\n\nJordan Garcia of the American Friends Service Committee, who has been in contact with Vizguerra’s lawyer and family and spoke with the Associated Press, said Vizguerra had been trying to gain a visa since leaving sanctuary in churches in 2020.",
                "So we are ruzzia and China now. ",
                ">She gained national attention in 2017 when she took sanctuary in a Denver church to avoid deportation during the first Trump administration.\n\nAhh, so this is just settling another vendetta for Trump. Meanwhile he's got a rapist attacking the Prime Minister of Ireland because he let Rosie O'Donnell move there before he could round her up as well.",
                "Oh, come on.  A woman who entered the country illegally. Was convicted of using false documents (a fact conveniently omitted from this article) And ordered deported over 10 years ago during the Obama administration. \n\nBut let's not call her illegal, let's not call her convicted, let's not mention that she seeks sanctuary in churches to evade the law,  let's just call her \"an advocate\"",
                "She entered the country illegally, broke the law and folks are wondering why she's being deported?",
                "They really are following the manual, aren't they?",
                "What exactly does immigration advocacy mean? If it means she’s teaching people how to circumvent and cheat the immigration process… As a legal immigrant, I say lock her up.",
                "German guy here. I’ve red all about how this started and what it turned into growing up but I wasn’t really anticipating the live action adaption",
                "That’s ICE, go for the person work raising kids and paying their bills, bunch of f***ing losers"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Finland is again ranked the happiest country in the world. The US falls to its lowest-ever position",
            "external_url": "https://apnews.com/article/world-happiness-report-ranking-finland-afghanistan-us-b41c1712448762d98fe9e4f80233c15f",
            "upvotes": 1492,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Beyond the actual rankings, there's some good insights here, about what makes for a happy society:\n\n>**Researchers say that beyond health and wealth, some factors that influence happiness sound deceptively simple: sharing meals with others, having somebody to count on for social support, and household size**. In Mexico and Europe, for example, a household size of four to five people predicts the highest levels of happiness, the study said.\n\n>**Believing in the kindness of others is also much more closely tied to happiness than previously thought**, according to the latest findings.\n\n>As an example, the report suggests that **people who believe that others are willing to return their lost wallet is a strong predictor of the overall happiness of a population**.\n\n>Nordic nations rank among the top places for expected and actual return of lost wallets, the study found.\n\n>Overall, researchers said **global evidence on the perceived and actual return of lost wallets shows that people are much too pessimistic about the kindness of their communities compared to reality** — actual rates of wallet return are around twice as high as people expect.\n\n>...\n\n>Experts in economics, psychology, sociology and beyond then seek to explain the variations across countries and over time using factors such as **GDP per capita, healthy life expectancy, having someone to count on, a sense of freedom, generosity and perceptions of corruption**.\n\nIt's a good reminder that a sense of community, personal relationships, and social solidarity add real value to people's lives.\n\nI think that sometimes gets missed, when changes in society are evaluated almost solely by their implications for economics and efficiency.  Those are important too, but they're not everything.",
                "Finnish people have a lot of trust in their government and other public institutions, and trust in their communities in general. They provide access to strong public services like healthcare and education. Finland has a stable economy. And they value work-life balance, comfort, and well-being. It has been this way for a long time. It seems clear that other counties should follow suit",
                "Position  24.  Saved you a click",
                "I was told we were going to be great.",
                "Frankly, the end of the article scares me more than the ranking itself:\n\n\n>In a concerning development, the study said 19% of young adults across the world reported in 2023 that they have no one they could count on for social support. That is a 39% increase compared to 2006.\n\n\nWe already have one generation of people who are effectively islands unto themselves. The fact that the next generation is already starting off alone isn't going to bode well.\n\n\nAlso, Mexico being in #10 despite some of the horiffic things that happen there should raise some alarm bells on how the United States functions as a society. If you're less happy than the country below you that has active cartels with clandestine body disposal facilities, then you have a problem.",
                "Finland Finland finlaaaaaand. That is the country for me",
                "The Netherlands no. 5; it's always Scandinavian countries and The Netherlands in the top 10. I wonder why.",
                "Direct Link to the report: https://worldhappiness.report/ed/2025/",
                "Can confirm, US-based and less happy",
                "Finland: Universal healthcare, work-life balance, and trust in government.   \nThe US: Unlimited breadsticks if you ask nicely."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "DA says he would reconsider resentencing only if Menendez brothers admit to 'lies'",
            "external_url": "https://abcnews.go.com/US/da-reconsider-resentencing-menendez-brothers-admit-lies/story?id=119967273",
            "upvotes": 207,
            "date": "03/20/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d0f4f105-0374-4cd6-9df6-c5eb7faacbdc/hochman-abc-jt-250319_1742422877479_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "In other words, he wants them to confess to perjury so they won't be able to sue for wrongful imprisonment. Classy.",
                "He's saying he will not support the resentencing. Anything else he says is trolling.",
                "I cannot get past how they murdered their mother.  If not for that I could see commuting their sentences but going back to get more bullets and reloading to keep shooting her should keep them in prison for life.",
                "Fuck this guy to. He gets kicked out with trump",
                "[removed]"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "French Scientist Reportedly Denied U.S. Entry Due to Trump Criticism",
            "external_url": "https://newrepublic.com/post/192946/french-scientist-denied-us-entry-trump-criticism",
            "upvotes": 29340,
            "date": "03/19/2025",
            "thumbnail": "https://images.newrepublic.com/df32fc6dfc42d5dcddd8933438d7a9a07f5c533f.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
            "top_comments": [
                "Horrifying\n\n>The French newspaper Le Monde reports that on March 9, a space researcher was randomly selected upon arrival in Houston for a search, and CBP found messages criticizing the Trump administration’s treatment of scientists, which, according to the agency, “conveyed hatred of Trump & could be qualified as terrorism.”\n\nI guess around half of america are  terrorists now, according to whoever said that.",
                "So much for freedom of speech.",
                "Good thing he got to back to France and not deported to a concentration camp.",
                "Places people don’t want to go because they’re afraid of being jailed or deported for no reason:\n\n- Russia\n- North Korea\n- Iran\n- USA\n\nCongrats. Too much freedom I guess. ",
                "What a complete shit show.",
                "Anyone that thinks this person is just gonna go willingly after his term is up has another thing coming.",
                "”hatred of Trump & could be qualified as terrorism”. So I guess no one is going to be let into the USA anymore?",
                "USA is now just a fat North Korea",
                "I’ve never seen a country shoot itself in the foot to this degree in such a short span of time. Good luck attracting anyone other than MAGA style idiots at this point.",
                "Yamtits is the biggest man baby in the world with Elon a close second. It's amazing to me that bloated sack of monkey crap is actually president."
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "RISING",
            "title": "'Out of control' Tesla ploughs into pedestrians on busy London street injuring seven",
            "external_url": "https://www.lbc.co.uk/crime/tesla-crowd-london-stepney-green-east-end/",
            "upvotes": 9863,
            "date": "03/19/2025",
            "thumbnail": "https://images.lbc.co.uk/images/711463?width=692&crop=16_9&signature=2K0o7cbWGdo3vMUBKWoPQ0n4Qm0=",
            "top_comments": [
                "They're sick of being burned , they are revolting!",
                "Out of the way, citizen. Cities are for autonomous vehicles to drive through.",
                "Tessler. It's all computer.",
                "Musk is going to claim this Tesla was hacked by Ukraine.",
                "Oh oh they’re fighting back",
                "I do think its hilarious that Trump has ordered Musk and Boeing to hastily build him 2 new airforce ones. Teslas are garbage and Boeing is killing whistle-blowers on how faulty their shit is.",
                "So is this Counter Terrorism? Donald?",
                "Lidar is an hoax said the \"genius\"!",
                "This will make the stock price go up somehow.",
                "Maybe the Tesla felt threatened"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Trump fires both Democratic commissioners at FTC",
            "external_url": "https://www.reuters.com/world/us/trump-fires-both-democratic-commissioners-ftc-sources-say-2025-03-18/",
            "upvotes": 17128,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So Biden was for some reason unable to fire FTC chairs but all of a sudden Trump is able to. Interesting.",
                "Everyday is another outrage. Another law violated. And Congress just sits there like meek little sheepdogs. At this point, they all need to go",
                "Trump *illegally* fires both Democratic commissioners at FTC. \n\nFucking complicit media.",
                "If it's removing fraud and corruption and waste why is it only democrats?",
                "He said he’d only be a dictator on day one, wait, did Big Mac lie to us? ",
                "Dictator just doing dictator things, nothing to be alarmed of",
                "what's the consequence if we just ignore him the way he ignores the law? they could say \"oh no im still employed here, he has not fired me because he cannot fire me\" and what would be the functional difference?",
                "\"Illegally gutting the Commission will empower fraudsters and monopolists, and consumers will pay the price,\"\n\nWell we can see his motivation, Mr Mango \"The grift\" Mussolini.",
                "Trump considers every Democrat an enemy and that's why so many families don't talk anymore.",
                "\"The firings drew sharp criticism from Democratic senators...\"\n\nYes, we know, they are all outraged. I wish they did more."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "USDA cancels $1 billion in funding for schools and food banks slated for local farmers, ranchers and producers",
            "external_url": "http://www.cbsnews.com/news/usda-cancels-local-food-purchasing-food-banks-school-meals/",
            "upvotes": 6467,
            "date": "03/19/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/06/13/292c1ec7-31fc-447f-b459-5881c78671b3/thumbnail/1200x630/c42b2f227f9eb0f3da4219bb77f49fee/gettyimages-1243012161.jpg?v=765ef194a4bf4701e45ec9d5712af42f",
            "top_comments": [
                "I’m sure this will help the country.",
                "So we're ~~dropping~~  giving10 billion to farmers for assistance, but dropping money that helps farmers feed our children? What the fuck.\n\n[https://www.usda.gov/about-usda/news/press-releases/2025/03/18/usda-expediting-10-billion-direct-economic-assistance-agricultural-producers](https://www.usda.gov/about-usda/news/press-releases/2025/03/18/usda-expediting-10-billion-direct-economic-assistance-agricultural-producers)",
                "> \"Unlike the Biden Administration, which funneled billions in [Commodity Credit Corporation] funds into short-term programs with no plan for longevity, USDA is prioritizing stable, proven solutions that deliver lasting impact,\"\n\nThe Biden admin actually implemented plans to help the American people.\n\nThe Trump admin either destroys these programs with no alternative plan to action, or a plan to divert funds to personally enrich themselves and their wealthy friends.\n\nNot loudly broadcasting the accomplishments of the Biden admin is one of many misteps the Dems made, because the more programs the Trump admin destroys, the more clear it becomes just how much good Biden actually did.",
                "The Republican party hate the American people and get off by harming us.",
                "Trump voters just keep on winning.",
                "So, tariffs are supposed to encourage domestic production, but he's also slashing everything that actually makes domestic production possible.\n\nWe're going to envy the generation that lived thru the Great Depression because of this imbecile.",
                "If only they would’ve released a manual explaining step by step what their plan was. At least give folk a heads up ya’ know.",
                "Depriving food from children. That is America becoming great again",
                "Thats Donnie, Making America great. Those farmers, yeah they dont matter. Hope the Farmers knew better than to vote for that asshole.",
                "Why is school lunch not a thing? Does the government hate our kids that much?"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "RISING",
            "title": "Germany updates US travel advice after citizens detained",
            "external_url": "https://www.reuters.com/world/europe/germany-updates-us-travel-advice-after-citizens-detained-2025-03-19/",
            "upvotes": 6232,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump is really brilliant. The U.S. tourism market is worth 2.36 trillion dollars annually. \n\n  \nDoes making america great again include decimating its global lead in tourism revenue?",
                "Our tourism industry is about to implode.",
                "FRANCE had citizens rejected entry for anti-Trump messages on their phone just Today. Source: https://www.liberation.fr/international/amerique/un-scientifique-francais-refoule-a-son-entree-aux-etats-unis-pour-des-messages-anti-trump-paris-grince-des-dents-20250319_JD7JAIVY4ZHE5CI33F7TBNR4CI/\n\nTravel advice at this point should be: Level 3: Reconsider Travel due to a limited ability to provide emergency consular services and arbitrary enforcement of local laws, especially if entering from a 3rd country like Mexico or Canada. US Green card holders and those traveling on US visas should be prepared for their status to be canceled upon entry.\n\nGERMANS: CANCEL YOUR NON ESSENTIAL TRAVEL PLANS TO THE USA UNTIL THE POLITICAL CLIMATE REVERTS TO SOMETHING MORE NORMAL.",
                "Were all these customs agents or whatnot just chomping at the bit to detain/torture foreigners all these years but were constrained by presidents following the law/constitution?",
                "Considering under Trump, you can be scooped up and deported to detention centres with zero merit, or worse be unlawfully targeted and illegally detained as a ‘terrorist’, solely by word of mouth and no conviction…… that sure makes for a unsafe / unstable destination for foreign nationals. \n\nI would not travel to the USA under this Administration if you paid me to.",
                "“Don’t. Go. To. America.”\n\nYes. That’s all. \n\nJust fucking avoid it.  \n\nHow long?\n\nTen years minimum.",
                "We'll get like North Korea or Afghanistan or Russia. No reasonable Westerner will visit.",
                "No way will I go to the US in the near future",
                "i am a Canadian, I have a cruise planned for December that leave from Florida, I told my wife that if this keeps up without change until end of April that we are going to Europe or outright cancelling and eating our $1000 deposit",
                "WTF is the point of a fucking Visa or travel document if some customs person can just be like HMMMMMMM NAH"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Ice agents detain woman known for immigration advocacy in Colorado | US immigration",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/19/jeanette-vizguerra-ice-colorado",
            "upvotes": 2756,
            "date": "03/20/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/991982bb6db500e7e1f3657debdf43f0bf1cd9d2/0_100_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=25975fc1089e83dc3916494a8de3e43b",
            "top_comments": [
                "What happened to only going after rapists and murderers?",
                "From the article: \n\nShe pleaded guilty to “attempted possession of a forged instrument”, which the network noted prompted heightened scrutiny from immigration authorities. She spent the next several years appealing multiple deportation orders.\n\nVizguerra has had several stays during her attempts to seek citizenship, per CBS News, and sought refuge at churches.\n\nJordan Garcia of the American Friends Service Committee, who has been in contact with Vizguerra’s lawyer and family and spoke with the Associated Press, said Vizguerra had been trying to gain a visa since leaving sanctuary in churches in 2020.",
                "So we are ruzzia and China now. ",
                ">She gained national attention in 2017 when she took sanctuary in a Denver church to avoid deportation during the first Trump administration.\n\nAhh, so this is just settling another vendetta for Trump. Meanwhile he's got a rapist attacking the Prime Minister of Ireland because he let Rosie O'Donnell move there before he could round her up as well.",
                "Oh, come on.  A woman who entered the country illegally. Was convicted of using false documents (a fact conveniently omitted from this article) And ordered deported over 10 years ago during the Obama administration. \n\nBut let's not call her illegal, let's not call her convicted, let's not mention that she seeks sanctuary in churches to evade the law,  let's just call her \"an advocate\"",
                "She entered the country illegally, broke the law and folks are wondering why she's being deported?",
                "They really are following the manual, aren't they?",
                "What exactly does immigration advocacy mean? If it means she’s teaching people how to circumvent and cheat the immigration process… As a legal immigrant, I say lock her up.",
                "German guy here. I’ve red all about how this started and what it turned into growing up but I wasn’t really anticipating the live action adaption",
                "That’s ICE, go for the person work raising kids and paying their bills, bunch of f***ing losers"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Amtrak CEO Stephen Gardner resigns effective today \"to ensure that Amtrak continues to enjoy the full faith and confidence of this administration.\"",
            "external_url": "https://www.cnn.com/2025/03/19/business/amtrak-ceo-steps-down?cid=external-feeds_iluminar_google",
            "upvotes": 5465,
            "date": "03/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1496428067.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This is the State controlling industries by pressuring them to install loyal leadership.\n\n\nWhere are all the rightists worried about Oscialist boogeyman?",
                "Musk famously despises trains having proposed any number of harebrained train alternatives in order to stall or detail train initiatives.\n\nThis can’t end well.",
                "Prior to the pandemic, Amtrak was projected to hit profitability around 2022-2023 but the setback means that it’ll be a few more years (sans whatever bullshit Trump and Musk do). People yearn for the trains and this is documented significantly by the expansion of rail service in Virginia, The Midwest and elsewhere. \n\nThe Chicago-Twin Cities *Borealis* (aka 2nd round trip between the pairs) service that started last year has beaten ridership expectations and the stakeholders wanna add another trip a few years earlier than planned. Amtrak Virginia service has had ridership soar with each year beating the last. \n\nOne of the biggest issues I think Amtrak faces is, by law, they’re not allowed to fund/operate services less than 750miles (~1200km). Savannah, GA to New York *Palmetto*, Charlotte to New York *Carolinian* services for example are state funded because that’s the law, Amtrak is just the contractor. \n\nNot only this but Amtraks charter requires them to be profitable meaning that LD services are insanely expensive. \n\nIf we want Amtrak to be successful then we need to allow it to be far more independent than it already is. Let it run shorter and medium haul services that can generate a profit for longer distance trains to be subsidized. Expedite the overhaul and replacement of Amtrak equipment. \n\nHigh speed rail is useless without a good network of regional and intercity trains. People yearn for the trains.",
                "Great, I've got a ticket for a trip in a couple of months. I should probably start planning for alternative transportation in case they blow shit up.",
                "“I think we should privatize anything that can be privatized, just so you’ve got a feedback loop for improvement, is what happens when something’s privatized,”  - Musk\n\nWhat he really means is that we need more avenues for the rich to get richer and the poor to get poorer. This is how the country gets better right? After all, we have many examples of services being privatized and then improving greatly... /s",
                "“I think we should privatize anything that can be privatized, just so you’ve got a feedback loop for improvement, is what happens when something’s privatized,” Musk continued. **“Basically something’s got to have some chance of going bankrupt or there’s not a good feedback loop for improvement.”**\n\n\nMusk is a fucking idiot. He thinks that improvement can only be driven by money and not through passion or the desire to improve things in general. Shit stain thinks everything has to be related to money.",
                "Fascists always take control of the railroad companies/railways.\n\n🤷🏻‍♂️",
                "Don’t surrender in advance",
                "Who other than Elon is trusted by this administration?",
                "That spells BAD NEWS for Amtrak employees with what's going on now, think USPS and Dejoy."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "Sponsors drop San Francisco Pride as festival decries ‘rights backtracking’",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/18/anheuser-busch-coors-pull-sponsorship-san-francisco-pride?CMP=Share_iOSApp_Other",
            "upvotes": 2584,
            "date": "03/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/32ab4d32c19c3c344770611b49ff8ded0eeaa60e/36_0_1125_675/master/1125.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a73cd9c10171b464b1648dbb375a42f4",
            "top_comments": [
                "As a gay man, let me tell you that most people who celebrate Pride never thought much of corporate sponsorship. The best pride events are local gatherings,  in parks with picnics.  The ones with all the glam and glitz were just that - glam and glitz. I'd much rather spend an afternoon with friends and neighbors just hanging out than have music and glitz being pumped at me. \n\n\nFor those of us who celebrate togetherness and community, the loss of corporate money won't bother us much. Many of us also tend to support local versus corporate as well. ",
                "On the one hand, their \"support\" was always a gross, transparent attempt at profiteering. It was - or should have been - obvious to everyone that they would ditch LGBT stuff the minute social headwinds shifted\n\n\nThe concerning part is WHY they're doing it. The fact that all of these companies are bending the knee to an administration like this one is concerning (and dumb).",
                "Well this was very predictable and exactly why a number of people didn't want them there to begin with",
                "> The president has ordered that the US only recognize two sexes, sought to ban trans people from the military, and repealed policies promoting racial equity and protecting LGBTQ+ people from discrimination. Major US companies from Amazon to Google have announced they will end their diversity, equity and inclusion programs.\n\nI want to live in a world where people are judged on their individual merits and flaws, not as part of a group generalized by something they don't even have a choice over.\n\nApparently, according to POTUS, that makes me a member of the \"radical left\".\n\nFucking Republicans and non-voters (both of which are groups that people make an active choice to be a part of), ruining America.",
                "Time to make Pride a protest again.",
                "It’s the companies that stick around while the others slink away because it no longer benefits them that we should be paying attention to.",
                "It is sad to see from the perspective that these companies did not actually feel the support was the morally right thing to do….to support the community. It was the “cool” thing to do to make their money. The latest gimmick. Now they can go back to their overall concern and true views. \n\nI share that I am not part of the LGBTQ+ community. Companies supporting the community did nothing to affect my life. Meaning, this support they were showing did not influence me to buy or not buy their products/shop at their locations. For example, I didn’t go to the Target  because they supported the community. On the opposite of that, though, now they have shown their moral compass that they will flip and their support was not genuine. And that is more than disturbing and speaks volumes. What a truly sad state the US is in.\n\nI am an American living in Finland and watching all of this from afar and seeing the international perspective and reaction at the same time with the American perspective is really something.",
                "Fuck all these companies. And who gives a shit if they do or don't sponsor anything. Go out and enjoy yourselves and be who you want to be.",
                "They never believed in any of it anyway. Companies make every decision based on money.",
                "Corporate America has never been an ally"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "03/20/2025 12:15:48 UTC"
}