{
    "posts": [
        {
            "category": "HOT",
            "title": "Mattel CEO confirms plans to raise prices as he calls for zero tariffs on toys",
            "external_url": "https://www.cnn.com/2025/05/05/business/barbie-mattel-toy-tariffs-price-hike",
            "upvotes": 6661,
            "date": "05/08/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208881364.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "*On Monday, Kreiz said it will be relocating production of 500 toys from China to other countries.... however, that production will not shift to the United States.* \n\nMattel will mix and match according to Trump's whims.",
                "This administration is literally running with you shouldn't have anything and be happy. It wants nationalism without actually making things better",
                "Christmas looks to be a blood bath this year for retailers.",
                "The Trump That Stole Christmas.",
                "Can you imagine the never ending \"War on Christmas\" stories Fox News would be running if Biden or Obama or Clinton or Harris or anyone vaguely left leaning suggested that kids get less toys?",
                "Burgermeister Meisterburger",
                "Everyone is talking about toys but they're a very small part of what's going up in price. Everything is going up. Food, clothing, houses, electricity, gas... I can go on.",
                "How much Trump crypto does it take to buy an exemption for toys?",
                "Only need 3 dolls and 5 pencils. And 150 rounds of golf.",
                "Republicans still saying how this is necessary and is good in the long run"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "3 former Memphis officers acquitted in fatal beating of Tyre Nichols after he fled a traffic stop",
            "external_url": "https://www.cnn.com/2025/05/07/us/tyre-nichols-memphis-officers-trial",
            "upvotes": 11596,
            "date": "05/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-26113981.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Former Memphis officer Desmond Mills Jr., who was also charged in Nichols’ death, testified as a prosecution witness.\n\nNot only was it caught on camera, but one of them turned state's evidence, and they *still* got off?? JFC.",
                "> The three defendants still face the prospect of years in prison after they were convicted of federal charges last year.\n\nImportant info here but with this administration I'm sure it's going to go nowehere.",
                "2 other former cops pleaded guilty to avoid trial.  How mad are they at their lawyers right now?",
                "How the actual fucking fuck have they been acquitted? It’s on fucking video?",
                "So....they hit him extra times because they were mad that they had accidentally pepper sprayed themselves oh and because of said self inflicted pepper spray they couldn't tell they were actually hitting him in the head with their batons?\n\nWhat a fucking joke. These incompetent sociopaths belong in prison.",
                "The implications of this nonsensical defense and equally baffling jury verdict is highly disturbing and should be terrifying to all citizens there. They are basically legalizing death squads.",
                "Complete miscarriage of justice. We all saw the murder with our own eyes.",
                "This is the one where they are on camera holding his arms behind his back so the others can take turns punching and kicking him in the face, right? The one where they broke his fucking neck and still kept swinging on him, then propped him up against a car so they could keep going? The one where one of their own even kept asking what he did to deserve this and they couldn't give an answer?\n\nThose are the cops that got acquitted? Jesus fucking Christ. This murder was even more obvious than George Floyd and they acquitted them. This country is fundamentally broken in so many ways.",
                "That's incredible... with all the footage",
                "They beat a man to death"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Town official allegedly shoots lost DoorDash driver looking for directions: Police",
            "external_url": "https://abcnews.go.com/US/town-official-allegedly-shoots-lost-doordash-driver-directions/story?id=121521187",
            "upvotes": 23205,
            "date": "05/07/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d845f5c7-a11e-4f3c-8df2-db41b0f8055b/chester-ny-shooting-main-ht-jt-250506_1746551721498_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Reilly, 48, told the victim \"to get off his property,\" and then Reilly allegedly fired multiple shots at the driver while he was trying to leave in his car, police said.\n\nHe tells him to leave, so he tries to leave, but he gets shot anyway, *in the fucking back*. Fuck this guy forever.",
                ">He \"approached several homes asking for directions before arriving at the residence of John Reilly III,\" who is the Town of Chester highway superintendent, police said.\n\n>Reilly, 48, told the victim \"to get off his property,\" and then Reilly allegedly fired multiple shots at the driver while he was trying to leave in his car, police said.\n\nWhen someone pulls into my driveway, my first inclination is to assume they're probably turning around. My second is I'm about to win money from the Prize Patrol. Further down the line is that they're armed Nova Scotia separatist radicals. \n\n>Reilly -- who is a federally licensed firearms dealer -- was charged with first-degree assault, second-degree criminal possession of a weapon and criminal possession of a firearm, police said. \n\nThose guns are probably going to go away. New York state doesn't allow felons to possess firearms. All because he wanted to \"stand his ground\".",
                "Imagine being such a paranoid scaredy cat little baby you have to shoot at someone just because they went up your driveway, and I bet he thinks he's acting manly.",
                ">Reilly -- who is a federally licensed firearms dealer -- was charged with first-degree assault, second-degree criminal possession of a weapon and criminal possession of a firearm, police said. \n\nFederally licensed firearms dealer has illegal gun. Fantastic.",
                " Assault is really underselling what he did. He deliberately shot at someone he knew wasn't a threat to him, he should be getting tried for attempted murder.",
                "Getting lost... **try that in a small town.*",
                ">Reilly, 48, told the victim \"to get off his property,\" and then Reilly allegedly fired multiple shots at the driver while he was trying to leave in his car, police said.\n\n>The driver was shot once in the back and hospitalized with serious injuries, police said. He's currently in stable condition, police said on Tuesday.\n\n>>**Reilly -- who is a federally licensed firearms dealer**\n\nTypical. The victim was complying and attempting to leave, there was no reason to open fire. This is just another \"*GoOd GuY wItH a GuN*\" looking for an excuse to shoot someone. He's made it abundantly clear that he is a danger to society and belongs in prison for the rest of his life.",
                "This must be that “polite society” they told us we’d have if everyone was armed",
                "It's really touching that both DoorDash and the town have issued statements of remorse for the driver without offering to help cover the guy's medical bills.",
                "Fox News: “they’re coming for your guns” \nDoorbell: ding"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Cardinals fail to elect new pope on first day of the conclave",
            "external_url": "https://www.cnn.com/world/live-news/new-pope-conclave-day-one-05-07-25",
            "upvotes": 2360,
            "date": "05/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2212927494.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So I still have time to watch Conclave and pretend I know how it all works?",
                "Just the first day.   The elections of Popes Benedict XVI and Francis were swift by historical standards. Both popes were appointed on the second day of voting. Benedict required four rounds of voting; Francis took five.\n\nPope John Paul II, Benedict’s predecessor, took slightly longer. He was elected in 1978 on the third day of voting, in the eighth round. \n\nThe longest record was some 3 years and a few Cardinals died during the voting.  The shortest record was only 10 hours.",
                "Still time for Tedesco",
                "What does this mean for LeBron’s legacy?",
                "Good food, good wine, good friends, nice accommodations.  Let's take our time, just to be very sure.",
                "Is this like pirates of the Caribbean where they all vote for themselves so a decision can’t be made?",
                "Was anyone at all expecting them to have a first round pick?",
                "Does the Vatican have a version of the pizza index we can track?",
                "Is it a best-of-seven?  They can still lose three more games.",
                "The Conclave of 1268 lasted 3 years. I don't think it's \"failing\" to not elect a Pope on the first day. Lol"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration has shut down CDC's infection control committee",
            "external_url": "https://www.nbcnews.com/health/health-news/trump-administration-shut-cdcs-infection-control-committee-rcna205209",
            "upvotes": 11530,
            "date": "05/07/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250507-cdc-protest-mb-0855-2b14d1.jpg",
            "top_comments": [
                "Americans will soon not be allowed to enter other countries without proof of vaccination",
                "Its hard not to think they're just trying to manufacture a crisis and get people killed at this point.",
                "Destroying government is easy. Fixing it will take much longer. All this is being done so Trump has more power and regular people have less control. ",
                "To understand why they are doing this kind of thing it helps to keep in mind that Trump hates America and the American people.  He HATES us for the 2020 election.  When you consider what he did to his first wife it starts to make sense.   Ivana Trump wrote a book that described the time he raped her after having scalp surgery. After that he openly cheated on her, divorced her, sued for custody of the kids he didn't want, eventually \"forgave\" her but somehow she died falling down stairs and is now buried in an untended grave on a golf course.  Probably in a  coffin packed with classified documents he stole.\n\nHe hates us and he's going to keep punishing us in any way he can until he's dead.",
                "Just like he did weeks before Covid was discovered in China.  ",
                "I will never forgive what Hanlon's Razor has done to the collective and the way people perceive malice. People would rather believe that this administration is full of stupid people who are too dumb to realize the harm they're causing rather than dangerous sociopaths whose sole purpose is to kill as many people as possible in the cruelest ways possible.",
                "Never forget how the Trump admin bumbled their way through covid.",
                "Trump and his cult are at war with higher learning because they know that don't have it and if they don't have it, it must be evil.",
                "If your intent was to prime the pump for a huge pandemic you'd do exactly what they are doing.",
                "after our dumb shit societal response to covid, it made it abundantly clear to our adversaries that a super casual biologic weapon would completely fuck us. \n\nLet's even assume that COVID was a lab leak- imagine how screwed we'd be if it was an engineered virus. No amount of racism, bravado, or screeching would stop said virus from fucking you over while you whine about wearing a mask."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump plans to end Energy Star home appliance program amid EPA reorganization",
            "external_url": "https://www.reuters.com/business/energy/trump-administration-plans-end-energy-star-program-home-appliances-washington-2025-05-06/",
            "upvotes": 7151,
            "date": "05/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> “Let’s be clear: Cutting the popular Energy Star program - which helps everyday households and businesses save on their energy bills - would mark another rash attempt by this administration to line the pockets of billionaires and utility companies at the expense of hardworking Americans,\" she said in a statement.\n\nEnergy efficiency saves consumers money, and that's vital during a time when people are struggling to afford the cost of living. Not to mention how critical strides in energy efficiency are when it comes to our whole population's environmental impact.",
                "They’re reaching into every corner and crevice to eliminate anything that is good in any way.",
                "Something that saved Americans billions of dollars ",
                "This is a program that has directly saved me money on my bills, and has helped tremendously with reducing load on the electric grid.  \n\n\nGetting rid of the program that has helped me save thousands of dollars is short sighted and a blatant middle finger to progress. ",
                "The EPA is being gutted and dismantled. Why can't our media relay accurate headlines? This is not a 'reorganization'.",
                "This guy is such a fuckin asshole. Seriously, go fuck yourself don",
                "I can't say what I really want to happen to him since my account was already warned for telling people to \"learn to f ght back\" on a post about police forceably removing an elderly woman from a town hall",
                "The US Chamber of Commerce is begging Republicans not to end an energy efficiency regulatory program. We are basically in The Upside Down now.",
                "So he wants Europe and Asia to buy more American products but doesn't want those products to meet the standards of those countries.",
                "Conservatives, can you please provide your opinion as to why this is a good thing?\n\n- manufactures create e ergy efficient products and get this label\n- consumers buy and save on energy\n- municipalities see less strain on the grid \n\n\nThis is legit good all around and forces R&D for companies to produce more energy efficient devices to compete"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "WeightWatchers files for bankruptcy amid rise of weight-loss drugs",
            "external_url": "https://www.aljazeera.com/economy/2025/5/7/weightwatchers-files-for-bankruptcy-amid-rise-of-weight-loss-drugs",
            "upvotes": 2733,
            "date": "05/07/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/05/AP25126856600680-1746610063_384f18-1746610427.jpg?resize=1200%2C630&quality=80",
            "top_comments": [
                "It's funny that the article even mentions that weight watchers also acquired a company that prescribes these weight loss drugs to people too.",
                ">The diet company formerly known as WeightWatchers has filed for bankruptcy after its 62-year-old business model was put under strain by the rise of weight-loss drugs such as Ozempic.\n\n[Ozempic users are also spending less on groceries.](https://progressivegrocer.com/do-weight-loss-drugs-lead-grocery-sales-losses) There's plenty of industries taking a hit because of weight loss drugs. No surprise restaurant chains are also filing bankruptcy.",
                "My view is: Any organization that is meant to solve a problem should have a goal to put itself out of business. For example, I volunteer for organizations that promote organ donation. They know that as soon as permanent solutions are developed, their mission is fulfilled.\n\nHowever, is Ozempic/etc. the correct answer? Maybe, maybe not for a multitude of reasons. If it is not, then an organization such as Weight Watchers is still theoretically needed.",
                "They need to go down to San Antonio. Gold mine down there I hear.",
                "I'm no expert, but I feel like this was the straw that broke the camel's back, but I think the Internet also has made programs like Weight Watchers a lot less effective. Why pay for what is essentially glorified advice on how to eat healthy when you can find 1000 tiktok nutritonist who are legitimate and give much more nuanced nutrition advice. \n\nBack in the 90's it made sense, the Internet was far more niche, and nutritonists were expensive, you couldn't reliably find dieting tips that were effective. \n\nNow you can't take 10 steps without tripping over some actually legitimately good nutritonists. People who are realistic and don't have this expectation that every person is going to eat nothing but grilled chicken, fruit, and salad for every meal. People who know you are going to cheat and give you ways to minimize the harm a cheat day does. \n\nAs a frame of reference, I lost over 100 lbs last year just from diet changes (and a bit of exercise, but mostly diet), I did very little research, I just started off by cutting out obviously bad things (fried foods, processed red meats), and then just randomly saw quite a few accounts that gave good advice on effective fast food orders. Like legitimate realistic advice that made it a lot easier to stay consistent.",
                "*“The decisive actions we’re taking today, with the overwhelming support of our lenders and noteholders, will give us the flexibility to accelerate innovation, reinvest in our members, and lead with authority in a rapidly evolving weight management landscape,” CEO Tara Comonte said in a statement*\n\nWhenever I see that word \"innovation\" when coming from a CEO, I think of the appearance of a solution. Of course, the word \"drug\" when dealing with excess weight, inspires me even less.",
                "As someone who used Weight Watchers several times, this is not surprising for a very big reason: They have no real identity as a company anymore. For a long time it was a regular point system, and then transferred to several, and then they were Points Plus, and then they were color coded as blue/green/purple plans depending on your goals, and then came the zero point foods...\n\n\nMy point being that there was no real core identity to focus on. There was no real \"winning\" solution they could market because they kept changing the fundamentals and principles of the program. Yes, it centered around points, but they constantly changed the \"rules\" of the program with no real evidence to back up why. It just seems like they did it to appease people who didn't want to be diligent in counting points for this or that. It's tough to count calories, they saw the breakthrough by taking big numbers out of it, but they just had no allegiance to their core methods.\n\n\nSo yes, Ozempic and other drugs might have put a damper on things, but they were losing popularity before withing communities I'm in anyway.",
                "Weight Watchers started out as a support group. It was really simple. I don’t even think it was a business.    \n\nBut it got taken over by people trying to monetize it, and by the time I walked into one of their offices, they were selling snacks. Highly processed low-fat snacks.",
                "This article popped up right under a weightwatchers ad",
                "I knew WW didn't work the minute Oprah Winfrey abandoned the shit and went directly for the Ozempic shots. It was just nonsense all along, while she was cashing those checks - as if she needed more money. \n\nAdd WW to the list of scams Oprah's run, Dr Oz Dr Phil and all those other gurus of stupid shit advice."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Tourist helicopter suddenly broke apart and crashed into the Hudson River, NTSB preliminary report finds",
            "external_url": "https://lite.cnn.com/us/tourist-helicopter-suddenly-broke-apart-and-crashed-into-the-hudson-river-ntsb-preliminary-report-finds",
            "upvotes": 1334,
            "date": "05/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Well the rotor’s not supposed to come free and chop the tail off, that’s for sure.  Though I suppose that is exactly what a catastrophic failure looks like: “suddenly breaking apart.”",
                "Anyone who saw that video could come to that conclusion...",
                "Holy shit. 8th helicopter tour that day. Same plane. Imagine if you were one of the previous 7 tours that day…",
                "https://www.flickr.com/photos/ntsb/albums/72177720325056299/",
                "Well you see, the front fell off.",
                "Where’s the news? Didn’t we already know this? HOW did it “suddenly” break apart? What went wrong?",
                "Discussing this with a Aviation Safety expert for one of the US Government Dept.  He said it reminded him of a similar event about ten or more years ago.  Lot of similarity.  One of the passengers was seated in front next to pilot.  After the event examination of wreckage found camera strap for camera used by tourist wrapped around controls.  It was suggested that a rapid move by the tourist to bring him camera toward a scene to photograph exerted unusual pressure on the controls.  The input caused the aircraft to rise sharply and brought one of the main rotors in contact with the part of the hull behind the cabin causing it to disintegrate.  Hull separation occurred not until the NY incident.    \n\n\nThis was just a similar accident with a probable cause.   NTSB is still working on this facts available to them.",
                "This is only the preliminary report guys, their answer may change",
                "Can Nathan fielder recreate this portraying the pilot’s life from birth up until this point, including but not limited to being breastfed by an enormous puppet, feeding rocks to his little sister, pronunciation on the word “left”, along with purchasing an iPod and enjoying the band evenascense?",
                ">Tourist helicopter suddenly broke apart and crashed into the Hudson River, NTSB preliminary report finds\n\nTIL that i am qualified to be an NTSB investigator because that was blatantly obvious from the video lol"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Woman says security guard at Liberty Hotel in Boston confronted her in bathroom, asked to prove gender",
            "external_url": "https://www.cbsnews.com/boston/news/women-boston-liberty-hotel-bathroom-gender/",
            "upvotes": 6160,
            "date": "05/07/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/06/ba497b68-8a58-4675-8a4a-c37e1e01d50a/thumbnail/1200x630/5c5d7d9b32f58d43fdd437a62e034e18/couple.jpg?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "The irony of doing this in Liberty Hotel",
                "So a man went into the women’s room and tried to find out what someone using that women’s rooms genitals look like? \n\nIsn’t that the whole thing these people are supposedly mad about? The thing they supposedly want to prevent is actually happening because they’re so scared of a trans woman potentially being in the stall next to them?",
                "An actual man walked into the women’s bathroom and harassed a woman. This is why these conservatives gross me out- I’ve never been harassed by a transgender person but I’ve been plenty harassed by men.",
                "> Ansley Baker and her girlfriend, Liz Victor, went to a Kentucky Derby party at the hotel Saturday. The couple, who are both cis women, said their afternoon ended when hotel security searched the women's restroom and allegedly asked them to show their identification to prove their sex. \n\nRemembering how terfs talked about protecting lesbians and end up creating environment where they’re harassed\n\n> Nina Selvaggio, the Executive Director of the Greater Boston PFLAG, said this incident is the result of ramped up rhetoric at the national level. Selvaggio pointed to a statistic that showed Massachusetts hate crimes have hit a 20-year high.  \n\n>\"For gender nonconforming, lesbians, women in general, being harassed in public restrooms is a tale as old as time. I do think the surge in national anti-trans rhetoric is contributing to an increased policing of women's bodies and their expression of gender,\" Selvaggio said.",
                "Sure would be interesting to hear from the hotel why an investigation was not done before they put out their first statement which put blame on the couple.",
                "I'm so glad we have these brave mall cops who are willing to harass women trying to take a piss. If only we could get some brave officers to patrol our elementary school classrooms for liter boxes next.",
                "All this fighting about bathrooms and it ends up being creepy guys asking women to show them what's in their pants in the name of \"protecting women\".\n\nAm I surprised? No. Am I tired of these bullshit debates? Hell yes. Just let people take a shit in peace for Pete's sake.",
                "I’m not afraid of transwomen being in a bathroom with me. I’m afraid of cismale transphobic misogynists being in a bathroom with me.",
                "I’m a male, how do women’s bathrooms work? Aren’t there just a bunch of stalls and then sinks and mirrors outside the stalls? Are women walking around naked in there? It’s not like a locker room, right? Even if a straight male walked in there (by mistake) they wouldn’t see anything, right? The whole thing is stupid. I have seen many of a women use the men’s room when the lady’s line was to long, nobody gave a shit.",
                "Will TERFs like JK Rowling tweet all day about the injustice done to this woman? That not only did a guard harass her, but also other women in the bathroom said “he [sic] is a creep get him out”! Will she say they failed to be true allies? I suspect no TERFs will give a shit when they see the woman’s picture because they don’t care about women’s rights - they are about the correct women’s (eg their own) rights and mostly the right to have society conform to them.\n\nHappy to be corrected if any TERFs stand up"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Woman killed by alligator during couple canoe trip, husband tried to save her",
            "external_url": "https://abcnews.go.com/US/woman-killed-alligator-couple-canoe-trip-husband-save/story?id=121552147",
            "upvotes": 1917,
            "date": "05/07/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a5832958-6383-4320-b9ff-090a6fe9aa7c/gator-attack-wfaa-jef-250507_1746642008077_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "We rode over an alligator once and I could feel the ridges on its back scraping the boat as we slid over it. I was fully expecting the equivalent of the hippo scene in Congo but nothing happened. I have never wanted to hit one of my friends that badly in my life for taking us over it. (On purpose. \"Haha, should have seen your face!\")\n\nNever went anywhere near the water with that asshole again.",
                "What a horrible way to go. And for the husband to witness it. RIP.",
                "This is tragic. I did however chuckle at them locating an alligator \"matching the description\".",
                "In Florida you don't do murky, that being said gators are pretty timid compared to their cousins and tend to avoid places with a lot of boat traffic of any type",
                "This happened to a famous guy a few years back in Africa. Crocodile snatched him right out of the canoe.",
                "Pretty scary stuff. I did a Backcountry Everglades canoe trip a couple years ago and there was a 10ft croc on our trailhead. Not even a gator, a straight up croc. He got spooked by our noise and vanished completely into the water on the trailhead, roughly 3 feet deep. We paddled past him roughly 150 ft up the trail as he got out onto a slide, and he luckily must have eaten recently because he paid us no mind despite us being a few mere feet away from him. But in the back of my head for the whole trip all I could think of is how easily he vanished and how there could be anything below us at any given moment. At his size he very easily could have capsized our canoe if he really wanted to. Extremely unfortunate for this couple.",
                "Soon to be an episode of Dateline.",
                "11ft 4in gator? Thats quite a large gator to be rowing your canoe over. Been a Florida man for 30+ years and seen many big gators but that would be one of the largest ones I’ve seen in the wild.",
                "When I was a teenager, my mom and I went canoeing in the Okefenokee swamp. I was paddling up front and my mom said \"Watch out for that gator!\" I said \"What gator?\" and steered right over it. The canoe just brushed the top of it, and it swam away looking relatively unperturbed.",
                "Canoe drifted over a gator, probably didn't even see it.  The gator reacted like the wild animal it is.  Just one of those tragic things that happens."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Mattel CEO confirms plans to raise prices as he calls for zero tariffs on toys",
            "external_url": "https://www.cnn.com/2025/05/05/business/barbie-mattel-toy-tariffs-price-hike",
            "upvotes": 6668,
            "date": "05/08/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208881364.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "*On Monday, Kreiz said it will be relocating production of 500 toys from China to other countries.... however, that production will not shift to the United States.* \n\nMattel will mix and match according to Trump's whims.",
                "This administration is literally running with you shouldn't have anything and be happy. It wants nationalism without actually making things better",
                "Christmas looks to be a blood bath this year for retailers.",
                "The Trump That Stole Christmas.",
                "Can you imagine the never ending \"War on Christmas\" stories Fox News would be running if Biden or Obama or Clinton or Harris or anyone vaguely left leaning suggested that kids get less toys?",
                "Burgermeister Meisterburger",
                "Everyone is talking about toys but they're a very small part of what's going up in price. Everything is going up. Food, clothing, houses, electricity, gas... I can go on.",
                "How much Trump crypto does it take to buy an exemption for toys?",
                "Only need 3 dolls and 5 pencils. And 150 rounds of golf.",
                "Republicans still saying how this is necessary and is good in the long run"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Cardinals fail to elect new pope on first day of the conclave",
            "external_url": "https://www.cnn.com/world/live-news/new-pope-conclave-day-one-05-07-25",
            "upvotes": 2365,
            "date": "05/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2212927494.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So I still have time to watch Conclave and pretend I know how it all works?",
                "Just the first day.   The elections of Popes Benedict XVI and Francis were swift by historical standards. Both popes were appointed on the second day of voting. Benedict required four rounds of voting; Francis took five.\n\nPope John Paul II, Benedict’s predecessor, took slightly longer. He was elected in 1978 on the third day of voting, in the eighth round. \n\nThe longest record was some 3 years and a few Cardinals died during the voting.  The shortest record was only 10 hours.",
                "Still time for Tedesco",
                "What does this mean for LeBron’s legacy?",
                "Good food, good wine, good friends, nice accommodations.  Let's take our time, just to be very sure.",
                "Is this like pirates of the Caribbean where they all vote for themselves so a decision can’t be made?",
                "Was anyone at all expecting them to have a first round pick?",
                "Does the Vatican have a version of the pizza index we can track?",
                "Is it a best-of-seven?  They can still lose three more games.",
                "The Conclave of 1268 lasted 3 years. I don't think it's \"failing\" to not elect a Pope on the first day. Lol"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Tourist helicopter suddenly broke apart and crashed into the Hudson River, NTSB preliminary report finds",
            "external_url": "https://lite.cnn.com/us/tourist-helicopter-suddenly-broke-apart-and-crashed-into-the-hudson-river-ntsb-preliminary-report-finds",
            "upvotes": 1333,
            "date": "05/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Well the rotor’s not supposed to come free and chop the tail off, that’s for sure.  Though I suppose that is exactly what a catastrophic failure looks like: “suddenly breaking apart.”",
                "Anyone who saw that video could come to that conclusion...",
                "Holy shit. 8th helicopter tour that day. Same plane. Imagine if you were one of the previous 7 tours that day…",
                "https://www.flickr.com/photos/ntsb/albums/72177720325056299/",
                "Well you see, the front fell off.",
                "Where’s the news? Didn’t we already know this? HOW did it “suddenly” break apart? What went wrong?",
                "Discussing this with a Aviation Safety expert for one of the US Government Dept.  He said it reminded him of a similar event about ten or more years ago.  Lot of similarity.  One of the passengers was seated in front next to pilot.  After the event examination of wreckage found camera strap for camera used by tourist wrapped around controls.  It was suggested that a rapid move by the tourist to bring him camera toward a scene to photograph exerted unusual pressure on the controls.  The input caused the aircraft to rise sharply and brought one of the main rotors in contact with the part of the hull behind the cabin causing it to disintegrate.  Hull separation occurred not until the NY incident.    \n\n\nThis was just a similar accident with a probable cause.   NTSB is still working on this facts available to them.",
                "This is only the preliminary report guys, their answer may change",
                "Can Nathan fielder recreate this portraying the pilot’s life from birth up until this point, including but not limited to being breastfed by an enormous puppet, feeding rocks to his little sister, pronunciation on the word “left”, along with purchasing an iPod and enjoying the band evenascense?",
                ">Tourist helicopter suddenly broke apart and crashed into the Hudson River, NTSB preliminary report finds\n\nTIL that i am qualified to be an NTSB investigator because that was blatantly obvious from the video lol"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Disney's new theme park to be in Abu Dhabi",
            "external_url": "https://www.npr.org/2025/05/07/nx-s1-5389601/disney-park-abu-dhabi",
            "upvotes": 242,
            "date": "05/07/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3418x1923+0+1/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc4%2F30%2Fd5faf1c741afb849f21bb6c4f525%2Fdisney-experiences-abu-dhabi-rendering1.jpg",
            "top_comments": [
                "Slave labor to build the Mouse a new house.",
                "That doesn't sound like a comfortable environment for a theme park.  Or will it all be inside?",
                "What’s are the average number of wet bulb temperature extremes days predicted for the near and long term climate outlook in the region, again? \n\nAnd what was the heat index max for Abu Dhabi last year? \n\nOh, [only 144° F](https://www.washingtonpost.com/weather/2024/07/18/persian-gulf-dubai-heat-climate/).",
                "They’re gonna make Minnie wear a full on Burqa while pretending to be a progressive welcoming company. ",
                "Why would I bring my kids to the middle east ?",
                "Could you imagine the prices..",
                "100% Investor Bait.\n\nOh, hey, Disney's getting its lunch money stolen by Epic Worlds? Time to announce a new park in a place absolutely dripping with money.\n\nAnd while you're looking at this big beautiful plan about the future, please ignore how absolutely dire the actual current financials are.",
                "At least Nermal will have something to do over there.",
                "So Nermal is winning now?",
                "Let me take you on a halal carpet ride...."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "3 former Memphis officers acquitted in fatal beating of Tyre Nichols after he fled a traffic stop",
            "external_url": "https://www.cnn.com/2025/05/07/us/tyre-nichols-memphis-officers-trial",
            "upvotes": 11595,
            "date": "05/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-26113981.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Former Memphis officer Desmond Mills Jr., who was also charged in Nichols’ death, testified as a prosecution witness.\n\nNot only was it caught on camera, but one of them turned state's evidence, and they *still* got off?? JFC.",
                "> The three defendants still face the prospect of years in prison after they were convicted of federal charges last year.\n\nImportant info here but with this administration I'm sure it's going to go nowehere.",
                "2 other former cops pleaded guilty to avoid trial.  How mad are they at their lawyers right now?",
                "How the actual fucking fuck have they been acquitted? It’s on fucking video?",
                "So....they hit him extra times because they were mad that they had accidentally pepper sprayed themselves oh and because of said self inflicted pepper spray they couldn't tell they were actually hitting him in the head with their batons?\n\nWhat a fucking joke. These incompetent sociopaths belong in prison.",
                "The implications of this nonsensical defense and equally baffling jury verdict is highly disturbing and should be terrifying to all citizens there. They are basically legalizing death squads.",
                "Complete miscarriage of justice. We all saw the murder with our own eyes.",
                "This is the one where they are on camera holding his arms behind his back so the others can take turns punching and kicking him in the face, right? The one where they broke his fucking neck and still kept swinging on him, then propped him up against a car so they could keep going? The one where one of their own even kept asking what he did to deserve this and they couldn't give an answer?\n\nThose are the cops that got acquitted? Jesus fucking Christ. This murder was even more obvious than George Floyd and they acquitted them. This country is fundamentally broken in so many ways.",
                "That's incredible... with all the footage",
                "They beat a man to death"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Polish police detain man after he kills one person with axe at Warsaw University",
            "external_url": "https://www.reuters.com/world/europe/polish-police-detain-man-after-he-kills-one-person-with-axe-warsaw-university-2025-05-07/",
            "upvotes": 240,
            "date": "05/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They'll arrest you for anything these days",
                "22yo law student with an axe? Was his name Raskolnikov?",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "WeightWatchers files for bankruptcy amid rise of weight-loss drugs",
            "external_url": "https://www.aljazeera.com/economy/2025/5/7/weightwatchers-files-for-bankruptcy-amid-rise-of-weight-loss-drugs",
            "upvotes": 2739,
            "date": "05/07/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/05/AP25126856600680-1746610063_384f18-1746610427.jpg?resize=1200%2C630&quality=80",
            "top_comments": [
                "It's funny that the article even mentions that weight watchers also acquired a company that prescribes these weight loss drugs to people too.",
                ">The diet company formerly known as WeightWatchers has filed for bankruptcy after its 62-year-old business model was put under strain by the rise of weight-loss drugs such as Ozempic.\n\n[Ozempic users are also spending less on groceries.](https://progressivegrocer.com/do-weight-loss-drugs-lead-grocery-sales-losses) There's plenty of industries taking a hit because of weight loss drugs. No surprise restaurant chains are also filing bankruptcy.",
                "My view is: Any organization that is meant to solve a problem should have a goal to put itself out of business. For example, I volunteer for organizations that promote organ donation. They know that as soon as permanent solutions are developed, their mission is fulfilled.\n\nHowever, is Ozempic/etc. the correct answer? Maybe, maybe not for a multitude of reasons. If it is not, then an organization such as Weight Watchers is still theoretically needed.",
                "They need to go down to San Antonio. Gold mine down there I hear.",
                "I'm no expert, but I feel like this was the straw that broke the camel's back, but I think the Internet also has made programs like Weight Watchers a lot less effective. Why pay for what is essentially glorified advice on how to eat healthy when you can find 1000 tiktok nutritonist who are legitimate and give much more nuanced nutrition advice. \n\nBack in the 90's it made sense, the Internet was far more niche, and nutritonists were expensive, you couldn't reliably find dieting tips that were effective. \n\nNow you can't take 10 steps without tripping over some actually legitimately good nutritonists. People who are realistic and don't have this expectation that every person is going to eat nothing but grilled chicken, fruit, and salad for every meal. People who know you are going to cheat and give you ways to minimize the harm a cheat day does. \n\nAs a frame of reference, I lost over 100 lbs last year just from diet changes (and a bit of exercise, but mostly diet), I did very little research, I just started off by cutting out obviously bad things (fried foods, processed red meats), and then just randomly saw quite a few accounts that gave good advice on effective fast food orders. Like legitimate realistic advice that made it a lot easier to stay consistent.",
                "*“The decisive actions we’re taking today, with the overwhelming support of our lenders and noteholders, will give us the flexibility to accelerate innovation, reinvest in our members, and lead with authority in a rapidly evolving weight management landscape,” CEO Tara Comonte said in a statement*\n\nWhenever I see that word \"innovation\" when coming from a CEO, I think of the appearance of a solution. Of course, the word \"drug\" when dealing with excess weight, inspires me even less.",
                "As someone who used Weight Watchers several times, this is not surprising for a very big reason: They have no real identity as a company anymore. For a long time it was a regular point system, and then transferred to several, and then they were Points Plus, and then they were color coded as blue/green/purple plans depending on your goals, and then came the zero point foods...\n\n\nMy point being that there was no real core identity to focus on. There was no real \"winning\" solution they could market because they kept changing the fundamentals and principles of the program. Yes, it centered around points, but they constantly changed the \"rules\" of the program with no real evidence to back up why. It just seems like they did it to appease people who didn't want to be diligent in counting points for this or that. It's tough to count calories, they saw the breakthrough by taking big numbers out of it, but they just had no allegiance to their core methods.\n\n\nSo yes, Ozempic and other drugs might have put a damper on things, but they were losing popularity before withing communities I'm in anyway.",
                "Weight Watchers started out as a support group. It was really simple. I don’t even think it was a business.    \n\nBut it got taken over by people trying to monetize it, and by the time I walked into one of their offices, they were selling snacks. Highly processed low-fat snacks.",
                "This article popped up right under a weightwatchers ad",
                "I knew WW didn't work the minute Oprah Winfrey abandoned the shit and went directly for the Ozempic shots. It was just nonsense all along, while she was cashing those checks - as if she needed more money. \n\nAdd WW to the list of scams Oprah's run, Dr Oz Dr Phil and all those other gurus of stupid shit advice."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US planning to deport migrants to Libya despite ‘hellish’ conditions – reports | Libya",
            "external_url": "https://www.theguardian.com/world/2025/may/07/us-planning-to-deport-migrants-to-libya-despite-hellish-conditions-reports",
            "upvotes": 1096,
            "date": "05/07/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8913014985a092fa92543b11a1443ab76b4e2624/485_0_1709_1367/master/1709.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cdd9b29ffe9c70eabf4ee5950b39c453",
            "top_comments": [
                "*In its annual human rights report released last year, the US state department criticised Libya’s “harsh and life-threatening prison conditions” and “arbitrary arrest or detention”, citing how migrants , including children, had “no access to immigration courts or due process”.*\n\nThe above is one of most mild assessments of Libyan prisons and detention centers. It would be a compressed life sentence to send migrants to this torturous hell hole.",
                "El salvador full already?\n\nNow they are shipping them to a warzone?",
                "\"Despite\"? I think you mean \"Because of\". Remember: cruelty is the point.",
                "How about deporting old, fat, orange convicted sex offender felons?",
                "Nothing would surprise me at this point. The vile cruelty of this bunch is astounding.",
                "If Congress does nothing, they are implicitly granting that power to Trump. Republicans in Congress could stop all of this, but so far…nothing. All of the powers Trump is using were delegated to the president by Congress, so Congress could take them back.",
                "#When are we going to say fuck it and remove Trump from office, charge him for his crimes and throw his ass in prison?\n\n\n#when?",
                "One has to ask… Why are Republicans so dead set on circumventing the justice system (and the Constitution)? I believe it’s because 1) Cruelty is the point, 2) They know and want extreme abuses to occur that will not fly in America, and 3) they want to ship perceived enemies out of country so they can pull the BS of “ well yeah we screwed up, but ooops we don’t have any control or say in the camp/prison they are in now. Too bad.”.",
                "Why aren't they returning them to their home countries?",
                "It's getting increasingly clear that Trump's actual plan is to get people to self deport by making examples of a few.  Just the other day I saw an advertisement from the government basically saying we're coming for you.  But his cruelty really can't match what may be happening south of the border."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Woman killed by alligator during couple canoe trip, husband tried to save her",
            "external_url": "https://abcnews.go.com/US/woman-killed-alligator-couple-canoe-trip-husband-save/story?id=121552147",
            "upvotes": 1918,
            "date": "05/07/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a5832958-6383-4320-b9ff-090a6fe9aa7c/gator-attack-wfaa-jef-250507_1746642008077_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "We rode over an alligator once and I could feel the ridges on its back scraping the boat as we slid over it. I was fully expecting the equivalent of the hippo scene in Congo but nothing happened. I have never wanted to hit one of my friends that badly in my life for taking us over it. (On purpose. \"Haha, should have seen your face!\")\n\nNever went anywhere near the water with that asshole again.",
                "What a horrible way to go. And for the husband to witness it. RIP.",
                "This is tragic. I did however chuckle at them locating an alligator \"matching the description\".",
                "In Florida you don't do murky, that being said gators are pretty timid compared to their cousins and tend to avoid places with a lot of boat traffic of any type",
                "This happened to a famous guy a few years back in Africa. Crocodile snatched him right out of the canoe.",
                "Pretty scary stuff. I did a Backcountry Everglades canoe trip a couple years ago and there was a 10ft croc on our trailhead. Not even a gator, a straight up croc. He got spooked by our noise and vanished completely into the water on the trailhead, roughly 3 feet deep. We paddled past him roughly 150 ft up the trail as he got out onto a slide, and he luckily must have eaten recently because he paid us no mind despite us being a few mere feet away from him. But in the back of my head for the whole trip all I could think of is how easily he vanished and how there could be anything below us at any given moment. At his size he very easily could have capsized our canoe if he really wanted to. Extremely unfortunate for this couple.",
                "Soon to be an episode of Dateline.",
                "11ft 4in gator? Thats quite a large gator to be rowing your canoe over. Been a Florida man for 30+ years and seen many big gators but that would be one of the largest ones I’ve seen in the wild.",
                "When I was a teenager, my mom and I went canoeing in the Okefenokee swamp. I was paddling up front and my mom said \"Watch out for that gator!\" I said \"What gator?\" and steered right over it. The canoe just brushed the top of it, and it swam away looking relatively unperturbed.",
                "Canoe drifted over a gator, probably didn't even see it.  The gator reacted like the wild animal it is.  Just one of those tragic things that happens."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Hidden cameras found in dance studio bathrooms in Hermosa Beach",
            "external_url": "https://abc7.com/post/hidden-cameras-found-bathrooms-school-dance-music-hermosa-beach/16335930/",
            "upvotes": 793,
            "date": "05/07/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16335896_050525-kabc-hermosa-beach-hidden-cams-tn-img.jpg?w=1600",
            "top_comments": [
                " >Somma says she has over a thousand students, ranging in age from 2 to 18 years old.\nOn Saturday morning, Hermosa Beach police responded to the School of Dance and Music.\n\"Investigating officers learned that hidden cameras were located in multiple bathrooms throughout the location,\" police said in a statement. \"The cameras were located by parents of students who removed the cameras and turned them in to dance school staff members who immediately contacted HBPD.\"\n\nWell that's horrifying. I wonder what the likelihood is that they can locate the culprit.",
                "I fear that hidden cameras are frighteningly common and the perpetrators rarely get caught. Scary stuff!",
                "Well surely that business is finished now.",
                "[removed]",
                "I read that as hidden cameras find dance studio located in a bathroom or maybe the edibles are kicking in",
                "Dust camera for fingerprints, ask all staff and parents for a print sample that will be compared and discarded if it isn't a match. Anyone that says no goes into the suspect list until otherwise cleared."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Mattel CEO confirms plans to raise prices as he calls for zero tariffs on toys",
            "external_url": "https://www.cnn.com/2025/05/05/business/barbie-mattel-toy-tariffs-price-hike",
            "upvotes": 6673,
            "date": "05/08/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208881364.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "*On Monday, Kreiz said it will be relocating production of 500 toys from China to other countries.... however, that production will not shift to the United States.* \n\nMattel will mix and match according to Trump's whims.",
                "This administration is literally running with you shouldn't have anything and be happy. It wants nationalism without actually making things better",
                "Christmas looks to be a blood bath this year for retailers.",
                "The Trump That Stole Christmas.",
                "Can you imagine the never ending \"War on Christmas\" stories Fox News would be running if Biden or Obama or Clinton or Harris or anyone vaguely left leaning suggested that kids get less toys?",
                "Burgermeister Meisterburger",
                "Everyone is talking about toys but they're a very small part of what's going up in price. Everything is going up. Food, clothing, houses, electricity, gas... I can go on.",
                "How much Trump crypto does it take to buy an exemption for toys?",
                "Only need 3 dolls and 5 pencils. And 150 rounds of golf.",
                "Republicans still saying how this is necessary and is good in the long run"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Cardinals fail to elect new pope on first day of the conclave",
            "external_url": "https://www.cnn.com/world/live-news/new-pope-conclave-day-one-05-07-25",
            "upvotes": 2363,
            "date": "05/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2212927494.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So I still have time to watch Conclave and pretend I know how it all works?",
                "Just the first day.   The elections of Popes Benedict XVI and Francis were swift by historical standards. Both popes were appointed on the second day of voting. Benedict required four rounds of voting; Francis took five.\n\nPope John Paul II, Benedict’s predecessor, took slightly longer. He was elected in 1978 on the third day of voting, in the eighth round. \n\nThe longest record was some 3 years and a few Cardinals died during the voting.  The shortest record was only 10 hours.",
                "Still time for Tedesco",
                "What does this mean for LeBron’s legacy?",
                "Good food, good wine, good friends, nice accommodations.  Let's take our time, just to be very sure.",
                "Is this like pirates of the Caribbean where they all vote for themselves so a decision can’t be made?",
                "Was anyone at all expecting them to have a first round pick?",
                "Does the Vatican have a version of the pizza index we can track?",
                "Is it a best-of-seven?  They can still lose three more games.",
                "The Conclave of 1268 lasted 3 years. I don't think it's \"failing\" to not elect a Pope on the first day. Lol"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Tourist helicopter suddenly broke apart and crashed into the Hudson River, NTSB preliminary report finds",
            "external_url": "https://lite.cnn.com/us/tourist-helicopter-suddenly-broke-apart-and-crashed-into-the-hudson-river-ntsb-preliminary-report-finds",
            "upvotes": 1337,
            "date": "05/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Well the rotor’s not supposed to come free and chop the tail off, that’s for sure.  Though I suppose that is exactly what a catastrophic failure looks like: “suddenly breaking apart.”",
                "Anyone who saw that video could come to that conclusion...",
                "Holy shit. 8th helicopter tour that day. Same plane. Imagine if you were one of the previous 7 tours that day…",
                "https://www.flickr.com/photos/ntsb/albums/72177720325056299/",
                "Well you see, the front fell off.",
                "Where’s the news? Didn’t we already know this? HOW did it “suddenly” break apart? What went wrong?",
                "Discussing this with a Aviation Safety expert for one of the US Government Dept.  He said it reminded him of a similar event about ten or more years ago.  Lot of similarity.  One of the passengers was seated in front next to pilot.  After the event examination of wreckage found camera strap for camera used by tourist wrapped around controls.  It was suggested that a rapid move by the tourist to bring him camera toward a scene to photograph exerted unusual pressure on the controls.  The input caused the aircraft to rise sharply and brought one of the main rotors in contact with the part of the hull behind the cabin causing it to disintegrate.  Hull separation occurred not until the NY incident.    \n\n\nThis was just a similar accident with a probable cause.   NTSB is still working on this facts available to them.",
                "This is only the preliminary report guys, their answer may change",
                "Can Nathan fielder recreate this portraying the pilot’s life from birth up until this point, including but not limited to being breastfed by an enormous puppet, feeding rocks to his little sister, pronunciation on the word “left”, along with purchasing an iPod and enjoying the band evenascense?",
                ">Tourist helicopter suddenly broke apart and crashed into the Hudson River, NTSB preliminary report finds\n\nTIL that i am qualified to be an NTSB investigator because that was blatantly obvious from the video lol"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "3 former Memphis officers acquitted in fatal beating of Tyre Nichols after he fled a traffic stop",
            "external_url": "https://www.cnn.com/2025/05/07/us/tyre-nichols-memphis-officers-trial",
            "upvotes": 11587,
            "date": "05/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-26113981.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Former Memphis officer Desmond Mills Jr., who was also charged in Nichols’ death, testified as a prosecution witness.\n\nNot only was it caught on camera, but one of them turned state's evidence, and they *still* got off?? JFC.",
                "> The three defendants still face the prospect of years in prison after they were convicted of federal charges last year.\n\nImportant info here but with this administration I'm sure it's going to go nowehere.",
                "2 other former cops pleaded guilty to avoid trial.  How mad are they at their lawyers right now?",
                "How the actual fucking fuck have they been acquitted? It’s on fucking video?",
                "So....they hit him extra times because they were mad that they had accidentally pepper sprayed themselves oh and because of said self inflicted pepper spray they couldn't tell they were actually hitting him in the head with their batons?\n\nWhat a fucking joke. These incompetent sociopaths belong in prison.",
                "The implications of this nonsensical defense and equally baffling jury verdict is highly disturbing and should be terrifying to all citizens there. They are basically legalizing death squads.",
                "Complete miscarriage of justice. We all saw the murder with our own eyes.",
                "This is the one where they are on camera holding his arms behind his back so the others can take turns punching and kicking him in the face, right? The one where they broke his fucking neck and still kept swinging on him, then propped him up against a car so they could keep going? The one where one of their own even kept asking what he did to deserve this and they couldn't give an answer?\n\nThose are the cops that got acquitted? Jesus fucking Christ. This murder was even more obvious than George Floyd and they acquitted them. This country is fundamentally broken in so many ways.",
                "That's incredible... with all the footage",
                "They beat a man to death"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "WeightWatchers files for bankruptcy amid rise of weight-loss drugs",
            "external_url": "https://www.aljazeera.com/economy/2025/5/7/weightwatchers-files-for-bankruptcy-amid-rise-of-weight-loss-drugs",
            "upvotes": 2741,
            "date": "05/07/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/05/AP25126856600680-1746610063_384f18-1746610427.jpg?resize=1200%2C630&quality=80",
            "top_comments": [
                "It's funny that the article even mentions that weight watchers also acquired a company that prescribes these weight loss drugs to people too.",
                ">The diet company formerly known as WeightWatchers has filed for bankruptcy after its 62-year-old business model was put under strain by the rise of weight-loss drugs such as Ozempic.\n\n[Ozempic users are also spending less on groceries.](https://progressivegrocer.com/do-weight-loss-drugs-lead-grocery-sales-losses) There's plenty of industries taking a hit because of weight loss drugs. No surprise restaurant chains are also filing bankruptcy.",
                "My view is: Any organization that is meant to solve a problem should have a goal to put itself out of business. For example, I volunteer for organizations that promote organ donation. They know that as soon as permanent solutions are developed, their mission is fulfilled.\n\nHowever, is Ozempic/etc. the correct answer? Maybe, maybe not for a multitude of reasons. If it is not, then an organization such as Weight Watchers is still theoretically needed.",
                "They need to go down to San Antonio. Gold mine down there I hear.",
                "I'm no expert, but I feel like this was the straw that broke the camel's back, but I think the Internet also has made programs like Weight Watchers a lot less effective. Why pay for what is essentially glorified advice on how to eat healthy when you can find 1000 tiktok nutritonist who are legitimate and give much more nuanced nutrition advice. \n\nBack in the 90's it made sense, the Internet was far more niche, and nutritonists were expensive, you couldn't reliably find dieting tips that were effective. \n\nNow you can't take 10 steps without tripping over some actually legitimately good nutritonists. People who are realistic and don't have this expectation that every person is going to eat nothing but grilled chicken, fruit, and salad for every meal. People who know you are going to cheat and give you ways to minimize the harm a cheat day does. \n\nAs a frame of reference, I lost over 100 lbs last year just from diet changes (and a bit of exercise, but mostly diet), I did very little research, I just started off by cutting out obviously bad things (fried foods, processed red meats), and then just randomly saw quite a few accounts that gave good advice on effective fast food orders. Like legitimate realistic advice that made it a lot easier to stay consistent.",
                "*“The decisive actions we’re taking today, with the overwhelming support of our lenders and noteholders, will give us the flexibility to accelerate innovation, reinvest in our members, and lead with authority in a rapidly evolving weight management landscape,” CEO Tara Comonte said in a statement*\n\nWhenever I see that word \"innovation\" when coming from a CEO, I think of the appearance of a solution. Of course, the word \"drug\" when dealing with excess weight, inspires me even less.",
                "As someone who used Weight Watchers several times, this is not surprising for a very big reason: They have no real identity as a company anymore. For a long time it was a regular point system, and then transferred to several, and then they were Points Plus, and then they were color coded as blue/green/purple plans depending on your goals, and then came the zero point foods...\n\n\nMy point being that there was no real core identity to focus on. There was no real \"winning\" solution they could market because they kept changing the fundamentals and principles of the program. Yes, it centered around points, but they constantly changed the \"rules\" of the program with no real evidence to back up why. It just seems like they did it to appease people who didn't want to be diligent in counting points for this or that. It's tough to count calories, they saw the breakthrough by taking big numbers out of it, but they just had no allegiance to their core methods.\n\n\nSo yes, Ozempic and other drugs might have put a damper on things, but they were losing popularity before withing communities I'm in anyway.",
                "Weight Watchers started out as a support group. It was really simple. I don’t even think it was a business.    \n\nBut it got taken over by people trying to monetize it, and by the time I walked into one of their offices, they were selling snacks. Highly processed low-fat snacks.",
                "This article popped up right under a weightwatchers ad",
                "I knew WW didn't work the minute Oprah Winfrey abandoned the shit and went directly for the Ozempic shots. It was just nonsense all along, while she was cashing those checks - as if she needed more money. \n\nAdd WW to the list of scams Oprah's run, Dr Oz Dr Phil and all those other gurus of stupid shit advice."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US planning to deport migrants to Libya despite ‘hellish’ conditions – reports | Libya",
            "external_url": "https://www.theguardian.com/world/2025/may/07/us-planning-to-deport-migrants-to-libya-despite-hellish-conditions-reports",
            "upvotes": 1099,
            "date": "05/07/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8913014985a092fa92543b11a1443ab76b4e2624/485_0_1709_1367/master/1709.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cdd9b29ffe9c70eabf4ee5950b39c453",
            "top_comments": [
                "*In its annual human rights report released last year, the US state department criticised Libya’s “harsh and life-threatening prison conditions” and “arbitrary arrest or detention”, citing how migrants , including children, had “no access to immigration courts or due process”.*\n\nThe above is one of most mild assessments of Libyan prisons and detention centers. It would be a compressed life sentence to send migrants to this torturous hell hole.",
                "El salvador full already?\n\nNow they are shipping them to a warzone?",
                "\"Despite\"? I think you mean \"Because of\". Remember: cruelty is the point.",
                "How about deporting old, fat, orange convicted sex offender felons?",
                "Nothing would surprise me at this point. The vile cruelty of this bunch is astounding.",
                "If Congress does nothing, they are implicitly granting that power to Trump. Republicans in Congress could stop all of this, but so far…nothing. All of the powers Trump is using were delegated to the president by Congress, so Congress could take them back.",
                "#When are we going to say fuck it and remove Trump from office, charge him for his crimes and throw his ass in prison?\n\n\n#when?",
                "One has to ask… Why are Republicans so dead set on circumventing the justice system (and the Constitution)? I believe it’s because 1) Cruelty is the point, 2) They know and want extreme abuses to occur that will not fly in America, and 3) they want to ship perceived enemies out of country so they can pull the BS of “ well yeah we screwed up, but ooops we don’t have any control or say in the camp/prison they are in now. Too bad.”.",
                "Why aren't they returning them to their home countries?",
                "It's getting increasingly clear that Trump's actual plan is to get people to self deport by making examples of a few.  Just the other day I saw an advertisement from the government basically saying we're coming for you.  But his cruelty really can't match what may be happening south of the border."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Polish police detain man after he kills one person with axe at Warsaw University",
            "external_url": "https://www.reuters.com/world/europe/polish-police-detain-man-after-he-kills-one-person-with-axe-warsaw-university-2025-05-07/",
            "upvotes": 240,
            "date": "05/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They'll arrest you for anything these days",
                "22yo law student with an axe? Was his name Raskolnikov?",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Disney's new theme park to be in Abu Dhabi",
            "external_url": "https://www.npr.org/2025/05/07/nx-s1-5389601/disney-park-abu-dhabi",
            "upvotes": 242,
            "date": "05/07/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3418x1923+0+1/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc4%2F30%2Fd5faf1c741afb849f21bb6c4f525%2Fdisney-experiences-abu-dhabi-rendering1.jpg",
            "top_comments": [
                "Slave labor to build the Mouse a new house.",
                "That doesn't sound like a comfortable environment for a theme park.  Or will it all be inside?",
                "What’s are the average number of wet bulb temperature extremes days predicted for the near and long term climate outlook in the region, again? \n\nAnd what was the heat index max for Abu Dhabi last year? \n\nOh, [only 144° F](https://www.washingtonpost.com/weather/2024/07/18/persian-gulf-dubai-heat-climate/).",
                "They’re gonna make Minnie wear a full on Burqa while pretending to be a progressive welcoming company. ",
                "Why would I bring my kids to the middle east ?",
                "Could you imagine the prices..",
                "100% Investor Bait.\n\nOh, hey, Disney's getting its lunch money stolen by Epic Worlds? Time to announce a new park in a place absolutely dripping with money.\n\nAnd while you're looking at this big beautiful plan about the future, please ignore how absolutely dire the actual current financials are.",
                "At least Nermal will have something to do over there.",
                "So Nermal is winning now?",
                "Let me take you on a halal carpet ride...."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Woman killed by alligator during couple canoe trip, husband tried to save her",
            "external_url": "https://abcnews.go.com/US/woman-killed-alligator-couple-canoe-trip-husband-save/story?id=121552147",
            "upvotes": 1921,
            "date": "05/07/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a5832958-6383-4320-b9ff-090a6fe9aa7c/gator-attack-wfaa-jef-250507_1746642008077_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "We rode over an alligator once and I could feel the ridges on its back scraping the boat as we slid over it. I was fully expecting the equivalent of the hippo scene in Congo but nothing happened. I have never wanted to hit one of my friends that badly in my life for taking us over it. (On purpose. \"Haha, should have seen your face!\")\n\nNever went anywhere near the water with that asshole again.",
                "What a horrible way to go. And for the husband to witness it. RIP.",
                "This is tragic. I did however chuckle at them locating an alligator \"matching the description\".",
                "In Florida you don't do murky, that being said gators are pretty timid compared to their cousins and tend to avoid places with a lot of boat traffic of any type",
                "This happened to a famous guy a few years back in Africa. Crocodile snatched him right out of the canoe.",
                "Pretty scary stuff. I did a Backcountry Everglades canoe trip a couple years ago and there was a 10ft croc on our trailhead. Not even a gator, a straight up croc. He got spooked by our noise and vanished completely into the water on the trailhead, roughly 3 feet deep. We paddled past him roughly 150 ft up the trail as he got out onto a slide, and he luckily must have eaten recently because he paid us no mind despite us being a few mere feet away from him. But in the back of my head for the whole trip all I could think of is how easily he vanished and how there could be anything below us at any given moment. At his size he very easily could have capsized our canoe if he really wanted to. Extremely unfortunate for this couple.",
                "Soon to be an episode of Dateline.",
                "11ft 4in gator? Thats quite a large gator to be rowing your canoe over. Been a Florida man for 30+ years and seen many big gators but that would be one of the largest ones I’ve seen in the wild.",
                "When I was a teenager, my mom and I went canoeing in the Okefenokee swamp. I was paddling up front and my mom said \"Watch out for that gator!\" I said \"What gator?\" and steered right over it. The canoe just brushed the top of it, and it swam away looking relatively unperturbed.",
                "Canoe drifted over a gator, probably didn't even see it.  The gator reacted like the wild animal it is.  Just one of those tragic things that happens."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Town official allegedly shoots lost DoorDash driver looking for directions: Police",
            "external_url": "https://abcnews.go.com/US/town-official-allegedly-shoots-lost-doordash-driver-directions/story?id=121521187",
            "upvotes": 23207,
            "date": "05/07/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d845f5c7-a11e-4f3c-8df2-db41b0f8055b/chester-ny-shooting-main-ht-jt-250506_1746551721498_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Reilly, 48, told the victim \"to get off his property,\" and then Reilly allegedly fired multiple shots at the driver while he was trying to leave in his car, police said.\n\nHe tells him to leave, so he tries to leave, but he gets shot anyway, *in the fucking back*. Fuck this guy forever.",
                ">He \"approached several homes asking for directions before arriving at the residence of John Reilly III,\" who is the Town of Chester highway superintendent, police said.\n\n>Reilly, 48, told the victim \"to get off his property,\" and then Reilly allegedly fired multiple shots at the driver while he was trying to leave in his car, police said.\n\nWhen someone pulls into my driveway, my first inclination is to assume they're probably turning around. My second is I'm about to win money from the Prize Patrol. Further down the line is that they're armed Nova Scotia separatist radicals. \n\n>Reilly -- who is a federally licensed firearms dealer -- was charged with first-degree assault, second-degree criminal possession of a weapon and criminal possession of a firearm, police said. \n\nThose guns are probably going to go away. New York state doesn't allow felons to possess firearms. All because he wanted to \"stand his ground\".",
                "Imagine being such a paranoid scaredy cat little baby you have to shoot at someone just because they went up your driveway, and I bet he thinks he's acting manly.",
                ">Reilly -- who is a federally licensed firearms dealer -- was charged with first-degree assault, second-degree criminal possession of a weapon and criminal possession of a firearm, police said. \n\nFederally licensed firearms dealer has illegal gun. Fantastic.",
                " Assault is really underselling what he did. He deliberately shot at someone he knew wasn't a threat to him, he should be getting tried for attempted murder.",
                "Getting lost... **try that in a small town.*",
                ">Reilly, 48, told the victim \"to get off his property,\" and then Reilly allegedly fired multiple shots at the driver while he was trying to leave in his car, police said.\n\n>The driver was shot once in the back and hospitalized with serious injuries, police said. He's currently in stable condition, police said on Tuesday.\n\n>>**Reilly -- who is a federally licensed firearms dealer**\n\nTypical. The victim was complying and attempting to leave, there was no reason to open fire. This is just another \"*GoOd GuY wItH a GuN*\" looking for an excuse to shoot someone. He's made it abundantly clear that he is a danger to society and belongs in prison for the rest of his life.",
                "This must be that “polite society” they told us we’d have if everyone was armed",
                "It's really touching that both DoorDash and the town have issued statements of remorse for the driver without offering to help cover the guy's medical bills.",
                "Fox News: “they’re coming for your guns” \nDoorbell: ding"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/08/2025 04:13:11 UTC"
}