{
    "posts": [
        {
            "category": "HOT",
            "title": "NHL suspends Florida Panthers minority owner for ‘51st state’ posts",
            "external_url": "https://www.theguardian.com/sport/2025/may/13/doug-cifu-florida-panthers-minority-owner-suspended",
            "upvotes": 2332,
            "date": "05/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/160516a3a9f0332a5169838800d226165f8968c3/212_0_3896_3117/master/3896.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f49e825b6cf4aa22da9e14dc4d829758",
            "top_comments": [
                "40% of the NHL is Canadian. 29% is American. How brain dead do you have to be to do this?",
                "Good, don’t let them normalize that propaganda",
                "Imagine having more money than you could ever spend in a lifetime and still spending your time arguing with strangers on twitter. \n\nFun side note, the Panthers have been the dirtiest team in the NHL playoffs this year and it isnt even close.",
                "Simping for Israel and disrespecting a neighbour's sovereignty, like chocolate and peanut butter",
                "damn I actually want the Leafs to advance, now",
                "Good.  51st state is never going to happen.  I love my American friends and I really hope we can continue a close relationship.  We provide great advancements as separate places.  Like Insulin, pacemaker, zipper, telephone, etc....  which we as a friendly continent and with rules allowing us to work together creates so many more advancements.\n\n  \nFundamentally Canada is different from the US.  \n\nThat shouldn't change.",
                "What a fucking asshole",
                "Fyck this MAGA & Zionist bigot",
                "The utter disrespect (and lack of knowledge of hockey) to Canada, the country that *created* the fucking game you are capitalizing on.",
                "What does it mean, practically, for him to be suspended from all activity with the team and the NHL?  Serious question."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "Small nodule found in Joe Biden's prostate during recent physical",
            "external_url": "https://abcnews.go.com/US/small-nodule-found-joe-bidens-prostate-recent-physical/story?id=121743026",
            "upvotes": 2713,
            "date": "05/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/270fecd5-10fa-4ed7-a838-ebd3333d8383/biden-main_1747135541861_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I would like to unsubscribe from Joe Biden Prostate Facts",
                "I’m a doctor. MOST men will die with pathology confirmed prostate cancer (I forget the exact number but I think it’s like 80%). Unless it is widely metastasized, joe Biden will die LONG before this cancer has any effect on his health.",
                "Wild that we can know what’s going on inside Joe biden’s asshole but we can’t get an accurate height and weight of the president. ",
                ">\"In a routine physical exam a small nodule was found in the prostate which necessitated further evaluation,\" a spokesperson told ABC News.\n\nGood time to remind everyone to get checked regularly.",
                "Yeah I’m glad I’m not famous",
                "Breaking news, old guy has stuff going on physically. More at 11.",
                "[removed]",
                "Small nodule found in Trump's prostate is just Lindsey Graham.",
                "I feel like this information has just been forced upon me against my will.\n\nI'm not happy about this.",
                "They also found 250 pounds of lard ass during Trump's physical yet no one seems to care. \n\nLiberal media I guess."
            ],
            "aggregate_sentiment": 13.0
        },
        {
            "category": "HOT",
            "title": "UnitedHealth suspends annual forecast, CEO Andrew Witty steps down",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/unitedhealth-ceo-andrew-witty-steps-down-2025-05-13/",
            "upvotes": 10911,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "My company recently moved insurance from Blue Cross/Blue Shield over to this hot mess. Man, when I tell ya…absolutely *dog shit* insurance company. We went from pretty good coverage to them nickel and diming over everything. Would strongly advise to stay away from UnitedHealth.",
                "I hope UnitedHealth continues to go under. Awful company. Their denial rate is 2x that of the industry average. Total scam of a company",
                "[Understanding the Change Healthcare Breach and Its Impact on Security Compliance](https://hyperproof.io/resource/understanding-the-change-healthcare-breach/)\n\nIn short, quite possibly the largest healthcare data breach in history occurred under his watch.",
                "\"CEO Andrew Witty steps down\"\n\n'Hey guys, make sure EVERYONE knows I'm not CEO of UnitedHealth anymore. Issue press releases, take out ads, maybe put up a banner with the new guys face on it....'",
                "Sounds like fall out from the lawsuit. Good thing stockholders get taken care of. God forbid someone does anything to prevent another CEO being killed. All about those dollar bills.",
                "In simple terms, my rates are going up, big time",
                "> surging medical costs send its shares plunging more than 11%\n\nWhich is a perfect example of why medical care should not be a for-profit enterprise.",
                "This was moments after the board voted against metal detectors outside annual forecast meetings",
                "I never buy personal reasons.  Had a few people leave my company like that.  One cared way too much and it showed as she was doing her two weeks.  She finally told us it was a silent layoff.  Our boss left for personal reasons with no job at the same time.  \n\nShit is going sideways after the shooting and this guy either wasnt doing what he needed/asked to do or he just fucked it all up and the board said time to go.  \n\nHe could have something personal too.  He’s human.  But with the other stuff.  Seems like board asked him to leave.",
                "Who could have guessed assassinating one CEO could have collapsed a company so badly.  There stock price is down like 40% just in the past 6 months, and they’ve lost a second ceo now too."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Microsoft is cutting 3% of all workers",
            "external_url": "https://www.cnbc.com/2025/05/13/microsoft-is-cutting-3percent-of-workers-across-the-software-company.html",
            "upvotes": 4094,
            "date": "05/13/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108144510-17471116752024-04-30t031054z_160536770_rc2pg7auia21_rtrmadp_0_microsoft-indonesia.jpeg?v=1747111745&w=1920&h=1080",
            "top_comments": [
                "Next week: Facebook, Meta and Google are cutting 3% of all workers.",
                "“Microsoft had 228,000 employees worldwide at the end of June, meaning that the move will affect thousands of employees.”\n\nSheeeesh",
                "\"Not related to performance\" makes it that much worse.",
                "Microsoft had $88.14 billion in profits last year and they are the most valuable stock currently, at $3.33 trillion.  Their profit margin is nearly 36% and all metrics were up from their prior year results.   Their tax rate was 18.23%.",
                "Sadly, Microsoft has a ritual of blood sacrifice in Q4 of its fiscal year. This allows them to write off the severance costs in one fiscal year without impacting the bottom line in the new year. \n\nYou can expect to see more positions cut through the first week or two of July. Depending on the size of the cuts, it might not make the news. They are only legally required to report it if the cuts are over 300 per job site, if I remember correctly.",
                "Its better than the 10% every year they used to do in the 2000-2012.",
                "I know multiple people working at nonprofits in Washington state that are getting laid off as many are trimming 80%+ of their staff or shutting down entirely. Some of these orgs have been successfully serving their community for decades but are dependent on funds from the state and/or corporations like Microsoft and both are drying up entirely. Thousands of folks are losing their jobs and the ripple effect on the community they spend money in and the people they serve is going to hit hard and won’t correct any time soon. This is the calm before the storm not the storm.",
                "I really think developed economies will have to figure out how they will deal with AI inevitably displacing so many jobs. Of course, we are instead going to wait for the crisis to occur and then try to implement a half-assed solution.",
                "Don't dedicate yourself unless you have one of these two titles, OWNER or SHAREHOLDER. There is ZERO loyalty time to recognize.",
                "The phrasing sounds like they're taking approximately two fingers and a kidney from everyone."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "US strikes $600bn deal with Saudi Arabia as Donald Trump's Middle East tour begins",
            "external_url": "https://www.lbc.co.uk/usa/politics/us-strikes-600bn-deal-with-saudi-arabia-donal-trumps-middle-east-tour-continues/",
            "upvotes": 3318,
            "date": "05/13/2025",
            "thumbnail": "https://images.lbc.co.uk/images/723443?width=1200&crop=16_9&signature=ANwtk71HDdQkmTLCnEwBHzZnEEg=",
            "top_comments": [
                "\"Mr. President, a second plane just got gifted to you\"",
                "Also from the article.\n\n“*Meanwhile, Trump also struck a deal with China on Monday to cut tariffs by 115% over the next 90 days in what could spell the end of his administration's global trade war.”*\n\nNo mention of the 30% tariff that remains in place or the de minimus exemption that became a 54% tariff or the 10% across the board tariffs or the 25% auto tariffs or… \n\nJournalism is dead.",
                "MAGA has sold America to rich Arabs, Russian oligarchs, tech billionaires, and A.I. lobbyists.",
                "Further proof that Saudi Arabia owns Clinton and Biden, right MAGA?",
                "In 2024, Saudi Arabia's GDP reached approximately $1.09 trillion at current prices.\n\nSo they’ve pledged approximately 60% of their annual gdp to invest in the USA.",
                "One can guess how much he'll personally get out of this deal.",
                "Remember when Trump was president for the 1st time,  and that Saudi born journalist was hacked into small pieces? Do you also remember when shortly after, Trump met the butcher himself and he shook his still bloody hands and greeted him with a smile?  He almost makes Trump seem tame",
                "I wonder if the name Jamal Khashoggi came up during their conversation",
                "Turns out we do negotiate with terrorists.",
                "\\*Trump and his Oligarch friends strike $600bn deal with Saudi Arabia."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Georgia college student remains in ICE custody after mistaken traffic stop",
            "external_url": "https://abcnews.go.com/US/georgia-college-student-remains-ice-custody-after-mistaken/story?id=121733067",
            "upvotes": 4064,
            "date": "05/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/145e291d-1815-44a8-887f-9b25c2025ec8/daltonstate_1747092879614_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I'd like to know how she ended up in ICE custody. She gets pulled over by mistake (charges have already been dismissed), and then what? Are the cops asking for the immigration status of everyone they pull over? Was she driving without a DL which triggers inquiry and then ICE arrives to detain her while they figure out if she's legal? Same with her father who got pulled over going 19mph over the limit. For most people, this is a ticket and then you go home. What is going on between them getting pulled over and detained so they end up with ICE? Because ICE can't pull people over.\n\nThere is no central registry of citizens. The only documents which prove your citizenship are your passport, naturalization certificate, or birth certificate, which most people don't carry with them at all times.. Which to me means that cops are looping in ICE on anyone they may suspect to be undocumented... and I don't see how that isn't effectively just racial profiling on Latinos in the United States.",
                "The article makes it sound like she actually is and always has been undocumented. I'm asking because I truly have no idea; how does an undocumented person obtain a driver's license and enroll in a university? ",
                "Reading the article it says she’s been in the U.S. since she was 4yo but her parents say she couldn’t register under DACA since the program ended. I thought DACA is technically still in place? Or at least it shouldve been 10 years ago unless I’m reading this wrong",
                "This is beyond scary at this point.",
                "[removed]",
                "19 mph over is a violent offender?",
                "\"We're going after violent criminals and gangs\"\n\n*Goes after working families and students*",
                "Wow, ICE is a combination Keystone Cops and Nazi Brown Shirts. Amazing they can ever find anything non immigrant related.",
                "the reddit admins have been censoring comments critical of ICE and any suggestion that we defend ourselves against these actions.\n\nthe reddit admins believe this to be cool and good.",
                "We legals have nothing to worry about?  \n  Yeah, sure..."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "French actor Gerard Depardieu found guilty of sexually assaulting two women",
            "external_url": "https://news.sky.com/story/gerard-depardieu-found-guilty-of-sexual-assault-13367002",
            "upvotes": 5147,
            "date": "05/13/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-gerard-depardieu-trial_6867262.jpg?20250326091431",
            "top_comments": [
                "This man is such a disgusting, vile pig.",
                "Reminder: multiple French celebrities said he shouldn't face trial because he made some great films.\n\n[https://variety.com/2023/film/news/french-stars-defend-gerard-depardieu-open-letter-1235850631/](https://variety.com/2023/film/news/french-stars-defend-gerard-depardieu-open-letter-1235850631/)\n\nMacron himself said this only last December:\n\n>\"I’ll say it as France’s president but also as a citizen, he makes France proud.\"",
                "Away from the court, Ms Diebolt told Sky News that, after years of being tolerated due to his fame, Depardieu was finally being held accountable for his actions.\n\n\"These women were put in danger,\" she said. \"This is about a line of offences that he committed over many years that were tolerated by the world of cinema because it was Gerard Depardieu.\n\n\"Because the financial benefits he brings to the industry are so substantial. He did make some excellent films, but all men are equal before the law.\n\n\"Nobody warned Amelie about Depardieu's behaviour, so his words and actions came as a terrible surprise for her. She still has traumatic flashbacks.\"\n\nDepardieu's reputation is now in tatters, and there may be more allegations to come.\n\nDiebolt told Sky News that around 20 other women have said that they were attacked by the actor.\n\nAnd we already know that Depardieu will stand trial again later this year, this time charged with raping the actress Charlotte Arnould.\n\nMs Arnould has accused Depardieu, a friend of her parents, of raping her at his mansion in Paris",
                "I saw an interview with him years ago where he admitted--well, bragged is actually a more appropriate word--that him and his buddy would go out looking for women to rape when they were teenagers. He laughed about it.",
                "Noooo...he just looks and sounds like the person you'd most expect. \n\nPlus he did some real weird shit with his daughter on vacation once. Pretended to be her lover. What a creep.",
                "That sentence is a disgrace",
                "Isnt he a roomate with Steven \"The Whale\" Seagal in Russia?",
                "I feel like I’ve read this precise headline a dozen times over the past 20 years. How is this man still walking around?",
                "What a giant fucking turd.",
                "When will they throw this sexual predator in prison for good? How many women have to suffer?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "FDA and RFK Jr. aim to remove ingestible fluoride products used to protect kids' teeth",
            "external_url": "https://apnews.com/article/fluoride-fda-kennedy-cavities-teeth-water-22c5aefeb97c411e2fda0c4754b78cf2",
            "upvotes": 573,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So now you’re taking my choice away as to how to best protect my kids’ health? Fuck you.",
                "My dentist literally prescribed me an extra-fluoride toothpaste to help with back molars... while RFK Jr is pushing this idiocy.\n\nAt this point I'm half-expecting Trump to appoint a 'czar of software'.. who just installs backdoors into agencies, wrecks the systems, and steals all the data.\n\n*oh wait.*",
                "Wait til they hear about chlorine and its effects on beneficial bacteria.",
                "And when kids’ teeth start getting more unhealthy, the same parents who cheer for this will complain and blame literally anyone else.",
                "They truly won’t be happy until we’re a 4th world wasteland.",
                "Genuinely if you live in a non-fluoride area or even just have kids anywhere, stock up on fluoride toothpaste and these kinds of supplements now. They’re trying desperately to bring back tooth decay in children for some reason.",
                "I grew up in a rare non-flouride area in New York (thanks to that moron Governor Rockefeller) and the parents in my city had to take special steps to keep their kids teeth healthy. We had \"flouride\" days in school when we got a mega dose chew and I had a little jar of chewable flouride pills I'd have to take every night. Thank God my parents had dental insurance.",
                "We live in a small town with no fluoride in the city water and buy fluoridated water from Kroger made for kids in the baby section of the store. This is soo stupid.",
                "For an admin that wants to “make America healthy again” they sure are implementing a lot of policies that will severely harm or kill my baby. \n\nLove that for us.",
                "This country is so screwed"
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "Former Philippine president Rodrigo Duterte wins mayoral election from jail cell at The Hague",
            "external_url": "https://www.abc.net.au/news/2025-05-13/rodrigo-duterte-wins-philippines-mayoral-election/105285210",
            "upvotes": 1288,
            "date": "05/13/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/9ba55be4146681f1628414f45655e334?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485&imformat=generic",
            "top_comments": [
                "Wait, I missed episodes there, I didn't even know he was at the Hague!",
                "WFH mayorship means Work From Hague",
                "Filipinos couldn't stand American stupidity being the only thing in the news",
                ">The former president's two sons were also set to win posts on Monday, one re-elected congressman and the other winning the contest for Davao vice-mayor and likely to serve in his father's absence.\n\nInteresting to see this. I wonder what's going to happen if he loses the case.",
                "Philippines is a shining example of how corruption thrives on ignorance.",
                "So they elected a convicted felon, you say?",
                "how bad does your life have to be to vote for con men and criminals?",
                "Filipino here. Dejected but not surprised. His election as president completely solidified my pessimism about politics and my faith in my country (which had been dropping for years).",
                "Sometimes, it's just nice to be reminded that this kind of self destructive stupidity isn't relegated to the US.",
                "He subsequently gave a passionate, rousing, and hair-raising victory speech to the seven cell bars, before being hushed into silence by the guards. He did, however, get three slices of apples as a congratulatory present, instead of the standard two."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "US will fast-track Utah uranium mine permit",
            "external_url": "https://www.reuters.com/sustainability/us-will-fast-track-utah-uranium-mine-permit-2025-05-12/?utm_source=chatgpt.com",
            "upvotes": 998,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Fast-track = skip all those pesky environmental and safety rules.",
                "They were sloppy with uranium mines in the middle of the 20th century and it ended up poisoning a lot of Navajo communities. This is a recipe for disaster.",
                "Fuel costs are a relatively small part of the budget for an operating nuclear power plant, let alone the overall costs to design/permit/build new capacity. All this is going to do is likely give that specific mine a competitive advantage, due to lax permitting requirements.\n\nEdit: That is, of course, ignoring the potential environmental issues from the lax permitting. Just from a pragmatic point of view, increasing the supply of uranium seems pretty unlikely to do anything for actual energy production.",
                "It's an existing mine that's been in care and maintenance since the early 1990s. The company in question is listed on the TSX, Frankfort second tier, and the OTC markets 💀💀💀\n\nSo we're talking a broke ass exploration firm that isn't even listed on the Australian stock exchange, which is the usual hangout for these creep and bum juniors. \n\nBest case scenario, the company gets the permits and flips them to a mining company with actual capital to invest. That's the usual junior MO. \n\nI work in major project permitting and wouldn't even review the proposal if it came across my desk and uranium was $150/lb. I can guarantee that the permit review will miss major permits required, let alone bother with technical safety and feasibility reviews. If anyone has thought to put a waiver of liability on the permitting process, it will fall on the permit holder. \n\nMining is a huge business, but it also can have significant consequences when unchecked. I guess we're making Superfund sites great again?",
                "Google moab uranium for just how bad an idea this is.",
                "Great, that's what we need. Radioactive Mormons with super powers.",
                "Down with fluoride, up with uranium!",
                "Utah’s own senator (Lee) was a lawyer for a huge nuclear waste company that tried to import Italy’s radioactive waste into Utah. Think of the dangerous logistics of that. \n\nCongress actually had to band together to pass a law to prevent nuclear waste from being brought in from other countries and disposed of in the USA as a result.\n\nSo that same dumbass lawyer who tried to poison his own people immediately afterwards decided to run for the open senate seat….and won. \n\nLiterally the stupidest people in Utah begging to be poisoned.",
                "“Increased investor attention” is going to be written on the Earth’s tombstone when this is all over.",
                "As a result, the project's environmental review will be completed in just 14 days, the department said in a statement. Such studies typically take years because of the potential environmental effects of uranium mining.\n\nWell, that's not terrifying at all given the substance involved. I mean, I'm sure the mining industry has a proven track record of safety and environmental concerns being addressed. *Shaking head*"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "FDA and RFK Jr. aim to remove ingestible fluoride products used to protect kids' teeth",
            "external_url": "https://apnews.com/article/fluoride-fda-kennedy-cavities-teeth-water-22c5aefeb97c411e2fda0c4754b78cf2",
            "upvotes": 576,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So now you’re taking my choice away as to how to best protect my kids’ health? Fuck you.",
                "My dentist literally prescribed me an extra-fluoride toothpaste to help with back molars... while RFK Jr is pushing this idiocy.\n\nAt this point I'm half-expecting Trump to appoint a 'czar of software'.. who just installs backdoors into agencies, wrecks the systems, and steals all the data.\n\n*oh wait.*",
                "Wait til they hear about chlorine and its effects on beneficial bacteria.",
                "And when kids’ teeth start getting more unhealthy, the same parents who cheer for this will complain and blame literally anyone else.",
                "They truly won’t be happy until we’re a 4th world wasteland.",
                "Genuinely if you live in a non-fluoride area or even just have kids anywhere, stock up on fluoride toothpaste and these kinds of supplements now. They’re trying desperately to bring back tooth decay in children for some reason.",
                "I grew up in a rare non-flouride area in New York (thanks to that moron Governor Rockefeller) and the parents in my city had to take special steps to keep their kids teeth healthy. We had \"flouride\" days in school when we got a mega dose chew and I had a little jar of chewable flouride pills I'd have to take every night. Thank God my parents had dental insurance.",
                "We live in a small town with no fluoride in the city water and buy fluoridated water from Kroger made for kids in the baby section of the store. This is soo stupid.",
                "For an admin that wants to “make America healthy again” they sure are implementing a lot of policies that will severely harm or kill my baby. \n\nLove that for us.",
                "This country is so screwed"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "11 Killed During Army’s Controlled Explosion of Expired Munitions in West Java",
            "external_url": "https://jakartaglobe.id/news/11-killed-during-armys-controlled-explosion-of-expired-munitions-in-west-java",
            "upvotes": 22,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So.... maybe not as controlled as they may have liked."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "NHL suspends Florida Panthers minority owner for ‘51st state’ posts",
            "external_url": "https://www.theguardian.com/sport/2025/may/13/doug-cifu-florida-panthers-minority-owner-suspended",
            "upvotes": 2342,
            "date": "05/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/160516a3a9f0332a5169838800d226165f8968c3/212_0_3896_3117/master/3896.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f49e825b6cf4aa22da9e14dc4d829758",
            "top_comments": [
                "40% of the NHL is Canadian. 29% is American. How brain dead do you have to be to do this?",
                "Good, don’t let them normalize that propaganda",
                "Imagine having more money than you could ever spend in a lifetime and still spending your time arguing with strangers on twitter. \n\nFun side note, the Panthers have been the dirtiest team in the NHL playoffs this year and it isnt even close.",
                "Simping for Israel and disrespecting a neighbour's sovereignty, like chocolate and peanut butter",
                "damn I actually want the Leafs to advance, now",
                "Good.  51st state is never going to happen.  I love my American friends and I really hope we can continue a close relationship.  We provide great advancements as separate places.  Like Insulin, pacemaker, zipper, telephone, etc....  which we as a friendly continent and with rules allowing us to work together creates so many more advancements.\n\n  \nFundamentally Canada is different from the US.  \n\nThat shouldn't change.",
                "What a fucking asshole",
                "Fyck this MAGA & Zionist bigot",
                "The utter disrespect (and lack of knowledge of hockey) to Canada, the country that *created* the fucking game you are capitalizing on.",
                "What does it mean, practically, for him to be suspended from all activity with the team and the NHL?  Serious question."
            ],
            "aggregate_sentiment": 35.0
        },
        {
            "category": "NEW",
            "title": "Israeli air strike on Gaza's European Hospital kills at least 16 people, health ministry says",
            "external_url": "https://www.bbc.com/news/articles/cx2jvx3yjg3o",
            "upvotes": 244,
            "date": "05/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8a66/live/7370ed40-3021-11f0-8947-7d6241f9fce9.jpg",
            "top_comments": [
                "*Eyewitnesses said Israeli drones maintained a tight aerial siege over the building, preventing rescue teams from reaching the site.   A quadcopter drone reportedly wounded two civil defence officers as they attempted to approach the European Hospital.*\n\nOnce in a great while, \"war\" means two countries or sides fighting it out, but far more often \"war\" means one side cruelly devastating and destroying the other.",
                "Israel and dropping bombs on hospitals. Is there a more iconic duo? Yes, Israel firing missiles at hospitals.\n\nIs it so much to ask to *stop* turning Palestinian kids into skeletons?",
                "\"No no guys, there was totally Hamas in there\"\n\n\"OH, those dead children's bodies? They totally had Glocks and Grenades and were forming an undercover unit to invade us. They were Super-Hamas. Totally.\"",
                "Medical workers and journalists, two of the IDF’s favorite targets.",
                "We’ve seen such transpire before, read about it in history books, and said never again. Only for it happen again right in front of our eyes and do nothing about it. What a twisted world we live in",
                "When is the west going to start doing to Isreal what they are doing to Gaza? It is the only way they will stop.",
                "After the great war, when they said \"never again\" what they meant was \"never US again.\"",
                "They did it to kill one of the arch terrorists, Sinwars brother.",
                "Another atrocity and another radio silence on the global scale because the party suffering isnt trying to join nato and the offenders are still playing victim from ....\n\n uhhh how long ago was it promised to them ??"
            ],
            "aggregate_sentiment": 15.0
        },
        {
            "category": "NEW",
            "title": "Hamas frees last living US citizen held in Gaza",
            "external_url": "https://www.theguardian.com/us-news/2025/may/13/first-thing-hamas-frees-last-living-us-citizen-held-in-gaza",
            "upvotes": 137,
            "date": "05/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/04fa33f7030e3a75a29293f56d80748ab3e8b443/64_234_1040_832/master/1040.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=88e0ee279202864bb8217e0bb61ba69f",
            "top_comments": [
                "Great and all, but....\n\n> American soldier Edan Alexander meets family at Israel border. Plus, what one woman learned by watching every single Nicolas Cage film\n\nHUH?!\n\nI can only hope that's a formatting glitch on the Guardian's part and not something they intentionally wrote.",
                "A lot of these hostages who were American citizens were dual citizens, not American tourists.",
                "When other hostages will be released?",
                "Oh no. Israel will be bombing the people more now 😕",
                "I guess they can nuke it now."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "8-year-old girl in critical condition after she was struck by stray bullet inside New Orleans home",
            "external_url": "https://www.wbrz.com/news/8-year-old-girl-in-critical-condition-after-she-was-struck-by-stray-bullet-inside-new-orleans-home/",
            "upvotes": 137,
            "date": "05/13/2025",
            "thumbnail": "https://dcer237tfveol.cloudfront.net/v2/n2OGuH6XHTo0GLovPgxRbQwOHTy3vOe3z5rxnrDObEZ6_oByrYHdBcYXN5z2A6lsd85ejBcNemZtUJAv-yhfTGqKPK1FUJsNcQ1QOgcMb_7g",
            "top_comments": [
                "Her and her mother heard gunfire outside of their house, ran upstairs for safety and little girl was struck in the head by a bullet coming through the glass.\n\n\nPoor girl, poor Mom. Hoping for a swift recovery for the little girl.",
                "Jesus Christ. I was born in Algiers. It was such a good family friendly neighborhood. I feel terrible for that girl.",
                "There are no \"stray bullets\". Guns are not fickle devices that have a way of firing themselves.",
                "A Redditor posted something like \"In Amercia, you have to freedom to do things, but in Europe, you have freedom from things\" and it has really stuck with me. Freedom from things, like dying from lack of healthcare, or freedom from dying in your own home from stray bullets as a regular occurrence, or freedom from hate speech.",
                "... well-regulated militia..."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "NEW",
            "title": "Small nodule found in Joe Biden's prostate during recent physical",
            "external_url": "https://abcnews.go.com/US/small-nodule-found-joe-bidens-prostate-recent-physical/story?id=121743026",
            "upvotes": 2719,
            "date": "05/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/270fecd5-10fa-4ed7-a838-ebd3333d8383/biden-main_1747135541861_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I would like to unsubscribe from Joe Biden Prostate Facts",
                "I’m a doctor. MOST men will die with pathology confirmed prostate cancer (I forget the exact number but I think it’s like 80%). Unless it is widely metastasized, joe Biden will die LONG before this cancer has any effect on his health.",
                "Wild that we can know what’s going on inside Joe biden’s asshole but we can’t get an accurate height and weight of the president. ",
                ">\"In a routine physical exam a small nodule was found in the prostate which necessitated further evaluation,\" a spokesperson told ABC News.\n\nGood time to remind everyone to get checked regularly.",
                "Yeah I’m glad I’m not famous",
                "Breaking news, old guy has stuff going on physically. More at 11.",
                "[removed]",
                "Small nodule found in Trump's prostate is just Lindsey Graham.",
                "I feel like this information has just been forced upon me against my will.\n\nI'm not happy about this.",
                "They also found 250 pounds of lard ass during Trump's physical yet no one seems to care. \n\nLiberal media I guess."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "US strikes $600bn deal with Saudi Arabia as Donald Trump's Middle East tour begins",
            "external_url": "https://www.lbc.co.uk/usa/politics/us-strikes-600bn-deal-with-saudi-arabia-donal-trumps-middle-east-tour-continues/",
            "upvotes": 3316,
            "date": "05/13/2025",
            "thumbnail": "https://images.lbc.co.uk/images/723443?width=1200&crop=16_9&signature=ANwtk71HDdQkmTLCnEwBHzZnEEg=",
            "top_comments": [
                "\"Mr. President, a second plane just got gifted to you\"",
                "Also from the article.\n\n“*Meanwhile, Trump also struck a deal with China on Monday to cut tariffs by 115% over the next 90 days in what could spell the end of his administration's global trade war.”*\n\nNo mention of the 30% tariff that remains in place or the de minimus exemption that became a 54% tariff or the 10% across the board tariffs or the 25% auto tariffs or… \n\nJournalism is dead.",
                "MAGA has sold America to rich Arabs, Russian oligarchs, tech billionaires, and A.I. lobbyists.",
                "Further proof that Saudi Arabia owns Clinton and Biden, right MAGA?",
                "In 2024, Saudi Arabia's GDP reached approximately $1.09 trillion at current prices.\n\nSo they’ve pledged approximately 60% of their annual gdp to invest in the USA.",
                "One can guess how much he'll personally get out of this deal.",
                "Remember when Trump was president for the 1st time,  and that Saudi born journalist was hacked into small pieces? Do you also remember when shortly after, Trump met the butcher himself and he shook his still bloody hands and greeted him with a smile?  He almost makes Trump seem tame",
                "I wonder if the name Jamal Khashoggi came up during their conversation",
                "Turns out we do negotiate with terrorists.",
                "\\*Trump and his Oligarch friends strike $600bn deal with Saudi Arabia."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Inflation eased after Trump's 'Liberation Day' tariffs, defying fears",
            "external_url": "https://abcnews.go.com/Business/inflation-data-reveal-impacts-trumps-liberation-day-tariffs/story?id=121706453",
            "upvotes": 0,
            "date": "05/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/bd55a8b0-dcda-45ea-8841-ee3540f97222/grocery-rt-er-250502_1746214585130_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "From the article \"However, many analysts anticipate a rekindling of inflation over the coming months as retailers begin to replenish inventory with goods imported after the tariffs took effect.\" I.e. it's still expected that the Trump Tariffs will still cause prices to soar for actual working Americans in the coming weeks and months.",
                "Are we sure it isn't because consumers and corporations bought a bunch of shit in anticipation of the tariffs?",
                ">Trump paused a large swath of so-called \"reciprocal tariffs\" within days of the announcement.\n\n\"Tariffs are about making America rich again and making America great again.\" -Donald J Trump\n\nIf they're going to make America rich and great why are they being paused?\n\n____\n>Still, egg prices stand much higher than they did a year ago.\n\n “You just watch: They’ll come down, and they’ll come down fast, not only with insurance, with everything.” - Donald J Trump\n\nWe're watching big guy.",
                "There are obvious lags in ordering, production and shipment of goods.   The picture in three to six months will be much more dire.",
                "Instability will persist until conservatives are excised from power at all levels",
                "Fears we wouldn't have had if he wasn't a fucking idiot. ",
                "He'll still fuck the US up.",
                "30% tariffs and uncertainty are not helping anyone though. \n\nA couple months ago most would have said 30% tariffs will harm the economy. Now its \"30% tariffs are a lot better than 140%\"",
                "Trump \"solving problems\" (that he created).",
                "Finally some good news. I’ll take it even if I suspect it’s transitory."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Kim Kardashian testifies about her terror in Paris robbery trial",
            "external_url": "https://apnews.com/article/kim-kardashian-trial-paris-fashion-week-b06a96edfa5271de2d92870dcafe2796",
            "upvotes": 0,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Imagine if i gave a fuck",
                "I don't think a person needs to be an outspoken criminal justice advocate to atone for their sin of being born rich, but it sure helps. But hey, if someone is on a tv show that's more popular than you personally like, guess it's okay to ziptie her and ductape her mouth and drag her around. That'll show the bitch. \n\n  \n(this is sarcasm, because I am pretty disgusted to show up in to a thread posted 4 hours ago and just see people get mad at the vapid woman for having the audacity to get robbed).",
                "Imagine flaunting as much wealth as possible to as many people as possible for years, keeping millions of dollars worth of unsecured merch on you, bragging constantly about where you are, and then acting surprised when you get robbed.\n\nShe couldn't even stop her bullshit long enough for the trial. It's a courtroom, not a fashion show. Get it together.",
                "It’s wild how many people joked about this when it happened, now hearing her testify makes it clear how real and terrifying it was."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "NHL suspends Florida Panthers minority owner for ‘51st state’ posts",
            "external_url": "https://www.theguardian.com/sport/2025/may/13/doug-cifu-florida-panthers-minority-owner-suspended",
            "upvotes": 2358,
            "date": "05/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/160516a3a9f0332a5169838800d226165f8968c3/212_0_3896_3117/master/3896.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f49e825b6cf4aa22da9e14dc4d829758",
            "top_comments": [
                "40% of the NHL is Canadian. 29% is American. How brain dead do you have to be to do this?",
                "Good, don’t let them normalize that propaganda",
                "Imagine having more money than you could ever spend in a lifetime and still spending your time arguing with strangers on twitter. \n\nFun side note, the Panthers have been the dirtiest team in the NHL playoffs this year and it isnt even close.",
                "Simping for Israel and disrespecting a neighbour's sovereignty, like chocolate and peanut butter",
                "damn I actually want the Leafs to advance, now",
                "Good.  51st state is never going to happen.  I love my American friends and I really hope we can continue a close relationship.  We provide great advancements as separate places.  Like Insulin, pacemaker, zipper, telephone, etc....  which we as a friendly continent and with rules allowing us to work together creates so many more advancements.\n\n  \nFundamentally Canada is different from the US.  \n\nThat shouldn't change.",
                "What a fucking asshole",
                "Fyck this MAGA & Zionist bigot",
                "The utter disrespect (and lack of knowledge of hockey) to Canada, the country that *created* the fucking game you are capitalizing on.",
                "What does it mean, practically, for him to be suspended from all activity with the team and the NHL?  Serious question."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "FDA and RFK Jr. aim to remove ingestible fluoride products used to protect kids' teeth",
            "external_url": "https://apnews.com/article/fluoride-fda-kennedy-cavities-teeth-water-22c5aefeb97c411e2fda0c4754b78cf2",
            "upvotes": 576,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So now you’re taking my choice away as to how to best protect my kids’ health? Fuck you.",
                "My dentist literally prescribed me an extra-fluoride toothpaste to help with back molars... while RFK Jr is pushing this idiocy.\n\nAt this point I'm half-expecting Trump to appoint a 'czar of software'.. who just installs backdoors into agencies, wrecks the systems, and steals all the data.\n\n*oh wait.*",
                "Wait til they hear about chlorine and its effects on beneficial bacteria.",
                "And when kids’ teeth start getting more unhealthy, the same parents who cheer for this will complain and blame literally anyone else.",
                "They truly won’t be happy until we’re a 4th world wasteland.",
                "Genuinely if you live in a non-fluoride area or even just have kids anywhere, stock up on fluoride toothpaste and these kinds of supplements now. They’re trying desperately to bring back tooth decay in children for some reason.",
                "I grew up in a rare non-flouride area in New York (thanks to that moron Governor Rockefeller) and the parents in my city had to take special steps to keep their kids teeth healthy. We had \"flouride\" days in school when we got a mega dose chew and I had a little jar of chewable flouride pills I'd have to take every night. Thank God my parents had dental insurance.",
                "We live in a small town with no fluoride in the city water and buy fluoridated water from Kroger made for kids in the baby section of the store. This is soo stupid.",
                "For an admin that wants to “make America healthy again” they sure are implementing a lot of policies that will severely harm or kill my baby. \n\nLove that for us.",
                "This country is so screwed"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Israeli air strike on Gaza's European Hospital kills at least 16 people, health ministry says",
            "external_url": "https://www.bbc.com/news/articles/cx2jvx3yjg3o",
            "upvotes": 245,
            "date": "05/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8a66/live/7370ed40-3021-11f0-8947-7d6241f9fce9.jpg",
            "top_comments": [
                "*Eyewitnesses said Israeli drones maintained a tight aerial siege over the building, preventing rescue teams from reaching the site.   A quadcopter drone reportedly wounded two civil defence officers as they attempted to approach the European Hospital.*\n\nOnce in a great while, \"war\" means two countries or sides fighting it out, but far more often \"war\" means one side cruelly devastating and destroying the other.",
                "Israel and dropping bombs on hospitals. Is there a more iconic duo? Yes, Israel firing missiles at hospitals.\n\nIs it so much to ask to *stop* turning Palestinian kids into skeletons?",
                "\"No no guys, there was totally Hamas in there\"\n\n\"OH, those dead children's bodies? They totally had Glocks and Grenades and were forming an undercover unit to invade us. They were Super-Hamas. Totally.\"",
                "Medical workers and journalists, two of the IDF’s favorite targets.",
                "We’ve seen such transpire before, read about it in history books, and said never again. Only for it happen again right in front of our eyes and do nothing about it. What a twisted world we live in",
                "When is the west going to start doing to Isreal what they are doing to Gaza? It is the only way they will stop.",
                "After the great war, when they said \"never again\" what they meant was \"never US again.\"",
                "They did it to kill one of the arch terrorists, Sinwars brother.",
                "Another atrocity and another radio silence on the global scale because the party suffering isnt trying to join nato and the offenders are still playing victim from ....\n\n uhhh how long ago was it promised to them ??"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Georgia college student remains in ICE custody after mistaken traffic stop",
            "external_url": "https://abcnews.go.com/US/georgia-college-student-remains-ice-custody-after-mistaken/story?id=121733067",
            "upvotes": 4066,
            "date": "05/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/145e291d-1815-44a8-887f-9b25c2025ec8/daltonstate_1747092879614_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I'd like to know how she ended up in ICE custody. She gets pulled over by mistake (charges have already been dismissed), and then what? Are the cops asking for the immigration status of everyone they pull over? Was she driving without a DL which triggers inquiry and then ICE arrives to detain her while they figure out if she's legal? Same with her father who got pulled over going 19mph over the limit. For most people, this is a ticket and then you go home. What is going on between them getting pulled over and detained so they end up with ICE? Because ICE can't pull people over.\n\nThere is no central registry of citizens. The only documents which prove your citizenship are your passport, naturalization certificate, or birth certificate, which most people don't carry with them at all times.. Which to me means that cops are looping in ICE on anyone they may suspect to be undocumented... and I don't see how that isn't effectively just racial profiling on Latinos in the United States.",
                "The article makes it sound like she actually is and always has been undocumented. I'm asking because I truly have no idea; how does an undocumented person obtain a driver's license and enroll in a university? ",
                "Reading the article it says she’s been in the U.S. since she was 4yo but her parents say she couldn’t register under DACA since the program ended. I thought DACA is technically still in place? Or at least it shouldve been 10 years ago unless I’m reading this wrong",
                "This is beyond scary at this point.",
                "[removed]",
                "19 mph over is a violent offender?",
                "\"We're going after violent criminals and gangs\"\n\n*Goes after working families and students*",
                "Wow, ICE is a combination Keystone Cops and Nazi Brown Shirts. Amazing they can ever find anything non immigrant related.",
                "the reddit admins have been censoring comments critical of ICE and any suggestion that we defend ourselves against these actions.\n\nthe reddit admins believe this to be cool and good.",
                "We legals have nothing to worry about?  \n  Yeah, sure..."
            ],
            "aggregate_sentiment": 35.0
        },
        {
            "category": "RISING",
            "title": "Small nodule found in Joe Biden's prostate during recent physical",
            "external_url": "https://abcnews.go.com/US/small-nodule-found-joe-bidens-prostate-recent-physical/story?id=121743026",
            "upvotes": 2725,
            "date": "05/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/270fecd5-10fa-4ed7-a838-ebd3333d8383/biden-main_1747135541861_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I would like to unsubscribe from Joe Biden Prostate Facts",
                "I’m a doctor. MOST men will die with pathology confirmed prostate cancer (I forget the exact number but I think it’s like 80%). Unless it is widely metastasized, joe Biden will die LONG before this cancer has any effect on his health.",
                "Wild that we can know what’s going on inside Joe biden’s asshole but we can’t get an accurate height and weight of the president. ",
                ">\"In a routine physical exam a small nodule was found in the prostate which necessitated further evaluation,\" a spokesperson told ABC News.\n\nGood time to remind everyone to get checked regularly.",
                "Yeah I’m glad I’m not famous",
                "Breaking news, old guy has stuff going on physically. More at 11.",
                "[removed]",
                "Small nodule found in Trump's prostate is just Lindsey Graham.",
                "I feel like this information has just been forced upon me against my will.\n\nI'm not happy about this.",
                "They also found 250 pounds of lard ass during Trump's physical yet no one seems to care. \n\nLiberal media I guess."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Former Philippine president Rodrigo Duterte wins mayoral election from jail cell at The Hague",
            "external_url": "https://www.abc.net.au/news/2025-05-13/rodrigo-duterte-wins-philippines-mayoral-election/105285210",
            "upvotes": 1290,
            "date": "05/13/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/9ba55be4146681f1628414f45655e334?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485&imformat=generic",
            "top_comments": [
                "Wait, I missed episodes there, I didn't even know he was at the Hague!",
                "WFH mayorship means Work From Hague",
                "Filipinos couldn't stand American stupidity being the only thing in the news",
                ">The former president's two sons were also set to win posts on Monday, one re-elected congressman and the other winning the contest for Davao vice-mayor and likely to serve in his father's absence.\n\nInteresting to see this. I wonder what's going to happen if he loses the case.",
                "Philippines is a shining example of how corruption thrives on ignorance.",
                "So they elected a convicted felon, you say?",
                "how bad does your life have to be to vote for con men and criminals?",
                "Filipino here. Dejected but not surprised. His election as president completely solidified my pessimism about politics and my faith in my country (which had been dropping for years).",
                "Sometimes, it's just nice to be reminded that this kind of self destructive stupidity isn't relegated to the US.",
                "He subsequently gave a passionate, rousing, and hair-raising victory speech to the seven cell bars, before being hushed into silence by the guards. He did, however, get three slices of apples as a congratulatory present, instead of the standard two."
            ],
            "aggregate_sentiment": 25.0
        },
        {
            "category": "RISING",
            "title": "US strikes $600bn deal with Saudi Arabia as Donald Trump's Middle East tour begins",
            "external_url": "https://www.lbc.co.uk/usa/politics/us-strikes-600bn-deal-with-saudi-arabia-donal-trumps-middle-east-tour-continues/",
            "upvotes": 3310,
            "date": "05/13/2025",
            "thumbnail": "https://images.lbc.co.uk/images/723443?width=1200&crop=16_9&signature=ANwtk71HDdQkmTLCnEwBHzZnEEg=",
            "top_comments": [
                "\"Mr. President, a second plane just got gifted to you\"",
                "Also from the article.\n\n“*Meanwhile, Trump also struck a deal with China on Monday to cut tariffs by 115% over the next 90 days in what could spell the end of his administration's global trade war.”*\n\nNo mention of the 30% tariff that remains in place or the de minimus exemption that became a 54% tariff or the 10% across the board tariffs or the 25% auto tariffs or… \n\nJournalism is dead.",
                "MAGA has sold America to rich Arabs, Russian oligarchs, tech billionaires, and A.I. lobbyists.",
                "Further proof that Saudi Arabia owns Clinton and Biden, right MAGA?",
                "In 2024, Saudi Arabia's GDP reached approximately $1.09 trillion at current prices.\n\nSo they’ve pledged approximately 60% of their annual gdp to invest in the USA.",
                "One can guess how much he'll personally get out of this deal.",
                "Remember when Trump was president for the 1st time,  and that Saudi born journalist was hacked into small pieces? Do you also remember when shortly after, Trump met the butcher himself and he shook his still bloody hands and greeted him with a smile?  He almost makes Trump seem tame",
                "I wonder if the name Jamal Khashoggi came up during their conversation",
                "Turns out we do negotiate with terrorists.",
                "\\*Trump and his Oligarch friends strike $600bn deal with Saudi Arabia."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Microsoft is cutting 3% of all workers",
            "external_url": "https://www.cnbc.com/2025/05/13/microsoft-is-cutting-3percent-of-workers-across-the-software-company.html",
            "upvotes": 4099,
            "date": "05/13/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108144510-17471116752024-04-30t031054z_160536770_rc2pg7auia21_rtrmadp_0_microsoft-indonesia.jpeg?v=1747111745&w=1920&h=1080",
            "top_comments": [
                "Next week: Facebook, Meta and Google are cutting 3% of all workers.",
                "“Microsoft had 228,000 employees worldwide at the end of June, meaning that the move will affect thousands of employees.”\n\nSheeeesh",
                "\"Not related to performance\" makes it that much worse.",
                "Microsoft had $88.14 billion in profits last year and they are the most valuable stock currently, at $3.33 trillion.  Their profit margin is nearly 36% and all metrics were up from their prior year results.   Their tax rate was 18.23%.",
                "Sadly, Microsoft has a ritual of blood sacrifice in Q4 of its fiscal year. This allows them to write off the severance costs in one fiscal year without impacting the bottom line in the new year. \n\nYou can expect to see more positions cut through the first week or two of July. Depending on the size of the cuts, it might not make the news. They are only legally required to report it if the cuts are over 300 per job site, if I remember correctly.",
                "Its better than the 10% every year they used to do in the 2000-2012.",
                "I know multiple people working at nonprofits in Washington state that are getting laid off as many are trimming 80%+ of their staff or shutting down entirely. Some of these orgs have been successfully serving their community for decades but are dependent on funds from the state and/or corporations like Microsoft and both are drying up entirely. Thousands of folks are losing their jobs and the ripple effect on the community they spend money in and the people they serve is going to hit hard and won’t correct any time soon. This is the calm before the storm not the storm.",
                "I really think developed economies will have to figure out how they will deal with AI inevitably displacing so many jobs. Of course, we are instead going to wait for the crisis to occur and then try to implement a half-assed solution.",
                "Don't dedicate yourself unless you have one of these two titles, OWNER or SHAREHOLDER. There is ZERO loyalty time to recognize.",
                "The phrasing sounds like they're taking approximately two fingers and a kidney from everyone."
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "RISING",
            "title": "UnitedHealth suspends annual forecast, CEO Andrew Witty steps down",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/unitedhealth-ceo-andrew-witty-steps-down-2025-05-13/",
            "upvotes": 10912,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "My company recently moved insurance from Blue Cross/Blue Shield over to this hot mess. Man, when I tell ya…absolutely *dog shit* insurance company. We went from pretty good coverage to them nickel and diming over everything. Would strongly advise to stay away from UnitedHealth.",
                "I hope UnitedHealth continues to go under. Awful company. Their denial rate is 2x that of the industry average. Total scam of a company",
                "[Understanding the Change Healthcare Breach and Its Impact on Security Compliance](https://hyperproof.io/resource/understanding-the-change-healthcare-breach/)\n\nIn short, quite possibly the largest healthcare data breach in history occurred under his watch.",
                "\"CEO Andrew Witty steps down\"\n\n'Hey guys, make sure EVERYONE knows I'm not CEO of UnitedHealth anymore. Issue press releases, take out ads, maybe put up a banner with the new guys face on it....'",
                "Sounds like fall out from the lawsuit. Good thing stockholders get taken care of. God forbid someone does anything to prevent another CEO being killed. All about those dollar bills.",
                "In simple terms, my rates are going up, big time",
                "> surging medical costs send its shares plunging more than 11%\n\nWhich is a perfect example of why medical care should not be a for-profit enterprise.",
                "This was moments after the board voted against metal detectors outside annual forecast meetings",
                "I never buy personal reasons.  Had a few people leave my company like that.  One cared way too much and it showed as she was doing her two weeks.  She finally told us it was a silent layoff.  Our boss left for personal reasons with no job at the same time.  \n\nShit is going sideways after the shooting and this guy either wasnt doing what he needed/asked to do or he just fucked it all up and the board said time to go.  \n\nHe could have something personal too.  He’s human.  But with the other stuff.  Seems like board asked him to leave.",
                "Who could have guessed assassinating one CEO could have collapsed a company so badly.  There stock price is down like 40% just in the past 6 months, and they’ve lost a second ceo now too."
            ],
            "aggregate_sentiment": 34.0
        },
        {
            "category": "RISING",
            "title": "Peter Sullivan, who has spent 38 years in jail for murder, has conviction quashed",
            "external_url": "https://www.theguardian.com/law/2025/may/13/peter-sullivan-jail-murder-conviction-quashed-diane-sindall",
            "upvotes": 437,
            "date": "05/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/bc633f7c8ab2360f67b61f39026fd5a8f4cd0d37/52_6_739_591/master/739.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e250b78e04c6205368dd88aa3726c842",
            "top_comments": [
                ">The Criminal Cases Review Commission (CCRC) said in a statement that there was \"evidence to suggest there were possible breaches\" by the police in the interviewing process, which included denying Sullivan \"initial legal representation\" and interviewing him without \"an appropriate adult.\"\n\nPolice were able to get a “confession” out of him, which he later retracted. \n\nIt’s really appalling how police can pressure an innocent man into a false confession. Without the DNA evidence finally being tested, he’d still be in prison.",
                "2 lives were lost that day. \n\nHopefully Peter can find joy in what time he has left.",
                "Finally Ivan Dobsky is free again",
                "I support giving him all of the states money",
                "PRI-SON\n\nNobody is in jail for 38 years"
            ],
            "aggregate_sentiment": 92.0
        }
    ],
    "last_updated": "05/13/2025 20:10:21 UTC"
}