{
    "posts": [
        {
            "category": "HOT",
            "title": "Young woman's strip search at festival akin to 'sexual assault', court told",
            "external_url": "https://www.abc.net.au/news/2025-05-05/young-woman-strip-search-sexual-assault-court-nsw-police/105253220",
            "upvotes": 1267,
            "date": "05/05/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/ef1b6cfe6b1f485eed0fc526fe9abc97?impolicy=wcms_watermark_news&cropH=1447&cropW=2573&xPos=0&yPos=134&width=862&height=485&imformat=generic",
            "top_comments": [
                "Police in Sydney routinely conduct invasive strip searches at music festivals. We’re talking completely naked searches where guys are told to lift their balls, girls are told to lift their boobs, attendees are told to squat and cough, bend over etc. Most of these strip searches don’t find any drugs, and you’ve got reports of innocent people being left completely distraught after this has happened to them. NSW Police are currently facing a class action over this. So far around 3000 people have signed up. A trial for that class action began today, hence the article.\n\nFor background: In 2001, New South Wales (state in Australia, Sydney is the capital) introduced a law giving police the power to deploy drug detection dogs at certain public locations, namely at major events such as music festivals, train stations and at venues that serve alcohol, such as pubs and clubs. These dogs are notoriously unreliable, and there are reports on social media of handlers forcing their dogs to sit in front people in order to have them searched.\n\nMusic festivals are the worst. The police have drug detection dogs at every music festival in Sydney. At these events, they’ll have a fenced off compound setup with makeshift structures such as tents or ticket booths where people stopped by the dogs are taken to be searched. Some people are lucky enough to get away with a pat down, but in many cases, festival attendees have been ordered to strip completely naked and bend over, squat etc. to have their bodies examined for drugs. At any given event, they’ll strip search dozens of people like this. Total gestapo stuff and it’s still happening today.",
                "I really try not to think the worst of people but \"drug dog sniffed in her direction\" sounds like a cover up of  \"wanted to see the attractive festival goer naked and needed some kinda probable cause\" yuck.",
                "People that put these policies in place should have to go through this stuff themselves in a public space and then decide if the \"problem\" they think they're solving is worth the solution they've decided upon.",
                "\"Parliament had made it clear strip searches were only supposed to be used \"in the most extreme of circumstances\", but that was not the way they were being executed by NSW Police.\"\n\nI know why, it's because you have perverts in positions of power and are abusing it for their own pleasure. \n\nShe was asked to strip, expose all parts of her body, drop her breasts, bend over and expose her anus and vagina, also ordering her to bend over while naked and remove a tampon. AND, a male police officer walked into the cubicle unannounced and observed the plaintiff in this position. Putting a woman through that because a cop had a \"hunch\"? Right. \n\nThose cops got off on it. Just disgusting behavior that should have consequences. This is not the kind of people you want in the police force.",
                "That sounds worse than the airport controls. Is this procedure really common in Australia?",
                "Human rights are under constant attack and not for granted.",
                "I wonder if those cops would do that to their own family, how they'd react if they heard that happened to their kids. Seems like a lack of humanity being experienced here by these individuals. When you're the one committing heinous acts, are you the protector anymore or are you the problem that needs to be solved?",
                "What in the world did I just read this is so creepy",
                "They can be big proud they may have pretend a few people from getting high that day though.",
                "Sounds like assault to me. Appalling. I wonder what kind of conviction rate they have to justify this heavy-handed behaviour cos it sure sounds like a hammer to crack a nut. Hope the woman gets justice."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "‘A slippery slope to eugenics’: advocates reject RFK Jr’s national autism database",
            "external_url": "https://www.theguardian.com/us-news/2025/may/05/autism-national-database-rfk-jr?CMP=Share_AndroidApp_Other",
            "upvotes": 894,
            "date": "05/05/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3961e2be8801d866644ec0bfc8935ccd478f70fa/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=92cf232e07a7815bf436c990b549985e",
            "top_comments": [
                "It's not a slippery slope if the intended destination is eugenics.",
                "You can tell this man isn't a scientist:\n\n“By September, we will have some of the first answers. Within six months of that, we will have definitive answers,” Kennedy said.\n\nYou can't just decide you will know the answer and declare a timeline for that.",
                "Just wait till he starts talking about phrenology and the four humors.",
                "Bottom of the slope. RFK Jr’s beliefs are eugenicist, and the database will be a eugenicist project whether or not it is eventually used in a genocide.",
                "How a heroin addict who admits he had a brain eating worm is in charge of the nations health is beyond me.\n\nThe heroin addiction is the thing that I’m amazed isn’t brought up more. Not saying you can’t recover and have a long and successful life after, just that it should disqualify you from being the head of health and human services.",
                "Can we call it a greased ramp?",
                "It's a vertical cliff, not a slippery slope.",
                "\"An expressway with only one exit\"",
                "Lebensborn, here we come.",
                "More Nazi shit. Go figure"
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "HOT",
            "title": "Trump announces 100% tariff for movies produced outside US",
            "external_url": "https://www.reuters.com/business/media-telecom/trump-announces-100-tariff-movies-produced-outside-us-2025-05-04/",
            "upvotes": 2719,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So movies, Alcatraz, and tourism.... Sounds like he's going after California",
                "Apparently Jon Voight asked Trump about tax breaks for domestically made films and this is where this came from.",
                "So it’s tariffs on US products. Great job guys!",
                "“film overseas in countries such as Canada”\n\nLaughing my fucking ass off over here! The reporters are idiots, as are the editors who didn’t catch this.",
                "How the fuck do you tariff something that can be transferred completely digitally? Fuck he is stupid.",
                "Soon 100% tariff on video games",
                "How does that even work? How much outside US production counts? How do you impose a tariff on a movie? On the media? If the DVDs are made outside the US then doesn’t a tariff already apply. If domestic, then how? Do they impose a tariff on the prints or drives theatres use? What if those are domestically produced? How do you apply a tariff to streaming content?\n\nThis is just bullshit.",
                "hrm, what about all of it filmed in toronto?",
                "It's so he can scare movie companies into making pro right wing content. You can bet Trump is Great (filmed in China) would get a pass, whereas Climate Change is Going to Kill Us All You Maniacs (made in California) would get the tarrifs.",
                "How would that even work for Marvel movies?  They're made in several different countries each."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Woman missing since 1962 found 'alive and well'",
            "external_url": "https://www.bbc.com/news/articles/cvgpjgwxlxwo",
            "upvotes": 9145,
            "date": "05/04/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/66f6/live/2ae0ff60-2901-11f0-8c66-ebf25fc2cfef.jpg",
            "top_comments": [
                "*The group said that days before she went missing, Ms Backeberg, now 82, had filed a criminal complaint against her husband, whom she had married at the age of 15, alleging he had beaten her and threatened to kill her.  On the day she disappeared, she left home to pick up her pay cheque from the woollen mill where she worked.*\n\nI'm wondering what happened to her two children from that very early marriage. Anyway, the story makes lots of sense... she just hitch-hikes out of town with her baby-sitter... they split up and go their own ways...Backeberg out of state and lost almost forever.",
                "My grandmother effectively did this to her first two kids. her first husband was wealthy and influential. He was also abusive and controlling of her. He told her if she divorced him she would never see her children again. She left anyway and she wouldn't see her kids again until she was eighty years old after he died and her kids found out she was still alive (the husband told them she died). \n\nThe way she put it, the kids would have had a dead mother whether she stayed or not, so she chose to leave and live with the hope she would see them again one day instead of staying and either being killed by him or killing herself.\n\nEdit: I'm seeing a lot of comments under this arguing over different scenarios so I'll add more context to the story to help clear things up. \n\nMy grandmother married this man when she was sixteen and he was nearly thirty. She had her first son when she was seventeen and the second at eighteen. The oldest was three when she left.\n\nHer husband was a literal piller of the community type. Very wealthy, from a well-to-do family, very involved in local and state politics due to his business connections. Donated to the local police department to keep them on side, had a team of lawyers at his disposal, the works. \n\nMeanwhile my grandmother was from a poor family of nine growing up in a rural community. They had nothing and her marriage to this man (who she met after she participated in a beauty pageant, of which he was one of the producers,  and who asked to marry her mere months after said meeting) was seen as her and her family's way out of poverty. \n\nFrom how she described it to me, she knew she could not leave and keep her kids. Everyone she knew was local and she couldn't risk hiding out with them, it was the 50's and she had no job experience, she knew if she tried to kidnap her children she would be tracked down, labeled insane and put away somewhere where she would never see her kids again. She knew she would lose a legal battle for custody given her husband's connections, and she also knew the cops wouldn't help because one night she did call them and when she told them what was happening and her address, they hung up on her. He apparently beat her the next night because his buddies at the station told him she called. \n\nAccording to her, he never touched the kids, and she didn't think he ever would. What gave her that confidence, I don't know. \n\nHe granted her the divorce on the grounds she gave up custody, never contacted them again, never went public about what he did to her, and collaborated his story that he chose to divorce her due to her having a drinking problem and him not feeling safe with her around the kids. \n\nTo quote my grandmother as best as I can remember \n\n\"I thought about killing him and running away with them, stealing all the money I could from the house and starting over somewhere, but I knew I wouldn't get away with it, and my boys would end up living with his parents while I was thrown in jail. I had this mentality,  despite everything, that the boys deserved to have at least one of us around, so I agreed and left. My family knew the truth, but we never let it get out out of fear of him coming after us. I've had to make a lot of hard decisions in my life, but leaving my boys with him was the hardest thing I've ever done. I wish I could say I did it completely out of selflessness, that it was all for them, but there was always a part of me. A small, small part, that was just relieved I was free of him forever\". \n\nShe was so scared of him that when her sons contacted her  over sixty years later the first thing she asked was if their father was still alive. He had died a month prior to pancreatic cancer, they had spent the better part of a year looking for her after their step mother told them the truth. After learning everything from their father, who apparently became very truthful in his last days. they had no anger towards my grandmother for what she did. \n\nFor their father's part, he never abused them though he was very much a tough love parent with them while they were growing up which had already left them with a strained relationship prior to all this coming to light. They grew up very well off, both going to Ivy League schools. I know the one went into biomedical engineering I can't remember what the other did. \n\nThey would only meet my grandmother a few times before she herself passed away a year later due to a head injury from a fall. I only met them once and it was at the funeral. I haven't spoken to them since and neither has anybody else in the family as far as I know. Not due to hostility but simply due to us all having our own families and lives. \n\nI hope that helps clear any questions up.",
                "My father abandoned his wife of 6 years and 3 small children in 1964.  Literally went out for cigarettes and never came home.  The act completely wrecked the family: the kids were adopted out to other family members and the mom was never the same again.   \n\n2 years later in 1966 he met my mother, settled down under an assumed name, and had my sister in 1968 and me in 1973.  He took my birth certificate and created a new identity for himself (I never got a SS card until I was 12, and officially I am \"Junior\" even though my birth certificate says otherwise).  We found this out after his death in 2019, [when I found an envelope](https://imgur.com/t7LcmY3) addressed to me only, with 3 fake birth certificates, 3 sets of legit Social Security cards, 3 identities and a bunch of still-cryptic papers no one quite knows what to make of.  \n\nNo one knew.  We got in contact with our half siblings.  They are lovely people who have come to peace with the whole situation and are pretty well adjusted.  My sister and I are not and feel constant guilt over it.",
                "So the 14 year-old babysitter went back to their hometown and kept that secret all these years? Impressive",
                "Happened to my grandfather. His dad died of TB right around the same time he was born. Mom had him stay with friends of the family while she got got settled.  When she came back she was told her kid was dead. She didn't meet mt grandfather again until he was in his 60s",
                "It reminds the character played by Julianne Moore in the movie The Hours.",
                "Damn, there is so much more to this story that the article failed to answer. I feel left unsatisfied.",
                "Some people will condemn her for not taking her kids, but this was a very different time for women's rights. \n\nShe was only 19 and married to an older man. There's no telling if she even wanted to be married much less a mother. Dude was physically abusive so it wouldn't be a stretch to think he was sexually abusive too and birth control wasn't really a thing back then. Divorce without cause was illegal at this time so she would have to legally prove he was abusive. Considering she wasn't having any luck getting help when she reported the abuse, it didn't seem likely. \n\nBack then women couldn't legally have their own bank account or credit card. Jobs for women didn't pay enough to really support a family. And until the 80s it was legal to refuse to rent to women with children. \n\nShe probably felt it was hopeless to even attempt to take her kids because she wouldn't be able to provide for them and he would be able to use them to keep control of her. She was young, abused, and desperate in a world where women were very restricted in what they could do. It's important to remember that.",
                "TLDR: She was in the last place they eventually looked.",
                "I wonder if her kids will contact her?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Steelmaker Cleveland Cliffs to idle 3 steel plants in Pennsylvania and Illinois",
            "external_url": "https://abcnews.go.com/US/wireStory/steelmaker-cleveland-cliffs-idle-3-steel-plants-pennsylvania-121415395",
            "upvotes": 18817,
            "date": "05/04/2025",
            "thumbnail": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg",
            "top_comments": [
                "“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production at Dearborn,”\n\nOh okay. I’m sure the two thousand workers being laid off will just call up their mortgage companies and let them know once trumps policies really take effect they will resume payment on the mortgage. Surely their lender will understand and let them live for free until whenever the fuck this fantasy might play out.",
                "Anyone want to guess where a Cleveland Cliffs plant is that could really fuck over a lot of Trump voters? Middletown, Ohio, childhood home of JD Vance. The same plant that his beloved grandpa worked and earned a pension from that paid to raise him.\n\n\nIf that plant shuts down even for a bit I can't wait for the bitching and moaning from the people that voted for those two assholes to begin and the Olympic level gymnastics as they try to assign blame to anyone but them.",
                "I’ve written hundreds of company press releases and can attest that we go to great measures to wordsmith these things, and spend days crafting them while hanging on the impact of individual words and how they’ll be received by investors, analysts and the Street at large. We prep responses to potential inbound questions and go overboard in every sense of the word. \n\nThe phrase *insufficient demand and pricing* is the key here. The Investor Relations and Comms team burned days coming up with something sufficient to relay to the Street and…shat the bed. Absolutely anyone paying attention that matters knows what these words mean. The follow up question to *our company is experiencing simultaneous *declining demand and increasing costs* is “what are the primary catalysts causing your declining demand and increased costs?” If management says something akin to *definitely not the tariffs* they’ll get laughed out of their jobs. \n\nLet’s see how the stock reacts tomorrow morning. The company’s earnings call is on May 8th, where they are surely going to get questioned and pressed on the economic backdrop impacting the company.\n\nAlso, in a separate release the company said in March that it will idle a steel plant in Dearborn, Mich., affecting about 600 workers, citing “weak automotive production in the United States.\"\n\n“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production at Dearborn,” it said.\n\nThose 600 workers will likely get their jobs back in about 5-7 years, or perhaps longer.\n\n*edit\n\nI found some numbers. This isn’t scientific or even rigorous, but apparently ford reshored the production of the F-650 some years ago. It took about a year to get the plant going and the company sold 17,000 units that production year. That represents less than 1% of 2024 total unit sales. Good luck everyone.",
                "Even if it's not the tariffs. Wasn't the point of electing this moron to IMPROVE the economy?\n\nOk, cool. It wasnt the tariffs. You're still not delivering on your promises",
                "Is this winning and bringing manufacturing back to America…..?",
                "Trump won Pennsylvania, congratulations! 🎉",
                "“Nothing to do with the tariffs” Except for it has everything to do with tariffs",
                ">The company said the idling of two Pennsylvania plants, one in Steelton and one in Conshohocken, and one in Riverdale, Illinois, is due to “insufficient demand and pricing” and nothing to do with President Donald Trump's tariffs.\n\n\"Idle\" means close.\n\nThey're *closing* these plants indefinitely. \n\nYes, it's the fucking tariffs",
                "“Insufficient demand because… insufficient demand because… Bueller… Bueller…”",
                ">“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production\n\nConservatism is a faith-based superstitious political and economic ideology no different than a religion or cult\n\n\nRepublicans- doing the same thing over and over again expecting different results"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Cuts have eliminated more than a dozen US government health-tracking programs",
            "external_url": "https://apnews.com/article/cdc-disease-tracking-health-surveillance-554eb9aa20b758714eba8b835dcde856",
            "upvotes": 2188,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*Among those terminated at the Centers for Disease Control and Prevention were experts tracking abortions, pregnancies, job-related injuries, lead poisonings, sexual violence and youth smoking, the AP found.*\n\nTargeting women, youth, and workers. Let's hope the newly created Health dept is going to continue these critical records, but I'm not all that hopeful.",
                "RFK, Jr. probably: Why would we need to track public health when we all could just use more homeopathy? /s",
                "Any chance that includes the new Autism Database that 100% won't be used to hunt down and round up anyone, we promise?",
                "When you elect stupid people you get stupid results.",
                "There's no cases if there's no tracking.",
                "If you stop measuring it, it doesn’t exist",
                "If you don't count them, they're not really sick!\n\nIt was Trump's motto for Covid.  Why not everything else?",
                "this is not keeping America safe.",
                "Die for a $100million Trump Nazi birthday parade. Priorities of the regime are crystal clear"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Police foil bomb plot targeting Lady Gaga's biggest-ever show on Copacabana beach",
            "external_url": "https://news.sky.com/story/lady-gaga-puts-on-her-biggest-ever-show-for-free-on-rios-copacabana-beach-13361275",
            "upvotes": 5848,
            "date": "05/04/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-lady-gaga-copacabana-beach_6905650.jpg?20250504034928",
            "top_comments": [
                "2.1 million people, and this could’ve ended in tragedy. The fact that teens were being radicalized under the disguise of fandom is terrifying. Huge credit to Brazilian police for catching it in time, this could’ve been one of the darkest moments in live music history.",
                "So if I’m understanding the story correct, they’re saying this was a small group of super fans wanting to attack “fake” fans?\n\nTry getting your own life first instead of taking someone else’s.",
                "There was no plan to bomb the concert.   There was an attempt to radicalize youth that went nowhere.  They did a bunch of raids and found one adult In different city with a handgun and a teenager with child porn.    If they didn't do the raids, there us zero evidence there was an actual plan to set off a bomb at the concert.",
                "Why are people not calling this terrorism? They keep referring to it as a hate crime, but, it's literally terrorism.\n\n***Terrorism = The threat, or use of violence against a civilian population for a political end.***",
                "Radicalize the kids into what ideology exactly?",
                "Lady Gaga is my guilty pleasure\n\nGlad they foiled the attack!",
                "Of all possible people. I just don’t understand how people think.",
                "[Insert Barry Manilow Joke Here]",
                "And thats why you dont amass crowds like that. I get its historical and a cool thing to say but that is far too many people in one place if anything happens the worst part wouldnt even be the bomb itself itd be the panic and the hundreds if not thousands of lives that would have been lost simply from being crushed to death from the crowd. \n\nI would never put myself in that situation id be terrified.",
                "[deleted]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Thousands of Islamists rally in Bangladesh against proposed changes to women's rights...",
            "external_url": "https://apnews.com/article/bangladesh-women-rights-islamists-rally-114e1acbe56e7be75bc9b5273365a17a",
            "upvotes": 6437,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Humanity's inability to fight religious extremism will be its undoing.",
                "A few examples of the things they are protesting: \n\nAcknowledgement and criminalization of marital rape. According to Islam, there is no such thing; one of the top Islamist leaders defined rape as consensual sex between unmarried men and women. \n\nLegalization of sex work. Yeah. \n\nEquity in inheritance laws. According to Islam, a daughter is entitled to exactly half the inheritance a son is entitled to. Equality is unacceptable to Islamists. \n\n\n\nWords can't express the fury and despair this evokes in sane Bangladeshis. Unlike us though, they are organized and motivated, and they currently have the upper hand. \n\nThese are very dark times, and it's only going to get worse, I'm afraid.",
                "fuck every single one of them",
                "Bunch of weak ignorant Stone Age “men”.  They should be ashamed of themselves.",
                "What kind of disgusting person you need to be to deny women’s rights ? And who’s defending this nonsense?",
                "Thousands of humans, less than 100 combined total IQ",
                "Ill mannered man-children who should be spanked and sent home to their mothers. Pathetic, cowardly and weak.",
                ">Mamunul Haque, a leader of the group, demanded that the interim government’s reforms commission be abolished and its members punished for the proposed changes. He said they hurt “the sentiments of the majority of the people of this country”\n\nThe men. It upset the men.",
                "Fuck Islam and any other religion that uses God as an excuse for violence and oppression",
                "Imagine where humanity would be right now if we didn't have religion slowing us down every step of the way"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Two people and dog dead after small plane crashes into Los Angeles-area neighborhood",
            "external_url": "https://www.theguardian.com/us-news/2025/may/04/small-plane-crash-los-angeles-area-neighborhood",
            "upvotes": 1408,
            "date": "05/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4bc0b9b201e6a512fac9fba8e071e3997c47424c/0_0_3293_1976/master/3293.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=25e5a2e7975d021b7e0b02231f1d0af6",
            "top_comments": [
                "All were aboard the aircraft. RIP.",
                "*As of Sunday, authorities had not released any information about the occupants of the single-engine Van’s RV-10, which is a popular homebuilt plane sold in kit form*\n\nHome-Built with mixed results since there's less over-sight of the work done, which may be superior or inferior.",
                "Absolutely heartbreaking. Just imagine relaxing at home and a plane crashes between two houses, flames, smoke, chaos. It’s a miracle no one on the ground was hurt, but still, two lives and a dog gone in seconds. 💔",
                "Ever since DCA and the helicopter it feels like every crash has been making the news",
                "This also isn’t the first time something like this has happened in the area. Harrison Ford crash landed a vintage ww2 plane on a golf course not far from there a few years ago.",
                "Weird to call Simi Valley, Los Angeles, when it's not even in the same county and 40 some miles away.",
                "I just need to know Harrison Ford is okay",
                "Quote: Van’s RV-10, which is a popular homebuilt plane sold in kit form\n\n\nWait, what? People can put their own plane together like ikea furniture? Tell me, there's some kind of official inspection before the first flight",
                "The weather sucks for flying today.",
                "This crash happened very close to the house I grew up in.  So close in fact I had to double check to make sure it wasn't that house!"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "Israel calls up thousands of reservists, plans to expand Gaza offensive amid stalled hostage talks",
            "external_url": "https://edition.cnn.com/2025/05/03/middleeast/israel-mobilizes-reservists-gaza-intl-latam",
            "upvotes": 2042,
            "date": "05/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-05-03t182045z-231072415-rc2haeajhfyf-rtrmadp-3-israel-palestinians-gaza.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The hostage talks seem irrelevant to the rest of the headline, imho",
                "Is there anything left in Gaza? When is enough enough?",
                "An offensive against a sea of rubble.",
                "Calling this a war is like calling a man assaulting a child a fight.",
                "When Israel rounds up civilians in Palestine and detains them indefinitely without trial: prisoners. When Hamas does it: hostages.\n\nThis shit is why literally nobody trusts the big news media anymore.",
                "They do not care about the hostages one bit. We all know what the goal is here.",
                "Can't wait to do 20 years in prison for hurting the feelings of a bloodthirsty colonial state.",
                "If Israel cared about the hostages they wouldn’t flatten the buildings they are being held in.",
                "History books won’t be kind to Israel and the west that support/ignored the war in Gaza.",
                "“Gaza offensive” is an offensive way to avoid calling what’s happening in Gaza a Genocide."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "The spies are everywhere . . . .",
            "external_url": "https://www.bbc.co.uk/news/articles/cqj4kze7kvdo",
            "upvotes": 0,
            "date": "05/05/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6593/live/2a5047f0-298c-11f0-8c66-ebf25fc2cfef.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "‘A slippery slope to eugenics’: advocates reject RFK Jr’s national autism database",
            "external_url": "https://www.theguardian.com/us-news/2025/may/05/autism-national-database-rfk-jr?CMP=Share_AndroidApp_Other",
            "upvotes": 900,
            "date": "05/05/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3961e2be8801d866644ec0bfc8935ccd478f70fa/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=92cf232e07a7815bf436c990b549985e",
            "top_comments": [
                "It's not a slippery slope if the intended destination is eugenics.",
                "You can tell this man isn't a scientist:\n\n“By September, we will have some of the first answers. Within six months of that, we will have definitive answers,” Kennedy said.\n\nYou can't just decide you will know the answer and declare a timeline for that.",
                "Just wait till he starts talking about phrenology and the four humors.",
                "Bottom of the slope. RFK Jr’s beliefs are eugenicist, and the database will be a eugenicist project whether or not it is eventually used in a genocide.",
                "How a heroin addict who admits he had a brain eating worm is in charge of the nations health is beyond me.\n\nThe heroin addiction is the thing that I’m amazed isn’t brought up more. Not saying you can’t recover and have a long and successful life after, just that it should disqualify you from being the head of health and human services.",
                "Can we call it a greased ramp?",
                "It's a vertical cliff, not a slippery slope.",
                "\"An expressway with only one exit\"",
                "Lebensborn, here we come.",
                "More Nazi shit. Go figure"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Young woman's strip search at festival akin to 'sexual assault', court told",
            "external_url": "https://www.abc.net.au/news/2025-05-05/young-woman-strip-search-sexual-assault-court-nsw-police/105253220",
            "upvotes": 1261,
            "date": "05/05/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/ef1b6cfe6b1f485eed0fc526fe9abc97?impolicy=wcms_watermark_news&cropH=1447&cropW=2573&xPos=0&yPos=134&width=862&height=485&imformat=generic",
            "top_comments": [
                "Police in Sydney routinely conduct invasive strip searches at music festivals. We’re talking completely naked searches where guys are told to lift their balls, girls are told to lift their boobs, attendees are told to squat and cough, bend over etc. Most of these strip searches don’t find any drugs, and you’ve got reports of innocent people being left completely distraught after this has happened to them. NSW Police are currently facing a class action over this. So far around 3000 people have signed up. A trial for that class action began today, hence the article.\n\nFor background: In 2001, New South Wales (state in Australia, Sydney is the capital) introduced a law giving police the power to deploy drug detection dogs at certain public locations, namely at major events such as music festivals, train stations and at venues that serve alcohol, such as pubs and clubs. These dogs are notoriously unreliable, and there are reports on social media of handlers forcing their dogs to sit in front people in order to have them searched.\n\nMusic festivals are the worst. The police have drug detection dogs at every music festival in Sydney. At these events, they’ll have a fenced off compound setup with makeshift structures such as tents or ticket booths where people stopped by the dogs are taken to be searched. Some people are lucky enough to get away with a pat down, but in many cases, festival attendees have been ordered to strip completely naked and bend over, squat etc. to have their bodies examined for drugs. At any given event, they’ll strip search dozens of people like this. Total gestapo stuff and it’s still happening today.",
                "I really try not to think the worst of people but \"drug dog sniffed in her direction\" sounds like a cover up of  \"wanted to see the attractive festival goer naked and needed some kinda probable cause\" yuck.",
                "People that put these policies in place should have to go through this stuff themselves in a public space and then decide if the \"problem\" they think they're solving is worth the solution they've decided upon.",
                "\"Parliament had made it clear strip searches were only supposed to be used \"in the most extreme of circumstances\", but that was not the way they were being executed by NSW Police.\"\n\nI know why, it's because you have perverts in positions of power and are abusing it for their own pleasure. \n\nShe was asked to strip, expose all parts of her body, drop her breasts, bend over and expose her anus and vagina, also ordering her to bend over while naked and remove a tampon. AND, a male police officer walked into the cubicle unannounced and observed the plaintiff in this position. Putting a woman through that because a cop had a \"hunch\"? Right. \n\nThose cops got off on it. Just disgusting behavior that should have consequences. This is not the kind of people you want in the police force.",
                "That sounds worse than the airport controls. Is this procedure really common in Australia?",
                "Human rights are under constant attack and not for granted.",
                "I wonder if those cops would do that to their own family, how they'd react if they heard that happened to their kids. Seems like a lack of humanity being experienced here by these individuals. When you're the one committing heinous acts, are you the protector anymore or are you the problem that needs to be solved?",
                "What in the world did I just read this is so creepy",
                "They can be big proud they may have pretend a few people from getting high that day though.",
                "Sounds like assault to me. Appalling. I wonder what kind of conviction rate they have to justify this heavy-handed behaviour cos it sure sounds like a hammer to crack a nut. Hope the woman gets justice."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Trump announces 100% tariff for movies produced outside US",
            "external_url": "https://www.reuters.com/business/media-telecom/trump-announces-100-tariff-movies-produced-outside-us-2025-05-04/",
            "upvotes": 2716,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So movies, Alcatraz, and tourism.... Sounds like he's going after California",
                "Apparently Jon Voight asked Trump about tax breaks for domestically made films and this is where this came from.",
                "So it’s tariffs on US products. Great job guys!",
                "“film overseas in countries such as Canada”\n\nLaughing my fucking ass off over here! The reporters are idiots, as are the editors who didn’t catch this.",
                "How the fuck do you tariff something that can be transferred completely digitally? Fuck he is stupid.",
                "Soon 100% tariff on video games",
                "How does that even work? How much outside US production counts? How do you impose a tariff on a movie? On the media? If the DVDs are made outside the US then doesn’t a tariff already apply. If domestic, then how? Do they impose a tariff on the prints or drives theatres use? What if those are domestically produced? How do you apply a tariff to streaming content?\n\nThis is just bullshit.",
                "hrm, what about all of it filmed in toronto?",
                "It's so he can scare movie companies into making pro right wing content. You can bet Trump is Great (filmed in China) would get a pass, whereas Climate Change is Going to Kill Us All You Maniacs (made in California) would get the tarrifs.",
                "How would that even work for Marvel movies?  They're made in several different countries each."
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "NEW",
            "title": "Cuts have eliminated more than a dozen US government health-tracking programs",
            "external_url": "https://apnews.com/article/cdc-disease-tracking-health-surveillance-554eb9aa20b758714eba8b835dcde856",
            "upvotes": 2181,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*Among those terminated at the Centers for Disease Control and Prevention were experts tracking abortions, pregnancies, job-related injuries, lead poisonings, sexual violence and youth smoking, the AP found.*\n\nTargeting women, youth, and workers. Let's hope the newly created Health dept is going to continue these critical records, but I'm not all that hopeful.",
                "RFK, Jr. probably: Why would we need to track public health when we all could just use more homeopathy? /s",
                "Any chance that includes the new Autism Database that 100% won't be used to hunt down and round up anyone, we promise?",
                "When you elect stupid people you get stupid results.",
                "There's no cases if there's no tracking.",
                "If you stop measuring it, it doesn’t exist",
                "If you don't count them, they're not really sick!\n\nIt was Trump's motto for Covid.  Why not everything else?",
                "this is not keeping America safe.",
                "Die for a $100million Trump Nazi birthday parade. Priorities of the regime are crystal clear"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Tennessee police release video of Kilmar Abrego Garcia traffic stop in 2022",
            "external_url": "https://apnews.com/video/tennessee-police-release-video-of-kilmar-abrego-garcia-traffic-stop-in-2022-b7baa3082e9c4599a3fd1a146c9a9ba5",
            "upvotes": 0,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Now they’re dropping an old traffic stop video like it justifies ignoring **due process**?\n\nDon’t fall for the spin. This isn’t law enforcement, it’s lawless.",
                "So the police believed someone was being trafficked and didnt do their job?\n\nIf they had maybe due process would have had a chance then.... instead, it was ignored and he was illegally deported.....\n\nThis feels like it's supposed to be a \"gotcha\" post but it just makes the cops look bad....",
                "So to be clear. \n\nHe wasn’t drunk.  He wasn’t driving erratically. He was speeding a little bit.  \n\nOnly issue was,  his license was expired, but mostly because of a clerical error, and not because he had committed a crime or anything.  \n\nWhat was the point?",
                "What is this supposed to prove? People get pulled over and let go without charges all the time.",
                "Police make up the stupidest shit all the time based on nothing. \"See that half broken window over there? Methheads break the glass off and use it to \\[insert some stupid thing here\\].\" Or, \"see that brown guy we just pulled over? He has a bunch of people in his car. I know he says they're commuting a long distance to Missouri to work, but it's obviously human trafficking. Anyway, let's get home.\"\n\nCops are the least trustful source there is, and AP's presentation of this story is sloppy.",
                "Believe it or not, too little people in the car, DEPORTED.  \n\nToo many people in the car, well, also deported!",
                "not due process if it is not is a court",
                "Right-wingers will scream all day about how \"the left\" is out to \"propagandize\" Garcia's situation, then turn to the most pathetic police propaganda to smear Garcia while claiming to never engage in propaganda.",
                "They could release a video of him saying he is MS13 and likes to target children and grandparents and I'd still not support denying them with whatever rights and freedoms our legislative branch have put in place.",
                "There were eight people in the SUV.\n\nHe was never charged with human trafficking."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Israel calls up thousands of reservists, plans to expand Gaza offensive amid stalled hostage talks",
            "external_url": "https://www.cnn.com/2025/05/03/middleeast/israel-mobilizes-reservists-gaza-intl-latam",
            "upvotes": 120,
            "date": "05/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-05-03t182045z-231072415-rc2haeajhfyf-rtrmadp-3-israel-palestinians-gaza.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Do people still believe anything that war criminals says?",
                "Expand what exactly? The Gaza Strip is a little more than 25 miles long. 90% of all its infrastructure is uninhabitable at this point. What do you even expand on. Recovering the mummified bodies of hostages probably won’t stop the double tapped assault on humanity. Everything is gone, the population is terrified and starving. \n\nAs George Bush said “mission accomplished.”\n\nGg Israel. Go to another map. New Syria DLC just dropped. Go show smoke to them, you shining beacon of democracy.",
                "NuttyYahoo and the IDF need to continue their war against dirt & rubble.",
                "It’s necessary to stop that."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "NEW",
            "title": "Two people and dog dead after small plane crashes into Los Angeles-area neighborhood",
            "external_url": "https://www.theguardian.com/us-news/2025/may/04/small-plane-crash-los-angeles-area-neighborhood",
            "upvotes": 1411,
            "date": "05/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4bc0b9b201e6a512fac9fba8e071e3997c47424c/0_0_3293_1976/master/3293.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=25e5a2e7975d021b7e0b02231f1d0af6",
            "top_comments": [
                "All were aboard the aircraft. RIP.",
                "*As of Sunday, authorities had not released any information about the occupants of the single-engine Van’s RV-10, which is a popular homebuilt plane sold in kit form*\n\nHome-Built with mixed results since there's less over-sight of the work done, which may be superior or inferior.",
                "Absolutely heartbreaking. Just imagine relaxing at home and a plane crashes between two houses, flames, smoke, chaos. It’s a miracle no one on the ground was hurt, but still, two lives and a dog gone in seconds. 💔",
                "Ever since DCA and the helicopter it feels like every crash has been making the news",
                "This also isn’t the first time something like this has happened in the area. Harrison Ford crash landed a vintage ww2 plane on a golf course not far from there a few years ago.",
                "Weird to call Simi Valley, Los Angeles, when it's not even in the same county and 40 some miles away.",
                "I just need to know Harrison Ford is okay",
                "Quote: Van’s RV-10, which is a popular homebuilt plane sold in kit form\n\n\nWait, what? People can put their own plane together like ikea furniture? Tell me, there's some kind of official inspection before the first flight",
                "The weather sucks for flying today.",
                "This crash happened very close to the house I grew up in.  So close in fact I had to double check to make sure it wasn't that house!"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Woman missing since 1962 found 'alive and well'",
            "external_url": "https://www.bbc.com/news/articles/cvgpjgwxlxwo",
            "upvotes": 9146,
            "date": "05/04/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/66f6/live/2ae0ff60-2901-11f0-8c66-ebf25fc2cfef.jpg",
            "top_comments": [
                "*The group said that days before she went missing, Ms Backeberg, now 82, had filed a criminal complaint against her husband, whom she had married at the age of 15, alleging he had beaten her and threatened to kill her.  On the day she disappeared, she left home to pick up her pay cheque from the woollen mill where she worked.*\n\nI'm wondering what happened to her two children from that very early marriage. Anyway, the story makes lots of sense... she just hitch-hikes out of town with her baby-sitter... they split up and go their own ways...Backeberg out of state and lost almost forever.",
                "My grandmother effectively did this to her first two kids. her first husband was wealthy and influential. He was also abusive and controlling of her. He told her if she divorced him she would never see her children again. She left anyway and she wouldn't see her kids again until she was eighty years old after he died and her kids found out she was still alive (the husband told them she died). \n\nThe way she put it, the kids would have had a dead mother whether she stayed or not, so she chose to leave and live with the hope she would see them again one day instead of staying and either being killed by him or killing herself.\n\nEdit: I'm seeing a lot of comments under this arguing over different scenarios so I'll add more context to the story to help clear things up. \n\nMy grandmother married this man when she was sixteen and he was nearly thirty. She had her first son when she was seventeen and the second at eighteen. The oldest was three when she left.\n\nHer husband was a literal piller of the community type. Very wealthy, from a well-to-do family, very involved in local and state politics due to his business connections. Donated to the local police department to keep them on side, had a team of lawyers at his disposal, the works. \n\nMeanwhile my grandmother was from a poor family of nine growing up in a rural community. They had nothing and her marriage to this man (who she met after she participated in a beauty pageant, of which he was one of the producers,  and who asked to marry her mere months after said meeting) was seen as her and her family's way out of poverty. \n\nFrom how she described it to me, she knew she could not leave and keep her kids. Everyone she knew was local and she couldn't risk hiding out with them, it was the 50's and she had no job experience, she knew if she tried to kidnap her children she would be tracked down, labeled insane and put away somewhere where she would never see her kids again. She knew she would lose a legal battle for custody given her husband's connections, and she also knew the cops wouldn't help because one night she did call them and when she told them what was happening and her address, they hung up on her. He apparently beat her the next night because his buddies at the station told him she called. \n\nAccording to her, he never touched the kids, and she didn't think he ever would. What gave her that confidence, I don't know. \n\nHe granted her the divorce on the grounds she gave up custody, never contacted them again, never went public about what he did to her, and collaborated his story that he chose to divorce her due to her having a drinking problem and him not feeling safe with her around the kids. \n\nTo quote my grandmother as best as I can remember \n\n\"I thought about killing him and running away with them, stealing all the money I could from the house and starting over somewhere, but I knew I wouldn't get away with it, and my boys would end up living with his parents while I was thrown in jail. I had this mentality,  despite everything, that the boys deserved to have at least one of us around, so I agreed and left. My family knew the truth, but we never let it get out out of fear of him coming after us. I've had to make a lot of hard decisions in my life, but leaving my boys with him was the hardest thing I've ever done. I wish I could say I did it completely out of selflessness, that it was all for them, but there was always a part of me. A small, small part, that was just relieved I was free of him forever\". \n\nShe was so scared of him that when her sons contacted her  over sixty years later the first thing she asked was if their father was still alive. He had died a month prior to pancreatic cancer, they had spent the better part of a year looking for her after their step mother told them the truth. After learning everything from their father, who apparently became very truthful in his last days. they had no anger towards my grandmother for what she did. \n\nFor their father's part, he never abused them though he was very much a tough love parent with them while they were growing up which had already left them with a strained relationship prior to all this coming to light. They grew up very well off, both going to Ivy League schools. I know the one went into biomedical engineering I can't remember what the other did. \n\nThey would only meet my grandmother a few times before she herself passed away a year later due to a head injury from a fall. I only met them once and it was at the funeral. I haven't spoken to them since and neither has anybody else in the family as far as I know. Not due to hostility but simply due to us all having our own families and lives. \n\nI hope that helps clear any questions up.",
                "My father abandoned his wife of 6 years and 3 small children in 1964.  Literally went out for cigarettes and never came home.  The act completely wrecked the family: the kids were adopted out to other family members and the mom was never the same again.   \n\n2 years later in 1966 he met my mother, settled down under an assumed name, and had my sister in 1968 and me in 1973.  He took my birth certificate and created a new identity for himself (I never got a SS card until I was 12, and officially I am \"Junior\" even though my birth certificate says otherwise).  We found this out after his death in 2019, [when I found an envelope](https://imgur.com/t7LcmY3) addressed to me only, with 3 fake birth certificates, 3 sets of legit Social Security cards, 3 identities and a bunch of still-cryptic papers no one quite knows what to make of.  \n\nNo one knew.  We got in contact with our half siblings.  They are lovely people who have come to peace with the whole situation and are pretty well adjusted.  My sister and I are not and feel constant guilt over it.",
                "So the 14 year-old babysitter went back to their hometown and kept that secret all these years? Impressive",
                "Happened to my grandfather. His dad died of TB right around the same time he was born. Mom had him stay with friends of the family while she got got settled.  When she came back she was told her kid was dead. She didn't meet mt grandfather again until he was in his 60s",
                "It reminds the character played by Julianne Moore in the movie The Hours.",
                "Damn, there is so much more to this story that the article failed to answer. I feel left unsatisfied.",
                "Some people will condemn her for not taking her kids, but this was a very different time for women's rights. \n\nShe was only 19 and married to an older man. There's no telling if she even wanted to be married much less a mother. Dude was physically abusive so it wouldn't be a stretch to think he was sexually abusive too and birth control wasn't really a thing back then. Divorce without cause was illegal at this time so she would have to legally prove he was abusive. Considering she wasn't having any luck getting help when she reported the abuse, it didn't seem likely. \n\nBack then women couldn't legally have their own bank account or credit card. Jobs for women didn't pay enough to really support a family. And until the 80s it was legal to refuse to rent to women with children. \n\nShe probably felt it was hopeless to even attempt to take her kids because she wouldn't be able to provide for them and he would be able to use them to keep control of her. She was young, abused, and desperate in a world where women were very restricted in what they could do. It's important to remember that.",
                "TLDR: She was in the last place they eventually looked.",
                "I wonder if her kids will contact her?"
            ],
            "aggregate_sentiment": 43.0
        },
        {
            "category": "NEW",
            "title": "Israel calls up thousands of reservists, plans to expand Gaza offensive amid stalled hostage talks",
            "external_url": "https://edition.cnn.com/2025/05/03/middleeast/israel-mobilizes-reservists-gaza-intl-latam",
            "upvotes": 2041,
            "date": "05/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-05-03t182045z-231072415-rc2haeajhfyf-rtrmadp-3-israel-palestinians-gaza.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The hostage talks seem irrelevant to the rest of the headline, imho",
                "Is there anything left in Gaza? When is enough enough?",
                "An offensive against a sea of rubble.",
                "Calling this a war is like calling a man assaulting a child a fight.",
                "When Israel rounds up civilians in Palestine and detains them indefinitely without trial: prisoners. When Hamas does it: hostages.\n\nThis shit is why literally nobody trusts the big news media anymore.",
                "They do not care about the hostages one bit. We all know what the goal is here.",
                "Can't wait to do 20 years in prison for hurting the feelings of a bloodthirsty colonial state.",
                "If Israel cared about the hostages they wouldn’t flatten the buildings they are being held in.",
                "History books won’t be kind to Israel and the west that support/ignored the war in Gaza.",
                "“Gaza offensive” is an offensive way to avoid calling what’s happening in Gaza a Genocide."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "‘A slippery slope to eugenics’: advocates reject RFK Jr’s national autism database",
            "external_url": "https://www.theguardian.com/us-news/2025/may/05/autism-national-database-rfk-jr?CMP=Share_AndroidApp_Other",
            "upvotes": 904,
            "date": "05/05/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3961e2be8801d866644ec0bfc8935ccd478f70fa/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=92cf232e07a7815bf436c990b549985e",
            "top_comments": [
                "It's not a slippery slope if the intended destination is eugenics.",
                "You can tell this man isn't a scientist:\n\n“By September, we will have some of the first answers. Within six months of that, we will have definitive answers,” Kennedy said.\n\nYou can't just decide you will know the answer and declare a timeline for that.",
                "Just wait till he starts talking about phrenology and the four humors.",
                "Bottom of the slope. RFK Jr’s beliefs are eugenicist, and the database will be a eugenicist project whether or not it is eventually used in a genocide.",
                "How a heroin addict who admits he had a brain eating worm is in charge of the nations health is beyond me.\n\nThe heroin addiction is the thing that I’m amazed isn’t brought up more. Not saying you can’t recover and have a long and successful life after, just that it should disqualify you from being the head of health and human services.",
                "Can we call it a greased ramp?",
                "It's a vertical cliff, not a slippery slope.",
                "\"An expressway with only one exit\"",
                "Lebensborn, here we come.",
                "More Nazi shit. Go figure"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Young woman's strip search at festival akin to 'sexual assault', court told",
            "external_url": "https://www.abc.net.au/news/2025-05-05/young-woman-strip-search-sexual-assault-court-nsw-police/105253220",
            "upvotes": 1280,
            "date": "05/05/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/ef1b6cfe6b1f485eed0fc526fe9abc97?impolicy=wcms_watermark_news&cropH=1447&cropW=2573&xPos=0&yPos=134&width=862&height=485&imformat=generic",
            "top_comments": [
                "Police in Sydney routinely conduct invasive strip searches at music festivals. We’re talking completely naked searches where guys are told to lift their balls, girls are told to lift their boobs, attendees are told to squat and cough, bend over etc. Most of these strip searches don’t find any drugs, and you’ve got reports of innocent people being left completely distraught after this has happened to them. NSW Police are currently facing a class action over this. So far around 3000 people have signed up. A trial for that class action began today, hence the article.\n\nFor background: In 2001, New South Wales (state in Australia, Sydney is the capital) introduced a law giving police the power to deploy drug detection dogs at certain public locations, namely at major events such as music festivals, train stations and at venues that serve alcohol, such as pubs and clubs. These dogs are notoriously unreliable, and there are reports on social media of handlers forcing their dogs to sit in front people in order to have them searched.\n\nMusic festivals are the worst. The police have drug detection dogs at every music festival in Sydney. At these events, they’ll have a fenced off compound setup with makeshift structures such as tents or ticket booths where people stopped by the dogs are taken to be searched. Some people are lucky enough to get away with a pat down, but in many cases, festival attendees have been ordered to strip completely naked and bend over, squat etc. to have their bodies examined for drugs. At any given event, they’ll strip search dozens of people like this. Total gestapo stuff and it’s still happening today.",
                "I really try not to think the worst of people but \"drug dog sniffed in her direction\" sounds like a cover up of  \"wanted to see the attractive festival goer naked and needed some kinda probable cause\" yuck.",
                "People that put these policies in place should have to go through this stuff themselves in a public space and then decide if the \"problem\" they think they're solving is worth the solution they've decided upon.",
                "\"Parliament had made it clear strip searches were only supposed to be used \"in the most extreme of circumstances\", but that was not the way they were being executed by NSW Police.\"\n\nI know why, it's because you have perverts in positions of power and are abusing it for their own pleasure. \n\nShe was asked to strip, expose all parts of her body, drop her breasts, bend over and expose her anus and vagina, also ordering her to bend over while naked and remove a tampon. AND, a male police officer walked into the cubicle unannounced and observed the plaintiff in this position. Putting a woman through that because a cop had a \"hunch\"? Right. \n\nThose cops got off on it. Just disgusting behavior that should have consequences. This is not the kind of people you want in the police force.",
                "That sounds worse than the airport controls. Is this procedure really common in Australia?",
                "Human rights are under constant attack and not for granted.",
                "I wonder if those cops would do that to their own family, how they'd react if they heard that happened to their kids. Seems like a lack of humanity being experienced here by these individuals. When you're the one committing heinous acts, are you the protector anymore or are you the problem that needs to be solved?",
                "What in the world did I just read this is so creepy",
                "They can be big proud they may have pretend a few people from getting high that day though.",
                "Sounds like assault to me. Appalling. I wonder what kind of conviction rate they have to justify this heavy-handed behaviour cos it sure sounds like a hammer to crack a nut. Hope the woman gets justice."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Trump announces 100% tariff for movies produced outside US",
            "external_url": "https://www.reuters.com/business/media-telecom/trump-announces-100-tariff-movies-produced-outside-us-2025-05-04/",
            "upvotes": 2720,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So movies, Alcatraz, and tourism.... Sounds like he's going after California",
                "Apparently Jon Voight asked Trump about tax breaks for domestically made films and this is where this came from.",
                "So it’s tariffs on US products. Great job guys!",
                "“film overseas in countries such as Canada”\n\nLaughing my fucking ass off over here! The reporters are idiots, as are the editors who didn’t catch this.",
                "How the fuck do you tariff something that can be transferred completely digitally? Fuck he is stupid.",
                "Soon 100% tariff on video games",
                "How does that even work? How much outside US production counts? How do you impose a tariff on a movie? On the media? If the DVDs are made outside the US then doesn’t a tariff already apply. If domestic, then how? Do they impose a tariff on the prints or drives theatres use? What if those are domestically produced? How do you apply a tariff to streaming content?\n\nThis is just bullshit.",
                "hrm, what about all of it filmed in toronto?",
                "It's so he can scare movie companies into making pro right wing content. You can bet Trump is Great (filmed in China) would get a pass, whereas Climate Change is Going to Kill Us All You Maniacs (made in California) would get the tarrifs.",
                "How would that even work for Marvel movies?  They're made in several different countries each."
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "RISING",
            "title": "Woman missing since 1962 found 'alive and well'",
            "external_url": "https://www.bbc.com/news/articles/cvgpjgwxlxwo",
            "upvotes": 9147,
            "date": "05/04/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/66f6/live/2ae0ff60-2901-11f0-8c66-ebf25fc2cfef.jpg",
            "top_comments": [
                "*The group said that days before she went missing, Ms Backeberg, now 82, had filed a criminal complaint against her husband, whom she had married at the age of 15, alleging he had beaten her and threatened to kill her.  On the day she disappeared, she left home to pick up her pay cheque from the woollen mill where she worked.*\n\nI'm wondering what happened to her two children from that very early marriage. Anyway, the story makes lots of sense... she just hitch-hikes out of town with her baby-sitter... they split up and go their own ways...Backeberg out of state and lost almost forever.",
                "My grandmother effectively did this to her first two kids. her first husband was wealthy and influential. He was also abusive and controlling of her. He told her if she divorced him she would never see her children again. She left anyway and she wouldn't see her kids again until she was eighty years old after he died and her kids found out she was still alive (the husband told them she died). \n\nThe way she put it, the kids would have had a dead mother whether she stayed or not, so she chose to leave and live with the hope she would see them again one day instead of staying and either being killed by him or killing herself.\n\nEdit: I'm seeing a lot of comments under this arguing over different scenarios so I'll add more context to the story to help clear things up. \n\nMy grandmother married this man when she was sixteen and he was nearly thirty. She had her first son when she was seventeen and the second at eighteen. The oldest was three when she left.\n\nHer husband was a literal piller of the community type. Very wealthy, from a well-to-do family, very involved in local and state politics due to his business connections. Donated to the local police department to keep them on side, had a team of lawyers at his disposal, the works. \n\nMeanwhile my grandmother was from a poor family of nine growing up in a rural community. They had nothing and her marriage to this man (who she met after she participated in a beauty pageant, of which he was one of the producers,  and who asked to marry her mere months after said meeting) was seen as her and her family's way out of poverty. \n\nFrom how she described it to me, she knew she could not leave and keep her kids. Everyone she knew was local and she couldn't risk hiding out with them, it was the 50's and she had no job experience, she knew if she tried to kidnap her children she would be tracked down, labeled insane and put away somewhere where she would never see her kids again. She knew she would lose a legal battle for custody given her husband's connections, and she also knew the cops wouldn't help because one night she did call them and when she told them what was happening and her address, they hung up on her. He apparently beat her the next night because his buddies at the station told him she called. \n\nAccording to her, he never touched the kids, and she didn't think he ever would. What gave her that confidence, I don't know. \n\nHe granted her the divorce on the grounds she gave up custody, never contacted them again, never went public about what he did to her, and collaborated his story that he chose to divorce her due to her having a drinking problem and him not feeling safe with her around the kids. \n\nTo quote my grandmother as best as I can remember \n\n\"I thought about killing him and running away with them, stealing all the money I could from the house and starting over somewhere, but I knew I wouldn't get away with it, and my boys would end up living with his parents while I was thrown in jail. I had this mentality,  despite everything, that the boys deserved to have at least one of us around, so I agreed and left. My family knew the truth, but we never let it get out out of fear of him coming after us. I've had to make a lot of hard decisions in my life, but leaving my boys with him was the hardest thing I've ever done. I wish I could say I did it completely out of selflessness, that it was all for them, but there was always a part of me. A small, small part, that was just relieved I was free of him forever\". \n\nShe was so scared of him that when her sons contacted her  over sixty years later the first thing she asked was if their father was still alive. He had died a month prior to pancreatic cancer, they had spent the better part of a year looking for her after their step mother told them the truth. After learning everything from their father, who apparently became very truthful in his last days. they had no anger towards my grandmother for what she did. \n\nFor their father's part, he never abused them though he was very much a tough love parent with them while they were growing up which had already left them with a strained relationship prior to all this coming to light. They grew up very well off, both going to Ivy League schools. I know the one went into biomedical engineering I can't remember what the other did. \n\nThey would only meet my grandmother a few times before she herself passed away a year later due to a head injury from a fall. I only met them once and it was at the funeral. I haven't spoken to them since and neither has anybody else in the family as far as I know. Not due to hostility but simply due to us all having our own families and lives. \n\nI hope that helps clear any questions up.",
                "My father abandoned his wife of 6 years and 3 small children in 1964.  Literally went out for cigarettes and never came home.  The act completely wrecked the family: the kids were adopted out to other family members and the mom was never the same again.   \n\n2 years later in 1966 he met my mother, settled down under an assumed name, and had my sister in 1968 and me in 1973.  He took my birth certificate and created a new identity for himself (I never got a SS card until I was 12, and officially I am \"Junior\" even though my birth certificate says otherwise).  We found this out after his death in 2019, [when I found an envelope](https://imgur.com/t7LcmY3) addressed to me only, with 3 fake birth certificates, 3 sets of legit Social Security cards, 3 identities and a bunch of still-cryptic papers no one quite knows what to make of.  \n\nNo one knew.  We got in contact with our half siblings.  They are lovely people who have come to peace with the whole situation and are pretty well adjusted.  My sister and I are not and feel constant guilt over it.",
                "So the 14 year-old babysitter went back to their hometown and kept that secret all these years? Impressive",
                "Happened to my grandfather. His dad died of TB right around the same time he was born. Mom had him stay with friends of the family while she got got settled.  When she came back she was told her kid was dead. She didn't meet mt grandfather again until he was in his 60s",
                "It reminds the character played by Julianne Moore in the movie The Hours.",
                "Damn, there is so much more to this story that the article failed to answer. I feel left unsatisfied.",
                "Some people will condemn her for not taking her kids, but this was a very different time for women's rights. \n\nShe was only 19 and married to an older man. There's no telling if she even wanted to be married much less a mother. Dude was physically abusive so it wouldn't be a stretch to think he was sexually abusive too and birth control wasn't really a thing back then. Divorce without cause was illegal at this time so she would have to legally prove he was abusive. Considering she wasn't having any luck getting help when she reported the abuse, it didn't seem likely. \n\nBack then women couldn't legally have their own bank account or credit card. Jobs for women didn't pay enough to really support a family. And until the 80s it was legal to refuse to rent to women with children. \n\nShe probably felt it was hopeless to even attempt to take her kids because she wouldn't be able to provide for them and he would be able to use them to keep control of her. She was young, abused, and desperate in a world where women were very restricted in what they could do. It's important to remember that.",
                "TLDR: She was in the last place they eventually looked.",
                "I wonder if her kids will contact her?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Steelmaker Cleveland Cliffs to idle 3 steel plants in Pennsylvania and Illinois",
            "external_url": "https://abcnews.go.com/US/wireStory/steelmaker-cleveland-cliffs-idle-3-steel-plants-pennsylvania-121415395",
            "upvotes": 18821,
            "date": "05/04/2025",
            "thumbnail": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg",
            "top_comments": [
                "“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production at Dearborn,”\n\nOh okay. I’m sure the two thousand workers being laid off will just call up their mortgage companies and let them know once trumps policies really take effect they will resume payment on the mortgage. Surely their lender will understand and let them live for free until whenever the fuck this fantasy might play out.",
                "Anyone want to guess where a Cleveland Cliffs plant is that could really fuck over a lot of Trump voters? Middletown, Ohio, childhood home of JD Vance. The same plant that his beloved grandpa worked and earned a pension from that paid to raise him.\n\n\nIf that plant shuts down even for a bit I can't wait for the bitching and moaning from the people that voted for those two assholes to begin and the Olympic level gymnastics as they try to assign blame to anyone but them.",
                "I’ve written hundreds of company press releases and can attest that we go to great measures to wordsmith these things, and spend days crafting them while hanging on the impact of individual words and how they’ll be received by investors, analysts and the Street at large. We prep responses to potential inbound questions and go overboard in every sense of the word. \n\nThe phrase *insufficient demand and pricing* is the key here. The Investor Relations and Comms team burned days coming up with something sufficient to relay to the Street and…shat the bed. Absolutely anyone paying attention that matters knows what these words mean. The follow up question to *our company is experiencing simultaneous *declining demand and increasing costs* is “what are the primary catalysts causing your declining demand and increased costs?” If management says something akin to *definitely not the tariffs* they’ll get laughed out of their jobs. \n\nLet’s see how the stock reacts tomorrow morning. The company’s earnings call is on May 8th, where they are surely going to get questioned and pressed on the economic backdrop impacting the company.\n\nAlso, in a separate release the company said in March that it will idle a steel plant in Dearborn, Mich., affecting about 600 workers, citing “weak automotive production in the United States.\"\n\n“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production at Dearborn,” it said.\n\nThose 600 workers will likely get their jobs back in about 5-7 years, or perhaps longer.\n\n*edit\n\nI found some numbers. This isn’t scientific or even rigorous, but apparently ford reshored the production of the F-650 some years ago. It took about a year to get the plant going and the company sold 17,000 units that production year. That represents less than 1% of 2024 total unit sales. Good luck everyone.",
                "Even if it's not the tariffs. Wasn't the point of electing this moron to IMPROVE the economy?\n\nOk, cool. It wasnt the tariffs. You're still not delivering on your promises",
                "Is this winning and bringing manufacturing back to America…..?",
                "Trump won Pennsylvania, congratulations! 🎉",
                "“Nothing to do with the tariffs” Except for it has everything to do with tariffs",
                ">The company said the idling of two Pennsylvania plants, one in Steelton and one in Conshohocken, and one in Riverdale, Illinois, is due to “insufficient demand and pricing” and nothing to do with President Donald Trump's tariffs.\n\n\"Idle\" means close.\n\nThey're *closing* these plants indefinitely. \n\nYes, it's the fucking tariffs",
                "“Insufficient demand because… insufficient demand because… Bueller… Bueller…”",
                ">“We believe that, once President Trump’s policies take full effect and automotive production is re-shored, we should be able to resume steel production\n\nConservatism is a faith-based superstitious political and economic ideology no different than a religion or cult\n\n\nRepublicans- doing the same thing over and over again expecting different results"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Cuts have eliminated more than a dozen US government health-tracking programs",
            "external_url": "https://apnews.com/article/cdc-disease-tracking-health-surveillance-554eb9aa20b758714eba8b835dcde856",
            "upvotes": 2185,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*Among those terminated at the Centers for Disease Control and Prevention were experts tracking abortions, pregnancies, job-related injuries, lead poisonings, sexual violence and youth smoking, the AP found.*\n\nTargeting women, youth, and workers. Let's hope the newly created Health dept is going to continue these critical records, but I'm not all that hopeful.",
                "RFK, Jr. probably: Why would we need to track public health when we all could just use more homeopathy? /s",
                "Any chance that includes the new Autism Database that 100% won't be used to hunt down and round up anyone, we promise?",
                "When you elect stupid people you get stupid results.",
                "There's no cases if there's no tracking.",
                "If you stop measuring it, it doesn’t exist",
                "If you don't count them, they're not really sick!\n\nIt was Trump's motto for Covid.  Why not everything else?",
                "this is not keeping America safe.",
                "Die for a $100million Trump Nazi birthday parade. Priorities of the regime are crystal clear"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Police foil bomb plot targeting Lady Gaga's biggest-ever show on Copacabana beach",
            "external_url": "https://news.sky.com/story/lady-gaga-puts-on-her-biggest-ever-show-for-free-on-rios-copacabana-beach-13361275",
            "upvotes": 5850,
            "date": "05/04/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-lady-gaga-copacabana-beach_6905650.jpg?20250504034928",
            "top_comments": [
                "2.1 million people, and this could’ve ended in tragedy. The fact that teens were being radicalized under the disguise of fandom is terrifying. Huge credit to Brazilian police for catching it in time, this could’ve been one of the darkest moments in live music history.",
                "So if I’m understanding the story correct, they’re saying this was a small group of super fans wanting to attack “fake” fans?\n\nTry getting your own life first instead of taking someone else’s.",
                "There was no plan to bomb the concert.   There was an attempt to radicalize youth that went nowhere.  They did a bunch of raids and found one adult In different city with a handgun and a teenager with child porn.    If they didn't do the raids, there us zero evidence there was an actual plan to set off a bomb at the concert.",
                "Why are people not calling this terrorism? They keep referring to it as a hate crime, but, it's literally terrorism.\n\n***Terrorism = The threat, or use of violence against a civilian population for a political end.***",
                "Radicalize the kids into what ideology exactly?",
                "Lady Gaga is my guilty pleasure\n\nGlad they foiled the attack!",
                "Of all possible people. I just don’t understand how people think.",
                "[Insert Barry Manilow Joke Here]",
                "And thats why you dont amass crowds like that. I get its historical and a cool thing to say but that is far too many people in one place if anything happens the worst part wouldnt even be the bomb itself itd be the panic and the hundreds if not thousands of lives that would have been lost simply from being crushed to death from the crowd. \n\nI would never put myself in that situation id be terrified.",
                "[deleted]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Thousands of Islamists rally in Bangladesh against proposed changes to women's rights...",
            "external_url": "https://apnews.com/article/bangladesh-women-rights-islamists-rally-114e1acbe56e7be75bc9b5273365a17a",
            "upvotes": 6431,
            "date": "05/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Humanity's inability to fight religious extremism will be its undoing.",
                "A few examples of the things they are protesting: \n\nAcknowledgement and criminalization of marital rape. According to Islam, there is no such thing; one of the top Islamist leaders defined rape as consensual sex between unmarried men and women. \n\nLegalization of sex work. Yeah. \n\nEquity in inheritance laws. According to Islam, a daughter is entitled to exactly half the inheritance a son is entitled to. Equality is unacceptable to Islamists. \n\n\n\nWords can't express the fury and despair this evokes in sane Bangladeshis. Unlike us though, they are organized and motivated, and they currently have the upper hand. \n\nThese are very dark times, and it's only going to get worse, I'm afraid.",
                "fuck every single one of them",
                "Bunch of weak ignorant Stone Age “men”.  They should be ashamed of themselves.",
                "What kind of disgusting person you need to be to deny women’s rights ? And who’s defending this nonsense?",
                "Thousands of humans, less than 100 combined total IQ",
                "Ill mannered man-children who should be spanked and sent home to their mothers. Pathetic, cowardly and weak.",
                ">Mamunul Haque, a leader of the group, demanded that the interim government’s reforms commission be abolished and its members punished for the proposed changes. He said they hurt “the sentiments of the majority of the people of this country”\n\nThe men. It upset the men.",
                "Fuck Islam and any other religion that uses God as an excuse for violence and oppression",
                "Imagine where humanity would be right now if we didn't have religion slowing us down every step of the way"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Two people and dog dead after small plane crashes into Los Angeles-area neighborhood",
            "external_url": "https://www.theguardian.com/us-news/2025/may/04/small-plane-crash-los-angeles-area-neighborhood",
            "upvotes": 1411,
            "date": "05/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4bc0b9b201e6a512fac9fba8e071e3997c47424c/0_0_3293_1976/master/3293.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=25e5a2e7975d021b7e0b02231f1d0af6",
            "top_comments": [
                "All were aboard the aircraft. RIP.",
                "*As of Sunday, authorities had not released any information about the occupants of the single-engine Van’s RV-10, which is a popular homebuilt plane sold in kit form*\n\nHome-Built with mixed results since there's less over-sight of the work done, which may be superior or inferior.",
                "Absolutely heartbreaking. Just imagine relaxing at home and a plane crashes between two houses, flames, smoke, chaos. It’s a miracle no one on the ground was hurt, but still, two lives and a dog gone in seconds. 💔",
                "Ever since DCA and the helicopter it feels like every crash has been making the news",
                "This also isn’t the first time something like this has happened in the area. Harrison Ford crash landed a vintage ww2 plane on a golf course not far from there a few years ago.",
                "Weird to call Simi Valley, Los Angeles, when it's not even in the same county and 40 some miles away.",
                "I just need to know Harrison Ford is okay",
                "Quote: Van’s RV-10, which is a popular homebuilt plane sold in kit form\n\n\nWait, what? People can put their own plane together like ikea furniture? Tell me, there's some kind of official inspection before the first flight",
                "The weather sucks for flying today.",
                "This crash happened very close to the house I grew up in.  So close in fact I had to double check to make sure it wasn't that house!"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Israel calls up thousands of reservists, plans to expand Gaza offensive amid stalled hostage talks",
            "external_url": "https://edition.cnn.com/2025/05/03/middleeast/israel-mobilizes-reservists-gaza-intl-latam",
            "upvotes": 2041,
            "date": "05/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-05-03t182045z-231072415-rc2haeajhfyf-rtrmadp-3-israel-palestinians-gaza.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The hostage talks seem irrelevant to the rest of the headline, imho",
                "Is there anything left in Gaza? When is enough enough?",
                "An offensive against a sea of rubble.",
                "Calling this a war is like calling a man assaulting a child a fight.",
                "When Israel rounds up civilians in Palestine and detains them indefinitely without trial: prisoners. When Hamas does it: hostages.\n\nThis shit is why literally nobody trusts the big news media anymore.",
                "They do not care about the hostages one bit. We all know what the goal is here.",
                "Can't wait to do 20 years in prison for hurting the feelings of a bloodthirsty colonial state.",
                "If Israel cared about the hostages they wouldn’t flatten the buildings they are being held in.",
                "History books won’t be kind to Israel and the west that support/ignored the war in Gaza.",
                "“Gaza offensive” is an offensive way to avoid calling what’s happening in Gaza a Genocide."
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "05/05/2025 12:16:16 UTC"
}