{
    "posts": [
        {
            "category": "HOT",
            "title": "Trump orders the reopening of Alcatraz prison",
            "external_url": "https://www.reuters.com/world/us/trump-directs-bureau-prisons-reopen-alcatraz-2025-05-04/",
            "upvotes": 9883,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I bet he just watched The Rock last weekend.",
                "Step 1: insist on reopening a long abandoned prison with enormous costs associated in order to divert attention.\n\nStep 2: announce reopening will cost $45B.\n\nStep 3: announce that we will not reopen the prison citing budgetary reasons.\n\nStep 4: claim to have saved the federal government $45B & gives friends the \"savings\". MAGA spikes the football.\n\nThis is Trump math, y'all.",
                "Such a worthless idea, there is no reason to have a prison there and terrible from a cost efficiency standpoint, people escaping from maximum security prisons isn’t the concern it used to be",
                "We literally have incredible supermax prisons on the mainland. The rock was built during a time when modern supermax didn't really exist and the natural island/water barrier was useful. But now ... This is more of a visual move. Alcatraz is infamous and legendary, Trump wants to tie its reopening to him. It's symbolic and moronic.",
                "Honest question is this even legally allowed? I assume Alcatraz was set up as National Park via legislation? This would need budget correct?",
                "isn't it a museum now? whats the plan? bulldoze the tourist attraction?",
                "This is a distraction from more important things, like him saying he doesn't know if he has to uphold the constitution or if people are guaranteed due process. Let's keep the focus there.",
                "Donald Trump has, on more than on occasion, compared himself to Al Capone.\n\nAlcatraz is where Al Capone first got any sort of treatment for his festering syphilis. Though it was an outdated treatment, even for its time. His condition worsened and his mental capacity greatly diminished during his incarceration there.",
                "All I know about Alcatraz I learned from Tony Hawk’s Pro Skater 4",
                "[removed]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Young woman's strip search at festival akin to 'sexual assault', court told",
            "external_url": "https://www.abc.net.au/news/2025-05-05/young-woman-strip-search-sexual-assault-court-nsw-police/105253220",
            "upvotes": 15040,
            "date": "05/05/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/ef1b6cfe6b1f485eed0fc526fe9abc97?impolicy=wcms_watermark_news&cropH=1447&cropW=2573&xPos=0&yPos=134&width=862&height=485&imformat=generic",
            "top_comments": [
                "\"Parliament had made it clear strip searches were only supposed to be used \"in the most extreme of circumstances\", but that was not the way they were being executed by NSW Police.\"\n\nI know why, it's because you have perverts in positions of power and are abusing it for their own pleasure. \n\nShe was asked to strip, expose all parts of her body, drop her breasts, bend over and expose her anus and vagina, also ordering her to bend over while naked and remove a tampon. AND, a male police officer walked into the cubicle unannounced and observed the plaintiff in this position. Putting a woman through that because a cop had a \"hunch\"? Right. \n\nThose cops got off on it. Just disgusting behavior that should have consequences. This is not the kind of people you want in the police force.",
                "Police in Sydney routinely conduct invasive strip searches at music festivals. We’re talking completely naked searches where guys are told to lift their balls, girls are told to lift their boobs, attendees are told to squat and cough, bend over etc. Most of these strip searches don’t find any drugs, and you’ve got reports of innocent people being left completely distraught after this has happened to them. NSW Police are currently facing a class action over this. So far around 3000 people have signed up. A trial for that class action began today, hence the article.\n\nFor background: In 2001, New South Wales (state in Australia, Sydney is the capital) introduced a law giving police the power to deploy drug detection dogs at certain public locations, namely at major events such as music festivals, train stations and at venues that serve alcohol, such as pubs and clubs. These dogs are notoriously unreliable, and there are reports on social media of handlers forcing their dogs to sit in front people in order to have them searched.\n\nMusic festivals are the worst. The police have drug detection dogs at every music festival in Sydney. At these events, they’ll have a fenced off compound setup with makeshift structures such as tents or ticket booths where people stopped by the dogs are taken to be searched. Some people are lucky enough to get away with a pat down, but in many cases, festival attendees have been ordered to strip completely naked and bend over, squat etc. to have their bodies examined for drugs. At any given event, they’ll strip search dozens of people like this. Total gestapo stuff and it’s still happening today.",
                "Showing your butthole to security should not be a part of going to a festival. How the fuck did it get to that point where the people performing the searches think this is OK?",
                "People that put these policies in place should have to go through this stuff themselves in a public space and then decide if the \"problem\" they think they're solving is worth the solution they've decided upon.",
                "I really try not to think the worst of people but \"drug dog sniffed in her direction\" sounds like a cover up of  \"wanted to see the attractive festival goer naked and needed some kinda probable cause\" yuck.",
                "I wonder if those cops would do that to their own family, how they'd react if they heard that happened to their kids. Seems like a lack of humanity being experienced here by these individuals. When you're the one committing heinous acts, are you the protector anymore or are you the problem that needs to be solved?",
                "Over 1500 of them were children: https://rlc.org.au/news-and-media/media-releases/nsw-police-strip-searched-1546-children-seven-years",
                "Bend over naked and remove your tampon?! For a music festival? This is infuriating",
                "Not akin to sexual assault... this is sexual assault.",
                "That sounds worse than the airport controls. Is this procedure really common in Australia?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Judges must clear a high bar to separate parents from children forever, Texas Supreme Court rules",
            "external_url": "https://www.keranews.org/government/2025-05-05/judges-must-clear-a-high-bar-to-separate-parents-from-children-forever-texas-supreme-court-rules",
            "upvotes": 2838,
            "date": "05/05/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/be46422/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F87%2F01%2Fcd8484fc40b180a66aef0fe0c66c%2F121824-supreme-court-of-texas-seal-kut.JPG",
            "top_comments": [
                ">Terminating parental rights requires a higher burden of proof — trial courts must find the evidence “clear and convincing.”\n\nClear and convincing is the medium level of proof. Below 'beyond a reasonable doubt'. \n\n>Court documents allege in March 2020, Stary had grabbed her then 9-year-old son by the back of his head, beat his face on the hardwood floor and carpet, then continued to beat his bruised face as his nose began to bleed. Stary was arrested and charged with injuring a child, a third-degree felony.\n\nShe was given a lifetime protective order against all her children. She now gets a new hearing with the new standard needing to be applied.",
                "You all would be shocked at how infrequently they went after parents who hurt their children. I would say it was less than 2%. \n\nI used to do this job. A solid third of my cases were bullshit weed and custody cases that no one cared about. There just weren't enough resources to care about this.\n\nAnother third was abject poverty and people living in falling apart plywood trailers with no plumbing or electricity in the middle of Texas summer. Obviously you can't have a newborn baby living in 110° shed. Usually for that we would cram them in with the very unwilling family member and call it a day. There wasn't enough money to do anything else. \n\nA third of my cases were teen parents who didn't know any better and often didn't care but sometimes were trying. It's hard to be 15 and have a baby of your own when you're living on someone's couch. We usually got another unwilling family member to help supervise in these situations and called it a day. There wasn't enough money to do anything else. \n\nIn a perfect world I would have gotten them all affordable housing and healthcare and birth control and education and government IDs and bus passes and nutrition and clothes and sooooooo muchhhhhh therapyyyyyyy. \n\nA small portion of my cases were absolute monsters who needed to be locked up and so many of them escaped any sort of actual punishment. Again because of resources. \n\nVery frequently we terminated rights for shit parents but that's usually because the parents didn't even make an effort to complete the court required programs they were ordered to do. Simple stuff like parenting classes and showing up to visits and paying $10 a month in child support. Half the time they didn't even show up. I would tell them in person and in writing and tell the attorney \"hey this person has court on this date if they want to continue being a parent they need to show up.\" Nothing.\n\nParents who actually made even a half-assed effort got their kids back unless they were complete monsters like incest/rapists.",
                "I thought this was about ICE and am now disappointed.",
                "So the standard is still below that needed for a conviction, and only even that high for permanent protective orders?\n\nThat sounds reasonable? Am I missing something?\n\n>Stary was arrested and charged with injuring a child, a third-degree felony.\n\nIf this woman beat her kid bloody, the should be convicted for that, which would require a higher burden of proof than terminating her parental rights.",
                "My cousin fostered and eventually adopted a baby who's addict parents fed him meth, more than once.  The judge kept insisting the baby needed to go to his biological family.  My cousin had to hire two lawyers to finally adopt him.\n\nFuck this state.  Fuck this state so much.",
                "Obviously doesn't apply to citizens at the border. ",
                "It's kind of wild that before this ruling, you could choose to seek a lifetime protection order (under a preponderance of evidence standard) that effectively accomplished the same thing as an order terminating parental rights (which required clear and convincing evidence).  Protective orders usually require a very different showing and don't really emphasize the best interests of the child, like termination of parental rights.  At any rate, seems like a rare positive advancement in justice from the state of Texas.",
                "Hot take, if you literally ever hit your kid hard enough to make them bleed, and to be clear you shouldn't hit your kid at all, but if you ever hit them hard enough to make them bleed then you should never be allowed to see them again, ever. Not ever.",
                "I was a public health nurse and some parents should lose custody before destroying their children.",
                "Great, now kids get to be forced to be part of their parents' addiction cycle for even longer."
            ],
            "aggregate_sentiment": 32.0
        },
        {
            "category": "HOT",
            "title": "Trump's DHS offers $1,000 stipends, travel assistance to immigrants who 'self-deport'",
            "external_url": "https://www.cnbc.com/2025/05/05/trump-dhs-travel-costs-stipend-immigrants-self-deport.html",
            "upvotes": 2400,
            "date": "05/05/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107239057-1683737514848-gettyimages-1253637829-MAYORKAS_TITLE_42.jpeg?v=1683737566&w=1920&h=1080",
            "top_comments": [
                "Sounds like the 'you've won a free boat, pick it up at the police station' ploy.",
                "They totally won't throw a hood over their heads when they show up to collect the check, promise.",
                "Yes cause we all know Trump is great at actually paying people what he promises",
                "Seems like a bait and switch",
                "ICE gonna set up a whole program to facilitate this and pocket the money as they kidnap these folks and ship them off to an El Salvador gulag.",
                "Sounds like free handout communism to me idk",
                "Someone should check this for waste, fraud, and abuse. Perhaps there is a government efficiency office that could check?",
                "Can citizens self-deport? Send me to the UK. Or Poland.",
                "Knowing how inept this administration is, I wonder if as a citizen I can take the offer, get my $1,000 and then just come back and do it again. ",
                "This is a trick. They only get the money after they can verify they have indeed self-deported to their country of origin. \n\n\"users will receive a $1,000 stipend only after their arrival in their country of origin is confirmed through the app\"."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Romania PM resigns after far-right wins first-round of president vote",
            "external_url": "https://www.reuters.com/world/europe/romania-pm-resigns-after-far-right-wins-first-round-president-vote-2025-05-05/",
            "upvotes": 1205,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I need a TL;DR on the strategy here. I can't make heads or tails of it in the Reuters article. Is the idea that if the PM resigns and his party puts their support behind the centrists it makes a far-right win less likely?",
                "Can someone give local context?",
                "Is this why Andrew Taint went back? Thought he could have an advantage there now?",
                "Let me be optimistic. There is a second, ballot round. Please friends from Romania be smart..",
                "OMG the next idiot gets elected.... Do people not learn?",
                "Neat.\n\nIf only Eastern Europeans had a recent history of failed authoritarian rule to learn from.",
                "Romania looking for their fascist Nicolae Ceaușescu. People learn to make the same mistakes in new ways.",
                "He basically washed his hands of the political disaster his party caused, made sure his rats got fed off the state good enough, and now let's other people deal with the situation.",
                "Women are gonna be screwed so hard in Romania",
                "I am not surprised. Every time I see someone being racist to me on reddit, about 60-70% they are from Romania. The Racism per capita of Romania must be studied."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "3 killed, 5 hurt in shooting at Glendale, Arizona, restaurant: Police",
            "external_url": "https://abcnews.go.com/US/9-injured-glendale-arizona-shooting-police/story?id=121460049",
            "upvotes": 1757,
            "date": "05/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6734f915-a9c3-4dd6-a9d4-778b0c61aae6/glendale-shooting-scenen-knxv-jef-250505_1746447292367_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "And this happened across the street from the Glendale Police Department.",
                "It’s pretty fucked up when I see this headline and I don’t get surprised and think “oh 3 deaths, it’s not that bad”",
                "What does this say as a country when I see headlines like this and it just feels normal. ",
                "I lived in Arizona for two years.\n\nThe lack of gun laws there was a major reason I don't live there now.\n\nYou have half the population statistically operating below average intelligence*.\n\nYou really don't want every John, Tom, and Suzzy under the sun open carrying in public. \n\nEvery time I'd see the people carrying in public I was on edge , always fearing I'd get caught in some idiots fever dream of standing their ground over a $2.00 rest-stop hotdog or them trying to be the good guy/gal with a gun, and \"stopping a crime\" with me in the cross fire. \n\nToo bad there's absolutely nothing we can do about guns in this country!\n\nEdit: intelligence* & jeeze I triggered some of you gun nuts. Sorry, but not sorry,  I lived abroad in warzones and in Europe ( Germany) thanks to the Army and got to see how the rest of the world lives. Common sense gun laws are a good thing and a sign of a civilized nation. Jesus, only if there were models that work and school and mass shootings aren't an everyday occurrence.",
                "Just want to mention they are reporting this was an argument that escalated. They don’t think it was hate crime, just idiots with guns that we’re drinking.",
                "Shit, is it Monday already?",
                "Sigh...\n\nhttps://theonion.com/no-way-to-prevent-this-says-only-nation-where-this-r-1848971668/",
                "Left leaning/ democrat/libertarian LGBTQ gun owner/2a supporter here, sounds like this shooting was likely cartel or gang related as it involved more than 1 shooter. \nIf thats is the case it's a high likelihood that the guns involved were not acquired legally by the shooters. \nI'm for more thorough background checks and other pragmatic means of making guns inaccessible to people with a history of violence/ crime, however I see many of my fellow left leaning people shouting to ban all guns, which is unrealistic and considering the current political situation, I'd suggest many of the anti gun democrats and liberals to consider getting a firearm of their own and get proper training.  Obviously gun ownership percentage in this country leans heavily to the republican population.\nThat is worrying and needs to change.",
                "If only there were some way to stop this.",
                "[removed]"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "South Dakota students weigh protest against university honors for homeland security chief Noem",
            "external_url": "https://apnews.com/article/dakota-state-university-noem-student-protest-dafc535890e1df72a0e27e6f4bbcdf35",
            "upvotes": 664,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It's a good article. Dakota State University is granting an honorary doctorate to Homeland Security Secretary Kristi Noem, and she is giving a commencement speech. Many students are opposed but are afraid to speak out (especially international students). Some students fear for their future job prospects if they openly protest.",
                "Deport Noem to El Salvador",
                "What an honor. \n\nAn honorary degree from the 12th best college in the Dakotas.",
                "Happy to see she’s getting dogged and hounded.",
                "She killed a puppy because she didn't like how it was acting. What more can anyone say?",
                "Some more local coverage:\n\n(paywalls) https://www.argusleader.com/story/news/politics/2025/04/21/noem-offered-honorary-doctorate-dakota-state-university-over-student-faculty-wishes/83171671007/ \n\nhttps://www.argusleader.com/story/news/education/2025/04/29/petition-call-for-dakota-state-to-rescind-kristi-noem-honorary-degree-nomination/83342940007/\n\nDSU is one of the leading cybersecurity schools in the nation, and curiously, the university president was with Noem at a major conference last week talking about leading national cybersecurity efforts.",
                "Students don't use your voices, use your bodies. When she says something reprehensible, pick up your chair and turn it around so your back will be toward her.",
                "Oh look, DEI is okay after all",
                "Kristi Noem is the poster child of botched cosmetic surgeries. \n\nPlease call the puppy killer what she is.",
                "And You get deported!\n\nAnd YOU get deported!\n\nYOU ALL GET DEPORTED!\n\n*Jumps up and down excitedly, waving hands*"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Ukraine to Receive 3 Million Shells in 2025 Under Czech Led Support Initiative",
            "external_url": "https://ankoletimes.co.ug/world-news/4168/ukraine-to-receive-3-million-shells-in-2025-under-czech-led-support-initiative/",
            "upvotes": 869,
            "date": "05/05/2025",
            "thumbnail": "https://i1.wp.com/images.unsplash.com/photo-1699256460480-4ae47855cb4d?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3wxMjA3fDB8MXxzZWFyY2h8OHx8YXJ0aWxsZXJ5JTIwc2hlbGxzfGVufDB8fHx8MTc0NjQzNjc1OXww&ixlib=rb-4.0.3&q=80&w=1200&w=1200&resize=1200,800&ssl=1",
            "top_comments": [
                "When I read the title I thought of the other type of shell and thought wait a minute Czachia doesn't have coast.",
                "That's enough for 1 million bathrooms!",
                "OPEC+ massively increasing production and reducing oil prices, NATO industry steadily ramping up more and more, Ukraine convincing Trump for support with a dumb treaty\n\nRussia's situation is getting worse and worse. Even the growth from shifting into a war economy wont save them as their budget is getting blown the fuck up",
                "Czech lead support initiative."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Trump announces 100% tariff for movies produced outside US",
            "external_url": "https://www.reuters.com/business/media-telecom/trump-announces-100-tariff-movies-produced-outside-us-2025-05-04/",
            "upvotes": 5804,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Soon 100% tariff on video games",
                "So movies, Alcatraz, and tourism.... Sounds like he's going after California",
                "Apparently Jon Voight asked Trump about tax breaks for domestically made films and this is where this came from.",
                "So it’s tariffs on US products. Great job guys!",
                "“film overseas in countries such as Canada”\n\nLaughing my fucking ass off over here! The reporters are idiots, as are the editors who didn’t catch this.",
                "How the fuck do you tariff something that can be transferred completely digitally? Fuck he is stupid.",
                "How does that even work? How much outside US production counts? How do you impose a tariff on a movie? On the media? If the DVDs are made outside the US then doesn’t a tariff already apply. If domestic, then how? Do they impose a tariff on the prints or drives theatres use? What if those are domestically produced? How do you apply a tariff to streaming content?\n\nThis is just bullshit.",
                "New week, new distractions from the worse things he's doing.",
                "Tariff is like the newest word Trump learned. He’s like a child. He learns it, uses it incorrectly in a sentence, and then puts it into practice poorly. Executive order was his new word in February",
                "It's so he can scare movie companies into making pro right wing content. You can bet Trump is Great (filmed in China) would get a pass, whereas Climate Change is Going to Kill Us All You Maniacs (made in California) would get the tarrifs."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Coastal restoration project is in peril amid claims state concealed a critical report",
            "external_url": "https://abcnews.go.com/US/wireStory/massive-coastal-restoration-project-peril-amid-claims-louisiana-121459590",
            "upvotes": 388,
            "date": "05/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8ec0bab0-1bbf-4ccc-a137-49bef2f7584c/wirestory_a46617c08c39be793539eadd0cd2b967_16x9.jpg?w=1600",
            "top_comments": [
                "This article is frustrating. They never really describe what they are talking about.",
                ">“They hid the bad stuff and only showed the (Corps) the version they liked,” Landry wrote in a post on X. “Science is easy when you just delete the inconvenient parts!”\n\n\"Science is easy when you just delete the inconvenient parts!\" Pope Urban VIII said the same thing, I think.",
                "You can't go wrong with never believing Jeff Landry.",
                "\"The stakes were so high the attorneys even weighed whether state officials could face federal charges for withholding from the Corps **a report that the diversion would generate significantly less land than another modeling projection** used in a federal review.\"",
                "I think many of you reading this here are missing the point. \n\nThe current Governor (a Republican) is accusing a previous Governor (a Democrat) of malfeasance. \n\nWhom do you believe? \n\nBecause the real story is this ... \"Amid the finger-pointing, **conservation proponents** have called the report in question a red herring that **Landry is using to tank the project**.\"\n\nLandry is the GOP Governor seeking to end the project through finger pointing.  \n\nSo the real story is that a corrupt conservative GOP goon (the current Governor) is trying to tank an environmental initiative to save some cash. (Colour me surprised!) And he has concocted these accusations against the former Democratic Governor. \n\nAnd the proof of this interpretation is in the pudding. \n\n>\"Prosecution seemed “extremely unlikely,” the lawyers wrote...\"\n\nAnd that is because there was no malfeasance and that this is all part of an elaborate scheme of the GOP Governor to sink an environmental program.",
                "> ...“Science is easy when you just delete the inconvenient parts!”\n\nWorks with math too."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Portugal announces the expulsion of 18,000 foreigners ahead of a national election",
            "external_url": "https://apnews.com/article/portugal-immigration-election-c491f01613bab2f5342118d288c2903e",
            "upvotes": 1,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "3 killed, 9 missing after small boat capsizes off San Diego, Coast Guard says",
            "external_url": "https://edition.cnn.com/2025/05/05/us/san-diego-panga-boat-capsized",
            "upvotes": 12,
            "date": "05/05/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25125637935769.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Unless those missing people got a life jacket or know how to rescue float, they're most likely already dead.",
                "I read the title as “small goat” and I was confused.\n\nI really need new glasses"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Newark airport outage last week lasted 60-90 seconds, ATC screens went dark: Sources",
            "external_url": "https://abcnews.go.com/US/newark-airport-outage-week-lasted-60-90-seconds/story?id=121484044",
            "upvotes": 104,
            "date": "05/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a73a0498-01e4-45f9-b3ed-fc407d9ca744/newark-airport-mo_1746471448622_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "It's fine. The planes only moved about 12 miles in that timeframe. \n\n/What could go wrong?",
                "Apparently caused by a single burnt copper wire… \n\nhttps://nypost.com/2025/05/05/us-news/newark-air-traffic-controllers-lost-radar-and-comms-for-90-seconds-in-horrifying-faa-outage/",
                "So they turned it off and on again?",
                "Vault Typhoon checking their tools work."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "South Dakota students weigh protest against university honors for homeland security chief Noem",
            "external_url": "https://apnews.com/article/dakota-state-university-noem-student-protest-dafc535890e1df72a0e27e6f4bbcdf35",
            "upvotes": 663,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It's a good article. Dakota State University is granting an honorary doctorate to Homeland Security Secretary Kristi Noem, and she is giving a commencement speech. Many students are opposed but are afraid to speak out (especially international students). Some students fear for their future job prospects if they openly protest.",
                "Deport Noem to El Salvador",
                "What an honor. \n\nAn honorary degree from the 12th best college in the Dakotas.",
                "Happy to see she’s getting dogged and hounded.",
                "She killed a puppy because she didn't like how it was acting. What more can anyone say?",
                "Some more local coverage:\n\n(paywalls) https://www.argusleader.com/story/news/politics/2025/04/21/noem-offered-honorary-doctorate-dakota-state-university-over-student-faculty-wishes/83171671007/ \n\nhttps://www.argusleader.com/story/news/education/2025/04/29/petition-call-for-dakota-state-to-rescind-kristi-noem-honorary-degree-nomination/83342940007/\n\nDSU is one of the leading cybersecurity schools in the nation, and curiously, the university president was with Noem at a major conference last week talking about leading national cybersecurity efforts.",
                "Students don't use your voices, use your bodies. When she says something reprehensible, pick up your chair and turn it around so your back will be toward her.",
                "Oh look, DEI is okay after all",
                "Kristi Noem is the poster child of botched cosmetic surgeries. \n\nPlease call the puppy killer what she is.",
                "And You get deported!\n\nAnd YOU get deported!\n\nYOU ALL GET DEPORTED!\n\n*Jumps up and down excitedly, waving hands*"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Romania PM resigns after far-right wins first-round of president vote",
            "external_url": "https://www.reuters.com/world/europe/romania-pm-resigns-after-far-right-wins-first-round-president-vote-2025-05-05/",
            "upvotes": 1203,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I need a TL;DR on the strategy here. I can't make heads or tails of it in the Reuters article. Is the idea that if the PM resigns and his party puts their support behind the centrists it makes a far-right win less likely?",
                "Can someone give local context?",
                "Is this why Andrew Taint went back? Thought he could have an advantage there now?",
                "Let me be optimistic. There is a second, ballot round. Please friends from Romania be smart..",
                "OMG the next idiot gets elected.... Do people not learn?",
                "Neat.\n\nIf only Eastern Europeans had a recent history of failed authoritarian rule to learn from.",
                "Romania looking for their fascist Nicolae Ceaușescu. People learn to make the same mistakes in new ways.",
                "He basically washed his hands of the political disaster his party caused, made sure his rats got fed off the state good enough, and now let's other people deal with the situation.",
                "Women are gonna be screwed so hard in Romania",
                "I am not surprised. Every time I see someone being racist to me on reddit, about 60-70% they are from Romania. The Racism per capita of Romania must be studied."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Judges must clear a high bar to separate parents from children forever, Texas Supreme Court rules",
            "external_url": "https://www.keranews.org/government/2025-05-05/judges-must-clear-a-high-bar-to-separate-parents-from-children-forever-texas-supreme-court-rules",
            "upvotes": 2837,
            "date": "05/05/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/be46422/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F87%2F01%2Fcd8484fc40b180a66aef0fe0c66c%2F121824-supreme-court-of-texas-seal-kut.JPG",
            "top_comments": [
                ">Terminating parental rights requires a higher burden of proof — trial courts must find the evidence “clear and convincing.”\n\nClear and convincing is the medium level of proof. Below 'beyond a reasonable doubt'. \n\n>Court documents allege in March 2020, Stary had grabbed her then 9-year-old son by the back of his head, beat his face on the hardwood floor and carpet, then continued to beat his bruised face as his nose began to bleed. Stary was arrested and charged with injuring a child, a third-degree felony.\n\nShe was given a lifetime protective order against all her children. She now gets a new hearing with the new standard needing to be applied.",
                "You all would be shocked at how infrequently they went after parents who hurt their children. I would say it was less than 2%. \n\nI used to do this job. A solid third of my cases were bullshit weed and custody cases that no one cared about. There just weren't enough resources to care about this.\n\nAnother third was abject poverty and people living in falling apart plywood trailers with no plumbing or electricity in the middle of Texas summer. Obviously you can't have a newborn baby living in 110° shed. Usually for that we would cram them in with the very unwilling family member and call it a day. There wasn't enough money to do anything else. \n\nA third of my cases were teen parents who didn't know any better and often didn't care but sometimes were trying. It's hard to be 15 and have a baby of your own when you're living on someone's couch. We usually got another unwilling family member to help supervise in these situations and called it a day. There wasn't enough money to do anything else. \n\nIn a perfect world I would have gotten them all affordable housing and healthcare and birth control and education and government IDs and bus passes and nutrition and clothes and sooooooo muchhhhhh therapyyyyyyy. \n\nA small portion of my cases were absolute monsters who needed to be locked up and so many of them escaped any sort of actual punishment. Again because of resources. \n\nVery frequently we terminated rights for shit parents but that's usually because the parents didn't even make an effort to complete the court required programs they were ordered to do. Simple stuff like parenting classes and showing up to visits and paying $10 a month in child support. Half the time they didn't even show up. I would tell them in person and in writing and tell the attorney \"hey this person has court on this date if they want to continue being a parent they need to show up.\" Nothing.\n\nParents who actually made even a half-assed effort got their kids back unless they were complete monsters like incest/rapists.",
                "I thought this was about ICE and am now disappointed.",
                "So the standard is still below that needed for a conviction, and only even that high for permanent protective orders?\n\nThat sounds reasonable? Am I missing something?\n\n>Stary was arrested and charged with injuring a child, a third-degree felony.\n\nIf this woman beat her kid bloody, the should be convicted for that, which would require a higher burden of proof than terminating her parental rights.",
                "My cousin fostered and eventually adopted a baby who's addict parents fed him meth, more than once.  The judge kept insisting the baby needed to go to his biological family.  My cousin had to hire two lawyers to finally adopt him.\n\nFuck this state.  Fuck this state so much.",
                "Obviously doesn't apply to citizens at the border. ",
                "It's kind of wild that before this ruling, you could choose to seek a lifetime protection order (under a preponderance of evidence standard) that effectively accomplished the same thing as an order terminating parental rights (which required clear and convincing evidence).  Protective orders usually require a very different showing and don't really emphasize the best interests of the child, like termination of parental rights.  At any rate, seems like a rare positive advancement in justice from the state of Texas.",
                "Hot take, if you literally ever hit your kid hard enough to make them bleed, and to be clear you shouldn't hit your kid at all, but if you ever hit them hard enough to make them bleed then you should never be allowed to see them again, ever. Not ever.",
                "I was a public health nurse and some parents should lose custody before destroying their children.",
                "Great, now kids get to be forced to be part of their parents' addiction cycle for even longer."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Trump's DHS offers $1,000 stipends, travel assistance to immigrants who 'self-deport'",
            "external_url": "https://www.cnbc.com/2025/05/05/trump-dhs-travel-costs-stipend-immigrants-self-deport.html",
            "upvotes": 2404,
            "date": "05/05/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107239057-1683737514848-gettyimages-1253637829-MAYORKAS_TITLE_42.jpeg?v=1683737566&w=1920&h=1080",
            "top_comments": [
                "Sounds like the 'you've won a free boat, pick it up at the police station' ploy.",
                "They totally won't throw a hood over their heads when they show up to collect the check, promise.",
                "Yes cause we all know Trump is great at actually paying people what he promises",
                "Seems like a bait and switch",
                "ICE gonna set up a whole program to facilitate this and pocket the money as they kidnap these folks and ship them off to an El Salvador gulag.",
                "Sounds like free handout communism to me idk",
                "Someone should check this for waste, fraud, and abuse. Perhaps there is a government efficiency office that could check?",
                "Can citizens self-deport? Send me to the UK. Or Poland.",
                "Knowing how inept this administration is, I wonder if as a citizen I can take the offer, get my $1,000 and then just come back and do it again. ",
                "This is a trick. They only get the money after they can verify they have indeed self-deported to their country of origin. \n\n\"users will receive a $1,000 stipend only after their arrival in their country of origin is confirmed through the app\"."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Trump orders the reopening of Alcatraz prison",
            "external_url": "https://www.reuters.com/world/us/trump-directs-bureau-prisons-reopen-alcatraz-2025-05-04/",
            "upvotes": 9887,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I bet he just watched The Rock last weekend.",
                "Step 1: insist on reopening a long abandoned prison with enormous costs associated in order to divert attention.\n\nStep 2: announce reopening will cost $45B.\n\nStep 3: announce that we will not reopen the prison citing budgetary reasons.\n\nStep 4: claim to have saved the federal government $45B & gives friends the \"savings\". MAGA spikes the football.\n\nThis is Trump math, y'all.",
                "Such a worthless idea, there is no reason to have a prison there and terrible from a cost efficiency standpoint, people escaping from maximum security prisons isn’t the concern it used to be",
                "We literally have incredible supermax prisons on the mainland. The rock was built during a time when modern supermax didn't really exist and the natural island/water barrier was useful. But now ... This is more of a visual move. Alcatraz is infamous and legendary, Trump wants to tie its reopening to him. It's symbolic and moronic.",
                "Honest question is this even legally allowed? I assume Alcatraz was set up as National Park via legislation? This would need budget correct?",
                "isn't it a museum now? whats the plan? bulldoze the tourist attraction?",
                "This is a distraction from more important things, like him saying he doesn't know if he has to uphold the constitution or if people are guaranteed due process. Let's keep the focus there.",
                "Donald Trump has, on more than on occasion, compared himself to Al Capone.\n\nAlcatraz is where Al Capone first got any sort of treatment for his festering syphilis. Though it was an outdated treatment, even for its time. His condition worsened and his mental capacity greatly diminished during his incarceration there.",
                "All I know about Alcatraz I learned from Tony Hawk’s Pro Skater 4",
                "[removed]"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Ukraine to Receive 3 Million Shells in 2025 Under Czech Led Support Initiative",
            "external_url": "https://ankoletimes.co.ug/world-news/4168/ukraine-to-receive-3-million-shells-in-2025-under-czech-led-support-initiative/",
            "upvotes": 869,
            "date": "05/05/2025",
            "thumbnail": "https://i1.wp.com/images.unsplash.com/photo-1699256460480-4ae47855cb4d?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3wxMjA3fDB8MXxzZWFyY2h8OHx8YXJ0aWxsZXJ5JTIwc2hlbGxzfGVufDB8fHx8MTc0NjQzNjc1OXww&ixlib=rb-4.0.3&q=80&w=1200&w=1200&resize=1200,800&ssl=1",
            "top_comments": [
                "When I read the title I thought of the other type of shell and thought wait a minute Czachia doesn't have coast.",
                "That's enough for 1 million bathrooms!",
                "OPEC+ massively increasing production and reducing oil prices, NATO industry steadily ramping up more and more, Ukraine convincing Trump for support with a dumb treaty\n\nRussia's situation is getting worse and worse. Even the growth from shifting into a war economy wont save them as their budget is getting blown the fuck up",
                "Czech lead support initiative."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Coastal restoration project is in peril amid claims state concealed a critical report",
            "external_url": "https://abcnews.go.com/US/wireStory/massive-coastal-restoration-project-peril-amid-claims-louisiana-121459590",
            "upvotes": 390,
            "date": "05/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8ec0bab0-1bbf-4ccc-a137-49bef2f7584c/wirestory_a46617c08c39be793539eadd0cd2b967_16x9.jpg?w=1600",
            "top_comments": [
                "This article is frustrating. They never really describe what they are talking about.",
                ">“They hid the bad stuff and only showed the (Corps) the version they liked,” Landry wrote in a post on X. “Science is easy when you just delete the inconvenient parts!”\n\n\"Science is easy when you just delete the inconvenient parts!\" Pope Urban VIII said the same thing, I think.",
                "You can't go wrong with never believing Jeff Landry.",
                "\"The stakes were so high the attorneys even weighed whether state officials could face federal charges for withholding from the Corps **a report that the diversion would generate significantly less land than another modeling projection** used in a federal review.\"",
                "I think many of you reading this here are missing the point. \n\nThe current Governor (a Republican) is accusing a previous Governor (a Democrat) of malfeasance. \n\nWhom do you believe? \n\nBecause the real story is this ... \"Amid the finger-pointing, **conservation proponents** have called the report in question a red herring that **Landry is using to tank the project**.\"\n\nLandry is the GOP Governor seeking to end the project through finger pointing.  \n\nSo the real story is that a corrupt conservative GOP goon (the current Governor) is trying to tank an environmental initiative to save some cash. (Colour me surprised!) And he has concocted these accusations against the former Democratic Governor. \n\nAnd the proof of this interpretation is in the pudding. \n\n>\"Prosecution seemed “extremely unlikely,” the lawyers wrote...\"\n\nAnd that is because there was no malfeasance and that this is all part of an elaborate scheme of the GOP Governor to sink an environmental program.",
                "> ...“Science is easy when you just delete the inconvenient parts!”\n\nWorks with math too."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Judges must clear a high bar to separate parents from children forever, Texas Supreme Court rules",
            "external_url": "https://www.keranews.org/government/2025-05-05/judges-must-clear-a-high-bar-to-separate-parents-from-children-forever-texas-supreme-court-rules",
            "upvotes": 2838,
            "date": "05/05/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/be46422/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F87%2F01%2Fcd8484fc40b180a66aef0fe0c66c%2F121824-supreme-court-of-texas-seal-kut.JPG",
            "top_comments": [
                ">Terminating parental rights requires a higher burden of proof — trial courts must find the evidence “clear and convincing.”\n\nClear and convincing is the medium level of proof. Below 'beyond a reasonable doubt'. \n\n>Court documents allege in March 2020, Stary had grabbed her then 9-year-old son by the back of his head, beat his face on the hardwood floor and carpet, then continued to beat his bruised face as his nose began to bleed. Stary was arrested and charged with injuring a child, a third-degree felony.\n\nShe was given a lifetime protective order against all her children. She now gets a new hearing with the new standard needing to be applied.",
                "You all would be shocked at how infrequently they went after parents who hurt their children. I would say it was less than 2%. \n\nI used to do this job. A solid third of my cases were bullshit weed and custody cases that no one cared about. There just weren't enough resources to care about this.\n\nAnother third was abject poverty and people living in falling apart plywood trailers with no plumbing or electricity in the middle of Texas summer. Obviously you can't have a newborn baby living in 110° shed. Usually for that we would cram them in with the very unwilling family member and call it a day. There wasn't enough money to do anything else. \n\nA third of my cases were teen parents who didn't know any better and often didn't care but sometimes were trying. It's hard to be 15 and have a baby of your own when you're living on someone's couch. We usually got another unwilling family member to help supervise in these situations and called it a day. There wasn't enough money to do anything else. \n\nIn a perfect world I would have gotten them all affordable housing and healthcare and birth control and education and government IDs and bus passes and nutrition and clothes and sooooooo muchhhhhh therapyyyyyyy. \n\nA small portion of my cases were absolute monsters who needed to be locked up and so many of them escaped any sort of actual punishment. Again because of resources. \n\nVery frequently we terminated rights for shit parents but that's usually because the parents didn't even make an effort to complete the court required programs they were ordered to do. Simple stuff like parenting classes and showing up to visits and paying $10 a month in child support. Half the time they didn't even show up. I would tell them in person and in writing and tell the attorney \"hey this person has court on this date if they want to continue being a parent they need to show up.\" Nothing.\n\nParents who actually made even a half-assed effort got their kids back unless they were complete monsters like incest/rapists.",
                "I thought this was about ICE and am now disappointed.",
                "So the standard is still below that needed for a conviction, and only even that high for permanent protective orders?\n\nThat sounds reasonable? Am I missing something?\n\n>Stary was arrested and charged with injuring a child, a third-degree felony.\n\nIf this woman beat her kid bloody, the should be convicted for that, which would require a higher burden of proof than terminating her parental rights.",
                "My cousin fostered and eventually adopted a baby who's addict parents fed him meth, more than once.  The judge kept insisting the baby needed to go to his biological family.  My cousin had to hire two lawyers to finally adopt him.\n\nFuck this state.  Fuck this state so much.",
                "Obviously doesn't apply to citizens at the border. ",
                "It's kind of wild that before this ruling, you could choose to seek a lifetime protection order (under a preponderance of evidence standard) that effectively accomplished the same thing as an order terminating parental rights (which required clear and convincing evidence).  Protective orders usually require a very different showing and don't really emphasize the best interests of the child, like termination of parental rights.  At any rate, seems like a rare positive advancement in justice from the state of Texas.",
                "Hot take, if you literally ever hit your kid hard enough to make them bleed, and to be clear you shouldn't hit your kid at all, but if you ever hit them hard enough to make them bleed then you should never be allowed to see them again, ever. Not ever.",
                "I was a public health nurse and some parents should lose custody before destroying their children.",
                "Great, now kids get to be forced to be part of their parents' addiction cycle for even longer."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "South Dakota students weigh protest against university honors for homeland security chief Noem",
            "external_url": "https://apnews.com/article/dakota-state-university-noem-student-protest-dafc535890e1df72a0e27e6f4bbcdf35",
            "upvotes": 661,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It's a good article. Dakota State University is granting an honorary doctorate to Homeland Security Secretary Kristi Noem, and she is giving a commencement speech. Many students are opposed but are afraid to speak out (especially international students). Some students fear for their future job prospects if they openly protest.",
                "Deport Noem to El Salvador",
                "What an honor. \n\nAn honorary degree from the 12th best college in the Dakotas.",
                "Happy to see she’s getting dogged and hounded.",
                "She killed a puppy because she didn't like how it was acting. What more can anyone say?",
                "Some more local coverage:\n\n(paywalls) https://www.argusleader.com/story/news/politics/2025/04/21/noem-offered-honorary-doctorate-dakota-state-university-over-student-faculty-wishes/83171671007/ \n\nhttps://www.argusleader.com/story/news/education/2025/04/29/petition-call-for-dakota-state-to-rescind-kristi-noem-honorary-degree-nomination/83342940007/\n\nDSU is one of the leading cybersecurity schools in the nation, and curiously, the university president was with Noem at a major conference last week talking about leading national cybersecurity efforts.",
                "Students don't use your voices, use your bodies. When she says something reprehensible, pick up your chair and turn it around so your back will be toward her.",
                "Oh look, DEI is okay after all",
                "Kristi Noem is the poster child of botched cosmetic surgeries. \n\nPlease call the puppy killer what she is.",
                "And You get deported!\n\nAnd YOU get deported!\n\nYOU ALL GET DEPORTED!\n\n*Jumps up and down excitedly, waving hands*"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Romania PM resigns after far-right wins first-round of president vote",
            "external_url": "https://www.reuters.com/world/europe/romania-pm-resigns-after-far-right-wins-first-round-president-vote-2025-05-05/",
            "upvotes": 1206,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I need a TL;DR on the strategy here. I can't make heads or tails of it in the Reuters article. Is the idea that if the PM resigns and his party puts their support behind the centrists it makes a far-right win less likely?",
                "Can someone give local context?",
                "Is this why Andrew Taint went back? Thought he could have an advantage there now?",
                "Let me be optimistic. There is a second, ballot round. Please friends from Romania be smart..",
                "OMG the next idiot gets elected.... Do people not learn?",
                "Neat.\n\nIf only Eastern Europeans had a recent history of failed authoritarian rule to learn from.",
                "Romania looking for their fascist Nicolae Ceaușescu. People learn to make the same mistakes in new ways.",
                "He basically washed his hands of the political disaster his party caused, made sure his rats got fed off the state good enough, and now let's other people deal with the situation.",
                "Women are gonna be screwed so hard in Romania",
                "I am not surprised. Every time I see someone being racist to me on reddit, about 60-70% they are from Romania. The Racism per capita of Romania must be studied."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Ukraine to Receive 3 Million Shells in 2025 Under Czech Led Support Initiative",
            "external_url": "https://ankoletimes.co.ug/world-news/4168/ukraine-to-receive-3-million-shells-in-2025-under-czech-led-support-initiative/",
            "upvotes": 869,
            "date": "05/05/2025",
            "thumbnail": "https://i1.wp.com/images.unsplash.com/photo-1699256460480-4ae47855cb4d?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3wxMjA3fDB8MXxzZWFyY2h8OHx8YXJ0aWxsZXJ5JTIwc2hlbGxzfGVufDB8fHx8MTc0NjQzNjc1OXww&ixlib=rb-4.0.3&q=80&w=1200&w=1200&resize=1200,800&ssl=1",
            "top_comments": [
                "When I read the title I thought of the other type of shell and thought wait a minute Czachia doesn't have coast.",
                "That's enough for 1 million bathrooms!",
                "OPEC+ massively increasing production and reducing oil prices, NATO industry steadily ramping up more and more, Ukraine convincing Trump for support with a dumb treaty\n\nRussia's situation is getting worse and worse. Even the growth from shifting into a war economy wont save them as their budget is getting blown the fuck up",
                "Czech lead support initiative."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Trump's DHS offers $1,000 stipends, travel assistance to immigrants who 'self-deport'",
            "external_url": "https://www.cnbc.com/2025/05/05/trump-dhs-travel-costs-stipend-immigrants-self-deport.html",
            "upvotes": 2405,
            "date": "05/05/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107239057-1683737514848-gettyimages-1253637829-MAYORKAS_TITLE_42.jpeg?v=1683737566&w=1920&h=1080",
            "top_comments": [
                "Sounds like the 'you've won a free boat, pick it up at the police station' ploy.",
                "They totally won't throw a hood over their heads when they show up to collect the check, promise.",
                "Yes cause we all know Trump is great at actually paying people what he promises",
                "Seems like a bait and switch",
                "ICE gonna set up a whole program to facilitate this and pocket the money as they kidnap these folks and ship them off to an El Salvador gulag.",
                "Sounds like free handout communism to me idk",
                "Someone should check this for waste, fraud, and abuse. Perhaps there is a government efficiency office that could check?",
                "Can citizens self-deport? Send me to the UK. Or Poland.",
                "Knowing how inept this administration is, I wonder if as a citizen I can take the offer, get my $1,000 and then just come back and do it again. ",
                "This is a trick. They only get the money after they can verify they have indeed self-deported to their country of origin. \n\n\"users will receive a $1,000 stipend only after their arrival in their country of origin is confirmed through the app\"."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Trump orders the reopening of Alcatraz prison",
            "external_url": "https://www.reuters.com/world/us/trump-directs-bureau-prisons-reopen-alcatraz-2025-05-04/",
            "upvotes": 9887,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I bet he just watched The Rock last weekend.",
                "Step 1: insist on reopening a long abandoned prison with enormous costs associated in order to divert attention.\n\nStep 2: announce reopening will cost $45B.\n\nStep 3: announce that we will not reopen the prison citing budgetary reasons.\n\nStep 4: claim to have saved the federal government $45B & gives friends the \"savings\". MAGA spikes the football.\n\nThis is Trump math, y'all.",
                "Such a worthless idea, there is no reason to have a prison there and terrible from a cost efficiency standpoint, people escaping from maximum security prisons isn’t the concern it used to be",
                "We literally have incredible supermax prisons on the mainland. The rock was built during a time when modern supermax didn't really exist and the natural island/water barrier was useful. But now ... This is more of a visual move. Alcatraz is infamous and legendary, Trump wants to tie its reopening to him. It's symbolic and moronic.",
                "Honest question is this even legally allowed? I assume Alcatraz was set up as National Park via legislation? This would need budget correct?",
                "isn't it a museum now? whats the plan? bulldoze the tourist attraction?",
                "This is a distraction from more important things, like him saying he doesn't know if he has to uphold the constitution or if people are guaranteed due process. Let's keep the focus there.",
                "Donald Trump has, on more than on occasion, compared himself to Al Capone.\n\nAlcatraz is where Al Capone first got any sort of treatment for his festering syphilis. Though it was an outdated treatment, even for its time. His condition worsened and his mental capacity greatly diminished during his incarceration there.",
                "All I know about Alcatraz I learned from Tony Hawk’s Pro Skater 4",
                "[removed]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "3 killed, 5 hurt in shooting at Glendale, Arizona, restaurant: Police",
            "external_url": "https://abcnews.go.com/US/9-injured-glendale-arizona-shooting-police/story?id=121460049",
            "upvotes": 1758,
            "date": "05/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6734f915-a9c3-4dd6-a9d4-778b0c61aae6/glendale-shooting-scenen-knxv-jef-250505_1746447292367_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "And this happened across the street from the Glendale Police Department.",
                "It’s pretty fucked up when I see this headline and I don’t get surprised and think “oh 3 deaths, it’s not that bad”",
                "What does this say as a country when I see headlines like this and it just feels normal. ",
                "I lived in Arizona for two years.\n\nThe lack of gun laws there was a major reason I don't live there now.\n\nYou have half the population statistically operating below average intelligence*.\n\nYou really don't want every John, Tom, and Suzzy under the sun open carrying in public. \n\nEvery time I'd see the people carrying in public I was on edge , always fearing I'd get caught in some idiots fever dream of standing their ground over a $2.00 rest-stop hotdog or them trying to be the good guy/gal with a gun, and \"stopping a crime\" with me in the cross fire. \n\nToo bad there's absolutely nothing we can do about guns in this country!\n\nEdit: intelligence* & jeeze I triggered some of you gun nuts. Sorry, but not sorry,  I lived abroad in warzones and in Europe ( Germany) thanks to the Army and got to see how the rest of the world lives. Common sense gun laws are a good thing and a sign of a civilized nation. Jesus, only if there were models that work and school and mass shootings aren't an everyday occurrence.",
                "Just want to mention they are reporting this was an argument that escalated. They don’t think it was hate crime, just idiots with guns that we’re drinking.",
                "Shit, is it Monday already?",
                "Sigh...\n\nhttps://theonion.com/no-way-to-prevent-this-says-only-nation-where-this-r-1848971668/",
                "Left leaning/ democrat/libertarian LGBTQ gun owner/2a supporter here, sounds like this shooting was likely cartel or gang related as it involved more than 1 shooter. \nIf thats is the case it's a high likelihood that the guns involved were not acquired legally by the shooters. \nI'm for more thorough background checks and other pragmatic means of making guns inaccessible to people with a history of violence/ crime, however I see many of my fellow left leaning people shouting to ban all guns, which is unrealistic and considering the current political situation, I'd suggest many of the anti gun democrats and liberals to consider getting a firearm of their own and get proper training.  Obviously gun ownership percentage in this country leans heavily to the republican population.\nThat is worrying and needs to change.",
                "If only there were some way to stop this.",
                "[removed]"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Coastal restoration project is in peril amid claims state concealed a critical report",
            "external_url": "https://abcnews.go.com/US/wireStory/massive-coastal-restoration-project-peril-amid-claims-louisiana-121459590",
            "upvotes": 387,
            "date": "05/05/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8ec0bab0-1bbf-4ccc-a137-49bef2f7584c/wirestory_a46617c08c39be793539eadd0cd2b967_16x9.jpg?w=1600",
            "top_comments": [
                "This article is frustrating. They never really describe what they are talking about.",
                ">“They hid the bad stuff and only showed the (Corps) the version they liked,” Landry wrote in a post on X. “Science is easy when you just delete the inconvenient parts!”\n\n\"Science is easy when you just delete the inconvenient parts!\" Pope Urban VIII said the same thing, I think.",
                "You can't go wrong with never believing Jeff Landry.",
                "\"The stakes were so high the attorneys even weighed whether state officials could face federal charges for withholding from the Corps **a report that the diversion would generate significantly less land than another modeling projection** used in a federal review.\"",
                "I think many of you reading this here are missing the point. \n\nThe current Governor (a Republican) is accusing a previous Governor (a Democrat) of malfeasance. \n\nWhom do you believe? \n\nBecause the real story is this ... \"Amid the finger-pointing, **conservation proponents** have called the report in question a red herring that **Landry is using to tank the project**.\"\n\nLandry is the GOP Governor seeking to end the project through finger pointing.  \n\nSo the real story is that a corrupt conservative GOP goon (the current Governor) is trying to tank an environmental initiative to save some cash. (Colour me surprised!) And he has concocted these accusations against the former Democratic Governor. \n\nAnd the proof of this interpretation is in the pudding. \n\n>\"Prosecution seemed “extremely unlikely,” the lawyers wrote...\"\n\nAnd that is because there was no malfeasance and that this is all part of an elaborate scheme of the GOP Governor to sink an environmental program.",
                "> ...“Science is easy when you just delete the inconvenient parts!”\n\nWorks with math too."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Young woman's strip search at festival akin to 'sexual assault', court told",
            "external_url": "https://www.abc.net.au/news/2025-05-05/young-woman-strip-search-sexual-assault-court-nsw-police/105253220",
            "upvotes": 15047,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Parliament had made it clear strip searches were only supposed to be used \"in the most extreme of circumstances\", but that was not the way they were being executed by NSW Police.\"\n\nI know why, it's because you have perverts in positions of power and are abusing it for their own pleasure. \n\nShe was asked to strip, expose all parts of her body, drop her breasts, bend over and expose her anus and vagina, also ordering her to bend over while naked and remove a tampon. AND, a male police officer walked into the cubicle unannounced and observed the plaintiff in this position. Putting a woman through that because a cop had a \"hunch\"? Right. \n\nThose cops got off on it. Just disgusting behavior that should have consequences. This is not the kind of people you want in the police force.",
                "Police in Sydney routinely conduct invasive strip searches at music festivals. We’re talking completely naked searches where guys are told to lift their balls, girls are told to lift their boobs, attendees are told to squat and cough, bend over etc. Most of these strip searches don’t find any drugs, and you’ve got reports of innocent people being left completely distraught after this has happened to them. NSW Police are currently facing a class action over this. So far around 3000 people have signed up. A trial for that class action began today, hence the article.\n\nFor background: In 2001, New South Wales (state in Australia, Sydney is the capital) introduced a law giving police the power to deploy drug detection dogs at certain public locations, namely at major events such as music festivals, train stations and at venues that serve alcohol, such as pubs and clubs. These dogs are notoriously unreliable, and there are reports on social media of handlers forcing their dogs to sit in front people in order to have them searched.\n\nMusic festivals are the worst. The police have drug detection dogs at every music festival in Sydney. At these events, they’ll have a fenced off compound setup with makeshift structures such as tents or ticket booths where people stopped by the dogs are taken to be searched. Some people are lucky enough to get away with a pat down, but in many cases, festival attendees have been ordered to strip completely naked and bend over, squat etc. to have their bodies examined for drugs. At any given event, they’ll strip search dozens of people like this. Total gestapo stuff and it’s still happening today.",
                "Showing your butthole to security should not be a part of going to a festival. How the fuck did it get to that point where the people performing the searches think this is OK?",
                "People that put these policies in place should have to go through this stuff themselves in a public space and then decide if the \"problem\" they think they're solving is worth the solution they've decided upon.",
                "I really try not to think the worst of people but \"drug dog sniffed in her direction\" sounds like a cover up of  \"wanted to see the attractive festival goer naked and needed some kinda probable cause\" yuck.",
                "I wonder if those cops would do that to their own family, how they'd react if they heard that happened to their kids. Seems like a lack of humanity being experienced here by these individuals. When you're the one committing heinous acts, are you the protector anymore or are you the problem that needs to be solved?",
                "Over 1500 of them were children: https://rlc.org.au/news-and-media/media-releases/nsw-police-strip-searched-1546-children-seven-years",
                "Bend over naked and remove your tampon?! For a music festival? This is infuriating",
                "Not akin to sexual assault... this is sexual assault.",
                "That sounds worse than the airport controls. Is this procedure really common in Australia?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Trump announces 100% tariff for movies produced outside US",
            "external_url": "https://www.reuters.com/business/media-telecom/trump-announces-100-tariff-movies-produced-outside-us-2025-05-04/",
            "upvotes": 5805,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Soon 100% tariff on video games",
                "So movies, Alcatraz, and tourism.... Sounds like he's going after California",
                "Apparently Jon Voight asked Trump about tax breaks for domestically made films and this is where this came from.",
                "So it’s tariffs on US products. Great job guys!",
                "“film overseas in countries such as Canada”\n\nLaughing my fucking ass off over here! The reporters are idiots, as are the editors who didn’t catch this.",
                "How the fuck do you tariff something that can be transferred completely digitally? Fuck he is stupid.",
                "How does that even work? How much outside US production counts? How do you impose a tariff on a movie? On the media? If the DVDs are made outside the US then doesn’t a tariff already apply. If domestic, then how? Do they impose a tariff on the prints or drives theatres use? What if those are domestically produced? How do you apply a tariff to streaming content?\n\nThis is just bullshit.",
                "New week, new distractions from the worse things he's doing.",
                "Tariff is like the newest word Trump learned. He’s like a child. He learns it, uses it incorrectly in a sentence, and then puts it into practice poorly. Executive order was his new word in February",
                "It's so he can scare movie companies into making pro right wing content. You can bet Trump is Great (filmed in China) would get a pass, whereas Climate Change is Going to Kill Us All You Maniacs (made in California) would get the tarrifs."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "05/05/2025 20:10:38 UTC"
}