{
    "posts": [
        {
            "category": "HOT",
            "title": "Olympic gold medalist, NCAA champion wrestler arrested in prostitution sting",
            "external_url": "https://www.pennlive.com/sports/2025/05/olympic-gold-medalist-ncaa-champion-wrestler-arrested-in-prostitution-sting.html",
            "upvotes": 7285,
            "date": "05/12/2025",
            "thumbnail": "https://www.pennlive.com/resizer/v2/LOD43AX2ZBAAJJ2YFZLUHRX77U.jpg?auth=c9155d8d33782c20a9b1aa1c78e2b7adfc9a3bd2c2c3387432ea8a312e510033&width=1280&quality=90",
            "top_comments": [
                "> According to the news station, Snyder allegedly started calling and texting about an ad for prostitution. He is accused of meeting at a hotel with an undercover officer, exchanging cash and requesting a sexual act.\n\nWow, great job everyone. You caught him! Resources well spent. Another violent criminal off the streets. \n\nNow if you’ll excuse me, I’m off to watch another video on pornhub where this exact scenario is legal as long as it’s filmed!",
                "He just tried to pay money for a prostitute. I’m sure a problem for his wife and a problem for his Christian camp affiliations but not a problem for me",
                "Damn even an Olympic champion can’t get laid naturally. Guess I’ll just stick to my left hand",
                "Doesn't sound like anything worth taxpayer money or publication. Only unfortunate detail:\n\n>Kyle Snyder is married to former Syracuse soccer player Maddie Pack Snyder.   \n\nAnd one I'm ambivalent about:\n \n> Snyder also holds a summer camp at Messiah University -- a private Christian School in Mechanicsburg, Pennsylvania. The camp is slated to be held June 20-23.",
                "Consensual sex with a grown adult? FOR SHAME",
                "Probably just wanted to practice some new holds",
                "Shoulda used campaign funds to pay for it then it would have been legal apparently?",
                "Prostitution is a human inevitability. The concept is a constant throughout human history and developed in multiple, separate, and exclusive civilizations. \n\nIt will never stop. It will never go away. \n\nLegalize it and allow these individuals to be treated like any other business. Cut the shit.",
                "Meanwhile, the US president....",
                "Instead of catching adults having sex with each other for money, they should focus on catching adults who mess with children"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "Taliban adds chess to ever-growing list of things banned in Afghanistan",
            "external_url": "https://globalnews.ca/news/11175560/taliban-chess-banned-afghanistan/",
            "upvotes": 3487,
            "date": "05/12/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/05/GettyImages-1241640843.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "Someone high up in the Taliban lost a game to one of the kids they were molesting.",
                "Robin Williams had a joke that went like:\n\nYou can’t bomb the Taliban back to the Stone Age because they’ll go, “Oh! Upgrade!”",
                "just outlaw thinking and get it over with. ",
                "Some dude lost to a woman in chess, huh",
                "It’s wild that they banned chess, especially considering how deep its roots are in the Islamic world. \n\nWhile the game originated in India (as chaturanga), it was the Islamic Golden Age that helped spread and refine it across the Middle East, North Africa, and eventually into Europe. Scholars, caliphs, and poets all engaged with chess—not just as entertainment, but as a symbol of intellect and strategy. There are even surviving manuscripts from medieval Islamic scholars analyzing chess theory. In some courts, being good at chess was a mark of education and refinement. \n\nBanning it under the idea that it’s “un-Islamic” is completely ahistorical—it’s like banning algebra because it’s not “aligned with sharia,” even though al-jabr (algebra) literally came from Muslim mathematicians.",
                "Some of the other things recently banned in Afghanistan, as mentioned in the article:  \n\n\n>The move to ban chess comes just months after the Taliban banned free fighting, such as mixed martial arts, saying it was not aligned with sharia (Islamic law) and was too “violent.” The banning of MMA followed a 2021 law that prohibited “face-punching.”\n\n>Last October, the Taliban issued a decree that [prohibits women from praying aloud](https://globalnews.ca/news/10841150/taliban-women-morality-laws-praying-voices/) or reciting the Qur’an in each other’s presence. Two months earlier, in August 2024, they issued laws [making it mandatory](https://globalnews.ca/news/10712505/taliban-bans-womens-voices-faces-laws/) for women to veil their entire bodies, including their faces, at all times in public. Women were also forbidden from singing, reciting and reading aloud in public, as a woman’s voice is deemed “intimate” and should not be heard.\n\n>Women are already excluded from education after sixth grade, many public spaces and most jobs. They are also prohibited from looking at men they are not related to by blood or marriage.",
                "When you are so fkn miserable you have to make sure everyone is else too.",
                "That's just fucking embarrassing for the Taliban",
                "Chess involves forward thinking, strategy, and trying to figure out your opponents next move. Of course they wouldn't want that.",
                "Why are they even bothered to be alive they seem to want to ban everything I don't get why they continue to exist."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "Georgia become second US state to shield maker of Roundup weed killer from some cancer claims",
            "external_url": "https://apnews.com/article/bayer-roundup-weed-killer-pesticides-cancer-lawsuits-02020b62e2c0affbeccf464677fec871",
            "upvotes": 12074,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "FYI, the other state is North Dakota",
                ">Bayer insists glyphosate is safe. But it has stopped using the ingredient in its residential version of Roundup and has set aside $16 billion to settle cases. It continues to use glyphosate in its agricultural version of Roundup but has warned that it might have to stop doing so if the legal costs keep mounting.\n\nDoesn't sound like it's safe to me.",
                "We don't need to be giving giant companies shields like that. We also don't need a jury deciding what causes cancer when the scientific results aren't there.",
                "Georgia is also the state where prosecutors have absolute immunity. If they lie or break the law to convict you, they face no consequences whatsoever and cannot be sued for their misconduct. I feel terrible for people stuck there with MTG",
                "Bayer is the beneficiary. Bayer is not a farmer. \n\n> The new law “demonstrates that Georgia stands with its farmers, who work tirelessly to produce safe and affordable food,” said Brian Naber, president of Bayer’s crop sciences in North America, Australia and New Zealand.",
                "Georgia becomes second state to give Monsanto immunity.",
                "In the landscaping business we thought we knew that when Roundup was banned in France, the bees came back.  But when I went to go look that up all I could find was clouds and clouds of professionally planted disinformation.\n\nSo I still believe it.",
                "As a Georgian, this tracks for Kemp. \n\nThis verdict on the heels of the golf course study last week is insane.  It showed a huge increase in Parkinson’s in people living or working in close proximity to golf courses. Perhaps chemicals sprayed onto grass year round isn’t ideal…",
                "Why is everybody freaking out over unsubstantiated dubious cancer claims rather than the widespread ecosystem damage that's well known and understood? Like if you're going to hate it please learn to hate it for the right reasons.",
                "Save corporations from responsibility."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "HOT",
            "title": "Federal judge won’t block Trump’s plan to use IRS data to track down undocumented migrants",
            "external_url": "https://www.cnn.com/2025/05/12/politics/judge-wont-block-irs-data-sharing-track-undocumented-migrants",
            "upvotes": 2321,
            "date": "05/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-20t181645z-962444936-rc2hycat9wtc-rtrmadp-3-usa-trump-irs.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Literally telling immigrants to not pay taxes.",
                "But wait, one of their big things is \"immigrants don't pay taxes.\" Why would there be records at the IRS?",
                "This is very likely to get overturned on appeal by the DC Circuit if it makes it to non-Trump judges, both Republican and Democrat judges. The privacy laws of the tax code are pretty damn solid in what can be disclosed.",
                "Trump et al. said undocumented immigrants don't pay taxes. Just another con.",
                "You mean someone's paying them to work?",
                "Using documentation to find undocumented migrants is oxymoronic",
                "So they are going to forgo $96 BILLION in taxes to maybe deport a few thousand TAX-PAYING undocumented workers? A few of whom might be accused criminal activity? \n\nGreat. Sounds very fiscally responsible. ",
                "I did taxes. If the axiom of \"the IRS doesn't care how you get money as long as you pay them\" no longer holds true, then shit's gonna crumble.",
                "They are tracking us ALL down",
                "And for some reasons we can't see his tax records."
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "HOT",
            "title": "Possible anchoring failure leaves 3 climbers dead in Washington state",
            "external_url": "https://www.cnn.com/2025/05/12/us/north-cascades-climbers-death",
            "upvotes": 788,
            "date": "05/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/496263129-1102854608546908-5906308397723621896-n.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "*Article Text:*\n\nThree people died and one other person was able to free themself during a climbing accident in Washington state, authorities said Monday.\n\nAuthorities responded to the scene Sunday as the victims had fallen “while descending a steep gully” in the North Cascades, the Okanogan County Sheriff’s Office said. Authorities said they believe a part of their anchoring system failed.\n\n“Three individuals were confirmed deceased at the accident site. The fourth member of the party self-extricated and contacted law enforcement,” the Okanogan County Sheriff’s Office said of the four climbers from Renton.\n\nThose killed were ages 36, 47 and 63, according to the office.\n\n“The presumed cause of the accident is an anchor failure while rappelling, with more investigation still ongoing,” the sheriff’s office added.\n\nThe climbers were in the area of North Early Winters Spire when the accident occurred, authorities said. The site is about 16 miles west of Mazama.",
                "*A fourth climber sustained internal bleeding and a traumatic brain injury in the fall, but survived. He walked back to the trailhead just east of Washington Pass and drove to Newhalem, where he used a pay phone to call 911 at about 11:30 a.m. Sunday.*\n\nImagine if all 4 lived through the failure, and none could walk to the trailhead and then drive to the pay phone. Actually, it's possible one or two were still alive but died because of no cell coverage in the mountains.",
                "Damn, that sucks.\n\nJust goes to show that any mountain can be deadly if your luck or preparation are bad enough. Safety in mountaineering is nothing to take lightly.",
                "Damn a rap anchor failed. Scary shit",
                "Not experienced with ropes in the mountains. Wouldn’t only one person be on the rope at a time? And I suppose a belayer maybe also somehow attached to the failure. \n\nBut then how could 3 of them have died because of an anchor failure?",
                "Any details of the mountain/route?  The only one in that area I’m familiar with is Shuksan.",
                "Rock climbing isn’t all that dangerous until it is, and then it’s usually fatal. Repelling even more so.",
                "Stop rock climbing people",
                "So these people risks their lives to have some fun? They should think about their families before doing that. I suppose that are their lives and it is their prerogative to take as much risks as they want."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Tory Lanez, in prison for Megan Thee Stallion shooting, hospitalized after attack by fellow inmate",
            "external_url": "https://abcnews.go.com/US/tory-lanez-prison-megan-thee-stallion-shooting-hospitalized/story?id=121729265",
            "upvotes": 1377,
            "date": "05/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/cb558451-cf1b-4a98-98dd-73533d4b8e1e/tory-lanez-ap-jef-250512_1747070335627_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Ah, too bad. I bet that hurt. Kinda like getting shot.",
                "Article by Deena Zaru and Alex Stone\n\n>Tory Lanez was hospitalized on Monday after a fellow inmate at the California Correctional Institution in Tehachapi attacked the rapper at around 7:20 a.m. local time, a spokesperson for the prison told ABC News.\n\n>\"Staff immediately responded, activated 911 and began medical aid. Peterson was subsequently transported to an outside medical facility for further treatment,\" the spokesperson said.\n\n>The rapper, whose legal name is Daystar Peterson, is serving a [10-year prison sentence](https://abcnews.go.com/US/rapper-tory-lanez-set-sentenced-shooting-injuring-megan/story?id=102070344) for shooting and injuring fellow hip-hop star Megan Thee Stallion, whose legal name is Megan Pete, in July 2020.\n\n>The prison spokesperson did not provide further comment when asked about the nature of Peterson's injuries, whether he has been released from the hospital or whether a suspect has been charged in the attack.\n\n>Crystal Morgan, an attorney representing Peterson, confirmed to ABC News that the rapper was attacked at the correctional facility and said that as of Monday afternoon he remains hospitalized.\n\n>Morgan said she has not been able to obtain any information about his injuries or his condition and is \"in the dark\" like everyone else. Morgan added she called Peterson's family to notify them of the attack.\n\n>The prison's Investigative Services Unit and the Kern County District Attorney's Office launched a probe into the incident, while the Office of the Inspector General has been notified, the spokesperson said.\n\n>ABC News has reached out to the DA's office for additional comment.\n\n>Peterson [was found guilty](https://abcnews.go.com/US/verdict-reached-trial-rapper-tory-lanez-charged-shooting/story?id=95723751) on Dec. 23, 2022, of three charges for shooting and injuring Pete in both feet as they left a party in the Hollywood Hills on July 12, 2020.\n\n>He was initially charged in October 2020 with one felony count each of assault with a semi-automatic firearm (personal use of a firearm) and carrying a loaded, unregistered firearm in a vehicle, according to charging documents obtained by ABC News.\n\n>He was also charged ahead of his trial in December 2022 with an additional felony count of discharging a firearm with gross negligence. Lanez, who chose not to take the witness stand during the trial, pleaded not guilty to all three charges.\n\n>His defense attorneys argued during the trial that Lanez was not the shooter and he has maintained his innocence in multiple social media posts since his sentencing last year.\n\n>During his sentencing hearing, prosecutors read an impact statement from Pete -- who testified during the trial -- in which she called for Peterson to \"be forced to face the full consequences of his heinous actions and face justice.\"\n\n>\"He not only shot me, he made a mockery of my trauma. He tried to position himself as a victim and set out to destroy my character and my soul,\" Pete said in her impact statement.\n\n>Peterson was denied bond by a Los Angeles County Superior Court judge on Sept. 14, 2023, as his [legal team appeals his 10-year sentence](https://abcnews.go.com/US/tory-lanez-denied-bond-appeals-10-year-sentence/story?id=103185176).",
                "Let me play a song on the world’s smallest violin",
                "I will never understand how one minute you can be at a mansion party in the pool with Meg Thee Stallion and Kylie Jenner, and the next you're facing 10 years in prison for shooting at said ~~females~~ women. That's not how my night would've went, IJS.",
                "Actions have consequences. Sometimes those consequences come with a bunkmate named Karma.",
                "Good. Fuck that bitch ass muthafucka.",
                "Kinda crazy to think I met this guy in Austin via a friend who’s a very close friend of Tory. \n\nI didn’t think he was that big.",
                "Yo, doesn't matter who, prison justice is still fucked up and, not saying you need to sympathize for him, but those cheering the news are gross.",
                "What the hell is it with rappers/hiphoppers shooting each other? Other music genres seem to have fewer issues like this....(though perhaps more issues with suicide).",
                "Finally some good news today!"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Argentina's top court finds 80 boxes of Nazi materials in its basement",
            "external_url": "https://www.reuters.com/world/americas/argentinas-top-court-finds-80-boxes-nazi-materials-its-basement-2025-05-12/",
            "upvotes": 1030,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They were just holding it for a friend",
                "\"Argentina's top court finds 80 boxes of Nazi materials in its basement\" in a later part of the announcement, \"It was immediately requested by the current US administration to be sent to the White House.\"",
                "For the people who need a TLDR:\n\nThese materials were confiscated during WWII. The government found these among materials coming in to the German Embassy. The authorities of Argentina were worried that this material might effect their neutrality so they put it in lockup.\n\nWhen they locked these up they had searched the boxes, and among the items found postcards, propaganda material, and other items that appeared to be geared towards spreading Nazi ideology in Argentina.\n\nSo yeah, overall, just a bunch of historical materials that were impounded and the owners never got them back because it was intended to promote fascism.",
                "We find the spread of Nazi propaganda all over the world these days just not usually the tangible results of it.",
                "Anything Kanye can use?",
                "I like how surprised everyone is acting when Argentina had a Fascist government allied with Nazi Germany.",
                "It’s Argentina I’m not surprised at all",
                "Well, it’s no wonder that it took 80yrs. We’ve since learned that important secret documents should be stored in bathrooms.",
                "We have top men working on it right now.",
                "BREAKING: Fork Found In Kitchen"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Trump calls for broad drug price cuts in executive order",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/trump-says-he-will-cut-drug-prices-by-59-2025-05-12/",
            "upvotes": 5283,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "[removed]",
                "“White House officials said the government will give drugmakers price targets in the next 30 days, and will take further action to lower prices if those companies do not make \"significant progress\" towards those goals within six months of the order being signed”\n\nPer usual, there is always some future date. Always a delay. Nothing will happen",
                "And then the drug manufacturers will raise their prices again.",
                "After he just got rid of Biden’s work to lower prices?\n\nIt never ends with this twat",
                "He did the same thing in his first term then never followed up on it. He also removed a Biden-era law that restricted insulin prices to $30, so he literally raised prices and is now acting like he’s saving us by lowering them back to Biden-era prices",
                "He should tariff them at 125% then lower it to 10%, then declare it a “total reset” and success, and hope nobody notices it is 10% higher than before.",
                "Executive orders require money to come from the executive branch for them to be enforced.  If dummy says a thing and then doesn't fund it, then he did nothing.  Alas, his idiot cult members don't know shit, so they'll listen when he lies that big pharma isn't heeding his EO.",
                "The executive order will make no difference.\n\nIndividuals don’t negotiate the prices of drugs, nor does the manufacturer sell directly to patients, nor are all drugs manufactured in the US, nor are all manufacturers US companies.\n\nThe problem isn’t necessarily the drug price *from the manufacturer*. It’s the three middlemen between the manufacturer and the patient, which the EO does not address.\n\nAssuming the EO is followed (it will not be, nor does it have to be), the drug manufacturer just needs to set the price to the lowest negotiated price (which it is probably already close to in most cases… as the PBM or wholesaler is already paying the manufacturer a comparable amount). But the EO doesn’t address what PBMs then turn around and charge the next middle man (doctor, hospital, pharmacy) before reaching the consumer, and doesn’t account for tossing health insurance companies in the mix.\n\nThe system is needlessly complex and fundamentally flawed (on purpose, to enrich shareholders of multiple entities between the drug’s point of origin and the consumer), and this EO doesn’t address any of that, thereby making it virtually ineffective.",
                "Didn’t he claim he was going to do this his first term too?",
                "“Man who turned off the overhead lights announces plan to light a candle soon.”"
            ],
            "aggregate_sentiment": 25.0
        },
        {
            "category": "HOT",
            "title": "Edan Alexander, U.S.-Israeli hostage, released after more than 19 months in captivity, Hamas says",
            "external_url": "https://www.cbsnews.com/news/edan-alexander-us-israeli-hostage-released-hamas-after-more-than-19-months-captivity/",
            "upvotes": 2451,
            "date": "05/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/12/9a3ce98b-616a-4de9-9f6d-156cdb148ce5/thumbnail/1200x630/0758355536b5340ff885c8019668d11f/gettyimages-2214166996.jpg?v=1706c0c091b9b085a70a8db995d9c23a",
            "top_comments": [
                "All it took to get a deal was Qatar gifting a plane to Trump.",
                "Man, comments are always so goddamn weird on threads like this. Astroturfing of all sorts along with a variety of genuine lunatics.",
                "i’m glad he’s going to get to see his family :)",
                "It's incredible any hostages are still alive. I dont even know where they are putting them. \n\nThis was a bit of good news to come out of Israel, so I thought I'd share it.\n\nHave an awesome day!",
                "[removed]",
                "This kids appearance is sure going to mess with some people’s narrative",
                "This article barely mentions that he's an active duty IDF soldier. The headline and photo make it seem like he's a teenage American tourist or something. ",
                "Good to see. He’s the one Corey Booker had a pin on for.",
                "[deleted]",
                "I need a therapist to even think about this guy surviving the ordeal he has been through."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "Trump fires director of U.S. Copyright Office, sources say",
            "external_url": "https://www.cbsnews.com/news/trump-fires-director-of-u-s-copyright-office-shira-perlmutter-sources/",
            "upvotes": 19751,
            "date": "05/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/10/a3bf9ec7-3ddf-4570-bdff-eafb746800a4/thumbnail/1200x630/4e1e701b4e0cf5c481072b89781d79bc/gettyimages-2213647884.jpg?v=1706c0c091b9b085a70a8db995d9c23a",
            "top_comments": [
                "\"...Perlmutter's firing was \"a brazen, unprecedented power grab with no legal basis.... surely no coincidence he acted less than a day after she refused to rubber-stamp Elon Musk's efforts to mine troves of copyrighted works to train AI models,\" in reference to the report released by the Copyright Office this week.  \n\nLast month, Musk took to his social media platform X to seemingly express support for the abolition of intellectual property laws...\"",
                "He sure is firing people left and right. Is there a website that tracks all the government heads that are being fired? I know I posted earlier that he fired the Librarian for Congress Friday. [https://federalnewsnetwork.com/workforce/2025/05/president-donald-trump-fires-librarian-of-congress-carla-hayden/](https://federalnewsnetwork.com/workforce/2025/05/president-donald-trump-fires-librarian-of-congress-carla-hayden/)\n\nEdit: Added another name and more details who has been fired..Earlier Thursday, the [acting administrator of the Federal Emergency Management Agency](https://apnews.com/article/fema-trump-administrator-replaced-emergency-b9ae5e6a7e1c09e51de99c5148f45eb2) was pushed out one day after he had testified that he did not agree with proposals to dismantle the organization. Trump has suggested that individual states, not FEMA, should take the lead on responding to hurricanes, tornadoes and other crises.\n\nAt the Pentagon, more than a half-dozen [top general officers have been fired](https://apnews.com/article/trump-brown-joint-chiefs-of-staff-firing-fa428cc1508a583b3bf5e7a5a58f6acf) since January, including the chairman of the Joint Chiefs of Staff, Gen. CQ Brown Jr. The only two women serving as four-star officers, as well as a disproportionate number of other senior female officers, have also been fired.",
                "We all know the intellectual property laws are only going to be suspended for the rich and corporations",
                "We're cooked.  Elon can just steal whatever he wants now",
                "Damn I was half joking when I said this office was going to be fired for denying Elons copyright claims and it happens less than a week later. This is going into banana republic levels of corruption.",
                "Strikes me as an admission that Elon's underlings weren't skilled enough to steal copyrighted work like every other major AI company does.",
                "Wasn’t this the issue that started the first Trade War with China?",
                "Trump, gutting US civilization.",
                "Musk had to stop the director’s report that his xAI training is copyright infringement.",
                "The Mouse is going to be angry!"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Rapper Tory Lanez recovering after being ‘stabbed 14 times’ as he serves time for Megan Thee Stallion shooting",
            "external_url": "https://www.cnn.com/2025/05/12/entertainment/rapper-tory-lanez-attacked-prison",
            "upvotes": 58,
            "date": "05/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap22358034499572.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Did they use a toothpick or something?",
                "Article by Lisa Respers France\n\n>Tory Lanez is “deeply thankful to God” and thanking his supporters after he was attacked Monday at a California prison where he’s serving a [10-year sentence](https://www.cnn.com/2023/08/08/entertainment/tory-lanez-sentence-megan-thee-stallion) for shooting hip-hop star [Megan Thee Stallion](https://www.cnn.com/2023/04/18/entertainment/megan-thee-stallion-tory-lanez-essay) in the feet.\n\n>A post on his verified social media on Monday shared that Lanez, who was born Daystar Peterson, was “stabbed 14 times- including 7 wounds to his back, 4 to his torso, 2 to the back of his head, and 1 to the left side of his face.”\n\n>“Both of his lungs collapsed, and he was placed on a breathing apparatus,” the post read. “He is now breathing on his own.”\n\n>According to the post, “Despite being in pain, he is talking normally, in good spirits, and deeply thankful to God that he is pulling through.”\n\n>“He also wants to thank everyone for their continued prayers and support,” the post concluded.\n\n>CNN has reached out to reps for Lanez for comment.\n\n>The [Associated Press](https://apnews.com/article/tory-lanez-attacked-prison-megan-thee-stallion-53ada101c5a14dfc5b1c16049f14bbaf) reported that the Canadian artist was attacked at a housing unit at the California Correctional Institution in Tehachapi at about 7:20 a.m. according to Pedro Calderon Michel, spokesman for the state Department of Corrections and Rehabilitation.\n\n>Staff immediately gave Lanez medical aid and called 911, and he was taken to an outside hospital, Michel said. The prison’s investigative unit and the Kern County District Attorney’s Office are investigating, he said.\n\n>In December 2022, [a Los Angeles jury found Lanez guilty of three charges](https://www.cnn.com/2023/08/08/entertainment/tory-lanez-sentence-megan-thee-stallion) related to the July 2020 shooting of fellow rapper Megan Thee Stallion whose legal name is Megan Pete.\n\n>She testified during the trial that she and Lanez had left a party at Kylie Jenner’s Hollywood Hills home in July 2020 when Lanez fired a gun at the back of her feet and ordered her to dance. She said the shooting occurred after they argued and she exited the SUV in which they had been traveling.\n\n>“Every day I think of others across the world who are victims of violence and survive. It is truly the most powerless feeling, especially when you question whether the justice system can truly protect you,” she said in a statement which LA County District Attorney George Gascón read at a press conference following Lanez’s conviction. “Fortunately, the district attorney’s office fought for me. I’m incredibly grateful to them and the jury for the attention to the evidence and siding with the truth. But if it can happen to me, imagine those who lack the resources and support systems to help them.”\n\n>Lanez has insisted on his innocence and his lawyers appealed his conviction. In May 2023 a judge denied a motion for him to receive a new trial. The star’s legal team had argued that some of the evidence presented had wrongly been admitted into the trial.",
                "CNN covering this story like it’s ground shaking is the real story.\nAnytime Trump gets closer to breaking the democracy in America. This is what becomes breaking news.",
                "I. Don't. Care. Why is this story being posted/reposted literally on every sub & front page on Reddit in the last 12 hours? This fucking loser nobody getting stabbed in prison is not news. You'd think we were starving for news elsewhere in the world. (EDIT: LOL to the person who reported me to Reddit Care. I'm kinda impressed with the level of trolling tbh. I mean, someone in the world dares to say they're not interested in this US 'news' non-story and this is the reaction. Fucking LOL)",
                "I guess he made angry the wrong person in prison. Anyway, who is he?",
                "Well, now he knows what Meghan went through. I wonder if his attackers were Meghan Thee Stallion fans.",
                "Fake stabbings for street cred. I have seen it so many times before."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Train service disrupted in Baltimore due to large warehouse fire",
            "external_url": "https://www.cnn.com/2025/05/13/us/fire-baltimore-mattress-warehouse-halts-trains-hnk",
            "upvotes": 56,
            "date": "05/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21619045-245138-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Was it another container ship?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Possible anchoring failure leaves 3 climbers dead in Washington state",
            "external_url": "https://www.cnn.com/2025/05/12/us/north-cascades-climbers-death",
            "upvotes": 796,
            "date": "05/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/496263129-1102854608546908-5906308397723621896-n.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "*Article Text:*\n\nThree people died and one other person was able to free themself during a climbing accident in Washington state, authorities said Monday.\n\nAuthorities responded to the scene Sunday as the victims had fallen “while descending a steep gully” in the North Cascades, the Okanogan County Sheriff’s Office said. Authorities said they believe a part of their anchoring system failed.\n\n“Three individuals were confirmed deceased at the accident site. The fourth member of the party self-extricated and contacted law enforcement,” the Okanogan County Sheriff’s Office said of the four climbers from Renton.\n\nThose killed were ages 36, 47 and 63, according to the office.\n\n“The presumed cause of the accident is an anchor failure while rappelling, with more investigation still ongoing,” the sheriff’s office added.\n\nThe climbers were in the area of North Early Winters Spire when the accident occurred, authorities said. The site is about 16 miles west of Mazama.",
                "*A fourth climber sustained internal bleeding and a traumatic brain injury in the fall, but survived. He walked back to the trailhead just east of Washington Pass and drove to Newhalem, where he used a pay phone to call 911 at about 11:30 a.m. Sunday.*\n\nImagine if all 4 lived through the failure, and none could walk to the trailhead and then drive to the pay phone. Actually, it's possible one or two were still alive but died because of no cell coverage in the mountains.",
                "Damn, that sucks.\n\nJust goes to show that any mountain can be deadly if your luck or preparation are bad enough. Safety in mountaineering is nothing to take lightly.",
                "Damn a rap anchor failed. Scary shit",
                "Not experienced with ropes in the mountains. Wouldn’t only one person be on the rope at a time? And I suppose a belayer maybe also somehow attached to the failure. \n\nBut then how could 3 of them have died because of an anchor failure?",
                "Any details of the mountain/route?  The only one in that area I’m familiar with is Shuksan.",
                "Rock climbing isn’t all that dangerous until it is, and then it’s usually fatal. Repelling even more so.",
                "Stop rock climbing people",
                "So these people risks their lives to have some fun? They should think about their families before doing that. I suppose that are their lives and it is their prerogative to take as much risks as they want."
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "NEW",
            "title": "Federal judge won’t block Trump’s plan to use IRS data to track down undocumented migrants",
            "external_url": "https://www.cnn.com/2025/05/12/politics/judge-wont-block-irs-data-sharing-track-undocumented-migrants",
            "upvotes": 2321,
            "date": "05/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-20t181645z-962444936-rc2hycat9wtc-rtrmadp-3-usa-trump-irs.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Literally telling immigrants to not pay taxes.",
                "But wait, one of their big things is \"immigrants don't pay taxes.\" Why would there be records at the IRS?",
                "This is very likely to get overturned on appeal by the DC Circuit if it makes it to non-Trump judges, both Republican and Democrat judges. The privacy laws of the tax code are pretty damn solid in what can be disclosed.",
                "Trump et al. said undocumented immigrants don't pay taxes. Just another con.",
                "You mean someone's paying them to work?",
                "Using documentation to find undocumented migrants is oxymoronic",
                "So they are going to forgo $96 BILLION in taxes to maybe deport a few thousand TAX-PAYING undocumented workers? A few of whom might be accused criminal activity? \n\nGreat. Sounds very fiscally responsible. ",
                "I did taxes. If the axiom of \"the IRS doesn't care how you get money as long as you pay them\" no longer holds true, then shit's gonna crumble.",
                "They are tracking us ALL down",
                "And for some reasons we can't see his tax records."
            ],
            "aggregate_sentiment": 15.0
        },
        {
            "category": "NEW",
            "title": "Argentina's top court finds 80 boxes of Nazi materials in its basement",
            "external_url": "https://www.reuters.com/world/americas/argentinas-top-court-finds-80-boxes-nazi-materials-its-basement-2025-05-12/",
            "upvotes": 1026,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They were just holding it for a friend",
                "\"Argentina's top court finds 80 boxes of Nazi materials in its basement\" in a later part of the announcement, \"It was immediately requested by the current US administration to be sent to the White House.\"",
                "For the people who need a TLDR:\n\nThese materials were confiscated during WWII. The government found these among materials coming in to the German Embassy. The authorities of Argentina were worried that this material might effect their neutrality so they put it in lockup.\n\nWhen they locked these up they had searched the boxes, and among the items found postcards, propaganda material, and other items that appeared to be geared towards spreading Nazi ideology in Argentina.\n\nSo yeah, overall, just a bunch of historical materials that were impounded and the owners never got them back because it was intended to promote fascism.",
                "We find the spread of Nazi propaganda all over the world these days just not usually the tangible results of it.",
                "Anything Kanye can use?",
                "I like how surprised everyone is acting when Argentina had a Fascist government allied with Nazi Germany.",
                "It’s Argentina I’m not surprised at all",
                "Well, it’s no wonder that it took 80yrs. We’ve since learned that important secret documents should be stored in bathrooms.",
                "We have top men working on it right now.",
                "BREAKING: Fork Found In Kitchen"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Tory Lanez, in prison for Megan Thee Stallion shooting, hospitalized after attack by fellow inmate",
            "external_url": "https://abcnews.go.com/US/tory-lanez-prison-megan-thee-stallion-shooting-hospitalized/story?id=121729265",
            "upvotes": 1385,
            "date": "05/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/cb558451-cf1b-4a98-98dd-73533d4b8e1e/tory-lanez-ap-jef-250512_1747070335627_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Ah, too bad. I bet that hurt. Kinda like getting shot.",
                "Article by Deena Zaru and Alex Stone\n\n>Tory Lanez was hospitalized on Monday after a fellow inmate at the California Correctional Institution in Tehachapi attacked the rapper at around 7:20 a.m. local time, a spokesperson for the prison told ABC News.\n\n>\"Staff immediately responded, activated 911 and began medical aid. Peterson was subsequently transported to an outside medical facility for further treatment,\" the spokesperson said.\n\n>The rapper, whose legal name is Daystar Peterson, is serving a [10-year prison sentence](https://abcnews.go.com/US/rapper-tory-lanez-set-sentenced-shooting-injuring-megan/story?id=102070344) for shooting and injuring fellow hip-hop star Megan Thee Stallion, whose legal name is Megan Pete, in July 2020.\n\n>The prison spokesperson did not provide further comment when asked about the nature of Peterson's injuries, whether he has been released from the hospital or whether a suspect has been charged in the attack.\n\n>Crystal Morgan, an attorney representing Peterson, confirmed to ABC News that the rapper was attacked at the correctional facility and said that as of Monday afternoon he remains hospitalized.\n\n>Morgan said she has not been able to obtain any information about his injuries or his condition and is \"in the dark\" like everyone else. Morgan added she called Peterson's family to notify them of the attack.\n\n>The prison's Investigative Services Unit and the Kern County District Attorney's Office launched a probe into the incident, while the Office of the Inspector General has been notified, the spokesperson said.\n\n>ABC News has reached out to the DA's office for additional comment.\n\n>Peterson [was found guilty](https://abcnews.go.com/US/verdict-reached-trial-rapper-tory-lanez-charged-shooting/story?id=95723751) on Dec. 23, 2022, of three charges for shooting and injuring Pete in both feet as they left a party in the Hollywood Hills on July 12, 2020.\n\n>He was initially charged in October 2020 with one felony count each of assault with a semi-automatic firearm (personal use of a firearm) and carrying a loaded, unregistered firearm in a vehicle, according to charging documents obtained by ABC News.\n\n>He was also charged ahead of his trial in December 2022 with an additional felony count of discharging a firearm with gross negligence. Lanez, who chose not to take the witness stand during the trial, pleaded not guilty to all three charges.\n\n>His defense attorneys argued during the trial that Lanez was not the shooter and he has maintained his innocence in multiple social media posts since his sentencing last year.\n\n>During his sentencing hearing, prosecutors read an impact statement from Pete -- who testified during the trial -- in which she called for Peterson to \"be forced to face the full consequences of his heinous actions and face justice.\"\n\n>\"He not only shot me, he made a mockery of my trauma. He tried to position himself as a victim and set out to destroy my character and my soul,\" Pete said in her impact statement.\n\n>Peterson was denied bond by a Los Angeles County Superior Court judge on Sept. 14, 2023, as his [legal team appeals his 10-year sentence](https://abcnews.go.com/US/tory-lanez-denied-bond-appeals-10-year-sentence/story?id=103185176).",
                "Let me play a song on the world’s smallest violin",
                "I will never understand how one minute you can be at a mansion party in the pool with Meg Thee Stallion and Kylie Jenner, and the next you're facing 10 years in prison for shooting at said ~~females~~ women. That's not how my night would've went, IJS.",
                "Actions have consequences. Sometimes those consequences come with a bunkmate named Karma.",
                "Good. Fuck that bitch ass muthafucka.",
                "Kinda crazy to think I met this guy in Austin via a friend who’s a very close friend of Tory. \n\nI didn’t think he was that big.",
                "Yo, doesn't matter who, prison justice is still fucked up and, not saying you need to sympathize for him, but those cheering the news are gross.",
                "What the hell is it with rappers/hiphoppers shooting each other? Other music genres seem to have fewer issues like this....(though perhaps more issues with suicide).",
                "Finally some good news today!"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Taliban adds chess to ever-growing list of things banned in Afghanistan",
            "external_url": "https://globalnews.ca/news/11175560/taliban-chess-banned-afghanistan/",
            "upvotes": 3480,
            "date": "05/12/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/05/GettyImages-1241640843.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "Someone high up in the Taliban lost a game to one of the kids they were molesting.",
                "Robin Williams had a joke that went like:\n\nYou can’t bomb the Taliban back to the Stone Age because they’ll go, “Oh! Upgrade!”",
                "just outlaw thinking and get it over with. ",
                "Some dude lost to a woman in chess, huh",
                "It’s wild that they banned chess, especially considering how deep its roots are in the Islamic world. \n\nWhile the game originated in India (as chaturanga), it was the Islamic Golden Age that helped spread and refine it across the Middle East, North Africa, and eventually into Europe. Scholars, caliphs, and poets all engaged with chess—not just as entertainment, but as a symbol of intellect and strategy. There are even surviving manuscripts from medieval Islamic scholars analyzing chess theory. In some courts, being good at chess was a mark of education and refinement. \n\nBanning it under the idea that it’s “un-Islamic” is completely ahistorical—it’s like banning algebra because it’s not “aligned with sharia,” even though al-jabr (algebra) literally came from Muslim mathematicians.",
                "Some of the other things recently banned in Afghanistan, as mentioned in the article:  \n\n\n>The move to ban chess comes just months after the Taliban banned free fighting, such as mixed martial arts, saying it was not aligned with sharia (Islamic law) and was too “violent.” The banning of MMA followed a 2021 law that prohibited “face-punching.”\n\n>Last October, the Taliban issued a decree that [prohibits women from praying aloud](https://globalnews.ca/news/10841150/taliban-women-morality-laws-praying-voices/) or reciting the Qur’an in each other’s presence. Two months earlier, in August 2024, they issued laws [making it mandatory](https://globalnews.ca/news/10712505/taliban-bans-womens-voices-faces-laws/) for women to veil their entire bodies, including their faces, at all times in public. Women were also forbidden from singing, reciting and reading aloud in public, as a woman’s voice is deemed “intimate” and should not be heard.\n\n>Women are already excluded from education after sixth grade, many public spaces and most jobs. They are also prohibited from looking at men they are not related to by blood or marriage.",
                "When you are so fkn miserable you have to make sure everyone is else too.",
                "That's just fucking embarrassing for the Taliban",
                "Chess involves forward thinking, strategy, and trying to figure out your opponents next move. Of course they wouldn't want that.",
                "Why are they even bothered to be alive they seem to want to ban everything I don't get why they continue to exist."
            ],
            "aggregate_sentiment": 11.0
        },
        {
            "category": "NEW",
            "title": "Olympic gold medalist, NCAA champion wrestler arrested in prostitution sting",
            "external_url": "https://www.pennlive.com/sports/2025/05/olympic-gold-medalist-ncaa-champion-wrestler-arrested-in-prostitution-sting.html",
            "upvotes": 7281,
            "date": "05/12/2025",
            "thumbnail": "https://www.pennlive.com/resizer/v2/LOD43AX2ZBAAJJ2YFZLUHRX77U.jpg?auth=c9155d8d33782c20a9b1aa1c78e2b7adfc9a3bd2c2c3387432ea8a312e510033&width=1280&quality=90",
            "top_comments": [
                "> According to the news station, Snyder allegedly started calling and texting about an ad for prostitution. He is accused of meeting at a hotel with an undercover officer, exchanging cash and requesting a sexual act.\n\nWow, great job everyone. You caught him! Resources well spent. Another violent criminal off the streets. \n\nNow if you’ll excuse me, I’m off to watch another video on pornhub where this exact scenario is legal as long as it’s filmed!",
                "He just tried to pay money for a prostitute. I’m sure a problem for his wife and a problem for his Christian camp affiliations but not a problem for me",
                "Damn even an Olympic champion can’t get laid naturally. Guess I’ll just stick to my left hand",
                "Doesn't sound like anything worth taxpayer money or publication. Only unfortunate detail:\n\n>Kyle Snyder is married to former Syracuse soccer player Maddie Pack Snyder.   \n\nAnd one I'm ambivalent about:\n \n> Snyder also holds a summer camp at Messiah University -- a private Christian School in Mechanicsburg, Pennsylvania. The camp is slated to be held June 20-23.",
                "Consensual sex with a grown adult? FOR SHAME",
                "Probably just wanted to practice some new holds",
                "Shoulda used campaign funds to pay for it then it would have been legal apparently?",
                "Prostitution is a human inevitability. The concept is a constant throughout human history and developed in multiple, separate, and exclusive civilizations. \n\nIt will never stop. It will never go away. \n\nLegalize it and allow these individuals to be treated like any other business. Cut the shit.",
                "Meanwhile, the US president....",
                "Instead of catching adults having sex with each other for money, they should focus on catching adults who mess with children"
            ],
            "aggregate_sentiment": 70.0
        },
        {
            "category": "NEW",
            "title": "Top UK Special Forces general oversaw blocking of Afghan 'war-crime' witnesses to Britain",
            "external_url": "https://www.bbc.com/news/articles/cp3q5xl9wqwo",
            "upvotes": 598,
            "date": "05/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/105f/live/08d6ac50-2cd8-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "People were tortured to death so this guy could save his career. I don't know UK law or whether this is considered criminal, but it's heinous conduct that should be something you end up in prison for.",
                "\"...\n\nThousands of applications from individuals with credible evidence of service with Afghan Special Forces, including the units known as the Triples, were then rejected, leaving many of the former commandos at the mercy of the Taliban.\n\n...\n\nIf the Afghan commandos were in the UK, they could be called as witnesses - but the inquiry has no power to compel testimony from foreign nationals who are overseas.\n\nSome of those denied visas were subsequently tortured and killed by the Taliban, according to former colleagues, family members and lawyer.\n\n...\n\nPanorama has now heard eyewitness testimony from veterans who served in UK Special Forces detailing alleged war crimes stretching over more than a decade and involving the SBS as well as the SAS.\n\n ...\n\nAsked by Panorama about the government's rejection of Triples' applications, Bruce Houlder KC, who as a former director of service prosecutions was responsible for bringing charges against members of the armed forces, said the government must have known the Triples would have \"highly relevant\" evidence that would be \"much easier to obtain\" if they were in the UK.\n\n...\"",
                "Looks like this story might have some legs.",
                "War criminals like Bush, Cheney, Rumsfeld, were allowed to get away with war crimes with barely a wisp from the DNC when powerful democrats were implicated.  Decades later its the same deal with Gen Jenkins failing to report war crimes. Tony Blair may as well be back in power.",
                "Jesus Christ, this is fucking disgusting. Afghans died because some fucking assholes didn't want to taint the good name of SAS. Fuck me, were supposed to be better than this.",
                "I wonder whether GB News will give this any coverage. After all these men would be denied asylum if that lot had their way."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Edan Alexander, U.S.-Israeli hostage, released after more than 19 months in captivity, Hamas says",
            "external_url": "https://www.cbsnews.com/news/edan-alexander-us-israeli-hostage-released-hamas-after-more-than-19-months-captivity/",
            "upvotes": 2456,
            "date": "05/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/12/9a3ce98b-616a-4de9-9f6d-156cdb148ce5/thumbnail/1200x630/0758355536b5340ff885c8019668d11f/gettyimages-2214166996.jpg?v=1706c0c091b9b085a70a8db995d9c23a",
            "top_comments": [
                "All it took to get a deal was Qatar gifting a plane to Trump.",
                "Man, comments are always so goddamn weird on threads like this. Astroturfing of all sorts along with a variety of genuine lunatics.",
                "i’m glad he’s going to get to see his family :)",
                "It's incredible any hostages are still alive. I dont even know where they are putting them. \n\nThis was a bit of good news to come out of Israel, so I thought I'd share it.\n\nHave an awesome day!",
                "[removed]",
                "This kids appearance is sure going to mess with some people’s narrative",
                "This article barely mentions that he's an active duty IDF soldier. The headline and photo make it seem like he's a teenage American tourist or something. ",
                "Good to see. He’s the one Corey Booker had a pin on for.",
                "[deleted]",
                "I need a therapist to even think about this guy surviving the ordeal he has been through."
            ],
            "aggregate_sentiment": 25.0
        },
        {
            "category": "RISING",
            "title": "Federal judge won’t block Trump’s plan to use IRS data to track down undocumented migrants",
            "external_url": "https://www.cnn.com/2025/05/12/politics/judge-wont-block-irs-data-sharing-track-undocumented-migrants",
            "upvotes": 2322,
            "date": "05/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-20t181645z-962444936-rc2hycat9wtc-rtrmadp-3-usa-trump-irs.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Literally telling immigrants to not pay taxes.",
                "But wait, one of their big things is \"immigrants don't pay taxes.\" Why would there be records at the IRS?",
                "This is very likely to get overturned on appeal by the DC Circuit if it makes it to non-Trump judges, both Republican and Democrat judges. The privacy laws of the tax code are pretty damn solid in what can be disclosed.",
                "Trump et al. said undocumented immigrants don't pay taxes. Just another con.",
                "You mean someone's paying them to work?",
                "Using documentation to find undocumented migrants is oxymoronic",
                "So they are going to forgo $96 BILLION in taxes to maybe deport a few thousand TAX-PAYING undocumented workers? A few of whom might be accused criminal activity? \n\nGreat. Sounds very fiscally responsible. ",
                "I did taxes. If the axiom of \"the IRS doesn't care how you get money as long as you pay them\" no longer holds true, then shit's gonna crumble.",
                "They are tracking us ALL down",
                "And for some reasons we can't see his tax records."
            ],
            "aggregate_sentiment": 26.0
        },
        {
            "category": "RISING",
            "title": "Argentina's top court finds 80 boxes of Nazi materials in its basement",
            "external_url": "https://www.reuters.com/world/americas/argentinas-top-court-finds-80-boxes-nazi-materials-its-basement-2025-05-12/",
            "upvotes": 1030,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They were just holding it for a friend",
                "\"Argentina's top court finds 80 boxes of Nazi materials in its basement\" in a later part of the announcement, \"It was immediately requested by the current US administration to be sent to the White House.\"",
                "For the people who need a TLDR:\n\nThese materials were confiscated during WWII. The government found these among materials coming in to the German Embassy. The authorities of Argentina were worried that this material might effect their neutrality so they put it in lockup.\n\nWhen they locked these up they had searched the boxes, and among the items found postcards, propaganda material, and other items that appeared to be geared towards spreading Nazi ideology in Argentina.\n\nSo yeah, overall, just a bunch of historical materials that were impounded and the owners never got them back because it was intended to promote fascism.",
                "We find the spread of Nazi propaganda all over the world these days just not usually the tangible results of it.",
                "Anything Kanye can use?",
                "I like how surprised everyone is acting when Argentina had a Fascist government allied with Nazi Germany.",
                "It’s Argentina I’m not surprised at all",
                "Well, it’s no wonder that it took 80yrs. We’ve since learned that important secret documents should be stored in bathrooms.",
                "We have top men working on it right now.",
                "BREAKING: Fork Found In Kitchen"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Taliban adds chess to ever-growing list of things banned in Afghanistan",
            "external_url": "https://globalnews.ca/news/11175560/taliban-chess-banned-afghanistan/",
            "upvotes": 3475,
            "date": "05/12/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/05/GettyImages-1241640843.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "Someone high up in the Taliban lost a game to one of the kids they were molesting.",
                "Robin Williams had a joke that went like:\n\nYou can’t bomb the Taliban back to the Stone Age because they’ll go, “Oh! Upgrade!”",
                "just outlaw thinking and get it over with. ",
                "Some dude lost to a woman in chess, huh",
                "It’s wild that they banned chess, especially considering how deep its roots are in the Islamic world. \n\nWhile the game originated in India (as chaturanga), it was the Islamic Golden Age that helped spread and refine it across the Middle East, North Africa, and eventually into Europe. Scholars, caliphs, and poets all engaged with chess—not just as entertainment, but as a symbol of intellect and strategy. There are even surviving manuscripts from medieval Islamic scholars analyzing chess theory. In some courts, being good at chess was a mark of education and refinement. \n\nBanning it under the idea that it’s “un-Islamic” is completely ahistorical—it’s like banning algebra because it’s not “aligned with sharia,” even though al-jabr (algebra) literally came from Muslim mathematicians.",
                "Some of the other things recently banned in Afghanistan, as mentioned in the article:  \n\n\n>The move to ban chess comes just months after the Taliban banned free fighting, such as mixed martial arts, saying it was not aligned with sharia (Islamic law) and was too “violent.” The banning of MMA followed a 2021 law that prohibited “face-punching.”\n\n>Last October, the Taliban issued a decree that [prohibits women from praying aloud](https://globalnews.ca/news/10841150/taliban-women-morality-laws-praying-voices/) or reciting the Qur’an in each other’s presence. Two months earlier, in August 2024, they issued laws [making it mandatory](https://globalnews.ca/news/10712505/taliban-bans-womens-voices-faces-laws/) for women to veil their entire bodies, including their faces, at all times in public. Women were also forbidden from singing, reciting and reading aloud in public, as a woman’s voice is deemed “intimate” and should not be heard.\n\n>Women are already excluded from education after sixth grade, many public spaces and most jobs. They are also prohibited from looking at men they are not related to by blood or marriage.",
                "When you are so fkn miserable you have to make sure everyone is else too.",
                "That's just fucking embarrassing for the Taliban",
                "Chess involves forward thinking, strategy, and trying to figure out your opponents next move. Of course they wouldn't want that.",
                "Why are they even bothered to be alive they seem to want to ban everything I don't get why they continue to exist."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Possible anchoring failure leaves 3 climbers dead in Washington state",
            "external_url": "https://www.cnn.com/2025/05/12/us/north-cascades-climbers-death",
            "upvotes": 791,
            "date": "05/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/496263129-1102854608546908-5906308397723621896-n.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "*Article Text:*\n\nThree people died and one other person was able to free themself during a climbing accident in Washington state, authorities said Monday.\n\nAuthorities responded to the scene Sunday as the victims had fallen “while descending a steep gully” in the North Cascades, the Okanogan County Sheriff’s Office said. Authorities said they believe a part of their anchoring system failed.\n\n“Three individuals were confirmed deceased at the accident site. The fourth member of the party self-extricated and contacted law enforcement,” the Okanogan County Sheriff’s Office said of the four climbers from Renton.\n\nThose killed were ages 36, 47 and 63, according to the office.\n\n“The presumed cause of the accident is an anchor failure while rappelling, with more investigation still ongoing,” the sheriff’s office added.\n\nThe climbers were in the area of North Early Winters Spire when the accident occurred, authorities said. The site is about 16 miles west of Mazama.",
                "*A fourth climber sustained internal bleeding and a traumatic brain injury in the fall, but survived. He walked back to the trailhead just east of Washington Pass and drove to Newhalem, where he used a pay phone to call 911 at about 11:30 a.m. Sunday.*\n\nImagine if all 4 lived through the failure, and none could walk to the trailhead and then drive to the pay phone. Actually, it's possible one or two were still alive but died because of no cell coverage in the mountains.",
                "Damn, that sucks.\n\nJust goes to show that any mountain can be deadly if your luck or preparation are bad enough. Safety in mountaineering is nothing to take lightly.",
                "Damn a rap anchor failed. Scary shit",
                "Not experienced with ropes in the mountains. Wouldn’t only one person be on the rope at a time? And I suppose a belayer maybe also somehow attached to the failure. \n\nBut then how could 3 of them have died because of an anchor failure?",
                "Any details of the mountain/route?  The only one in that area I’m familiar with is Shuksan.",
                "Rock climbing isn’t all that dangerous until it is, and then it’s usually fatal. Repelling even more so.",
                "Stop rock climbing people",
                "So these people risks their lives to have some fun? They should think about their families before doing that. I suppose that are their lives and it is their prerogative to take as much risks as they want."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Tory Lanez, in prison for Megan Thee Stallion shooting, hospitalized after attack by fellow inmate",
            "external_url": "https://abcnews.go.com/US/tory-lanez-prison-megan-thee-stallion-shooting-hospitalized/story?id=121729265",
            "upvotes": 1387,
            "date": "05/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/cb558451-cf1b-4a98-98dd-73533d4b8e1e/tory-lanez-ap-jef-250512_1747070335627_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Ah, too bad. I bet that hurt. Kinda like getting shot.",
                "Article by Deena Zaru and Alex Stone\n\n>Tory Lanez was hospitalized on Monday after a fellow inmate at the California Correctional Institution in Tehachapi attacked the rapper at around 7:20 a.m. local time, a spokesperson for the prison told ABC News.\n\n>\"Staff immediately responded, activated 911 and began medical aid. Peterson was subsequently transported to an outside medical facility for further treatment,\" the spokesperson said.\n\n>The rapper, whose legal name is Daystar Peterson, is serving a [10-year prison sentence](https://abcnews.go.com/US/rapper-tory-lanez-set-sentenced-shooting-injuring-megan/story?id=102070344) for shooting and injuring fellow hip-hop star Megan Thee Stallion, whose legal name is Megan Pete, in July 2020.\n\n>The prison spokesperson did not provide further comment when asked about the nature of Peterson's injuries, whether he has been released from the hospital or whether a suspect has been charged in the attack.\n\n>Crystal Morgan, an attorney representing Peterson, confirmed to ABC News that the rapper was attacked at the correctional facility and said that as of Monday afternoon he remains hospitalized.\n\n>Morgan said she has not been able to obtain any information about his injuries or his condition and is \"in the dark\" like everyone else. Morgan added she called Peterson's family to notify them of the attack.\n\n>The prison's Investigative Services Unit and the Kern County District Attorney's Office launched a probe into the incident, while the Office of the Inspector General has been notified, the spokesperson said.\n\n>ABC News has reached out to the DA's office for additional comment.\n\n>Peterson [was found guilty](https://abcnews.go.com/US/verdict-reached-trial-rapper-tory-lanez-charged-shooting/story?id=95723751) on Dec. 23, 2022, of three charges for shooting and injuring Pete in both feet as they left a party in the Hollywood Hills on July 12, 2020.\n\n>He was initially charged in October 2020 with one felony count each of assault with a semi-automatic firearm (personal use of a firearm) and carrying a loaded, unregistered firearm in a vehicle, according to charging documents obtained by ABC News.\n\n>He was also charged ahead of his trial in December 2022 with an additional felony count of discharging a firearm with gross negligence. Lanez, who chose not to take the witness stand during the trial, pleaded not guilty to all three charges.\n\n>His defense attorneys argued during the trial that Lanez was not the shooter and he has maintained his innocence in multiple social media posts since his sentencing last year.\n\n>During his sentencing hearing, prosecutors read an impact statement from Pete -- who testified during the trial -- in which she called for Peterson to \"be forced to face the full consequences of his heinous actions and face justice.\"\n\n>\"He not only shot me, he made a mockery of my trauma. He tried to position himself as a victim and set out to destroy my character and my soul,\" Pete said in her impact statement.\n\n>Peterson was denied bond by a Los Angeles County Superior Court judge on Sept. 14, 2023, as his [legal team appeals his 10-year sentence](https://abcnews.go.com/US/tory-lanez-denied-bond-appeals-10-year-sentence/story?id=103185176).",
                "Let me play a song on the world’s smallest violin",
                "I will never understand how one minute you can be at a mansion party in the pool with Meg Thee Stallion and Kylie Jenner, and the next you're facing 10 years in prison for shooting at said ~~females~~ women. That's not how my night would've went, IJS.",
                "Actions have consequences. Sometimes those consequences come with a bunkmate named Karma.",
                "Good. Fuck that bitch ass muthafucka.",
                "Kinda crazy to think I met this guy in Austin via a friend who’s a very close friend of Tory. \n\nI didn’t think he was that big.",
                "Yo, doesn't matter who, prison justice is still fucked up and, not saying you need to sympathize for him, but those cheering the news are gross.",
                "What the hell is it with rappers/hiphoppers shooting each other? Other music genres seem to have fewer issues like this....(though perhaps more issues with suicide).",
                "Finally some good news today!"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Olympic gold medalist, NCAA champion wrestler arrested in prostitution sting",
            "external_url": "https://www.pennlive.com/sports/2025/05/olympic-gold-medalist-ncaa-champion-wrestler-arrested-in-prostitution-sting.html",
            "upvotes": 7289,
            "date": "05/12/2025",
            "thumbnail": "https://www.pennlive.com/resizer/v2/LOD43AX2ZBAAJJ2YFZLUHRX77U.jpg?auth=c9155d8d33782c20a9b1aa1c78e2b7adfc9a3bd2c2c3387432ea8a312e510033&width=1280&quality=90",
            "top_comments": [
                "> According to the news station, Snyder allegedly started calling and texting about an ad for prostitution. He is accused of meeting at a hotel with an undercover officer, exchanging cash and requesting a sexual act.\n\nWow, great job everyone. You caught him! Resources well spent. Another violent criminal off the streets. \n\nNow if you’ll excuse me, I’m off to watch another video on pornhub where this exact scenario is legal as long as it’s filmed!",
                "He just tried to pay money for a prostitute. I’m sure a problem for his wife and a problem for his Christian camp affiliations but not a problem for me",
                "Damn even an Olympic champion can’t get laid naturally. Guess I’ll just stick to my left hand",
                "Doesn't sound like anything worth taxpayer money or publication. Only unfortunate detail:\n\n>Kyle Snyder is married to former Syracuse soccer player Maddie Pack Snyder.   \n\nAnd one I'm ambivalent about:\n \n> Snyder also holds a summer camp at Messiah University -- a private Christian School in Mechanicsburg, Pennsylvania. The camp is slated to be held June 20-23.",
                "Consensual sex with a grown adult? FOR SHAME",
                "Probably just wanted to practice some new holds",
                "Shoulda used campaign funds to pay for it then it would have been legal apparently?",
                "Prostitution is a human inevitability. The concept is a constant throughout human history and developed in multiple, separate, and exclusive civilizations. \n\nIt will never stop. It will never go away. \n\nLegalize it and allow these individuals to be treated like any other business. Cut the shit.",
                "Meanwhile, the US president....",
                "Instead of catching adults having sex with each other for money, they should focus on catching adults who mess with children"
            ],
            "aggregate_sentiment": 64.0
        },
        {
            "category": "RISING",
            "title": "Georgia become second US state to shield maker of Roundup weed killer from some cancer claims",
            "external_url": "https://apnews.com/article/bayer-roundup-weed-killer-pesticides-cancer-lawsuits-02020b62e2c0affbeccf464677fec871",
            "upvotes": 12073,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "FYI, the other state is North Dakota",
                ">Bayer insists glyphosate is safe. But it has stopped using the ingredient in its residential version of Roundup and has set aside $16 billion to settle cases. It continues to use glyphosate in its agricultural version of Roundup but has warned that it might have to stop doing so if the legal costs keep mounting.\n\nDoesn't sound like it's safe to me.",
                "We don't need to be giving giant companies shields like that. We also don't need a jury deciding what causes cancer when the scientific results aren't there.",
                "Georgia is also the state where prosecutors have absolute immunity. If they lie or break the law to convict you, they face no consequences whatsoever and cannot be sued for their misconduct. I feel terrible for people stuck there with MTG",
                "Bayer is the beneficiary. Bayer is not a farmer. \n\n> The new law “demonstrates that Georgia stands with its farmers, who work tirelessly to produce safe and affordable food,” said Brian Naber, president of Bayer’s crop sciences in North America, Australia and New Zealand.",
                "Georgia becomes second state to give Monsanto immunity.",
                "In the landscaping business we thought we knew that when Roundup was banned in France, the bees came back.  But when I went to go look that up all I could find was clouds and clouds of professionally planted disinformation.\n\nSo I still believe it.",
                "As a Georgian, this tracks for Kemp. \n\nThis verdict on the heels of the golf course study last week is insane.  It showed a huge increase in Parkinson’s in people living or working in close proximity to golf courses. Perhaps chemicals sprayed onto grass year round isn’t ideal…",
                "Why is everybody freaking out over unsubstantiated dubious cancer claims rather than the widespread ecosystem damage that's well known and understood? Like if you're going to hate it please learn to hate it for the right reasons.",
                "Save corporations from responsibility."
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "RISING",
            "title": "Trump calls for broad drug price cuts in executive order",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/trump-says-he-will-cut-drug-prices-by-59-2025-05-12/",
            "upvotes": 5280,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "[removed]",
                "“White House officials said the government will give drugmakers price targets in the next 30 days, and will take further action to lower prices if those companies do not make \"significant progress\" towards those goals within six months of the order being signed”\n\nPer usual, there is always some future date. Always a delay. Nothing will happen",
                "And then the drug manufacturers will raise their prices again.",
                "After he just got rid of Biden’s work to lower prices?\n\nIt never ends with this twat",
                "He did the same thing in his first term then never followed up on it. He also removed a Biden-era law that restricted insulin prices to $30, so he literally raised prices and is now acting like he’s saving us by lowering them back to Biden-era prices",
                "He should tariff them at 125% then lower it to 10%, then declare it a “total reset” and success, and hope nobody notices it is 10% higher than before.",
                "Executive orders require money to come from the executive branch for them to be enforced.  If dummy says a thing and then doesn't fund it, then he did nothing.  Alas, his idiot cult members don't know shit, so they'll listen when he lies that big pharma isn't heeding his EO.",
                "The executive order will make no difference.\n\nIndividuals don’t negotiate the prices of drugs, nor does the manufacturer sell directly to patients, nor are all drugs manufactured in the US, nor are all manufacturers US companies.\n\nThe problem isn’t necessarily the drug price *from the manufacturer*. It’s the three middlemen between the manufacturer and the patient, which the EO does not address.\n\nAssuming the EO is followed (it will not be, nor does it have to be), the drug manufacturer just needs to set the price to the lowest negotiated price (which it is probably already close to in most cases… as the PBM or wholesaler is already paying the manufacturer a comparable amount). But the EO doesn’t address what PBMs then turn around and charge the next middle man (doctor, hospital, pharmacy) before reaching the consumer, and doesn’t account for tossing health insurance companies in the mix.\n\nThe system is needlessly complex and fundamentally flawed (on purpose, to enrich shareholders of multiple entities between the drug’s point of origin and the consumer), and this EO doesn’t address any of that, thereby making it virtually ineffective.",
                "Didn’t he claim he was going to do this his first term too?",
                "“Man who turned off the overhead lights announces plan to light a candle soon.”"
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "RISING",
            "title": "Edan Alexander, U.S.-Israeli hostage, released after more than 19 months in captivity, Hamas says",
            "external_url": "https://www.cbsnews.com/news/edan-alexander-us-israeli-hostage-released-hamas-after-more-than-19-months-captivity/",
            "upvotes": 2456,
            "date": "05/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/12/9a3ce98b-616a-4de9-9f6d-156cdb148ce5/thumbnail/1200x630/0758355536b5340ff885c8019668d11f/gettyimages-2214166996.jpg?v=1706c0c091b9b085a70a8db995d9c23a",
            "top_comments": [
                "All it took to get a deal was Qatar gifting a plane to Trump.",
                "Man, comments are always so goddamn weird on threads like this. Astroturfing of all sorts along with a variety of genuine lunatics.",
                "i’m glad he’s going to get to see his family :)",
                "It's incredible any hostages are still alive. I dont even know where they are putting them. \n\nThis was a bit of good news to come out of Israel, so I thought I'd share it.\n\nHave an awesome day!",
                "[removed]",
                "This kids appearance is sure going to mess with some people’s narrative",
                "This article barely mentions that he's an active duty IDF soldier. The headline and photo make it seem like he's a teenage American tourist or something. ",
                "Good to see. He’s the one Corey Booker had a pin on for.",
                "[deleted]",
                "I need a therapist to even think about this guy surviving the ordeal he has been through."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Trump fires director of U.S. Copyright Office, sources say",
            "external_url": "https://www.cbsnews.com/news/trump-fires-director-of-u-s-copyright-office-shira-perlmutter-sources/",
            "upvotes": 19753,
            "date": "05/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/10/a3bf9ec7-3ddf-4570-bdff-eafb746800a4/thumbnail/1200x630/4e1e701b4e0cf5c481072b89781d79bc/gettyimages-2213647884.jpg?v=1706c0c091b9b085a70a8db995d9c23a",
            "top_comments": [
                "\"...Perlmutter's firing was \"a brazen, unprecedented power grab with no legal basis.... surely no coincidence he acted less than a day after she refused to rubber-stamp Elon Musk's efforts to mine troves of copyrighted works to train AI models,\" in reference to the report released by the Copyright Office this week.  \n\nLast month, Musk took to his social media platform X to seemingly express support for the abolition of intellectual property laws...\"",
                "He sure is firing people left and right. Is there a website that tracks all the government heads that are being fired? I know I posted earlier that he fired the Librarian for Congress Friday. [https://federalnewsnetwork.com/workforce/2025/05/president-donald-trump-fires-librarian-of-congress-carla-hayden/](https://federalnewsnetwork.com/workforce/2025/05/president-donald-trump-fires-librarian-of-congress-carla-hayden/)\n\nEdit: Added another name and more details who has been fired..Earlier Thursday, the [acting administrator of the Federal Emergency Management Agency](https://apnews.com/article/fema-trump-administrator-replaced-emergency-b9ae5e6a7e1c09e51de99c5148f45eb2) was pushed out one day after he had testified that he did not agree with proposals to dismantle the organization. Trump has suggested that individual states, not FEMA, should take the lead on responding to hurricanes, tornadoes and other crises.\n\nAt the Pentagon, more than a half-dozen [top general officers have been fired](https://apnews.com/article/trump-brown-joint-chiefs-of-staff-firing-fa428cc1508a583b3bf5e7a5a58f6acf) since January, including the chairman of the Joint Chiefs of Staff, Gen. CQ Brown Jr. The only two women serving as four-star officers, as well as a disproportionate number of other senior female officers, have also been fired.",
                "We all know the intellectual property laws are only going to be suspended for the rich and corporations",
                "We're cooked.  Elon can just steal whatever he wants now",
                "Damn I was half joking when I said this office was going to be fired for denying Elons copyright claims and it happens less than a week later. This is going into banana republic levels of corruption.",
                "Strikes me as an admission that Elon's underlings weren't skilled enough to steal copyrighted work like every other major AI company does.",
                "Wasn’t this the issue that started the first Trade War with China?",
                "Trump, gutting US civilization.",
                "Musk had to stop the director’s report that his xAI training is copyright infringement.",
                "The Mouse is going to be angry!"
            ],
            "aggregate_sentiment": 14.0
        }
    ],
    "last_updated": "05/13/2025 08:12:59 UTC"
}