{
    "posts": [
        {
            "category": "HOT",
            "title": "Kash Patel removed as acting ATF director, replaced by Army Secretary",
            "external_url": "https://www.reuters.com/world/us/kash-patel-removed-acting-atf-director-replaced-by-army-secretary-sources-say-2025-04-09/",
            "upvotes": 10638,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait. So, is the Army Secretary holding both roles? So ATF and a branch of the military report to the same person?\n\n\nI'm not sure that makes me feel all warm and fuzzy...",
                "I’m beginning to think there’s a bit of chaos going on within this current administration…",
                "Guys, this administration is a cornucopia of shit. ",
                "How many Scaramuccis did he last?",
                "Patel is not fit to run anything.",
                "On threads they reported Kash simply stopped coming into work (at the ATF, not the FBI). I’ll take my karma wins where I can.",
                "Removed because he wasn't doing the job and didn't show up.\n\nOn that note, does anyone know if he's been doing his FBI job or showing up there?",
                "Got fired for being there for Ovechkin's 895th goal.",
                "Ok, so what's this a distraction for?",
                "I completely forgot he was pretending to do two jobs he was grossly unqualified for."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "China orders its banks to reduce US dollar purchases.",
            "external_url": "https://www.reuters.com/world/china/chinas-central-bank-asks-state-lenders-reduce-dollar-purchases-sources-say-2025-04-09/",
            "upvotes": 24607,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And 10yr treasure bonds above 4.5%.\n\nChina said fuck this tit for tat tariff bullshit.  They are using all their tools.",
                "There goes the infinite money hack the federal budget depends on. How long before the entire government collapses due to a total lack of funds?",
                "So I have a question what happens when all that US debt that China has bought up over the last 20 years or so what happens if they want to cash it in.",
                "Things are looking good, MAGA. It looks like you're going to get what you wanted. The rest of the world will be just fine without you.",
                "Wow, this is going much quicker than I expected. I thought we'd have to go through the recession before we had to print money. Looks like this is a speed run.",
                "All this because we won't just tax billionaires",
                "Turns out you don’t have the cards, Donald.",
                "Economic pressure is not going to work against China. They felt the impacts of the trade war that Trump started in 2018 and continued under Biden and started to quickly de-couple themselves from the dollar and critical imports. The increased tariffs will hurt everyone globally, but the ones that'll feel the impacts most both short-term and long-term are Americans.",
                "When the bond and dollar fail, what happens?",
                "This shit just got real.  If muthafuckas start dumping the dollar, we are fucked."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Trump announces 90 day tariff pause",
            "external_url": "https://www.cnbc.com/2025/04/09/trump-announces-90-day-tariff-pause-for-at-least-some-countries.html",
            "upvotes": 12561,
            "date": "04/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108129074-1744205767394-gettyimages-2208184612-_s019698_miuhqrg1.jpeg?v=1744205822&w=1920&h=1080",
            "top_comments": [
                "Can you imagine working at customs this week",
                "This is exactly why Congress should never have given this power to the executive branch.",
                "Trump timed his comment so his rich friends get richer on the market.",
                "These tariffs are supposed to bring good manufacturing jobs back to the USA. Why is he putting a pause on that? Doesn't he care about our jobs? /s",
                "This market manipulation is so fucking obvious its insane. Insider trading to levels never before seen.",
                "This is open corruption. They release the news on tariffs to short the market, then pause them so they can sell them.\n\nrinse and repeat. They aren't even trying to hide it now.\n\nffs",
                "If we ever get this country back, one of the first things we need to do is strip the presdiency of having this much power.",
                "Trump told Truth social \"it's a great time to buy\" ahead of the new tariff delay announcement\n\nAfter Trump's term, he should be investigated for stock manipulation.",
                "It's just market manipulation. It would be amazing to see who bought a ton of stock right before he announced this \"pause\".",
                "What happened to \"I know what the hell I'm doing\" and \"everyone is kissing my ass\"?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump tariffs spark US government debt sell-off",
            "external_url": "https://www.bbc.com/news/articles/c5yrr0e7499o",
            "upvotes": 23495,
            "date": "04/09/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4e4c/live/1d4d0e70-1533-11f0-bc17-dfa4f8dfee61.jpg",
            "top_comments": [
                "Fucking Christ if US bonds go off a cliff, what else is left. That shit is supposed to be a gold standard in investment.",
                "Donald Trump has broken his own record as the worst president of All time.\n\nHe has betrayed the American people including his voters who were hoping that the prices would go down.",
                "Don’t forget - Trump is only able to do this because Republicans refuse to rein him in. This is a Republican problem. ",
                "Trump said if I voted for Kamala the economy would be in ruin. And I gotta say, he clocked it right. I voted for her and the economy is in shambles.",
                "*Some analysts suggested that America's central bank - the US Federal Reserve - might be forced to step in if turbulence continues, in a move reminiscent of the Bank of England's emergency action in 2022 following Liz Truss's mini-Budget.*\n\n*”We see no other option for the Fed but to step in with emergency purchases of US Treasuries to stabilise the bond market,\" said George Saravelos, global head of FX research at Deutsche Bank.*\n\nLoL, all the pro-Trump “sound money” folks railed against exactly this during the quantitative easing of 2008+. Now they’ll turn around on a dime and be all for it. Anything to defend the Trump regime.\n\nQuacks, every last one of them.",
                "China has a LOT or Treasuries to offload - no interest rate cuts",
                "The GOP budget resolution adds 5 trillion to the debt ceiling. People are understanding USA has no intention on paying off its debt. That's 5 trillion uncollected taxes from the rich. To put it in easier to understand numbers: 5,000,000,000,000/150,000,000 taxpayers = about $32,000 debt increase per person who filed taxes last year. The tariffs are a smokescreen and we are getting robbed.",
                "I am not informed enough to understand how one person has that much power in the United States.\n\nCongress is currently talking about limiting the President's power over tariffs and my reaction is... why didn't they have power over this to begin with?\n\nHow can we not cancel $10k in student loans without congressional approval, but the President can trigger a great depression and global recession without congressional approval?",
                "Guys, I think it’s very clear that loomer sucked whatever little intelligence Trump had, right out of his baby carrot. This man defies logic every time he opens his mouth. ",
                "For the MAGA people, Trump could burn your house down and shit in your mouth and you'd thank him for the warmth and what he ate beforehand."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Dow surges 2,000 points, Nasdaq jumps 8% after Trump signals a 90-day pause on some tariffs",
            "external_url": "https://www.cnbc.com/2025/04/08/stock-market-today-live-updates-.html",
            "upvotes": 3709,
            "date": "04/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108129399-1744224488918-108129399-17442233882025-04-09t182555z_1576829729_rc2iuda41xcc_rtrmadp_0_usa-stocks.jpg?v=1744228854&w=1920&h=1080",
            "top_comments": [
                "Now every market acts like crypto",
                "This shit is so manipulated\n\n\nThe broligarchs are making hundreds of billions with insider trading here\n\n\nShort the market before announcing new tariffs, and buy before announcing negotiations & pauses",
                "So is it legal to manipulate stocks now ???",
                "He's manipulating markets and telling his private signal chat when to buy/sell",
                "It is still an increase on tariffs, just not as bad for 90 days. Of course, who knows what he will think tomorrow or the day after that.",
                "I wonder how many of his sycophants bought this morning, knowing this was coming.",
                "So what was accomplished here? Are factories flooding back into the United States?",
                "A whole lot of insiders got much much richer off of this market manipulation. \n\nI guess the entire plan is to keep doing things like this until mid-terms. President, Congressmen and Bros get richer. They lose their seats to Democrats and then Democrats get blamed for the failing economy. And that leads right back to electing another Republican to “fix” something that they broke.",
                "Marjorie Taylor Greene bought a significant amount of SPY right before the announcement. She had never before bought SPY before that. She can't be the only one, just the only one I've seen so far. \n\n\nThis shit is 100% manipulation. ",
                "Let’s not pretend he did anything beneficial except recoup some losses he created"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "US to announce new tariffs on pharmaceutical imports",
            "external_url": "https://www.bbc.com/news/articles/cedyylj1v32o",
            "upvotes": 5909,
            "date": "04/09/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/5c43/live/3c6964d0-1537-11f0-bc17-dfa4f8dfee61.jpg",
            "top_comments": [
                ">India supplies nearly half of all US generics, or cheaper versions of popular drugs, saving the country billions in healthcare costs.\n\nThe news just keeps getting better, doesn't it?",
                "All I want to do is live, work, and enjoy a little bit of time I have on this planet. But I can barely afford the meds I need to live now and its gonna go up? Fuck this dude. All I did was contract an autoimmune disease as a fucking child and now I'm forced to be in debt for the rest of my life? Fuck this guy, fuck his voters, fuck his followers. You are the evil ones. ",
                "He REALLY is trying to tank the market, isn't he",
                "The party of \"keep them sick and let them die\".",
                "More expensive healthcare for people that can't afford it sounds like good policy. They just need to wait another 7 years until factories open up in the US so they can get cheap drugs again ",
                "Guess we need to get a much bigger fan again",
                "realize there are posting rules, but true headlines would read ‘Republicans to announce …’  They need to own this and we need to remind them every chance we have",
                "Every time the stocks start ticking up he announces another move to try to get it back in the red. The trump administration is intentionally tanking the economy and they should all be removed from office for this treason",
                "I cant wrap my head around it. They are cutting the medicaid/medicare budget while simultaneously raising the cost of drugs. Which in turn will cost the programs more money. It just doesn't make sense.",
                "A lot of Americans about to lose their feet."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "European Union approves first set of retaliatory tariffs on U.S. imports",
            "external_url": "https://www.cnbc.com/2025/04/09/european-union-approves-first-set-of-retaliatory-tariffs-on-us-imports.html",
            "upvotes": 5277,
            "date": "04/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108126463-1743765627495-gettyimages-2198947496-_ha_0099_eetz0vnk.jpeg?v=1743765677&w=1920&h=1080",
            "top_comments": [
                "Important to note that these are *not* in response to Trump's blanket tariffs on the whole world from last week; that comes later. These are just in response to his steel and aluminum tariffs from last month.",
                "> The 27-nation bloc had warned it would act to protect European business and consumers after U.S. President Donald Trump imposed 25% duties on the metals.\n“The EU considers US tariffs unjustified and damaging, causing economic harm to both sides, as well as the global economy. The EU has stated its clear preference to find negotiated outcomes with the US, which would be balanced and mutually beneficial,” the European Commission said.\n\n I'm too old to drink and dance through another great recession. Our government is going to wreck our economy, and some people will still clap.",
                "Good. So who does he claim is calling and kissing his fat, diapered ass? Lies again you say?",
                "Time for EU to enact their anti coercion legislation.  It was created for this .",
                "Didn’t Trump say they were calling him and kissing his ass? Lmao. ",
                "This is what tariffs should look like. Reasonably thought out, weighed, and measured.\n\nOr you can just wake up, shit your Depends, and decide that you're going to do a 1000% markup on Belgian chocolate or whatever the fuck we're doing these days...",
                "ChEsS NoT cHeCkErs. Fuck republicans.",
                "The Trump Taxes are already costing Americans $2 billion per day",
                "You reap what you sow, America. \n\n\nThis is just the first set. More will come if the EU decides on that.",
                "None of this needed to happen. Again normal people will pay the price because a guy in the White House has dementia."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Trump sued by Democrat he removed from US civil rights agency",
            "external_url": "https://www.reuters.com/legal/trump-sued-by-democrat-he-removed-us-civil-rights-agency-2025-04-09/",
            "upvotes": 3311,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "not like trump has money to pay out a suit anyways ",
                "Another cut and dried case against him that will like go absolutely nowhere any time soon."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Japan, Canada agree to cooperate on market stability",
            "external_url": "https://www.reuters.com/markets/japan-canada-agree-cooperate-market-stability-2025-04-09/",
            "upvotes": 3257,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump is going to do wonders for world peace. Everyone will unite in hating us.\n\nI hear China, Japan, and South Korea are having some of the most productive talks they’ve had in decades.",
                "Shhhh Maga ... the grownups are talking. EU please join the conversation.",
                "Canada/EU/UK/Australia/S.Korea/Japan alliance sounds good to me",
                "Shit imagine the rest of the world comes together and a new era of global cooperation (without America of course) leads humanity to a new golden age.",
                "How do we not get that if we snub the whole world the whole world will cooperate to snub us?",
                "Honestly well America continues to shoot itself in the dick, I think there is a pretty good opportunity for Canada to take its place as the leader here. \n\nWe should be calling every country and trying to make a deal with them. \n\nWe just need to make sure we have sensible leadership to guide our way through it all.",
                "I wonder what it's like to live in a country with adult leaders \n\nOr heck, just leaders period",
                "This is the best outcome to come... in a few months every country will have new trade partners and deals and nobody will deal with US they will be left alone in the dust",
                "Does that mean that we get Switch 2's after all?",
                "Well they make good guitars, cars and video games"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Prisoner in Arizona serving 16 consecutive life sentences is accused of killing three inmates",
            "external_url": "https://www.nbcnews.com/news/us-news/prisoner-arizona-serving-16-consecutive-life-sentences-accused-killing-rcna200304",
            "upvotes": 1456,
            "date": "04/09/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250408-tucson-arizona-state-prison-complex-google-maps-ac-834p-c86e37.jpg",
            "top_comments": [
                "What's he got to lose at this point?",
                "A guy who's never getting out: *that's* your first-round draft pick for jail-house enforcer.",
                "So, 19 consecutive life sentences?",
                "\"What are you gonna do, imprison me?\"\n\n-man imprisoned",
                "If you're congratulating the prisoner for killing rapists please look up the guy's name. He is also a rapist and held a woman hostage for 2 weeks in a prison watch tower doing God knows what to her.",
                "The question i have is why was he put in the same pod as those chomos??  Staff HAD to know how that would pan out.",
                "What's the difference between 16 and 19 life sentences from a practical standpoint?",
                "Man who loves killing people is given access to more people to kill and promptly kills more people. Interesting.",
                "We should probably keep him away from all those people...",
                "Don't click the link. Literally provide no information."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "OpenAI countersues Elon Musk, claims harassment",
            "external_url": "https://www.reuters.com/legal/openai-countersues-elon-musk-claims-harassment-2025-04-09/",
            "upvotes": 13,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Good luck OpenAI. All your judges belong to them."
            ],
            "aggregate_sentiment": 26.0
        },
        {
            "category": "NEW",
            "title": "Kash Patel removed as acting ATF director, replaced by Army Secretary",
            "external_url": "https://www.reuters.com/world/us/kash-patel-removed-acting-atf-director-replaced-by-army-secretary-sources-say-2025-04-09/",
            "upvotes": 10630,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait. So, is the Army Secretary holding both roles? So ATF and a branch of the military report to the same person?\n\n\nI'm not sure that makes me feel all warm and fuzzy...",
                "I’m beginning to think there’s a bit of chaos going on within this current administration…",
                "Guys, this administration is a cornucopia of shit. ",
                "How many Scaramuccis did he last?",
                "Patel is not fit to run anything.",
                "On threads they reported Kash simply stopped coming into work (at the ATF, not the FBI). I’ll take my karma wins where I can.",
                "Removed because he wasn't doing the job and didn't show up.\n\nOn that note, does anyone know if he's been doing his FBI job or showing up there?",
                "Got fired for being there for Ovechkin's 895th goal.",
                "Ok, so what's this a distraction for?",
                "I completely forgot he was pretending to do two jobs he was grossly unqualified for."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Dow surges 2,000 points, Nasdaq jumps 8% after Trump signals a 90-day pause on some tariffs",
            "external_url": "https://www.cnbc.com/2025/04/08/stock-market-today-live-updates-.html",
            "upvotes": 3709,
            "date": "04/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108129399-1744224488918-108129399-17442233882025-04-09t182555z_1576829729_rc2iuda41xcc_rtrmadp_0_usa-stocks.jpg?v=1744228854&w=1920&h=1080",
            "top_comments": [
                "Now every market acts like crypto",
                "This shit is so manipulated\n\n\nThe broligarchs are making hundreds of billions with insider trading here\n\n\nShort the market before announcing new tariffs, and buy before announcing negotiations & pauses",
                "So is it legal to manipulate stocks now ???",
                "He's manipulating markets and telling his private signal chat when to buy/sell",
                "It is still an increase on tariffs, just not as bad for 90 days. Of course, who knows what he will think tomorrow or the day after that.",
                "I wonder how many of his sycophants bought this morning, knowing this was coming.",
                "So what was accomplished here? Are factories flooding back into the United States?",
                "A whole lot of insiders got much much richer off of this market manipulation. \n\nI guess the entire plan is to keep doing things like this until mid-terms. President, Congressmen and Bros get richer. They lose their seats to Democrats and then Democrats get blamed for the failing economy. And that leads right back to electing another Republican to “fix” something that they broke.",
                "Marjorie Taylor Greene bought a significant amount of SPY right before the announcement. She had never before bought SPY before that. She can't be the only one, just the only one I've seen so far. \n\n\nThis shit is 100% manipulation. ",
                "Let’s not pretend he did anything beneficial except recoup some losses he created"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Trump announces 90 day tariff pause",
            "external_url": "https://www.cnbc.com/2025/04/09/trump-announces-90-day-tariff-pause-for-at-least-some-countries.html",
            "upvotes": 12556,
            "date": "04/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108129074-1744205767394-gettyimages-2208184612-_s019698_miuhqrg1.jpeg?v=1744205822&w=1920&h=1080",
            "top_comments": [
                "Can you imagine working at customs this week",
                "This is exactly why Congress should never have given this power to the executive branch.",
                "Trump timed his comment so his rich friends get richer on the market.",
                "These tariffs are supposed to bring good manufacturing jobs back to the USA. Why is he putting a pause on that? Doesn't he care about our jobs? /s",
                "This market manipulation is so fucking obvious its insane. Insider trading to levels never before seen.",
                "This is open corruption. They release the news on tariffs to short the market, then pause them so they can sell them.\n\nrinse and repeat. They aren't even trying to hide it now.\n\nffs",
                "If we ever get this country back, one of the first things we need to do is strip the presdiency of having this much power.",
                "Trump told Truth social \"it's a great time to buy\" ahead of the new tariff delay announcement\n\nAfter Trump's term, he should be investigated for stock manipulation.",
                "It's just market manipulation. It would be amazing to see who bought a ton of stock right before he announced this \"pause\".",
                "What happened to \"I know what the hell I'm doing\" and \"everyone is kissing my ass\"?"
            ],
            "aggregate_sentiment": 23.0
        },
        {
            "category": "NEW",
            "title": "Prisoner in Arizona serving 16 consecutive life sentences is accused of killing three inmates",
            "external_url": "https://www.nbcnews.com/news/us-news/prisoner-arizona-serving-16-consecutive-life-sentences-accused-killing-rcna200304",
            "upvotes": 1458,
            "date": "04/09/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250408-tucson-arizona-state-prison-complex-google-maps-ac-834p-c86e37.jpg",
            "top_comments": [
                "What's he got to lose at this point?",
                "A guy who's never getting out: *that's* your first-round draft pick for jail-house enforcer.",
                "So, 19 consecutive life sentences?",
                "\"What are you gonna do, imprison me?\"\n\n-man imprisoned",
                "If you're congratulating the prisoner for killing rapists please look up the guy's name. He is also a rapist and held a woman hostage for 2 weeks in a prison watch tower doing God knows what to her.",
                "The question i have is why was he put in the same pod as those chomos??  Staff HAD to know how that would pan out.",
                "What's the difference between 16 and 19 life sentences from a practical standpoint?",
                "Man who loves killing people is given access to more people to kill and promptly kills more people. Interesting.",
                "We should probably keep him away from all those people...",
                "Don't click the link. Literally provide no information."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Oil prices plummet on China's retaliation against US tariffs",
            "external_url": "https://www.reuters.com/business/energy/oil-slides-nearly-4-us-kicks-off-104-tariffs-china-2025-04-09/",
            "upvotes": 1042,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Can’t wait for gas prices to plummet, just need to go buy a new work shirt for 180 dollars",
                "Oil glut is worse for Trump personally than stock market crash.\n\nWas concerning to see rupture of Keystone pipeline yesterday, but if crude keeps dragging $60/barrel, frankly I'll expect more 'random' outages down the road, that 'happen to' goose-up oil prices...\n\nIt's a dirty, dirty business.",
                "Well, he *did* promise to bring gas prices down. His base will see this is proof-positive that he's a genius.",
                "And when will we see this price reflected at the pumps?\n\nI see. Adding Hell to my weather app.",
                "On the plus side, if you can't sell your oil you're not going to open up new wells. This is a small win for the environment anyway…",
                "Gas prices won’t go down, the companies will just increase their profits.",
                "\"Gas is now $.89/gallon!\"\n\n\\[monkey's paw curls\\]\n\n\"Which you're going to need driving all over town looking for work and soup kitchens.\"",
                "Can’t wait to pay a few dollars fewer on gas in my vehicle that now costs tens of thousands more due to tariffs.",
                "Rising consumer costs will nullify  any benefit ,",
                "I saw this 2 hrs later, the headline had already changed, oil is climbing again."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "China orders its banks to reduce US dollar purchases.",
            "external_url": "https://www.reuters.com/world/china/chinas-central-bank-asks-state-lenders-reduce-dollar-purchases-sources-say-2025-04-09/",
            "upvotes": 24609,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And 10yr treasure bonds above 4.5%.\n\nChina said fuck this tit for tat tariff bullshit.  They are using all their tools.",
                "There goes the infinite money hack the federal budget depends on. How long before the entire government collapses due to a total lack of funds?",
                "So I have a question what happens when all that US debt that China has bought up over the last 20 years or so what happens if they want to cash it in.",
                "Things are looking good, MAGA. It looks like you're going to get what you wanted. The rest of the world will be just fine without you.",
                "Wow, this is going much quicker than I expected. I thought we'd have to go through the recession before we had to print money. Looks like this is a speed run.",
                "All this because we won't just tax billionaires",
                "Turns out you don’t have the cards, Donald.",
                "Economic pressure is not going to work against China. They felt the impacts of the trade war that Trump started in 2018 and continued under Biden and started to quickly de-couple themselves from the dollar and critical imports. The increased tariffs will hurt everyone globally, but the ones that'll feel the impacts most both short-term and long-term are Americans.",
                "When the bond and dollar fail, what happens?",
                "This shit just got real.  If muthafuckas start dumping the dollar, we are fucked."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US egg giant Cal-Maine says government is investigating price increases",
            "external_url": "https://www.cnn.com/2025/04/09/business/egg-prices-antitrust-cal-maine-foods/index.html",
            "upvotes": 1144,
            "date": "04/09/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25098806555550.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "whats to investigate? we all fucking know why",
                "What government? Who is even left at this point?",
                "Ohhh I see the plan now.\n\nTariff other nations to generate revenue for the US government as an excuse to cut income taxes.\n\nAs inflation rises, begin implementing Price caps while claiming the price increases that the caps are stopping are Anti-American. Now prices cant go up.\n\nCompanies begin losing tons of money, stocks decline rapidly. Billionaires buy the stocks cheap and then the Price caps are removed.\n\nNow a select few own the vaste majority of America, can set prices however they like, and pay no taxes. Meanwhile they fund propoganda campaigns to keep Trump or his family in charge of the White House. They also lobby the house and senate to be quiet and follow orders.\n\n\nAmerica is now a full on dystopian MegaCorp-Republic.",
                "Egg prices are going to be the least of the publics concerns soon lol. Dementia in the oval office is going to make everything balloon to 500% its normal prices",
                "They’re going to blame the woke egg quotas.  Ever wonder why there’s so many brown eggs?  It’s the Democrat Egg Initiative (DEI) funneling money to CCP shell companies.  There’s no bird “flu”, that’s just an excuse to raise prices and poach the paychecks of hard working Americans.  But now the truth is starting to come out, so “they” are scrambling to put together this sham “investigation” to distract us.",
                "Government is investigating how to force sell Cal-Maine to Musk",
                ">On Tuesday, Cal-Maine said its sales nearly doubled to $1.42 billion in its fiscal third quarter, which ended March 1. The company said that was primarily due to higher egg prices, which averaged $4.06 per dozen during the quarter, up from $2.25 per dozen a year ago.\n\nBUT\n\n>Cal-Maine said it sold a record 331.4 million dozen-eggs in the third quarter, a 10% increase from the same period a year ago.\n\nSo sales doubled, but product sold only increased by 10%.  How could one not look at this as price gouging?",
                "Government says their prices aren’t high enough",
                "They will investigate anything that does not go their way or they don't like. Hence intimidating a fired DOJ witness at home.",
                "It was inflation under Biden, it's price fixing under Orange Man, duh!"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Trump sued by Democrat he removed from US civil rights agency",
            "external_url": "https://www.reuters.com/legal/trump-sued-by-democrat-he-removed-us-civil-rights-agency-2025-04-09/",
            "upvotes": 3302,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "not like trump has money to pay out a suit anyways ",
                "Another cut and dried case against him that will like go absolutely nowhere any time soon."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US to announce new tariffs on pharmaceutical imports",
            "external_url": "https://www.bbc.com/news/articles/cedyylj1v32o",
            "upvotes": 5905,
            "date": "04/09/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/5c43/live/3c6964d0-1537-11f0-bc17-dfa4f8dfee61.jpg",
            "top_comments": [
                ">India supplies nearly half of all US generics, or cheaper versions of popular drugs, saving the country billions in healthcare costs.\n\nThe news just keeps getting better, doesn't it?",
                "All I want to do is live, work, and enjoy a little bit of time I have on this planet. But I can barely afford the meds I need to live now and its gonna go up? Fuck this dude. All I did was contract an autoimmune disease as a fucking child and now I'm forced to be in debt for the rest of my life? Fuck this guy, fuck his voters, fuck his followers. You are the evil ones. ",
                "He REALLY is trying to tank the market, isn't he",
                "The party of \"keep them sick and let them die\".",
                "More expensive healthcare for people that can't afford it sounds like good policy. They just need to wait another 7 years until factories open up in the US so they can get cheap drugs again ",
                "Guess we need to get a much bigger fan again",
                "realize there are posting rules, but true headlines would read ‘Republicans to announce …’  They need to own this and we need to remind them every chance we have",
                "Every time the stocks start ticking up he announces another move to try to get it back in the red. The trump administration is intentionally tanking the economy and they should all be removed from office for this treason",
                "I cant wrap my head around it. They are cutting the medicaid/medicare budget while simultaneously raising the cost of drugs. Which in turn will cost the programs more money. It just doesn't make sense.",
                "A lot of Americans about to lose their feet."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Trump sued by Democrat he removed from US civil rights agency",
            "external_url": "https://www.reuters.com/legal/trump-sued-by-democrat-he-removed-us-civil-rights-agency-2025-04-09/",
            "upvotes": 3307,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "not like trump has money to pay out a suit anyways ",
                "Another cut and dried case against him that will like go absolutely nowhere any time soon."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Kash Patel removed as acting ATF director, replaced by Army Secretary",
            "external_url": "https://www.reuters.com/world/us/kash-patel-removed-acting-atf-director-replaced-by-army-secretary-sources-say-2025-04-09/",
            "upvotes": 10637,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait. So, is the Army Secretary holding both roles? So ATF and a branch of the military report to the same person?\n\n\nI'm not sure that makes me feel all warm and fuzzy...",
                "I’m beginning to think there’s a bit of chaos going on within this current administration…",
                "Guys, this administration is a cornucopia of shit. ",
                "How many Scaramuccis did he last?",
                "Patel is not fit to run anything.",
                "On threads they reported Kash simply stopped coming into work (at the ATF, not the FBI). I’ll take my karma wins where I can.",
                "Removed because he wasn't doing the job and didn't show up.\n\nOn that note, does anyone know if he's been doing his FBI job or showing up there?",
                "Got fired for being there for Ovechkin's 895th goal.",
                "Ok, so what's this a distraction for?",
                "I completely forgot he was pretending to do two jobs he was grossly unqualified for."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Japan, Canada agree to cooperate on market stability",
            "external_url": "https://www.reuters.com/markets/japan-canada-agree-cooperate-market-stability-2025-04-09/",
            "upvotes": 3255,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump is going to do wonders for world peace. Everyone will unite in hating us.\n\nI hear China, Japan, and South Korea are having some of the most productive talks they’ve had in decades.",
                "Shhhh Maga ... the grownups are talking. EU please join the conversation.",
                "Canada/EU/UK/Australia/S.Korea/Japan alliance sounds good to me",
                "Shit imagine the rest of the world comes together and a new era of global cooperation (without America of course) leads humanity to a new golden age.",
                "How do we not get that if we snub the whole world the whole world will cooperate to snub us?",
                "Honestly well America continues to shoot itself in the dick, I think there is a pretty good opportunity for Canada to take its place as the leader here. \n\nWe should be calling every country and trying to make a deal with them. \n\nWe just need to make sure we have sensible leadership to guide our way through it all.",
                "I wonder what it's like to live in a country with adult leaders \n\nOr heck, just leaders period",
                "This is the best outcome to come... in a few months every country will have new trade partners and deals and nobody will deal with US they will be left alone in the dust",
                "Does that mean that we get Switch 2's after all?",
                "Well they make good guitars, cars and video games"
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "RISING",
            "title": "Dow surges 2,000 points, Nasdaq jumps 8% after Trump signals a 90-day pause on some tariffs",
            "external_url": "https://www.cnbc.com/2025/04/08/stock-market-today-live-updates-.html",
            "upvotes": 3710,
            "date": "04/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108129399-1744224488918-108129399-17442233882025-04-09t182555z_1576829729_rc2iuda41xcc_rtrmadp_0_usa-stocks.jpg?v=1744228854&w=1920&h=1080",
            "top_comments": [
                "Now every market acts like crypto",
                "This shit is so manipulated\n\n\nThe broligarchs are making hundreds of billions with insider trading here\n\n\nShort the market before announcing new tariffs, and buy before announcing negotiations & pauses",
                "So is it legal to manipulate stocks now ???",
                "He's manipulating markets and telling his private signal chat when to buy/sell",
                "It is still an increase on tariffs, just not as bad for 90 days. Of course, who knows what he will think tomorrow or the day after that.",
                "I wonder how many of his sycophants bought this morning, knowing this was coming.",
                "So what was accomplished here? Are factories flooding back into the United States?",
                "A whole lot of insiders got much much richer off of this market manipulation. \n\nI guess the entire plan is to keep doing things like this until mid-terms. President, Congressmen and Bros get richer. They lose their seats to Democrats and then Democrats get blamed for the failing economy. And that leads right back to electing another Republican to “fix” something that they broke.",
                "Marjorie Taylor Greene bought a significant amount of SPY right before the announcement. She had never before bought SPY before that. She can't be the only one, just the only one I've seen so far. \n\n\nThis shit is 100% manipulation. ",
                "Let’s not pretend he did anything beneficial except recoup some losses he created"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "China orders its banks to reduce US dollar purchases.",
            "external_url": "https://www.reuters.com/world/china/chinas-central-bank-asks-state-lenders-reduce-dollar-purchases-sources-say-2025-04-09/",
            "upvotes": 24601,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And 10yr treasure bonds above 4.5%.\n\nChina said fuck this tit for tat tariff bullshit.  They are using all their tools.",
                "There goes the infinite money hack the federal budget depends on. How long before the entire government collapses due to a total lack of funds?",
                "So I have a question what happens when all that US debt that China has bought up over the last 20 years or so what happens if they want to cash it in.",
                "Things are looking good, MAGA. It looks like you're going to get what you wanted. The rest of the world will be just fine without you.",
                "Wow, this is going much quicker than I expected. I thought we'd have to go through the recession before we had to print money. Looks like this is a speed run.",
                "All this because we won't just tax billionaires",
                "Turns out you don’t have the cards, Donald.",
                "Economic pressure is not going to work against China. They felt the impacts of the trade war that Trump started in 2018 and continued under Biden and started to quickly de-couple themselves from the dollar and critical imports. The increased tariffs will hurt everyone globally, but the ones that'll feel the impacts most both short-term and long-term are Americans.",
                "When the bond and dollar fail, what happens?",
                "This shit just got real.  If muthafuckas start dumping the dollar, we are fucked."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Trump announces 90 day tariff pause",
            "external_url": "https://www.cnbc.com/2025/04/09/trump-announces-90-day-tariff-pause-for-at-least-some-countries.html",
            "upvotes": 12557,
            "date": "04/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108129074-1744205767394-gettyimages-2208184612-_s019698_miuhqrg1.jpeg?v=1744205822&w=1920&h=1080",
            "top_comments": [
                "Can you imagine working at customs this week",
                "This is exactly why Congress should never have given this power to the executive branch.",
                "Trump timed his comment so his rich friends get richer on the market.",
                "These tariffs are supposed to bring good manufacturing jobs back to the USA. Why is he putting a pause on that? Doesn't he care about our jobs? /s",
                "This market manipulation is so fucking obvious its insane. Insider trading to levels never before seen.",
                "This is open corruption. They release the news on tariffs to short the market, then pause them so they can sell them.\n\nrinse and repeat. They aren't even trying to hide it now.\n\nffs",
                "If we ever get this country back, one of the first things we need to do is strip the presdiency of having this much power.",
                "Trump told Truth social \"it's a great time to buy\" ahead of the new tariff delay announcement\n\nAfter Trump's term, he should be investigated for stock manipulation.",
                "It's just market manipulation. It would be amazing to see who bought a ton of stock right before he announced this \"pause\".",
                "What happened to \"I know what the hell I'm doing\" and \"everyone is kissing my ass\"?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "European Union approves first set of retaliatory tariffs on U.S. imports",
            "external_url": "https://www.cnbc.com/2025/04/09/european-union-approves-first-set-of-retaliatory-tariffs-on-us-imports.html",
            "upvotes": 5280,
            "date": "04/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108126463-1743765627495-gettyimages-2198947496-_ha_0099_eetz0vnk.jpeg?v=1743765677&w=1920&h=1080",
            "top_comments": [
                "Important to note that these are *not* in response to Trump's blanket tariffs on the whole world from last week; that comes later. These are just in response to his steel and aluminum tariffs from last month.",
                "> The 27-nation bloc had warned it would act to protect European business and consumers after U.S. President Donald Trump imposed 25% duties on the metals.\n“The EU considers US tariffs unjustified and damaging, causing economic harm to both sides, as well as the global economy. The EU has stated its clear preference to find negotiated outcomes with the US, which would be balanced and mutually beneficial,” the European Commission said.\n\n I'm too old to drink and dance through another great recession. Our government is going to wreck our economy, and some people will still clap.",
                "Good. So who does he claim is calling and kissing his fat, diapered ass? Lies again you say?",
                "Time for EU to enact their anti coercion legislation.  It was created for this .",
                "Didn’t Trump say they were calling him and kissing his ass? Lmao. ",
                "This is what tariffs should look like. Reasonably thought out, weighed, and measured.\n\nOr you can just wake up, shit your Depends, and decide that you're going to do a 1000% markup on Belgian chocolate or whatever the fuck we're doing these days...",
                "ChEsS NoT cHeCkErs. Fuck republicans.",
                "The Trump Taxes are already costing Americans $2 billion per day",
                "You reap what you sow, America. \n\n\nThis is just the first set. More will come if the EU decides on that.",
                "None of this needed to happen. Again normal people will pay the price because a guy in the White House has dementia."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Oil prices plummet on China's retaliation against US tariffs",
            "external_url": "https://www.reuters.com/business/energy/oil-slides-nearly-4-us-kicks-off-104-tariffs-china-2025-04-09/",
            "upvotes": 1043,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Can’t wait for gas prices to plummet, just need to go buy a new work shirt for 180 dollars",
                "Oil glut is worse for Trump personally than stock market crash.\n\nWas concerning to see rupture of Keystone pipeline yesterday, but if crude keeps dragging $60/barrel, frankly I'll expect more 'random' outages down the road, that 'happen to' goose-up oil prices...\n\nIt's a dirty, dirty business.",
                "Well, he *did* promise to bring gas prices down. His base will see this is proof-positive that he's a genius.",
                "And when will we see this price reflected at the pumps?\n\nI see. Adding Hell to my weather app.",
                "On the plus side, if you can't sell your oil you're not going to open up new wells. This is a small win for the environment anyway…",
                "Gas prices won’t go down, the companies will just increase their profits.",
                "\"Gas is now $.89/gallon!\"\n\n\\[monkey's paw curls\\]\n\n\"Which you're going to need driving all over town looking for work and soup kitchens.\"",
                "Can’t wait to pay a few dollars fewer on gas in my vehicle that now costs tens of thousands more due to tariffs.",
                "Rising consumer costs will nullify  any benefit ,",
                "I saw this 2 hrs later, the headline had already changed, oil is climbing again."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "US to announce new tariffs on pharmaceutical imports",
            "external_url": "https://www.bbc.com/news/articles/cedyylj1v32o",
            "upvotes": 5908,
            "date": "04/09/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/5c43/live/3c6964d0-1537-11f0-bc17-dfa4f8dfee61.jpg",
            "top_comments": [
                ">India supplies nearly half of all US generics, or cheaper versions of popular drugs, saving the country billions in healthcare costs.\n\nThe news just keeps getting better, doesn't it?",
                "All I want to do is live, work, and enjoy a little bit of time I have on this planet. But I can barely afford the meds I need to live now and its gonna go up? Fuck this dude. All I did was contract an autoimmune disease as a fucking child and now I'm forced to be in debt for the rest of my life? Fuck this guy, fuck his voters, fuck his followers. You are the evil ones. ",
                "He REALLY is trying to tank the market, isn't he",
                "The party of \"keep them sick and let them die\".",
                "More expensive healthcare for people that can't afford it sounds like good policy. They just need to wait another 7 years until factories open up in the US so they can get cheap drugs again ",
                "Guess we need to get a much bigger fan again",
                "realize there are posting rules, but true headlines would read ‘Republicans to announce …’  They need to own this and we need to remind them every chance we have",
                "Every time the stocks start ticking up he announces another move to try to get it back in the red. The trump administration is intentionally tanking the economy and they should all be removed from office for this treason",
                "I cant wrap my head around it. They are cutting the medicaid/medicare budget while simultaneously raising the cost of drugs. Which in turn will cost the programs more money. It just doesn't make sense.",
                "A lot of Americans about to lose their feet."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Canada hits back at US car tariffs with reciprocal measures",
            "external_url": "https://www.bbc.com/news/articles/cedyyll7467o",
            "upvotes": 1571,
            "date": "04/09/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c43a/live/1b76a720-153b-11f0-a421-69fb502f5991.jpg",
            "top_comments": [
                "Trump and Putin's legacies are secure. They are both the biggest, most worthless pieces of shit in the world.",
                "Good. Love to see it. Fuck maga America. 🇨🇦🇨🇦🇨🇦",
                "The rest of the world should refuse to buy or sell anything to the US while this guy's in office.",
                "I don't think Canada, EU, Japan and China are talking behind the scenes AT ALL.\n\nThey are all just dumb peasants and will fold any day now. \n\n/s",
                "Canada called Washington's bluff on car tariffs. They should've done this ages ago.",
                "If the whole world gangs up on Trump we could absolutely destroy the US economy.   Work together people to save us from agent orange ",
                "Canada doesn’t have the cards",
                "Canada shoots itself in the face again."
            ],
            "aggregate_sentiment": 0.0
        }
    ],
    "last_updated": "04/10/2025 00:41:07 UTC"
}