{
    "posts": [
        {
            "category": "HOT",
            "title": "Yale professor who studies fascism fleeing US to work in Canada",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/26/yale-professor-fascism-canada?CMP=Share_AndroidApp_Other",
            "upvotes": 14378,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4ca5fca8e505ad4e446eed6c79a9a958f0d89e2f/0_72_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1b62264f6b12cd17697d55043a02c080",
            "top_comments": [
                "\"Out here, nobody knows where I am, and I’m believed to be away on a trip. Here are brewing economically and politically dark times, so I’m happy to be able to get away from everything.\" \n\n-Einstein hiding in Northern Germany in 1922, eleven years before he renounced his German citizenship following Hitlers rise to chancellor.",
                "A poignant quote from the article:  \"Social media posts spread on Wednesday, noting the alarm sounded by a scholar of fascism leaving the country over its political climate. Nikole Hannah-Jones, the journalist and creator of the 1619 Project,[wrote](https://bsky.app/profile/nhannahjones.bsky.social/post/3llakwvszts2c) on the social media platform Bluesky: “When scholars of authoritarianism and fascism leave US universities because of the deteriorating political situation here, we should really worry.”",
                "The vast majority of U.S. residents cannot leave. They either lack the resources or no one would be willing to take them on due to factors such as age, education, and others reasons. Protected is our freedom to travel, and essentially to leave has been our right. However, with a passport costing $250 and roughly 60% of Americans being a single paycheck away from homelessness, the majority have no freedom to travel or leave.  Trickle-down only worked for billionaires. The middle class has been significantly eroded over the past few decades. We are now stuck with our makings.",
                "\"Those who do not learn from history are doomed to repeat it\"\n\nThis is simply an example of the inverse being true.",
                "If only there had been a literal decade of warnings for people to pay attention to…",
                "He'll be back when he has to do his fieldwork.",
                "As a Canadian, I think we're better off for having him. But I'm sorry it's coming to this; I have friends in the States and I really feel for them.",
                "This is one of the few silver linings for Canada - a reverse brain drain.\n\nStill, I'd rather have a sane southern neighbor.",
                "Fleeing from Germany to France vibes.",
                "We're hostages tied to a chair while children with loaded guns are running around.  I hate it here"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "US honeybee deaths hit record high as scientists scramble to find main cause",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/25/honeybees-deaths-record-high",
            "upvotes": 19039,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ddbb4889fe4a8b0686f7bdaf1b74cc7a365ba0df/0_200_3000_1799/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2e9dd540a3f847f4f714379735a3b6bf",
            "top_comments": [
                "Half of America thinking climate change and environmental science is woke might have something to do with it.",
                "Stop using weed killer. It's toxic to them and destroys their main food sources.",
                "Well there’s the whole saturate the country in pesticides and glyphosate to start…",
                "> Commercial beekeepers have reported losing more than 60% of their colonies, on average, over the winter, according to an ongoing Project Apis m. survey that covers more than two-thirds of America’s managed bees.\n\nThe average winter loss used to be 10-20% until colony collapse began. They pollinate half our crops. This should freak everyone out.",
                "neonicitinoids by agra biotech firms for crop pesticides- banned elsewhere, not in usa.",
                "It's us. \"Us\" is the main cause",
                "Nothing will change without strict regulations on pesticides. It's not just agriculture sterilizing the countryside. Any idiot with a credit card can buy a barrel of poison and sterilize not just their yard but everything downwind and downstream of it for miles. \n\nWe thought we fixed everything by banning DDT, but that first Silent Spring was just the beginning. We're about to lose even more birds and wildlife in our world as insect populations continue to collapse.",
                "Scientists aren't scrambling to find the main cause, the people just don't like the answer.",
                "Who is scrambling?\n\nAnyone who has any amount of time greater than 30 seconds researching the decline in insect populations in the US know that insecticides and herbicides are the leading cause for the destruction of almost every single insect species.\n\nThese articles either try to shock people into thinking “omg how unexpected! Surely the big companies aren’t at fault and didn’t see this coming!” or the “scientists” they’re referring to are categorical fucking morons.\n\n\nMake no mistake, almost all insects are surprisingly integral to our ecosystems that we literally need to survive but Honeybees are some of, if not the, most important.\n\nWe lose them, we’re in serious trouble.",
                "We live in the city, we have a nice backyard garden, we don't use any pesticides, weed killers, bottled nutrients, etc for approximately 14 years. The bees have made a home here. Every year when they swarm its seems another groups attempts to set up camp here. I do believe they can tell when you don't use harmful chemicals around your property"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Scientists find 18 million tons of 'white gold' beneath California's Salton Sea worth $540 billion: Report",
            "external_url": "https://www.deccanherald.com/world/scientists-find-18-million-tons-of-white-gold-beneath-californias-salton-sea-worth-540-billion-report-3463540",
            "upvotes": 5069,
            "date": "03/27/2025",
            "thumbnail": "https://images.deccanherald.com/deccanherald%2F2025-03-26%2F1polbv4b%2FiStock-1272885374.jpg?rect=0%2C137%2C3644%2C1913&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
            "top_comments": [
                "Lithium. It's lithium. And it's double the amount estimated underneath Greenland.\n\nEdit: my math was a bit off lol...not double the amount....*it's WAY MORE*. A 2023 geological survey estimated 235,000 tonnes of lithium resources. 18,000,000 tonnes is more than that.",
                "I hate journalism these days. Just call it fucking Lithium and don't make me click to figure out what the hell you are talking about. \n\n\nMaybe I'm out of the loop but I've never heard it called white gold before",
                "How long before Elon buys the Salton Sea for his battery operations?",
                "Dam i should have bought the land years back when it was like 5k an acre.",
                "A substantial Lithium deposit in the United States is a big deal.",
                "White gold?  So cocaine?",
                "This means Greenland doesn’t need protecting by America?",
                "At less than $1 / oz, is 'gold' really the right comparable?",
                "How long before Trump invades California?",
                "Well good, maybe if they find cobalt and nickel somewhere they won't want Canada anymore."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Babysitter finds man under bed after child complains of 'monster'",
            "external_url": "https://www.bbc.com/news/articles/c70e2y98p06o",
            "upvotes": 1162,
            "date": "03/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/f543/live/8d4f9f70-0b20-11f0-88df-cbea984e02db.jpg",
            "top_comments": [
                "While trying to show the child there was nothing under the bed, the female victim \"came face-to-face\" with a male suspect, Barton County Sheriff's Office said. An altercation ensued with the babysitter and one child was knocked over.\n\nThe suspect fled and was found and arrested on the same block the next morning, on Tuesday, after leading deputies on a short foot chase.\n\nThe 27-year-old, who once lived at the residence and had a protection from abuse order to stay away from the property, was booked into jail on requested charges of aggravated kidnapping, among other crimes.\n\nOther charges requested include aggravated burglary, aggravated battery, child endangerment, felony obstruction of a law enforcement officer and violation of a protection from abuse order.\n\nThat's terrifying. \n\nAnother reason to not blow off your kids when they say they are afraid of something.",
                "That babysitter is getting a raise...and probably some PTSD treatment.",
                "> The 27-year-old, who once lived at the residence and had a protection from abuse order to stay away from the property, was booked into jail on requested charges of aggravated kidnapping, among other crimes.\n\nThat is terrifying. This is the kind of thing that would make me want to move.",
                "This is terrifying for an adult, let alone a child.",
                "Yeah I’d fucking never recover from that…..",
                "That poor kid is gonna sleep on futons the rest of their life. I'm glad that no one got hurt.",
                "Real life Creepypasta .",
                "I feel like this is basically one of those “Scary Stories” shorts from a book I read when I was a kid",
                "Neither one of them will get a good nights sleep the rest of their lives.",
                "Reminds me of that scene from Luther. How scary for the kid and babysitter."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Republican controlled Congress removes funding for protecting California coast",
            "external_url": "https://www.sfgate.com/bayarea/article/california-coastal-bluff-funding-20242812.php",
            "upvotes": 812,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Every day there's less and less reason to pay federal taxes. \n\n  \nThe state needs to wake up and give us the option to divert the funds to them to actually provide the services being stolen from us.",
                "Seems to me like Congress isn't really thinking of America's best interests how long until we can't call ourselves the United States if we literally don't unite on everything and or anything?",
                "Ok so California should stop paying federal taxes.",
                "And California needs to protect the coast to avoid \"Trump CaliBeach Blast costal lenght Resort and Casino\"",
                "Imagine being in an elected position charged with protecting, serving, and benefiting our country and deciding to do dumb shit like this day in and day out.\n\nThese people are incompetent in the best case scenarios... Everyone in our country should be demanding these people's heads at this point.  The damage they're doing is immeasurable.",
                "Not even kidding, I accidentally read the title as Russian controlled Congress",
                "OC Repugs will just \"feel\" that it's all our Democratic Party Governor's fault - never thinking (or admitting) that they all caused this; all the while, and in the aftermath, never even realizing the foundational purpose for the money in the first place.",
                "Time for Cali to become independent and create a new government, something like a Republic, call it the \"New California Republic\", yeah, sounds nice, NCR for short.",
                "If Democrats get back into power, I fully support ceasing federal funds to red states. I mean, that’s the game now right?",
                "Happening to Orange County too, one of the reddest parts of CA."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Former ND Sen. Ray Holmberg sentenced to 10 years in prison for sex crime",
            "external_url": "https://northdakotamonitor.com/2025/03/26/former-nd-sen-ray-holmberg-sentenced-to-10-years-in-prison-for-sex-crime/",
            "upvotes": 4903,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Holmberg, a Republican who held the powerful positions of Senate Appropriations Committee chair and head of Legislative Management.\n\nYet again, the danger to children are the very people who fear monger about trans people or immigrants or whatever else can deflect attention away from themselves.",
                "Some highlights here, though I do encourage everyone to read the article in full. \n\n* Prosecutors allege Holmberg traveled to Prague in the Czech Republic 14 times between 2011 and 2021 to pay for sex with boys. \n\n* Though not part of the charges against Holmberg, two men who said they met him in North Dakota and were victimized by him gave emotional testimony at the hearing. One said Holmberg gave him money to film sex acts in the 1990s. The other man who spoke at the hearing was a cooperating witness who said Holmberg used his political power to groom them for sex. \n\n* Holmberg said in court that he traveled to Prague with the intent of having sexual contact with minors, that he liked massages and some involved sexual contact. He said he might have received a sexual massage from someone under 18, but he’s not sure.\n\n* In one message, Holmberg sent a cooperating witness a link to a brothel in Prague with the comment, “The boys rent at around $60 … (sex is extra).”\n\n* Holmberg was linked to the investigation of Nicholas Morgan-Derosier, a Grand Forks man who was sentenced in May to 40 years on child pornography charges.\n\n* Holmberg, a Republican who held the powerful positions of Senate Appropriations Committee chair and head of Legislative Management, resigned from the Legislature in 2022. He was indicted on federal charges in October 2023.\n\n* Ray Holmberg, 81, was a Grand Forks state senator for 45 years, and received a sentence that is longer than federal sentencing guidelines. \n\n* U.S. District Judge Daniel Hovland characterized Holmberg’s conduct as “egregious and despicable” and said he didn’t think the guideline sentence of more than three years was adequate.\n\n* “From my perspective, this was not an isolated case and this is not a victimless crime,” Hovland said. “It displays a pattern of very vile, sickening criminal behavior.”\n\n* Holmberg was sentenced to *10* years. At age 81, it's likely he will die in prison.\n\n* Holmberg is not trans nor a drag queen.",
                "Wait does this one get sent to El Salvador too?",
                "Take one guess which party he represented…",
                "Yes.  He was a Republican.\n\nAnd a school counselor.",
                "Republican anti-abortion activist Howard Scott Heldreth is a convicted child rapist in Florida.\n\nRepublican County Commissioner David Swartz pleaded guilty to molesting two girls under the age of 11 and was sentenced to 8 years in prison.\n\nRepublican judge Mark Pazuhanich pleaded no contest to fondling a 10-year old girl and was sentenced to 10 years probation.\n\nRepublican anti-abortion activist Nicholas Morency pleaded guilty to possessing child pornography on his computer and offering a bounty to anybody who murders an abortion doctor.\n\nRepublican legislator Edison Misla Aldarondo was sentenced to 10 years in prison for raping his daughter between the ages of 9 and 17.\n\nRepublican Mayor Philip Giordano is serving a 37-year sentence in federal prison for sexually abusing 8- and 10-year old girls.\n\nRepublican campaign consultant Tom Shortridge was sentenced to three years probation for taking nude photographs of a 15-year old girl.\n\nRepublican racist pedophile and United States Senator Strom Thurmond had sex with a 15-year old black girl which produced a child.\n\nRepublican pastor Mike Hintz, whom George W. Bush commended during the 2004 presidential campaign, surrendered to police after admitting to a sexual affair with a female juvenile.\n\nRepublican legislator Peter Dibble pleaded no contest to having an inappropriate relationship with a 13-year-old girl.\n\nRepublican activist Lawrence E. King, Jr. organized child sex parties at the White House during the 1980s.\n\nRepublican lobbyist Craig J. Spence organized child sex parties at the White House during the 1980s.\n\nRepublican Congressman Donald “Buz” Lukens was found guilty of having sex with a female minor and sentenced to one month in jail.\n\nRepublican fundraiser Richard A. Delgaudio was found guilty of child porn charges and paying two teenage girls to pose for sexual photos.\n\nRepublican activist Mark A. Grethen convicted on six counts of sex crimes involving children.\n\nRepublican activist Randal David Ankeney pleaded guilty to attempted sexual assault on a child.\n\nRepublican Congressman Dan Crane had sex with a female minor working as a congressional page.\n\nRepublican activist and Christian Coalition leader Beverly Russell admitted to an incestuous relationship with his step daughter.\n\nRepublican congressman and anti-gay activist Robert Bauman was charged with having sex with a 16-year-old boy he picked up at a gay bar.\n\nRepublican Committee Chairman Jeffrey Patti was arrested for distributing a video clip of a 5-year-old girl being raped.\n\nRepublican activist Marty Glickman (a.k.a. “Republican Marty”), was taken into custody by Florida police on four counts of unlawful sexual activity with an underage girl and one count of delivering the drug LSD.\n\nRepublican legislative aide Howard L. Brooks was charged with molesting a 12-year old boy and possession of child pornography.\n\nRepublican Senate candidate John Hathaway was accused of having sex with his 12-year old baby sitter and withdrew his candidacy after the allegations were reported in the media.\n\nRepublican preacher Stephen White, who demanded a return to traditional values, was sentenced to jail after offering $20 to a 14-year-old boy for permission to perform oral sex on him.\n\nRepublican talk show host Jon Matthews pleaded guilty to exposing his genitals to an 11 year old girl.\n\nRepublican anti-gay activist Earl “Butch” Kimmerling was sentenced to 40 years in prison for molesting an 8-year old girl after he attempted to stop a gay couple from adopting her.\n\nRepublican Party leader Paul Ingram pleaded guilty to six counts of raping his daughters and served 14 years in federal prison.\n\nRepublican election board official Kevin Coan was sentenced to two years probation for soliciting sex over the internet from a 14-year old girl.\n\nRepublican politician Andrew Buhr was charged with two counts of first degree sodomy with a 13-year old boy.\n\nRepublican politician Keith Westmoreland was arrested on seven felony counts of lewd and lascivious exhibition to girls under the age of 16 (i.e. exposing himself to children).\n\nRepublican anti-abortion activist John Allen Burt was charged with sexual misconduct involving a 15-year old girl.\n\nRepublican County Councilman Keola Childs pleaded guilty to molesting a male child.\n\nRepublican activist John Butler was charged with criminal sexual assault on a teenage girl.\n\nRepublican candidate Richard Gardner admitted to molesting his two daughters.\n\nRepublican Councilman and former Marine Jack W. Gardner was convicted of molesting a 13-year old girl.\n\nRepublican County Commissioner Merrill Robert Barter pleaded guilty to unlawful sexual contact and assault on a teenage boy.\n\nRepublican City Councilman Fred C. Smeltzer, Jr. pleaded no contest to raping a 15 year-old girl and served 6-months in prison.\n\nRepublican activist Parker J. Bena pleaded guilty to possession of child pornography on his home computer and was sentenced to 30 months in federal prison and fined $18,000.\n\nRepublican parole board officer and former Colorado state representative, Larry Jack Schwarz, was fired after child pornography was found in his possession.\n\nRepublican strategist and Citadel Military College graduate Robin Vanderwall was convicted in Virginia on five counts of soliciting sex from boys and girls over the internet.\n\nRepublican city councilman Mark Harris, who is described as a “good military man” and “church goer,” was convicted of repeatedly having sex with an 11-year-old girl and sentenced to 12 years in prison.\n\nRepublican businessman Jon Grunseth withdrew his candidacy for Minnesota governor after allegations surfaced that he went swimming in the nude with four underage girls, including his daughter.\n\nRepublican director of the “Young Republican Federation” Nicholas Elizondo molested his 6-year old daughter and was sentenced to six years in prison.\n\nRepublican benefactor of conservative Christian groups, Richard A. Dasen Sr., was charged with rape for allegedly paying a 15-year old girl for sex. Dasen, 62, who is married with grown children and several grandchildren, has allegedly told police that over the past decade he paid more than $1 million to have sex with a large number of young women\n\nDennis Hastert served as Republican Speaker of the House (so, 3rd in line for the Presidency) for all 8 years of W. Bush’s two terms. He also sexually molested at least 5 boys when he was a HS wrestling coach, all of them underage with the youngest victim being 14. The victims only finally saw justice when Hastert was caught by the FBI trying to falsify payments for hush money.\n\nDonald Trump walked into Miss Teen USA change rooms with girls as young as 14 changing. 26 women have spoken publicly about Trump’s pattern of sexual assualt. In 2023, he was found legally liable for the rape of E. Jean Carroll by unanimous jury\n\nAnton “Tony” Lazzaro, a former Republican donor and political strategist from Minnesota, was convicted in March 2023 on federal charges of sex trafficking minors. He was found guilty of conspiring to recruit and pay teenage girls, aged 15 and 16, for sex between May and December 2020. In August 2023, Lazzaro was sentenced to 21 years in prison for these offenses.\n\nPrior to his arrest, Lazzaro was a prominent figure in Minnesota Republican circles, donating over $270,000 to various Republican campaigns and political committees. His indictment led to significant turmoil within the Minnesota Republican Party, culminating in the resignation of then-party chair Jennifer",
                "I know it's in the article, but the headline should have Republican in it.\n\n\nAs it's almost always a republican politicain.",
                "sick fuck, rot in hell",
                "Trump will pardon him and invite him to Mar-a-Lago.",
                "So, why is it that Republican isn’t in the forefront? I’d get it if it weren’t pertinent information. But Child SA and Republicans go together like peanut butter and jelly."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "HHS to cut 10,000 employees in major overhaul of health agencies",
            "external_url": "https://www.cnn.com/2025/03/27/health/hhs-rfk-job-cuts",
            "upvotes": 1048,
            "date": "03/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2204184566.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "What could possibly go wrong?",
                "'Overhaul' is a very polite way of saying 'decimation'",
                "Are we great yet? Are enough people unemployed now?",
                "Once again. This saves the American people zero dollars because any money saved is to help pay off the (lack of) taxes for the rich. \n\nWe are essentially paying for services we no longer will receive.\n\nThat’s not “government efficiency”. That’s a scam.",
                "> The workforce reduction will save $1.8 billion per year, the agency said. \n\nThey're literally saving pennies in the grand scheme of government spending.",
                "It's a very bad time to be a scientist in the United States right now. Even more depressing is watching Republicans cheer on the destruction of literally tens of thousands of livelihoods.",
                "How many people has Trump laid off now? He really is trying to speed run crashing the economy.",
                "\"Overhaul\"? \n\nIt's the DESTRUCTION of health agencies. They are trying to fix or change anything. They want to dismantle the entire system.",
                ">HHS’ new priority will be to end “America’s epidemic of chronic illness by focusing on safe, wholesome food, clean water, and the elimination of environmental toxins,” the agency said.\n\nThat must be why they're also gutting the EPA, so we can focus on clean water.",
                "The end of grants and federal funding is also decimating local public health offices.\n\nMy office will be significantly downsized. I'm not sure if I'm safe, but everyone might learn real fast what public health actually does."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Figure skater whose parents died in D.C. plane crash says they changed their flight",
            "external_url": "https://www.nbcnews.com/sports/sports/figure-skater-whose-parents-died-dc-plane-crash-says-changed-flight-rcna198332",
            "upvotes": 767,
            "date": "03/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/max-naumov-mc-250327-copy-ec5088.jpg",
            "top_comments": [
                "A meeting got canceled at my dad's work so he decided to go to the airport and get on standby for an earlier flight. He was flying from London to New York, to join the rest of us who had flown a day earlier to visit family. That was Dec 21, 1988. His original plane was bombed over Lockerbie, Scotland killing 270 people. \n\nWe didn't know he'd gotten the earlier flight. And when he landed in New York 3 hours earlier than expected, he decided to meet up with his best friend rather than go directly to his mom's house where we all were. It wasn't until someone called the best friend to inform him my dad was dead that dad found out about the crash.",
                "Ugh, awful--that's an added level of shit to process on top of a whole lot of already difficult grief and shock that he must be going through. \n\nI fly a lot for work and tend to change my flights a lot on the fly when new meetings come up or get moved I need to still be able to make. Every time I do I always wonder if it's going to mean I either have changed into a flight that's destined to crash, or changed away from one that was going to crash.",
                "In plane crash stories, there are always some unfortunate incidences of people who changed their flight to be on the plane that crashed or relieving stories where someone changed their flight or missed the flight that crashed. Just the nature of it I suppose",
                "just so sad. I hope he has a strong support system, I can’t imagine how you even begin to process this kind of loss",
                "Back in the late 80s, my father's cousin woke up late and missed his flight, he ended up on Pan Am Flight 103.\n\nMy dad's side of the family have all had a thing about being on time ever since.",
                "What's crazy is if they went on it it could of shifted the timing of their flight by a few seconds, enough to not crash.",
                "My uncle had a ticket to fly to Santo Domingo from NYC. About a month before departure, my uncle got into a fight with his friend and changed his stop to Puerta Plata. \n\nImagine his horror on November 12th, 2001 when the American Airlines 587 plane that took off in front of him, the one he originally was on, crashed shortly after takeoff due to pilot error. Two months post 9/11 made it all the more heartbreaking and scary.",
                "Every major disaster has stories of people who weren’t going to be there but ended up being there and people who were going to be there but then weren’t.  Plans changing is a fact of life.",
                "I had to google to make sure this was the same Pam  Am flight. My dad was supposed to be on this flight for work as well but got bumped off (never said why) and had to take a later flight. I remember seeing the news that day and my mom freaking out and then getting a call that he was ok.                                             I remember my dad talking about he met some US college kids on the flight there and found out they had the same return flight home. Even though they were strangers my dad always said he never forgot them and it should have been him too.    Weird to see other parents/family on here have a similar experience. Small world.",
                "How is this news? Who gives a fuck?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Private Data and Passwords of Senior U.S. Security Officials Found Online",
            "external_url": "https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7?sara_ref=re-so-app-sh",
            "upvotes": 21111,
            "date": "03/26/2025",
            "thumbnail": "https://cdn.prod.www.spiegel.de/images/87ac326a-da00-4ba1-b643-d410f8595cbe_w1200_r1.778_fpx60.66_fpy45.jpg",
            "top_comments": [
                "The clown show continues.\n\nI watch in amazement as the US won the cold war and now a bunch of village idiots absolutely wreck national security and long standing alliances in a couple of weeks.",
                ">To do so, the reporters used commercial people search engines along with hacked customer data that has been published on the web. Those affected by the leaks include National Security Adviser Mike Waltz, Director of National Intelligence Tulsi Gabbard and Secretary of Defense Pete Hegseth.  \n>  \n>Most of these numbers and email addresses are apparently still in use, with some of them linked to profiles on social media platforms like Instagram and LinkedIn. They were used to create Dropbox accounts and profiles in apps that track running data. There are also WhatsApp profiles for the respective phone numbers and even Signal accounts in some cases.  \n>  \n>[...]  \n>National Intelligence Director Gabbard was seemingly more careful with her data than her two male colleagues. She apparently had her own data blocked in the commercial contact search engines that contained the data of Hegseth and Waltz. But her email address was to be found on WikiLeaks and Reddit.  \n>  \n>Gabbard’s email address is available in more than 10 leaks. One of those also contains a partial telephone number, which, when completed, leads to an active WhatsApp account and a Signal profile.  \n>\n>src: https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7  \n  \nI can see quite a few people being very interested in exploiting this.",
                "😂😂😂😂😂\nOf course they are. Why would anyone with empathy or common sense expect competence from this administration???",
                "*Hostile intelligence services could use this publicly available data to hack the communications of those affected by installing spyware on their devices. It is thus conceivable that foreign agents were privy to the Signal chat group in which Gabbard, Waltz and Hegseth discussed a military strike.*\n\nThe headlines come fast and furious from T's desk, but the incompetence of the Admin seems equally propelled.",
                "You just know the clowns in Trump's cabinet answer phishing emails all the time and have probably already infected multiple government systems with malware.",
                "I bet Trump has a sticky note with passwords on his computer monitor",
                "We are seeing the fall of America in real time. Thanks Republicans!",
                "The soundtrack of the US Government is \"Yackety Sax\"",
                "Is now a good time to remind everyone that during the 2016 DNC hack, the Republicans were also hacked but WikiLeaks chose not to release any of that information? That decision led the public to believe that Democrats were insecure with how they handle their data while Republicans were not - which of course we all know now (and knew then, tbh) is the exact opposite.",
                "Maga - Morons Are Governing America."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump places 25% tariff on imported autos, expecting to raise $100 billion in tax revenues",
            "external_url": "https://apnews.com/article/autos-tariffs-trump-tax-imports-ford-gm-e53823ef7bbb7b3c46d11eca90aaa638",
            "upvotes": 13013,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Didn't he say tariffs aren't a tax?",
                "Boy that’ll put a nice dent in the **$500 billion** in projected tax reduction next year all because he doesn’t want to fund the IRS adequately.",
                "tax revenues from whom exactly?",
                "Last year, my parents bought a new car, installed solar panels, upgraded their phones and laptops, and bought a new TV, all because they thought Trump might win and implement tariffs and these things would become more expensive. \n\nThey also voted for Trump.",
                "Does this mean it’ll cost more to buy cars? And that extra money will go to the US government, so they can lower the taxes of billionaires. Thats kinda lame.",
                "Another scandal to cover up with more bad governance. This regime is really a human fucking centipede of government",
                "Oof. This is going to back fire.",
                "This is a distraction from the Signal chat room. He'll take it away tomorrow or before markets close for the week ",
                "Trumps adds 25% sales tax to all imported autos.\n\nRemember how republicans spent decades complaining about “tax and spend liberals” ? I remember.",
                "Fool. Everyone knows that he should place a 50% tariff to generate $200 billion in tax revenues."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Israel Supplied Intelligence in Airstrike Discussed in Signal Chat, Officials Say | Houthi missile expert was tracked with help of Israeli human source in Yemen [WSJ]",
            "external_url": "https://www.wsj.com/politics/national-security/israel-supplied-intelligence-in-airstrike-discussed-in-signal-chat-officials-say-9a9e0abf?st=EZqgA5&reflink=article_copyURL_share",
            "upvotes": 1,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Pennsylvania woman pays $12 for alleged Renoir artwork",
            "external_url": "https://abcnews.go.com/US/pennsylvania-woman-pays-12-alleged-renoir-painting/story?id=120172554",
            "upvotes": 4,
            "date": "03/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/4412c10e-8623-4794-a27f-8bcc6863db49/renoir-01-ht-jt-250326_1743026875736_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Good for her! \nNice that someone figured out what it was before repurposing the frame for a Tom Selleck pic."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "E.P.A. Offers a Way to Avoid Clean-Air Rules: Send an Email",
            "external_url": "https://www.nytimes.com/2025/03/27/climate/epa-air-pollution-exemption-mercury-coal-ash.html?unlocked_article_code=1.7E4.mAhu.QzPMqEQj_K8-&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb",
            "upvotes": 130,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "* email should include transaction number reference to purchase of Trump memecoin.",
                "They left out \"and monetary donation\"",
                "RFK Jr. said he will cut 10,000 jobs and focus on things that cause chronic illnesses. \n\nOf course we all know polluted and toxic water and air greatly contribute to chronic illness. But Trump and RFK Jr would are making them worse.  Because -spoiler alert- they could care less about chronic illness.",
                "Boy Greta really did make JD have little dick syndrome didn't she.",
                "OMG- how is this a democracy?",
                "So Trump will review the email and decide?  JFC.",
                "Do they think the science behind the connection between air pollution and health is false? They also breathe the same air. We seen what the effects to society as a whole is by looking at what happened when we went to unleaded gas.",
                "This nigerian-prince-scam of a government sucks."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Wildfires rage on in North and South Carolina as more firefighters arrive",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/27/carolina-wildfires-forecast",
            "upvotes": 130,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4014adb0d0b0c1e6c03e8f4f9598db980d59ff56/0_401_6000_3599/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=154af27941c875494a29a227964a77e6",
            "top_comments": [
                "I wonder if The Carolinas will be treated the same way Los Angeles and California were back in January.",
                "Well, I guess someone didn't rake the forests last year.",
                "But don't worry Carolinians.\n\nTrump is axing FEMA.\n\nRight Repubs?",
                "I heard it a was a tran, Palestinian, anti trump, Biden relative that started this with Hillary's server that had 30000 emails on it.",
                "Have they tried turning on the taps?",
                "Did they get conditions on their assistance?",
                "What have the liberals done this time?",
                "Sounds like they didn't pray hard enough. Oh well.",
                "Where's the blame on the local fire chief? Surely it's not conditions that caused this but the gross ineptitude of those working in the local fire departments, right??",
                "Release the water from the north. Isn't that what he said about Cali??? 🤦‍♂️🤦‍♂️🤦‍♂️"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Republican controlled Congress removes funding for protecting California coast",
            "external_url": "https://www.sfgate.com/bayarea/article/california-coastal-bluff-funding-20242812.php",
            "upvotes": 827,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Every day there's less and less reason to pay federal taxes. \n\n  \nThe state needs to wake up and give us the option to divert the funds to them to actually provide the services being stolen from us.",
                "Seems to me like Congress isn't really thinking of America's best interests how long until we can't call ourselves the United States if we literally don't unite on everything and or anything?",
                "Ok so California should stop paying federal taxes.",
                "And California needs to protect the coast to avoid \"Trump CaliBeach Blast costal lenght Resort and Casino\"",
                "Imagine being in an elected position charged with protecting, serving, and benefiting our country and deciding to do dumb shit like this day in and day out.\n\nThese people are incompetent in the best case scenarios... Everyone in our country should be demanding these people's heads at this point.  The damage they're doing is immeasurable.",
                "Not even kidding, I accidentally read the title as Russian controlled Congress",
                "OC Repugs will just \"feel\" that it's all our Democratic Party Governor's fault - never thinking (or admitting) that they all caused this; all the while, and in the aftermath, never even realizing the foundational purpose for the money in the first place.",
                "Time for Cali to become independent and create a new government, something like a Republic, call it the \"New California Republic\", yeah, sounds nice, NCR for short.",
                "If Democrats get back into power, I fully support ceasing federal funds to red states. I mean, that’s the game now right?",
                "Happening to Orange County too, one of the reddest parts of CA."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "6 dead and 39 rescued after tourist submarine sinks in Red Sea",
            "external_url": "https://www.bbc.com/news/live/clynd93449kt",
            "upvotes": 140,
            "date": "03/27/2025",
            "thumbnail": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png",
            "top_comments": [
                "It sounds like it struck a reef at a depth of around 20m? I don't know enough about submarines to understand what the situation would have been, but at least the majority were able to be rescued.",
                "Oh yes our yearly sacrifice to the sea almost forgot about that.",
                "I'm starting to think these submarine things aren't the safest mode of transportation.",
                "You would have lost me at Egyptian Holiday Resort Submarine."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "N.J. police chief accused of turning department into 'Animal House'",
            "external_url": "https://www.nbcnews.com/news/us-news/nj-police-chief-accused-turning-department-animal-house-rcna198241",
            "upvotes": 240,
            "date": "03/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250326-robert-farley-north-bergen-police-department-mn-1435-8705da.jpg",
            "top_comments": [
                ">A New Jersey police chief has been accused by five of his officers of turning the department into an \"Animal House\" rife with harassment against his employees, including incidents of him defecating on the office floor, spiking the office coffee pot with Adderall and Viagra, and jabbing one officer in the penis with a hypodermic needle.\n\nArticle just gets crazier from there.",
                "\"The issue here is not whether we broke a few rules, or took a few liberties with our female party guests - we did.\"",
                "If he's willing to do this to his fellow officers, imagine what he did to people he arrested/pulled over.",
                "Jesus tapdancing christ. This dude is a psych patient.",
                "Fascinating. If things get bad enough, even the police won't support the police and will demand accountability.",
                "\"Farley, whose father and grandfather served as deputy chiefs of the North Bergen Police Department,[ was sworn in as chief](https://hudsoncountyview.com/robert-farley-jr-sworn-in-as-new-north-bergen-police-chief/) by Mayor Nicholas Sacco in February 2024.\"\n\nGood thing he wasn't a DEI hire though...right?",
                "hol up.... 60k citizens, 5ish square miles.......140 \\*uniformed\\* officers. what the eff?! what kind of gambino crime spree have they got going on there?",
                "That guy is unhinged. Completely unhinged.",
                "They need to search that guys computer asap. ",
                "Only our best get to wear the badge."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Babysitter finds man under bed after child complains of 'monster'",
            "external_url": "https://www.bbc.com/news/articles/c70e2y98p06o",
            "upvotes": 1160,
            "date": "03/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/f543/live/8d4f9f70-0b20-11f0-88df-cbea984e02db.jpg",
            "top_comments": [
                "While trying to show the child there was nothing under the bed, the female victim \"came face-to-face\" with a male suspect, Barton County Sheriff's Office said. An altercation ensued with the babysitter and one child was knocked over.\n\nThe suspect fled and was found and arrested on the same block the next morning, on Tuesday, after leading deputies on a short foot chase.\n\nThe 27-year-old, who once lived at the residence and had a protection from abuse order to stay away from the property, was booked into jail on requested charges of aggravated kidnapping, among other crimes.\n\nOther charges requested include aggravated burglary, aggravated battery, child endangerment, felony obstruction of a law enforcement officer and violation of a protection from abuse order.\n\nThat's terrifying. \n\nAnother reason to not blow off your kids when they say they are afraid of something.",
                "That babysitter is getting a raise...and probably some PTSD treatment.",
                "> The 27-year-old, who once lived at the residence and had a protection from abuse order to stay away from the property, was booked into jail on requested charges of aggravated kidnapping, among other crimes.\n\nThat is terrifying. This is the kind of thing that would make me want to move.",
                "This is terrifying for an adult, let alone a child.",
                "Yeah I’d fucking never recover from that…..",
                "That poor kid is gonna sleep on futons the rest of their life. I'm glad that no one got hurt.",
                "Real life Creepypasta .",
                "I feel like this is basically one of those “Scary Stories” shorts from a book I read when I was a kid",
                "Neither one of them will get a good nights sleep the rest of their lives.",
                "Reminds me of that scene from Luther. How scary for the kid and babysitter."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Judge renews block on Iowa's law banning books that depict sex acts from schools",
            "external_url": "https://www.desmoinesregister.com/story/news/crime-and-courts/2025/03/26/iowa-school-book-ban-law-forbidding-sex-references-blocked-by-court-senate-file-496/82659992007/",
            "upvotes": 314,
            "date": "03/27/2025",
            "thumbnail": "https://www.desmoinesregister.com/gcdn/authoring/authoring-images/2023/08/02/PDEM/70516925007-0801-alta-011.JPG?crop=2999,1695,x0,y152&width=2999&height=1695&format=pjpg&auto=webp",
            "top_comments": [
                "No Bible in school, a win for everyone",
                "Thy two breasts are like two young roes that are twins. – Bible : Song of Solomon 7 : 3",
                "Despite how people will clutch pearls and shit, especially given the framing of discussions and bills like this by legislators, this was and is the correct decision. By banning everything that \"depicts sex acts,\" it puts a chilling level of oversight onto all literature. The text definitions in these types of bills always allow and open for very easy extension into more and more literature and content.\n\nIt's sort of like (because it kind of is) the anti trans/LGBTQ bills that pop up where they use weaponized vagueness to chill speech and allow further extension, even if the bill is framed as something \"good\" with its name and marketing.",
                "Its just blocked because they realized it would ban the Bible.",
                "Genesis 19:30-36 (NIV):\n\n^(30) Lot and his two daughters left Zoar and settled in the mountains, for he was afraid to stay in Zoar. He and his two daughters lived in a cave. ^(31) One day the older daughter said to the younger, “Our father is old, and there is no man around here to give us children—as is the custom all over the earth. ^(32) Let’s get our father to drink wine and then sleep with him and preserve our family line through our father.”\n\n^(33) That night they got their father to drink wine, and the older daughter went in and slept with him. He was not aware of it when she lay down or when she got up.\n\n^(34) The next day the older daughter said to the younger, “Last night I slept with my father. Let’s get him to drink wine again tonight, and you go in and sleep with him so we can preserve our family line through our father.” ^(35) So they got their father to drink wine that night also, and the younger daughter went in and slept with him. Again he was not aware of it when she lay down or when she got up.\n\n^(36) So both of Lot’s daughters became pregnant by their father.",
                "Let me guess, the Bible is exempt.",
                "So they just don't have Biology anymore?",
                "If that isn't a loaded article title I don't want to know what is.",
                "Lots of good hitters in the comments. As a summary, as well as a few additions that come to mind:\n\n- Lot offering his daughters to a gangbang scenario\n- Same daughters get impregnated by a drunken Lot\n- Onan spilling his seed on the ground\n- The Judah and Tamar scenario\n- Ezekiel’s prophetic pronouncement about a whoring Israel that’s compared to lusting after donkey penis and horse ejaculation\n\nAny others we’ve forgotten, folks?",
                "I love that they think books are where kids go for “depictions” of sex acts. What year is this???"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Yale professor who studies fascism fleeing US to work in Canada",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/26/yale-professor-fascism-canada?CMP=Share_AndroidApp_Other",
            "upvotes": 14380,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4ca5fca8e505ad4e446eed6c79a9a958f0d89e2f/0_72_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1b62264f6b12cd17697d55043a02c080",
            "top_comments": [
                "\"Out here, nobody knows where I am, and I’m believed to be away on a trip. Here are brewing economically and politically dark times, so I’m happy to be able to get away from everything.\" \n\n-Einstein hiding in Northern Germany in 1922, eleven years before he renounced his German citizenship following Hitlers rise to chancellor.",
                "A poignant quote from the article:  \"Social media posts spread on Wednesday, noting the alarm sounded by a scholar of fascism leaving the country over its political climate. Nikole Hannah-Jones, the journalist and creator of the 1619 Project,[wrote](https://bsky.app/profile/nhannahjones.bsky.social/post/3llakwvszts2c) on the social media platform Bluesky: “When scholars of authoritarianism and fascism leave US universities because of the deteriorating political situation here, we should really worry.”",
                "The vast majority of U.S. residents cannot leave. They either lack the resources or no one would be willing to take them on due to factors such as age, education, and others reasons. Protected is our freedom to travel, and essentially to leave has been our right. However, with a passport costing $250 and roughly 60% of Americans being a single paycheck away from homelessness, the majority have no freedom to travel or leave.  Trickle-down only worked for billionaires. The middle class has been significantly eroded over the past few decades. We are now stuck with our makings.",
                "\"Those who do not learn from history are doomed to repeat it\"\n\nThis is simply an example of the inverse being true.",
                "If only there had been a literal decade of warnings for people to pay attention to…",
                "He'll be back when he has to do his fieldwork.",
                "As a Canadian, I think we're better off for having him. But I'm sorry it's coming to this; I have friends in the States and I really feel for them.",
                "This is one of the few silver linings for Canada - a reverse brain drain.\n\nStill, I'd rather have a sane southern neighbor.",
                "Fleeing from Germany to France vibes.",
                "We're hostages tied to a chair while children with loaded guns are running around.  I hate it here"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Yale professor who studies fascism fleeing US to work in Canada",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/26/yale-professor-fascism-canada?CMP=Share_AndroidApp_Other",
            "upvotes": 14398,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4ca5fca8e505ad4e446eed6c79a9a958f0d89e2f/0_72_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1b62264f6b12cd17697d55043a02c080",
            "top_comments": [
                "\"Out here, nobody knows where I am, and I’m believed to be away on a trip. Here are brewing economically and politically dark times, so I’m happy to be able to get away from everything.\" \n\n-Einstein hiding in Northern Germany in 1922, eleven years before he renounced his German citizenship following Hitlers rise to chancellor.",
                "A poignant quote from the article:  \"Social media posts spread on Wednesday, noting the alarm sounded by a scholar of fascism leaving the country over its political climate. Nikole Hannah-Jones, the journalist and creator of the 1619 Project,[wrote](https://bsky.app/profile/nhannahjones.bsky.social/post/3llakwvszts2c) on the social media platform Bluesky: “When scholars of authoritarianism and fascism leave US universities because of the deteriorating political situation here, we should really worry.”",
                "The vast majority of U.S. residents cannot leave. They either lack the resources or no one would be willing to take them on due to factors such as age, education, and others reasons. Protected is our freedom to travel, and essentially to leave has been our right. However, with a passport costing $250 and roughly 60% of Americans being a single paycheck away from homelessness, the majority have no freedom to travel or leave.  Trickle-down only worked for billionaires. The middle class has been significantly eroded over the past few decades. We are now stuck with our makings.",
                "\"Those who do not learn from history are doomed to repeat it\"\n\nThis is simply an example of the inverse being true.",
                "If only there had been a literal decade of warnings for people to pay attention to…",
                "He'll be back when he has to do his fieldwork.",
                "As a Canadian, I think we're better off for having him. But I'm sorry it's coming to this; I have friends in the States and I really feel for them.",
                "This is one of the few silver linings for Canada - a reverse brain drain.\n\nStill, I'd rather have a sane southern neighbor.",
                "Fleeing from Germany to France vibes.",
                "We're hostages tied to a chair while children with loaded guns are running around.  I hate it here"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Republican controlled Congress removes funding for protecting California coast",
            "external_url": "https://www.sfgate.com/bayarea/article/california-coastal-bluff-funding-20242812.php",
            "upvotes": 816,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Every day there's less and less reason to pay federal taxes. \n\n  \nThe state needs to wake up and give us the option to divert the funds to them to actually provide the services being stolen from us.",
                "Seems to me like Congress isn't really thinking of America's best interests how long until we can't call ourselves the United States if we literally don't unite on everything and or anything?",
                "Ok so California should stop paying federal taxes.",
                "And California needs to protect the coast to avoid \"Trump CaliBeach Blast costal lenght Resort and Casino\"",
                "Imagine being in an elected position charged with protecting, serving, and benefiting our country and deciding to do dumb shit like this day in and day out.\n\nThese people are incompetent in the best case scenarios... Everyone in our country should be demanding these people's heads at this point.  The damage they're doing is immeasurable.",
                "Not even kidding, I accidentally read the title as Russian controlled Congress",
                "OC Repugs will just \"feel\" that it's all our Democratic Party Governor's fault - never thinking (or admitting) that they all caused this; all the while, and in the aftermath, never even realizing the foundational purpose for the money in the first place.",
                "Time for Cali to become independent and create a new government, something like a Republic, call it the \"New California Republic\", yeah, sounds nice, NCR for short.",
                "If Democrats get back into power, I fully support ceasing federal funds to red states. I mean, that’s the game now right?",
                "Happening to Orange County too, one of the reddest parts of CA."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Judge renews block on Iowa's law banning books that depict sex acts from schools",
            "external_url": "https://www.desmoinesregister.com/story/news/crime-and-courts/2025/03/26/iowa-school-book-ban-law-forbidding-sex-references-blocked-by-court-senate-file-496/82659992007/",
            "upvotes": 314,
            "date": "03/27/2025",
            "thumbnail": "https://www.desmoinesregister.com/gcdn/authoring/authoring-images/2023/08/02/PDEM/70516925007-0801-alta-011.JPG?crop=2999,1695,x0,y152&width=2999&height=1695&format=pjpg&auto=webp",
            "top_comments": [
                "No Bible in school, a win for everyone",
                "Thy two breasts are like two young roes that are twins. – Bible : Song of Solomon 7 : 3",
                "Despite how people will clutch pearls and shit, especially given the framing of discussions and bills like this by legislators, this was and is the correct decision. By banning everything that \"depicts sex acts,\" it puts a chilling level of oversight onto all literature. The text definitions in these types of bills always allow and open for very easy extension into more and more literature and content.\n\nIt's sort of like (because it kind of is) the anti trans/LGBTQ bills that pop up where they use weaponized vagueness to chill speech and allow further extension, even if the bill is framed as something \"good\" with its name and marketing.",
                "Its just blocked because they realized it would ban the Bible.",
                "Genesis 19:30-36 (NIV):\n\n^(30) Lot and his two daughters left Zoar and settled in the mountains, for he was afraid to stay in Zoar. He and his two daughters lived in a cave. ^(31) One day the older daughter said to the younger, “Our father is old, and there is no man around here to give us children—as is the custom all over the earth. ^(32) Let’s get our father to drink wine and then sleep with him and preserve our family line through our father.”\n\n^(33) That night they got their father to drink wine, and the older daughter went in and slept with him. He was not aware of it when she lay down or when she got up.\n\n^(34) The next day the older daughter said to the younger, “Last night I slept with my father. Let’s get him to drink wine again tonight, and you go in and sleep with him so we can preserve our family line through our father.” ^(35) So they got their father to drink wine that night also, and the younger daughter went in and slept with him. Again he was not aware of it when she lay down or when she got up.\n\n^(36) So both of Lot’s daughters became pregnant by their father.",
                "Let me guess, the Bible is exempt.",
                "So they just don't have Biology anymore?",
                "If that isn't a loaded article title I don't want to know what is.",
                "Lots of good hitters in the comments. As a summary, as well as a few additions that come to mind:\n\n- Lot offering his daughters to a gangbang scenario\n- Same daughters get impregnated by a drunken Lot\n- Onan spilling his seed on the ground\n- The Judah and Tamar scenario\n- Ezekiel’s prophetic pronouncement about a whoring Israel that’s compared to lusting after donkey penis and horse ejaculation\n\nAny others we’ve forgotten, folks?",
                "I love that they think books are where kids go for “depictions” of sex acts. What year is this???"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Babysitter finds man under bed after child complains of 'monster'",
            "external_url": "https://www.bbc.com/news/articles/c70e2y98p06o",
            "upvotes": 1161,
            "date": "03/27/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/f543/live/8d4f9f70-0b20-11f0-88df-cbea984e02db.jpg",
            "top_comments": [
                "While trying to show the child there was nothing under the bed, the female victim \"came face-to-face\" with a male suspect, Barton County Sheriff's Office said. An altercation ensued with the babysitter and one child was knocked over.\n\nThe suspect fled and was found and arrested on the same block the next morning, on Tuesday, after leading deputies on a short foot chase.\n\nThe 27-year-old, who once lived at the residence and had a protection from abuse order to stay away from the property, was booked into jail on requested charges of aggravated kidnapping, among other crimes.\n\nOther charges requested include aggravated burglary, aggravated battery, child endangerment, felony obstruction of a law enforcement officer and violation of a protection from abuse order.\n\nThat's terrifying. \n\nAnother reason to not blow off your kids when they say they are afraid of something.",
                "That babysitter is getting a raise...and probably some PTSD treatment.",
                "> The 27-year-old, who once lived at the residence and had a protection from abuse order to stay away from the property, was booked into jail on requested charges of aggravated kidnapping, among other crimes.\n\nThat is terrifying. This is the kind of thing that would make me want to move.",
                "This is terrifying for an adult, let alone a child.",
                "Yeah I’d fucking never recover from that…..",
                "That poor kid is gonna sleep on futons the rest of their life. I'm glad that no one got hurt.",
                "Real life Creepypasta .",
                "I feel like this is basically one of those “Scary Stories” shorts from a book I read when I was a kid",
                "Neither one of them will get a good nights sleep the rest of their lives.",
                "Reminds me of that scene from Luther. How scary for the kid and babysitter."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "N.J. police chief accused of turning department into 'Animal House'",
            "external_url": "https://www.nbcnews.com/news/us-news/nj-police-chief-accused-turning-department-animal-house-rcna198241",
            "upvotes": 240,
            "date": "03/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250326-robert-farley-north-bergen-police-department-mn-1435-8705da.jpg",
            "top_comments": [
                ">A New Jersey police chief has been accused by five of his officers of turning the department into an \"Animal House\" rife with harassment against his employees, including incidents of him defecating on the office floor, spiking the office coffee pot with Adderall and Viagra, and jabbing one officer in the penis with a hypodermic needle.\n\nArticle just gets crazier from there.",
                "\"The issue here is not whether we broke a few rules, or took a few liberties with our female party guests - we did.\"",
                "If he's willing to do this to his fellow officers, imagine what he did to people he arrested/pulled over.",
                "Jesus tapdancing christ. This dude is a psych patient.",
                "Fascinating. If things get bad enough, even the police won't support the police and will demand accountability.",
                "\"Farley, whose father and grandfather served as deputy chiefs of the North Bergen Police Department,[ was sworn in as chief](https://hudsoncountyview.com/robert-farley-jr-sworn-in-as-new-north-bergen-police-chief/) by Mayor Nicholas Sacco in February 2024.\"\n\nGood thing he wasn't a DEI hire though...right?",
                "hol up.... 60k citizens, 5ish square miles.......140 \\*uniformed\\* officers. what the eff?! what kind of gambino crime spree have they got going on there?",
                "That guy is unhinged. Completely unhinged.",
                "They need to search that guys computer asap. ",
                "Only our best get to wear the badge."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Scientists find 18 million tons of 'white gold' beneath California's Salton Sea worth $540 billion: Report",
            "external_url": "https://www.deccanherald.com/world/scientists-find-18-million-tons-of-white-gold-beneath-californias-salton-sea-worth-540-billion-report-3463540",
            "upvotes": 5075,
            "date": "03/27/2025",
            "thumbnail": "https://images.deccanherald.com/deccanherald%2F2025-03-26%2F1polbv4b%2FiStock-1272885374.jpg?rect=0%2C137%2C3644%2C1913&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
            "top_comments": [
                "Lithium. It's lithium. And it's double the amount estimated underneath Greenland.\n\nEdit: my math was a bit off lol...not double the amount....*it's WAY MORE*. A 2023 geological survey estimated 235,000 tonnes of lithium resources. 18,000,000 tonnes is more than that.",
                "I hate journalism these days. Just call it fucking Lithium and don't make me click to figure out what the hell you are talking about. \n\n\nMaybe I'm out of the loop but I've never heard it called white gold before",
                "How long before Elon buys the Salton Sea for his battery operations?",
                "Dam i should have bought the land years back when it was like 5k an acre.",
                "A substantial Lithium deposit in the United States is a big deal.",
                "White gold?  So cocaine?",
                "This means Greenland doesn’t need protecting by America?",
                "At less than $1 / oz, is 'gold' really the right comparable?",
                "How long before Trump invades California?",
                "Well good, maybe if they find cobalt and nickel somewhere they won't want Canada anymore."
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "RISING",
            "title": "US honeybee deaths hit record high as scientists scramble to find main cause",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/25/honeybees-deaths-record-high",
            "upvotes": 19026,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ddbb4889fe4a8b0686f7bdaf1b74cc7a365ba0df/0_200_3000_1799/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2e9dd540a3f847f4f714379735a3b6bf",
            "top_comments": [
                "Half of America thinking climate change and environmental science is woke might have something to do with it.",
                "Stop using weed killer. It's toxic to them and destroys their main food sources.",
                "Well there’s the whole saturate the country in pesticides and glyphosate to start…",
                "> Commercial beekeepers have reported losing more than 60% of their colonies, on average, over the winter, according to an ongoing Project Apis m. survey that covers more than two-thirds of America’s managed bees.\n\nThe average winter loss used to be 10-20% until colony collapse began. They pollinate half our crops. This should freak everyone out.",
                "neonicitinoids by agra biotech firms for crop pesticides- banned elsewhere, not in usa.",
                "It's us. \"Us\" is the main cause",
                "Nothing will change without strict regulations on pesticides. It's not just agriculture sterilizing the countryside. Any idiot with a credit card can buy a barrel of poison and sterilize not just their yard but everything downwind and downstream of it for miles. \n\nWe thought we fixed everything by banning DDT, but that first Silent Spring was just the beginning. We're about to lose even more birds and wildlife in our world as insect populations continue to collapse.",
                "Scientists aren't scrambling to find the main cause, the people just don't like the answer.",
                "Who is scrambling?\n\nAnyone who has any amount of time greater than 30 seconds researching the decline in insect populations in the US know that insecticides and herbicides are the leading cause for the destruction of almost every single insect species.\n\nThese articles either try to shock people into thinking “omg how unexpected! Surely the big companies aren’t at fault and didn’t see this coming!” or the “scientists” they’re referring to are categorical fucking morons.\n\n\nMake no mistake, almost all insects are surprisingly integral to our ecosystems that we literally need to survive but Honeybees are some of, if not the, most important.\n\nWe lose them, we’re in serious trouble.",
                "We live in the city, we have a nice backyard garden, we don't use any pesticides, weed killers, bottled nutrients, etc for approximately 14 years. The bees have made a home here. Every year when they swarm its seems another groups attempts to set up camp here. I do believe they can tell when you don't use harmful chemicals around your property"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "HHS to cut 10,000 employees in major overhaul of health agencies",
            "external_url": "https://www.cnn.com/2025/03/27/health/hhs-rfk-job-cuts",
            "upvotes": 1042,
            "date": "03/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2204184566.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "What could possibly go wrong?",
                "'Overhaul' is a very polite way of saying 'decimation'",
                "Are we great yet? Are enough people unemployed now?",
                "Once again. This saves the American people zero dollars because any money saved is to help pay off the (lack of) taxes for the rich. \n\nWe are essentially paying for services we no longer will receive.\n\nThat’s not “government efficiency”. That’s a scam.",
                "> The workforce reduction will save $1.8 billion per year, the agency said. \n\nThey're literally saving pennies in the grand scheme of government spending.",
                "It's a very bad time to be a scientist in the United States right now. Even more depressing is watching Republicans cheer on the destruction of literally tens of thousands of livelihoods.",
                "How many people has Trump laid off now? He really is trying to speed run crashing the economy.",
                "\"Overhaul\"? \n\nIt's the DESTRUCTION of health agencies. They are trying to fix or change anything. They want to dismantle the entire system.",
                ">HHS’ new priority will be to end “America’s epidemic of chronic illness by focusing on safe, wholesome food, clean water, and the elimination of environmental toxins,” the agency said.\n\nThat must be why they're also gutting the EPA, so we can focus on clean water.",
                "The end of grants and federal funding is also decimating local public health offices.\n\nMy office will be significantly downsized. I'm not sure if I'm safe, but everyone might learn real fast what public health actually does."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Six dead and dozens rescued after tourist submarine sinks off Egypt",
            "external_url": "https://news.sky.com/story/six-dead-and-dozens-rescued-after-tourist-submarine-sinks-off-egypt-13336566",
            "upvotes": 402,
            "date": "03/27/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-egypt-submarine-sinks_6868536.jpg?20250327143914",
            "top_comments": [
                "I've been in one of these and will never need to do it again. While it was a fun experience, the view isn't great. You need much larger windows to enjoy it as much as you think you will.",
                ">In addition to the crew, there were 45 tourists on board, including minors. All of them are Russian citizens.\n\n\nIf I were Russian I would definitely avoid anything with windows that goes underwater.",
                "Tourist submarines and tourist helicopters. Two things I refuse to do.",
                "Sounds like a bizarre adventure.",
                "Submarines are bad news, man. If nature wanted us down there, we’d have gills.",
                "Tragic\n\nEgypt is heaven for diving. Been holidaying there for 20 years\n\nSomething is going badly wrong though\n\nToo many liveaboards are sinking.  And now this. \n\nGot to assume that regulations are be in g cut or inspections. Something isn’t working. And people are dying.",
                "Recent years have taught me not to go into tourist subs.",
                "Didn't we already do the \"tourist submarine\" plot line? That just seems like lazy writing.",
                "And here i thought the whole purpose of submarines was to sink.",
                "Um, aren't submarines designed to sink?"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Figure skater whose parents died in D.C. plane crash says they changed their flight",
            "external_url": "https://www.nbcnews.com/sports/sports/figure-skater-whose-parents-died-dc-plane-crash-says-changed-flight-rcna198332",
            "upvotes": 772,
            "date": "03/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/max-naumov-mc-250327-copy-ec5088.jpg",
            "top_comments": [
                "A meeting got canceled at my dad's work so he decided to go to the airport and get on standby for an earlier flight. He was flying from London to New York, to join the rest of us who had flown a day earlier to visit family. That was Dec 21, 1988. His original plane was bombed over Lockerbie, Scotland killing 270 people. \n\nWe didn't know he'd gotten the earlier flight. And when he landed in New York 3 hours earlier than expected, he decided to meet up with his best friend rather than go directly to his mom's house where we all were. It wasn't until someone called the best friend to inform him my dad was dead that dad found out about the crash.",
                "Ugh, awful--that's an added level of shit to process on top of a whole lot of already difficult grief and shock that he must be going through. \n\nI fly a lot for work and tend to change my flights a lot on the fly when new meetings come up or get moved I need to still be able to make. Every time I do I always wonder if it's going to mean I either have changed into a flight that's destined to crash, or changed away from one that was going to crash.",
                "In plane crash stories, there are always some unfortunate incidences of people who changed their flight to be on the plane that crashed or relieving stories where someone changed their flight or missed the flight that crashed. Just the nature of it I suppose",
                "just so sad. I hope he has a strong support system, I can’t imagine how you even begin to process this kind of loss",
                "Back in the late 80s, my father's cousin woke up late and missed his flight, he ended up on Pan Am Flight 103.\n\nMy dad's side of the family have all had a thing about being on time ever since.",
                "What's crazy is if they went on it it could of shifted the timing of their flight by a few seconds, enough to not crash.",
                "My uncle had a ticket to fly to Santo Domingo from NYC. About a month before departure, my uncle got into a fight with his friend and changed his stop to Puerta Plata. \n\nImagine his horror on November 12th, 2001 when the American Airlines 587 plane that took off in front of him, the one he originally was on, crashed shortly after takeoff due to pilot error. Two months post 9/11 made it all the more heartbreaking and scary.",
                "Every major disaster has stories of people who weren’t going to be there but ended up being there and people who were going to be there but then weren’t.  Plans changing is a fact of life.",
                "I had to google to make sure this was the same Pam  Am flight. My dad was supposed to be on this flight for work as well but got bumped off (never said why) and had to take a later flight. I remember seeing the news that day and my mom freaking out and then getting a call that he was ok.                                             I remember my dad talking about he met some US college kids on the flight there and found out they had the same return flight home. Even though they were strangers my dad always said he never forgot them and it should have been him too.    Weird to see other parents/family on here have a similar experience. Small world.",
                "How is this news? Who gives a fuck?"
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "03/27/2025 20:09:28 UTC"
}