{
    "posts": [
        {
            "category": "HOT",
            "title": "Australia reelects Labor party",
            "external_url": "https://www.abc.net.au/news/elections/federal/2025/results",
            "upvotes": 12758,
            "date": "05/03/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/5cead005ccec832c8b67962996764ab6?impolicy=wcms_crop_resize&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
            "top_comments": [
                "Dickson had the opportunity to do the funniest thing possible, and they delivered.\n\nAfter Poilievre, it’s now Dutton’s turn to lose his own seat.",
                "I love how being seen as having anything in common with Trump is the recipe for losing an election, and even losing their own seat. \n\nHe’s a loser of a man, and is contagious.",
                "For non-Australians, the Labor party is our left-leaning party. The Liberal Party (which is the conservative party) tried to take a page out of Trump’s book in its campaign, which resulted in this outcome. Honestly they would have had a much better chance if they’d stuck to their usual guns – Trump is not a popular figure among the majority of the populace (although this year a new party ran called “Trumpet of Patriots”, which has an undeniable “Make Australia Great Again” air to it. That party has so far earned over 2% of the vote… take from that what you will).",
                "Just as significant is that conservative party leader Peter Dutton (Temu Trump) has had about a 10% swing against him, so is now trailing in his own electorate and may lose his own seat\n\nEdit: the media has now called that Dutton has lost his seat. Polls closed at 6pm, it’s now 8:50pm - it’s such a bloodbath that both of these have already been called.",
                "And! Dutton likely to lose his seat. This is the #trumpeffect",
                "Was real nervous that Liberal was gonna actually have a substantial turnout, thank god it was just in my head",
                "Fuck Murdoch!!\n\nSuck a fat one Spud, you abandoned your electorate during floods to attend billionaire fundraisers. Karma's a bitch",
                "I saw someone on facebook (someone who is American, I will note) screaming about how the Libs lose in America, the Libs lose in Australia, the libs will always lose in every country now that Trump has shown us how evil the Libs are.\n\nReading comments in this post, I think he has massively misunderstood what happened in Australia.\n\n*Edit:* Since a (now deleted) commented decided I'm Australian and started giving me shit... no, I'm also American, which is why I needed to read the comments here to understand what was happening in Australian politics.",
                "The leader of the opposition lost his own seat. Not an ideal result for him, great for Australia though",
                "Oh look someone can lose an election and accept the blame rather than claim it was stolen"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "HOT",
            "title": "Kentucky $167.3 million Powerball jackpot winner arrested days after claiming prize",
            "external_url": "https://www.nbcmiami.com/news/local/kentucky-man-arrested-in-florida-days-after-winning-167m-powerball-jackpot/3605610/",
            "upvotes": 2604,
            "date": "05/03/2025",
            "thumbnail": "https://media.nbcmiami.com/2025/05/050225-Kentucky-lottery-winner-James-Farthing.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Sure he can afford a lawyer, but kicking a deputy in the face will probably land him in jail for a bit. \n\nI would not want to be anywhere confined with criminals, with them knowing I had hit a 167.3 million jackpot.",
                "Kentucky man goes to Florida with some New Money... You know it’s gonna be a doozy.",
                "Bro had his life solved forever and decided throwing it down the toilet was the most reasonable thing to do…\n\nDammm",
                "Give Kentucky man enough money and what does he become?  Florida/Kentucky man, like some kind of hot mess hybrid experiment.",
                "Won the Powerball on Monday. Kicked a cop in the face by Wednesday. That’s one hell of a retirement plan.",
                "Guy wins the lottery and to celebrate he takes a trip to…….Tampa.",
                "TLDR: He got in a fight with someone at the hotel he was staying at, cops tried to break it up and he kicked a cop in the face and tried to run.",
                "Shocking. He looked like such a responsible guy.",
                "When keeping it real goes wrong.",
                "Chain link fence tattoo across chest?  \n\nYeah this isn't his first run in with law enforcement."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Guatemalan woman detained by Border Patrol after giving birth at Tucson hospital",
            "external_url": "https://www.kold.com/video/2025/05/03/guatemalan-woman-detained-by-border-patrol-after-giving-birth-tucson-hospital/",
            "upvotes": 652,
            "date": "05/03/2025",
            "thumbnail": "https://gray-kold-prod.gtv-cdn.com/resizer/v2/https%3A%2F%2Fdo0bihdskp9dy.cloudfront.net%2F05-03-2025%2Ft_fce97cfd4e0c4635bc92fb4422dd9436_name_file_1280x720_2000_v3_1_.jpg?auth=3ae43ee12ac0983a7dc7c57c909ced8d5378d6f03fa3c3aaea4d1b8dad16a21a&width=1200&height=600&smart=true",
            "top_comments": [
                "Jesus Christ The Onion called it again. \n\n\n\n[https://theonion.com/ice-agents-wait-at-edge-of-delivery-table-to-deport-newborn/](https://theonion.com/ice-agents-wait-at-edge-of-delivery-table-to-deport-newborn/)",
                "Better article\n\nhttps://tucson.com/news/local/border/article_7de9b512-e6e1-44bc-a61d-187a2accd22e.html\n\nShe will probably be deported but hopefully will have an actual hearing. \n\nSo sad. She must have been desperate to attempt this whole 8 months pregnant.",
                "History will see ICE and border agents viewed similarly to nazi SS.",
                "I want the health care provider who gave this woman's name, location and immigration status to ICE NAMED, SHAMED and their license pulled. Absolutely monstrous. ",
                "Way to make a headline.\n\nShe had already been detained by Border Patrol when they found her in the desert. They took her to the hospital for treatment. She gave birth and was then given back into Border Patrol custody. \n\nWhat are you all expecting here? And why are none of you actually clicking the article. OP gives it a false narrative with their post title.",
                "She was walking through the desert this week and the gives birth soon after. She planned to sneak into the border and then give birth immediately.",
                "The party of Christian values everyone! If American Christians lived at the time of Jesus’ birth they would have celebrated Herod and the Massacre of the Innocents.",
                "I told everybody I knew that Donald Trump was dangerous to this country 10 years ago and they just laughed and thought I was crazy. We are now living it.",
                "Flaming headlines. Sigh.",
                "I guess they must have run out of all those millions of 'violent gang members' to round up."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Berkshire Hathaway operating earnings drop more than expected as Buffett warns of tariff uncertainty",
            "external_url": "https://www.nbcnewyork.com/news/business/money-report/berkshire-hathaway-operating-earnings-drop-more-than-expected-as-buffett-warns-of-tariff-uncertainty/6249202/",
            "upvotes": 842,
            "date": "05/03/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/05/108140441-1746280189515-Screenshot_2025-05-03_at_94538_AM-2.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Insurance profits down nearly 50%, wildfire losses over $1B, and Buffett still won’t spend from his record $347B cash pile. If that doesn’t scream uncertainty, nothing does.",
                "The fact that he has most of his net worth on the sidelines, tells you he is expecting a recession or most likely a depression.",
                "Jeff Bezos is selling a shit ton of stock.\n\nThe ultra wealthy see the writing on the wall.",
                "Buffett is being awfully politically hostile here with those words. Better straighten up, Warren.",
                "He also called tariffs an act of war",
                "A plutocrat won’t be making as much money.  Oh no! \n/s"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "National Science Foundation Halts Funding Indefinitely",
            "external_url": "https://www.scientificamerican.com/article/under-trump-national-science-foundation-cuts-off-all-funding-to-scientists/",
            "upvotes": 4487,
            "date": "05/03/2025",
            "thumbnail": "https://static.scientificamerican.com/dam/m/2737c995ce342838/original/NSF_Logo_on-HQ.jpg?m=1746204485.782&w=1200",
            "top_comments": [
                "With all this \"cost savings\" they conveniently neglect to mention how much investment they're torching by preventing the completion of these studies.  Many years of scientific research and the funding that supported it will rot on the vine because they're effectively preventing the harvest.  They're f@#$&# liquidating taxpayer investments before they mature... At best to claim they saved a buck.  At worst to intentionally sabotage the government, the dollar, the country, and modern western society.",
                "This is so fucked! What's the point of taking intellectualism back to the fucking stone age?!??",
                "Oh God...they told us right there in print what they were going to do and people laughed.  \"Trump just being Trump\" was the most common excuse I heard \n\n\"He doesn't really mean it\"  \n\nYeah none of us are laughing now...more like screaming in terror.",
                "All of these things are traps set for anyone in the future who would try to fix the damage: they would have to spend a LOT of money to restart all these programs.",
                "\"Hell is empty, and all the devils are here.\"",
                "If you don't have a sense for scale, this is IMO the biggest news in weeks. Smart people can't do stuff without their NSF grants. Wow. ",
                "This is how you truly crash the economy.\n\nCut all funding to science, thus stifling the innovation and invention that drives the economy.",
                "Wow, I don't think ppl understand the gravity of this news. Sadly, without scientists they won't have anyone to explain it to them either. This would shutdown most University STEM research programs.",
                "Every day delayed is a week lost. Every week delayed is a month lost. Every month delayed is a year lost. Every year delayed is a decade lost.",
                "Looks like we just maxed the tech tree for this playthrough."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Man sentenced to 53 years in prison in hate crime murder of 6-year-old Palestinian-American boy",
            "external_url": "https://abcnews.go.com/US/man-sentenced-53-years-prison-hate-crime-murder/story?id=121400634",
            "upvotes": 31093,
            "date": "05/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/6d0db2c2-7dbe-4bf7-a781-e7a9021e5fb2/Alfayoumi-ap-er-250502_1746199431318_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "No matter what your political, social, cultural or religious views are, if you are killing a 6 year old as result of it, you are wrong.",
                "An Illinois man has been sentenced to 53 years in prison for the 2023 fatal stabbing of a 6-year-old Palestinian-American boy.\n\nWadee Alfayoumi was stabbed 26 times and his mother more than a dozen in the Oct. 14, 2023, attack inside their home in the Chicago suburb of Plainfield.\n\nTheir landlord, 73-year-old Joseph Czuba, was convicted in February on multiple murder charges, as well as attempted murder, aggravated battery and hate crime counts. A Will County jury found Czuba guilty of all counts after deliberating for less than two hours.\n\nAuthorities said he targeted his tenants because they were Muslim and in response to the war between Israel and Hamas that had just ignited after Hamas' Oct. 7, 2023, attack on Israel.\n\nWadee's great uncle, Mahmoud Yousef, addressed the sentencing outside the courthouse, telling reporters, \"It doesn't matter what numbers are. He took a life from us. He took a future.\"\n\nThe child's mother, Hanan Shaheen, was the first to take the stand in the weeklong trial.\n\nShe said Czuba attacked her first with a knife, stabbing her multiple times, saying, \"You devil Muslim, you must die,\" as her son watched, according  to WLS, which was in the courtroom.\n\nShe testified that she called 911 from the bathroom when he appeared to leave, but then she started to hear her son screaming, according to WLS.\n\n\"I started hearing my son screaming, screaming, screaming, 'Oh no, stop,'\" Shaheen said, according to WLS.\n\nJurors also listened to the mother's 911 call from the bathroom, in which she was heard telling the dispatcher, \"He's killing my baby,\" WLS reported.\n\nJurors additionally heard remarks Czuba made in a law enforcement vehicle following the attack.\n\n\"I thought they were going to do jihad on me,\" Czuba said, according to WLS.\n\nHe also said he was \"afraid for my life\" and his wife and said the family was \"just like infested rats,\" according to WLS.",
                "I initially thought, “damn, only 53 years?” But then I realized he’s already an old POS.",
                "\"I thought they were going to do jihad on me,\" Czuba said, according to WLS.\n\n\nWorld's smartest islamophobe",
                "[removed]",
                "It’s amazing how religious fanatics claim they love god, and think they are better than everyone else, but yet they do the work of the devil, or whatever they call him in their religion.",
                "There is a special circle of hell for people like this.",
                "Omg poor little boy. May he RIP.  Anyone that hurts a child is just a monster \n\nI really wish reddit didn’t have the news just in the middle of scrolling and saw this post, it’s so depressing and heartbreaking. As someone with a young son it just brings me such anxiety and pain to read stories of kids being killed :(",
                "This guy can rot in hell, murdering a 5-year old for his religion, there are no words",
                "You can thank Fox News and all the other right wing media for the death of this child."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Weekly measles cases hit new record amid worst outbreak since 1990s",
            "external_url": "https://www.cbsnews.com/news/weekly-measles-cases-hit-new-record-amid-worst-outbreak-since-1990s/",
            "upvotes": 716,
            "date": "05/03/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/10/9cd3b00e-2d7a-4b8c-951b-4ef66e6dfc31/thumbnail/1200x630/afe989398a5be129028acb84db47ac36/measles-0409.png?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "“Modern Americans behave as if intelligence were some sort of hideous deformity.” - Frank Zappa",
                "I will never understand why people deliberately endanger their children with a preventable disease",
                "Great job, Republicans 👏",
                "Not in Europe, strangely enough. What are they doing differently over there? /s",
                "It’s sad to see the USA which used to be the leading nation in quite a lot of areas fall down without grace.",
                "Learning about immune amnesia from the measles is sobering. \n\nEssentially, wiping up to 73% of antibodies knowledge from ALL previous immune knowledge events (vaccinations, previous infections, babies putting everything in their mouths to kids recovering from illness, etc). Taking on average 2-3 YEARS for the previous level of immune protection knowledge to be restored.  Please consider inviting a conference of knowledge to your immune system. Our bodies need this information ahead of time.\n\n\nhttps://hms.harvard.edu/news/inside-immune-amnesia\n\nhttps://asm.org/articles/2019/may/measles-and-immune-amnesia",
                "Next EO, measles will now be called Freedom Freckles.",
                "absolutely no correlation whatsoever. https://www.scientificamerican.com/article/under-trump-national-science-foundation-cuts-off-all-funding-to-scientists/",
                "It’s Biden’s fault, or Hillary, or Obama. It’s so hard to keep up with MAGA insanity.",
                "But RFK jr knows what he’s doing…"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Warren Buffett knocks tariffs and protectionism: 'Trade should not be a weapon'",
            "external_url": "https://www.cnbc.com/2025/05/03/warren-buffett-knocks-tariffs-and-protectionism-trade-should-not-be-a-weapon.html",
            "upvotes": 186,
            "date": "05/03/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108140448-1746280836757-Screenshot_2025-05-03_at_95634_AM.jpg?v=1746280907&w=1920&h=1080",
            "top_comments": [
                "He is not on the prole side.",
                "That's *rich* coming from him",
                "But this is what happens when you put someone from the dumb class in your school into the White House.",
                "Trade has always been a weapon. It's supposed to be used to ensure peace and prosperity. Not naked avarice and greed.",
                "\"It's not good for my portfolio\" \n\n\nIs the translation, here. If it was, he'd be all on board. There are no principles, only line go up.",
                "something something israeli boycott $1M fine",
                "So...we should lift sanctions on Russia? China uses trade as a weapon.  Buffett only cares about his bottom line."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Worker safety agency NIOSH lays off most remaining staff",
            "external_url": "https://www.cbsnews.com/news/worker-safety-agency-niosh-lays-off-most-remaining-staff/",
            "upvotes": 410,
            "date": "05/03/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2022/12/08/b885b605-fee8-4460-8e82-953d055fc677/thumbnail/1200x630/785fa9b659fe75c9b1f0fe90a651ac14/hypatia-h-4ffc665b28f6f1b8c6eab2cc6e053777-h-b8d48384c916d7e0fdacd908de250f1a.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "Can someone explain to me how Trump is able to legally not spend money Congress has apportioned? Does this mean a Democrat could come in and just fire all federal workers who only do work in red states?",
                "\"New requests for investigations of firefighter injuries and workplace health hazards had already stopped being accepted. A CDC plan to help Texas schools curb the spread of measles infections was also scrapped due to the layoffs. \n\nNIOSH employees receiving layoff notices late Friday included some workers for the World Trade Center Health Program, miner safety, and firefighter health programs\" \n\nThis shit gets worse every day.  Trash country full of trash people.",
                "Finally I can work without a helmet, safety glasses and harness. /s",
                "My blue collar dad used to talk about how unsafe his work was until the government started forcing the company to be safer. \n\nCan't help but wonder if companies are going to revert back.",
                "Don’t forget. No respirators or PFT’s any more. Let’s fill our lungs with silica for profit!!!",
                "Here's one most of you will call a lie, but one of my coworkers (I'm retired now) had worked at a chemical plant that made vinyl chloride, and back in the 40's-50's they had to send men inside those tanks to clean them when necessary. \n\nThe way the company did it was to lower naked men into the tank and scrape material off the sides until their scrotums started to burn.\n\nThey would bring them out, send them to shower and lower more naked guys in.\n\nHe was told this by much older and longer tenured guys when he worked there in the early Eighties.",
                "I remember working construction in 2005 or so. I would wear a mask and ear plugs doing that nasty indoor shit now. Live and learn. But we want to reverse progress again.",
                "What’s wild is how much this agency does to help firefighters and protect their long term health.  most firefighters are big time Trump supporters."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Former Illinois Gov. George Ryan dies at 91. He halted executions and went to prison for corruption",
            "external_url": "https://apnews.com/article/illinois-governor-george-ryan-hospice-executions-46a5ec5191e8820dd6905d57c8e3cd8a",
            "upvotes": 541,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "TLDR; Former Illinois Governor George Ryan passed away on May 2, 2025, at the age of 91 in Kankakee, Illinois, while under hospice care. A Republican known for his pragmatism, Ryan served as governor from 1999 to 2003. He gained international recognition for halting executions and commuting all death row sentences in Illinois, citing systemic injustices in the capital punishment system. However, his career was marred by a corruption scandal dating back to his tenure as secretary of state, leading to a 2006 conviction for racketeering, bribery, extortion, money laundering, and tax fraud. He served over five years in federal prison and was released in 2013.",
                "A relative met him and he was quite kind, goofy, and grandfatherly - at a time when we had just lost ours. It's a shame he marred his name with corruption. IL's 'wiretap' laws (all party consent everywhere audio recording) basically exist to protect this kind of crap, so it's no wonder IL's history of corruption is long and deep.",
                "If you are a top politician in Illinois and not engaging in corruption are you really even trying?",
                "Didn't have to mention that an Illinois governor went to prison for corruption.  It's just implied.",
                "At the time, I cynically though that clearing death row was a bid for some kind of legacy to distract from licenses for bribes. The ordering of his obituary suggests it worked.",
                "I’m glad Illinois has held their governors accountable, but so many of them have been criminals that it’s kinda funny at this point.",
                "You just have to say Illinois Governor. Went to prison for corruption is assumed.",
                "He was absolutely correct about the death penalty.",
                "Oh no, the person who twisted the system in order to benefit himself and put multipld people in danger at the hands of illegally licensed truckers. I'm a gasp, my jaw is on the floooor.",
                "I’m from the Kankakee area and that family was/is such an embarrassment, though many there probably support them. GR Jr is a scumbag. I used to bartend there back in the day and my boss was one of his friends so that group would come into the bar all the time, plus I just heard ALL the gossip. It’s people like them that gave me the strong urge to move 2500 miles away from there. Illinois is the worst. They act like Chicago is the only problem when 90% of the state is small towns filled with small, racist, xenophobic, nativist, homophobic, climate denying, misogynistic, anti-intellectualism minds."
            ],
            "aggregate_sentiment": 32.0
        },
        {
            "category": "NEW",
            "title": "Warren Buffett knocks tariffs and protectionism: 'Trade should not be a weapon'",
            "external_url": "https://www.cnbc.com/2025/05/03/warren-buffett-knocks-tariffs-and-protectionism-trade-should-not-be-a-weapon.html",
            "upvotes": 187,
            "date": "05/03/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108140448-1746280836757-Screenshot_2025-05-03_at_95634_AM.jpg?v=1746280907&w=1920&h=1080",
            "top_comments": [
                "He is not on the prole side.",
                "That's *rich* coming from him",
                "But this is what happens when you put someone from the dumb class in your school into the White House.",
                "Trade has always been a weapon. It's supposed to be used to ensure peace and prosperity. Not naked avarice and greed.",
                "\"It's not good for my portfolio\" \n\n\nIs the translation, here. If it was, he'd be all on board. There are no principles, only line go up.",
                "something something israeli boycott $1M fine",
                "So...we should lift sanctions on Russia? China uses trade as a weapon.  Buffett only cares about his bottom line."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Guatemalan woman detained by Border Patrol after giving birth at Tucson hospital",
            "external_url": "https://www.kold.com/video/2025/05/03/guatemalan-woman-detained-by-border-patrol-after-giving-birth-tucson-hospital/",
            "upvotes": 644,
            "date": "05/03/2025",
            "thumbnail": "https://gray-kold-prod.gtv-cdn.com/resizer/v2/https%3A%2F%2Fdo0bihdskp9dy.cloudfront.net%2F05-03-2025%2Ft_fce97cfd4e0c4635bc92fb4422dd9436_name_file_1280x720_2000_v3_1_.jpg?auth=3ae43ee12ac0983a7dc7c57c909ced8d5378d6f03fa3c3aaea4d1b8dad16a21a&width=1200&height=600&smart=true",
            "top_comments": [
                "Jesus Christ The Onion called it again. \n\n\n\n[https://theonion.com/ice-agents-wait-at-edge-of-delivery-table-to-deport-newborn/](https://theonion.com/ice-agents-wait-at-edge-of-delivery-table-to-deport-newborn/)",
                "Better article\n\nhttps://tucson.com/news/local/border/article_7de9b512-e6e1-44bc-a61d-187a2accd22e.html\n\nShe will probably be deported but hopefully will have an actual hearing. \n\nSo sad. She must have been desperate to attempt this whole 8 months pregnant.",
                "History will see ICE and border agents viewed similarly to nazi SS.",
                "I want the health care provider who gave this woman's name, location and immigration status to ICE NAMED, SHAMED and their license pulled. Absolutely monstrous. ",
                "Way to make a headline.\n\nShe had already been detained by Border Patrol when they found her in the desert. They took her to the hospital for treatment. She gave birth and was then given back into Border Patrol custody. \n\nWhat are you all expecting here? And why are none of you actually clicking the article. OP gives it a false narrative with their post title.",
                "She was walking through the desert this week and the gives birth soon after. She planned to sneak into the border and then give birth immediately.",
                "The party of Christian values everyone! If American Christians lived at the time of Jesus’ birth they would have celebrated Herod and the Massacre of the Innocents.",
                "I told everybody I knew that Donald Trump was dangerous to this country 10 years ago and they just laughed and thought I was crazy. We are now living it.",
                "Flaming headlines. Sigh.",
                "I guess they must have run out of all those millions of 'violent gang members' to round up."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Berkshire Hathaway operating earnings drop more than expected as Buffett warns of tariff uncertainty",
            "external_url": "https://www.nbcnewyork.com/news/business/money-report/berkshire-hathaway-operating-earnings-drop-more-than-expected-as-buffett-warns-of-tariff-uncertainty/6249202/",
            "upvotes": 844,
            "date": "05/03/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/05/108140441-1746280189515-Screenshot_2025-05-03_at_94538_AM-2.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Insurance profits down nearly 50%, wildfire losses over $1B, and Buffett still won’t spend from his record $347B cash pile. If that doesn’t scream uncertainty, nothing does.",
                "The fact that he has most of his net worth on the sidelines, tells you he is expecting a recession or most likely a depression.",
                "Jeff Bezos is selling a shit ton of stock.\n\nThe ultra wealthy see the writing on the wall.",
                "Buffett is being awfully politically hostile here with those words. Better straighten up, Warren.",
                "He also called tariffs an act of war",
                "A plutocrat won’t be making as much money.  Oh no! \n/s"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Kentucky $167.3 million Powerball jackpot winner arrested days after claiming prize",
            "external_url": "https://www.nbcmiami.com/news/local/kentucky-man-arrested-in-florida-days-after-winning-167m-powerball-jackpot/3605610/",
            "upvotes": 2603,
            "date": "05/03/2025",
            "thumbnail": "https://media.nbcmiami.com/2025/05/050225-Kentucky-lottery-winner-James-Farthing.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Sure he can afford a lawyer, but kicking a deputy in the face will probably land him in jail for a bit. \n\nI would not want to be anywhere confined with criminals, with them knowing I had hit a 167.3 million jackpot.",
                "Kentucky man goes to Florida with some New Money... You know it’s gonna be a doozy.",
                "Bro had his life solved forever and decided throwing it down the toilet was the most reasonable thing to do…\n\nDammm",
                "Give Kentucky man enough money and what does he become?  Florida/Kentucky man, like some kind of hot mess hybrid experiment.",
                "Won the Powerball on Monday. Kicked a cop in the face by Wednesday. That’s one hell of a retirement plan.",
                "Guy wins the lottery and to celebrate he takes a trip to…….Tampa.",
                "TLDR: He got in a fight with someone at the hotel he was staying at, cops tried to break it up and he kicked a cop in the face and tried to run.",
                "Shocking. He looked like such a responsible guy.",
                "When keeping it real goes wrong.",
                "Chain link fence tattoo across chest?  \n\nYeah this isn't his first run in with law enforcement."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Worker safety agency NIOSH lays off most remaining staff",
            "external_url": "https://www.cbsnews.com/news/worker-safety-agency-niosh-lays-off-most-remaining-staff/",
            "upvotes": 405,
            "date": "05/03/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2022/12/08/b885b605-fee8-4460-8e82-953d055fc677/thumbnail/1200x630/785fa9b659fe75c9b1f0fe90a651ac14/hypatia-h-4ffc665b28f6f1b8c6eab2cc6e053777-h-b8d48384c916d7e0fdacd908de250f1a.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "Can someone explain to me how Trump is able to legally not spend money Congress has apportioned? Does this mean a Democrat could come in and just fire all federal workers who only do work in red states?",
                "\"New requests for investigations of firefighter injuries and workplace health hazards had already stopped being accepted. A CDC plan to help Texas schools curb the spread of measles infections was also scrapped due to the layoffs. \n\nNIOSH employees receiving layoff notices late Friday included some workers for the World Trade Center Health Program, miner safety, and firefighter health programs\" \n\nThis shit gets worse every day.  Trash country full of trash people.",
                "Finally I can work without a helmet, safety glasses and harness. /s",
                "My blue collar dad used to talk about how unsafe his work was until the government started forcing the company to be safer. \n\nCan't help but wonder if companies are going to revert back.",
                "Don’t forget. No respirators or PFT’s any more. Let’s fill our lungs with silica for profit!!!",
                "Here's one most of you will call a lie, but one of my coworkers (I'm retired now) had worked at a chemical plant that made vinyl chloride, and back in the 40's-50's they had to send men inside those tanks to clean them when necessary. \n\nThe way the company did it was to lower naked men into the tank and scrape material off the sides until their scrotums started to burn.\n\nThey would bring them out, send them to shower and lower more naked guys in.\n\nHe was told this by much older and longer tenured guys when he worked there in the early Eighties.",
                "I remember working construction in 2005 or so. I would wear a mask and ear plugs doing that nasty indoor shit now. Live and learn. But we want to reverse progress again.",
                "What’s wild is how much this agency does to help firefighters and protect their long term health.  most firefighters are big time Trump supporters."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Australia reelects Labor party",
            "external_url": "https://www.abc.net.au/news/elections/federal/2025/results",
            "upvotes": 12749,
            "date": "05/03/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/5cead005ccec832c8b67962996764ab6?impolicy=wcms_crop_resize&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
            "top_comments": [
                "Dickson had the opportunity to do the funniest thing possible, and they delivered.\n\nAfter Poilievre, it’s now Dutton’s turn to lose his own seat.",
                "I love how being seen as having anything in common with Trump is the recipe for losing an election, and even losing their own seat. \n\nHe’s a loser of a man, and is contagious.",
                "For non-Australians, the Labor party is our left-leaning party. The Liberal Party (which is the conservative party) tried to take a page out of Trump’s book in its campaign, which resulted in this outcome. Honestly they would have had a much better chance if they’d stuck to their usual guns – Trump is not a popular figure among the majority of the populace (although this year a new party ran called “Trumpet of Patriots”, which has an undeniable “Make Australia Great Again” air to it. That party has so far earned over 2% of the vote… take from that what you will).",
                "Just as significant is that conservative party leader Peter Dutton (Temu Trump) has had about a 10% swing against him, so is now trailing in his own electorate and may lose his own seat\n\nEdit: the media has now called that Dutton has lost his seat. Polls closed at 6pm, it’s now 8:50pm - it’s such a bloodbath that both of these have already been called.",
                "And! Dutton likely to lose his seat. This is the #trumpeffect",
                "Was real nervous that Liberal was gonna actually have a substantial turnout, thank god it was just in my head",
                "Fuck Murdoch!!\n\nSuck a fat one Spud, you abandoned your electorate during floods to attend billionaire fundraisers. Karma's a bitch",
                "I saw someone on facebook (someone who is American, I will note) screaming about how the Libs lose in America, the Libs lose in Australia, the libs will always lose in every country now that Trump has shown us how evil the Libs are.\n\nReading comments in this post, I think he has massively misunderstood what happened in Australia.\n\n*Edit:* Since a (now deleted) commented decided I'm Australian and started giving me shit... no, I'm also American, which is why I needed to read the comments here to understand what was happening in Australian politics.",
                "The leader of the opposition lost his own seat. Not an ideal result for him, great for Australia though",
                "Oh look someone can lose an election and accept the blame rather than claim it was stolen"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "Idaho: seven people killed in highway crash near Yellowstone, police say",
            "external_url": "https://www.theguardian.com/us-news/2025/may/02/idaho-yellowstone-national-park-car-crash",
            "upvotes": 275,
            "date": "05/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7085d58f5dbcfab95e85acbed7a7229c0d6a102c/0_101_3024_1814/master/3024.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9de79548ffc5876a8a0247cb3a3c4293",
            "top_comments": [
                "Let me guess, lifted pickup driven by lifted ego went for an unsafe pass in a passing zone.",
                "I'm comfortable jumping to the conclusion that the truck driver is at fault.",
                "“I dwive a big, wed pickup twuck 🤠”",
                "That stretch is fucking dangerous. Near head on collisions by idiots happening all the time. Should have been widened to four lanes two decades ago.",
                "Good on the people that stopped to help.  They probably saved a few lives."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Federal judge strikes down Trump order targeting the law firm Perkins Coie",
            "external_url": "https://www.npr.org/2025/05/02/nx-s1-5385355/perkins-coie-trump-executive-order-law-firms",
            "upvotes": 578,
            "date": "05/03/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5293x2977+0+276/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6a%2F09%2Fecebb2d54658be17e43bdc44399e%2Fgettyimages-2203670416.jpg",
            "top_comments": [
                "A sliver of hope is left. All politicians have stopped doing their jobs. Trump has over a billion dollars in pro bono work strong armed from massive law firms. We need this branch to step it the fuck up, together.",
                "I know term limits on judges have been a popular subject, and something like 25 years would probably have few of the drawbacks while retaining most benefits, but it really must be said how incredibly important it's been that these individuals are more insulated from political consequences - in particular, party primaries.\n\nWe have numerous federalist society judges, some appointed by Trump himself, who have routinely ruled against the worst excesses of the Trump administration. Meanwhile, the Legislative branch has ceded its authority entirely."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "State Department labels Haitian gangs as terrorist organizations",
            "external_url": "https://www.nbcnews.com/news/us-news/state-department-labels-haitian-gangs-terrorists-rcna204475",
            "upvotes": 104,
            "date": "05/03/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250502-haiti-gangs-mn-1305-9ccd6f.jpg",
            "top_comments": [
                "I notice the Administration has been real quiet about Proud Boys, and other Neo-Nazis groups in America... I wonder why that is?",
                "Ah, we’ve now hit the part of the story where the GoP begin deporting black people under “Haitian gang”",
                "We the people label the current American regime and entire GOP and their allies (heritage foundation, federalist society, etc) as terrorist organizations. Trump and republicans hate America, the constitution and Americans. Al Qaeda and ISIS could never have dreamed to have harmed America and Americans as much as republicans and the trump regime have and further intend.  \n\nWHEN, not if, when we have our own version of the Nuremberg trials, these monsters will meet their just desserts. “I was just following orders” will not be accepted at all. The difference between us and them, is that even though we know they’re monsters and explicitly guilty, they will still get due process and be judged by the law.  \n\nThis bumbling kakistocracy cannot and will not survive the test of time. We the people will rise. We demand justice and an adherence the constitution and the rule of law. If one man is above the law, then all people are and anarchy will rein. Return order and end this corrupt, fascist regime.",
                "Word has really lost all meaning.  Who could have predicted",
                "This means they’re going to start sending random “Haitians” to the Salvador concentration camps.",
                "US gonna start bombing Hatian refugee camps in 3...2...",
                "The way things are going..... I'd rather have them running the government.",
                "> \"While we support efforts to target the financial support of violent gangs wreaking havoc on innocent Haitians,\" they wrote on April 30, \"we are concerned that an FTO designation, absent a clear, comprehensive U.S. strategy to defeat the gangs and their enablers, is counterproductive and will only exacerbate Haitians’ suffering.\"\n\n\nExactly, America has allowed the problem in Haiti to fester for far too long without any plan. People will talk about the previous efforts and I honestly do not care to argue over the efficacy of those efforts. It's ultimately still within the US interest and the interest of common good to address Haiti in a productive manner beyond isolating them. I have family in Haiti am I no longer supposed to send them money because the US government is going to start making sweeping accusations of relationships to gangs?",
                "Gangs 100% SHOULD be treated with the same resources as terrorists. They are a menace to communities and destroy so many young lives.",
                "A broken clock is right twice a day. \n\nThe fact of the matter is that almost any organized crime ring of a sufficient size meets the textbook definition of terrorism. By the time they amass enough power to challenge established authority systems they begin making \"political\" overtures that go beyond economic expedience.\n\nI don't trust the trump administration to fight these gangs or treat accused gang members fairly, but it is ridiculous that the Biden or Obama administrations haven't declared them terrorists already."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Australians vote in election, with high prices and housing shortage major issues",
            "external_url": "https://www.npr.org/2025/05/02/g-s1-64141/australia-election-anthony-albanese-peter-dutton",
            "upvotes": 45,
            "date": "05/03/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7614x4281+0+795/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa6%2Fd8%2F34a131ff4cfca3a8aedfc03b9090%2Fap25122816500046.jpg",
            "top_comments": [
                "Gotta love the Aussies.  Barefoot in budgie smugglers fulfilling their democratic duty!  😄",
                "Hey uh, where their pants is?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Guatemalan woman detained by Border Patrol after giving birth at Tucson hospital",
            "external_url": "https://www.kold.com/video/2025/05/03/guatemalan-woman-detained-by-border-patrol-after-giving-birth-tucson-hospital/",
            "upvotes": 652,
            "date": "05/03/2025",
            "thumbnail": "https://gray-kold-prod.gtv-cdn.com/resizer/v2/https%3A%2F%2Fdo0bihdskp9dy.cloudfront.net%2F05-03-2025%2Ft_fce97cfd4e0c4635bc92fb4422dd9436_name_file_1280x720_2000_v3_1_.jpg?auth=3ae43ee12ac0983a7dc7c57c909ced8d5378d6f03fa3c3aaea4d1b8dad16a21a&width=1200&height=600&smart=true",
            "top_comments": [
                "Jesus Christ The Onion called it again. \n\n\n\n[https://theonion.com/ice-agents-wait-at-edge-of-delivery-table-to-deport-newborn/](https://theonion.com/ice-agents-wait-at-edge-of-delivery-table-to-deport-newborn/)",
                "Better article\n\nhttps://tucson.com/news/local/border/article_7de9b512-e6e1-44bc-a61d-187a2accd22e.html\n\nShe will probably be deported but hopefully will have an actual hearing. \n\nSo sad. She must have been desperate to attempt this whole 8 months pregnant.",
                "History will see ICE and border agents viewed similarly to nazi SS.",
                "I want the health care provider who gave this woman's name, location and immigration status to ICE NAMED, SHAMED and their license pulled. Absolutely monstrous. ",
                "Way to make a headline.\n\nShe had already been detained by Border Patrol when they found her in the desert. They took her to the hospital for treatment. She gave birth and was then given back into Border Patrol custody. \n\nWhat are you all expecting here? And why are none of you actually clicking the article. OP gives it a false narrative with their post title.",
                "She was walking through the desert this week and the gives birth soon after. She planned to sneak into the border and then give birth immediately.",
                "The party of Christian values everyone! If American Christians lived at the time of Jesus’ birth they would have celebrated Herod and the Massacre of the Innocents.",
                "I told everybody I knew that Donald Trump was dangerous to this country 10 years ago and they just laughed and thought I was crazy. We are now living it.",
                "Flaming headlines. Sigh.",
                "I guess they must have run out of all those millions of 'violent gang members' to round up."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "Berkshire Hathaway operating earnings drop more than expected as Buffett warns of tariff uncertainty",
            "external_url": "https://www.nbcnewyork.com/news/business/money-report/berkshire-hathaway-operating-earnings-drop-more-than-expected-as-buffett-warns-of-tariff-uncertainty/6249202/",
            "upvotes": 842,
            "date": "05/03/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/05/108140441-1746280189515-Screenshot_2025-05-03_at_94538_AM-2.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Insurance profits down nearly 50%, wildfire losses over $1B, and Buffett still won’t spend from his record $347B cash pile. If that doesn’t scream uncertainty, nothing does.",
                "The fact that he has most of his net worth on the sidelines, tells you he is expecting a recession or most likely a depression.",
                "Jeff Bezos is selling a shit ton of stock.\n\nThe ultra wealthy see the writing on the wall.",
                "Buffett is being awfully politically hostile here with those words. Better straighten up, Warren.",
                "He also called tariffs an act of war",
                "A plutocrat won’t be making as much money.  Oh no! \n/s"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Kentucky $167.3 million Powerball jackpot winner arrested days after claiming prize",
            "external_url": "https://www.nbcmiami.com/news/local/kentucky-man-arrested-in-florida-days-after-winning-167m-powerball-jackpot/3605610/",
            "upvotes": 2602,
            "date": "05/03/2025",
            "thumbnail": "https://media.nbcmiami.com/2025/05/050225-Kentucky-lottery-winner-James-Farthing.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Sure he can afford a lawyer, but kicking a deputy in the face will probably land him in jail for a bit. \n\nI would not want to be anywhere confined with criminals, with them knowing I had hit a 167.3 million jackpot.",
                "Kentucky man goes to Florida with some New Money... You know it’s gonna be a doozy.",
                "Bro had his life solved forever and decided throwing it down the toilet was the most reasonable thing to do…\n\nDammm",
                "Give Kentucky man enough money and what does he become?  Florida/Kentucky man, like some kind of hot mess hybrid experiment.",
                "Won the Powerball on Monday. Kicked a cop in the face by Wednesday. That’s one hell of a retirement plan.",
                "Guy wins the lottery and to celebrate he takes a trip to…….Tampa.",
                "TLDR: He got in a fight with someone at the hotel he was staying at, cops tried to break it up and he kicked a cop in the face and tried to run.",
                "Shocking. He looked like such a responsible guy.",
                "When keeping it real goes wrong.",
                "Chain link fence tattoo across chest?  \n\nYeah this isn't his first run in with law enforcement."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Federal judge strikes down Trump order targeting the law firm Perkins Coie",
            "external_url": "https://www.npr.org/2025/05/02/nx-s1-5385355/perkins-coie-trump-executive-order-law-firms",
            "upvotes": 582,
            "date": "05/03/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5293x2977+0+276/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6a%2F09%2Fecebb2d54658be17e43bdc44399e%2Fgettyimages-2203670416.jpg",
            "top_comments": [
                "A sliver of hope is left. All politicians have stopped doing their jobs. Trump has over a billion dollars in pro bono work strong armed from massive law firms. We need this branch to step it the fuck up, together.",
                "I know term limits on judges have been a popular subject, and something like 25 years would probably have few of the drawbacks while retaining most benefits, but it really must be said how incredibly important it's been that these individuals are more insulated from political consequences - in particular, party primaries.\n\nWe have numerous federalist society judges, some appointed by Trump himself, who have routinely ruled against the worst excesses of the Trump administration. Meanwhile, the Legislative branch has ceded its authority entirely."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Weekly measles cases hit new record amid worst outbreak since 1990s",
            "external_url": "https://www.cbsnews.com/news/weekly-measles-cases-hit-new-record-amid-worst-outbreak-since-1990s/",
            "upvotes": 715,
            "date": "05/03/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/10/9cd3b00e-2d7a-4b8c-951b-4ef66e6dfc31/thumbnail/1200x630/afe989398a5be129028acb84db47ac36/measles-0409.png?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "“Modern Americans behave as if intelligence were some sort of hideous deformity.” - Frank Zappa",
                "I will never understand why people deliberately endanger their children with a preventable disease",
                "Great job, Republicans 👏",
                "Not in Europe, strangely enough. What are they doing differently over there? /s",
                "It’s sad to see the USA which used to be the leading nation in quite a lot of areas fall down without grace.",
                "Learning about immune amnesia from the measles is sobering. \n\nEssentially, wiping up to 73% of antibodies knowledge from ALL previous immune knowledge events (vaccinations, previous infections, babies putting everything in their mouths to kids recovering from illness, etc). Taking on average 2-3 YEARS for the previous level of immune protection knowledge to be restored.  Please consider inviting a conference of knowledge to your immune system. Our bodies need this information ahead of time.\n\n\nhttps://hms.harvard.edu/news/inside-immune-amnesia\n\nhttps://asm.org/articles/2019/may/measles-and-immune-amnesia",
                "Next EO, measles will now be called Freedom Freckles.",
                "absolutely no correlation whatsoever. https://www.scientificamerican.com/article/under-trump-national-science-foundation-cuts-off-all-funding-to-scientists/",
                "It’s Biden’s fault, or Hillary, or Obama. It’s so hard to keep up with MAGA insanity.",
                "But RFK jr knows what he’s doing…"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Australia reelects Labor party",
            "external_url": "https://www.abc.net.au/news/elections/federal/2025/results",
            "upvotes": 12754,
            "date": "05/03/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/5cead005ccec832c8b67962996764ab6?impolicy=wcms_crop_resize&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
            "top_comments": [
                "Dickson had the opportunity to do the funniest thing possible, and they delivered.\n\nAfter Poilievre, it’s now Dutton’s turn to lose his own seat.",
                "I love how being seen as having anything in common with Trump is the recipe for losing an election, and even losing their own seat. \n\nHe’s a loser of a man, and is contagious.",
                "For non-Australians, the Labor party is our left-leaning party. The Liberal Party (which is the conservative party) tried to take a page out of Trump’s book in its campaign, which resulted in this outcome. Honestly they would have had a much better chance if they’d stuck to their usual guns – Trump is not a popular figure among the majority of the populace (although this year a new party ran called “Trumpet of Patriots”, which has an undeniable “Make Australia Great Again” air to it. That party has so far earned over 2% of the vote… take from that what you will).",
                "Just as significant is that conservative party leader Peter Dutton (Temu Trump) has had about a 10% swing against him, so is now trailing in his own electorate and may lose his own seat\n\nEdit: the media has now called that Dutton has lost his seat. Polls closed at 6pm, it’s now 8:50pm - it’s such a bloodbath that both of these have already been called.",
                "And! Dutton likely to lose his seat. This is the #trumpeffect",
                "Was real nervous that Liberal was gonna actually have a substantial turnout, thank god it was just in my head",
                "Fuck Murdoch!!\n\nSuck a fat one Spud, you abandoned your electorate during floods to attend billionaire fundraisers. Karma's a bitch",
                "I saw someone on facebook (someone who is American, I will note) screaming about how the Libs lose in America, the Libs lose in Australia, the libs will always lose in every country now that Trump has shown us how evil the Libs are.\n\nReading comments in this post, I think he has massively misunderstood what happened in Australia.\n\n*Edit:* Since a (now deleted) commented decided I'm Australian and started giving me shit... no, I'm also American, which is why I needed to read the comments here to understand what was happening in Australian politics.",
                "The leader of the opposition lost his own seat. Not an ideal result for him, great for Australia though",
                "Oh look someone can lose an election and accept the blame rather than claim it was stolen"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "Worker safety agency NIOSH lays off most remaining staff",
            "external_url": "https://www.cbsnews.com/news/worker-safety-agency-niosh-lays-off-most-remaining-staff/",
            "upvotes": 407,
            "date": "05/03/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2022/12/08/b885b605-fee8-4460-8e82-953d055fc677/thumbnail/1200x630/785fa9b659fe75c9b1f0fe90a651ac14/hypatia-h-4ffc665b28f6f1b8c6eab2cc6e053777-h-b8d48384c916d7e0fdacd908de250f1a.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "Can someone explain to me how Trump is able to legally not spend money Congress has apportioned? Does this mean a Democrat could come in and just fire all federal workers who only do work in red states?",
                "\"New requests for investigations of firefighter injuries and workplace health hazards had already stopped being accepted. A CDC plan to help Texas schools curb the spread of measles infections was also scrapped due to the layoffs. \n\nNIOSH employees receiving layoff notices late Friday included some workers for the World Trade Center Health Program, miner safety, and firefighter health programs\" \n\nThis shit gets worse every day.  Trash country full of trash people.",
                "Finally I can work without a helmet, safety glasses and harness. /s",
                "My blue collar dad used to talk about how unsafe his work was until the government started forcing the company to be safer. \n\nCan't help but wonder if companies are going to revert back.",
                "Don’t forget. No respirators or PFT’s any more. Let’s fill our lungs with silica for profit!!!",
                "Here's one most of you will call a lie, but one of my coworkers (I'm retired now) had worked at a chemical plant that made vinyl chloride, and back in the 40's-50's they had to send men inside those tanks to clean them when necessary. \n\nThe way the company did it was to lower naked men into the tank and scrape material off the sides until their scrotums started to burn.\n\nThey would bring them out, send them to shower and lower more naked guys in.\n\nHe was told this by much older and longer tenured guys when he worked there in the early Eighties.",
                "I remember working construction in 2005 or so. I would wear a mask and ear plugs doing that nasty indoor shit now. Live and learn. But we want to reverse progress again.",
                "What’s wild is how much this agency does to help firefighters and protect their long term health.  most firefighters are big time Trump supporters."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Former Illinois Gov. George Ryan dies at 91. He halted executions and went to prison for corruption",
            "external_url": "https://apnews.com/article/illinois-governor-george-ryan-hospice-executions-46a5ec5191e8820dd6905d57c8e3cd8a",
            "upvotes": 543,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "TLDR; Former Illinois Governor George Ryan passed away on May 2, 2025, at the age of 91 in Kankakee, Illinois, while under hospice care. A Republican known for his pragmatism, Ryan served as governor from 1999 to 2003. He gained international recognition for halting executions and commuting all death row sentences in Illinois, citing systemic injustices in the capital punishment system. However, his career was marred by a corruption scandal dating back to his tenure as secretary of state, leading to a 2006 conviction for racketeering, bribery, extortion, money laundering, and tax fraud. He served over five years in federal prison and was released in 2013.",
                "A relative met him and he was quite kind, goofy, and grandfatherly - at a time when we had just lost ours. It's a shame he marred his name with corruption. IL's 'wiretap' laws (all party consent everywhere audio recording) basically exist to protect this kind of crap, so it's no wonder IL's history of corruption is long and deep.",
                "If you are a top politician in Illinois and not engaging in corruption are you really even trying?",
                "Didn't have to mention that an Illinois governor went to prison for corruption.  It's just implied.",
                "At the time, I cynically though that clearing death row was a bid for some kind of legacy to distract from licenses for bribes. The ordering of his obituary suggests it worked.",
                "I’m glad Illinois has held their governors accountable, but so many of them have been criminals that it’s kinda funny at this point.",
                "You just have to say Illinois Governor. Went to prison for corruption is assumed.",
                "He was absolutely correct about the death penalty.",
                "Oh no, the person who twisted the system in order to benefit himself and put multipld people in danger at the hands of illegally licensed truckers. I'm a gasp, my jaw is on the floooor.",
                "I’m from the Kankakee area and that family was/is such an embarrassment, though many there probably support them. GR Jr is a scumbag. I used to bartend there back in the day and my boss was one of his friends so that group would come into the bar all the time, plus I just heard ALL the gossip. It’s people like them that gave me the strong urge to move 2500 miles away from there. Illinois is the worst. They act like Chicago is the only problem when 90% of the state is small towns filled with small, racist, xenophobic, nativist, homophobic, climate denying, misogynistic, anti-intellectualism minds."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Idaho: seven people killed in highway crash near Yellowstone, police say",
            "external_url": "https://www.theguardian.com/us-news/2025/may/02/idaho-yellowstone-national-park-car-crash",
            "upvotes": 272,
            "date": "05/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7085d58f5dbcfab95e85acbed7a7229c0d6a102c/0_101_3024_1814/master/3024.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9de79548ffc5876a8a0247cb3a3c4293",
            "top_comments": [
                "Let me guess, lifted pickup driven by lifted ego went for an unsafe pass in a passing zone.",
                "I'm comfortable jumping to the conclusion that the truck driver is at fault.",
                "“I dwive a big, wed pickup twuck 🤠”",
                "That stretch is fucking dangerous. Near head on collisions by idiots happening all the time. Should have been widened to four lanes two decades ago.",
                "Good on the people that stopped to help.  They probably saved a few lives."
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "RISING",
            "title": "National Science Foundation Halts Funding Indefinitely",
            "external_url": "https://www.scientificamerican.com/article/under-trump-national-science-foundation-cuts-off-all-funding-to-scientists/",
            "upvotes": 4486,
            "date": "05/03/2025",
            "thumbnail": "https://static.scientificamerican.com/dam/m/2737c995ce342838/original/NSF_Logo_on-HQ.jpg?m=1746204485.782&w=1200",
            "top_comments": [
                "With all this \"cost savings\" they conveniently neglect to mention how much investment they're torching by preventing the completion of these studies.  Many years of scientific research and the funding that supported it will rot on the vine because they're effectively preventing the harvest.  They're f@#$&# liquidating taxpayer investments before they mature... At best to claim they saved a buck.  At worst to intentionally sabotage the government, the dollar, the country, and modern western society.",
                "This is so fucked! What's the point of taking intellectualism back to the fucking stone age?!??",
                "Oh God...they told us right there in print what they were going to do and people laughed.  \"Trump just being Trump\" was the most common excuse I heard \n\n\"He doesn't really mean it\"  \n\nYeah none of us are laughing now...more like screaming in terror.",
                "All of these things are traps set for anyone in the future who would try to fix the damage: they would have to spend a LOT of money to restart all these programs.",
                "\"Hell is empty, and all the devils are here.\"",
                "If you don't have a sense for scale, this is IMO the biggest news in weeks. Smart people can't do stuff without their NSF grants. Wow. ",
                "This is how you truly crash the economy.\n\nCut all funding to science, thus stifling the innovation and invention that drives the economy.",
                "Wow, I don't think ppl understand the gravity of this news. Sadly, without scientists they won't have anyone to explain it to them either. This would shutdown most University STEM research programs.",
                "Every day delayed is a week lost. Every week delayed is a month lost. Every month delayed is a year lost. Every year delayed is a decade lost.",
                "Looks like we just maxed the tech tree for this playthrough."
            ],
            "aggregate_sentiment": 18.0
        }
    ],
    "last_updated": "05/03/2025 16:09:26 UTC"
}