{
    "posts": [
        {
            "category": "HOT",
            "title": "FBI ordered to prioritize immigration, as DOJ scales back white collar cases",
            "external_url": "https://www.reuters.com/world/us/fbi-ordered-prioritize-immigration-cases-over-white-collar-crime-people-familiar-2025-05-12/",
            "upvotes": 8671,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Government full of white collar criminals scales back investigation of white collar criminals.",
                "Sounds like a lot of fraud will be happening unchecked",
                "*But as....Trump has stepped up an immigration crackdown, thousands of federal law enforcement officials from multiple agencies* [*have been*](https://www.reuters.com/world/us/thousands-agents-diverted-trump-immigration-crackdown-2025-03-22/) *enlisted to take on new work as immigration enforcers, pulling crime-fighting resources away from other areas.*\n\nSo the DOJ cuts back efforts to prosecute white-collar offenses, as in \"public [corruption](https://www.reuters.com/world/us/trumps-justice-department-hits-brakes-anti-corruption-enforcement-2025-02-12/), foreign bribery, kleptocracy and foreign influence.\"   (so racist, and so self-serving)",
                "The massive tranfer of wealth during covid wasn't enough. They will not stop until we are all slaves.",
                "Sure… why not…. Let the mortgage fraudsters steal my home and life savings.….. just as long as I can rest comfortably knowing the cucumbers in my salad weren’t sullied by the hands of an undocumented farm worker getting paid 1/2 minimum wage to do back breaking labor in the hot sun.",
                "It's corruption all the way down.",
                "So Republicans are seriously dismantling the rule of law in broad daylight, openly and proverbial crickets?!?!? ",
                "Super excited that we're going after people that are having a net positive impact on society rather than the group that is systematically siphoning off every single resource they can for themselves. We really need to take a page from the French.",
                "Just want to point out solving and therefore preventing white collar crime actually generates money and lost tax revenue.",
                "Let’s not investigate where all the hundreds million $’s of Trump’s inauguration fund went to.  Or who were the early buyers of Trump coin"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "NHL suspends Florida Panthers minority owner for ‘51st state’ posts",
            "external_url": "https://www.theguardian.com/sport/2025/may/13/doug-cifu-florida-panthers-minority-owner-suspended",
            "upvotes": 22397,
            "date": "05/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/160516a3a9f0332a5169838800d226165f8968c3/212_0_3896_3117/master/3896.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f49e825b6cf4aa22da9e14dc4d829758",
            "top_comments": [
                "What does it mean, practically, for him to be suspended from all activity with the team and the NHL?  Serious question.",
                "40% of the NHL is Canadian. 29% is American. How brain dead do you have to be to do this?",
                "Good, don’t let them normalize that propaganda",
                "Imagine having more money than you could ever spend in a lifetime and still spending your time arguing with strangers on twitter. \n\nFun side note, the Panthers have been the dirtiest team in the NHL playoffs this year and it isnt even close.",
                "Yeah, the 51st state comments are idiotic but the positive stuff about forced starvation - holy fuck, what the fuck is wrong with this man?",
                "What a fucking asshole",
                "damn I actually want the Leafs to advance, now",
                "Simping for Israel and disrespecting a neighbour's sovereignty, like chocolate and peanut butter",
                "Good.  51st state is never going to happen.  I love my American friends and I really hope we can continue a close relationship.  We provide great advancements as separate places.  Like Insulin, pacemaker, zipper, telephone, etc....  which we as a friendly continent and with rules allowing us to work together creates so many more advancements.\n\n  \nFundamentally Canada is different from the US.  \n\nThat shouldn't change.",
                "It must be so hard for people to just shut the fuck up. I don't get it"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "FDA and RFK Jr. aim to remove ingestible fluoride products used to protect kids' teeth",
            "external_url": "https://apnews.com/article/fluoride-fda-kennedy-cavities-teeth-water-22c5aefeb97c411e2fda0c4754b78cf2",
            "upvotes": 8616,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I work in peds dentistry and trust me, parents are already saying no to fluoride and no to radiographs...and often they are spending thousands in treatments for composites, pulpotomies, etc. that could have been prevented. Dental health is overlooked so often in favor of extracirriculars. \"Sorry, Timmy has baseball practice so we need to reschedule/cancel.\" Ok, so Timmy is 7 years old, is a high caries risk, and hasn't seen us in 2 years. I think he can miss one fucking practice. People's priorities are alllll outta whack.\n\nWe get a lot of \"they won't let me brush their teeth!\" too. I'm sorry, who is the parent here? They're a small child, they need your guidance. I am empathetic to a point but you have to do it. If they didn't want to shit in the toilet, would you let them do it outside too? \n\nI fear we are going to get a lot busier. 🥺\n\nEDIT:\n\nWow ok, did not expect my comment to blow up. I just want to let yall know that I feel you on multiple fronts. I have a background in dental assisting, veterinary dentistry,  medical and dental research but now I work in the admin side of dentistry (not a dentist), so the financial issues and insurance issues I deal with on a daily basis are frustrating and heart breaking. It was the same when I worked in veterinary. As much as I wish we could do this fully subsidized, the USA hates universal health care and we have to make money to feed our staff. A lot of dentists, including my own, are eschewing being in network with a lot of insurances because they pay literal pennies for procedures. I'm talking about 15-20 bucks for full surgical procedures, which with how much dental school costs...it's not economical. I highly suggest to find a dentist that has a membership plan, it is often more cost effective than dental premiums!\n\nAs for health, if you truly don't want to give your kid flouride, there are alternatives that are NOT charcoal (seriously, don't! especially if theyre on meds!). Boka has nano hydroxyapatite toothpaste that has been clinically studied and is a great alternative. But I must insist you get radiographs, as the tooth is like an iceburg. A lot goes on underneath the surface. \n\nDentistry shouldn't be a luxury. I myself have talked to my local representatives about health care and dental care being my top concern and how we are doing nothing about it. My state, CA, can do better and I want it to be better. I wish I had all the solutions, I wish everyone here can get care. But please, do not yell at the staff if insurance isn't covering procedures. We literally can't control it. 😭 And I work with a dentist who would rather never see a cavity again. It is devastating to tell a parent their kid needs several crowns, pulpotomies, composites under anesthesia.",
                "So now you’re taking my choice away as to how to best protect my kids’ health? Fuck you.",
                "My dentist literally prescribed me an extra-fluoride toothpaste to help with back molars... while RFK Jr is pushing this idiocy.\n\nAt this point I'm half-expecting Trump to appoint a 'czar of software'.. who just installs backdoors into agencies, wrecks the systems, and steals all the data.\n\n*oh wait.*",
                "> Instead, the FDA will ask manufacturers to voluntarily pull their products, according to an administration official.\n\nIf I was a manufacturer, my reply to that ask would be \"fuck you.\"\n\n> FDA Commissioner Marty Makary said the products pose a risk when swallowed because they may interfere with healthy gut bacteria that are critical to digestion, immunity and other key bodily functions. \n\nMeanwhile, Brainworm is out there getting MAHA parents to [pump their kids full of vitamin A to toxic levels](https://www.washingtonpost.com/wellness/2025/04/07/vitamin-a-poisoning-measles-rfk-jr/).\n\nGovernment falling from the stupid tree and hitting every branch on the way down.",
                "Wait til they hear about chlorine and its effects on beneficial bacteria.",
                "And when kids’ teeth start getting more unhealthy, the same parents who cheer for this will complain and blame literally anyone else.",
                "What happened to all those anti-vaxxers yelling “my body, my choice” now that the government is dictating what they can and cannot have?",
                "The idiot shouldn’t be in charge of our country’s health",
                "do I need to hoard fluoride toothpaste now?",
                "I don't understand. There are fluoride-free mouthwashes and toothpastes already on the market. Some of us want fluoride toothpaste/mouth washes."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Grand jury indicts Milwaukee County judge after prosecutors allege she helped a man evade ICE",
            "external_url": "https://www.wpr.org/news/grand-jury-indicts-milwaukee-county-judge-allege-helped-man-evade-ice",
            "upvotes": 3366,
            "date": "05/13/2025",
            "thumbnail": "https://www.wpr.org/wp-content/uploads/2025/05/dugan1.jpg",
            "top_comments": [
                "In summary, an administrative warrant is issued by a government agency for regulatory or administrative purposes, while a judicial warrant is issued by a court for criminal or civil law enforcement.",
                "As the old saying goes, a grand jury would indict a ham sandwich if that’s what the prosecutor wanted.\n\nGrand jury indictments are just a rubber stamp.",
                "All governmental officials should be held to account. Let's start with, idk, maybe the fucking President?",
                "I’ve served on a grand jury and can clearly explain what happens there. Grand juries do not need proof beyond a reasonable doubt, they just need to be presented with enough evidence to lead a reasonable person to believe there’s enough evidence to charge somebody with a crime. The bar is much lower to indict somebody.",
                "> Prosecutors allege she broke federal law by helping a man evade immigration enforcement last month.\n\nLegal Eagle did a great breakdown on this whole case. The funniest part is that the door she let the man “escape” through led…right back to the main hallway where officers were waiting lol\n\nSo basically they’re going to argue either she didn’t know how her own courthouse hallways work, or somehow she did know and it still counts as helping him “escape” by leading him straight back to them!\n\nEDIT: For people wanting to dispute what I say above, please watch [the Legal Eagle video](https://m.youtube.com/watch?v=TPQeZalnArY&pp=0gcJCYsJAYcqIYzv) before doing so.",
                "This is crazy. She let him out through a different exit that lead to the SAME public hallway as where the ICE agents were waiting. The agents even rode down the elevator with the guy and his lawyer before they arrested him outside.",
                "Hope democrats remember this next time they debate 3 years whether to charge Trump or any republican for any of the crimes they commit.",
                "Sounds like someone is getting due process.",
                "Once you guys get rid of that pesky legal system you have, and kill the media, you’re done. \n\nCurrently you’re already done for tourism $$$. 🤔",
                "Reminder: the people who hid Anne Frank were breaking the law, the Nazis that killed her were following the law."
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "HOT",
            "title": "Small nodule found in Joe Biden's prostate during recent physical",
            "external_url": "https://abcnews.go.com/US/small-nodule-found-joe-bidens-prostate-recent-physical/story?id=121743026",
            "upvotes": 10837,
            "date": "05/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/270fecd5-10fa-4ed7-a838-ebd3333d8383/biden-main_1747135541861_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I’m a doctor. MOST men will die with pathology confirmed prostate cancer (I forget the exact number but I think it’s like 80%). Unless it is widely metastasized, joe Biden will die LONG before this cancer has any effect on his health.",
                "I would like to unsubscribe from Joe Biden Prostate Facts",
                "Wild that we can know what’s going on inside Joe biden’s asshole but we can’t get an accurate height and weight of the president. ",
                "Yeah I’m glad I’m not famous",
                "Breaking news, old guy has stuff going on physically. More at 11.",
                ">\"In a routine physical exam a small nodule was found in the prostate which necessitated further evaluation,\" a spokesperson told ABC News.\n\nGood time to remind everyone to get checked regularly.",
                "I feel like this information has just been forced upon me against my will.\n\nI'm not happy about this.",
                "Small nodule found in Trump's prostate is just Lindsey Graham.",
                "Prostate cancer is pretty slow, so given his age it's entirely more likely that he'll end up going in his sleep a long while before this gets anywhere super serious.",
                "[removed]"
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "HOT",
            "title": "NZ travellers warned of increased detention risk at US border.",
            "external_url": "https://www.rnz.co.nz/news/national/560934/nz-travellers-warned-of-increased-detention-risk-at-us-border",
            "upvotes": 1654,
            "date": "05/13/2025",
            "thumbnail": "https://media.rnztools.nz/rnz/image/upload/s--mQRZXNTX--/t_tohu-badge-facebook/v1718217761/4KONW15_immigration07_jpg?_a=BACCd2AD",
            "top_comments": [
                "I’m a NZ’er born & raised. I’ve lived in the US 24yrs & am a dual NZ/US citizen. When I arrived back in the US on my US Passport about 5 years ago, the Immigration Officer looked at my passport (again US CITIZEN on a US PASSPORT) & said, “*Where are you from?*” \n\nMe: “*Montana - just returning home.*” \n\nHim: “*I didn’t ask where you live, I asked where you’re from.*” \n\nMe: “*I’m originally from New Zealand.*”\n\nHim: “*THAT’s where you’re from. You’re not from Montana - that’d be good for you to remember. Most Americans don’t have 2 middle names. NEXT!*” 👋🏽🤨\n\nI’ve arrived in the US many, many times as a non-citizen *before* all this hullabaloo started & it was bad enough then. But THIS is how they treat US citizens - think about how bad it’s going to be now for foreign visitors.",
                "The United States is not a safe place for foreigners.",
                "Amazing how quickly the US turned into a shithole country",
                "I have friends who were coming from Europe to SGF in California next month that have cancelled because they don’t wanna risk it. This sucks.",
                "Welcome to the club NZ!",
                "The travel agencies and airlines should have to stop advertising deals to the US, too, as it’s just encouraging a very unsafe activity.",
                "I certainly wouldn’t visit from another country. I wouldn’t recommend it at all.",
                "“This is gonna ruin the tour.” - Lorde",
                "Our governed right now is the world's most powerful criminal organization....it ain't safe here",
                "Strange how the article mentions they’ve had issues since November 2024. Seems like it’s been a bipartisan issue."
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "HOT",
            "title": "Judge agrees to resentence Menendez brothers over 1989 murders",
            "external_url": "http://www.bbc.com/news/articles/c2e3xnx471wo.amp",
            "upvotes": 1169,
            "date": "05/14/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d530/live/f1d0a470-308d-11f0-8519-3b5a01ebe413.jpg",
            "top_comments": [
                ">Judge Michael Jesic gave Erik and Lyle Menendez a new sentence of 50 years to life. A decision on their potential release will be made at a parole hearing in June.\n\nTheir previous sentence had no possibility of parole. That's the major change, here.",
                "Why is the Picture black & white. We had colour in the 80",
                "That's a lot of murders",
                "Reddit has a weird fetish with upper middle class murderers.",
                "Father was extremely abusive, sexual and emotionally. Other family members corroborated that. The mother was more abusive with the oldest son and the father with the youngest. \n\nOne anecdote is that their father killed their pet bunny for Christ’s sake. \n\nThey should not have killed them but they have been punished enough.",
                "Ok just 40 more years",
                "Netflix documentary came out about them.",
                "They had a great time at the Lakers game",
                "As a guy who was sexually abused,I can tell you the double standard is real, Judging by the record, they have not been in trouble since in the jail, they have actually helped a lot of people and they seem remorseful. So why shouldn't they at least get the possibility of a second chance.",
                "My brother was horrifically sexually abused by his father, which led to my brother’s death in his early 20s. But he didn’t kill his dad. \n\nBut then, his dad wasn’t wealthy, like the Menendez parents."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "US strikes $600bn deal with Saudi Arabia as Donald Trump's Middle East tour begins",
            "external_url": "https://www.lbc.co.uk/usa/politics/us-strikes-600bn-deal-with-saudi-arabia-donal-trumps-middle-east-tour-continues/",
            "upvotes": 5979,
            "date": "05/13/2025",
            "thumbnail": "https://images.lbc.co.uk/images/723443?width=1200&crop=16_9&signature=ANwtk71HDdQkmTLCnEwBHzZnEEg=",
            "top_comments": [
                "\"Mr. President, a second plane just got gifted to you\"",
                "Also from the article.\n\n“*Meanwhile, Trump also struck a deal with China on Monday to cut tariffs by 115% over the next 90 days in what could spell the end of his administration's global trade war.”*\n\nNo mention of the 30% tariff that remains in place or the de minimus exemption that became a 54% tariff or the 10% across the board tariffs or the 25% auto tariffs or… \n\nJournalism is dead.",
                "MAGA has sold America to rich Arabs, Russian oligarchs, tech billionaires, and A.I. lobbyists.",
                "Further proof that Saudi Arabia owns Clinton and Biden, right MAGA?",
                "In 2024, Saudi Arabia's GDP reached approximately $1.09 trillion at current prices.\n\nSo they’ve pledged approximately 60% of their annual gdp to invest in the USA.",
                "One can guess how much he'll personally get out of this deal.",
                "Remember when Trump was president for the 1st time,  and that Saudi born journalist was hacked into small pieces? Do you also remember when shortly after, Trump met the butcher himself and he shook his still bloody hands and greeted him with a smile?  He almost makes Trump seem tame",
                "I wonder if the name Jamal Khashoggi came up during their conversation",
                "Turns out we do negotiate with terrorists.",
                "Forgot about 9/11 real quick when there's a buck to be made. Now they're selling the saudi's their best military tech. So much winning."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "UnitedHealth suspends annual forecast, CEO Andrew Witty steps down",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/unitedhealth-ceo-andrew-witty-steps-down-2025-05-13/",
            "upvotes": 15547,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "My company recently moved insurance from Blue Cross/Blue Shield over to this hot mess. Man, when I tell ya…absolutely *dog shit* insurance company. We went from pretty good coverage to them nickel and diming over everything. Would strongly advise to stay away from UnitedHealth.",
                "I hope UnitedHealth continues to go under. Awful company. Their denial rate is 2x that of the industry average. Total scam of a company",
                "\"CEO Andrew Witty steps down\"\n\n'Hey guys, make sure EVERYONE knows I'm not CEO of UnitedHealth anymore. Issue press releases, take out ads, maybe put up a banner with the new guys face on it....'",
                "[Understanding the Change Healthcare Breach and Its Impact on Security Compliance](https://hyperproof.io/resource/understanding-the-change-healthcare-breach/)\n\nIn short, quite possibly the largest healthcare data breach in history occurred under his watch.",
                "Sounds like fall out from the lawsuit. Good thing stockholders get taken care of. God forbid someone does anything to prevent another CEO being killed. All about those dollar bills.",
                "> surging medical costs send its shares plunging more than 11%\n\nWhich is a perfect example of why medical care should not be a for-profit enterprise.",
                "In simple terms, my rates are going up, big time",
                "This was moments after the board voted against metal detectors outside annual forecast meetings",
                "Maybe healthcare shouldn't be tied to a stock ticker?",
                "I never buy personal reasons.  Had a few people leave my company like that.  One cared way too much and it showed as she was doing her two weeks.  She finally told us it was a silent layoff.  Our boss left for personal reasons with no job at the same time.  \n\nShit is going sideways after the shooting and this guy either wasnt doing what he needed/asked to do or he just fucked it all up and the board said time to go.  \n\nHe could have something personal too.  He’s human.  But with the other stuff.  Seems like board asked him to leave."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Georgia college student remains in ICE custody after mistaken traffic stop",
            "external_url": "https://abcnews.go.com/US/georgia-college-student-remains-ice-custody-after-mistaken/story?id=121733067",
            "upvotes": 6144,
            "date": "05/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/145e291d-1815-44a8-887f-9b25c2025ec8/daltonstate_1747092879614_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I'd like to know how she ended up in ICE custody. She gets pulled over by mistake (charges have already been dismissed), and then what? Are the cops asking for the immigration status of everyone they pull over? Was she driving without a DL which triggers inquiry and then ICE arrives to detain her while they figure out if she's legal? Same with her father who got pulled over going 19mph over the limit. For most people, this is a ticket and then you go home. What is going on between them getting pulled over and detained so they end up with ICE? Because ICE can't pull people over.\n\nThere is no central registry of citizens. The only documents which prove your citizenship are your passport, naturalization certificate, or birth certificate, which most people don't carry with them at all times.. Which to me means that cops are looping in ICE on anyone they may suspect to be undocumented... and I don't see how that isn't effectively just racial profiling on Latinos in the United States.",
                "The article makes it sound like she actually is and always has been undocumented. I'm asking because I truly have no idea; how does an undocumented person obtain a driver's license and enroll in a university? ",
                "Reading the article it says she’s been in the U.S. since she was 4yo but her parents say she couldn’t register under DACA since the program ended. I thought DACA is technically still in place? Or at least it shouldve been 10 years ago unless I’m reading this wrong",
                "This is beyond scary at this point.",
                "[removed]",
                "Yeeep. There was another case of someone getting \"accidentally\" taken in by ICE only to find out there's a mandatory 48 hour holding period no exceptions in Florida I think? \n\nBasically if ICE or cops working with ICE want to grab you off the street even if you have full citizenship and papers to prove you are a citizen you have to lose 48 hours of your life in a cell regardless.\n\nAnd if such policy is imposed specifically on Hispanic people for the suspicion of being undocumented people from south America well...\n\nBeing Hispanic is technically still legal. But functionally? Up for debate depending on the mood of people with all the authority in the world to fuck up your life at least for a few days at a time.",
                "19 mph over is a violent offender?",
                "welcome to a USA where everyone who looks a little too brown can be detained by ICE.",
                "\"We're going after violent criminals and gangs\"\n\n*Goes after working families and students*",
                "We legals have nothing to worry about?  \n  Yeah, sure...  \n  \nEDIT:  \nHey clowns, I never said she was legal.  Learn to read and stop making false assumptions."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "12-and-13-year-old arrested for capital murder in connection to deadly Del Valle shooting",
            "external_url": "https://www.fox7austin.com/news/12-and-13-year-old-arrested-capital-murder-connection-deadly-del-valle-shooting",
            "upvotes": 17,
            "date": "05/14/2025",
            "thumbnail": "https://images.foxtv.com/static.fox7austin.com/www.fox7austin.com/content/uploads/2025/05/1280/720/burg.jpg?ve=1&tl=1",
            "top_comments": [
                ">  Anthony Salas, 20, was shot, hit with a vehicle, and killed as he tried to get his family's stolen vehicle back near the intersection.\n\nKids being criminals. Terrible.",
                "GOP “We need more guns” arm everyone will make it safer 🤦🏻‍♂️"
            ],
            "aggregate_sentiment": 23.0
        },
        {
            "category": "NEW",
            "title": "2 visitors shot in downtown Harrisburg in separate incidents, raising safety concerns",
            "external_url": "https://www.pennlive.com/crime/2025/05/two-visitors-shot-in-downtown-harrisburg-in-separate-incidents-raising-safety-questions.html",
            "upvotes": 80,
            "date": "05/14/2025",
            "thumbnail": "https://www.pennlive.com/resizer/v2/53I6CHVUC5ATHJ37CMDUKQQVZQ.jpg?auth=7337ca3b8b7ef7aaf31cd7b0faff12f03d89fe8ad69577c34705d719ad6be090&width=1280&quality=90",
            "top_comments": [
                "Link to archived/non-paywall version of article here:\n\nhttps://archive.ph/kShhm",
                "\"Separate incidents\"\n\nMy detective skills say that there is a connection between both shootings.\n\n  \nHappy cake day OP!",
                "> Police Lt. Kyle Gautsch said they have no indication that the shootings were connected. Instead, they appear to be separate incidents, he said\n\nTwo shootings, one night apart, 30 minutes difference between each shooting, one block away from each other…but totally not connected? That’s quite an interesting take."
            ],
            "aggregate_sentiment": 52.0
        },
        {
            "category": "NEW",
            "title": "Judge agrees to resentence Menendez brothers over 1989 murders",
            "external_url": "http://www.bbc.com/news/articles/c2e3xnx471wo.amp",
            "upvotes": 1168,
            "date": "05/14/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d530/live/f1d0a470-308d-11f0-8519-3b5a01ebe413.jpg",
            "top_comments": [
                ">Judge Michael Jesic gave Erik and Lyle Menendez a new sentence of 50 years to life. A decision on their potential release will be made at a parole hearing in June.\n\nTheir previous sentence had no possibility of parole. That's the major change, here.",
                "Why is the Picture black & white. We had colour in the 80",
                "That's a lot of murders",
                "Reddit has a weird fetish with upper middle class murderers.",
                "Father was extremely abusive, sexual and emotionally. Other family members corroborated that. The mother was more abusive with the oldest son and the father with the youngest. \n\nOne anecdote is that their father killed their pet bunny for Christ’s sake. \n\nThey should not have killed them but they have been punished enough.",
                "Ok just 40 more years",
                "Netflix documentary came out about them.",
                "They had a great time at the Lakers game",
                "As a guy who was sexually abused,I can tell you the double standard is real, Judging by the record, they have not been in trouble since in the jail, they have actually helped a lot of people and they seem remorseful. So why shouldn't they at least get the possibility of a second chance.",
                "My brother was horrifically sexually abused by his father, which led to my brother’s death in his early 20s. But he didn’t kill his dad. \n\nBut then, his dad wasn’t wealthy, like the Menendez parents."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "FBI ordered to prioritize immigration, as DOJ scales back white collar cases",
            "external_url": "https://www.reuters.com/world/us/fbi-ordered-prioritize-immigration-cases-over-white-collar-crime-people-familiar-2025-05-12/",
            "upvotes": 8681,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Government full of white collar criminals scales back investigation of white collar criminals.",
                "Sounds like a lot of fraud will be happening unchecked",
                "*But as....Trump has stepped up an immigration crackdown, thousands of federal law enforcement officials from multiple agencies* [*have been*](https://www.reuters.com/world/us/thousands-agents-diverted-trump-immigration-crackdown-2025-03-22/) *enlisted to take on new work as immigration enforcers, pulling crime-fighting resources away from other areas.*\n\nSo the DOJ cuts back efforts to prosecute white-collar offenses, as in \"public [corruption](https://www.reuters.com/world/us/trumps-justice-department-hits-brakes-anti-corruption-enforcement-2025-02-12/), foreign bribery, kleptocracy and foreign influence.\"   (so racist, and so self-serving)",
                "The massive tranfer of wealth during covid wasn't enough. They will not stop until we are all slaves.",
                "Sure… why not…. Let the mortgage fraudsters steal my home and life savings.….. just as long as I can rest comfortably knowing the cucumbers in my salad weren’t sullied by the hands of an undocumented farm worker getting paid 1/2 minimum wage to do back breaking labor in the hot sun.",
                "It's corruption all the way down.",
                "So Republicans are seriously dismantling the rule of law in broad daylight, openly and proverbial crickets?!?!? ",
                "Super excited that we're going after people that are having a net positive impact on society rather than the group that is systematically siphoning off every single resource they can for themselves. We really need to take a page from the French.",
                "Just want to point out solving and therefore preventing white collar crime actually generates money and lost tax revenue.",
                "Let’s not investigate where all the hundreds million $’s of Trump’s inauguration fund went to.  Or who were the early buyers of Trump coin"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Grand jury indicts Milwaukee County judge after prosecutors allege she helped a man evade ICE",
            "external_url": "https://www.wpr.org/news/grand-jury-indicts-milwaukee-county-judge-allege-helped-man-evade-ice",
            "upvotes": 3366,
            "date": "05/13/2025",
            "thumbnail": "https://www.wpr.org/wp-content/uploads/2025/05/dugan1.jpg",
            "top_comments": [
                "In summary, an administrative warrant is issued by a government agency for regulatory or administrative purposes, while a judicial warrant is issued by a court for criminal or civil law enforcement.",
                "As the old saying goes, a grand jury would indict a ham sandwich if that’s what the prosecutor wanted.\n\nGrand jury indictments are just a rubber stamp.",
                "All governmental officials should be held to account. Let's start with, idk, maybe the fucking President?",
                "I’ve served on a grand jury and can clearly explain what happens there. Grand juries do not need proof beyond a reasonable doubt, they just need to be presented with enough evidence to lead a reasonable person to believe there’s enough evidence to charge somebody with a crime. The bar is much lower to indict somebody.",
                "> Prosecutors allege she broke federal law by helping a man evade immigration enforcement last month.\n\nLegal Eagle did a great breakdown on this whole case. The funniest part is that the door she let the man “escape” through led…right back to the main hallway where officers were waiting lol\n\nSo basically they’re going to argue either she didn’t know how her own courthouse hallways work, or somehow she did know and it still counts as helping him “escape” by leading him straight back to them!\n\nEDIT: For people wanting to dispute what I say above, please watch [the Legal Eagle video](https://m.youtube.com/watch?v=TPQeZalnArY&pp=0gcJCYsJAYcqIYzv) before doing so.",
                "This is crazy. She let him out through a different exit that lead to the SAME public hallway as where the ICE agents were waiting. The agents even rode down the elevator with the guy and his lawyer before they arrested him outside.",
                "Hope democrats remember this next time they debate 3 years whether to charge Trump or any republican for any of the crimes they commit.",
                "Sounds like someone is getting due process.",
                "Once you guys get rid of that pesky legal system you have, and kill the media, you’re done. \n\nCurrently you’re already done for tourism $$$. 🤔",
                "Reminder: the people who hid Anne Frank were breaking the law, the Nazis that killed her were following the law."
            ],
            "aggregate_sentiment": 52.0
        },
        {
            "category": "NEW",
            "title": "NZ travellers warned of increased detention risk at US border.",
            "external_url": "https://www.rnz.co.nz/news/national/560934/nz-travellers-warned-of-increased-detention-risk-at-us-border",
            "upvotes": 1653,
            "date": "05/13/2025",
            "thumbnail": "https://media.rnztools.nz/rnz/image/upload/s--mQRZXNTX--/t_tohu-badge-facebook/v1718217761/4KONW15_immigration07_jpg?_a=BACCd2AD",
            "top_comments": [
                "I’m a NZ’er born & raised. I’ve lived in the US 24yrs & am a dual NZ/US citizen. When I arrived back in the US on my US Passport about 5 years ago, the Immigration Officer looked at my passport (again US CITIZEN on a US PASSPORT) & said, “*Where are you from?*” \n\nMe: “*Montana - just returning home.*” \n\nHim: “*I didn’t ask where you live, I asked where you’re from.*” \n\nMe: “*I’m originally from New Zealand.*”\n\nHim: “*THAT’s where you’re from. You’re not from Montana - that’d be good for you to remember. Most Americans don’t have 2 middle names. NEXT!*” 👋🏽🤨\n\nI’ve arrived in the US many, many times as a non-citizen *before* all this hullabaloo started & it was bad enough then. But THIS is how they treat US citizens - think about how bad it’s going to be now for foreign visitors.",
                "The United States is not a safe place for foreigners.",
                "Amazing how quickly the US turned into a shithole country",
                "I have friends who were coming from Europe to SGF in California next month that have cancelled because they don’t wanna risk it. This sucks.",
                "Welcome to the club NZ!",
                "The travel agencies and airlines should have to stop advertising deals to the US, too, as it’s just encouraging a very unsafe activity.",
                "I certainly wouldn’t visit from another country. I wouldn’t recommend it at all.",
                "“This is gonna ruin the tour.” - Lorde",
                "Our governed right now is the world's most powerful criminal organization....it ain't safe here",
                "Strange how the article mentions they’ve had issues since November 2024. Seems like it’s been a bipartisan issue."
            ],
            "aggregate_sentiment": 11.0
        },
        {
            "category": "NEW",
            "title": "No winners in tariffs wars or trade wars': Xi Jinping makes first public remarks after tariff rollback",
            "external_url": "https://edition.cnn.com/2025/05/13/business/video/china-us-trade-truce-tariff-war-xi-jinping-digvid",
            "upvotes": 691,
            "date": "05/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/xi-trade-sot-thumb.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Bet we'd find some winners if we check the investment accounts of some Senators.",
                "Ordinary  people- public lost  as always.",
                "The rich people win .. last week to this week a shitload of rich people made money on the stock market",
                "Not much of a trade war in the end. The USA imposed tariffs. China retaliated. The USA folded.\n\nThings got worse, for all the ordinary folks out there, because of the multiple shocks to the economy and the loss of trust and stability in the global economy. But past that nothing was really achieved.",
                "When markets are being manipulated likes this, rich people are making bank",
                "The world is a seriously fucked up place when I agree with the chinese govt on something.",
                "Xi is winning the public relations battle of this. He's not pissing on anyone and he's not dangling tariffs. China isn't the aggressor in this, America is and that puts Xi in a really comfortable position.",
                "I wonder how big the bribe was that Trump took.",
                "The Chinese know this. The rest of the world knows this. Most Americans know this. Why we are letting a sociopath wreck everything is beyond me.",
                "Nobody’s ever seen a trade war like this, folks. Tremendous success. I did it. Nobody thought it could be done. The greatest trade war of all time, everyone is saying it. Many people."
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "NEW",
            "title": "$100 million New Jersey deli fraudsters father and son sentenced to prison",
            "external_url": "https://www.cnbc.com/2025/05/13/new-jersey-deli-sentencing-coker-stock.html",
            "upvotes": 675,
            "date": "05/13/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107209973-1678979529762-img_5443.jpg?v=1734642839&w=1920&h=1080",
            "top_comments": [
                "Just off the headline, Satriale's spontaneously came to mind.",
                "Oh dang. I remember following this when it was first in the news, but it fell off and I never knew anyone got arrested for it.",
                "Hope they are state charges otherwise the pardon is probably being drafted currently.",
                "Trump will probably pardon them",
                "Soon to be pardoned by the president as per the new standard",
                "Too bad New York real estate fraudster father and son weren’t sent to prison.",
                "Six months in jail, six months at home, and a 1/100 fine on the $100M.  Pay a penny for every dollar scammed? I'd say crime pays, and it pays well.\n\n> Earlier Tuesday, his father, North Carolina businessman Peter Coker Sr., was sentenced to six months in jail, to be followed by six months of home confinement, for his role in the case.\n> \n> During his sentencing, Coker Sr. was ordered to pay a $500,000 fine and pay up to $644,000 in restitution.",
                "Turns out those guys were full of baloney.",
                "Probably- I told you my sandwiches are worth 1M dollars each- I ain’t playing player - pay up !",
                "Our new FDA supervisor."
            ],
            "aggregate_sentiment": 27.0
        },
        {
            "category": "NEW",
            "title": "Liberty County, Texas: Constable involved in fatal UTV crash that killed one, injured another",
            "external_url": "https://bluebonnetnews.com/2025/05/12/liberty-county-constable-involved-in-fatal-utv-crash-that-killed-one-injured-another/",
            "upvotes": 126,
            "date": "05/13/2025",
            "thumbnail": "https://bluebonnetnews.com/wp-content/uploads/2018/07/TxDPS-seal-1.jpg",
            "top_comments": [
                "Oh, there was alcohol involved.",
                "So this going to be another \"local PD raid newspaper\" situation",
                "Phrasing for these articles is always so nice.\n\n\n\"Involved\" meaning she was the driver who crashed the vehicle.",
                "Most UTVs arent street legal and are NOT meant for roadway speeds."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "FDA and RFK Jr. aim to remove ingestible fluoride products used to protect kids' teeth",
            "external_url": "https://apnews.com/article/fluoride-fda-kennedy-cavities-teeth-water-22c5aefeb97c411e2fda0c4754b78cf2",
            "upvotes": 8616,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I work in peds dentistry and trust me, parents are already saying no to fluoride and no to radiographs...and often they are spending thousands in treatments for composites, pulpotomies, etc. that could have been prevented. Dental health is overlooked so often in favor of extracirriculars. \"Sorry, Timmy has baseball practice so we need to reschedule/cancel.\" Ok, so Timmy is 7 years old, is a high caries risk, and hasn't seen us in 2 years. I think he can miss one fucking practice. People's priorities are alllll outta whack.\n\nWe get a lot of \"they won't let me brush their teeth!\" too. I'm sorry, who is the parent here? They're a small child, they need your guidance. I am empathetic to a point but you have to do it. If they didn't want to shit in the toilet, would you let them do it outside too? \n\nI fear we are going to get a lot busier. 🥺\n\nEDIT:\n\nWow ok, did not expect my comment to blow up. I just want to let yall know that I feel you on multiple fronts. I have a background in dental assisting, veterinary dentistry,  medical and dental research but now I work in the admin side of dentistry (not a dentist), so the financial issues and insurance issues I deal with on a daily basis are frustrating and heart breaking. It was the same when I worked in veterinary. As much as I wish we could do this fully subsidized, the USA hates universal health care and we have to make money to feed our staff. A lot of dentists, including my own, are eschewing being in network with a lot of insurances because they pay literal pennies for procedures. I'm talking about 15-20 bucks for full surgical procedures, which with how much dental school costs...it's not economical. I highly suggest to find a dentist that has a membership plan, it is often more cost effective than dental premiums!\n\nAs for health, if you truly don't want to give your kid flouride, there are alternatives that are NOT charcoal (seriously, don't! especially if theyre on meds!). Boka has nano hydroxyapatite toothpaste that has been clinically studied and is a great alternative. But I must insist you get radiographs, as the tooth is like an iceburg. A lot goes on underneath the surface. \n\nDentistry shouldn't be a luxury. I myself have talked to my local representatives about health care and dental care being my top concern and how we are doing nothing about it. My state, CA, can do better and I want it to be better. I wish I had all the solutions, I wish everyone here can get care. But please, do not yell at the staff if insurance isn't covering procedures. We literally can't control it. 😭 And I work with a dentist who would rather never see a cavity again. It is devastating to tell a parent their kid needs several crowns, pulpotomies, composites under anesthesia.",
                "So now you’re taking my choice away as to how to best protect my kids’ health? Fuck you.",
                "My dentist literally prescribed me an extra-fluoride toothpaste to help with back molars... while RFK Jr is pushing this idiocy.\n\nAt this point I'm half-expecting Trump to appoint a 'czar of software'.. who just installs backdoors into agencies, wrecks the systems, and steals all the data.\n\n*oh wait.*",
                "> Instead, the FDA will ask manufacturers to voluntarily pull their products, according to an administration official.\n\nIf I was a manufacturer, my reply to that ask would be \"fuck you.\"\n\n> FDA Commissioner Marty Makary said the products pose a risk when swallowed because they may interfere with healthy gut bacteria that are critical to digestion, immunity and other key bodily functions. \n\nMeanwhile, Brainworm is out there getting MAHA parents to [pump their kids full of vitamin A to toxic levels](https://www.washingtonpost.com/wellness/2025/04/07/vitamin-a-poisoning-measles-rfk-jr/).\n\nGovernment falling from the stupid tree and hitting every branch on the way down.",
                "Wait til they hear about chlorine and its effects on beneficial bacteria.",
                "And when kids’ teeth start getting more unhealthy, the same parents who cheer for this will complain and blame literally anyone else.",
                "What happened to all those anti-vaxxers yelling “my body, my choice” now that the government is dictating what they can and cannot have?",
                "The idiot shouldn’t be in charge of our country’s health",
                "do I need to hoard fluoride toothpaste now?",
                "I don't understand. There are fluoride-free mouthwashes and toothpastes already on the market. Some of us want fluoride toothpaste/mouth washes."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "NZ travellers warned of increased detention risk at US border.",
            "external_url": "https://www.rnz.co.nz/news/national/560934/nz-travellers-warned-of-increased-detention-risk-at-us-border",
            "upvotes": 1654,
            "date": "05/13/2025",
            "thumbnail": "https://media.rnztools.nz/rnz/image/upload/s--mQRZXNTX--/t_tohu-badge-facebook/v1718217761/4KONW15_immigration07_jpg?_a=BACCd2AD",
            "top_comments": [
                "I’m a NZ’er born & raised. I’ve lived in the US 24yrs & am a dual NZ/US citizen. When I arrived back in the US on my US Passport about 5 years ago, the Immigration Officer looked at my passport (again US CITIZEN on a US PASSPORT) & said, “*Where are you from?*” \n\nMe: “*Montana - just returning home.*” \n\nHim: “*I didn’t ask where you live, I asked where you’re from.*” \n\nMe: “*I’m originally from New Zealand.*”\n\nHim: “*THAT’s where you’re from. You’re not from Montana - that’d be good for you to remember. Most Americans don’t have 2 middle names. NEXT!*” 👋🏽🤨\n\nI’ve arrived in the US many, many times as a non-citizen *before* all this hullabaloo started & it was bad enough then. But THIS is how they treat US citizens - think about how bad it’s going to be now for foreign visitors.",
                "The United States is not a safe place for foreigners.",
                "Amazing how quickly the US turned into a shithole country",
                "I have friends who were coming from Europe to SGF in California next month that have cancelled because they don’t wanna risk it. This sucks.",
                "Welcome to the club NZ!",
                "The travel agencies and airlines should have to stop advertising deals to the US, too, as it’s just encouraging a very unsafe activity.",
                "I certainly wouldn’t visit from another country. I wouldn’t recommend it at all.",
                "“This is gonna ruin the tour.” - Lorde",
                "Our governed right now is the world's most powerful criminal organization....it ain't safe here",
                "Strange how the article mentions they’ve had issues since November 2024. Seems like it’s been a bipartisan issue."
            ],
            "aggregate_sentiment": 21.0
        },
        {
            "category": "RISING",
            "title": "FBI ordered to prioritize immigration, as DOJ scales back white collar cases",
            "external_url": "https://www.reuters.com/world/us/fbi-ordered-prioritize-immigration-cases-over-white-collar-crime-people-familiar-2025-05-12/",
            "upvotes": 8679,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Government full of white collar criminals scales back investigation of white collar criminals.",
                "Sounds like a lot of fraud will be happening unchecked",
                "*But as....Trump has stepped up an immigration crackdown, thousands of federal law enforcement officials from multiple agencies* [*have been*](https://www.reuters.com/world/us/thousands-agents-diverted-trump-immigration-crackdown-2025-03-22/) *enlisted to take on new work as immigration enforcers, pulling crime-fighting resources away from other areas.*\n\nSo the DOJ cuts back efforts to prosecute white-collar offenses, as in \"public [corruption](https://www.reuters.com/world/us/trumps-justice-department-hits-brakes-anti-corruption-enforcement-2025-02-12/), foreign bribery, kleptocracy and foreign influence.\"   (so racist, and so self-serving)",
                "The massive tranfer of wealth during covid wasn't enough. They will not stop until we are all slaves.",
                "Sure… why not…. Let the mortgage fraudsters steal my home and life savings.….. just as long as I can rest comfortably knowing the cucumbers in my salad weren’t sullied by the hands of an undocumented farm worker getting paid 1/2 minimum wage to do back breaking labor in the hot sun.",
                "It's corruption all the way down.",
                "So Republicans are seriously dismantling the rule of law in broad daylight, openly and proverbial crickets?!?!? ",
                "Super excited that we're going after people that are having a net positive impact on society rather than the group that is systematically siphoning off every single resource they can for themselves. We really need to take a page from the French.",
                "Just want to point out solving and therefore preventing white collar crime actually generates money and lost tax revenue.",
                "Let’s not investigate where all the hundreds million $’s of Trump’s inauguration fund went to.  Or who were the early buyers of Trump coin"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Grand jury indicts Milwaukee County judge after prosecutors allege she helped a man evade ICE",
            "external_url": "https://www.wpr.org/news/grand-jury-indicts-milwaukee-county-judge-allege-helped-man-evade-ice",
            "upvotes": 3365,
            "date": "05/13/2025",
            "thumbnail": "https://www.wpr.org/wp-content/uploads/2025/05/dugan1.jpg",
            "top_comments": [
                "In summary, an administrative warrant is issued by a government agency for regulatory or administrative purposes, while a judicial warrant is issued by a court for criminal or civil law enforcement.",
                "As the old saying goes, a grand jury would indict a ham sandwich if that’s what the prosecutor wanted.\n\nGrand jury indictments are just a rubber stamp.",
                "All governmental officials should be held to account. Let's start with, idk, maybe the fucking President?",
                "I’ve served on a grand jury and can clearly explain what happens there. Grand juries do not need proof beyond a reasonable doubt, they just need to be presented with enough evidence to lead a reasonable person to believe there’s enough evidence to charge somebody with a crime. The bar is much lower to indict somebody.",
                "> Prosecutors allege she broke federal law by helping a man evade immigration enforcement last month.\n\nLegal Eagle did a great breakdown on this whole case. The funniest part is that the door she let the man “escape” through led…right back to the main hallway where officers were waiting lol\n\nSo basically they’re going to argue either she didn’t know how her own courthouse hallways work, or somehow she did know and it still counts as helping him “escape” by leading him straight back to them!\n\nEDIT: For people wanting to dispute what I say above, please watch [the Legal Eagle video](https://m.youtube.com/watch?v=TPQeZalnArY&pp=0gcJCYsJAYcqIYzv) before doing so.",
                "This is crazy. She let him out through a different exit that lead to the SAME public hallway as where the ICE agents were waiting. The agents even rode down the elevator with the guy and his lawyer before they arrested him outside.",
                "Hope democrats remember this next time they debate 3 years whether to charge Trump or any republican for any of the crimes they commit.",
                "Sounds like someone is getting due process.",
                "Once you guys get rid of that pesky legal system you have, and kill the media, you’re done. \n\nCurrently you’re already done for tourism $$$. 🤔",
                "Reminder: the people who hid Anne Frank were breaking the law, the Nazis that killed her were following the law."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Judge agrees to resentence Menendez brothers over 1989 murders",
            "external_url": "http://www.bbc.com/news/articles/c2e3xnx471wo.amp",
            "upvotes": 1169,
            "date": "05/14/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d530/live/f1d0a470-308d-11f0-8519-3b5a01ebe413.jpg",
            "top_comments": [
                ">Judge Michael Jesic gave Erik and Lyle Menendez a new sentence of 50 years to life. A decision on their potential release will be made at a parole hearing in June.\n\nTheir previous sentence had no possibility of parole. That's the major change, here.",
                "Why is the Picture black & white. We had colour in the 80",
                "That's a lot of murders",
                "Reddit has a weird fetish with upper middle class murderers.",
                "Father was extremely abusive, sexual and emotionally. Other family members corroborated that. The mother was more abusive with the oldest son and the father with the youngest. \n\nOne anecdote is that their father killed their pet bunny for Christ’s sake. \n\nThey should not have killed them but they have been punished enough.",
                "Ok just 40 more years",
                "Netflix documentary came out about them.",
                "They had a great time at the Lakers game",
                "As a guy who was sexually abused,I can tell you the double standard is real, Judging by the record, they have not been in trouble since in the jail, they have actually helped a lot of people and they seem remorseful. So why shouldn't they at least get the possibility of a second chance.",
                "My brother was horrifically sexually abused by his father, which led to my brother’s death in his early 20s. But he didn’t kill his dad. \n\nBut then, his dad wasn’t wealthy, like the Menendez parents."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "No winners in tariffs wars or trade wars': Xi Jinping makes first public remarks after tariff rollback",
            "external_url": "https://edition.cnn.com/2025/05/13/business/video/china-us-trade-truce-tariff-war-xi-jinping-digvid",
            "upvotes": 694,
            "date": "05/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/xi-trade-sot-thumb.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Bet we'd find some winners if we check the investment accounts of some Senators.",
                "Ordinary  people- public lost  as always.",
                "The rich people win .. last week to this week a shitload of rich people made money on the stock market",
                "Not much of a trade war in the end. The USA imposed tariffs. China retaliated. The USA folded.\n\nThings got worse, for all the ordinary folks out there, because of the multiple shocks to the economy and the loss of trust and stability in the global economy. But past that nothing was really achieved.",
                "When markets are being manipulated likes this, rich people are making bank",
                "The world is a seriously fucked up place when I agree with the chinese govt on something.",
                "Xi is winning the public relations battle of this. He's not pissing on anyone and he's not dangling tariffs. China isn't the aggressor in this, America is and that puts Xi in a really comfortable position.",
                "I wonder how big the bribe was that Trump took.",
                "The Chinese know this. The rest of the world knows this. Most Americans know this. Why we are letting a sociopath wreck everything is beyond me.",
                "Nobody’s ever seen a trade war like this, folks. Tremendous success. I did it. Nobody thought it could be done. The greatest trade war of all time, everyone is saying it. Many people."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "$100 million New Jersey deli fraudsters father and son sentenced to prison",
            "external_url": "https://www.cnbc.com/2025/05/13/new-jersey-deli-sentencing-coker-stock.html",
            "upvotes": 675,
            "date": "05/13/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107209973-1678979529762-img_5443.jpg?v=1734642839&w=1920&h=1080",
            "top_comments": [
                "Just off the headline, Satriale's spontaneously came to mind.",
                "Oh dang. I remember following this when it was first in the news, but it fell off and I never knew anyone got arrested for it.",
                "Hope they are state charges otherwise the pardon is probably being drafted currently.",
                "Trump will probably pardon them",
                "Soon to be pardoned by the president as per the new standard",
                "Too bad New York real estate fraudster father and son weren’t sent to prison.",
                "Six months in jail, six months at home, and a 1/100 fine on the $100M.  Pay a penny for every dollar scammed? I'd say crime pays, and it pays well.\n\n> Earlier Tuesday, his father, North Carolina businessman Peter Coker Sr., was sentenced to six months in jail, to be followed by six months of home confinement, for his role in the case.\n> \n> During his sentencing, Coker Sr. was ordered to pay a $500,000 fine and pay up to $644,000 in restitution.",
                "Turns out those guys were full of baloney.",
                "Probably- I told you my sandwiches are worth 1M dollars each- I ain’t playing player - pay up !",
                "Our new FDA supervisor."
            ],
            "aggregate_sentiment": 74.0
        },
        {
            "category": "RISING",
            "title": "NHL suspends Florida Panthers minority owner for ‘51st state’ posts",
            "external_url": "https://www.theguardian.com/sport/2025/may/13/doug-cifu-florida-panthers-minority-owner-suspended",
            "upvotes": 22402,
            "date": "05/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/160516a3a9f0332a5169838800d226165f8968c3/212_0_3896_3117/master/3896.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f49e825b6cf4aa22da9e14dc4d829758",
            "top_comments": [
                "What does it mean, practically, for him to be suspended from all activity with the team and the NHL?  Serious question.",
                "40% of the NHL is Canadian. 29% is American. How brain dead do you have to be to do this?",
                "Good, don’t let them normalize that propaganda",
                "Imagine having more money than you could ever spend in a lifetime and still spending your time arguing with strangers on twitter. \n\nFun side note, the Panthers have been the dirtiest team in the NHL playoffs this year and it isnt even close.",
                "Yeah, the 51st state comments are idiotic but the positive stuff about forced starvation - holy fuck, what the fuck is wrong with this man?",
                "What a fucking asshole",
                "damn I actually want the Leafs to advance, now",
                "Simping for Israel and disrespecting a neighbour's sovereignty, like chocolate and peanut butter",
                "Good.  51st state is never going to happen.  I love my American friends and I really hope we can continue a close relationship.  We provide great advancements as separate places.  Like Insulin, pacemaker, zipper, telephone, etc....  which we as a friendly continent and with rules allowing us to work together creates so many more advancements.\n\n  \nFundamentally Canada is different from the US.  \n\nThat shouldn't change.",
                "It must be so hard for people to just shut the fuck up. I don't get it"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "FDA and RFK Jr. aim to remove ingestible fluoride products used to protect kids' teeth",
            "external_url": "https://apnews.com/article/fluoride-fda-kennedy-cavities-teeth-water-22c5aefeb97c411e2fda0c4754b78cf2",
            "upvotes": 8613,
            "date": "05/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I work in peds dentistry and trust me, parents are already saying no to fluoride and no to radiographs...and often they are spending thousands in treatments for composites, pulpotomies, etc. that could have been prevented. Dental health is overlooked so often in favor of extracirriculars. \"Sorry, Timmy has baseball practice so we need to reschedule/cancel.\" Ok, so Timmy is 7 years old, is a high caries risk, and hasn't seen us in 2 years. I think he can miss one fucking practice. People's priorities are alllll outta whack.\n\nWe get a lot of \"they won't let me brush their teeth!\" too. I'm sorry, who is the parent here? They're a small child, they need your guidance. I am empathetic to a point but you have to do it. If they didn't want to shit in the toilet, would you let them do it outside too? \n\nI fear we are going to get a lot busier. 🥺\n\nEDIT:\n\nWow ok, did not expect my comment to blow up. I just want to let yall know that I feel you on multiple fronts. I have a background in dental assisting, veterinary dentistry,  medical and dental research but now I work in the admin side of dentistry (not a dentist), so the financial issues and insurance issues I deal with on a daily basis are frustrating and heart breaking. It was the same when I worked in veterinary. As much as I wish we could do this fully subsidized, the USA hates universal health care and we have to make money to feed our staff. A lot of dentists, including my own, are eschewing being in network with a lot of insurances because they pay literal pennies for procedures. I'm talking about 15-20 bucks for full surgical procedures, which with how much dental school costs...it's not economical. I highly suggest to find a dentist that has a membership plan, it is often more cost effective than dental premiums!\n\nAs for health, if you truly don't want to give your kid flouride, there are alternatives that are NOT charcoal (seriously, don't! especially if theyre on meds!). Boka has nano hydroxyapatite toothpaste that has been clinically studied and is a great alternative. But I must insist you get radiographs, as the tooth is like an iceburg. A lot goes on underneath the surface. \n\nDentistry shouldn't be a luxury. I myself have talked to my local representatives about health care and dental care being my top concern and how we are doing nothing about it. My state, CA, can do better and I want it to be better. I wish I had all the solutions, I wish everyone here can get care. But please, do not yell at the staff if insurance isn't covering procedures. We literally can't control it. 😭 And I work with a dentist who would rather never see a cavity again. It is devastating to tell a parent their kid needs several crowns, pulpotomies, composites under anesthesia.",
                "So now you’re taking my choice away as to how to best protect my kids’ health? Fuck you.",
                "My dentist literally prescribed me an extra-fluoride toothpaste to help with back molars... while RFK Jr is pushing this idiocy.\n\nAt this point I'm half-expecting Trump to appoint a 'czar of software'.. who just installs backdoors into agencies, wrecks the systems, and steals all the data.\n\n*oh wait.*",
                "> Instead, the FDA will ask manufacturers to voluntarily pull their products, according to an administration official.\n\nIf I was a manufacturer, my reply to that ask would be \"fuck you.\"\n\n> FDA Commissioner Marty Makary said the products pose a risk when swallowed because they may interfere with healthy gut bacteria that are critical to digestion, immunity and other key bodily functions. \n\nMeanwhile, Brainworm is out there getting MAHA parents to [pump their kids full of vitamin A to toxic levels](https://www.washingtonpost.com/wellness/2025/04/07/vitamin-a-poisoning-measles-rfk-jr/).\n\nGovernment falling from the stupid tree and hitting every branch on the way down.",
                "Wait til they hear about chlorine and its effects on beneficial bacteria.",
                "And when kids’ teeth start getting more unhealthy, the same parents who cheer for this will complain and blame literally anyone else.",
                "What happened to all those anti-vaxxers yelling “my body, my choice” now that the government is dictating what they can and cannot have?",
                "The idiot shouldn’t be in charge of our country’s health",
                "do I need to hoard fluoride toothpaste now?",
                "I don't understand. There are fluoride-free mouthwashes and toothpastes already on the market. Some of us want fluoride toothpaste/mouth washes."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Small nodule found in Joe Biden's prostate during recent physical",
            "external_url": "https://abcnews.go.com/US/small-nodule-found-joe-bidens-prostate-recent-physical/story?id=121743026",
            "upvotes": 10839,
            "date": "05/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/270fecd5-10fa-4ed7-a838-ebd3333d8383/biden-main_1747135541861_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I’m a doctor. MOST men will die with pathology confirmed prostate cancer (I forget the exact number but I think it’s like 80%). Unless it is widely metastasized, joe Biden will die LONG before this cancer has any effect on his health.",
                "I would like to unsubscribe from Joe Biden Prostate Facts",
                "Wild that we can know what’s going on inside Joe biden’s asshole but we can’t get an accurate height and weight of the president. ",
                "Yeah I’m glad I’m not famous",
                "Breaking news, old guy has stuff going on physically. More at 11.",
                ">\"In a routine physical exam a small nodule was found in the prostate which necessitated further evaluation,\" a spokesperson told ABC News.\n\nGood time to remind everyone to get checked regularly.",
                "I feel like this information has just been forced upon me against my will.\n\nI'm not happy about this.",
                "Small nodule found in Trump's prostate is just Lindsey Graham.",
                "Prostate cancer is pretty slow, so given his age it's entirely more likely that he'll end up going in his sleep a long while before this gets anywhere super serious.",
                "[removed]"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "US strikes $600bn deal with Saudi Arabia as Donald Trump's Middle East tour begins",
            "external_url": "https://www.lbc.co.uk/usa/politics/us-strikes-600bn-deal-with-saudi-arabia-donal-trumps-middle-east-tour-continues/",
            "upvotes": 5978,
            "date": "05/13/2025",
            "thumbnail": "https://images.lbc.co.uk/images/723443?width=1200&crop=16_9&signature=ANwtk71HDdQkmTLCnEwBHzZnEEg=",
            "top_comments": [
                "\"Mr. President, a second plane just got gifted to you\"",
                "Also from the article.\n\n“*Meanwhile, Trump also struck a deal with China on Monday to cut tariffs by 115% over the next 90 days in what could spell the end of his administration's global trade war.”*\n\nNo mention of the 30% tariff that remains in place or the de minimus exemption that became a 54% tariff or the 10% across the board tariffs or the 25% auto tariffs or… \n\nJournalism is dead.",
                "MAGA has sold America to rich Arabs, Russian oligarchs, tech billionaires, and A.I. lobbyists.",
                "Further proof that Saudi Arabia owns Clinton and Biden, right MAGA?",
                "In 2024, Saudi Arabia's GDP reached approximately $1.09 trillion at current prices.\n\nSo they’ve pledged approximately 60% of their annual gdp to invest in the USA.",
                "One can guess how much he'll personally get out of this deal.",
                "Remember when Trump was president for the 1st time,  and that Saudi born journalist was hacked into small pieces? Do you also remember when shortly after, Trump met the butcher himself and he shook his still bloody hands and greeted him with a smile?  He almost makes Trump seem tame",
                "I wonder if the name Jamal Khashoggi came up during their conversation",
                "Turns out we do negotiate with terrorists.",
                "Forgot about 9/11 real quick when there's a buck to be made. Now they're selling the saudi's their best military tech. So much winning."
            ],
            "aggregate_sentiment": 60.0
        }
    ],
    "last_updated": "05/14/2025 08:12:49 UTC"
}