{
    "posts": [
        {
            "category": "HOT",
            "title": "Judge pauses much of Trump administration’s massive downsizing of federal agencies",
            "external_url": "https://apnews.com/article/trump-mass-firings-doge-lawsuit-b41f5b43f428965fd60bc272e3854e3b",
            "upvotes": 6661,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">“But he must do so in lawful ways,” she said. “He must do so with the cooperation of Congress, the Constitution is structured that way.”\n\nThis is one of those checks-and-balances I heard so much about.\n\n>[\"I Donald John Trump do solemnly swear that I will faithfully execute the Office of President of the United States, and will to the best of my ability, preserve, protect and defend the Constitution of the United States.\"](https://youtu.be/hAJb7uTcgAw?si=h_JDb__1tQT1oLwj)\n\nI guess that means he has to do it, right?",
                "If you are willing to put thousands of Americans out of jobs suddenly and with little to no warning, you are NOT \"America First\".\n\nI give two shits whether it's govt jobs or otherwise. These are Americans. Keep them employed.",
                "How do you freeze something that happened months after the fact?",
                "What will happen next:\n\n* The Trump admin will not comply\n\n* The judge will demand to know why\n\n* The Trump admin will gaslight and lie to the judge\n\n* The judge will write a strongly worded opinion or letter\n\n* Nothing will ultimately happen",
                "Fuck traitor trump and his weak unamerican sheep",
                "He will not comply. Asked to pause would be a better title.",
                "They will definitely jail the judge and resume the firings",
                "So glad they stopped this now, after I've had a couple people I know, who voted against Trump, lose their jobs",
                "I feel like I’ve seen so many articles about judges putting a “pause” to things but then those things still happen….",
                "And he will continue to ignore it. He isn’t even listening to the Supreme Court"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Man checks out 100 books from Beachwood Library, then burns them in social media post",
            "external_url": "https://www.cleveland.com/community/2025/05/man-checks-out-100-books-from-beachwood-library-then-posts-on-social-media-video-of-those-books-burning.html?outputType=amp",
            "upvotes": 12044,
            "date": "05/10/2025",
            "thumbnail": "https://www.cleveland.com/resizer/v2/AVVKSQTABNCR3P5N6KUHGZL3WE.jpg?auth=534a7df2570bc1342c5c6565b3b848439af8474daac25ece06431a2a1bb53949&width=1280&quality=90",
            "top_comments": [
                "Charge him with destruction of public property.",
                "If the library has a donation page I’ll happily donate",
                "> The 100 books were valued at approximately $1,700. As the books were not yet overdue, the library will wait until they are overdue, then send a bill to the man.\n\nLibraries are awesome.",
                "Hopefully this results in a situation where people read copies of the burned books and donate to the library to improve its funding.\n\nEdit: According to the article, this disphit will be billed for the books once they are overdue and is banned from the library’s premises.",
                ">the man checked out 50 books on topics that included Jewish history, African-American history and LGBTQ education.\n\nGee, I wonder who he voted for.",
                "For readers, I wanna point out that today, May 10th, is the 80th anniversary of the book burnings in Nazi Germany in Berlin.\n\nCongrats, America.",
                "Gotta let you guys know, beachwood is very, very Jewish.",
                "As part of a punishment, I feel he should be forced to read and write a paper on each of the books.",
                "Most literate Trump supporter",
                "Now the library will buy those books again to replace them and the authors get double the income."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Lithium deposit valued at $1.5 trillion discovered in the U.S.",
            "external_url": "https://www.earth.com/news/volcanic-white-gold-a-lithium-deposit-valued-at-1-5-trillion-has-been-discovered-in-the-u-s/",
            "upvotes": 30277,
            "date": "05/10/2025",
            "thumbnail": "https://cff2.earth.com/uploads/2025/05/09071935/lithium-mine_McDermitt-Caldera_1-5-trillion-dollars_1m.jpg",
            "top_comments": [
                "Gorman County, Oregon.",
                "The children yearn for the mines",
                "We should invade and win the hearts and minds of the people by building roads and schools.",
                "This was discovered several years ago. It's not news.",
                "There are many sites with (BIG NUMBER) valued lithium.  The problem was how much the extraction and refining cost compared to (BIG NUMBER).  It frequently translated to close to, or exceeded,  (BIG NUMBER).\n\n  \nJust like there are a number of 'rare earth mineral' deposits in the U.S....they just aren't practical to extract.",
                "Finding the deposit is \"easy\".\n\nMining it is a little trickier.\n\nTurning it into \\_\\_usable\\_\\_ lithium. Thats the HARD part that needs a lot of infrastructure, power and skill.\n\nThere is a new one under construction in California. Its a $1.8Bln facility, owned by an Australian company. Otherwise the ore has to be export to Australia, Chile or China. The US does have some other processing capabilities, but its mostly the Aussies with the know-how (I guess it involves using shitty beer to do it? j/k). \n\nBear in mind that if its processed abroad thats 2 x shipping costs, plus hazards materials handling, plus a tariff.\n\nSo that $1.8Bln plant, even if its a smaller facility, will be really useful! But its not going to be able to handle all of it, or in a timely manner.\n\nThis is a good link for more info: [Lithium Supply Chain: Understanding the Basics | Shipping and Commodity Academy](https://shippingandcommodityacademy.com/blog/lithium-supply-chain-understanding-the-basics/) (other pages exist but they all say about the same thing. Obviously the \"US reserves\" are now slightly higher than on that page mind).",
                "Jesus that website is trash. Over half my screen was covered in undeletable ads. Couldn't even read the damn article.",
                "If you've ever been out there - it seems like nothing but desert and high desert/mountains,  but look at the area as the watershed that feeds into the Columbia river and the underground aquifers that also feed into the Columbia river and all the tributaries hence forth.\n\nThey can't just go in their and extract it if it's going to hurt the watersheds of the west.\n\nI worked near two superfund sites - I live near superfund site about 15 miles south of me.\n\nExamples:\n\nThe entire south end of Vashon Island and Ruston area (Tacoma WA metro) is contaminated with exaust tailings to the point where plants harvested there contain those chemicals like lead to this day. (There's a summer camp there that predates the smokestacks that kids roll around in the dirt right THERE.) \n\nIn Butte, Montana and subsequently a 200 mile radius and anywhere in the MT/WY/NV area there are both smokestack areas of contamination and pools of deadly chemicals leftover from the 1800s-1970s. Pools of arsenic and lead. If you've been there you know.  Cows and horses just walk around grazing in these areas.\n\nPicher, Oklahoma - \"the most toxic ghost town\" in the USA. The entire story is a trip. Silent Hill type stuff. I went to a museum exhibit on it in Norman.\n\nEdmond, OK - currently having to treat it's watershed contaminated with fracking juices - oh but they won't tell you that.  They just want to see you bougie houses and ride out the earthquakes.  (source - Geologist who works for oil company who quit over it I dated - so dubious.) \n\nQuestion is not \"We make money now\"\n\nbut \"Where will we live AFTER the mine closes and we don't make money anymore?\"\n\nExample of Lithium Extract- from source:\n\n# Brine Extraction\n\nBrine extraction is another method of extracting lithium. This method involves pumping brine from underground aquifers into evaporation ponds. The sun and wind evaporate the water, leaving behind lithium and other minerals. The following are the steps involved in brine extraction:\n\n* Drilling: Wells are drilled into the ground to access the brine.\n* Pumping: The brine is pumped to the surface and transported to the evaporation ponds.\n* Evaporation: The brine is evaporated in the ponds, leaving behind lithium and other minerals.\n* Processing: The extracted lithium is then processed to produce lithium carbonate or other lithium compounds.\n\nBrine extraction is a less costly and less energy-intensive method of extracting lithium. It is also less harmful to the environment than hard rock mining. However, it is highly dependent on weather conditions, and the process can take several months to complete.\n\nOverall, both hard rock mining and brine extraction have their advantages and disadvantages. Companies choose the method that suits their needs and resources.\n\n#",
                "For those unaware, the U.S. has lithium in a ton of places but as of now the only real site that is extracting lithium in any meaningful capacity is in Nevada. There is a site that has been identified for development in Arizona as well.\n\nBut all of that is sort of moot because right now virtually all REFINING of lithium has to go through China so absent developing that domestic refining we won’t be gaining independence any time soon.",
                "It's never the issue whether we have lithium mine or not. We always have the. It's just the environmental cost to mine and produce it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Kentucky Derby-winning jockey suspended, fined $62,000 for striking horse too many times",
            "external_url": "https://www.nbcnews.com/news/us-news/kentucky-derby-winning-jockey-suspended-fined-rcna206039",
            "upvotes": 2939,
            "date": "05/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250510-Junior-and-Sovereignt-ch-1444-462086.jpg",
            "top_comments": [
                "*Article Text By Mirna Alsharif and Matthew Mata:*\n\nThe jockey who rode Sovereignty to victory at the Kentucky Derby last week has been fined over $60,000 for striking the horse with his riding crop too many times during the race, according to the Horseracing Integrity and Safety Authority.\n\nJunior Alvarado was found to have struck the horse with his riding crop “more than the permitted amount” during last week’s race, violating the authority’s rules, it said in a statement Saturday.\n\nA penalty was imposed against Alvarado on Friday for committing the Class 3 violation and he was hit with a fine equating to 10% of his $310,000 winnings, the statement said. The fine was then doubled “pursuant to an escalating penalty structure for repeat riding crop violations within the previous 180 days,” resulting in a $62,000 fine, according to HISA.\n\nAlvarado was found to have struck Sovereignty eight times during the Kentucky Derby, which was his second offense in 180 days, per a HISA ruling. HISA protocol allows jockeys to strike horses a maximum of six times during a race.\n\nThe jockey was also suspended for two Kentucky racing days, May 29 and 30, as a result of the violation.\n\nThe jockey and Sovereignty won the 151st running of the Kentucky Derby last Saturday at Churchill Downs.",
                ">HISA protocol allows jockeys to strike horses a maximum of six times during a race.\n\n\nAh, so that's why Epona has six carrots in Zelda games.",
                "\"HISA protocol allows jockeys to strike horses a maximum of six times during a race.\" \n\nJunior Alvarado was found to have exceeded the limit by 2.\n\nSo I suggest 2 flogs for Junior, and 6 flogs for the idiotic judges who came up with this rule and now banning flogging once and for all.",
                "Yea but the horse will now makenthe owners millions of dollars in breeding fees. If im the horse owner id tell ny jockey to hit the horse as much as he wants and id pay the fine. $62k probably would cover the cost of one load of semen from the horse lol.",
                "Hopefully the jockey has learned a valuable lesson and from now on will only strike the horse an appropriate number of times.",
                "So 6 flogs = 2 pumps.  Got it.",
                "Some states have taken whips away from jockeys. Maybe Kentucky should join them.",
                "From a [reddit comment](https://www.reddit.com/r/horseracing/comments/1khhnmf/kentucky_derbywinning_jockey_of_sovereignty_fined/mr7vjyw/) in the horse racing sub by /u/BasisTraditional6588, not sure how accurate, but potentially it’s not as bad as it looks and the whips today are different than those historically used:\n\n> They're made of a type of foam. You can whip the shit out of yourself and it isn't particularly painful, even on bare skin and in sensitive areas. The sound and the sensation are absolutely used to continue encouraging the horse to move forward. The limit was put into place to prevent an obscene amount of strikes going down the stretch. It is absolutely possible to lose track with the adrenaline of everything, especially once a jockey and horse fall into rhythm. The only type of legal whip used in US racing now is usually fiberglass wrapped in thick foam. It is designed to cause a loud sound more than cause pain.\n\n> For the record, jockeys won't make millions riding one race: they take home roughly 10% of the earnings. Jose Alvarado took home $310,000 for his effort; he acknowledges his mistake, he understands he was one strike over, and he will pay his $31,000 fine.\nUnsure if links are allowed, but this is a pretty fair assessment of the use of whips in racing.\n\n> https://lightupracing.com/why-are-whips-used-in-racing/",
                "Horse racing is a disgusting “sport” and basically just legalized animal abuse.",
                "\"Sir, you spanked your horse too many times\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Zero ships from China are bound for California’s top ports. Officials haven’t seen that since the pandemic | CNN Business",
            "external_url": "https://www.cnn.com/2025/05/10/business/zero-ships-china-trade-ports-pandemic",
            "upvotes": 28766,
            "date": "05/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213552030.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Not a problem. We'll just build a bunch of factories and make stuff here. Let's see, now.. Gonna need some steel, some machines, some...oops.",
                "And remember everyone!:\n\n**ONCE THE PRICES GO UP, THEY AIN'T GONNA BRING EM BACK DOWN**",
                "The guy who unintentionally crashed the economy by mismanaging the pandemic was  re-elected so he can intentionally crash the economy by mismanaging a a recovery.\n\nSeriously. He blames Obama and Biden for everything, but both of them handed him a rising economy for him to destroy. And he didnt even say thank you.",
                "Here come the shortages.  I don't think most people realize how bad this is going to get and just assume everything will be fine.",
                "The next couple months are going to be really interesting , as summer kicks off and people are going to start feeling the effects of their leaders decisions.\n\nI expect a lot of angry , confused Americans will be flooding social media looking for answers. \n\nGet your popcorn ready",
                "Remember, we saw insane inflation as an aftereffect from the pandemic. Supply disruptions don't immediately hit hard due to buffer inventories along the supply chains. When  this eventually affects us, it will be insane and likely cause another massive recession.\n\nAlso, other countries are adapting to the US playing games by securing deals with new partner countries. It will probably take decades for the US to undo the damage.",
                "Americans are gonna be bootlegging cheap Chinese products from Canada.",
                "Back-to-school is going to be fun… no shoes, no computers, no backpacks, no supplies, no dorm-room accoutrements, at prices that even vaguely resemble what parents are used to paying, when they can get them at all.\n\nBut it’ll be Biden’s Fault somehow.",
                "Medicine and medical supplies are at the very top of my concerns. Stupid disposal stuff like gauze, sutures, sterilization bags, PPE. So much of it is from China.",
                "Republicans always do more harm to the economy than they ever help it.  A democrat will get elected to fix it but they won’t be 100% perfect.  Then people will vote for a republican again and the cycle keeps repeating."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Pakistan violates ceasefire, multiple blasts reported in Srinagar",
            "external_url": "https://www.indiatvnews.com/news/india/pakistan-violates-ceasefire-multiple-blasts-reported-in-srinagar-2025-05-10-989717",
            "upvotes": 5655,
            "date": "05/10/2025",
            "thumbnail": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2025/05/untitled-design-2025-05-10t212338-1746892439.jpg",
            "top_comments": [
                "Rip Ceasefire 11/5-11/5",
                "Liz Truss lasted longer in office than this ceasefire",
                "Didn’t Trump this morning take credit for negotiating this?",
                "Trump should tell Trump that none of this would have happened if he was president",
                "Alt non-Indian sources: https://www.reuters.com/world/asia-pacific/blasts-heard-indian-kashmir-hours-after-india-pakistan-ceasefire-announcement-2025-05-10/\n\nhttps://www.nytimes.com/live/2025/05/10/world/pakistan-india-kashmir/2ab7f2dd-ab98-5e43-982c-b25ec669d659?smid=url-share\n\nhttps://www.cnn.com/world/live-news/india-pakistan-operation-sindoor-05-10-25#cmaidwdgk00183b6msj36oc9x\n\nSky News says that people have reported blasts to Reuters News Agency https://news.sky.com/story/india-pakistan-live-dozens-killed-as-india-launches-missile-strikes-on-pakistan-controlled-territory-13363087?postid=9562997#liveblog-body",
                "Bruh how was it shorter than the ceasefire in Palestine and Israel. edit x2 officials confirmed ceasefire breach [livestream of confirmation by India ](https://www.youtube.com/live/k4t1ssQ27_8?si=tAVKh5NMGNxPYtQv)",
                "This is how I found out India and Pakistan had a ceasefire agreement ",
                "[deleted]",
                "Looks like Pakistani government agreed for the ceasefire but not the military. You need to understand the fact that Pakistan’s military controls the country, receives disproportionate size of country’s budget and maintain their relevance by keeping the disturbances alive. Sometimes that’s by supporting terrorist organizations other times it by not listening to their PM.",
                "But the conservatives were so proud of Trumps ability to end the fighting D:"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Iranian student in Alabama to self-deport despite withdrawal of initial charge behind his arrest | CNN",
            "external_url": "https://www.cnn.com/2025/05/09/us/iranian-student-alabama-self-deport-hnk",
            "upvotes": 1989,
            "date": "05/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25122638485828.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Alireza Doroudi, a 32-year-old Iranian doctoral student in mechanical engineering at the University of Alabama, has decided to voluntarily leave the United States after being detained for six weeks by immigration authorities.  His detention began in March 2025, despite the U.S. government later dropping one of the charges against him. \n\nDoroudi's student visa was revoked in June 2023 without explanation.  At that time, the university advised him that he could legally remain in the U.S. as long as he maintained his student status and did not leave the country.  In the spring of 2025, the government filed two charges to justify his deportation: the revoked visa and his alleged failure to maintain student status.  The first charge was withdrawn after the government acknowledged that the visa revocation was \"prudential\" and not immediately effective.  His attorney, David Rozas, is contesting the second charge. \n\nDespite having no criminal record or involvement in political activism, Doroudi was denied bond and held in a Louisiana detention facility.  Frustrated by the prolonged detention and the impact on his life, he chose to self-deport.  His fiancée, Sama Ebrahimi Bajgani, and his attorney expressed deep sadness and questioned why he was targeted.  Doroudi's case has heightened fear among international students in Alabama, particularly within the Iranian community, amid a broader immigration crackdown under President Trump's administration.",
                "Hard to call it justice when someone’s only real option is to give up and leave.",
                "A Doctoral student in Mechanical engineering - the best & brightest. This person would be an asset to ANY country, and the Trump admin is actively throwing people like this out of the country. SMDH",
                "The beginning of America's brain-drain.",
                "Fleeing the country is what he’s doing, not self deporting. Call it what it is, CNN, ffs.\n\nThe media using the propagandist language of the regime to make us think that it somehow isn’t terrifying people into fleeing the country for fear of their lives is despicable.",
                "I will deport and imprison your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. I will deport and imprison these, the homeless, tempest-tost to El Salvador, I lower my spray tan beside the golden toilet!",
                "Horrible headline. More like \"Iranian student flees country that prosecutes him without any reason before it happens again\".",
                "WTF. He is just a freaking student. Let him finish his degree. From the article, it is not like he is going to protests or anything. This is very arbitrary.",
                "I hope universities work out arrangements to make sure these poor students have a practical way to get degrees. \n\nIt’s insane and terrible that Trump is essentially torturing the best kids in the world. Shameful.",
                "Tourism to the US is rapidly declining.  No foreigner with any sense would even consider coming here at this point, unless it was required for their job.  Look at that German guy who was assaulted and strip searched for the “crime” of flying to America."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "'No ifs, no buts': Starmer and European leaders 'call out' Putin as they urge Russia to accept 30-day ceasefire",
            "external_url": "https://www.lbc.co.uk/world-news/starmer-calls-on-putin-to-accept-ceasefire-deal/",
            "upvotes": 1941,
            "date": "05/10/2025",
            "thumbnail": "https://images.lbc.co.uk/images/722739?width=1200&crop=16_9&signature=LQfnxwsHkXshW-rfgYhX82JWPjY=",
            "top_comments": [
                "Putin has no reason to oblige unless he actually feel his rear end is on fire.",
                "Oh, so what were they doing the last 3 years?",
                "What are they gonna do if he doesn't, sanction him?",
                "\"However, recent hours have seen a staunch Russian response, with the Kremlin suggesting the comments by European leaders had a \"confrontational\" character.\"\n\nIt's crazy we have to pretend like Russia aren't the ones that fucking invaded and have to coddle them into some form of peace. I know there's for sure many geopolitical things involved but if you do things out of public view, what you *do* do in public view is even more important. I hope trump doesn't flip flop and this is the \"start\" of a united NATO firmly and permanently against Russia in relation to their war",
                "All for a ceasefire, and the end of this war and the liberation of Crimea from the russian dogs occupying it, but I question why heavier sanctions are just now being threatened - why have they not already been in place for years?",
                "The sanctions do not work and at this point it's becoming one big joke.\n\nOh Europe isn't going to buy Russian gas anymore?\nNo we just buy it from India and Turkey for a little bit more money! Oh but India and Turkey buy it from Russia...",
                "Blah, blah - Russia sells the oil to a different country, we buy the oil from that different country for a little more than usual, Russia still makes its money, that different country profits too, we pay more for oil.\n\nThese sanctions do absolutely nothing, and everybody knows it. They need to find a genuinely effective way of hitting the Putmeister where it actually hurts.",
                "I’m really not one for military escalation but with NKs involvement Europe really does need to start getting its hands dirty.",
                "Starmer had time to call out with Trumps dick in his mouth? Impressive!",
                "What the hell is that picture, it's like some band poster"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "India and Pakistan accuse each other of 'violations' after ceasefire deal",
            "external_url": "https://www.bbc.co.uk/news/articles/cvg9d913v20o",
            "upvotes": 345,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2817/live/99e5c210-2dd9-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "Surprising exactly no one",
                "So do all the bots brigading.",
                "\"In wartime, truth is so precious that she should always be attended by a bodyguard of lies.\"\n\n\n--Winston Churchill",
                "isn't it 'funny' how Trump jumped into this within days, yet he's let Russia bomb the shit out of Ukraine and basically done nothing but try to rob them",
                "These stupid, ignorant, idiotic men are exactly why we need more women in politics all over the world.",
                "They probably did 🤷‍♂️.",
                "Hi Tyreed, good job blocking me lol\n\nyou've been following it on twitter and forming your opinion on what people tell you\n\nLets start with the associated press and go from there\n\n[https://apnews.com/video/india-and-pakistan-agree-to-a-ceasefire-in-us-mediated-talks-63971f296ea54cee9ad0ddd85ac30e0b](https://apnews.com/video/india-and-pakistan-agree-to-a-ceasefire-in-us-mediated-talks-63971f296ea54cee9ad0ddd85ac30e0b)",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Putin suggests Russia and Ukraine have 'direct' talks next week - BBC News",
            "external_url": "https://www.bbc.co.uk/news/articles/ce821nl3251o",
            "upvotes": 446,
            "date": "05/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/334c/live/611101a0-2df4-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "\"It's a trap!\" -- Admiral Ackbar",
                "This is the same president who has violated multiple ceasefires, has gotten other countries to fight his war for him and commited *several* war crimes and only now he  wants to have “direct talks”\n\nPutin is insane, he's definitely going to try and get a deal which is in the benefit of Russia, or in the unlikely scenario Putin has finally realized the game is up and wants to actually stop either way, I don't see this ending well for Ukraine at all.\n\nedit: wording",
                "More stalling tactics from the Russian methinks.",
                "Yeah, man. Come to Ukraine. They’d love to see your murderous ass.",
                "So he can poison Zelensky?",
                "If Zelensky agrees, it'd better be on the first floor of neutral soil and he refuses all refreshments.",
                "> \"We seek serious talks... to remove the root causes of the conflict and start moving towards a lasting, strong peace\"\n\nDo you think he's ever seen a mirror? Just fucking go home!",
                "He wants to have tea with Zelensky I'm sure.",
                "Direct bombings he says, Putin is lier and totally evil. Nothing he says can be trusted",
                "Putin, you can always just turn around and leave. That will not magically solve all the problems, but it is a good start as you are the one causing all the issues. \n\n\nStop this madness."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Putin says Russia ready for ‘direct talks’ with Ukraine as US and European leaders press for a ceasefire",
            "external_url": "https://www.cnn.com/2025/05/10/europe/putin-russia-ukraine-direct-talks-intl-hnk",
            "upvotes": 25,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213751837.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Had to check the date because it seems like this is said by that monster daily",
                "Stall tactic on us and European sanctions. He's agreed to no ceasefire and we all already know these talks will be unproductive. \" give us everything we want any concessions are unacceptable\" and drag that out while continuing to bomb the shit out of civilians."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Judge pauses much of Trump administration’s massive downsizing of federal agencies",
            "external_url": "https://apnews.com/article/trump-mass-firings-doge-lawsuit-b41f5b43f428965fd60bc272e3854e3b",
            "upvotes": 6669,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">“But he must do so in lawful ways,” she said. “He must do so with the cooperation of Congress, the Constitution is structured that way.”\n\nThis is one of those checks-and-balances I heard so much about.\n\n>[\"I Donald John Trump do solemnly swear that I will faithfully execute the Office of President of the United States, and will to the best of my ability, preserve, protect and defend the Constitution of the United States.\"](https://youtu.be/hAJb7uTcgAw?si=h_JDb__1tQT1oLwj)\n\nI guess that means he has to do it, right?",
                "If you are willing to put thousands of Americans out of jobs suddenly and with little to no warning, you are NOT \"America First\".\n\nI give two shits whether it's govt jobs or otherwise. These are Americans. Keep them employed.",
                "How do you freeze something that happened months after the fact?",
                "What will happen next:\n\n* The Trump admin will not comply\n\n* The judge will demand to know why\n\n* The Trump admin will gaslight and lie to the judge\n\n* The judge will write a strongly worded opinion or letter\n\n* Nothing will ultimately happen",
                "Fuck traitor trump and his weak unamerican sheep",
                "He will not comply. Asked to pause would be a better title.",
                "They will definitely jail the judge and resume the firings",
                "So glad they stopped this now, after I've had a couple people I know, who voted against Trump, lose their jobs",
                "I feel like I’ve seen so many articles about judges putting a “pause” to things but then those things still happen….",
                "And he will continue to ignore it. He isn’t even listening to the Supreme Court"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "India and Pakistan accuse each other of 'violations' after ceasefire deal",
            "external_url": "https://www.bbc.co.uk/news/articles/cvg9d913v20o",
            "upvotes": 348,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2817/live/99e5c210-2dd9-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "Surprising exactly no one",
                "So do all the bots brigading.",
                "\"In wartime, truth is so precious that she should always be attended by a bodyguard of lies.\"\n\n\n--Winston Churchill",
                "isn't it 'funny' how Trump jumped into this within days, yet he's let Russia bomb the shit out of Ukraine and basically done nothing but try to rob them",
                "These stupid, ignorant, idiotic men are exactly why we need more women in politics all over the world.",
                "They probably did 🤷‍♂️.",
                "Hi Tyreed, good job blocking me lol\n\nyou've been following it on twitter and forming your opinion on what people tell you\n\nLets start with the associated press and go from there\n\n[https://apnews.com/video/india-and-pakistan-agree-to-a-ceasefire-in-us-mediated-talks-63971f296ea54cee9ad0ddd85ac30e0b](https://apnews.com/video/india-and-pakistan-agree-to-a-ceasefire-in-us-mediated-talks-63971f296ea54cee9ad0ddd85ac30e0b)",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Putin suggests Russia and Ukraine have 'direct' talks next week - BBC News",
            "external_url": "https://www.bbc.co.uk/news/articles/ce821nl3251o",
            "upvotes": 447,
            "date": "05/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/334c/live/611101a0-2df4-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "\"It's a trap!\" -- Admiral Ackbar",
                "This is the same president who has violated multiple ceasefires, has gotten other countries to fight his war for him and commited *several* war crimes and only now he  wants to have “direct talks”\n\nPutin is insane, he's definitely going to try and get a deal which is in the benefit of Russia, or in the unlikely scenario Putin has finally realized the game is up and wants to actually stop either way, I don't see this ending well for Ukraine at all.\n\nedit: wording",
                "More stalling tactics from the Russian methinks.",
                "Yeah, man. Come to Ukraine. They’d love to see your murderous ass.",
                "So he can poison Zelensky?",
                "If Zelensky agrees, it'd better be on the first floor of neutral soil and he refuses all refreshments.",
                "> \"We seek serious talks... to remove the root causes of the conflict and start moving towards a lasting, strong peace\"\n\nDo you think he's ever seen a mirror? Just fucking go home!",
                "He wants to have tea with Zelensky I'm sure.",
                "Direct bombings he says, Putin is lier and totally evil. Nothing he says can be trusted",
                "Putin, you can always just turn around and leave. That will not magically solve all the problems, but it is a good start as you are the one causing all the issues. \n\n\nStop this madness."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Man checks out 100 books from Beachwood Library, then burns them in social media post",
            "external_url": "https://www.cleveland.com/community/2025/05/man-checks-out-100-books-from-beachwood-library-then-posts-on-social-media-video-of-those-books-burning.html?outputType=amp",
            "upvotes": 12042,
            "date": "05/10/2025",
            "thumbnail": "https://www.cleveland.com/resizer/v2/AVVKSQTABNCR3P5N6KUHGZL3WE.jpg?auth=534a7df2570bc1342c5c6565b3b848439af8474daac25ece06431a2a1bb53949&width=1280&quality=90",
            "top_comments": [
                "Charge him with destruction of public property.",
                "If the library has a donation page I’ll happily donate",
                "> The 100 books were valued at approximately $1,700. As the books were not yet overdue, the library will wait until they are overdue, then send a bill to the man.\n\nLibraries are awesome.",
                "Hopefully this results in a situation where people read copies of the burned books and donate to the library to improve its funding.\n\nEdit: According to the article, this disphit will be billed for the books once they are overdue and is banned from the library’s premises.",
                ">the man checked out 50 books on topics that included Jewish history, African-American history and LGBTQ education.\n\nGee, I wonder who he voted for.",
                "For readers, I wanna point out that today, May 10th, is the 80th anniversary of the book burnings in Nazi Germany in Berlin.\n\nCongrats, America.",
                "Gotta let you guys know, beachwood is very, very Jewish.",
                "As part of a punishment, I feel he should be forced to read and write a paper on each of the books.",
                "Most literate Trump supporter",
                "Now the library will buy those books again to replace them and the authors get double the income."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Kentucky Derby-winning jockey suspended, fined $62,000 for striking horse too many times",
            "external_url": "https://www.nbcnews.com/news/us-news/kentucky-derby-winning-jockey-suspended-fined-rcna206039",
            "upvotes": 2945,
            "date": "05/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250510-Junior-and-Sovereignt-ch-1444-462086.jpg",
            "top_comments": [
                "*Article Text By Mirna Alsharif and Matthew Mata:*\n\nThe jockey who rode Sovereignty to victory at the Kentucky Derby last week has been fined over $60,000 for striking the horse with his riding crop too many times during the race, according to the Horseracing Integrity and Safety Authority.\n\nJunior Alvarado was found to have struck the horse with his riding crop “more than the permitted amount” during last week’s race, violating the authority’s rules, it said in a statement Saturday.\n\nA penalty was imposed against Alvarado on Friday for committing the Class 3 violation and he was hit with a fine equating to 10% of his $310,000 winnings, the statement said. The fine was then doubled “pursuant to an escalating penalty structure for repeat riding crop violations within the previous 180 days,” resulting in a $62,000 fine, according to HISA.\n\nAlvarado was found to have struck Sovereignty eight times during the Kentucky Derby, which was his second offense in 180 days, per a HISA ruling. HISA protocol allows jockeys to strike horses a maximum of six times during a race.\n\nThe jockey was also suspended for two Kentucky racing days, May 29 and 30, as a result of the violation.\n\nThe jockey and Sovereignty won the 151st running of the Kentucky Derby last Saturday at Churchill Downs.",
                ">HISA protocol allows jockeys to strike horses a maximum of six times during a race.\n\n\nAh, so that's why Epona has six carrots in Zelda games.",
                "\"HISA protocol allows jockeys to strike horses a maximum of six times during a race.\" \n\nJunior Alvarado was found to have exceeded the limit by 2.\n\nSo I suggest 2 flogs for Junior, and 6 flogs for the idiotic judges who came up with this rule and now banning flogging once and for all.",
                "Yea but the horse will now makenthe owners millions of dollars in breeding fees. If im the horse owner id tell ny jockey to hit the horse as much as he wants and id pay the fine. $62k probably would cover the cost of one load of semen from the horse lol.",
                "Hopefully the jockey has learned a valuable lesson and from now on will only strike the horse an appropriate number of times.",
                "So 6 flogs = 2 pumps.  Got it.",
                "Some states have taken whips away from jockeys. Maybe Kentucky should join them.",
                "From a [reddit comment](https://www.reddit.com/r/horseracing/comments/1khhnmf/kentucky_derbywinning_jockey_of_sovereignty_fined/mr7vjyw/) in the horse racing sub by /u/BasisTraditional6588, not sure how accurate, but potentially it’s not as bad as it looks and the whips today are different than those historically used:\n\n> They're made of a type of foam. You can whip the shit out of yourself and it isn't particularly painful, even on bare skin and in sensitive areas. The sound and the sensation are absolutely used to continue encouraging the horse to move forward. The limit was put into place to prevent an obscene amount of strikes going down the stretch. It is absolutely possible to lose track with the adrenaline of everything, especially once a jockey and horse fall into rhythm. The only type of legal whip used in US racing now is usually fiberglass wrapped in thick foam. It is designed to cause a loud sound more than cause pain.\n\n> For the record, jockeys won't make millions riding one race: they take home roughly 10% of the earnings. Jose Alvarado took home $310,000 for his effort; he acknowledges his mistake, he understands he was one strike over, and he will pay his $31,000 fine.\nUnsure if links are allowed, but this is a pretty fair assessment of the use of whips in racing.\n\n> https://lightupracing.com/why-are-whips-used-in-racing/",
                "Horse racing is a disgusting “sport” and basically just legalized animal abuse.",
                "\"Sir, you spanked your horse too many times\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Pentagon orders military to pull books related to DEI and ‘gender ideology’",
            "external_url": "https://www.theguardian.com/us-news/2025/may/10/pentagon-dei-gender-ideology-books",
            "upvotes": 646,
            "date": "05/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/fd7c652ef487e2d81b54310919f766b3d40c95bc/641_0_5996_4799/master/5996.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c02ea558adb0bda246090cd5b3782206",
            "top_comments": [
                "From the article \n\n> The defense secretary, Pete Hegseth, has vowed to purge DEI from the Pentagon, saying when he took office earlier this year that “our diversity is our strength” is “the single dumbest phrase in military history”.",
                "All of this “anti-DEI” stuff going on in the military seems like a bad idea. The US military has historically had an over representation of minorities, especially in the lower ranks. The purging of generals that are non-white and trying to erase the history of minority contributions can’t be filling with the a willingness to carry out an unlawful/unconstitutional order if it comes to it. ",
                "The only way the sociopaths are winning is because they are allowed to do shit like this everywhere. 🤔",
                "Well, the goal is to help Putin weaken our military. Mission accomplished.",
                "Is it to make room for Hegseth's makeup room?",
                "[Sounds like this.](https://www.youtube.com/watch?v=D-0YQRb4_ho)\n\nWell, everybody knows what's next after burning books: Burning the authors.",
                "This is what they spend money on? Focus on?\n\nAmerica is so fucking cooked",
                "Fucking disgusting.  How about pulling Pete Hegseth out of the military?",
                "The ultimate adversary of the US Army will be composed of women and LGBT folks.",
                "I mean resistance is the US public putting up? It's sad to see it fail to a fascist state"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Elizabeth Holmes' partner raises millions for new biotech testing startup",
            "external_url": "https://www.npr.org/2025/05/10/nx-s1-5393950/elizabeth-holmes-theranos-billy-evans-blood-testing",
            "upvotes": 867,
            "date": "05/10/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8364x4705+0+436/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F7e%2Fc3%2F97d87ada4110b2460915ed5b66d3%2Fgettyimages-1248465288.jpg",
            "top_comments": [
                "Sucker birth rate = every minute.",
                "Been in startups all my career, it’s fueled by rich morons lying to even richer morons.",
                "Bad Blood by John Carreyrou is a great read if you're interested in what she did exactly.",
                "Suckerdom is not limited to the poors.",
                "trump has shown that stupid people can be conned over and over, and they keep coming back for more...",
                "This bitch intentionally had two kids to avoid jail. Fuck her",
                "Didn’t they make a movie about how we shouldn’t give this woman money?",
                "That chick makes Amway look like a S olid investment. The book Bad Blood and audiobook reads like a sopranos episode. Totally with a listen/read. Explains the entire ponzi of tech and the dogmatic persuitnof easy investor dosh.",
                "Hmm, I guess time really is a flat circle.",
                "they have kids but he's a hotel heir, I'm guessing his family's prenupped the shit out of that"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Iranian student in Alabama to self-deport despite withdrawal of initial charge behind his arrest | CNN",
            "external_url": "https://www.cnn.com/2025/05/09/us/iranian-student-alabama-self-deport-hnk",
            "upvotes": 1987,
            "date": "05/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25122638485828.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Alireza Doroudi, a 32-year-old Iranian doctoral student in mechanical engineering at the University of Alabama, has decided to voluntarily leave the United States after being detained for six weeks by immigration authorities.  His detention began in March 2025, despite the U.S. government later dropping one of the charges against him. \n\nDoroudi's student visa was revoked in June 2023 without explanation.  At that time, the university advised him that he could legally remain in the U.S. as long as he maintained his student status and did not leave the country.  In the spring of 2025, the government filed two charges to justify his deportation: the revoked visa and his alleged failure to maintain student status.  The first charge was withdrawn after the government acknowledged that the visa revocation was \"prudential\" and not immediately effective.  His attorney, David Rozas, is contesting the second charge. \n\nDespite having no criminal record or involvement in political activism, Doroudi was denied bond and held in a Louisiana detention facility.  Frustrated by the prolonged detention and the impact on his life, he chose to self-deport.  His fiancée, Sama Ebrahimi Bajgani, and his attorney expressed deep sadness and questioned why he was targeted.  Doroudi's case has heightened fear among international students in Alabama, particularly within the Iranian community, amid a broader immigration crackdown under President Trump's administration.",
                "Hard to call it justice when someone’s only real option is to give up and leave.",
                "A Doctoral student in Mechanical engineering - the best & brightest. This person would be an asset to ANY country, and the Trump admin is actively throwing people like this out of the country. SMDH",
                "The beginning of America's brain-drain.",
                "Fleeing the country is what he’s doing, not self deporting. Call it what it is, CNN, ffs.\n\nThe media using the propagandist language of the regime to make us think that it somehow isn’t terrifying people into fleeing the country for fear of their lives is despicable.",
                "I will deport and imprison your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. I will deport and imprison these, the homeless, tempest-tost to El Salvador, I lower my spray tan beside the golden toilet!",
                "Horrible headline. More like \"Iranian student flees country that prosecutes him without any reason before it happens again\".",
                "WTF. He is just a freaking student. Let him finish his degree. From the article, it is not like he is going to protests or anything. This is very arbitrary.",
                "I hope universities work out arrangements to make sure these poor students have a practical way to get degrees. \n\nIt’s insane and terrible that Trump is essentially torturing the best kids in the world. Shameful.",
                "Tourism to the US is rapidly declining.  No foreigner with any sense would even consider coming here at this point, unless it was required for their job.  Look at that German guy who was assaulted and strip searched for the “crime” of flying to America."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "'No ifs, no buts': Starmer and European leaders 'call out' Putin as they urge Russia to accept 30-day ceasefire",
            "external_url": "https://www.lbc.co.uk/world-news/starmer-calls-on-putin-to-accept-ceasefire-deal/",
            "upvotes": 1932,
            "date": "05/10/2025",
            "thumbnail": "https://images.lbc.co.uk/images/722739?width=1200&crop=16_9&signature=LQfnxwsHkXshW-rfgYhX82JWPjY=",
            "top_comments": [
                "Putin has no reason to oblige unless he actually feel his rear end is on fire.",
                "Oh, so what were they doing the last 3 years?",
                "What are they gonna do if he doesn't, sanction him?",
                "\"However, recent hours have seen a staunch Russian response, with the Kremlin suggesting the comments by European leaders had a \"confrontational\" character.\"\n\nIt's crazy we have to pretend like Russia aren't the ones that fucking invaded and have to coddle them into some form of peace. I know there's for sure many geopolitical things involved but if you do things out of public view, what you *do* do in public view is even more important. I hope trump doesn't flip flop and this is the \"start\" of a united NATO firmly and permanently against Russia in relation to their war",
                "All for a ceasefire, and the end of this war and the liberation of Crimea from the russian dogs occupying it, but I question why heavier sanctions are just now being threatened - why have they not already been in place for years?",
                "The sanctions do not work and at this point it's becoming one big joke.\n\nOh Europe isn't going to buy Russian gas anymore?\nNo we just buy it from India and Turkey for a little bit more money! Oh but India and Turkey buy it from Russia...",
                "Blah, blah - Russia sells the oil to a different country, we buy the oil from that different country for a little more than usual, Russia still makes its money, that different country profits too, we pay more for oil.\n\nThese sanctions do absolutely nothing, and everybody knows it. They need to find a genuinely effective way of hitting the Putmeister where it actually hurts.",
                "I’m really not one for military escalation but with NKs involvement Europe really does need to start getting its hands dirty.",
                "Starmer had time to call out with Trumps dick in his mouth? Impressive!",
                "What the hell is that picture, it's like some band poster"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Judge pauses much of Trump administration’s massive downsizing of federal agencies",
            "external_url": "https://apnews.com/article/trump-mass-firings-doge-lawsuit-b41f5b43f428965fd60bc272e3854e3b",
            "upvotes": 6653,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">“But he must do so in lawful ways,” she said. “He must do so with the cooperation of Congress, the Constitution is structured that way.”\n\nThis is one of those checks-and-balances I heard so much about.\n\n>[\"I Donald John Trump do solemnly swear that I will faithfully execute the Office of President of the United States, and will to the best of my ability, preserve, protect and defend the Constitution of the United States.\"](https://youtu.be/hAJb7uTcgAw?si=h_JDb__1tQT1oLwj)\n\nI guess that means he has to do it, right?",
                "If you are willing to put thousands of Americans out of jobs suddenly and with little to no warning, you are NOT \"America First\".\n\nI give two shits whether it's govt jobs or otherwise. These are Americans. Keep them employed.",
                "How do you freeze something that happened months after the fact?",
                "What will happen next:\n\n* The Trump admin will not comply\n\n* The judge will demand to know why\n\n* The Trump admin will gaslight and lie to the judge\n\n* The judge will write a strongly worded opinion or letter\n\n* Nothing will ultimately happen",
                "Fuck traitor trump and his weak unamerican sheep",
                "He will not comply. Asked to pause would be a better title.",
                "They will definitely jail the judge and resume the firings",
                "So glad they stopped this now, after I've had a couple people I know, who voted against Trump, lose their jobs",
                "I feel like I’ve seen so many articles about judges putting a “pause” to things but then those things still happen….",
                "And he will continue to ignore it. He isn’t even listening to the Supreme Court"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "India and Pakistan accuse each other of 'violations' after ceasefire deal",
            "external_url": "https://www.bbc.co.uk/news/articles/cvg9d913v20o",
            "upvotes": 345,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2817/live/99e5c210-2dd9-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "Surprising exactly no one",
                "So do all the bots brigading.",
                "\"In wartime, truth is so precious that she should always be attended by a bodyguard of lies.\"\n\n\n--Winston Churchill",
                "isn't it 'funny' how Trump jumped into this within days, yet he's let Russia bomb the shit out of Ukraine and basically done nothing but try to rob them",
                "These stupid, ignorant, idiotic men are exactly why we need more women in politics all over the world.",
                "They probably did 🤷‍♂️.",
                "Hi Tyreed, good job blocking me lol\n\nyou've been following it on twitter and forming your opinion on what people tell you\n\nLets start with the associated press and go from there\n\n[https://apnews.com/video/india-and-pakistan-agree-to-a-ceasefire-in-us-mediated-talks-63971f296ea54cee9ad0ddd85ac30e0b](https://apnews.com/video/india-and-pakistan-agree-to-a-ceasefire-in-us-mediated-talks-63971f296ea54cee9ad0ddd85ac30e0b)",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "'No ifs, no buts': Starmer and European leaders 'call out' Putin as they urge Russia to accept 30-day ceasefire",
            "external_url": "https://www.lbc.co.uk/world-news/starmer-calls-on-putin-to-accept-ceasefire-deal/",
            "upvotes": 1933,
            "date": "05/10/2025",
            "thumbnail": "https://images.lbc.co.uk/images/722739?width=1200&crop=16_9&signature=LQfnxwsHkXshW-rfgYhX82JWPjY=",
            "top_comments": [
                "Putin has no reason to oblige unless he actually feel his rear end is on fire.",
                "Oh, so what were they doing the last 3 years?",
                "What are they gonna do if he doesn't, sanction him?",
                "\"However, recent hours have seen a staunch Russian response, with the Kremlin suggesting the comments by European leaders had a \"confrontational\" character.\"\n\nIt's crazy we have to pretend like Russia aren't the ones that fucking invaded and have to coddle them into some form of peace. I know there's for sure many geopolitical things involved but if you do things out of public view, what you *do* do in public view is even more important. I hope trump doesn't flip flop and this is the \"start\" of a united NATO firmly and permanently against Russia in relation to their war",
                "All for a ceasefire, and the end of this war and the liberation of Crimea from the russian dogs occupying it, but I question why heavier sanctions are just now being threatened - why have they not already been in place for years?",
                "The sanctions do not work and at this point it's becoming one big joke.\n\nOh Europe isn't going to buy Russian gas anymore?\nNo we just buy it from India and Turkey for a little bit more money! Oh but India and Turkey buy it from Russia...",
                "Blah, blah - Russia sells the oil to a different country, we buy the oil from that different country for a little more than usual, Russia still makes its money, that different country profits too, we pay more for oil.\n\nThese sanctions do absolutely nothing, and everybody knows it. They need to find a genuinely effective way of hitting the Putmeister where it actually hurts.",
                "I’m really not one for military escalation but with NKs involvement Europe really does need to start getting its hands dirty.",
                "Starmer had time to call out with Trumps dick in his mouth? Impressive!",
                "What the hell is that picture, it's like some band poster"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Kentucky Derby-winning jockey suspended, fined $62,000 for striking horse too many times",
            "external_url": "https://www.nbcnews.com/news/us-news/kentucky-derby-winning-jockey-suspended-fined-rcna206039",
            "upvotes": 2938,
            "date": "05/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250510-Junior-and-Sovereignt-ch-1444-462086.jpg",
            "top_comments": [
                "*Article Text By Mirna Alsharif and Matthew Mata:*\n\nThe jockey who rode Sovereignty to victory at the Kentucky Derby last week has been fined over $60,000 for striking the horse with his riding crop too many times during the race, according to the Horseracing Integrity and Safety Authority.\n\nJunior Alvarado was found to have struck the horse with his riding crop “more than the permitted amount” during last week’s race, violating the authority’s rules, it said in a statement Saturday.\n\nA penalty was imposed against Alvarado on Friday for committing the Class 3 violation and he was hit with a fine equating to 10% of his $310,000 winnings, the statement said. The fine was then doubled “pursuant to an escalating penalty structure for repeat riding crop violations within the previous 180 days,” resulting in a $62,000 fine, according to HISA.\n\nAlvarado was found to have struck Sovereignty eight times during the Kentucky Derby, which was his second offense in 180 days, per a HISA ruling. HISA protocol allows jockeys to strike horses a maximum of six times during a race.\n\nThe jockey was also suspended for two Kentucky racing days, May 29 and 30, as a result of the violation.\n\nThe jockey and Sovereignty won the 151st running of the Kentucky Derby last Saturday at Churchill Downs.",
                ">HISA protocol allows jockeys to strike horses a maximum of six times during a race.\n\n\nAh, so that's why Epona has six carrots in Zelda games.",
                "\"HISA protocol allows jockeys to strike horses a maximum of six times during a race.\" \n\nJunior Alvarado was found to have exceeded the limit by 2.\n\nSo I suggest 2 flogs for Junior, and 6 flogs for the idiotic judges who came up with this rule and now banning flogging once and for all.",
                "Yea but the horse will now makenthe owners millions of dollars in breeding fees. If im the horse owner id tell ny jockey to hit the horse as much as he wants and id pay the fine. $62k probably would cover the cost of one load of semen from the horse lol.",
                "Hopefully the jockey has learned a valuable lesson and from now on will only strike the horse an appropriate number of times.",
                "So 6 flogs = 2 pumps.  Got it.",
                "Some states have taken whips away from jockeys. Maybe Kentucky should join them.",
                "From a [reddit comment](https://www.reddit.com/r/horseracing/comments/1khhnmf/kentucky_derbywinning_jockey_of_sovereignty_fined/mr7vjyw/) in the horse racing sub by /u/BasisTraditional6588, not sure how accurate, but potentially it’s not as bad as it looks and the whips today are different than those historically used:\n\n> They're made of a type of foam. You can whip the shit out of yourself and it isn't particularly painful, even on bare skin and in sensitive areas. The sound and the sensation are absolutely used to continue encouraging the horse to move forward. The limit was put into place to prevent an obscene amount of strikes going down the stretch. It is absolutely possible to lose track with the adrenaline of everything, especially once a jockey and horse fall into rhythm. The only type of legal whip used in US racing now is usually fiberglass wrapped in thick foam. It is designed to cause a loud sound more than cause pain.\n\n> For the record, jockeys won't make millions riding one race: they take home roughly 10% of the earnings. Jose Alvarado took home $310,000 for his effort; he acknowledges his mistake, he understands he was one strike over, and he will pay his $31,000 fine.\nUnsure if links are allowed, but this is a pretty fair assessment of the use of whips in racing.\n\n> https://lightupracing.com/why-are-whips-used-in-racing/",
                "Horse racing is a disgusting “sport” and basically just legalized animal abuse.",
                "\"Sir, you spanked your horse too many times\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Putin suggests Russia and Ukraine have 'direct' talks next week - BBC News",
            "external_url": "https://www.bbc.co.uk/news/articles/ce821nl3251o",
            "upvotes": 449,
            "date": "05/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/334c/live/611101a0-2df4-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "\"It's a trap!\" -- Admiral Ackbar",
                "This is the same president who has violated multiple ceasefires, has gotten other countries to fight his war for him and commited *several* war crimes and only now he  wants to have “direct talks”\n\nPutin is insane, he's definitely going to try and get a deal which is in the benefit of Russia, or in the unlikely scenario Putin has finally realized the game is up and wants to actually stop either way, I don't see this ending well for Ukraine at all.\n\nedit: wording",
                "More stalling tactics from the Russian methinks.",
                "Yeah, man. Come to Ukraine. They’d love to see your murderous ass.",
                "So he can poison Zelensky?",
                "If Zelensky agrees, it'd better be on the first floor of neutral soil and he refuses all refreshments.",
                "> \"We seek serious talks... to remove the root causes of the conflict and start moving towards a lasting, strong peace\"\n\nDo you think he's ever seen a mirror? Just fucking go home!",
                "He wants to have tea with Zelensky I'm sure.",
                "Direct bombings he says, Putin is lier and totally evil. Nothing he says can be trusted",
                "Putin, you can always just turn around and leave. That will not magically solve all the problems, but it is a good start as you are the one causing all the issues. \n\n\nStop this madness."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Man checks out 100 books from Beachwood Library, then burns them in social media post",
            "external_url": "https://www.cleveland.com/community/2025/05/man-checks-out-100-books-from-beachwood-library-then-posts-on-social-media-video-of-those-books-burning.html?outputType=amp",
            "upvotes": 12049,
            "date": "05/10/2025",
            "thumbnail": "https://www.cleveland.com/resizer/v2/AVVKSQTABNCR3P5N6KUHGZL3WE.jpg?auth=534a7df2570bc1342c5c6565b3b848439af8474daac25ece06431a2a1bb53949&width=1280&quality=90",
            "top_comments": [
                "Charge him with destruction of public property.",
                "If the library has a donation page I’ll happily donate",
                "> The 100 books were valued at approximately $1,700. As the books were not yet overdue, the library will wait until they are overdue, then send a bill to the man.\n\nLibraries are awesome.",
                "Hopefully this results in a situation where people read copies of the burned books and donate to the library to improve its funding.\n\nEdit: According to the article, this disphit will be billed for the books once they are overdue and is banned from the library’s premises.",
                ">the man checked out 50 books on topics that included Jewish history, African-American history and LGBTQ education.\n\nGee, I wonder who he voted for.",
                "For readers, I wanna point out that today, May 10th, is the 80th anniversary of the book burnings in Nazi Germany in Berlin.\n\nCongrats, America.",
                "Gotta let you guys know, beachwood is very, very Jewish.",
                "As part of a punishment, I feel he should be forced to read and write a paper on each of the books.",
                "Most literate Trump supporter",
                "Now the library will buy those books again to replace them and the authors get double the income."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Iranian student in Alabama to self-deport despite withdrawal of initial charge behind his arrest | CNN",
            "external_url": "https://www.cnn.com/2025/05/09/us/iranian-student-alabama-self-deport-hnk",
            "upvotes": 1985,
            "date": "05/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25122638485828.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Alireza Doroudi, a 32-year-old Iranian doctoral student in mechanical engineering at the University of Alabama, has decided to voluntarily leave the United States after being detained for six weeks by immigration authorities.  His detention began in March 2025, despite the U.S. government later dropping one of the charges against him. \n\nDoroudi's student visa was revoked in June 2023 without explanation.  At that time, the university advised him that he could legally remain in the U.S. as long as he maintained his student status and did not leave the country.  In the spring of 2025, the government filed two charges to justify his deportation: the revoked visa and his alleged failure to maintain student status.  The first charge was withdrawn after the government acknowledged that the visa revocation was \"prudential\" and not immediately effective.  His attorney, David Rozas, is contesting the second charge. \n\nDespite having no criminal record or involvement in political activism, Doroudi was denied bond and held in a Louisiana detention facility.  Frustrated by the prolonged detention and the impact on his life, he chose to self-deport.  His fiancée, Sama Ebrahimi Bajgani, and his attorney expressed deep sadness and questioned why he was targeted.  Doroudi's case has heightened fear among international students in Alabama, particularly within the Iranian community, amid a broader immigration crackdown under President Trump's administration.",
                "Hard to call it justice when someone’s only real option is to give up and leave.",
                "A Doctoral student in Mechanical engineering - the best & brightest. This person would be an asset to ANY country, and the Trump admin is actively throwing people like this out of the country. SMDH",
                "The beginning of America's brain-drain.",
                "Fleeing the country is what he’s doing, not self deporting. Call it what it is, CNN, ffs.\n\nThe media using the propagandist language of the regime to make us think that it somehow isn’t terrifying people into fleeing the country for fear of their lives is despicable.",
                "I will deport and imprison your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. I will deport and imprison these, the homeless, tempest-tost to El Salvador, I lower my spray tan beside the golden toilet!",
                "Horrible headline. More like \"Iranian student flees country that prosecutes him without any reason before it happens again\".",
                "WTF. He is just a freaking student. Let him finish his degree. From the article, it is not like he is going to protests or anything. This is very arbitrary.",
                "I hope universities work out arrangements to make sure these poor students have a practical way to get degrees. \n\nIt’s insane and terrible that Trump is essentially torturing the best kids in the world. Shameful.",
                "Tourism to the US is rapidly declining.  No foreigner with any sense would even consider coming here at this point, unless it was required for their job.  Look at that German guy who was assaulted and strip searched for the “crime” of flying to America."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Lithium deposit valued at $1.5 trillion discovered in the U.S.",
            "external_url": "https://www.earth.com/news/volcanic-white-gold-a-lithium-deposit-valued-at-1-5-trillion-has-been-discovered-in-the-u-s/",
            "upvotes": 30267,
            "date": "05/10/2025",
            "thumbnail": "https://cff2.earth.com/uploads/2025/05/09071935/lithium-mine_McDermitt-Caldera_1-5-trillion-dollars_1m.jpg",
            "top_comments": [
                "Gorman County, Oregon.",
                "The children yearn for the mines",
                "We should invade and win the hearts and minds of the people by building roads and schools.",
                "This was discovered several years ago. It's not news.",
                "There are many sites with (BIG NUMBER) valued lithium.  The problem was how much the extraction and refining cost compared to (BIG NUMBER).  It frequently translated to close to, or exceeded,  (BIG NUMBER).\n\n  \nJust like there are a number of 'rare earth mineral' deposits in the U.S....they just aren't practical to extract.",
                "Finding the deposit is \"easy\".\n\nMining it is a little trickier.\n\nTurning it into \\_\\_usable\\_\\_ lithium. Thats the HARD part that needs a lot of infrastructure, power and skill.\n\nThere is a new one under construction in California. Its a $1.8Bln facility, owned by an Australian company. Otherwise the ore has to be export to Australia, Chile or China. The US does have some other processing capabilities, but its mostly the Aussies with the know-how (I guess it involves using shitty beer to do it? j/k). \n\nBear in mind that if its processed abroad thats 2 x shipping costs, plus hazards materials handling, plus a tariff.\n\nSo that $1.8Bln plant, even if its a smaller facility, will be really useful! But its not going to be able to handle all of it, or in a timely manner.\n\nThis is a good link for more info: [Lithium Supply Chain: Understanding the Basics | Shipping and Commodity Academy](https://shippingandcommodityacademy.com/blog/lithium-supply-chain-understanding-the-basics/) (other pages exist but they all say about the same thing. Obviously the \"US reserves\" are now slightly higher than on that page mind).",
                "Jesus that website is trash. Over half my screen was covered in undeletable ads. Couldn't even read the damn article.",
                "If you've ever been out there - it seems like nothing but desert and high desert/mountains,  but look at the area as the watershed that feeds into the Columbia river and the underground aquifers that also feed into the Columbia river and all the tributaries hence forth.\n\nThey can't just go in their and extract it if it's going to hurt the watersheds of the west.\n\nI worked near two superfund sites - I live near superfund site about 15 miles south of me.\n\nExamples:\n\nThe entire south end of Vashon Island and Ruston area (Tacoma WA metro) is contaminated with exaust tailings to the point where plants harvested there contain those chemicals like lead to this day. (There's a summer camp there that predates the smokestacks that kids roll around in the dirt right THERE.) \n\nIn Butte, Montana and subsequently a 200 mile radius and anywhere in the MT/WY/NV area there are both smokestack areas of contamination and pools of deadly chemicals leftover from the 1800s-1970s. Pools of arsenic and lead. If you've been there you know.  Cows and horses just walk around grazing in these areas.\n\nPicher, Oklahoma - \"the most toxic ghost town\" in the USA. The entire story is a trip. Silent Hill type stuff. I went to a museum exhibit on it in Norman.\n\nEdmond, OK - currently having to treat it's watershed contaminated with fracking juices - oh but they won't tell you that.  They just want to see you bougie houses and ride out the earthquakes.  (source - Geologist who works for oil company who quit over it I dated - so dubious.) \n\nQuestion is not \"We make money now\"\n\nbut \"Where will we live AFTER the mine closes and we don't make money anymore?\"\n\nExample of Lithium Extract- from source:\n\n# Brine Extraction\n\nBrine extraction is another method of extracting lithium. This method involves pumping brine from underground aquifers into evaporation ponds. The sun and wind evaporate the water, leaving behind lithium and other minerals. The following are the steps involved in brine extraction:\n\n* Drilling: Wells are drilled into the ground to access the brine.\n* Pumping: The brine is pumped to the surface and transported to the evaporation ponds.\n* Evaporation: The brine is evaporated in the ponds, leaving behind lithium and other minerals.\n* Processing: The extracted lithium is then processed to produce lithium carbonate or other lithium compounds.\n\nBrine extraction is a less costly and less energy-intensive method of extracting lithium. It is also less harmful to the environment than hard rock mining. However, it is highly dependent on weather conditions, and the process can take several months to complete.\n\nOverall, both hard rock mining and brine extraction have their advantages and disadvantages. Companies choose the method that suits their needs and resources.\n\n#",
                "For those unaware, the U.S. has lithium in a ton of places but as of now the only real site that is extracting lithium in any meaningful capacity is in Nevada. There is a site that has been identified for development in Arizona as well.\n\nBut all of that is sort of moot because right now virtually all REFINING of lithium has to go through China so absent developing that domestic refining we won’t be gaining independence any time soon.",
                "It's never the issue whether we have lithium mine or not. We always have the. It's just the environmental cost to mine and produce it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Zero ships from China are bound for California’s top ports. Officials haven’t seen that since the pandemic | CNN Business",
            "external_url": "https://www.cnn.com/2025/05/10/business/zero-ships-china-trade-ports-pandemic",
            "upvotes": 28760,
            "date": "05/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213552030.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Not a problem. We'll just build a bunch of factories and make stuff here. Let's see, now.. Gonna need some steel, some machines, some...oops.",
                "And remember everyone!:\n\n**ONCE THE PRICES GO UP, THEY AIN'T GONNA BRING EM BACK DOWN**",
                "The guy who unintentionally crashed the economy by mismanaging the pandemic was  re-elected so he can intentionally crash the economy by mismanaging a a recovery.\n\nSeriously. He blames Obama and Biden for everything, but both of them handed him a rising economy for him to destroy. And he didnt even say thank you.",
                "Here come the shortages.  I don't think most people realize how bad this is going to get and just assume everything will be fine.",
                "The next couple months are going to be really interesting , as summer kicks off and people are going to start feeling the effects of their leaders decisions.\n\nI expect a lot of angry , confused Americans will be flooding social media looking for answers. \n\nGet your popcorn ready",
                "Remember, we saw insane inflation as an aftereffect from the pandemic. Supply disruptions don't immediately hit hard due to buffer inventories along the supply chains. When  this eventually affects us, it will be insane and likely cause another massive recession.\n\nAlso, other countries are adapting to the US playing games by securing deals with new partner countries. It will probably take decades for the US to undo the damage.",
                "Americans are gonna be bootlegging cheap Chinese products from Canada.",
                "Back-to-school is going to be fun… no shoes, no computers, no backpacks, no supplies, no dorm-room accoutrements, at prices that even vaguely resemble what parents are used to paying, when they can get them at all.\n\nBut it’ll be Biden’s Fault somehow.",
                "Medicine and medical supplies are at the very top of my concerns. Stupid disposal stuff like gauze, sutures, sterilization bags, PPE. So much of it is from China.",
                "Republicans always do more harm to the economy than they ever help it.  A democrat will get elected to fix it but they won’t be 100% perfect.  Then people will vote for a republican again and the cycle keeps repeating."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Pakistan violates ceasefire, multiple blasts reported in Srinagar",
            "external_url": "https://www.indiatvnews.com/news/india/pakistan-violates-ceasefire-multiple-blasts-reported-in-srinagar-2025-05-10-989717",
            "upvotes": 5661,
            "date": "05/10/2025",
            "thumbnail": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2025/05/untitled-design-2025-05-10t212338-1746892439.jpg",
            "top_comments": [
                "Rip Ceasefire 11/5-11/5",
                "Liz Truss lasted longer in office than this ceasefire",
                "Didn’t Trump this morning take credit for negotiating this?",
                "Trump should tell Trump that none of this would have happened if he was president",
                "Alt non-Indian sources: https://www.reuters.com/world/asia-pacific/blasts-heard-indian-kashmir-hours-after-india-pakistan-ceasefire-announcement-2025-05-10/\n\nhttps://www.nytimes.com/live/2025/05/10/world/pakistan-india-kashmir/2ab7f2dd-ab98-5e43-982c-b25ec669d659?smid=url-share\n\nhttps://www.cnn.com/world/live-news/india-pakistan-operation-sindoor-05-10-25#cmaidwdgk00183b6msj36oc9x\n\nSky News says that people have reported blasts to Reuters News Agency https://news.sky.com/story/india-pakistan-live-dozens-killed-as-india-launches-missile-strikes-on-pakistan-controlled-territory-13363087?postid=9562997#liveblog-body",
                "Bruh how was it shorter than the ceasefire in Palestine and Israel. edit x2 officials confirmed ceasefire breach [livestream of confirmation by India ](https://www.youtube.com/live/k4t1ssQ27_8?si=tAVKh5NMGNxPYtQv)",
                "This is how I found out India and Pakistan had a ceasefire agreement ",
                "[deleted]",
                "Looks like Pakistani government agreed for the ceasefire but not the military. You need to understand the fact that Pakistan’s military controls the country, receives disproportionate size of country’s budget and maintain their relevance by keeping the disturbances alive. Sometimes that’s by supporting terrorist organizations other times it by not listening to their PM.",
                "But the conservatives were so proud of Trumps ability to end the fighting D:"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/11/2025 08:10:44 UTC"
}