{
    "posts": [
        {
            "category": "HOT",
            "title": "Woman says United Airlines crew tried to make her remove son's ventilator",
            "external_url": "https://www.nbcnews.com/news/us-news/woman-united-airlines-crew-tried-make-remove-sons-ventilator-rcna197695",
            "upvotes": 6020,
            "date": "03/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-01/250108-united-airlines-ch-1424-5c7329.jpg",
            "top_comments": [
                "> United said it has contacted Sotomayor \"to address her concerns and apologized for any frustration she may have experienced.\" The airline did not provide further details.\n\n\n> Sotomayor told NBC...the airline’s apology “was not sincere.”\n\n\nObviously, because that wasn't a real apology.  \"I'm sorry you felt bad\" is not an acknowledgement of any wrongdoing.  \n\n\nThat said, they have to know they are toast if they are sued over this so maybe not admitting wrongdoing is part of their litigation damage control.  She even went the extra mile \"she shared the documentation with the airline before the trip and that the airline cleared her son's medical equipment with no problem.\"  Combine that with the flight attendants providing B.S. medical advice that the son would \"be OK until we're in the air at a high enough altitude.\"  This whole incident stinks.",
                "United Airlines 🤜🤛 United Healthcare\n\n\"One way or another that two-year old has to go.\"",
                "This is actually nuts. The whole plane crew working together really trying to kill that kid",
                "Ma'am, he'll need that to live.",
                "My baseline for United customer service is \"better or worse than beating up a doctor and dragging him off the plane?\"",
                "Sounds like the flight attendants need to attend a little training course.",
                "Wow. It’s a trach tube not an earring. Thank God the mom stuck to her documentation and did not take away her son’s lifeline until they got to cruising altitude.",
                "It’s not even remotely the same, but when our son was two - we were taking him on a flight in his airline approved car seat. \n\nThe flight attendant demanded we remove him from the car seat before take off. We argued it was literally the safest place for him and provided the documents that it was approved - and she still threatened to kick us off.\n\nIt’s like these flight attendants are being trained to be the most self righteous cunts possible.",
                "So many of these crazy stories come from United Airlines",
                "I’m just thinking about that poor child just trying to survive the flight and the audacity of an airline attendant to suggest he would be ok without oxygen is insane. Hopefully she makes millions in her lawsuit and have plenty of funds to take care of herself and her child."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Man drives into protesters outside Tesla dealership in Palm Beach",
            "external_url": "https://www.nbcmiami.com/news/business/man-drives-car-into-protesters-outside-a-tesla-dealership-in-palm-beach-county/3574124/",
            "upvotes": 1606,
            "date": "03/24/2025",
            "thumbnail": "https://media.nbcmiami.com/2024/04/GettyImages-2148753423.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "How much do you want to be he's not going to get a terrorism charge",
                "Protesters will probably be charged under a new interpretation of the stand your ground law because of how dumb this time line is.",
                "Setting inanimate objects on fire.\n\nMAGA: Terrorism!\n\nLiterally driving a car on a sidewalk with intent to hit people.\n\nMAGA: ...",
                "If there was any doubt, he's also MAGA (or at least shares the name with one). Internet archive captured from 2020: https://web.archive.org/web/20201001033554/https://www.trumpettesusa.com/andrew-dutil-trumpster/         \n           \nAndrew Dutil is a domestic terrorist (allegedly)",
                "Imagine your ego is so fragile that you get offended because people are protesting a ketamine addicted idiot that you try to kill them. ",
                "Let me guess...This TRUE PATRIOT will get an ovation from the fascists, not a terrorism charge.",
                "Imagine the right wing freak out if someone had driven into the maga crowd as they were trying to break until the capitol.",
                "*republican domestic terrorist* drives into protesters.",
                "Just another day another American domestic terrorist incident 👍🏽",
                "\"Some very fine people on both sides.\""
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Bumble Bee sued by deep-sea crew who say they were forced into ‘fishing boat slavery’",
            "external_url": "https://www.cnn.com/2025/03/21/business/bumble-bee-forced-labor-fishing-lawsuit-intl-hnk/index.html",
            "upvotes": 1293,
            "date": "03/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/greenpeace-2.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> Last year, Bumble Bee agreed to remove claims of a “fair and safe supply chain” and “fair and responsible working conditions” from its website, social media and other advertising as part of a settlement with Global Labor Justice-International Labor Rights Forum. \n\n\"Oh my god, he admit it!\"",
                "Sadly, [this isn't new](https://www.npr.org/2016/09/13/493801034/ap-report-exposes-slave-like-conditions-on-hawaii-fishing-fleets). The US [fought a war](https://www.archives.gov/publications/prologue/2012/summer/1812-impressment.html) over it as a matter of fact.",
                "Yikes. It’s dolphin safe but not fisherman safe. ",
                "I remember reading how bad it was in shrimp fishing side but its kinda obvious its more wide spread in fishing industry.\n\nOrganised crime is deep in agriculture and fishing and people with debts or just trafficked get caught up in it. Larger companies dont care or turned blind eye to their suppliers or where they get their catch. The scale of demand makes it easier too. If theres money to be made it’s corrupt easily with no oversight\n\nEvery country is one civil war or collapse away to having its population picked off by slavers when fleeing borders",
                "Yeah the huge industrial scale of slavery in the global fishing industry, the conditions that the men are kept in, and the sickeningly high mortality rate have been known for a long time. The problem is getting anyone to care, because they're men, and because they're not white.",
                "But line on index funds must go up.",
                "I thought they meant Bumble the dating app and was confused thinking they must have branched out to fishing slavery as well.",
                "Considering how much of the world fishing trade is owned and operated by moonies, I'm not surprised"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Russia-Ukraine war: Russian missile hits Sumy children's hospital, Kyiv says, as talks on possible truce continue",
            "external_url": "https://www.bbc.co.uk/news/live/cq6y3my01ndt",
            "upvotes": 912,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a320/live/71f44d10-08c9-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "Talking of possible truce and blowing up a hospital are two completely different things",
                "Trump literally gave them the coordinates."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "South Korean court overturns impeachment of Prime Minister Han, reinstating him as acting president",
            "external_url": "https://apnews.com/article/south-korea-impeachment-han-ducksoo-20daed0fb3c90c02ca229c977d230b06",
            "upvotes": 5184,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This guy isn't Yoon (The president who started the Martial Law Order), he is up for sentencing next. If he doesn't get impeached, then shit will go down.",
                "Context on the quorum bit, since AP doesn’t provide it - Korea’s national assembly has 300 seats. A simple majority is enough to impeach most officials, but a 2/3 majority is required to impeach the president. It was (and maybe still is) an open question what the requirement was to impeach an acting president - 151 because he is the prime minister, or 200 because he is (acting) president? Apparently some of the justices think it’s the latter, (edit) but it seems like the majority ruled that it’s 151.\n\nThis feels like it was the weakest of the cases, for what it’s worth. He was consistently saying he was against the martial law, and it seems like they failed to prove he was actually involved with it.",
                ">On Monday, seven of the court’s eight justices overturned or dismissed Han’s impeachment. They ruled the accusations against him weren’t against the law or weren’t serious enough to remove him from office or his impeachment motion didn’t even meet a required quorum when it passed through the assembly.\n\nNot having a quorum seems sketchy. The other parts of South Korean law, I can't comment on.",
                "The amount of people who are r/confidentlyincorrect here is astonishing...",
                "If you didn't read the article before commenting, you're part of the problem.",
                "Not the guy most people are assuming, but very interesting that the court can overturn an impeachment.",
                "Wow the world is going crazy",
                "[removed]",
                "So I don't know a l9t about the court system in Korea. Is this outrageous, or is this something that sometimes happens?",
                "Impeachment of Han was kinda sketchy so this isn't surprising at all."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Turkey announces 1,133 arrests have been made in relation to protests.",
            "external_url": "https://www.bbc.co.uk/news/live/cq6yde479gdt?post=asset%3Ae185b269-c225-4fbc-802f-6746e2130039#post",
            "upvotes": 846,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0892/live/60fd2460-08b9-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "How long until these headlines are about USA?",
                "Is it coup season in Turkey already?",
                "But they gave us eggs! Can't be that bad /s",
                "Shall we… applaud? 👏\n\nOk that’s enough\n\nEdit: it was one Applaus for the government with an /s… not as obvious as I thought."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Andrew and Tristan Tate make police appearance in Romania",
            "external_url": "https://www.bbc.co.uk/news/articles/c62xky7rn75o",
            "upvotes": 677,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8cc2/live/25752540-089c-11f0-97d3-37df2b293ed1.jpg",
            "top_comments": [
                "“I am one of the most important people on the planet.”\n\nMm.",
                "Life in prison is too good for them.",
                "Andrew Tate:  One of the top 5 reasons for vaginal dryness.",
                "There’s no way, with a face like that, that Tate doesn’t love to be pissed on. ",
                "Hopefully Romania will either sell these criminals to El-Salvador's prison system like the US now does with people ICE deports, or they'll send them to Guantanamo Bay like the US does.\n\nRomania shouldn't keep sickos like this in their proud country.",
                "Classic narcissist like Trump. Both spouting copious amounts of rapid fire bullshit that makes it near impossible to refute or question, both utterly convinced of their own greatness. Both pathetic little man babies.",
                "They're always so pissy. All these two do is whine about everything.",
                "Future Trump diplomats",
                "Criminals often use notoriety as cover and that's what is happening here.",
                "Can someone explain how they could be under investigation for this long without any formal charges?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "IRS braces for $500bn drop in revenue as taxpayers skip filings in wake of DOGE cuts",
            "external_url": "https://www.independent.co.uk/news/world/americas/us-politics/irs-doge-cuts-tax-filing-b2719911.html",
            "upvotes": 23528,
            "date": "03/23/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/20/20/26/Pictures-of-the-Week-Global-Photo-Gallery-e8cfpnw5.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "Simple tax returns are audited by computer.  It's the difficult returns that need analysis.  The rich will get away with more as intended.",
                "For anyone considering this - just be aware that the fines for not filing are quite high: “The failure-to-file penalty is usually 5% of the tax owed for each month your return is overdue, up to 25% of the bill.” ([IRS policy here](https://www.irs.gov/payments/failure-to-file-penalty))\n\nI’m not sure if they’ll have the staff to go after folks later but tax issues are known to pop up and bite you many years later. You may not hear anything for a decade and then suddenly get a bill.",
                "We saved $50 million. It just cost $1 trillion.",
                "Tax accountant here - This is not for people who have simple returns with a W-2 or small Schedule C business.  This is for the complicated filers.  People using business loans from their pass-through S-Corp instead of having proper Officer wages.  People claiming losses without proper basis tracking.  People using shell companies to hide or officiate income sources.  People claiming improper foreign tax credits.\n\nNot your average Joe and Jane.  Enforcement is already at record lows for audits.  Now people will push harder and less ethical accountants will try to save their clients more money.  A lot of my industry revolves around people doing grey-area things getting their hands slapped every so often to remind them \"don't do that\".  As those stop, the more people will cheat and trim the edges.",
                ">\"New hires in taxpayer services and enforcement divisions have been targeted **and the agency has dropped investigations of high-value corporations and taxpayers**\"\n\nThat's the highlight of the article, That's the sole reason that people are angry and are writing about not paying taxes, not cause doge is 'cutting IRS jobs' or any of that other shit, Poor people are saying \"If those rich bastards ain't paying then neither am i\" and agree with the sentiment as a threat, obviously neglecting your taxes is not advisable in the long run, but do people have any other means to voice their opinions at the moment?",
                "Republicans would be happy to starve to federal government and use that as an excuse to cut programs and services",
                "I feel like an idiot paying for estimated taxes",
                "So let's see\n\nWe have citizens saying we shouldn't pay taxes, we won't get caught. We have states saying we should withhold fed taxes if trump plays games with funding, especially in giver states. We have federal officials ignoring federal judges rulings because they thought they could ignore a verbal judgement (latest excuse) and illegally deporting people. We are dismantling the department of education. The president did a car advertisement for a ketamine addict at the white house. All of our allies are breaking off trade, opting for non american weapons and tech, and are issuing travel warnings to dissuade tourists from going to the US.\n\nIn short we have a major breakdown in both rule of law as well as respect for the federal government and democracy.\n\nIt has only been 60 days since Jan 20th.",
                "Do they even have the resources to go after non-payers?",
                "I’m willing to bet dollars to donuts Wonderboy won’t be paying his fair share for the next four years and beyond"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Three men found guilty of plotting to murder £54m Securitas robber Paul Allen",
            "external_url": "https://news.sky.com/story/three-guilty-of-plot-to-murder-54m-securitas-heist-gang-member-13330360",
            "upvotes": 236,
            "date": "03/24/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-paul-allen-securitas_6858758.jpg?20250316161011",
            "top_comments": [
                "Let’s see Paul Allen’s card",
                "These all read like a movie plot",
                "Try getting a reservation at Dorsia now you stupid fucking bastard",
                "But I had dinner with Paul Allen in London.",
                "Does this Paul Allen like Huey Lewis and The News?",
                "Try getting a reservation at Dorsia now you stupid fucking bastards!",
                "Linen textured business cards cited as motive for hit.",
                "I came to see if people were referencing the movie. Reddit does not disappoint.",
                "You like huey Lewis and the news?",
                "People need to lighten up. Every single comment referencing “the movie” is getting downvoted. It’s low hanging fruit but damn the name is a funny coincidence. Despite this subs popular opinion, it is actually possible to find humor in something without approving of the source of the humor (planned attempted murder)"
            ],
            "aggregate_sentiment": 53.0
        },
        {
            "category": "HOT",
            "title": "Couple sentenced to hundreds of years in prison for forcing adopted Black children to work as 'slaves'",
            "external_url": "https://www.nbcnews.com/news/us-news/couple-sentenced-hundreds-years-forcing-black-children-work-slaves-rcna197533",
            "upvotes": 28001,
            "date": "03/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250319-west-virginia-abuse-mb-0743-4120e9.jpg",
            "top_comments": [
                "> Whitefeather apologized to the children during the sentencing.\n\"I just want the court to know that I have made mistakes I am very sorry for that and I love my children and I have never, ever, done anything to my ... children to harm them intentionally,” she said, according to WSAZ. “Children, I do love you.”\n\nImagine forcing children into slavery, locking them in sheds, and abusing them horribly. Keeping them dirty, cold, and hungry. Then trying to tell your victims you didn't hurt them, and you love them. Lying and manipulation from an absolute monster. I hope those kids get the best support and help they possibly can, they've been through hell. May they find some happiness while these two rot.",
                "And then they tried to blame the real estate agent for not finding them a house secluded enough.\n\nHow can people be so evil.",
                ">\"May God have mercy on your souls, because this court will not,” Circuit Court Judge Mary Claire Akers said...\n\nThat is a badass line.",
                "Meanwhile my wife and I can't adopt a kid because I'm a contractor and my job \"isn't stable enough\".\n\nFuck this timeline.",
                "How many times must I ask WTF is wrong with people? How did this world just produce so many pieces of shit. Sigh.",
                "Meanwhile in pennsylvania... Two judges ran a scheme called Kids for Cash. They sentenced children, as young as eight, to for-profit prisons. For millions in kickbacks from the prisons. Crimes such as jaywalking, truancy, and petty theft. 2300 children. The judges went to jail. Briefly. They were disgracefully pardoned and are currently out enjoying their freedoms. Two tier justice.",
                "Please say 400 years....it'd be so...  appropriate",
                "Every time I see people who abuse children and teens in their care and someone chides me about doing foster care when I retire \"Are you SURE YOU could handle being a foster mom?\" \n\nAnd I think \"At least I'm not planning to abuse them as SLAVES and at worst mayne build them a savings account, feed and clothe them, tutor them, then help them go to college or join the military at 18?\"",
                "*The oldest child told Whitefeather and Lantz in an impact statement that they were “monsters,” the news station reported.*\n\n*“I will be something amazing,” another child said. “I will be strong and beautiful. You will always be exactly what you are — horrible.”*\n\nI hope these children can heal and thrive. The absolute ghouls of humans (the parents) to even think of this as a valid idea.",
                "Sounds like they need to arrest the friend whose house the 5th kid was staying at, too."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Egypt makes new proposal to restore Gaza truce as Israeli strikes kill 65",
            "external_url": "https://www.reuters.com/world/middle-east/israeli-strikes-across-gaza-kills-21-people-health-authorities-say-2025-03-24/",
            "upvotes": 4,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Any \"deal\" that leaves hamas in power in gaza, is an absolute betrayal and abandonment of every last Palestinians that has died in this conflict \n\nHamas hates Palestinians as much as Israelis, because a Palestinian state stands in the way of their Islamic theocracy as much as Israel does."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Man drives into protesters outside Tesla dealership in Palm Beach",
            "external_url": "https://www.nbcmiami.com/news/business/man-drives-car-into-protesters-outside-a-tesla-dealership-in-palm-beach-county/3574124/",
            "upvotes": 1608,
            "date": "03/24/2025",
            "thumbnail": "https://media.nbcmiami.com/2024/04/GettyImages-2148753423.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "How much do you want to be he's not going to get a terrorism charge",
                "Protesters will probably be charged under a new interpretation of the stand your ground law because of how dumb this time line is.",
                "Setting inanimate objects on fire.\n\nMAGA: Terrorism!\n\nLiterally driving a car on a sidewalk with intent to hit people.\n\nMAGA: ...",
                "If there was any doubt, he's also MAGA (or at least shares the name with one). Internet archive captured from 2020: https://web.archive.org/web/20201001033554/https://www.trumpettesusa.com/andrew-dutil-trumpster/         \n           \nAndrew Dutil is a domestic terrorist (allegedly)",
                "Imagine your ego is so fragile that you get offended because people are protesting a ketamine addicted idiot that you try to kill them. ",
                "Let me guess...This TRUE PATRIOT will get an ovation from the fascists, not a terrorism charge.",
                "Imagine the right wing freak out if someone had driven into the maga crowd as they were trying to break until the capitol.",
                "*republican domestic terrorist* drives into protesters.",
                "Just another day another American domestic terrorist incident 👍🏽",
                "\"Some very fine people on both sides.\""
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Bumble Bee sued by deep-sea crew who say they were forced into ‘fishing boat slavery’",
            "external_url": "https://www.cnn.com/2025/03/21/business/bumble-bee-forced-labor-fishing-lawsuit-intl-hnk/index.html",
            "upvotes": 1291,
            "date": "03/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/greenpeace-2.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> Last year, Bumble Bee agreed to remove claims of a “fair and safe supply chain” and “fair and responsible working conditions” from its website, social media and other advertising as part of a settlement with Global Labor Justice-International Labor Rights Forum. \n\n\"Oh my god, he admit it!\"",
                "Sadly, [this isn't new](https://www.npr.org/2016/09/13/493801034/ap-report-exposes-slave-like-conditions-on-hawaii-fishing-fleets). The US [fought a war](https://www.archives.gov/publications/prologue/2012/summer/1812-impressment.html) over it as a matter of fact.",
                "Yikes. It’s dolphin safe but not fisherman safe. ",
                "I remember reading how bad it was in shrimp fishing side but its kinda obvious its more wide spread in fishing industry.\n\nOrganised crime is deep in agriculture and fishing and people with debts or just trafficked get caught up in it. Larger companies dont care or turned blind eye to their suppliers or where they get their catch. The scale of demand makes it easier too. If theres money to be made it’s corrupt easily with no oversight\n\nEvery country is one civil war or collapse away to having its population picked off by slavers when fleeing borders",
                "Yeah the huge industrial scale of slavery in the global fishing industry, the conditions that the men are kept in, and the sickeningly high mortality rate have been known for a long time. The problem is getting anyone to care, because they're men, and because they're not white.",
                "But line on index funds must go up.",
                "I thought they meant Bumble the dating app and was confused thinking they must have branched out to fishing slavery as well.",
                "Considering how much of the world fishing trade is owned and operated by moonies, I'm not surprised"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Russia-Ukraine war: Russian missile hits Sumy children's hospital, Kyiv says, as talks on possible truce continue",
            "external_url": "https://www.bbc.co.uk/news/live/cq6y3my01ndt",
            "upvotes": 912,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a320/live/71f44d10-08c9-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "Talking of possible truce and blowing up a hospital are two completely different things",
                "Trump literally gave them the coordinates."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Former Utah Rep. Mia Love, the first Black Republican woman elected to the US House, has died",
            "external_url": "https://apnews.com/article/mia-love-congress-black-republican-died-440edac7923942e9329e0224a3d053c1",
            "upvotes": 46,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I'm impressed Utah has ever had a black representative tbh. Looking at the census, Utah is only 1% black."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Man drives car into protesters outside a Tesla dealership, nobody hurt, sheriff says",
            "external_url": "https://apnews.com/article/musk-doge-tesla-trump-protest-car-9c93cf15d863359730298f2729319810",
            "upvotes": 139,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Were they arrested, charged with terrorism and sent to El Salvador?",
                "Is this the same guy? Lol\n\nhttps://www.trumpettesusa.com/andrew-dutil-trumpster/",
                "> The protest on Saturday was interrupted when Andrew Dutil drove his vehicle onto the sidewalk full of protesters at a slow speed, forcing people to scramble out of the way to avoid the being hit, according to the Palm Beach County Sheriff’s Office.\n\n> Dutil was arrested and faces an assault charge, according to court records. An attorney who could speak on Dutil’s behalf wasn’t immediately listed in court records.\n\nBefore I read the article, I was hoping it was something like a Tesla on autonomous mode slow-rolled through a crowd of protesters, but that was not the case. Still, how is the guy facing only one assault charge and not one for every pedestrian that had to move?",
                "That *sick terrorist thug* needs to be sent to prison in El Salvador.",
                "I have to assume he wasn't driving a Tesla because otherwise it would have caught on fire and locked him in.",
                "Now that was a hate crime.",
                "Guys, this is definitely not terrorism, but lighting a car on fire definitely is ok. Just trust me, it makes sense, I'm the government.",
                "Trump will make him the next transportation secretary"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "23andMe files for bankruptcy protection",
            "external_url": "https://www.bbc.com/news/articles/c9q4r9xy9wro",
            "upvotes": 96,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b2ce/live/c88ca8f0-0876-11f0-ae03-eb54c26d2690.jpg",
            "top_comments": [
                "Well, here we go. Time to sell your genetic data to the highest bidder.",
                "Yup. That's why I haven't suggested anyone do a DNA test through them in a while. If anyone is interested in doing a DNA test - only do Ancestry.com. Then you can port your raw data to FamilyTreeDNA, MyHeritage, and GEDMatch.\n\n\nAncestry's the most stable of the big four (well, big three, now) DTC DNA testing companies.",
                "DNA up for sale ya'll",
                "I won't miss them.  I tried to get my DNA done by them years ago.  After two tries of doing the saliva thing they couldn't find any DNA, said \"it happens\" and threatened to sue me if I tried it again.",
                "California AG says should think about deleting your account or data if a 24andMe customer.\n\nhttps://www.aol.com/23andme-users-told-consider-deleting-112656399.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuYmluZy5jb20v&guce_referrer_sig=AQAAAD_t7yQ9cHXfiRNpV-5J3hvLBWBPcKbVvc0k8X9kXtw_WT9CysKCxX6W1Bpn26DdVmV1-yx3XzOQdTYzXrSeINFoU0dwKZaCZPGlgIH45CRnNCLnxOX9XrKrPb_1L_f_-BG638jDxB-paiV2l73Wj4jSapK2ANYJiKU5T8tT3GgR\n\nCalifornia privacy rules a little different than other states. One can delete their account or data but what if it's already been sold or transferred?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Three men found guilty of plotting to murder £54m Securitas robber Paul Allen",
            "external_url": "https://news.sky.com/story/three-guilty-of-plot-to-murder-54m-securitas-heist-gang-member-13330360",
            "upvotes": 232,
            "date": "03/24/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-paul-allen-securitas_6858758.jpg?20250316161011",
            "top_comments": [
                "Let’s see Paul Allen’s card",
                "These all read like a movie plot",
                "Try getting a reservation at Dorsia now you stupid fucking bastard",
                "But I had dinner with Paul Allen in London.",
                "Does this Paul Allen like Huey Lewis and The News?",
                "Try getting a reservation at Dorsia now you stupid fucking bastards!",
                "Linen textured business cards cited as motive for hit.",
                "I came to see if people were referencing the movie. Reddit does not disappoint.",
                "You like huey Lewis and the news?",
                "People need to lighten up. Every single comment referencing “the movie” is getting downvoted. It’s low hanging fruit but damn the name is a funny coincidence. Despite this subs popular opinion, it is actually possible to find humor in something without approving of the source of the humor (planned attempted murder)"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Andrew and Tristan Tate make police appearance in Romania",
            "external_url": "https://www.bbc.co.uk/news/articles/c62xky7rn75o",
            "upvotes": 675,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8cc2/live/25752540-089c-11f0-97d3-37df2b293ed1.jpg",
            "top_comments": [
                "“I am one of the most important people on the planet.”\n\nMm.",
                "Life in prison is too good for them.",
                "Andrew Tate:  One of the top 5 reasons for vaginal dryness.",
                "There’s no way, with a face like that, that Tate doesn’t love to be pissed on. ",
                "Hopefully Romania will either sell these criminals to El-Salvador's prison system like the US now does with people ICE deports, or they'll send them to Guantanamo Bay like the US does.\n\nRomania shouldn't keep sickos like this in their proud country.",
                "Classic narcissist like Trump. Both spouting copious amounts of rapid fire bullshit that makes it near impossible to refute or question, both utterly convinced of their own greatness. Both pathetic little man babies.",
                "They're always so pissy. All these two do is whine about everything.",
                "Future Trump diplomats",
                "Criminals often use notoriety as cover and that's what is happening here.",
                "Can someone explain how they could be under investigation for this long without any formal charges?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Woman says United Airlines crew tried to make her remove son's ventilator",
            "external_url": "https://www.nbcnews.com/news/us-news/woman-united-airlines-crew-tried-make-remove-sons-ventilator-rcna197695",
            "upvotes": 6025,
            "date": "03/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-01/250108-united-airlines-ch-1424-5c7329.jpg",
            "top_comments": [
                "> United said it has contacted Sotomayor \"to address her concerns and apologized for any frustration she may have experienced.\" The airline did not provide further details.\n\n\n> Sotomayor told NBC...the airline’s apology “was not sincere.”\n\n\nObviously, because that wasn't a real apology.  \"I'm sorry you felt bad\" is not an acknowledgement of any wrongdoing.  \n\n\nThat said, they have to know they are toast if they are sued over this so maybe not admitting wrongdoing is part of their litigation damage control.  She even went the extra mile \"she shared the documentation with the airline before the trip and that the airline cleared her son's medical equipment with no problem.\"  Combine that with the flight attendants providing B.S. medical advice that the son would \"be OK until we're in the air at a high enough altitude.\"  This whole incident stinks.",
                "United Airlines 🤜🤛 United Healthcare\n\n\"One way or another that two-year old has to go.\"",
                "This is actually nuts. The whole plane crew working together really trying to kill that kid",
                "Ma'am, he'll need that to live.",
                "My baseline for United customer service is \"better or worse than beating up a doctor and dragging him off the plane?\"",
                "Sounds like the flight attendants need to attend a little training course.",
                "Wow. It’s a trach tube not an earring. Thank God the mom stuck to her documentation and did not take away her son’s lifeline until they got to cruising altitude.",
                "It’s not even remotely the same, but when our son was two - we were taking him on a flight in his airline approved car seat. \n\nThe flight attendant demanded we remove him from the car seat before take off. We argued it was literally the safest place for him and provided the documents that it was approved - and she still threatened to kick us off.\n\nIt’s like these flight attendants are being trained to be the most self righteous cunts possible.",
                "So many of these crazy stories come from United Airlines",
                "I’m just thinking about that poor child just trying to survive the flight and the audacity of an airline attendant to suggest he would be ok without oxygen is insane. Hopefully she makes millions in her lawsuit and have plenty of funds to take care of herself and her child."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Russia-Ukraine war: Russian missile hits Sumy children's hospital, Kyiv says, as talks on possible truce continue",
            "external_url": "https://www.bbc.co.uk/news/live/cq6y3my01ndt",
            "upvotes": 911,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a320/live/71f44d10-08c9-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "Talking of possible truce and blowing up a hospital are two completely different things",
                "Trump literally gave them the coordinates."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Bumble Bee sued by deep-sea crew who say they were forced into ‘fishing boat slavery’",
            "external_url": "https://www.cnn.com/2025/03/21/business/bumble-bee-forced-labor-fishing-lawsuit-intl-hnk/index.html",
            "upvotes": 1291,
            "date": "03/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/greenpeace-2.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> Last year, Bumble Bee agreed to remove claims of a “fair and safe supply chain” and “fair and responsible working conditions” from its website, social media and other advertising as part of a settlement with Global Labor Justice-International Labor Rights Forum. \n\n\"Oh my god, he admit it!\"",
                "Sadly, [this isn't new](https://www.npr.org/2016/09/13/493801034/ap-report-exposes-slave-like-conditions-on-hawaii-fishing-fleets). The US [fought a war](https://www.archives.gov/publications/prologue/2012/summer/1812-impressment.html) over it as a matter of fact.",
                "Yikes. It’s dolphin safe but not fisherman safe. ",
                "I remember reading how bad it was in shrimp fishing side but its kinda obvious its more wide spread in fishing industry.\n\nOrganised crime is deep in agriculture and fishing and people with debts or just trafficked get caught up in it. Larger companies dont care or turned blind eye to their suppliers or where they get their catch. The scale of demand makes it easier too. If theres money to be made it’s corrupt easily with no oversight\n\nEvery country is one civil war or collapse away to having its population picked off by slavers when fleeing borders",
                "Yeah the huge industrial scale of slavery in the global fishing industry, the conditions that the men are kept in, and the sickeningly high mortality rate have been known for a long time. The problem is getting anyone to care, because they're men, and because they're not white.",
                "But line on index funds must go up.",
                "I thought they meant Bumble the dating app and was confused thinking they must have branched out to fishing slavery as well.",
                "Considering how much of the world fishing trade is owned and operated by moonies, I'm not surprised"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Man drives into protesters outside Tesla dealership in Palm Beach",
            "external_url": "https://www.nbcmiami.com/news/business/man-drives-car-into-protesters-outside-a-tesla-dealership-in-palm-beach-county/3574124/",
            "upvotes": 1609,
            "date": "03/24/2025",
            "thumbnail": "https://media.nbcmiami.com/2024/04/GettyImages-2148753423.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "How much do you want to be he's not going to get a terrorism charge",
                "Protesters will probably be charged under a new interpretation of the stand your ground law because of how dumb this time line is.",
                "Setting inanimate objects on fire.\n\nMAGA: Terrorism!\n\nLiterally driving a car on a sidewalk with intent to hit people.\n\nMAGA: ...",
                "If there was any doubt, he's also MAGA (or at least shares the name with one). Internet archive captured from 2020: https://web.archive.org/web/20201001033554/https://www.trumpettesusa.com/andrew-dutil-trumpster/         \n           \nAndrew Dutil is a domestic terrorist (allegedly)",
                "Imagine your ego is so fragile that you get offended because people are protesting a ketamine addicted idiot that you try to kill them. ",
                "Let me guess...This TRUE PATRIOT will get an ovation from the fascists, not a terrorism charge.",
                "Imagine the right wing freak out if someone had driven into the maga crowd as they were trying to break until the capitol.",
                "*republican domestic terrorist* drives into protesters.",
                "Just another day another American domestic terrorist incident 👍🏽",
                "\"Some very fine people on both sides.\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Turkey announces 1,133 arrests have been made in relation to protests.",
            "external_url": "https://www.bbc.co.uk/news/live/cq6yde479gdt?post=asset%3Ae185b269-c225-4fbc-802f-6746e2130039#post",
            "upvotes": 849,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0892/live/60fd2460-08b9-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "How long until these headlines are about USA?",
                "Is it coup season in Turkey already?",
                "But they gave us eggs! Can't be that bad /s",
                "Shall we… applaud? 👏\n\nOk that’s enough\n\nEdit: it was one Applaus for the government with an /s… not as obvious as I thought."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Woman says United Airlines crew tried to make her remove son's ventilator",
            "external_url": "https://www.nbcnews.com/news/us-news/woman-united-airlines-crew-tried-make-remove-sons-ventilator-rcna197695",
            "upvotes": 6013,
            "date": "03/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-01/250108-united-airlines-ch-1424-5c7329.jpg",
            "top_comments": [
                "> United said it has contacted Sotomayor \"to address her concerns and apologized for any frustration she may have experienced.\" The airline did not provide further details.\n\n\n> Sotomayor told NBC...the airline’s apology “was not sincere.”\n\n\nObviously, because that wasn't a real apology.  \"I'm sorry you felt bad\" is not an acknowledgement of any wrongdoing.  \n\n\nThat said, they have to know they are toast if they are sued over this so maybe not admitting wrongdoing is part of their litigation damage control.  She even went the extra mile \"she shared the documentation with the airline before the trip and that the airline cleared her son's medical equipment with no problem.\"  Combine that with the flight attendants providing B.S. medical advice that the son would \"be OK until we're in the air at a high enough altitude.\"  This whole incident stinks.",
                "United Airlines 🤜🤛 United Healthcare\n\n\"One way or another that two-year old has to go.\"",
                "This is actually nuts. The whole plane crew working together really trying to kill that kid",
                "Ma'am, he'll need that to live.",
                "My baseline for United customer service is \"better or worse than beating up a doctor and dragging him off the plane?\"",
                "Sounds like the flight attendants need to attend a little training course.",
                "Wow. It’s a trach tube not an earring. Thank God the mom stuck to her documentation and did not take away her son’s lifeline until they got to cruising altitude.",
                "It’s not even remotely the same, but when our son was two - we were taking him on a flight in his airline approved car seat. \n\nThe flight attendant demanded we remove him from the car seat before take off. We argued it was literally the safest place for him and provided the documents that it was approved - and she still threatened to kick us off.\n\nIt’s like these flight attendants are being trained to be the most self righteous cunts possible.",
                "So many of these crazy stories come from United Airlines",
                "I’m just thinking about that poor child just trying to survive the flight and the audacity of an airline attendant to suggest he would be ok without oxygen is insane. Hopefully she makes millions in her lawsuit and have plenty of funds to take care of herself and her child."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Andrew and Tristan Tate make police appearance in Romania",
            "external_url": "https://www.bbc.co.uk/news/articles/c62xky7rn75o",
            "upvotes": 678,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8cc2/live/25752540-089c-11f0-97d3-37df2b293ed1.jpg",
            "top_comments": [
                "“I am one of the most important people on the planet.”\n\nMm.",
                "Life in prison is too good for them.",
                "Andrew Tate:  One of the top 5 reasons for vaginal dryness.",
                "There’s no way, with a face like that, that Tate doesn’t love to be pissed on. ",
                "Hopefully Romania will either sell these criminals to El-Salvador's prison system like the US now does with people ICE deports, or they'll send them to Guantanamo Bay like the US does.\n\nRomania shouldn't keep sickos like this in their proud country.",
                "Classic narcissist like Trump. Both spouting copious amounts of rapid fire bullshit that makes it near impossible to refute or question, both utterly convinced of their own greatness. Both pathetic little man babies.",
                "They're always so pissy. All these two do is whine about everything.",
                "Future Trump diplomats",
                "Criminals often use notoriety as cover and that's what is happening here.",
                "Can someone explain how they could be under investigation for this long without any formal charges?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Three men found guilty of plotting to murder £54m Securitas robber Paul Allen",
            "external_url": "https://news.sky.com/story/three-guilty-of-plot-to-murder-54m-securitas-heist-gang-member-13330360",
            "upvotes": 235,
            "date": "03/24/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-paul-allen-securitas_6858758.jpg?20250316161011",
            "top_comments": [
                "Let’s see Paul Allen’s card",
                "These all read like a movie plot",
                "Try getting a reservation at Dorsia now you stupid fucking bastard",
                "But I had dinner with Paul Allen in London.",
                "Does this Paul Allen like Huey Lewis and The News?",
                "Try getting a reservation at Dorsia now you stupid fucking bastards!",
                "Linen textured business cards cited as motive for hit.",
                "I came to see if people were referencing the movie. Reddit does not disappoint.",
                "You like huey Lewis and the news?",
                "People need to lighten up. Every single comment referencing “the movie” is getting downvoted. It’s low hanging fruit but damn the name is a funny coincidence. Despite this subs popular opinion, it is actually possible to find humor in something without approving of the source of the humor (planned attempted murder)"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "South Korean court overturns impeachment of Prime Minister Han, reinstating him as acting president",
            "external_url": "https://apnews.com/article/south-korea-impeachment-han-ducksoo-20daed0fb3c90c02ca229c977d230b06",
            "upvotes": 5181,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This guy isn't Yoon (The president who started the Martial Law Order), he is up for sentencing next. If he doesn't get impeached, then shit will go down.",
                "Context on the quorum bit, since AP doesn’t provide it - Korea’s national assembly has 300 seats. A simple majority is enough to impeach most officials, but a 2/3 majority is required to impeach the president. It was (and maybe still is) an open question what the requirement was to impeach an acting president - 151 because he is the prime minister, or 200 because he is (acting) president? Apparently some of the justices think it’s the latter, (edit) but it seems like the majority ruled that it’s 151.\n\nThis feels like it was the weakest of the cases, for what it’s worth. He was consistently saying he was against the martial law, and it seems like they failed to prove he was actually involved with it.",
                ">On Monday, seven of the court’s eight justices overturned or dismissed Han’s impeachment. They ruled the accusations against him weren’t against the law or weren’t serious enough to remove him from office or his impeachment motion didn’t even meet a required quorum when it passed through the assembly.\n\nNot having a quorum seems sketchy. The other parts of South Korean law, I can't comment on.",
                "The amount of people who are r/confidentlyincorrect here is astonishing...",
                "If you didn't read the article before commenting, you're part of the problem.",
                "Not the guy most people are assuming, but very interesting that the court can overturn an impeachment.",
                "Wow the world is going crazy",
                "[removed]",
                "So I don't know a l9t about the court system in Korea. Is this outrageous, or is this something that sometimes happens?",
                "Impeachment of Han was kinda sketchy so this isn't surprising at all."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "IRS braces for $500bn drop in revenue as taxpayers skip filings in wake of DOGE cuts",
            "external_url": "https://www.independent.co.uk/news/world/americas/us-politics/irs-doge-cuts-tax-filing-b2719911.html",
            "upvotes": 23530,
            "date": "03/23/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/20/20/26/Pictures-of-the-Week-Global-Photo-Gallery-e8cfpnw5.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "Simple tax returns are audited by computer.  It's the difficult returns that need analysis.  The rich will get away with more as intended.",
                "For anyone considering this - just be aware that the fines for not filing are quite high: “The failure-to-file penalty is usually 5% of the tax owed for each month your return is overdue, up to 25% of the bill.” ([IRS policy here](https://www.irs.gov/payments/failure-to-file-penalty))\n\nI’m not sure if they’ll have the staff to go after folks later but tax issues are known to pop up and bite you many years later. You may not hear anything for a decade and then suddenly get a bill.",
                "We saved $50 million. It just cost $1 trillion.",
                "Tax accountant here - This is not for people who have simple returns with a W-2 or small Schedule C business.  This is for the complicated filers.  People using business loans from their pass-through S-Corp instead of having proper Officer wages.  People claiming losses without proper basis tracking.  People using shell companies to hide or officiate income sources.  People claiming improper foreign tax credits.\n\nNot your average Joe and Jane.  Enforcement is already at record lows for audits.  Now people will push harder and less ethical accountants will try to save their clients more money.  A lot of my industry revolves around people doing grey-area things getting their hands slapped every so often to remind them \"don't do that\".  As those stop, the more people will cheat and trim the edges.",
                ">\"New hires in taxpayer services and enforcement divisions have been targeted **and the agency has dropped investigations of high-value corporations and taxpayers**\"\n\nThat's the highlight of the article, That's the sole reason that people are angry and are writing about not paying taxes, not cause doge is 'cutting IRS jobs' or any of that other shit, Poor people are saying \"If those rich bastards ain't paying then neither am i\" and agree with the sentiment as a threat, obviously neglecting your taxes is not advisable in the long run, but do people have any other means to voice their opinions at the moment?",
                "Republicans would be happy to starve to federal government and use that as an excuse to cut programs and services",
                "I feel like an idiot paying for estimated taxes",
                "So let's see\n\nWe have citizens saying we shouldn't pay taxes, we won't get caught. We have states saying we should withhold fed taxes if trump plays games with funding, especially in giver states. We have federal officials ignoring federal judges rulings because they thought they could ignore a verbal judgement (latest excuse) and illegally deporting people. We are dismantling the department of education. The president did a car advertisement for a ketamine addict at the white house. All of our allies are breaking off trade, opting for non american weapons and tech, and are issuing travel warnings to dissuade tourists from going to the US.\n\nIn short we have a major breakdown in both rule of law as well as respect for the federal government and democracy.\n\nIt has only been 60 days since Jan 20th.",
                "Do they even have the resources to go after non-payers?",
                "I’m willing to bet dollars to donuts Wonderboy won’t be paying his fair share for the next four years and beyond"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Couple sentenced to hundreds of years in prison for forcing adopted Black children to work as 'slaves'",
            "external_url": "https://www.nbcnews.com/news/us-news/couple-sentenced-hundreds-years-forcing-black-children-work-slaves-rcna197533",
            "upvotes": 28006,
            "date": "03/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250319-west-virginia-abuse-mb-0743-4120e9.jpg",
            "top_comments": [
                "> Whitefeather apologized to the children during the sentencing.\n\"I just want the court to know that I have made mistakes I am very sorry for that and I love my children and I have never, ever, done anything to my ... children to harm them intentionally,” she said, according to WSAZ. “Children, I do love you.”\n\nImagine forcing children into slavery, locking them in sheds, and abusing them horribly. Keeping them dirty, cold, and hungry. Then trying to tell your victims you didn't hurt them, and you love them. Lying and manipulation from an absolute monster. I hope those kids get the best support and help they possibly can, they've been through hell. May they find some happiness while these two rot.",
                "And then they tried to blame the real estate agent for not finding them a house secluded enough.\n\nHow can people be so evil.",
                ">\"May God have mercy on your souls, because this court will not,” Circuit Court Judge Mary Claire Akers said...\n\nThat is a badass line.",
                "Meanwhile my wife and I can't adopt a kid because I'm a contractor and my job \"isn't stable enough\".\n\nFuck this timeline.",
                "How many times must I ask WTF is wrong with people? How did this world just produce so many pieces of shit. Sigh.",
                "Meanwhile in pennsylvania... Two judges ran a scheme called Kids for Cash. They sentenced children, as young as eight, to for-profit prisons. For millions in kickbacks from the prisons. Crimes such as jaywalking, truancy, and petty theft. 2300 children. The judges went to jail. Briefly. They were disgracefully pardoned and are currently out enjoying their freedoms. Two tier justice.",
                "Please say 400 years....it'd be so...  appropriate",
                "Every time I see people who abuse children and teens in their care and someone chides me about doing foster care when I retire \"Are you SURE YOU could handle being a foster mom?\" \n\nAnd I think \"At least I'm not planning to abuse them as SLAVES and at worst mayne build them a savings account, feed and clothe them, tutor them, then help them go to college or join the military at 18?\"",
                "*The oldest child told Whitefeather and Lantz in an impact statement that they were “monsters,” the news station reported.*\n\n*“I will be something amazing,” another child said. “I will be strong and beautiful. You will always be exactly what you are — horrible.”*\n\nI hope these children can heal and thrive. The absolute ghouls of humans (the parents) to even think of this as a valid idea.",
                "Sounds like they need to arrest the friend whose house the 5th kid was staying at, too."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "03/24/2025 16:11:40 UTC"
}