{
    "posts": [
        {
            "category": "HOT",
            "title": "Federal judge rules return of Maryland man mistakenly deported to El Salvador prison",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/04/maryland-deported-el-salvador-kilmar-abrego-garcia",
            "upvotes": 24818,
            "date": "04/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/c20b3ba9e18add1958ec77d0ca363335b3355628/0_100_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=07a4e4739e53960824a55ef20b2d1e0b",
            "top_comments": [
                "if we lived in a sane country, he and his family would be able to sue for tens of millions. the entire saga is fucking ridiculous. \n\n\"we know we fucked up, but it would be against our shit plan to undo it so cope ig\"",
                "It's not over till he's home.",
                "Interesting how the Trump admin indicates it can do nothing about retrieving this man from El Salvador with whom it has very friendly relations, yet it was able to get Mexico to bring back the 2 Caucasian people who were in jail for defrauding a timeshare company in Mexico after 2 weeks of negotiating (as they were apparently guilty of the fraud).\n\nSo all that is really at play here is that the Trump admin does not want to bring this person back, because they are not white.  It is as simple as that.",
                "an innocent man just can be held in jail?  What kind of crazy idea is that ... oh due process?  human rights?...huh I am pretty sure the Republican party gave those up",
                "Republicans would call this judicial overreach",
                "And for every story like this we see, you just *know* there's a hundred cataclysmic fuck-ups that we're not seeing. \n\nLast time this ape was in charge his equivocating gibberish and asinine policies exacerbated a deadly pandemic [leading to many, many unnecessary COVID deaths] (https://www.businessinsider.com/analysis-trump-covid-19-response-40-percent-us-deaths-avoidable-2021-2?op=1) and [dead Americans in general](https://www.forbes.com/sites/tommybeer/2021/02/11/trumps-policies-resulted-in-the-unnecessary-deaths-of-hundreds-of-thousands-of-americans-lancet-report/) but none of this ever gets brought up and he surely sleeps like a baby.\n\nI shudder to think of what we don't know.",
                "The truth is this Nazi admin doesn't want this man back because he'll be able to speak on how terrible and inhumane the treatment is at this death camp. They could get him back no problem, its that it would not bode well for them if they did.",
                "How sad that it had to go to a judge and they refused to correct their tragic mistake in the first place.",
                "I hope he's returned swiftly and safely, but I doubt part of disappearing people is keeping track of where they wind up at the other end. I've never worked as a human trafficker, so idk.",
                "They should all be returned and if there was evidence of crimes committed in the US. Put them on trial in the US. Otherwise free them. No one, not even criminals should be sent overseas to a death camp of a prison"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "U.S. Peace Corps says Musk's DOGE has arrived at its HQ",
            "external_url": "https://www.reuters.com/world/us/us-peace-corps-says-musks-cost-cutting-team-has-arrived-its-hq-2025-04-04/",
            "upvotes": 11372,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This administration is amplifying everything people dislike about the US while simultaneously destroying everything people do like about the US.",
                "So, what exactly happens if an agency simply doesn’t cooperate with DOGE?",
                "I can't imagine an agency with less fat than the Peace Corps; the stipends are miniscule.",
                "The Musk/Trump administration doesn't understand the concept of 'soft power'. Furthermore, they're entirely unwilling to listen to the argument for it. America's greatness (such that it ever existed) comes in large part to it's effective use of soft power. The Marshall Plan, the Peace Corps and NASA all have a roll in advancing America's interest abroad. Dollar-for-dollar these programs grew the brand of America more than it's military or direct diplomacy ever could on its own. Wait two years to see.",
                "That is easily the dumbest hat I've seen in quite a while and we've all seen a LOT of MAGA hats.",
                "The grim reaper has arrived. Aside from Trump , Netanyahu and Putin,  Elon is the most unpopular person in the world today.",
                "It's painfully obvious that the whole administration has bought into some absolute bullshit lie from Elon Musk about his, garbage tier, Grok AI being ready to take over most of the federal government's functions. Elon is a great con man when dealing with people who understand tech. When he starts selling shit to the types of people in the Trump admin it is like shooting fish in a barrel. This whole experiment is going to destroy the US standing in the world, it's economy, and the US tech industry. We are getting Xed at a national scale. If you voted for this you are an absolute fucking dipshit.",
                "Have you noticed that DOGE does the worst things on Friday afternoons? DOGE fears accountability",
                "You have to be truly evil and dead inside to dismantle the Peace Corps. There’s a special place in hell reserved for Elon Musk.",
                "It’s like the bureaucracy version of the fucking mongols arriving at your city gates"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Woman, 20, sentenced for false rape report that jailed innocent man for a month",
            "external_url": "https://local12.com/news/nation-world/anjela-borisova-urumova-woman-sentenced-for-false-rape-report-that-jailed-innocent-man-month-sexual-violence-bucks-county-correctional-facility-worst-crimes-criminal-activity-claims-evaluation-falsification-physical-evidence-mental-health-evaluation",
            "upvotes": 11074,
            "date": "04/04/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/737/986/1x0/90/ff255216-5015-45e2-91a8-1ec3cf6cfad2-SuspectFinal.JPG",
            "top_comments": [
                "Feel so bad for this guy, anyone who has tried to get a search result taken off of google knows how impossible it is through their bots. On top of the false charge he will have to explain this surely emotionally draining charge to any employer or future girlfriend",
                "I was a victim of a girl who raped me and stalked me.  I avoided her at all costs, and she eventually moved on.  I suspect she had the same sort of relationship with the next guy she started dating - because I know she was very upset with him.  showed up at a bar, and acted all drunk, and brought him out to her car, where she had sex with him.  he went back into the bar and she ran in and said he raped her.  \n\nThe guy was taken away in handcuffs, and couldn't believe what was happening to him.  She eventually came clean, but the damage was done - the dude had mugshots, and was arrested in the middle of a crowded bar.  she didn't get so much as a slap on the wrist.  From what I understand, the guy was just so happy to have the charges dropped against him.  But he should have pressed charges against her for the damage she did to him.  \n\nThis was about 20 years ago that this happened.  and I still worry about how I was just a few months away from being 'the guy' in this story.",
                "Many years ago (I was around 17) I was accused of assault and rape by a woman I had never met, never seen before. I was arrested and detained and sent to Juvenile Detention. My parents lawyered up, Bailed me out 3 days or so later. It ended when her story kept changing and I had no wounds on my hands or face the night I was booked.  Can go much deeper in to the story but I won’t bore y’all. It was scary. She knew my address, phone number (land line back then) my vehicle, my overall everything. I was at my GF’s house after school, did some day boozing, walked 2 blocks home, and went to bed. Then I was “woken up” about 4 hours later. Lots of people I’ve told the story too have said “I’ve had handled it this way”. But I was woken up from a dead sleep, completely confused, 3 cops screaming at me, my dad freaking out, my mom in hysterics. \n\nThere were no consequences for the accuser. I moved across country for school and that was it. That was around ‘89 or ‘90. Fucking sucked.",
                "I'm sure the 41 year old guy who faced a month in jail with his name and picture plastered over press releases will never face any ongoing discrimination when his name comes up in job searches",
                "I'm actually surprised she went to jail...",
                "I used to be a college professor and told freshmen over and over:  Rape can happen to you; false rape allegations can happen to you. Never put yourself in a vulnerable position.  If you are drinking, go with friends and STAY with friends.\n\nThat isn’t a surefire preventative but it helps.",
                "My question is why did it take a month to free him. I went and found the reporting of his original arrest\n\nhttps://www.cbsnews.com/philadelphia/news/daniel-pierson-arrest-attempted-rape-kidnapping-middletown-township-grocery-store-parking-lot/\n\n>\"Pierson is known to police to be a methamphetamine user,\" the release said.\n\nGuess they thought they had to add that in there. Bail was set at somewhere under a million so that is why he was in jail...",
                "She permanently victimized him by making a bogus report that he will never entirely shake the reputation of. He’ll be exiled and vilified to some degree because of this fiction she decided to spin.\n\nAnd she made it more difficult for actual victims to come forward or be believed.\n\nGlad she’s seeing some measure of justice. May all ruinous tyrants face the same.",
                "As a woman - I'm glad to see this.\n\nScumbags like her are a big reason why actual victims aren't believed. Her punishment is way too light, in my opinion, though.",
                ">  and pay $3,600 in restitution to the victim.\n\nStraight to civil court for me! I’m asking for no less than $50k, that’s assuming there are no other damages besides my time for a month."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "DACA recipient and Kansas City father of 3 deported to Mexico despite valid documentation",
            "external_url": "https://www.cbsnews.com/news/daca-recipient-kansas-city-father-deported-mexico-despite-valid-documentation/",
            "upvotes": 2226,
            "date": "04/05/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/21/135d73e3-b4d4-4af3-89c8-8922a88d6caf/thumbnail/1200x630/2190c836194bbde9541ee0a89011d5f4/gettyimages-2162517300.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Why taking the time for due process matters.  A lot.",
                "Maga is too stupid to know that you can't unmix the chocolate from the cake.\n\nSo it's just a theater of pain and humiliation for immigrants till \"The Stupidest Generation\" dies out.",
                "The objective was always cruelty.",
                "Can they even do this?",
                "Whatever your feeling on immigration is, it's insane how much DACA recipients' lives have been played with.\n\nApparently people want countries not to send their \"worst.\" Well they were/are the definition of it. They are people who were ready to better their lives thru education.\n\nBoth sides of the team sports have let them down and it has been a travesty. If you're going to invest anything into a goal, why not see the goal thru to the logical end. If you don't, what was the point of wasted resources",
                "Wow. For legal residents to be cautioned against traveling is frightening beyond belief. Pretty soon, passport holding, US born citizens, (like myself ) will be cautioned against speaking or writing comments protected by the US Constitution for fear of being sent to a re-education 'camp'.\n\nIf you think it's funny, would you have believed 5 months ago that things like this would/could happen ?\n\nThe things we hold dear and believe to be natural rights are being burned bit by bit...and it's getting hotter by the second.",
                "immigrants enrich america. if not all you got are dumb red nec…. oh i get it",
                "God I wish I was an attorney. I legit would spend the next 4 years fighting these fucking idiots in court",
                "I see nothing (says Sgt Schultz)",
                "Remember when they said it wasn't a racist thing because he was only going to go after the illegal immigrants?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Tech megacaps lose $1.8 trillion in 2 days as Trump tariffs lead Nasdaq to worst weekly drop in 5 years",
            "external_url": "https://www.cnbc.com/2025/04/04/technology-stocks-fall-for-a-second-session-led-by-tesla-and-nvidia.html",
            "upvotes": 2791,
            "date": "04/04/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108120393-1742835357354-gettyimages-2206691913-wm100366_kl5aayk2.jpeg?v=1743786921&w=1920&h=1080",
            "top_comments": [
                ">...worst weekly drop in 5 years.\n\nThe worst drop since the last time he was in office.",
                "From the article:\n\n\\- Apple has nosedived the most, shaving off more than $533 billion in market capitalization.\n\n\\- Tesla shaved off more than $89 in market cap, bringing its two-day tally to more than $139 billion\n\n\\- Meta plummeted more than $200 billion\n\n\\- [Amazon](https://www.cnbc.com/quotes/AMZN/) dropped $265 billion\n\n\\- Alphabet:  $139 billion\n\n\\- Microsoft: $165 billion\n\nThat's some unbelievable destruction of wealth!",
                "We are WINNING! THIS IS THE GREATEST WINNING. 🤡",
                "Trump Tax causing the Trump Recession",
                "Headline should say the worst weekly drop since the last time Trump was in office.",
                "You act like they aren't also buying this dip to consolidate and concentrate more wealth away from the masses.",
                "Worst drop in 5 years, wasn’t rump the president 5 years ago lmao",
                "Small price to pay to \"own the libs\"\n\nWhoever voted for this administration can hurt and hurt and continue hurting.",
                "When Biden was in office Faux News pundits all said you can tell how good a job a president is doing by reading the Stock Market. When the market under Biden was doing great Faux News barely covered the story. When Trump was inaugurated the market went up and Faux News said see how great the market is going knowing Trump is president. Now Faux News pundits are saying the market is not a good indicator on how well a president is performing. Also, not one word from Faux News on the rise in unemployment. Hypocrisy and morons are reporting on our countries free fall into the next Great Depression. Will need a new name for all those out of work people who camp out in DC, Hooverville has already been used.",
                "Three Months In $5 Trillion Destroyed.\n\nGo defensive - protect what you have left. The bottom is still ways away.\n\nAnd don't suffer quietly. Keep calling your congressmouse and ask it to do its job."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Comedian Russell Brand charged with rape",
            "external_url": "https://www.bbc.co.uk/news/articles/c0457d02e9go",
            "upvotes": 18142,
            "date": "04/04/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8110/live/58dc9480-1167-11f0-ba12-8d27eb561761.jpg",
            "top_comments": [
                "This is the least surprising news story I've seen all week.",
                "It's always the ones you most suspect",
                "Yeah that's why he became super Christian all of a sudden. He knew this was coming",
                "Some people say the worst part was the hypocrisy.\n\n\nI think it was the rape.\n\n\n/To paraphrase a real comedian ",
                "The Onion just reposted this[https://theonion.com/nation-could-have-sworn-russell-brand-was-already-convi-1850849838/](https://theonion.com/nation-could-have-sworn-russell-brand-was-already-convi-1850849838/)",
                "I read this headline and thought it was old news, honestly.\n\nWhen he started freaking out about woke people after MeToo I knew something was up with the dude",
                "Rapist Russell Brand charged with trying to be comedian",
                "Well I see someone wants to join the Trump administration",
                "Insane he made it to 2025. Him making it through the me too era is like getting an rpg past TSA in your backpack",
                "Get Him to the Greek stared Russel Brand, P Diddy and Jonah Hill."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "USA Fencing disqualifies athlete for refusing to compete against transgender woman",
            "external_url": "https://abcnews.go.com/US/usa-fencing-disqualifies-stephanie-turner-refusing-fence-transgender/story?id=120462854",
            "upvotes": 13272,
            "date": "04/04/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1ec66efa-8d15-4e68-bb23-e0a4ce5dfad3/fencer-gty-er-250403_1743708715102_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Perhaps not in an actual competition, but fencing is often coed… I’ve definitely fenced against as many women as I have men. There isn’t some radical sex based advantage in fencing the way you might argue there is in many other supports, so this is totally ridiculous.",
                "So this is what the distraction is gonna be while the economy collapses, people are pulled off the streets by masked police and flown off without trial, and our allies abandon us? This is the important shit right here, huh?",
                "> Prior to 1990, separate men’s championships were held, but since then, fencing has been a coed sport with teams having men’s and women’s squads, although some schools field only a women’s team. Fencing is a single-division sport with schools from all three NCAA divisions competing against each other.\n\nHere’s some facts for all the morons talking about the “biological advantage” men have in fencing. It’s been a coed sport at the national competition level for nearly FOURTY YEARS. This is nothing but more conservative performative outrage, and your excuses is what encourage this kind of behavior.",
                "If all fails throw in a bit of trans panic so MAGA has something to be outraged about",
                "I’m sure the comments and discourse will be very positive",
                "Journalists suck.\n\nThis article should have at a minimum explained USA fencing's policy [outlined here](https://www.usafencing.org/transgender-and-nonbinary-policy). They couldn't be bothered to even look up what the policy was apparently, or provide information around why USA fencing felt that policy was actually ok.\n\nThis article comes across as, \"Hey I'm some dude and I want to poke women with my sword.\" Not, \"I identify as a woman and I've been on HRT for 12 months and because of that have lost most of my muscle tone.\" I'd even think it was great if they explained the counterpoint as well which is that most of the physical advantage of men comes from their height which is something they gain in puberty.\n\nI know this is a challenging topic for a lot of people, but holy fuck mainstream journalism is garbage.\n\n  \nedit: This is not an endorsement of alt-media (which is nothing but a sewage plant). It's a plea for journalists to do better.",
                "I'm still on the fence about the whole thing.",
                "Name one professional fencer off the top of your head.",
                "Look, I'd like to care about the stock market, having a house, people being disappeared, but this lady didn't get to fence who she wanted!!  This is truly the crisis of our time.",
                "All these folks so worried about women's (and girl's) sports don't seem too concerned that the Department of Education is being dismantled and that the DOE oversees compliance for Title IX.  Pre-Title IX --1 in 27 girls participated in sports, now it's is 2 in 5.  If you really do care about \"protecting\" opportunities for girls and women in sports, Title IX would be your focus.  NOTE, the same pols so obsessed with trans women in sports are the same ones who'd eliminate Title IX in a heartbeat. \n\n[https://www.womenssportsfoundation.org/wp-content/uploads/2022/04/FINAL6\\_WSF-Title-IX-Infographic-2022.pdf](https://www.womenssportsfoundation.org/wp-content/uploads/2022/04/FINAL6_WSF-Title-IX-Infographic-2022.pdf)"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "Supreme Court allows Trump to freeze dozens of teacher training grants",
            "external_url": "https://www.cnn.com/2025/04/04/politics/supreme-court-trump-teacher-grants/index.html",
            "upvotes": 2641,
            "date": "04/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2205531023.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If Congress no longer controls the power of the purse, what is their Constitutional reason to even exist?",
                "You think this is bad? Just wait until they rule he can rewrite the Constitution via Executive Order.",
                "There was no textual authority for President Trump to freeze these grants. There was textual authority for President Biden to forgive student loans. But textualism only matters when it leads to the outcome this activist Court wants.",
                "Education is the enemy of authoritarianism.\n\nProve me wrong.\n\nWhat’s one of the first groups fascists and authoritarians always go after? The educated. The intelligentsia.\n\nDictators love their people dumb and emotionally-led. Easier to control, easier to manipulate.",
                "Split 5-4 decision with Roberts siding with the liberal justices.",
                "No need for them . Education department is being dismantled so no more need for teachers !",
                ">But, the court said, the Trump administration made a compelling case that it would not be able to recover any funds spent while the lower court’s order remained in place.\n\n>If the states ultimately win the case, the court said, “they can recover any wrongfully withheld funds through” further litigation.\n\nIf they bothered to explain why the states can sue to get their money but the feds *can’t,* it is not in the article.",
                "Man I got my teaching license through one of these programs. It’s pretty prohibitive to be certified in my state (you have to have a Masters degree in education). I worked in one of the poorest districts in the country for 7 years (I’m in a different district now). I felt a lot of loyalty to the school system, because they invested a lot of money into me. Even more important, these programs allow people to enter the field that might have been blocked by the economic fetters towards becoming certified, like say people of color. Which is probably why Trump wants to end them. They also cycle teachers into certifications that are hard to fill like special education and English as a New Language. I NEVER would have become a special education teacher had I not kind of had to become one. And I love special education. And god the ENL teacher shortage is already really, really, really bad.",
                "So wait, help me understand, I might be stupid. The purpose of the tariffs is to bring back manufacturing to America, which will take years. During those years, some would think it would be wise to educate & train up the future generations, correct? Based on this & the events of the past ::checks notes:: not even 3 months yet, future generations will be dumber than rocks. How are we supposed to manufacture anything?",
                "Yes, because one thing we have way too many of is teachers. /S"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "China to impose 34% retaliatory tariff on all goods imported from the U.S.",
            "external_url": "https://www.cnbc.com/2025/04/04/china-to-impose-34percent-retaliatory-tariff-on-all-goods-imported-from-the-us.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
            "upvotes": 34293,
            "date": "04/04/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/106677114-15983545702020-08-25t100023z_1719720997_rc2yki97n9wc_rtrmadp_0_usa-china-tech.jpeg?v=1692261559&w=1920&h=1080",
            "top_comments": [
                "Has any country in history ever started a trade war with the entire planet and won?",
                "Conservatives - Fall 2024 - “Eggs are too damn high.”\n\nConservatives - Apr 2025 - “New taxes on almost everything…sounds good.”",
                "China has the largest manufacturing base in the world - naïve to expect they wouldn’t hit back.",
                "So uh..... farmers fucked?",
                "aaaaand there goes the American farmer exports...",
                "What DT has done will be chronicled in history books not only for how he manipulated data to serve his interests, but also for how he influenced collective minds through falsehoods, expecting other political actors to fall into his trap. Fortunately, most of the world is no longer willing to dance to his tune or validate his tactics.",
                "The republican base will see this and believe its “growing pains”. There is no amount of pain they can suffer before it’s Trumps fault \n\nNo matter what happens in the next 4 years, it will always be Biden and the democrats fault",
                "“Things are going great!”\n\n-every Trump supporter with their head in the sand desperately trying not to believe their lying eyes. ",
                "Even if Trump reverses course and pretends he did it to get concessions, the damage is done. Much of the world is boycotting American products out of anger and it’s unlikely America will come out ahead in this trade war once it’s over.",
                "American dollar stores are going to have to become $1.34 stores."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Trump to grant TikTok another extension to avoid a U.S. ban",
            "external_url": "https://www.nbcnews.com/politics/politics-news/trump-tiktok-ban-extension-rcna199394",
            "upvotes": 2384,
            "date": "04/04/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250402-tiktok-phone-ew-531p-f41d63.jpg",
            "top_comments": [
                "I'm old enough to remember when [Trump signed an EO to ban Tiktok](https://www.npr.org/2020/08/06/900019185/trump-signs-executive-order-that-will-effectively-ban-use-of-tiktok-in-the-u-s.).",
                "Not that anyone cares about this kinda silly stuff, but the TikTok ban law doesn't actually allow him to do this.",
                "Is that actually legal? I mean it clearly doesn't matter at this point but I still have to ask the question",
                "General reminder that these \"extensions\" are just Trump pinkie promising not to charge them for violating the law.\n\nMeaning either Trump or the next US President could at any moment go \"Sucks to be you I changed my mind\" and they would be absolutely screwed.",
                "Did they agree to shove maga content on our fyp because that’s all I get now, ad naseum.",
                "The year is 2028.  Trump has decided to give TikTok another extension.",
                "This is blatantly illegal. The law allowed one extension. Jesus fucking Christ Congress do your fucking jobs",
                "This is going to be Trump 2's version of the student loan payment pause during the pandemic. He's going to kick the can down the road for as long as he can on this since it's not something he can just repeal by EO.",
                "In other words, China refused a US buyer like they said they would, so Trump turned the handle on tariffs of which China retaliated instead of bowing to Trump. Trump is now trying to buy more time to get a deal done which will not happen because China now holds a lot of soft power globally due to Trump. They are making moves because there's blood in the water all due to Trump policies.\n\nDude is the worst dealmaker ever. Worst President ever, too.",
                "It was obvious this was going to happen. Trump will (illegally!!!) delay enforcing the ban so long as TikTok bends the knee.\n\nThis is Fascism 101. The Nazis loved centralizing industries into the hands of a few key stakeholders who could be controlled by the party."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "DACA recipient and Kansas City father of 3 deported to Mexico despite valid documentation",
            "external_url": "https://www.cbsnews.com/news/daca-recipient-kansas-city-father-deported-mexico-despite-valid-documentation/",
            "upvotes": 2229,
            "date": "04/05/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/21/135d73e3-b4d4-4af3-89c8-8922a88d6caf/thumbnail/1200x630/2190c836194bbde9541ee0a89011d5f4/gettyimages-2162517300.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Why taking the time for due process matters.  A lot.",
                "Maga is too stupid to know that you can't unmix the chocolate from the cake.\n\nSo it's just a theater of pain and humiliation for immigrants till \"The Stupidest Generation\" dies out.",
                "The objective was always cruelty.",
                "Can they even do this?",
                "Whatever your feeling on immigration is, it's insane how much DACA recipients' lives have been played with.\n\nApparently people want countries not to send their \"worst.\" Well they were/are the definition of it. They are people who were ready to better their lives thru education.\n\nBoth sides of the team sports have let them down and it has been a travesty. If you're going to invest anything into a goal, why not see the goal thru to the logical end. If you don't, what was the point of wasted resources",
                "Wow. For legal residents to be cautioned against traveling is frightening beyond belief. Pretty soon, passport holding, US born citizens, (like myself ) will be cautioned against speaking or writing comments protected by the US Constitution for fear of being sent to a re-education 'camp'.\n\nIf you think it's funny, would you have believed 5 months ago that things like this would/could happen ?\n\nThe things we hold dear and believe to be natural rights are being burned bit by bit...and it's getting hotter by the second.",
                "immigrants enrich america. if not all you got are dumb red nec…. oh i get it",
                "God I wish I was an attorney. I legit would spend the next 4 years fighting these fucking idiots in court",
                "I see nothing (says Sgt Schultz)",
                "Remember when they said it wasn't a racist thing because he was only going to go after the illegal immigrants?"
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "NEW",
            "title": "Disgraced former Cardinal Theodore McCarrick has died at age 94",
            "external_url": "https://www.nbcnews.com/news/us-news/disgraced-former-cardinal-theodore-mccarrick-dead-rcna199779",
            "upvotes": 398,
            "date": "04/04/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250404-Theodore-McCarrick-ew-351p-285335.jpg",
            "top_comments": [
                "Guess the pedo is finding out if Hell exists. 👹🔱🔥",
                "🙏 start a trend start a trend",
                "Drive a stake through his heart, just to be sure.",
                "Doesn't sound like he died in prison?",
                "Good riddance. It’s times like this that I hope the hell he supposedly believed in actually exists.",
                "*Shitbag finally succumbs",
                "And the world was just a little bit better",
                "It's true:  Only the good die young.",
                "He was left on Earth for so long because the Devil didn’t want him either.",
                "I hope it was a long, slow, painful exit."
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "NEW",
            "title": "Tech megacaps lose $1.8 trillion in 2 days as Trump tariffs lead Nasdaq to worst weekly drop in 5 years",
            "external_url": "https://www.cnbc.com/2025/04/04/technology-stocks-fall-for-a-second-session-led-by-tesla-and-nvidia.html",
            "upvotes": 2791,
            "date": "04/04/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108120393-1742835357354-gettyimages-2206691913-wm100366_kl5aayk2.jpeg?v=1743786921&w=1920&h=1080",
            "top_comments": [
                ">...worst weekly drop in 5 years.\n\nThe worst drop since the last time he was in office.",
                "From the article:\n\n\\- Apple has nosedived the most, shaving off more than $533 billion in market capitalization.\n\n\\- Tesla shaved off more than $89 in market cap, bringing its two-day tally to more than $139 billion\n\n\\- Meta plummeted more than $200 billion\n\n\\- [Amazon](https://www.cnbc.com/quotes/AMZN/) dropped $265 billion\n\n\\- Alphabet:  $139 billion\n\n\\- Microsoft: $165 billion\n\nThat's some unbelievable destruction of wealth!",
                "We are WINNING! THIS IS THE GREATEST WINNING. 🤡",
                "Trump Tax causing the Trump Recession",
                "Headline should say the worst weekly drop since the last time Trump was in office.",
                "You act like they aren't also buying this dip to consolidate and concentrate more wealth away from the masses.",
                "Worst drop in 5 years, wasn’t rump the president 5 years ago lmao",
                "Small price to pay to \"own the libs\"\n\nWhoever voted for this administration can hurt and hurt and continue hurting.",
                "When Biden was in office Faux News pundits all said you can tell how good a job a president is doing by reading the Stock Market. When the market under Biden was doing great Faux News barely covered the story. When Trump was inaugurated the market went up and Faux News said see how great the market is going knowing Trump is president. Now Faux News pundits are saying the market is not a good indicator on how well a president is performing. Also, not one word from Faux News on the rise in unemployment. Hypocrisy and morons are reporting on our countries free fall into the next Great Depression. Will need a new name for all those out of work people who camp out in DC, Hooverville has already been used.",
                "Three Months In $5 Trillion Destroyed.\n\nGo defensive - protect what you have left. The bottom is still ways away.\n\nAnd don't suffer quietly. Keep calling your congressmouse and ask it to do its job."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "NEW",
            "title": "Supreme Court allows Trump to freeze dozens of teacher training grants",
            "external_url": "https://www.cnn.com/2025/04/04/politics/supreme-court-trump-teacher-grants/index.html",
            "upvotes": 2649,
            "date": "04/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2205531023.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If Congress no longer controls the power of the purse, what is their Constitutional reason to even exist?",
                "You think this is bad? Just wait until they rule he can rewrite the Constitution via Executive Order.",
                "There was no textual authority for President Trump to freeze these grants. There was textual authority for President Biden to forgive student loans. But textualism only matters when it leads to the outcome this activist Court wants.",
                "Education is the enemy of authoritarianism.\n\nProve me wrong.\n\nWhat’s one of the first groups fascists and authoritarians always go after? The educated. The intelligentsia.\n\nDictators love their people dumb and emotionally-led. Easier to control, easier to manipulate.",
                "Split 5-4 decision with Roberts siding with the liberal justices.",
                "No need for them . Education department is being dismantled so no more need for teachers !",
                ">But, the court said, the Trump administration made a compelling case that it would not be able to recover any funds spent while the lower court’s order remained in place.\n\n>If the states ultimately win the case, the court said, “they can recover any wrongfully withheld funds through” further litigation.\n\nIf they bothered to explain why the states can sue to get their money but the feds *can’t,* it is not in the article.",
                "Man I got my teaching license through one of these programs. It’s pretty prohibitive to be certified in my state (you have to have a Masters degree in education). I worked in one of the poorest districts in the country for 7 years (I’m in a different district now). I felt a lot of loyalty to the school system, because they invested a lot of money into me. Even more important, these programs allow people to enter the field that might have been blocked by the economic fetters towards becoming certified, like say people of color. Which is probably why Trump wants to end them. They also cycle teachers into certifications that are hard to fill like special education and English as a New Language. I NEVER would have become a special education teacher had I not kind of had to become one. And I love special education. And god the ENL teacher shortage is already really, really, really bad.",
                "So wait, help me understand, I might be stupid. The purpose of the tariffs is to bring back manufacturing to America, which will take years. During those years, some would think it would be wise to educate & train up the future generations, correct? Based on this & the events of the past ::checks notes:: not even 3 months yet, future generations will be dumber than rocks. How are we supposed to manufacture anything?",
                "Yes, because one thing we have way too many of is teachers. /S"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "U.S. Peace Corps says Musk's DOGE has arrived at its HQ",
            "external_url": "https://www.reuters.com/world/us/us-peace-corps-says-musks-cost-cutting-team-has-arrived-its-hq-2025-04-04/",
            "upvotes": 11370,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This administration is amplifying everything people dislike about the US while simultaneously destroying everything people do like about the US.",
                "So, what exactly happens if an agency simply doesn’t cooperate with DOGE?",
                "I can't imagine an agency with less fat than the Peace Corps; the stipends are miniscule.",
                "The Musk/Trump administration doesn't understand the concept of 'soft power'. Furthermore, they're entirely unwilling to listen to the argument for it. America's greatness (such that it ever existed) comes in large part to it's effective use of soft power. The Marshall Plan, the Peace Corps and NASA all have a roll in advancing America's interest abroad. Dollar-for-dollar these programs grew the brand of America more than it's military or direct diplomacy ever could on its own. Wait two years to see.",
                "That is easily the dumbest hat I've seen in quite a while and we've all seen a LOT of MAGA hats.",
                "The grim reaper has arrived. Aside from Trump , Netanyahu and Putin,  Elon is the most unpopular person in the world today.",
                "It's painfully obvious that the whole administration has bought into some absolute bullshit lie from Elon Musk about his, garbage tier, Grok AI being ready to take over most of the federal government's functions. Elon is a great con man when dealing with people who understand tech. When he starts selling shit to the types of people in the Trump admin it is like shooting fish in a barrel. This whole experiment is going to destroy the US standing in the world, it's economy, and the US tech industry. We are getting Xed at a national scale. If you voted for this you are an absolute fucking dipshit.",
                "Have you noticed that DOGE does the worst things on Friday afternoons? DOGE fears accountability",
                "You have to be truly evil and dead inside to dismantle the Peace Corps. There’s a special place in hell reserved for Elon Musk.",
                "It’s like the bureaucracy version of the fucking mongols arriving at your city gates"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Woman, 20, sentenced for false rape report that jailed innocent man for a month",
            "external_url": "https://local12.com/news/nation-world/anjela-borisova-urumova-woman-sentenced-for-false-rape-report-that-jailed-innocent-man-month-sexual-violence-bucks-county-correctional-facility-worst-crimes-criminal-activity-claims-evaluation-falsification-physical-evidence-mental-health-evaluation",
            "upvotes": 11071,
            "date": "04/04/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/737/986/1x0/90/ff255216-5015-45e2-91a8-1ec3cf6cfad2-SuspectFinal.JPG",
            "top_comments": [
                "Feel so bad for this guy, anyone who has tried to get a search result taken off of google knows how impossible it is through their bots. On top of the false charge he will have to explain this surely emotionally draining charge to any employer or future girlfriend",
                "I was a victim of a girl who raped me and stalked me.  I avoided her at all costs, and she eventually moved on.  I suspect she had the same sort of relationship with the next guy she started dating - because I know she was very upset with him.  showed up at a bar, and acted all drunk, and brought him out to her car, where she had sex with him.  he went back into the bar and she ran in and said he raped her.  \n\nThe guy was taken away in handcuffs, and couldn't believe what was happening to him.  She eventually came clean, but the damage was done - the dude had mugshots, and was arrested in the middle of a crowded bar.  she didn't get so much as a slap on the wrist.  From what I understand, the guy was just so happy to have the charges dropped against him.  But he should have pressed charges against her for the damage she did to him.  \n\nThis was about 20 years ago that this happened.  and I still worry about how I was just a few months away from being 'the guy' in this story.",
                "Many years ago (I was around 17) I was accused of assault and rape by a woman I had never met, never seen before. I was arrested and detained and sent to Juvenile Detention. My parents lawyered up, Bailed me out 3 days or so later. It ended when her story kept changing and I had no wounds on my hands or face the night I was booked.  Can go much deeper in to the story but I won’t bore y’all. It was scary. She knew my address, phone number (land line back then) my vehicle, my overall everything. I was at my GF’s house after school, did some day boozing, walked 2 blocks home, and went to bed. Then I was “woken up” about 4 hours later. Lots of people I’ve told the story too have said “I’ve had handled it this way”. But I was woken up from a dead sleep, completely confused, 3 cops screaming at me, my dad freaking out, my mom in hysterics. \n\nThere were no consequences for the accuser. I moved across country for school and that was it. That was around ‘89 or ‘90. Fucking sucked.",
                "I'm sure the 41 year old guy who faced a month in jail with his name and picture plastered over press releases will never face any ongoing discrimination when his name comes up in job searches",
                "I'm actually surprised she went to jail...",
                "I used to be a college professor and told freshmen over and over:  Rape can happen to you; false rape allegations can happen to you. Never put yourself in a vulnerable position.  If you are drinking, go with friends and STAY with friends.\n\nThat isn’t a surefire preventative but it helps.",
                "My question is why did it take a month to free him. I went and found the reporting of his original arrest\n\nhttps://www.cbsnews.com/philadelphia/news/daniel-pierson-arrest-attempted-rape-kidnapping-middletown-township-grocery-store-parking-lot/\n\n>\"Pierson is known to police to be a methamphetamine user,\" the release said.\n\nGuess they thought they had to add that in there. Bail was set at somewhere under a million so that is why he was in jail...",
                "She permanently victimized him by making a bogus report that he will never entirely shake the reputation of. He’ll be exiled and vilified to some degree because of this fiction she decided to spin.\n\nAnd she made it more difficult for actual victims to come forward or be believed.\n\nGlad she’s seeing some measure of justice. May all ruinous tyrants face the same.",
                "As a woman - I'm glad to see this.\n\nScumbags like her are a big reason why actual victims aren't believed. Her punishment is way too light, in my opinion, though.",
                ">  and pay $3,600 in restitution to the victim.\n\nStraight to civil court for me! I’m asking for no less than $50k, that’s assuming there are no other damages besides my time for a month."
            ],
            "aggregate_sentiment": 27.0
        },
        {
            "category": "NEW",
            "title": "Meta's content moderation contractor to cut 2,000 jobs in Barcelona",
            "external_url": "https://www.reuters.com/technology/metas-content-moderation-contractor-cuts-2000-jobs-barcelona-2025-04-04/",
            "upvotes": 238,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Meta has quietly ended a major contract with Telus International, leading to the firing of up to 2,000 content moderators in Barcelona. The team team handled moderation across Catalan, French, Dutch, Hebrew, Portuguese, and Spanish. The move comes as Meta reduces moderation globally.\n\nHonestly, this kind of worries me. Feels like we need more moderation these days, not less.\n\nWhat do you make of this?",
                "They need to ban social media before these tech oligarchs take over their governments too",
                "Meta has content moderation? I’ve received and reported dozens of violent death threats and 1000s of slurs and had nary a response in a decade. Guess they’re busy censoring the wOkE.",
                "Meta is just make themselves a target in the EU. The EU is already looking at fining Twitter/Musk $1 billion for not moderating their content.",
                "So are they going to stop or cut down on content moderation, or are they now going to use AI to do the job?",
                "Honestly, it's probably a blessing in disguise for those people. These people have to look at some truly dark shit. Shit that you will spend a lifetime in therapy trying to deal with. We're talking like graphic kiddie porn, people being beheaded or worse, people being violently raped, mass shootings, and some of the most vile, hate-filled, comments you've ever seen. Things that will scar you for life. \n\nI'm sure they're just going to move more of this to some third world country like the Philippines where they'll just churn through people and won't have to offer any kind of mental health benefits. Once they exhaust the supply of people in one country they'll just move to another low wage country.\n\nI do hope, however, that this means there will be a temporary surge in content that violate EU laws and results in Facebook getting slapped with some truly massive fines.",
                "Can't blame them. META would be insane not reduce it's EU footprint ASAP to avoid EU retaliation on US companies doing business in the EU."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Judge orders US government to return man who was mistakenly deported to El Salvador by end of Monday",
            "external_url": "https://www.cnn.com/2025/04/04/politics/judge-orders-us-government-return-man-from-el-salvador/index.html",
            "upvotes": 1477,
            "date": "04/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/jennifer-vasquez.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "And I wonder what will happen when that’s not done.",
                "Before 2016, I would have believed that judge orders meant something. Now I feel like judge orders are nothing but suggestions that can be ignored.",
                "Did they sell these people?\n\nThat would explain why they say they can't get him back.",
                "Well, the constitutional crisis is here, folks. The separation of power clause is now put to the test. \n\nIf this order is not obeyed, I doubt the judge has any recourse since law enforcement is an executive branch function. He can escalate by ordering to detain government officials, but if Trump does not play ball, pardon them, or just fire anyone who would obey the judge's order, what is the judge going to do?",
                "Imagine this happening to you, or someone you love.",
                "Somebody needs to be put in jail until it is fixed.",
                "They won’t. And it’s horrifying. That guy is there, he shouldn’t (to be clear on my position nobody should) and he is being tortured as we speak.\n\nThis is the America of the United States.",
                "They'll just ignore the order.",
                "It doesn't matter if there is no enforcement of the court orders or if congress does not back it's laws. If Trump is free to do what he wants nothing matters.",
                "\"Activist judge!\", said the nectarine nutcase, spreading more Grumble and Frown from his own tub of lard."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Federal judge rules return of Maryland man mistakenly deported to El Salvador prison",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/04/maryland-deported-el-salvador-kilmar-abrego-garcia",
            "upvotes": 24816,
            "date": "04/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/c20b3ba9e18add1958ec77d0ca363335b3355628/0_100_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=07a4e4739e53960824a55ef20b2d1e0b",
            "top_comments": [
                "if we lived in a sane country, he and his family would be able to sue for tens of millions. the entire saga is fucking ridiculous. \n\n\"we know we fucked up, but it would be against our shit plan to undo it so cope ig\"",
                "It's not over till he's home.",
                "Interesting how the Trump admin indicates it can do nothing about retrieving this man from El Salvador with whom it has very friendly relations, yet it was able to get Mexico to bring back the 2 Caucasian people who were in jail for defrauding a timeshare company in Mexico after 2 weeks of negotiating (as they were apparently guilty of the fraud).\n\nSo all that is really at play here is that the Trump admin does not want to bring this person back, because they are not white.  It is as simple as that.",
                "an innocent man just can be held in jail?  What kind of crazy idea is that ... oh due process?  human rights?...huh I am pretty sure the Republican party gave those up",
                "Republicans would call this judicial overreach",
                "And for every story like this we see, you just *know* there's a hundred cataclysmic fuck-ups that we're not seeing. \n\nLast time this ape was in charge his equivocating gibberish and asinine policies exacerbated a deadly pandemic [leading to many, many unnecessary COVID deaths] (https://www.businessinsider.com/analysis-trump-covid-19-response-40-percent-us-deaths-avoidable-2021-2?op=1) and [dead Americans in general](https://www.forbes.com/sites/tommybeer/2021/02/11/trumps-policies-resulted-in-the-unnecessary-deaths-of-hundreds-of-thousands-of-americans-lancet-report/) but none of this ever gets brought up and he surely sleeps like a baby.\n\nI shudder to think of what we don't know.",
                "The truth is this Nazi admin doesn't want this man back because he'll be able to speak on how terrible and inhumane the treatment is at this death camp. They could get him back no problem, its that it would not bode well for them if they did.",
                "How sad that it had to go to a judge and they refused to correct their tragic mistake in the first place.",
                "I hope he's returned swiftly and safely, but I doubt part of disappearing people is keeping track of where they wind up at the other end. I've never worked as a human trafficker, so idk.",
                "They should all be returned and if there was evidence of crimes committed in the US. Put them on trial in the US. Otherwise free them. No one, not even criminals should be sent overseas to a death camp of a prison"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Prosecutor Appeals Lack of Sentence in Student Rape Case",
            "external_url": "https://www.vrt.be/vrtnws/en/2025/04/03/prosecutor-appeals-lack-of-sentence-in-student-rape-case/",
            "upvotes": 269,
            "date": "04/04/2025",
            "thumbnail": "https://images.vrt.be/vrtnws_share/2019/03/06/ebdd4a23-3ffb-11e9-abcc-02b7b76bf47f.jpg",
            "top_comments": [
                "The justice system is really fucking telling on themselves when they avoid giving someone a sentence because it might damage them in some way. Reform and correction should be the point of prison",
                "Excused him because he’s “young and talented”. And now he e knows he can get away with rape scott-free. And his victim knows all she gets is posturing.",
                "Good. 0 penalty for rape is disgusting, regardless of age or talent."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "DACA recipient and Kansas City father of 3 deported to Mexico despite valid documentation",
            "external_url": "https://www.cbsnews.com/news/daca-recipient-kansas-city-father-deported-mexico-despite-valid-documentation/",
            "upvotes": 2219,
            "date": "04/05/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/21/135d73e3-b4d4-4af3-89c8-8922a88d6caf/thumbnail/1200x630/2190c836194bbde9541ee0a89011d5f4/gettyimages-2162517300.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Why taking the time for due process matters.  A lot.",
                "Maga is too stupid to know that you can't unmix the chocolate from the cake.\n\nSo it's just a theater of pain and humiliation for immigrants till \"The Stupidest Generation\" dies out.",
                "The objective was always cruelty.",
                "Can they even do this?",
                "Whatever your feeling on immigration is, it's insane how much DACA recipients' lives have been played with.\n\nApparently people want countries not to send their \"worst.\" Well they were/are the definition of it. They are people who were ready to better their lives thru education.\n\nBoth sides of the team sports have let them down and it has been a travesty. If you're going to invest anything into a goal, why not see the goal thru to the logical end. If you don't, what was the point of wasted resources",
                "Wow. For legal residents to be cautioned against traveling is frightening beyond belief. Pretty soon, passport holding, US born citizens, (like myself ) will be cautioned against speaking or writing comments protected by the US Constitution for fear of being sent to a re-education 'camp'.\n\nIf you think it's funny, would you have believed 5 months ago that things like this would/could happen ?\n\nThe things we hold dear and believe to be natural rights are being burned bit by bit...and it's getting hotter by the second.",
                "immigrants enrich america. if not all you got are dumb red nec…. oh i get it",
                "God I wish I was an attorney. I legit would spend the next 4 years fighting these fucking idiots in court",
                "I see nothing (says Sgt Schultz)",
                "Remember when they said it wasn't a racist thing because he was only going to go after the illegal immigrants?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Tech megacaps lose $1.8 trillion in 2 days as Trump tariffs lead Nasdaq to worst weekly drop in 5 years",
            "external_url": "https://www.cnbc.com/2025/04/04/technology-stocks-fall-for-a-second-session-led-by-tesla-and-nvidia.html",
            "upvotes": 2789,
            "date": "04/04/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108120393-1742835357354-gettyimages-2206691913-wm100366_kl5aayk2.jpeg?v=1743786921&w=1920&h=1080",
            "top_comments": [
                ">...worst weekly drop in 5 years.\n\nThe worst drop since the last time he was in office.",
                "From the article:\n\n\\- Apple has nosedived the most, shaving off more than $533 billion in market capitalization.\n\n\\- Tesla shaved off more than $89 in market cap, bringing its two-day tally to more than $139 billion\n\n\\- Meta plummeted more than $200 billion\n\n\\- [Amazon](https://www.cnbc.com/quotes/AMZN/) dropped $265 billion\n\n\\- Alphabet:  $139 billion\n\n\\- Microsoft: $165 billion\n\nThat's some unbelievable destruction of wealth!",
                "We are WINNING! THIS IS THE GREATEST WINNING. 🤡",
                "Trump Tax causing the Trump Recession",
                "Headline should say the worst weekly drop since the last time Trump was in office.",
                "You act like they aren't also buying this dip to consolidate and concentrate more wealth away from the masses.",
                "Worst drop in 5 years, wasn’t rump the president 5 years ago lmao",
                "Small price to pay to \"own the libs\"\n\nWhoever voted for this administration can hurt and hurt and continue hurting.",
                "When Biden was in office Faux News pundits all said you can tell how good a job a president is doing by reading the Stock Market. When the market under Biden was doing great Faux News barely covered the story. When Trump was inaugurated the market went up and Faux News said see how great the market is going knowing Trump is president. Now Faux News pundits are saying the market is not a good indicator on how well a president is performing. Also, not one word from Faux News on the rise in unemployment. Hypocrisy and morons are reporting on our countries free fall into the next Great Depression. Will need a new name for all those out of work people who camp out in DC, Hooverville has already been used.",
                "Three Months In $5 Trillion Destroyed.\n\nGo defensive - protect what you have left. The bottom is still ways away.\n\nAnd don't suffer quietly. Keep calling your congressmouse and ask it to do its job."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "U.S. Peace Corps says Musk's DOGE has arrived at its HQ",
            "external_url": "https://www.reuters.com/world/us/us-peace-corps-says-musks-cost-cutting-team-has-arrived-its-hq-2025-04-04/",
            "upvotes": 11369,
            "date": "04/04/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This administration is amplifying everything people dislike about the US while simultaneously destroying everything people do like about the US.",
                "So, what exactly happens if an agency simply doesn’t cooperate with DOGE?",
                "I can't imagine an agency with less fat than the Peace Corps; the stipends are miniscule.",
                "The Musk/Trump administration doesn't understand the concept of 'soft power'. Furthermore, they're entirely unwilling to listen to the argument for it. America's greatness (such that it ever existed) comes in large part to it's effective use of soft power. The Marshall Plan, the Peace Corps and NASA all have a roll in advancing America's interest abroad. Dollar-for-dollar these programs grew the brand of America more than it's military or direct diplomacy ever could on its own. Wait two years to see.",
                "That is easily the dumbest hat I've seen in quite a while and we've all seen a LOT of MAGA hats.",
                "The grim reaper has arrived. Aside from Trump , Netanyahu and Putin,  Elon is the most unpopular person in the world today.",
                "It's painfully obvious that the whole administration has bought into some absolute bullshit lie from Elon Musk about his, garbage tier, Grok AI being ready to take over most of the federal government's functions. Elon is a great con man when dealing with people who understand tech. When he starts selling shit to the types of people in the Trump admin it is like shooting fish in a barrel. This whole experiment is going to destroy the US standing in the world, it's economy, and the US tech industry. We are getting Xed at a national scale. If you voted for this you are an absolute fucking dipshit.",
                "Have you noticed that DOGE does the worst things on Friday afternoons? DOGE fears accountability",
                "You have to be truly evil and dead inside to dismantle the Peace Corps. There’s a special place in hell reserved for Elon Musk.",
                "It’s like the bureaucracy version of the fucking mongols arriving at your city gates"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court allows Trump to freeze dozens of teacher training grants",
            "external_url": "https://www.cnn.com/2025/04/04/politics/supreme-court-trump-teacher-grants/index.html",
            "upvotes": 2648,
            "date": "04/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2205531023.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If Congress no longer controls the power of the purse, what is their Constitutional reason to even exist?",
                "You think this is bad? Just wait until they rule he can rewrite the Constitution via Executive Order.",
                "There was no textual authority for President Trump to freeze these grants. There was textual authority for President Biden to forgive student loans. But textualism only matters when it leads to the outcome this activist Court wants.",
                "Education is the enemy of authoritarianism.\n\nProve me wrong.\n\nWhat’s one of the first groups fascists and authoritarians always go after? The educated. The intelligentsia.\n\nDictators love their people dumb and emotionally-led. Easier to control, easier to manipulate.",
                "Split 5-4 decision with Roberts siding with the liberal justices.",
                "No need for them . Education department is being dismantled so no more need for teachers !",
                ">But, the court said, the Trump administration made a compelling case that it would not be able to recover any funds spent while the lower court’s order remained in place.\n\n>If the states ultimately win the case, the court said, “they can recover any wrongfully withheld funds through” further litigation.\n\nIf they bothered to explain why the states can sue to get their money but the feds *can’t,* it is not in the article.",
                "Man I got my teaching license through one of these programs. It’s pretty prohibitive to be certified in my state (you have to have a Masters degree in education). I worked in one of the poorest districts in the country for 7 years (I’m in a different district now). I felt a lot of loyalty to the school system, because they invested a lot of money into me. Even more important, these programs allow people to enter the field that might have been blocked by the economic fetters towards becoming certified, like say people of color. Which is probably why Trump wants to end them. They also cycle teachers into certifications that are hard to fill like special education and English as a New Language. I NEVER would have become a special education teacher had I not kind of had to become one. And I love special education. And god the ENL teacher shortage is already really, really, really bad.",
                "So wait, help me understand, I might be stupid. The purpose of the tariffs is to bring back manufacturing to America, which will take years. During those years, some would think it would be wise to educate & train up the future generations, correct? Based on this & the events of the past ::checks notes:: not even 3 months yet, future generations will be dumber than rocks. How are we supposed to manufacture anything?",
                "Yes, because one thing we have way too many of is teachers. /S"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Disgraced former Cardinal Theodore McCarrick has died at age 94",
            "external_url": "https://www.nbcnews.com/news/us-news/disgraced-former-cardinal-theodore-mccarrick-dead-rcna199779",
            "upvotes": 389,
            "date": "04/04/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250404-Theodore-McCarrick-ew-351p-285335.jpg",
            "top_comments": [
                "Guess the pedo is finding out if Hell exists. 👹🔱🔥",
                "🙏 start a trend start a trend",
                "Drive a stake through his heart, just to be sure.",
                "Doesn't sound like he died in prison?",
                "Good riddance. It’s times like this that I hope the hell he supposedly believed in actually exists.",
                "*Shitbag finally succumbs",
                "And the world was just a little bit better",
                "It's true:  Only the good die young.",
                "He was left on Earth for so long because the Devil didn’t want him either.",
                "I hope it was a long, slow, painful exit."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Federal judge rules return of Maryland man mistakenly deported to El Salvador prison",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/04/maryland-deported-el-salvador-kilmar-abrego-garcia",
            "upvotes": 24823,
            "date": "04/04/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/c20b3ba9e18add1958ec77d0ca363335b3355628/0_100_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=07a4e4739e53960824a55ef20b2d1e0b",
            "top_comments": [
                "if we lived in a sane country, he and his family would be able to sue for tens of millions. the entire saga is fucking ridiculous. \n\n\"we know we fucked up, but it would be against our shit plan to undo it so cope ig\"",
                "It's not over till he's home.",
                "Interesting how the Trump admin indicates it can do nothing about retrieving this man from El Salvador with whom it has very friendly relations, yet it was able to get Mexico to bring back the 2 Caucasian people who were in jail for defrauding a timeshare company in Mexico after 2 weeks of negotiating (as they were apparently guilty of the fraud).\n\nSo all that is really at play here is that the Trump admin does not want to bring this person back, because they are not white.  It is as simple as that.",
                "an innocent man just can be held in jail?  What kind of crazy idea is that ... oh due process?  human rights?...huh I am pretty sure the Republican party gave those up",
                "Republicans would call this judicial overreach",
                "And for every story like this we see, you just *know* there's a hundred cataclysmic fuck-ups that we're not seeing. \n\nLast time this ape was in charge his equivocating gibberish and asinine policies exacerbated a deadly pandemic [leading to many, many unnecessary COVID deaths] (https://www.businessinsider.com/analysis-trump-covid-19-response-40-percent-us-deaths-avoidable-2021-2?op=1) and [dead Americans in general](https://www.forbes.com/sites/tommybeer/2021/02/11/trumps-policies-resulted-in-the-unnecessary-deaths-of-hundreds-of-thousands-of-americans-lancet-report/) but none of this ever gets brought up and he surely sleeps like a baby.\n\nI shudder to think of what we don't know.",
                "The truth is this Nazi admin doesn't want this man back because he'll be able to speak on how terrible and inhumane the treatment is at this death camp. They could get him back no problem, its that it would not bode well for them if they did.",
                "How sad that it had to go to a judge and they refused to correct their tragic mistake in the first place.",
                "I hope he's returned swiftly and safely, but I doubt part of disappearing people is keeping track of where they wind up at the other end. I've never worked as a human trafficker, so idk.",
                "They should all be returned and if there was evidence of crimes committed in the US. Put them on trial in the US. Otherwise free them. No one, not even criminals should be sent overseas to a death camp of a prison"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Woman, 20, sentenced for false rape report that jailed innocent man for a month",
            "external_url": "https://local12.com/news/nation-world/anjela-borisova-urumova-woman-sentenced-for-false-rape-report-that-jailed-innocent-man-month-sexual-violence-bucks-county-correctional-facility-worst-crimes-criminal-activity-claims-evaluation-falsification-physical-evidence-mental-health-evaluation",
            "upvotes": 11067,
            "date": "04/04/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/737/986/1x0/90/ff255216-5015-45e2-91a8-1ec3cf6cfad2-SuspectFinal.JPG",
            "top_comments": [
                "Feel so bad for this guy, anyone who has tried to get a search result taken off of google knows how impossible it is through their bots. On top of the false charge he will have to explain this surely emotionally draining charge to any employer or future girlfriend",
                "I was a victim of a girl who raped me and stalked me.  I avoided her at all costs, and she eventually moved on.  I suspect she had the same sort of relationship with the next guy she started dating - because I know she was very upset with him.  showed up at a bar, and acted all drunk, and brought him out to her car, where she had sex with him.  he went back into the bar and she ran in and said he raped her.  \n\nThe guy was taken away in handcuffs, and couldn't believe what was happening to him.  She eventually came clean, but the damage was done - the dude had mugshots, and was arrested in the middle of a crowded bar.  she didn't get so much as a slap on the wrist.  From what I understand, the guy was just so happy to have the charges dropped against him.  But he should have pressed charges against her for the damage she did to him.  \n\nThis was about 20 years ago that this happened.  and I still worry about how I was just a few months away from being 'the guy' in this story.",
                "Many years ago (I was around 17) I was accused of assault and rape by a woman I had never met, never seen before. I was arrested and detained and sent to Juvenile Detention. My parents lawyered up, Bailed me out 3 days or so later. It ended when her story kept changing and I had no wounds on my hands or face the night I was booked.  Can go much deeper in to the story but I won’t bore y’all. It was scary. She knew my address, phone number (land line back then) my vehicle, my overall everything. I was at my GF’s house after school, did some day boozing, walked 2 blocks home, and went to bed. Then I was “woken up” about 4 hours later. Lots of people I’ve told the story too have said “I’ve had handled it this way”. But I was woken up from a dead sleep, completely confused, 3 cops screaming at me, my dad freaking out, my mom in hysterics. \n\nThere were no consequences for the accuser. I moved across country for school and that was it. That was around ‘89 or ‘90. Fucking sucked.",
                "I'm sure the 41 year old guy who faced a month in jail with his name and picture plastered over press releases will never face any ongoing discrimination when his name comes up in job searches",
                "I'm actually surprised she went to jail...",
                "I used to be a college professor and told freshmen over and over:  Rape can happen to you; false rape allegations can happen to you. Never put yourself in a vulnerable position.  If you are drinking, go with friends and STAY with friends.\n\nThat isn’t a surefire preventative but it helps.",
                "My question is why did it take a month to free him. I went and found the reporting of his original arrest\n\nhttps://www.cbsnews.com/philadelphia/news/daniel-pierson-arrest-attempted-rape-kidnapping-middletown-township-grocery-store-parking-lot/\n\n>\"Pierson is known to police to be a methamphetamine user,\" the release said.\n\nGuess they thought they had to add that in there. Bail was set at somewhere under a million so that is why he was in jail...",
                "She permanently victimized him by making a bogus report that he will never entirely shake the reputation of. He’ll be exiled and vilified to some degree because of this fiction she decided to spin.\n\nAnd she made it more difficult for actual victims to come forward or be believed.\n\nGlad she’s seeing some measure of justice. May all ruinous tyrants face the same.",
                "As a woman - I'm glad to see this.\n\nScumbags like her are a big reason why actual victims aren't believed. Her punishment is way too light, in my opinion, though.",
                ">  and pay $3,600 in restitution to the victim.\n\nStraight to civil court for me! I’m asking for no less than $50k, that’s assuming there are no other damages besides my time for a month."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Comedian Russell Brand charged with rape",
            "external_url": "https://www.bbc.co.uk/news/articles/c0457d02e9go",
            "upvotes": 18145,
            "date": "04/04/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8110/live/58dc9480-1167-11f0-ba12-8d27eb561761.jpg",
            "top_comments": [
                "This is the least surprising news story I've seen all week.",
                "It's always the ones you most suspect",
                "Yeah that's why he became super Christian all of a sudden. He knew this was coming",
                "Some people say the worst part was the hypocrisy.\n\n\nI think it was the rape.\n\n\n/To paraphrase a real comedian ",
                "The Onion just reposted this[https://theonion.com/nation-could-have-sworn-russell-brand-was-already-convi-1850849838/](https://theonion.com/nation-could-have-sworn-russell-brand-was-already-convi-1850849838/)",
                "I read this headline and thought it was old news, honestly.\n\nWhen he started freaking out about woke people after MeToo I knew something was up with the dude",
                "Rapist Russell Brand charged with trying to be comedian",
                "Well I see someone wants to join the Trump administration",
                "Insane he made it to 2025. Him making it through the me too era is like getting an rpg past TSA in your backpack",
                "Get Him to the Greek stared Russel Brand, P Diddy and Jonah Hill."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "USA Fencing disqualifies athlete for refusing to compete against transgender woman",
            "external_url": "https://abcnews.go.com/US/usa-fencing-disqualifies-stephanie-turner-refusing-fence-transgender/story?id=120462854",
            "upvotes": 13278,
            "date": "04/04/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1ec66efa-8d15-4e68-bb23-e0a4ce5dfad3/fencer-gty-er-250403_1743708715102_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Perhaps not in an actual competition, but fencing is often coed… I’ve definitely fenced against as many women as I have men. There isn’t some radical sex based advantage in fencing the way you might argue there is in many other supports, so this is totally ridiculous.",
                "So this is what the distraction is gonna be while the economy collapses, people are pulled off the streets by masked police and flown off without trial, and our allies abandon us? This is the important shit right here, huh?",
                "> Prior to 1990, separate men’s championships were held, but since then, fencing has been a coed sport with teams having men’s and women’s squads, although some schools field only a women’s team. Fencing is a single-division sport with schools from all three NCAA divisions competing against each other.\n\nHere’s some facts for all the morons talking about the “biological advantage” men have in fencing. It’s been a coed sport at the national competition level for nearly FOURTY YEARS. This is nothing but more conservative performative outrage, and your excuses is what encourage this kind of behavior.",
                "If all fails throw in a bit of trans panic so MAGA has something to be outraged about",
                "I’m sure the comments and discourse will be very positive",
                "Journalists suck.\n\nThis article should have at a minimum explained USA fencing's policy [outlined here](https://www.usafencing.org/transgender-and-nonbinary-policy). They couldn't be bothered to even look up what the policy was apparently, or provide information around why USA fencing felt that policy was actually ok.\n\nThis article comes across as, \"Hey I'm some dude and I want to poke women with my sword.\" Not, \"I identify as a woman and I've been on HRT for 12 months and because of that have lost most of my muscle tone.\" I'd even think it was great if they explained the counterpoint as well which is that most of the physical advantage of men comes from their height which is something they gain in puberty.\n\nI know this is a challenging topic for a lot of people, but holy fuck mainstream journalism is garbage.\n\n  \nedit: This is not an endorsement of alt-media (which is nothing but a sewage plant). It's a plea for journalists to do better.",
                "I'm still on the fence about the whole thing.",
                "Name one professional fencer off the top of your head.",
                "Look, I'd like to care about the stock market, having a house, people being disappeared, but this lady didn't get to fence who she wanted!!  This is truly the crisis of our time.",
                "All these folks so worried about women's (and girl's) sports don't seem too concerned that the Department of Education is being dismantled and that the DOE oversees compliance for Title IX.  Pre-Title IX --1 in 27 girls participated in sports, now it's is 2 in 5.  If you really do care about \"protecting\" opportunities for girls and women in sports, Title IX would be your focus.  NOTE, the same pols so obsessed with trans women in sports are the same ones who'd eliminate Title IX in a heartbeat. \n\n[https://www.womenssportsfoundation.org/wp-content/uploads/2022/04/FINAL6\\_WSF-Title-IX-Infographic-2022.pdf](https://www.womenssportsfoundation.org/wp-content/uploads/2022/04/FINAL6_WSF-Title-IX-Infographic-2022.pdf)"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "China to impose 34% retaliatory tariff on all goods imported from the U.S.",
            "external_url": "https://www.cnbc.com/2025/04/04/china-to-impose-34percent-retaliatory-tariff-on-all-goods-imported-from-the-us.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
            "upvotes": 34287,
            "date": "04/04/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/106677114-15983545702020-08-25t100023z_1719720997_rc2yki97n9wc_rtrmadp_0_usa-china-tech.jpeg?v=1692261559&w=1920&h=1080",
            "top_comments": [
                "Has any country in history ever started a trade war with the entire planet and won?",
                "Conservatives - Fall 2024 - “Eggs are too damn high.”\n\nConservatives - Apr 2025 - “New taxes on almost everything…sounds good.”",
                "China has the largest manufacturing base in the world - naïve to expect they wouldn’t hit back.",
                "So uh..... farmers fucked?",
                "aaaaand there goes the American farmer exports...",
                "What DT has done will be chronicled in history books not only for how he manipulated data to serve his interests, but also for how he influenced collective minds through falsehoods, expecting other political actors to fall into his trap. Fortunately, most of the world is no longer willing to dance to his tune or validate his tactics.",
                "The republican base will see this and believe its “growing pains”. There is no amount of pain they can suffer before it’s Trumps fault \n\nNo matter what happens in the next 4 years, it will always be Biden and the democrats fault",
                "“Things are going great!”\n\n-every Trump supporter with their head in the sand desperately trying not to believe their lying eyes. ",
                "Even if Trump reverses course and pretends he did it to get concessions, the damage is done. Much of the world is boycotting American products out of anger and it’s unlikely America will come out ahead in this trade war once it’s over.",
                "American dollar stores are going to have to become $1.34 stores."
            ],
            "aggregate_sentiment": 12.0
        }
    ],
    "last_updated": "04/05/2025 08:10:19 UTC"
}