{
    "posts": [
        {
            "category": "HOT",
            "title": "Ben & Jerry's claims Unilever ousted its boss over political activism",
            "external_url": "https://www.bbc.com/news/articles/ckg8pk9rpx4o",
            "upvotes": 13349,
            "date": "03/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d7be/live/d33cbd20-0485-11f0-9776-23d43d9c7fe7.jpg",
            "top_comments": [
                "It doesn’t look like this has gone through yet according to the article. Guess we will see what the independent board decides.",
                "Back in the 80s, Ben & Jerry’s had a corporate 5 - 1 plan.  The highest paid employee (including CEO) could make no more than 5 times the salary of the lowest paid employee.",
                "Buy an activism by design brand then fire the activists. Sounds about right.",
                "Sounds like the parent company violated the agreements they had with Ben and Jerry’s. It’s always been a politically active brand. ",
                "Did they really think selling their brand to a corporation would end any other way?",
                "\"It comes a month after the ice cream company accused Unilever of demanding that it stops publicly criticising US [Supreme Leader] Donald Trump.\" \n\nWell... you know what to do.\n\n https://en.m.wikipedia.org/wiki/List_of_Unilever_brands",
                "“Mr Stever has been with Ben & Jerry’s since joining the firm in 1988 as a tour guide. He was appointed chief executive in 2023.”\n\nHoly shit this rules.",
                "B+J is a very good example of why a company shouldn't go public.",
                "Stop letting billionaires buy your companies if you don’t want them to control your companies",
                "The Americone Dream is over."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "US ‘deletes evidence’ of Russia’s kidnap of thousands of Ukrainian children",
            "external_url": "https://www.independent.co.uk/news/world/europe/trump-ukraine-children-russia-war-kidnapping-evidence-b2717730.html",
            "upvotes": 4781,
            "date": "03/19/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/18/13/58/SEI244319340.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "Great. Our actions are now complicity.",
                "Summary:\n\nThe US State Department allegedly deleted evidence collected by Yale University’s Humanitarian Research Lab, which was tracking Russian war crimes, including the abduction of 35,000 Ukrainian children. The deletion has hindered efforts to rescue the children and prosecute those responsible, including Russian President Vladimir Putin. The Yale project, funded by the US government until last month, monitored 116 sites in Russia using satellite imagery and other surveillance tools.\n\nSources suggest the deletion may have been accidental or intentional, raising potential legal risks for the Trump administration under international war crimes laws. The lost data was also being shared with the EU for its own investigations. The destruction of evidence not only affects legal cases but also complicates ongoing rescue missions.\n\nThe Yale project played a key role in gathering evidence that contributed to six ICC indictments, including against Putin and his commissioner for children’s rights. Russia has been accused of forcibly transferring Ukrainian children, issuing Russian passports in occupied areas, and erasing Ukrainian identity. The loss of the secure “Caesar” database has been described as a violation of the Geneva Convention, which prohibits destroying war crimes evidence. The US State Department has yet to respond.",
                "Greenlighting child abductions. \n\nFeeling free and brave yet, republicans?",
                "Just a reminder that Trump pardoned more known pedophiles than any other US President in history",
                "US goverment supports genocide.",
                "This is disgusting and heartbreaking and I hope every single person that voted for Trump has this shoved in their face. You are part of the reason this war criminal gets to continue to tear families apart and these children, THESE CHILDREN, may never see their families again.",
                "Very sad thing to read about...",
                "Not super familiar with International wartime law... but isn't covering up a war crime a war crime?",
                "i really hope some kind of back up  have been sent to partners outside us",
                "MAGA are pro rape, molestation and trafficking."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "‘I escaped one gulag only to end up in another’: Russian asylum seekers face Ice detention in the US",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/i-escaped-one-gulag-only-to-end-up-in-another-russian-asylum-seekers-face-ice-detention-in-the-us",
            "upvotes": 1015,
            "date": "03/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d3986542f93dd806c8f7ce93c79795eb3114ad7/793_97_3207_1925/master/3207.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2a0101e0828ed798db1717bf821bbab6",
            "top_comments": [
                "I found the article and this quote interesting, did not know this fact!\n\n>For years, Russians have been among the top [five](https://tracreports.org/reports/751/) nationalities granted asylum (in the USA).",
                ">For years, he criticized Putin’s regime on Facebook, and he was detained twice at protests\n\nWell I guess now he knows why America shoved him into a Gulag.",
                "This reminds me of the guy who was in Hiroshima when the US dropped the bomb on it and he survived. He then fought his way through to Nagasaki where he had family. After days of walking he arrived in Nagasaki just in time to have the second nuclear bomb dropped on his head. He also survived the second one.\n\nNow I'm conflicted. Is he the luckiest guy to ever live or the unluckiest?",
                "This has been going on for  a while, I recall reading a story at least 25 years ago about a Scottish citizen who overstayed his tourist visa by a few days and ended up in an immigration detention center for several months.",
                "Land of the free home of the brave?",
                "Welcome to murica comrade, meet the new boss, same as old boss, enjoy your stay.",
                "Probably should have tried an actual functioning democracy.",
                "I would recommend they seek Asylum in one of the other 150+ countries in the world if they do not like the conditions here in the USA.",
                "They should have went to a free country.",
                "From Russia to Russia 2.0\n\nBad luck"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Social Security Administration to require in-person identity checks for new and existing recipients",
            "external_url": "https://apnews.com/article/social-security-fraud-waste-doge-elon-musk-212e3089951f731fd3f83443e104b315?utm_source=copy&utm_medium=share",
            "upvotes": 7796,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The waiting room is going to look like it did Beetlejuice.",
                "Didn’t they just close a bunch of SS offices?",
                "Now is the time to establish an identity on MySSA\n\nEveryone who has ever worked in the US should do that. You should be checking on your SSA earnings regularly long before you retire. Especially to make sure your employer is paying into it.\n\nEdit: it also detects identity theft of your SSN. If someone is using your SSN the contributions will show up.\n\nEdit2: the website is only open during their business hours.",
                "What are they gonna do for survivor beneficiaries? Have an 8 year old drag their parent’s body across the floor?",
                "WAKE UP.  while they cant slash the money going to your pockets directly yet, they are intentionally making things inaccessible and difficult for the people. Imagine the elders that have no internet, no reliable transportation, rely on physical mail. This is inhumane, almost like they wanna cull the people receiving entitled benefits. Except this is death by a thousand cuts. Sickening.",
                "Wow.\n\n  \nIt is already a hassle enough if you're in a decent sized metro area. Now imagine being in rural Nebraska and having to go identify in person at the SSA office...",
                "Ahh yes the old and disabled population, known for their high mobility and driving skills.\n\nFuck this country.",
                "Fucking over the core GOP constituency. That’s a bold strategy. Let’s see how it plays out for them.",
                "I waited on a call for 3 hours the other day to be told I had to go to the social security office in person and present some info to get an update, when I went to the office I was told I had to have an appointment and to call the same number I had the other day and there was no walk in appointments.. tried calling and they weren’t letting people sit on hold and to just call back later.. so I got no appointment.. this is going to be a shit show",
                "So they want a person who might be hospitalized to go to the social security administration to get their checks.  \n\nHe is like:  since they won’t let me end social security, I will make it impossible for people to get their checks."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "HOT",
            "title": "Hollywood director Carl Erik Rinsch charged with defrauding Netflix out of $11 million",
            "external_url": "https://www.cbsnews.com/news/netflix-fraud-charges-carl-erik-rinsch/",
            "upvotes": 1189,
            "date": "03/19/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/18/3245de75-577f-40d9-a141-ffee6cf17fe9/thumbnail/1200x630/83d8aafda39da35c6132ecc39d4aa57f/gettyimages-489721890.jpg?v=765ef194a4bf4701e45ec9d5712af42f",
            "top_comments": [
                "> From there, Rinsch spent about $10 million on personal expenses and luxury items in a spending spree that, according to prosecutors, included about $1.8 million on credit card bills; **$1 million on lawyers to sue Netflix for more money;** $3.7 million on furniture and antiques; $2.4 million for five Rolls-Royces and one Ferrari; and $652,000 on watches and clothes.   \n   \n   \nNow that’s audacious.",
                "> A Hollywood writer-director was arrested Tuesday on charges that he swindled $11 million from Netflix for a sci-fi show that never aired, instead steering the cash toward cryptocurrency investments and a series of lavish purchases that included a fleet of Rolls-Royces and a Ferrari.\n\n> Carl Erik Rinsch, perhaps best known for directing the film \"47 Ronin,\" has been charged with wire fraud and money laundering over what federal prosecutors allege was a scheme to defraud the streaming giant. [...]\n\n> Prosecutors said Netflix had initially paid about $44 million to purchase an unfinished show called \"White Horse\" from Rinsch, but eventually doled out another $11 million after he said he needed the additional cash to complete the show.\n\n> Rather than using the extra money to wrap up production, Rinsch quietly transferred the money to a personal brokerage account, where he made a series of failed investments that lost about half of the $11 million in two months, according to prosecutors.\n\nMakes massive investments with other people's money, loses money. Gambles in crypto, makes some profit, proceeds to buy luxury goods instead of paying his debts.\n\nThis man would be welcome on r/wallstreetbets.",
                ">A Hollywood writer-director was arrested Tuesday on charges that he swindled $11 million from Netflix for a sci-fi show that never aired, instead steering the cash toward cryptocurrency investments and a series of lavish purchases that included a fleet of Rolls-Royces and a Ferrari.\n\nA fleet? Who needs a fleet of Rolls-Royces?",
                "Bizarre \n\nHe was making millions legitimately.\n\nNow he’ll never work again and will be financially ruined.\n\nNetflix are clearly vulnerable to fraud and will want to make an example. Civil suits to follow!",
                "Hulu has acquired the rights to his story and will be releasing a limited series next year",
                "He was just using some good old-fashioned Hollywood accounting.",
                "Never trust a guy with a ponytail.\n\n  \n*puts hair under a cap*",
                "This is straight up mental illness.",
                "Can't wait for the Netflix movie about this.",
                "This guy’s Wikipedia page is a trip."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "ICE ‘disappeared’ 48 New Mexico residents, civil rights lawyers say",
            "external_url": "https://www.independent.co.uk/news/world/americas/us-politics/new-mexico-ice-arrests-aclu-complaint-b2717442.html",
            "upvotes": 22970,
            "date": "03/18/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/18/17/46/Immigration-Appointments-toos8eqy.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "[removed]",
                "Kidnapped. Time to start saying it as it is. The United States Government is kidnapping citizens.",
                "People are gonna have to start keeping a copy of their birth certificate on them at all times. Get pulled over.. open up a live video on social media immediately.",
                "This is the test everyone says they would have passed during world war 2, turning over humans do be disappeared or to hide and assist them at the risk of imprisonment yourself, we are gonna see the true moral character of those around us in the next few years",
                "A long but good quote from Aleksandr Solzhenitsyn's The Gulag Archipelago: \n\n\n\"And how we burned in the camps later, thinking: What would things have been like if every Security operative, when he went out at night to make an arrest, had been uncertain whether he would return alive and had to say good-bye to his family? \n\n\nOr if, during periods of mass arrests, as for example in Leningrad, when they arrested a quarter of the entire city, people had not simply sat there in their lairs, paling with terror at every bang of the downstairs door and at every step on the staircase, but had understood they had nothing left to lose and had boldly set up in the downstairs hall an ambush of half a dozen people with axes, hammers, pokers, or whatever else was at hand?...\n\n\n The Organs would very quickly have suffered a shortage of officers and transport and, notwithstanding all of Stalin's thirst, the cursed machine would have ground to a halt! If...if...We didn't love freedom enough. And even more – we had no awareness of the real situation.... We purely and simply deserved everything that happened afterward\"",
                "Only a matter of time before US citizens start \"disappearing\" as well. This administration has shown that it does not care about what the law or courts say, so there is no one to stop them from doing this.",
                "[removed]",
                "Did people forget we still have kids who we lost their parents for the last go around with Trump?",
                "We look at the gestabo and KGB and think to ourselves “how could they allow such evils?”",
                "We'll only discover the bodies after it's all over, just like every other fascist nightmare"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Tesla investor calls for Elon Musk to step down as boss | Money News",
            "external_url": "https://news.sky.com/story/tesla-investor-calls-for-elon-musk-to-step-down-as-boss-13331499",
            "upvotes": 88769,
            "date": "03/18/2025",
            "thumbnail": "https://e3.365dm.com/25/02/1600x900/skynews-washington-elon-musk_6827946.jpg?20250213175145",
            "top_comments": [
                "The crazy part is that Musk is “running” the company remotely.  Also known as telework or remote work.  Musk said remote/telework is immoral.",
                "Love this for him. He just broke the Guinness world record for losing the most amount of money in a certain amount of time.",
                "I mean, he *IS* tanking the brand. And he's not doing his job, since he has his fancy new \"government role\".\n\n\nI'm not sure he was ever doing anything to begin with, but now he is actively wrecking Tesla.\n\n\nETA: If you zoom in to this picture, he looks like MODOK.",
                "Stepping down won't matter.  As long as he's the controlling owner of Tesla, people will associate him with the company.",
                "[deleted]",
                "He has to step down from the government 1st.",
                "If the ceo of a company loses 800 BILLION market value, why on earth would you want to keep that guy around? ",
                "That brand is dead to me no matter what they do.",
                "He needs to rot in a cell the rest of his life.",
                "13 kids = Fine\n\nNazi Salute? = sure \n\nIllegally firing workers = totes cool \n\nBreak 100 laws? = Fine\n\nCruelty to the poor = Check, all good... \n\nRig election = Nothing to see here\n\nTank our Tesla stock --> YO... Listen MOFO you don't know who you are messing with you better step down."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Teslas set on fire with Molotov cocktails and shot with gun in Las Vegas attack",
            "external_url": "https://www.nbcnews.com/news/us-news/teslas-set-fire-molotov-cocktails-shot-las-vegas-attack-rcna196942",
            "upvotes": 19256,
            "date": "03/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250319-teslas-las-vegas-mn-0730-457429.jpg",
            "top_comments": [
                "These attacks aren't just happening in Vegas; they also seem to be taking place in other states. There was some incident in Kansas City where a Tesla dealership's CyberTrucks were lit up in a fire. Man it's getting crazy out there",
                "Imagine traveling back in time 6-8 years and telling someone that in 2025 there would be a group going around destroying EVs, and then trying to convince them it’s the left doing it lol",
                "It's getting kinda \"torch and pitchfork\" out there, huh?",
                "I read the Tesla vehicles are all paid actors.",
                "The stock tanking is a bigger statement IMO and I hope it goes down to pennies.",
                "[removed]",
                "its just locker room arson.",
                "EV fires are such a dangerous fire.  I feel bad for the first responders.",
                "Ellon hasn't even said \"thank you\" once",
                "[removed]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Google agrees to pay $28m in racial bias lawsuit",
            "external_url": "https://www.bbc.com/news/articles/c39v2ykwgdno",
            "upvotes": 477,
            "date": "03/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/fb5e/live/e2abefa0-047c-11f0-92d6-f71a165fc0b6.jpg",
            "top_comments": [
                "From the article: \"The practice of basing starting pay and job level on prior salaries reinforced historical race and ethnicity-based disparities, according to Ms Cantu's lawyers.\"\n\nWouldn't that mean Google inherited the employee's last employer's valuation of them as human resources?",
                "So, 0.01% of their annual revenue. Thatll teach em",
                "$4200, way to stick it to em. Lawyers are the real winners",
                "Not that i support google but this sounds like legal bullshit.",
                "Whichever lawyer convinced her this piece of shit had any legs to stand on in court is absolutely swimming in cash right now. Everyone else, not so much.",
                "Sounds like they need some DEI initiatives....",
                "equivalent to a parking ticket",
                "“Agrees” as if they were coerced or something.",
                "Just wait for a year to actually pay. Racial bias lawsuits will be illegal by then.",
                "Google better start setting a budget for these lawsuit payouts, especially now since they took back all their diversity and how not to be a piece of shit training for their company."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Canadian actor detained at US border in ‘inhumane conditions’ for nearly two weeks | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/18/canadian-actor-jasmine-mooney-detained-mexico-border",
            "upvotes": 5486,
            "date": "03/18/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4ae288c52a7a1cd5ef59fe67e17fa069035a1233/0_185_950_569/master/950.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=53d6335812338a4954a34b46c1979ff0",
            "top_comments": [
                "Why dont they just send these people home immediately. What is the point of holding them hostage?",
                "You would have to be crazy to come to the US these days.\n\n“Eagles told the Vancouver Sun that instead of sending her daughter to Canada or advising her to fix her application, US Customs and Border Protection officers arrested her.”",
                "I think this is the 3rd foreign national that was arrested and nearly “disappeared” instead of just denying entry.",
                "*... she was transferred to the San Luis detention center in Arizona,” Eagles said.   “They are housed together in a single concrete cell with no natural light, fluorescent lights that are never turned off, no mats, no blankets, and limited bathroom facilities.” Every time Mooney was transferred, she was handcuffed and in chains...*\n\nOf all the detention centers Mooney, this AZ one in San Luis had to be the worse.",
                "I wonder how long it will take before countries start updating their travel advisories for the US",
                "I'm still confused as to what actually happened here:\n\n\\> She has said she had a three-year US work visa, which her mother said was revoked as she attempted to travel back to Los Angeles, where she was living, after a holiday in [Canada](https://www.theguardian.com/world/canada). It was unclear why Mooney’s earlier visa was revoked, or why she was at the southern border this month. However, she told ABC she got her first visa at the San Ysidro border crossing on the advice of a Los Angeles attorney, who met her at the border, and therefore may have thought it would work a second time at that location.\n\nSo she's a Canadian who crossed the Mexican border with an incomplete visa and got held? I'm trying to understand the situation/",
                "Fox News used to run like weeklong specials about random white chicks that disappear.\n\nNow they're in the administration disappearing them.",
                "Somewhat amazing how quickly ICE went full fascist then again Bush filled the nascent agency with white nationalists and 20 years on those are all the supervisors, managers, and senior level people.",
                "I can hardly wait for the first time Dipshit Donnie tries to enter Canada and is instantly arrested and put in prison as a convicted felon trying to gain unlawful entry into Canada.",
                "What happened to you USA? You used to be cool. Now you like the \"Bumlord\". You're bringing everybody down, man. Stems and seeds, bother."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "I’m the Canadian who was detained by Ice for two weeks. It felt like I had been kidnapped",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/19/canadian-detained-us-immigration-jasmine-mooney",
            "upvotes": 33,
            "date": "03/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f41c61bf043a09effe0d6ca8cb365bf583a1460a/0_111_4284_2571/master/4284.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=79d62e0f80e19549ab2dbd708c10d801",
            "top_comments": [
                "She was kidnapped. \n\nAs an American, if I went to the Canadian border and was found to be unqualified for admittance, they'd turn my ass around and send me home. They wouldn't arrest me and truck me off to some gulag. \n\nThis lady was more than happy to pay for her flight home and sort shit out from there. Instead she was literally kidnapped. Ignoring the outright cruelty and evilness of it all. How is this good for America? How does this save taxpayer's money? This is beyond fucked and anyone arguing otherwise has cement for brains."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Large police presence near CIA headquarters",
            "external_url": "https://www.fox5dc.com/news/large-police-presence-near-cia-headquarters-police.amp",
            "upvotes": 175,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“FAIRFAX COUNTY, Va. - A barricade incident at CIA headquarters in McLean, VA has prompted a large police presence in the area. \n\nWhat we know:\nThere appears to be a SWAT team, Arlington County, and Fairfax County officials on the scene gearing up, along with other officials gearing down. A bomb squad also appears to be on the scene as well, it is unconfirmed if there is a bomb in the area. \n\nAccording to Fairfax County police, Dolley Madison Blvd is shut down in both directions between Georgetown Park and Savile Lane because of a barricade incident.“",
                "I suspect a lot of the response is nothing to do with the actual situation. There is a plan for incidents at CIA HQ and it's designed to deal with major incidents, but the rule is that if there's an incident, you follow the plan.",
                "I said from the beginning, the STUPIDEST thing they did with DOGE was to send them in there terminating and ticking off CIA and FBI organizations.  They'll get the same effect US CPA got by disbanding Saddam's Sunni elite guards.\n\nNot to mention ... they had NO IDEA WHAT THEY WERE DOING:\n\n“Why are American taxpayer dollars being spent to maintain empty buildings?” a 2024 post from the official Doge account reads.  \n\nLATER HEADLINE: ‘Secret CIA base mistakenly exposed in Doge government building sell-off’\n\n[https://www.yahoo.com/news/secret-cia-mistakenly-exposed-doge-205439724.html](https://www.yahoo.com/news/secret-cia-mistakenly-exposed-doge-205439724.html)",
                "Was it DOGE? Would be amusing if it was.",
                "[deleted]",
                "the fuck is a barricade incident?!",
                "Decent info here https://www.ffxnow.com/2025/03/19/developing-police-respond-to-cia-hq-in-mclean-for-barricade-incident/",
                "[removed]",
                "The terrorists are inside the government buildings.",
                "I was watching a stream and it showed a man sitting on a bench and then the stream started buffering."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "‘I escaped one gulag only to end up in another’: Russian asylum seekers face Ice detention in the US",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/i-escaped-one-gulag-only-to-end-up-in-another-russian-asylum-seekers-face-ice-detention-in-the-us",
            "upvotes": 1011,
            "date": "03/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d3986542f93dd806c8f7ce93c79795eb3114ad7/793_97_3207_1925/master/3207.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2a0101e0828ed798db1717bf821bbab6",
            "top_comments": [
                "I found the article and this quote interesting, did not know this fact!\n\n>For years, Russians have been among the top [five](https://tracreports.org/reports/751/) nationalities granted asylum (in the USA).",
                ">For years, he criticized Putin’s regime on Facebook, and he was detained twice at protests\n\nWell I guess now he knows why America shoved him into a Gulag.",
                "This reminds me of the guy who was in Hiroshima when the US dropped the bomb on it and he survived. He then fought his way through to Nagasaki where he had family. After days of walking he arrived in Nagasaki just in time to have the second nuclear bomb dropped on his head. He also survived the second one.\n\nNow I'm conflicted. Is he the luckiest guy to ever live or the unluckiest?",
                "This has been going on for  a while, I recall reading a story at least 25 years ago about a Scottish citizen who overstayed his tourist visa by a few days and ended up in an immigration detention center for several months.",
                "Land of the free home of the brave?",
                "Welcome to murica comrade, meet the new boss, same as old boss, enjoy your stay.",
                "Probably should have tried an actual functioning democracy.",
                "I would recommend they seek Asylum in one of the other 150+ countries in the world if they do not like the conditions here in the USA.",
                "They should have went to a free country.",
                "From Russia to Russia 2.0\n\nBad luck"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "JFK files released by Trump administration related to assassination",
            "external_url": "https://www.cbsnews.com/news/trump-jfk-assassination-files-released-2025/",
            "upvotes": 0,
            "date": "03/18/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/18/81d3b519-e87a-47c8-bc5a-7c9718c15fb2/thumbnail/1200x630g8/b40513c30df9362c1c7e32c9ee718f55/gettyimages-517330536.jpg?v=765ef194a4bf4701e45ec9d5712af42f",
            "top_comments": [
                "JFK Files released. Nothing new added to what we already know because these files were already released during the Biden administration.",
                "I am more interested in Epstein files than JFK.",
                "[removed]",
                "2/3 of the documents were not released. Even Trumps grand release of information is missing most of the information. Classic.",
                "Here’s hoping to reading the Trump files in the future! ",
                "Even if the files were released there's no guarantee they weren't tempered if not straight forged. So who cares really. People will still come up with theories anyway."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Russia and Ukraine report air attacks after Putin-Trump call",
            "external_url": "https://www.reuters.com/world/europe/russia-ukraine-trade-accusations-infrastructure-attacks-after-putin-trump-call-2025-03-19/",
            "upvotes": 120,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "But it was probably a big beautiful call, so that's all that;s important right?\n\n>  \n“They’re dying, Russians and Ukrainians. I want them to stop dying. And I’ll have that done — I’ll have that done in 24 hours.”\n\n* Donald Trump, At a CNN town hall in May 2023",
                "It was a phone sex call nothing more",
                "Trump will do nothing useful. Vance and Trump with their ambushes and slimy lies taken from Putin are figuratively wanking over the bodies of dead Ukrainian women and children while screaming at them it was all their fault. So, yeah, America’s fascist leaders don’t care anything about any republic and are visibly on a campaign of atrocities to force NATO to expel the US so we can attack Canada and Greenland with less resistance. Trump is best off with a stronger and more belligerent Russia menacing NATO and he and Putin know it."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Nicholas Prosper: Teenager who murdered mother and siblings and planned school massacre jailed for at least 49 years",
            "external_url": "https://news.sky.com/story/teenager-who-murdered-family-and-planned-school-massacre-jailed-for-at-least-49-years-13331045",
            "upvotes": 259,
            "date": "03/19/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-nicholas-prosper-mugshot_6861312.jpg?20250319132034",
            "top_comments": [
                "> Mrs Justice Cheema-Grubb said Prosper had not hated his mother or siblings and had \"had a good life with them\", but that his intention had been to kill them in their sleep and rape his sister.\nEach victim suffered the anguish of anticipating or being aware of the deaths of others,\" she said.\n\nHis siblings were 16 and 13. I cannot imagine the terror and betrayal his mother and siblings felt in their last moments. Hopefully they do not let him out at the minimum term, he should be jailed for as long as possible.",
                "The murders were in Luton, England, on 13 September 2024. I am surprised the trial was over so quickly, even with a confession.",
                "I mean he will never be released but should have been a whole life order. Why give someone even a slither of chance of doing it in his twilight hours.",
                "I don’t understand sentencing over there. I understand that they have strict human rights laws that affect life sentences but 3 people? Almost his entire family? He should never be released.",
                "The more I read about this the worse it gets...",
                "That's it? Put him away for much much longer",
                "[deleted]"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "US ‘deletes evidence’ of Russia’s kidnap of thousands of Ukrainian children",
            "external_url": "https://www.independent.co.uk/news/world/europe/trump-ukraine-children-russia-war-kidnapping-evidence-b2717730.html",
            "upvotes": 4755,
            "date": "03/19/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/18/13/58/SEI244319340.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "Great. Our actions are now complicity.",
                "Summary:\n\nThe US State Department allegedly deleted evidence collected by Yale University’s Humanitarian Research Lab, which was tracking Russian war crimes, including the abduction of 35,000 Ukrainian children. The deletion has hindered efforts to rescue the children and prosecute those responsible, including Russian President Vladimir Putin. The Yale project, funded by the US government until last month, monitored 116 sites in Russia using satellite imagery and other surveillance tools.\n\nSources suggest the deletion may have been accidental or intentional, raising potential legal risks for the Trump administration under international war crimes laws. The lost data was also being shared with the EU for its own investigations. The destruction of evidence not only affects legal cases but also complicates ongoing rescue missions.\n\nThe Yale project played a key role in gathering evidence that contributed to six ICC indictments, including against Putin and his commissioner for children’s rights. Russia has been accused of forcibly transferring Ukrainian children, issuing Russian passports in occupied areas, and erasing Ukrainian identity. The loss of the secure “Caesar” database has been described as a violation of the Geneva Convention, which prohibits destroying war crimes evidence. The US State Department has yet to respond.",
                "Greenlighting child abductions. \n\nFeeling free and brave yet, republicans?",
                "Just a reminder that Trump pardoned more known pedophiles than any other US President in history",
                "US goverment supports genocide.",
                "This is disgusting and heartbreaking and I hope every single person that voted for Trump has this shoved in their face. You are part of the reason this war criminal gets to continue to tear families apart and these children, THESE CHILDREN, may never see their families again.",
                "Very sad thing to read about...",
                "Not super familiar with International wartime law... but isn't covering up a war crime a war crime?",
                "i really hope some kind of back up  have been sent to partners outside us",
                "MAGA are pro rape, molestation and trafficking."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Google agrees to pay $28m in racial bias lawsuit",
            "external_url": "https://www.bbc.com/news/articles/c39v2ykwgdno",
            "upvotes": 476,
            "date": "03/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/fb5e/live/e2abefa0-047c-11f0-92d6-f71a165fc0b6.jpg",
            "top_comments": [
                "From the article: \"The practice of basing starting pay and job level on prior salaries reinforced historical race and ethnicity-based disparities, according to Ms Cantu's lawyers.\"\n\nWouldn't that mean Google inherited the employee's last employer's valuation of them as human resources?",
                "So, 0.01% of their annual revenue. Thatll teach em",
                "$4200, way to stick it to em. Lawyers are the real winners",
                "Not that i support google but this sounds like legal bullshit.",
                "Whichever lawyer convinced her this piece of shit had any legs to stand on in court is absolutely swimming in cash right now. Everyone else, not so much.",
                "Sounds like they need some DEI initiatives....",
                "equivalent to a parking ticket",
                "“Agrees” as if they were coerced or something.",
                "Just wait for a year to actually pay. Racial bias lawsuits will be illegal by then.",
                "Google better start setting a budget for these lawsuit payouts, especially now since they took back all their diversity and how not to be a piece of shit training for their company."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Hollywood director Carl Erik Rinsch charged with defrauding Netflix out of $11 million",
            "external_url": "https://www.cbsnews.com/news/netflix-fraud-charges-carl-erik-rinsch/",
            "upvotes": 1195,
            "date": "03/19/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/18/3245de75-577f-40d9-a141-ffee6cf17fe9/thumbnail/1200x630/83d8aafda39da35c6132ecc39d4aa57f/gettyimages-489721890.jpg?v=765ef194a4bf4701e45ec9d5712af42f",
            "top_comments": [
                "> From there, Rinsch spent about $10 million on personal expenses and luxury items in a spending spree that, according to prosecutors, included about $1.8 million on credit card bills; **$1 million on lawyers to sue Netflix for more money;** $3.7 million on furniture and antiques; $2.4 million for five Rolls-Royces and one Ferrari; and $652,000 on watches and clothes.   \n   \n   \nNow that’s audacious.",
                "> A Hollywood writer-director was arrested Tuesday on charges that he swindled $11 million from Netflix for a sci-fi show that never aired, instead steering the cash toward cryptocurrency investments and a series of lavish purchases that included a fleet of Rolls-Royces and a Ferrari.\n\n> Carl Erik Rinsch, perhaps best known for directing the film \"47 Ronin,\" has been charged with wire fraud and money laundering over what federal prosecutors allege was a scheme to defraud the streaming giant. [...]\n\n> Prosecutors said Netflix had initially paid about $44 million to purchase an unfinished show called \"White Horse\" from Rinsch, but eventually doled out another $11 million after he said he needed the additional cash to complete the show.\n\n> Rather than using the extra money to wrap up production, Rinsch quietly transferred the money to a personal brokerage account, where he made a series of failed investments that lost about half of the $11 million in two months, according to prosecutors.\n\nMakes massive investments with other people's money, loses money. Gambles in crypto, makes some profit, proceeds to buy luxury goods instead of paying his debts.\n\nThis man would be welcome on r/wallstreetbets.",
                ">A Hollywood writer-director was arrested Tuesday on charges that he swindled $11 million from Netflix for a sci-fi show that never aired, instead steering the cash toward cryptocurrency investments and a series of lavish purchases that included a fleet of Rolls-Royces and a Ferrari.\n\nA fleet? Who needs a fleet of Rolls-Royces?",
                "Bizarre \n\nHe was making millions legitimately.\n\nNow he’ll never work again and will be financially ruined.\n\nNetflix are clearly vulnerable to fraud and will want to make an example. Civil suits to follow!",
                "Hulu has acquired the rights to his story and will be releasing a limited series next year",
                "He was just using some good old-fashioned Hollywood accounting.",
                "Never trust a guy with a ponytail.\n\n  \n*puts hair under a cap*",
                "This is straight up mental illness.",
                "Can't wait for the Netflix movie about this.",
                "This guy’s Wikipedia page is a trip."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Turkish cenbank sells record amount of FX after lira plunges, bankers say",
            "external_url": "https://www.reuters.com/markets/currencies/turkish-cenbank-sells-record-amount-fx-after-lira-plunges-bankers-say-2025-03-19/",
            "upvotes": 47,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Türkiye is going through difficult times today, especially after the arrest of the mayor of Istanbul.",
                "Keep a watchful eye on this.  The stupid shit that Erdogan orders is just as dumb if not dumber than the actions tRump has planned."
            ],
            "aggregate_sentiment": 27.0
        },
        {
            "category": "RISING",
            "title": "‘I escaped one gulag only to end up in another’: Russian asylum seekers face Ice detention in the US",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/i-escaped-one-gulag-only-to-end-up-in-another-russian-asylum-seekers-face-ice-detention-in-the-us",
            "upvotes": 1014,
            "date": "03/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d3986542f93dd806c8f7ce93c79795eb3114ad7/793_97_3207_1925/master/3207.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2a0101e0828ed798db1717bf821bbab6",
            "top_comments": [
                "I found the article and this quote interesting, did not know this fact!\n\n>For years, Russians have been among the top [five](https://tracreports.org/reports/751/) nationalities granted asylum (in the USA).",
                ">For years, he criticized Putin’s regime on Facebook, and he was detained twice at protests\n\nWell I guess now he knows why America shoved him into a Gulag.",
                "This reminds me of the guy who was in Hiroshima when the US dropped the bomb on it and he survived. He then fought his way through to Nagasaki where he had family. After days of walking he arrived in Nagasaki just in time to have the second nuclear bomb dropped on his head. He also survived the second one.\n\nNow I'm conflicted. Is he the luckiest guy to ever live or the unluckiest?",
                "This has been going on for  a while, I recall reading a story at least 25 years ago about a Scottish citizen who overstayed his tourist visa by a few days and ended up in an immigration detention center for several months.",
                "Land of the free home of the brave?",
                "Welcome to murica comrade, meet the new boss, same as old boss, enjoy your stay.",
                "Probably should have tried an actual functioning democracy.",
                "I would recommend they seek Asylum in one of the other 150+ countries in the world if they do not like the conditions here in the USA.",
                "They should have went to a free country.",
                "From Russia to Russia 2.0\n\nBad luck"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US ‘deletes evidence’ of Russia’s kidnap of thousands of Ukrainian children",
            "external_url": "https://www.independent.co.uk/news/world/europe/trump-ukraine-children-russia-war-kidnapping-evidence-b2717730.html",
            "upvotes": 4762,
            "date": "03/19/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/18/13/58/SEI244319340.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "Great. Our actions are now complicity.",
                "Summary:\n\nThe US State Department allegedly deleted evidence collected by Yale University’s Humanitarian Research Lab, which was tracking Russian war crimes, including the abduction of 35,000 Ukrainian children. The deletion has hindered efforts to rescue the children and prosecute those responsible, including Russian President Vladimir Putin. The Yale project, funded by the US government until last month, monitored 116 sites in Russia using satellite imagery and other surveillance tools.\n\nSources suggest the deletion may have been accidental or intentional, raising potential legal risks for the Trump administration under international war crimes laws. The lost data was also being shared with the EU for its own investigations. The destruction of evidence not only affects legal cases but also complicates ongoing rescue missions.\n\nThe Yale project played a key role in gathering evidence that contributed to six ICC indictments, including against Putin and his commissioner for children’s rights. Russia has been accused of forcibly transferring Ukrainian children, issuing Russian passports in occupied areas, and erasing Ukrainian identity. The loss of the secure “Caesar” database has been described as a violation of the Geneva Convention, which prohibits destroying war crimes evidence. The US State Department has yet to respond.",
                "Greenlighting child abductions. \n\nFeeling free and brave yet, republicans?",
                "Just a reminder that Trump pardoned more known pedophiles than any other US President in history",
                "US goverment supports genocide.",
                "This is disgusting and heartbreaking and I hope every single person that voted for Trump has this shoved in their face. You are part of the reason this war criminal gets to continue to tear families apart and these children, THESE CHILDREN, may never see their families again.",
                "Very sad thing to read about...",
                "Not super familiar with International wartime law... but isn't covering up a war crime a war crime?",
                "i really hope some kind of back up  have been sent to partners outside us",
                "MAGA are pro rape, molestation and trafficking."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Nicholas Prosper: Teenager who murdered mother and siblings and planned school massacre jailed for at least 49 years",
            "external_url": "https://news.sky.com/story/teenager-who-murdered-family-and-planned-school-massacre-jailed-for-at-least-49-years-13331045",
            "upvotes": 260,
            "date": "03/19/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-nicholas-prosper-mugshot_6861312.jpg?20250319132034",
            "top_comments": [
                "> Mrs Justice Cheema-Grubb said Prosper had not hated his mother or siblings and had \"had a good life with them\", but that his intention had been to kill them in their sleep and rape his sister.\nEach victim suffered the anguish of anticipating or being aware of the deaths of others,\" she said.\n\nHis siblings were 16 and 13. I cannot imagine the terror and betrayal his mother and siblings felt in their last moments. Hopefully they do not let him out at the minimum term, he should be jailed for as long as possible.",
                "The murders were in Luton, England, on 13 September 2024. I am surprised the trial was over so quickly, even with a confession.",
                "I mean he will never be released but should have been a whole life order. Why give someone even a slither of chance of doing it in his twilight hours.",
                "I don’t understand sentencing over there. I understand that they have strict human rights laws that affect life sentences but 3 people? Almost his entire family? He should never be released.",
                "The more I read about this the worse it gets...",
                "That's it? Put him away for much much longer",
                "[deleted]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Ben & Jerry's claims Unilever ousted its boss over political activism",
            "external_url": "https://www.bbc.com/news/articles/ckg8pk9rpx4o",
            "upvotes": 13359,
            "date": "03/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d7be/live/d33cbd20-0485-11f0-9776-23d43d9c7fe7.jpg",
            "top_comments": [
                "It doesn’t look like this has gone through yet according to the article. Guess we will see what the independent board decides.",
                "Back in the 80s, Ben & Jerry’s had a corporate 5 - 1 plan.  The highest paid employee (including CEO) could make no more than 5 times the salary of the lowest paid employee.",
                "Buy an activism by design brand then fire the activists. Sounds about right.",
                "Sounds like the parent company violated the agreements they had with Ben and Jerry’s. It’s always been a politically active brand. ",
                "Did they really think selling their brand to a corporation would end any other way?",
                "\"It comes a month after the ice cream company accused Unilever of demanding that it stops publicly criticising US [Supreme Leader] Donald Trump.\" \n\nWell... you know what to do.\n\n https://en.m.wikipedia.org/wiki/List_of_Unilever_brands",
                "“Mr Stever has been with Ben & Jerry’s since joining the firm in 1988 as a tour guide. He was appointed chief executive in 2023.”\n\nHoly shit this rules.",
                "B+J is a very good example of why a company shouldn't go public.",
                "Stop letting billionaires buy your companies if you don’t want them to control your companies",
                "The Americone Dream is over."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Google agrees to pay $28m in racial bias lawsuit",
            "external_url": "https://www.bbc.com/news/articles/c39v2ykwgdno",
            "upvotes": 476,
            "date": "03/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/fb5e/live/e2abefa0-047c-11f0-92d6-f71a165fc0b6.jpg",
            "top_comments": [
                "From the article: \"The practice of basing starting pay and job level on prior salaries reinforced historical race and ethnicity-based disparities, according to Ms Cantu's lawyers.\"\n\nWouldn't that mean Google inherited the employee's last employer's valuation of them as human resources?",
                "So, 0.01% of their annual revenue. Thatll teach em",
                "$4200, way to stick it to em. Lawyers are the real winners",
                "Not that i support google but this sounds like legal bullshit.",
                "Whichever lawyer convinced her this piece of shit had any legs to stand on in court is absolutely swimming in cash right now. Everyone else, not so much.",
                "Sounds like they need some DEI initiatives....",
                "equivalent to a parking ticket",
                "“Agrees” as if they were coerced or something.",
                "Just wait for a year to actually pay. Racial bias lawsuits will be illegal by then.",
                "Google better start setting a budget for these lawsuit payouts, especially now since they took back all their diversity and how not to be a piece of shit training for their company."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Turkey detains Erdogan's main rival on array of charges",
            "external_url": "https://www.reuters.com/world/middle-east/turkish-authorities-order-detention-istanbul-mayor-some-100-others-2025-03-19/",
            "upvotes": 769,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It is really sad to see so many countries across the world sink into the depths of authoritarianism and dictatorship. These are truly dark times.",
                "Erdogan detains Erdogan's main rival\n\nFtfy",
                "This will soon happen in the US if we're not proactive...let it be a valuable lesson",
                "Classic dictator move. Any potential rival who is too popular suddenly gets into legal trouble.",
                "I am sure the same will happen in the states.",
                "Coming soon to America, sadly.",
                "I'm Turkish and this is the deep point of unlawfulness. There is no law anymore. He really wants to turn the country into Russia or North Korea, in which only he could be the one and only leader, until he's dead.\n\nMind you, this mayor is indeed Erdogan's strongest rival and won Istanbul elections 3 times. Don't underestimate the amount of people in Turkey who are against Erdogan.",
                "America in the next \"election\"",
                "The rise of dictatorships everywhere is appaling...",
                "I'm grateful for them to behave openly like that, otherwise some people might be under the illusion Turkey should enter the EU, despite them being not European, openly aggressive to Greece... Without the location they would never ever be part of NATO tbw."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Hollywood director Carl Erik Rinsch charged with defrauding Netflix out of $11 million",
            "external_url": "https://www.cbsnews.com/news/netflix-fraud-charges-carl-erik-rinsch/",
            "upvotes": 1195,
            "date": "03/19/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/18/3245de75-577f-40d9-a141-ffee6cf17fe9/thumbnail/1200x630/83d8aafda39da35c6132ecc39d4aa57f/gettyimages-489721890.jpg?v=765ef194a4bf4701e45ec9d5712af42f",
            "top_comments": [
                "> From there, Rinsch spent about $10 million on personal expenses and luxury items in a spending spree that, according to prosecutors, included about $1.8 million on credit card bills; **$1 million on lawyers to sue Netflix for more money;** $3.7 million on furniture and antiques; $2.4 million for five Rolls-Royces and one Ferrari; and $652,000 on watches and clothes.   \n   \n   \nNow that’s audacious.",
                "> A Hollywood writer-director was arrested Tuesday on charges that he swindled $11 million from Netflix for a sci-fi show that never aired, instead steering the cash toward cryptocurrency investments and a series of lavish purchases that included a fleet of Rolls-Royces and a Ferrari.\n\n> Carl Erik Rinsch, perhaps best known for directing the film \"47 Ronin,\" has been charged with wire fraud and money laundering over what federal prosecutors allege was a scheme to defraud the streaming giant. [...]\n\n> Prosecutors said Netflix had initially paid about $44 million to purchase an unfinished show called \"White Horse\" from Rinsch, but eventually doled out another $11 million after he said he needed the additional cash to complete the show.\n\n> Rather than using the extra money to wrap up production, Rinsch quietly transferred the money to a personal brokerage account, where he made a series of failed investments that lost about half of the $11 million in two months, according to prosecutors.\n\nMakes massive investments with other people's money, loses money. Gambles in crypto, makes some profit, proceeds to buy luxury goods instead of paying his debts.\n\nThis man would be welcome on r/wallstreetbets.",
                ">A Hollywood writer-director was arrested Tuesday on charges that he swindled $11 million from Netflix for a sci-fi show that never aired, instead steering the cash toward cryptocurrency investments and a series of lavish purchases that included a fleet of Rolls-Royces and a Ferrari.\n\nA fleet? Who needs a fleet of Rolls-Royces?",
                "Bizarre \n\nHe was making millions legitimately.\n\nNow he’ll never work again and will be financially ruined.\n\nNetflix are clearly vulnerable to fraud and will want to make an example. Civil suits to follow!",
                "Hulu has acquired the rights to his story and will be releasing a limited series next year",
                "He was just using some good old-fashioned Hollywood accounting.",
                "Never trust a guy with a ponytail.\n\n  \n*puts hair under a cap*",
                "This is straight up mental illness.",
                "Can't wait for the Netflix movie about this.",
                "This guy’s Wikipedia page is a trip."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Social Security Administration to require in-person identity checks for new and existing recipients",
            "external_url": "https://apnews.com/article/social-security-fraud-waste-doge-elon-musk-212e3089951f731fd3f83443e104b315?utm_source=copy&utm_medium=share",
            "upvotes": 7808,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The waiting room is going to look like it did Beetlejuice.",
                "Didn’t they just close a bunch of SS offices?",
                "Now is the time to establish an identity on MySSA\n\nEveryone who has ever worked in the US should do that. You should be checking on your SSA earnings regularly long before you retire. Especially to make sure your employer is paying into it.\n\nEdit: it also detects identity theft of your SSN. If someone is using your SSN the contributions will show up.\n\nEdit2: the website is only open during their business hours.",
                "What are they gonna do for survivor beneficiaries? Have an 8 year old drag their parent’s body across the floor?",
                "WAKE UP.  while they cant slash the money going to your pockets directly yet, they are intentionally making things inaccessible and difficult for the people. Imagine the elders that have no internet, no reliable transportation, rely on physical mail. This is inhumane, almost like they wanna cull the people receiving entitled benefits. Except this is death by a thousand cuts. Sickening.",
                "Wow.\n\n  \nIt is already a hassle enough if you're in a decent sized metro area. Now imagine being in rural Nebraska and having to go identify in person at the SSA office...",
                "Ahh yes the old and disabled population, known for their high mobility and driving skills.\n\nFuck this country.",
                "Fucking over the core GOP constituency. That’s a bold strategy. Let’s see how it plays out for them.",
                "I waited on a call for 3 hours the other day to be told I had to go to the social security office in person and present some info to get an update, when I went to the office I was told I had to have an appointment and to call the same number I had the other day and there was no walk in appointments.. tried calling and they weren’t letting people sit on hold and to just call back later.. so I got no appointment.. this is going to be a shit show",
                "So they want a person who might be hospitalized to go to the social security administration to get their checks.  \n\nHe is like:  since they won’t let me end social security, I will make it impossible for people to get their checks."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "ICE ‘disappeared’ 48 New Mexico residents, civil rights lawyers say",
            "external_url": "https://www.independent.co.uk/news/world/americas/us-politics/new-mexico-ice-arrests-aclu-complaint-b2717442.html",
            "upvotes": 22972,
            "date": "03/18/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/18/17/46/Immigration-Appointments-toos8eqy.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "[removed]",
                "Kidnapped. Time to start saying it as it is. The United States Government is kidnapping citizens.",
                "People are gonna have to start keeping a copy of their birth certificate on them at all times. Get pulled over.. open up a live video on social media immediately.",
                "This is the test everyone says they would have passed during world war 2, turning over humans do be disappeared or to hide and assist them at the risk of imprisonment yourself, we are gonna see the true moral character of those around us in the next few years",
                "A long but good quote from Aleksandr Solzhenitsyn's The Gulag Archipelago: \n\n\n\"And how we burned in the camps later, thinking: What would things have been like if every Security operative, when he went out at night to make an arrest, had been uncertain whether he would return alive and had to say good-bye to his family? \n\n\nOr if, during periods of mass arrests, as for example in Leningrad, when they arrested a quarter of the entire city, people had not simply sat there in their lairs, paling with terror at every bang of the downstairs door and at every step on the staircase, but had understood they had nothing left to lose and had boldly set up in the downstairs hall an ambush of half a dozen people with axes, hammers, pokers, or whatever else was at hand?...\n\n\n The Organs would very quickly have suffered a shortage of officers and transport and, notwithstanding all of Stalin's thirst, the cursed machine would have ground to a halt! If...if...We didn't love freedom enough. And even more – we had no awareness of the real situation.... We purely and simply deserved everything that happened afterward\"",
                "Only a matter of time before US citizens start \"disappearing\" as well. This administration has shown that it does not care about what the law or courts say, so there is no one to stop them from doing this.",
                "[removed]",
                "Did people forget we still have kids who we lost their parents for the last go around with Trump?",
                "We look at the gestabo and KGB and think to ourselves “how could they allow such evils?”",
                "We'll only discover the bodies after it's all over, just like every other fascist nightmare"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Tesla investor calls for Elon Musk to step down as boss | Money News",
            "external_url": "https://news.sky.com/story/tesla-investor-calls-for-elon-musk-to-step-down-as-boss-13331499",
            "upvotes": 88772,
            "date": "03/18/2025",
            "thumbnail": "https://e3.365dm.com/25/02/1600x900/skynews-washington-elon-musk_6827946.jpg?20250213175145",
            "top_comments": [
                "The crazy part is that Musk is “running” the company remotely.  Also known as telework or remote work.  Musk said remote/telework is immoral.",
                "Love this for him. He just broke the Guinness world record for losing the most amount of money in a certain amount of time.",
                "I mean, he *IS* tanking the brand. And he's not doing his job, since he has his fancy new \"government role\".\n\n\nI'm not sure he was ever doing anything to begin with, but now he is actively wrecking Tesla.\n\n\nETA: If you zoom in to this picture, he looks like MODOK.",
                "Stepping down won't matter.  As long as he's the controlling owner of Tesla, people will associate him with the company.",
                "[deleted]",
                "He has to step down from the government 1st.",
                "If the ceo of a company loses 800 BILLION market value, why on earth would you want to keep that guy around? ",
                "That brand is dead to me no matter what they do.",
                "He needs to rot in a cell the rest of his life.",
                "13 kids = Fine\n\nNazi Salute? = sure \n\nIllegally firing workers = totes cool \n\nBreak 100 laws? = Fine\n\nCruelty to the poor = Check, all good... \n\nRig election = Nothing to see here\n\nTank our Tesla stock --> YO... Listen MOFO you don't know who you are messing with you better step down."
            ],
            "aggregate_sentiment": 0.0
        }
    ],
    "last_updated": "03/19/2025 16:10:40 UTC"
}