{
    "posts": [
        {
            "category": "HOT",
            "title": "Former police chief, serving murder and rape sentences, escapes from Arkansas prison.",
            "external_url": "https://apnews.com/article/police-chief-arkansas-prison-escape-grant-hardin-280127e9737bc8e8e0d6388d7f268bd1",
            "upvotes": 3302,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Grant Hardin briefly served as the police chief in Gateway, a small town near the Missouri border, in 2016. He also held several other law enforcement positions in the state beginning in the 1990s. He was terminated multiple times, and trailed by reports of excessive force and poor performance. Hardin was a police officer in Eureka Springs, but resigned on October 4, 1996, after being told that he would be fired for falsifying a police report. He went on to serve as a constable for District 1 from 2009 to 2010 and 2013 to 2014. He later worked as correctional officer at the Northwest Arkansas Community Correction Center.\n\nIn February 2017, Hardin shot and killed 59-year-old James Appleton. According to an affidavit filed in the case, Appleton worked for the Gateway water department and was talking to his brother-in-law, then Gateway Mayor Andrew Tillman, when he was shot in the head near Garfield. His body was found inside a car. Hardin was charged with capital murder, but later pleaded guilty to a lesser charge of first degree murder and was sentenced to 30 years in prison. In court, he apologized, but never explained why he killed Appleton.\n\n>\"I wish I knew the motive. Grant Hardin is the only one that knows. He did not have the courage to tell it.\"\n\nWhile in prison, Hardin was tied to an unsolved rape case from the 1990s. According to an affidavit filed in that case, Amy Harrison, an elementary schoolteacher and the wife of a police officer in Rogers, Arkansas, had arrived at her classroom on November 9, 1997, to prepare for the week. When she was leaving, she was confronted by a man who raped her at gunpoint. The attack occurred around the same time as a community church service down the hall. After Hardin went to prison, he was found to be a match for the DNA.\n\nIn 2018, Hardin pleaded guilty to rape and had 25 years added to his sentence.",
                "Crazy to be seeing this considering my grandfather was the mayor of this town. The woman he raped was the teacher of my mother and father. I don’t live in the area anymore, but it’s crazy he got out. He was a very violent man. I even had a conversation with him at Gateway park. He used to sit there in the parking lot at nights and waited for high school kids to come in their vehicles to have sex, and watch. (This was fairly common) My best friend and his wife had this happen to them at the park. This guy is a certified freak, and I hope they find him.",
                "Don't worry. They'll find him working as a police chief one county over.",
                "I wonder if this will get wall to wall coverage like the guys in New Orleans who escaped",
                "So when's his cabinet appointment?",
                "So did everyone decide to break out of prison in the same month or",
                "These are the types of people the police keep hiring, THINK ABOUT THAT.",
                "It’s easy to believe that a police chief would have connections within the judicial system. Prison guards are often in courtrooms, bringing defendants in. If this is foul play, who knows how hard the men of the Arkansas police forces would look for this guy. I would hope “damned hard.”",
                "Escaped, or was set loose?",
                "Sounds like he has prison guard accomplices."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Duck Dynasty founding father Phil Robertson dies at 79",
            "external_url": "https://www.nbcnews.com/news/obituaries/duck-dynasty-founding-father-phil-robertson-dies-79-rcna209035",
            "upvotes": 2622,
            "date": "05/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250526-Phil-Robertson-DD-RS-408024.jpg",
            "top_comments": [
                "My son lived in the area and they idolized this family in Monroe. We went to the shop and saw the family leave and run away to their very expensive estates. \n\nI can say they did actually run the business, but hillbillies from the bayou they were not. They were a rich southern Christian family cosplaying for television. \n\nI was far less irritated about the circus effect it had on the community; there was a lot of tourist money involved there, than I was the outright juxtaposition between their actual lives versus their fame",
                "What's crazy is he went to college and played QB and a very high level",
                "Goldnecks: rich people who like pretending they're just some country boys",
                "Is that the super racist one?",
                "Hmmmm… a grifting father of a family of grifters no longer alive to grift. \n\nSo, what’s everyone doing for Memorial Day?",
                "When that racist, homophobic piece of crap gets to the pearly gates there's going to be a big old padlock on them. It's going to be quite tropical where he's going.",
                "Today in \"News That Will Have Absolutely No Impact on Your Life Whatsoever\".....",
                "And the world improved ever so slightly.",
                "What's everyone having for breakfast?",
                "And nothing of great value was lost."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Ex-police chief escapes from Arkansas prison where he was serving murder, rape sentences",
            "external_url": "https://www.cbsnews.com/news/grant-hardin-arkansas-prison-escape/",
            "upvotes": 4934,
            "date": "05/26/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/26/c4e4b220-3f6d-437e-87ce-45f405a660b9/thumbnail/1200x630/0dae33da6db213d4a59f739177cb86f5/screenshot-2025-05-25-at-9-50-46-pm.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                ">[KFSM reported in 2019](https://www.5newsonline.com/article/news/local/outreach/back-to-school/former-police-chief-convicted-murderer-pleads-guilty-to-raping-rogers-teacher-in-1997/527-accc272d-e94b-4c00-b9cb-6a4ee5e42125) that police in 2003 used DNA samples from the rape victim's clothes to apply for a \"John Doe\" warrant since the statute of limitations was close to expiring. Investigators eventually got a match after Hardin was imprisoned for Appleton's killing.\n\nMurders someone, then his DNA sample during processing matches a rape case.\n\nWinning through and through.",
                "Hardin pleaded guilty in October 2017 to first-degree murder in connection with the shooting death of 59-year-old James Appleton. According to an affidavit filed in the case, Appleton worked for the Gateway water department and was talking to his brother-in-law, then-Gateway Mayor Andrew Tillman, when he was shot in the head on Feb. 23, 2017, near Garfield. Police found Appleton's body inside a car.",
                "“Ex-police chief, who escaped from prison for rape and murder sentences, is found as the new police chief a town in a neighboring state”",
                "What's with all the prison breaks that have been happening lately? Have there actually been more of them, or is the news just reporting on them because they're trending? Or is the *Prison Break* reboot going hard with its marketing?",
                "Totally “accidentally”",
                "Wouldn't he have been out of genpop for being a former cop anyway? How he escaped has to either be a serious fuck up or extremely daring.",
                "he likely just knew the layout and knew exactly what was needed to go with no fuss. \n\ni worked in a psych ward for a few years and realize im not exempt to being subjected to a place like this if i decided on a whim that i was done. if i had landed in the facility i worked i'd probably beg them not to take me to this particular place, mostly out of embarrassment, specifically telling them that i know the entire layout and how to get out if i needed to. this highlights the flaw in the system. if i told them this en route, they wouldnt care. its not their problem. the intake department might have some concerns, but the facility manager would likely pass it off as some random manic episode. they certainly wouldnt check records, because the paycheck of holding someone is the single most important factor for them.\n\ni left that job btw, because someone on another unit successfully committed suicide on their watch. this is literally the most important part of our job, but they wanted to cut corners, and go against doctors orders to save a few dollars. the only positive takeaway i have from the entire situation that it wasnt my unit. i only heard things. never interacted with the individual myself...",
                "Gonna end up dead soon.",
                "Am I crazy or have there been a significant increase in prison escapes over the last 3 months.",
                "Pretty sure there’s Datelines, and a few YouTube docs about this guys case"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump delays 50% tariffs on EU to July 9",
            "external_url": "https://www.cnbc.com/2025/05/25/trump-50percent-tariffs-eu-july-9.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
            "upvotes": 15072,
            "date": "05/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108150321-1748213510226-AP20021497359027.jpg?v=1748213621&w=1920&h=1080",
            "top_comments": [
                "No way. What, wow. Did not see that coming.",
                "Another day, another method to manipulate the markets.",
                "Come Tuesday, it will be 100% tariffs on the EU, then by Friday they will be delayed again.  Guaranteed the Trump family will make millions this week",
                "We've seen this movie already. First time was shitty by the way",
                "Friendly reminder that Congress could stop this at any time. They, specifically Republicans, are actively choosing not to, likely because they are also benefiting from this blatant market manipulation.",
                "Today. Tomorrow it will take effect immediately. On Thursday he will double it if a single European citizen complains about US tariffs. Friday he will have forgotten about all of the tariffs and will wonder why European citizens are cold to his administration until his aides remind him, which he will at first deny, and then go on an hours long xenophobic rant, claiming Latvian as the next new state, and quadruple the already doubled tariffs. Repeat.",
                "lol they saw stock market futures and said yah, no.... this is the fat nixon market manipulation cycle of walking back tariffs so they never get imposed when his bluff is called. now the markets will be happy on Tuesday. i guess our judicial system is ignoring this blatant illegal activity like god sleeping through the holocaust",
                "Is it really a delay if you were never going to do it in the first place? If so, then I'm announcing my decision to delay my upcoming date with Margot Robbie.",
                "Trump’s foreign policy strategy: threaten fire, then call it a favor when you delay the match.",
                "Insider trading go brrr."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "National parks ordered to police negative history under Trump directive",
            "external_url": "https://www.sfgate.com/california-parks/article/national-parks-negative-history-trump-20343308.php",
            "upvotes": 22954,
            "date": "05/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So, we're in the, \"Report your neighbor for wrong think,\" phase.",
                "It's so interesting how statues are history that can't be challenged, but actual history needs to be hidden.",
                "\"The battle of Gettysburg was a decisive win for the confederacy.   Afterwards both sides celebrated with dancing and singing to the historic tune \"YMCA\" by the legendary people of the village. \"",
                "History is *supposed* to make you uncomfortable.",
                "[removed]",
                "Negative history... like his administration?",
                "“Those who cannot remember the past are condemned to repeat it.” – George Santayana, The Life of Reason, 1905",
                "“The signs will state that the property belongs to the American people and ask visitors to report any areas in need of repair, services requiring improvement, or signage and information that present past or living Americans in a negative light or “fail to emphasize the beauty, grandeur, and abundance of the natural landscape,””\n\nSo this is about finding signs that don’t glaze America enough? To what standard? Are we going to ask Elon’s AI to grade each sign and rank it by how good the glaze is?",
                "So let me guess, countrywide its going to start being taught as \"The War of Northern Aggression\" and how the Union cruelly stole Blacks \"happiness in slavery.\" Or perhaps something about how Americans never harmed Native Americans and always honored their treaties. You know, just straight up ignore history so Cletus doesn't have to feel uncomfortable. ",
                "Executive order for revisionist history thats certainly something "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Japan flight made emergency landing after man tried opening door",
            "external_url": "https://www.bbc.com/news/articles/cgmjzlj0g30o",
            "upvotes": 840,
            "date": "05/26/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4d40/live/c8831680-3a0f-11f0-a4ca-c350ccf42b30.jpg",
            "top_comments": [
                "Just in case anyone is wondering, it's basically impossible to open the doors of a commercial airliner at altitude. They open inward first before swinging out, and the interior of the aircraft is pressurized when flying, forcing the door into its frame. That pressure applies too much interior force to the door for a human to overcome and prevents it from opening.",
                "When my sister flew with Air New Zealand as a stewardess, she relates how a gentleman came up to her in the galley, and asked if he could get off. He said he’d had enough of flying and just wanted off. He was subsequently gently sedated.",
                "A Japanese plane headed from Tokyo to Texas had to make an emergency landing after a passenger tried to open one of its doors during the flight.\n\nAll Nippon Airways (ANA) Flight 114 was diverted to Seattle hours after taking off on Saturday \"due to an unruly passenger\", the airline said.\n\nPort of Seattle police told media they had been notified of a man who \"attempted to open exit doors during the flight\".",
                "I keep seeing headlines about people doing this. Whats actually happening with these people? What “medical crisis” makes someone think they can just open a door and get off an airplane in mid-air? Are they on weird sleep/anxiety medications and having some sort of reaction or episode? Are they crazy and having a delusion?",
                "A lot of very not-normal people going to Japan for trips recently. It makes me not want to go just to not contribute to their disrespectful tourist epidemic, even if I'd never be of that group.",
                "It’s coming to the point where I am constantly seeing people not knowing how to behave or being dangerous on flights that I wouldn’t be surprised if you had to have a background check and interview to be allowed on planes in the future",
                "You're not in the movie Air Force One, brother.",
                "Odd, when you realise it's the altitude holding the door closed.",
                "Intrusive thoughts win again!",
                "Unless they can fly or survived fallen from high attitude, those are just dumb clueless people who probably in their first flight."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "WWII bomber crash left 11 dead and ‘non-recoverable.’ 4 are finally coming home",
            "external_url": "https://apnews.com/article/american-bomber-wwii-remains-divers-212ba07efdab40941f09026c79fdb5c0",
            "upvotes": 265,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Sheppick, 26, and Tennyson, 24, each left behind pregnant wives who would sometimes write them two or three letters a day. Darrigan, 26, also was married, and had been able to attend his son’s baptism while on leave. A photo shows him in uniform, smiling as he holds the boy.\n\n>Darrigan’s wife, Florence, remarried but quietly held on to photos of her late husband, as well as a telegram informing her of his death.\n\n>Tennyson’s wife, Jean, lived until age 96 and never remarried.\n\n>“She never stopped believing that he was going to come home,” said her grandson, Scott Jefferson.\n\nSo rough on the families too. Glad they were able to help bring closure for some of them.",
                "Their bomber was called *'Heaven Can Wait'*. Thank you gentlemen. Youe wait is over.",
                "Welcome home gentlemen. Rest in peace - your service shall not be forgotten."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Texas moves forward with expansive social media ban for minors, reigniting debate over platform restrictions",
            "external_url": "https://www.nbcnews.com/news/rcna208238",
            "upvotes": 204,
            "date": "05/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250521-child-cell-phone-vl-135p-9747c0.jpg",
            "top_comments": [
                "This has very little to do with minors, and everything to do with collecting data that matches 'anonymous' usernames to real people's full data including all ID information.\n\nMuch like porn sites are currently required to do, all social media sites will be required to collect official government ID information from every single user.",
                "Ahhh Texas, land of big government and religion in your uterus, bedroom, and computer/phone.",
                "Small govt amirite fellas",
                "Something something about out parents making their own decisions for their kids. The nanny state strikes again.",
                "I still don’t see how this can be enforced without major privacy concerns.",
                "Ah! This must be the \"small government\" they're always touting!",
                "No social media, no porn, no weed and forced religion on the children. So much freedom in TX!!",
                "Trump is going to be pretty upset if Texas bans everyone under 18 from truth social",
                "Texas to burn 4 witches at the stake after failing the sink or swim test.",
                "This law is going to be abused to hell and back. People who hate or don't get anime will target comic book stores. Not to mention all the references to Japanese culture will be blown out of proportion."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "At least 11 hospitalized after shooting in South Carolina: Police",
            "external_url": "https://abcnews.go.com/US/11-hospitalized-after-shooting-river-south-carolina-police/story?id=122186737",
            "upvotes": 1422,
            "date": "05/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/4e481934-8b15-42bf-a8bf-b2032c7df4b2/sc_1748230661591_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Seems it was a drunken dispute that escalated in a crowded area, not a targeted attack but still early.",
                "No information other than the shooting taking place on a street in a town 30 minutes away from Myrtle Beach.\n\n11 people injured is kind of a fucking lot though",
                "Good ol’ Bike Week! This is why I’ve never been in my life. Someone gets killed EVERY year. Someone just got killed on Thursday night out there. Thought they’d make it through the rest of the weekend but damn. Not surprised.",
                "This is clearly fake, South Carolina is a staunchly conservative state, and I was told just this week that it's only Liberal areas with such crime.\n\n*Nice try, liberal media.*\n\nYes, I'm being facetious.",
                "Jesus Christ stop fuckin shooting people you ASSHOLES",
                "In Little River there have always been a lot of guns and a lot of alcohol its never a good combination.",
                "Summer fun is starting.",
                "Maybe this time thought and prayers will do something",
                "be american on memorial day weekend\n\nget shot",
                "Oh well they like mass shooting deaths down there that's why they keep voting for em."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Comic book legend Peter David dies after series of health issues at age 68",
            "external_url": "https://www.the-independent.com/arts-entertainment/books/news/peter-david-death-cause-hulk-b2757683.html",
            "upvotes": 2662,
            "date": "05/25/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/25/21/48/Peter-David.jpeg?trim=105,0,272,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "> Family friend restarted GoFundMe to help raise money for medical expenses after he was rejected from Medicaid",
                "He's one of the greats of Marvel. He redefined the Hulk, and his run on X-Factor was terrific.  He had a knack for deep diving into Marvel characters that were two-dimensional and redefining them as people. By the time his run was complete, we knew who The Multiple Man was, for example.\n\nVale, Peter David, writer of Stuff.",
                "Why would someone be denied Medicaid? That's ridiculous.",
                "He wrote some of the best Star Trek novels.\n\nVendetta, Imzadi and Q-Squared were mainstays when I was a kid. \n\nRest easy PAD, Writer of Stuff.",
                "If you read comics in the '90s and didn't cry, laugh, and rethink reality a little, you werent reading Peter David.\n\nHe wrote Spider-Man 2099, but honestly, he was always about 30 years ahead of everyone else anyway.",
                "He has a far-reaching legacy.  This is being discussed on r/babylon5 also.",
                "He wrote some of the best Star Trek novels - I always enjoyed his Deep Space Nine ones and his original creation New Frontier. He was incredibly witty and would insert all sorts of jokes into them. \n\nHe wrote for many genres and it was easy to see he was a full-blown geek who was very passionate about his fandoms - he just did what so many of us wish we could do and made a living doing it. \n\nRIP to a legend of sci-fi and fantasy literature.",
                "He was one of the first online comic authors.  Back in 1990-1991, he and a few others were part of FidoNet, answering questions and regaling other users with stories.  And that doesn't even start to include all the great comics and novels he produced.  We've lost a great one.",
                "This is such a weird little thing but it’s stuck with me forever, there is a Star Trek novel he wrote that I read when I was a kid and for no apparent thematic reason he made all the aliens or one planet have names that come from the Seder plate, like used in Passover. Like their names are Maror, Charoset, Karpas and Matza if I remember correctly. Such a weird choice it’s stuck in my head forever",
                "The greatest health system in the whole world!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Texas moves forward with expansive social media ban for minors, reigniting debate over platform restrictions",
            "external_url": "https://www.nbcnews.com/news/rcna208238",
            "upvotes": 203,
            "date": "05/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250521-child-cell-phone-vl-135p-9747c0.jpg",
            "top_comments": [
                "This has very little to do with minors, and everything to do with collecting data that matches 'anonymous' usernames to real people's full data including all ID information.\n\nMuch like porn sites are currently required to do, all social media sites will be required to collect official government ID information from every single user.",
                "Ahhh Texas, land of big government and religion in your uterus, bedroom, and computer/phone.",
                "Small govt amirite fellas",
                "Something something about out parents making their own decisions for their kids. The nanny state strikes again.",
                "I still don’t see how this can be enforced without major privacy concerns.",
                "Ah! This must be the \"small government\" they're always touting!",
                "No social media, no porn, no weed and forced religion on the children. So much freedom in TX!!",
                "Trump is going to be pretty upset if Texas bans everyone under 18 from truth social",
                "Texas to burn 4 witches at the stake after failing the sink or swim test.",
                "This law is going to be abused to hell and back. People who hate or don't get anime will target comic book stores. Not to mention all the references to Japanese culture will be blown out of proportion."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "WWII bomber crash left 11 dead and ‘non-recoverable.’ 4 are finally coming home",
            "external_url": "https://apnews.com/article/american-bomber-wwii-remains-divers-212ba07efdab40941f09026c79fdb5c0",
            "upvotes": 266,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Sheppick, 26, and Tennyson, 24, each left behind pregnant wives who would sometimes write them two or three letters a day. Darrigan, 26, also was married, and had been able to attend his son’s baptism while on leave. A photo shows him in uniform, smiling as he holds the boy.\n\n>Darrigan’s wife, Florence, remarried but quietly held on to photos of her late husband, as well as a telegram informing her of his death.\n\n>Tennyson’s wife, Jean, lived until age 96 and never remarried.\n\n>“She never stopped believing that he was going to come home,” said her grandson, Scott Jefferson.\n\nSo rough on the families too. Glad they were able to help bring closure for some of them.",
                "Their bomber was called *'Heaven Can Wait'*. Thank you gentlemen. Youe wait is over.",
                "Welcome home gentlemen. Rest in peace - your service shall not be forgotten."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Former police chief, serving murder and rape sentences, escapes from Arkansas prison.",
            "external_url": "https://apnews.com/article/police-chief-arkansas-prison-escape-grant-hardin-280127e9737bc8e8e0d6388d7f268bd1",
            "upvotes": 3323,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Grant Hardin briefly served as the police chief in Gateway, a small town near the Missouri border, in 2016. He also held several other law enforcement positions in the state beginning in the 1990s. He was terminated multiple times, and trailed by reports of excessive force and poor performance. Hardin was a police officer in Eureka Springs, but resigned on October 4, 1996, after being told that he would be fired for falsifying a police report. He went on to serve as a constable for District 1 from 2009 to 2010 and 2013 to 2014. He later worked as correctional officer at the Northwest Arkansas Community Correction Center.\n\nIn February 2017, Hardin shot and killed 59-year-old James Appleton. According to an affidavit filed in the case, Appleton worked for the Gateway water department and was talking to his brother-in-law, then Gateway Mayor Andrew Tillman, when he was shot in the head near Garfield. His body was found inside a car. Hardin was charged with capital murder, but later pleaded guilty to a lesser charge of first degree murder and was sentenced to 30 years in prison. In court, he apologized, but never explained why he killed Appleton.\n\n>\"I wish I knew the motive. Grant Hardin is the only one that knows. He did not have the courage to tell it.\"\n\nWhile in prison, Hardin was tied to an unsolved rape case from the 1990s. According to an affidavit filed in that case, Amy Harrison, an elementary schoolteacher and the wife of a police officer in Rogers, Arkansas, had arrived at her classroom on November 9, 1997, to prepare for the week. When she was leaving, she was confronted by a man who raped her at gunpoint. The attack occurred around the same time as a community church service down the hall. After Hardin went to prison, he was found to be a match for the DNA.\n\nIn 2018, Hardin pleaded guilty to rape and had 25 years added to his sentence.",
                "Crazy to be seeing this considering my grandfather was the mayor of this town. The woman he raped was the teacher of my mother and father. I don’t live in the area anymore, but it’s crazy he got out. He was a very violent man. I even had a conversation with him at Gateway park. He used to sit there in the parking lot at nights and waited for high school kids to come in their vehicles to have sex, and watch. (This was fairly common) My best friend and his wife had this happen to them at the park. This guy is a certified freak, and I hope they find him.",
                "Don't worry. They'll find him working as a police chief one county over.",
                "I wonder if this will get wall to wall coverage like the guys in New Orleans who escaped",
                "So when's his cabinet appointment?",
                "So did everyone decide to break out of prison in the same month or",
                "These are the types of people the police keep hiring, THINK ABOUT THAT.",
                "It’s easy to believe that a police chief would have connections within the judicial system. Prison guards are often in courtrooms, bringing defendants in. If this is foul play, who knows how hard the men of the Arkansas police forces would look for this guy. I would hope “damned hard.”",
                "Escaped, or was set loose?",
                "Sounds like he has prison guard accomplices."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Duck Dynasty founding father Phil Robertson dies at 79",
            "external_url": "https://www.nbcnews.com/news/obituaries/duck-dynasty-founding-father-phil-robertson-dies-79-rcna209035",
            "upvotes": 2624,
            "date": "05/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250526-Phil-Robertson-DD-RS-408024.jpg",
            "top_comments": [
                "My son lived in the area and they idolized this family in Monroe. We went to the shop and saw the family leave and run away to their very expensive estates. \n\nI can say they did actually run the business, but hillbillies from the bayou they were not. They were a rich southern Christian family cosplaying for television. \n\nI was far less irritated about the circus effect it had on the community; there was a lot of tourist money involved there, than I was the outright juxtaposition between their actual lives versus their fame",
                "What's crazy is he went to college and played QB and a very high level",
                "Goldnecks: rich people who like pretending they're just some country boys",
                "Is that the super racist one?",
                "Hmmmm… a grifting father of a family of grifters no longer alive to grift. \n\nSo, what’s everyone doing for Memorial Day?",
                "When that racist, homophobic piece of crap gets to the pearly gates there's going to be a big old padlock on them. It's going to be quite tropical where he's going.",
                "Today in \"News That Will Have Absolutely No Impact on Your Life Whatsoever\".....",
                "And the world improved ever so slightly.",
                "What's everyone having for breakfast?",
                "And nothing of great value was lost."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Japan flight made emergency landing after man tried opening door",
            "external_url": "https://www.bbc.com/news/articles/cgmjzlj0g30o",
            "upvotes": 846,
            "date": "05/26/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4d40/live/c8831680-3a0f-11f0-a4ca-c350ccf42b30.jpg",
            "top_comments": [
                "Just in case anyone is wondering, it's basically impossible to open the doors of a commercial airliner at altitude. They open inward first before swinging out, and the interior of the aircraft is pressurized when flying, forcing the door into its frame. That pressure applies too much interior force to the door for a human to overcome and prevents it from opening.",
                "When my sister flew with Air New Zealand as a stewardess, she relates how a gentleman came up to her in the galley, and asked if he could get off. He said he’d had enough of flying and just wanted off. He was subsequently gently sedated.",
                "A Japanese plane headed from Tokyo to Texas had to make an emergency landing after a passenger tried to open one of its doors during the flight.\n\nAll Nippon Airways (ANA) Flight 114 was diverted to Seattle hours after taking off on Saturday \"due to an unruly passenger\", the airline said.\n\nPort of Seattle police told media they had been notified of a man who \"attempted to open exit doors during the flight\".",
                "I keep seeing headlines about people doing this. Whats actually happening with these people? What “medical crisis” makes someone think they can just open a door and get off an airplane in mid-air? Are they on weird sleep/anxiety medications and having some sort of reaction or episode? Are they crazy and having a delusion?",
                "A lot of very not-normal people going to Japan for trips recently. It makes me not want to go just to not contribute to their disrespectful tourist epidemic, even if I'd never be of that group.",
                "It’s coming to the point where I am constantly seeing people not knowing how to behave or being dangerous on flights that I wouldn’t be surprised if you had to have a background check and interview to be allowed on planes in the future",
                "You're not in the movie Air Force One, brother.",
                "Odd, when you realise it's the altitude holding the door closed.",
                "Intrusive thoughts win again!",
                "Unless they can fly or survived fallen from high attitude, those are just dumb clueless people who probably in their first flight."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Ex-police chief escapes from Arkansas prison where he was serving murder, rape sentences",
            "external_url": "https://www.cbsnews.com/news/grant-hardin-arkansas-prison-escape/",
            "upvotes": 4923,
            "date": "05/26/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/26/c4e4b220-3f6d-437e-87ce-45f405a660b9/thumbnail/1200x630/0dae33da6db213d4a59f739177cb86f5/screenshot-2025-05-25-at-9-50-46-pm.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                ">[KFSM reported in 2019](https://www.5newsonline.com/article/news/local/outreach/back-to-school/former-police-chief-convicted-murderer-pleads-guilty-to-raping-rogers-teacher-in-1997/527-accc272d-e94b-4c00-b9cb-6a4ee5e42125) that police in 2003 used DNA samples from the rape victim's clothes to apply for a \"John Doe\" warrant since the statute of limitations was close to expiring. Investigators eventually got a match after Hardin was imprisoned for Appleton's killing.\n\nMurders someone, then his DNA sample during processing matches a rape case.\n\nWinning through and through.",
                "Hardin pleaded guilty in October 2017 to first-degree murder in connection with the shooting death of 59-year-old James Appleton. According to an affidavit filed in the case, Appleton worked for the Gateway water department and was talking to his brother-in-law, then-Gateway Mayor Andrew Tillman, when he was shot in the head on Feb. 23, 2017, near Garfield. Police found Appleton's body inside a car.",
                "“Ex-police chief, who escaped from prison for rape and murder sentences, is found as the new police chief a town in a neighboring state”",
                "What's with all the prison breaks that have been happening lately? Have there actually been more of them, or is the news just reporting on them because they're trending? Or is the *Prison Break* reboot going hard with its marketing?",
                "Totally “accidentally”",
                "Wouldn't he have been out of genpop for being a former cop anyway? How he escaped has to either be a serious fuck up or extremely daring.",
                "he likely just knew the layout and knew exactly what was needed to go with no fuss. \n\ni worked in a psych ward for a few years and realize im not exempt to being subjected to a place like this if i decided on a whim that i was done. if i had landed in the facility i worked i'd probably beg them not to take me to this particular place, mostly out of embarrassment, specifically telling them that i know the entire layout and how to get out if i needed to. this highlights the flaw in the system. if i told them this en route, they wouldnt care. its not their problem. the intake department might have some concerns, but the facility manager would likely pass it off as some random manic episode. they certainly wouldnt check records, because the paycheck of holding someone is the single most important factor for them.\n\ni left that job btw, because someone on another unit successfully committed suicide on their watch. this is literally the most important part of our job, but they wanted to cut corners, and go against doctors orders to save a few dollars. the only positive takeaway i have from the entire situation that it wasnt my unit. i only heard things. never interacted with the individual myself...",
                "Gonna end up dead soon.",
                "Am I crazy or have there been a significant increase in prison escapes over the last 3 months.",
                "Pretty sure there’s Datelines, and a few YouTube docs about this guys case"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "At least 11 hospitalized after shooting in South Carolina: Police",
            "external_url": "https://abcnews.go.com/US/11-hospitalized-after-shooting-river-south-carolina-police/story?id=122186737",
            "upvotes": 1418,
            "date": "05/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/4e481934-8b15-42bf-a8bf-b2032c7df4b2/sc_1748230661591_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Seems it was a drunken dispute that escalated in a crowded area, not a targeted attack but still early.",
                "No information other than the shooting taking place on a street in a town 30 minutes away from Myrtle Beach.\n\n11 people injured is kind of a fucking lot though",
                "Good ol’ Bike Week! This is why I’ve never been in my life. Someone gets killed EVERY year. Someone just got killed on Thursday night out there. Thought they’d make it through the rest of the weekend but damn. Not surprised.",
                "This is clearly fake, South Carolina is a staunchly conservative state, and I was told just this week that it's only Liberal areas with such crime.\n\n*Nice try, liberal media.*\n\nYes, I'm being facetious.",
                "Jesus Christ stop fuckin shooting people you ASSHOLES",
                "In Little River there have always been a lot of guns and a lot of alcohol its never a good combination.",
                "Summer fun is starting.",
                "Maybe this time thought and prayers will do something",
                "be american on memorial day weekend\n\nget shot",
                "Oh well they like mass shooting deaths down there that's why they keep voting for em."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Comic book legend Peter David dies after series of health issues at age 68",
            "external_url": "https://www.the-independent.com/arts-entertainment/books/news/peter-david-death-cause-hulk-b2757683.html",
            "upvotes": 2662,
            "date": "05/25/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/25/21/48/Peter-David.jpeg?trim=105,0,272,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "> Family friend restarted GoFundMe to help raise money for medical expenses after he was rejected from Medicaid",
                "He's one of the greats of Marvel. He redefined the Hulk, and his run on X-Factor was terrific.  He had a knack for deep diving into Marvel characters that were two-dimensional and redefining them as people. By the time his run was complete, we knew who The Multiple Man was, for example.\n\nVale, Peter David, writer of Stuff.",
                "Why would someone be denied Medicaid? That's ridiculous.",
                "He wrote some of the best Star Trek novels.\n\nVendetta, Imzadi and Q-Squared were mainstays when I was a kid. \n\nRest easy PAD, Writer of Stuff.",
                "If you read comics in the '90s and didn't cry, laugh, and rethink reality a little, you werent reading Peter David.\n\nHe wrote Spider-Man 2099, but honestly, he was always about 30 years ahead of everyone else anyway.",
                "He has a far-reaching legacy.  This is being discussed on r/babylon5 also.",
                "He wrote some of the best Star Trek novels - I always enjoyed his Deep Space Nine ones and his original creation New Frontier. He was incredibly witty and would insert all sorts of jokes into them. \n\nHe wrote for many genres and it was easy to see he was a full-blown geek who was very passionate about his fandoms - he just did what so many of us wish we could do and made a living doing it. \n\nRIP to a legend of sci-fi and fantasy literature.",
                "He was one of the first online comic authors.  Back in 1990-1991, he and a few others were part of FidoNet, answering questions and regaling other users with stories.  And that doesn't even start to include all the great comics and novels he produced.  We've lost a great one.",
                "This is such a weird little thing but it’s stuck with me forever, there is a Star Trek novel he wrote that I read when I was a kid and for no apparent thematic reason he made all the aliens or one planet have names that come from the Seder plate, like used in Passover. Like their names are Maror, Charoset, Karpas and Matza if I remember correctly. Such a weird choice it’s stuck in my head forever",
                "The greatest health system in the whole world!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump delays 50% tariffs on EU to July 9",
            "external_url": "https://www.cnbc.com/2025/05/25/trump-50percent-tariffs-eu-july-9.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
            "upvotes": 15073,
            "date": "05/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108150321-1748213510226-AP20021497359027.jpg?v=1748213621&w=1920&h=1080",
            "top_comments": [
                "No way. What, wow. Did not see that coming.",
                "Another day, another method to manipulate the markets.",
                "Come Tuesday, it will be 100% tariffs on the EU, then by Friday they will be delayed again.  Guaranteed the Trump family will make millions this week",
                "We've seen this movie already. First time was shitty by the way",
                "Friendly reminder that Congress could stop this at any time. They, specifically Republicans, are actively choosing not to, likely because they are also benefiting from this blatant market manipulation.",
                "Today. Tomorrow it will take effect immediately. On Thursday he will double it if a single European citizen complains about US tariffs. Friday he will have forgotten about all of the tariffs and will wonder why European citizens are cold to his administration until his aides remind him, which he will at first deny, and then go on an hours long xenophobic rant, claiming Latvian as the next new state, and quadruple the already doubled tariffs. Repeat.",
                "lol they saw stock market futures and said yah, no.... this is the fat nixon market manipulation cycle of walking back tariffs so they never get imposed when his bluff is called. now the markets will be happy on Tuesday. i guess our judicial system is ignoring this blatant illegal activity like god sleeping through the holocaust",
                "Is it really a delay if you were never going to do it in the first place? If so, then I'm announcing my decision to delay my upcoming date with Margot Robbie.",
                "Trump’s foreign policy strategy: threaten fire, then call it a favor when you delay the match.",
                "Insider trading go brrr."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "National parks ordered to police negative history under Trump directive",
            "external_url": "https://www.sfgate.com/california-parks/article/national-parks-negative-history-trump-20343308.php",
            "upvotes": 22949,
            "date": "05/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So, we're in the, \"Report your neighbor for wrong think,\" phase.",
                "It's so interesting how statues are history that can't be challenged, but actual history needs to be hidden.",
                "\"The battle of Gettysburg was a decisive win for the confederacy.   Afterwards both sides celebrated with dancing and singing to the historic tune \"YMCA\" by the legendary people of the village. \"",
                "History is *supposed* to make you uncomfortable.",
                "[removed]",
                "Negative history... like his administration?",
                "“Those who cannot remember the past are condemned to repeat it.” – George Santayana, The Life of Reason, 1905",
                "“The signs will state that the property belongs to the American people and ask visitors to report any areas in need of repair, services requiring improvement, or signage and information that present past or living Americans in a negative light or “fail to emphasize the beauty, grandeur, and abundance of the natural landscape,””\n\nSo this is about finding signs that don’t glaze America enough? To what standard? Are we going to ask Elon’s AI to grade each sign and rank it by how good the glaze is?",
                "So let me guess, countrywide its going to start being taught as \"The War of Northern Aggression\" and how the Union cruelly stole Blacks \"happiness in slavery.\" Or perhaps something about how Americans never harmed Native Americans and always honored their treaties. You know, just straight up ignore history so Cletus doesn't have to feel uncomfortable. ",
                "Executive order for revisionist history thats certainly something "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Texas moves forward with expansive social media ban for minors, reigniting debate over platform restrictions",
            "external_url": "https://www.nbcnews.com/news/rcna208238",
            "upvotes": 203,
            "date": "05/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250521-child-cell-phone-vl-135p-9747c0.jpg",
            "top_comments": [
                "This has very little to do with minors, and everything to do with collecting data that matches 'anonymous' usernames to real people's full data including all ID information.\n\nMuch like porn sites are currently required to do, all social media sites will be required to collect official government ID information from every single user.",
                "Ahhh Texas, land of big government and religion in your uterus, bedroom, and computer/phone.",
                "Small govt amirite fellas",
                "Something something about out parents making their own decisions for their kids. The nanny state strikes again.",
                "I still don’t see how this can be enforced without major privacy concerns.",
                "Ah! This must be the \"small government\" they're always touting!",
                "No social media, no porn, no weed and forced religion on the children. So much freedom in TX!!",
                "Trump is going to be pretty upset if Texas bans everyone under 18 from truth social",
                "Texas to burn 4 witches at the stake after failing the sink or swim test.",
                "This law is going to be abused to hell and back. People who hate or don't get anime will target comic book stores. Not to mention all the references to Japanese culture will be blown out of proportion."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Former police chief, serving murder and rape sentences, escapes from Arkansas prison.",
            "external_url": "https://apnews.com/article/police-chief-arkansas-prison-escape-grant-hardin-280127e9737bc8e8e0d6388d7f268bd1",
            "upvotes": 3323,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Grant Hardin briefly served as the police chief in Gateway, a small town near the Missouri border, in 2016. He also held several other law enforcement positions in the state beginning in the 1990s. He was terminated multiple times, and trailed by reports of excessive force and poor performance. Hardin was a police officer in Eureka Springs, but resigned on October 4, 1996, after being told that he would be fired for falsifying a police report. He went on to serve as a constable for District 1 from 2009 to 2010 and 2013 to 2014. He later worked as correctional officer at the Northwest Arkansas Community Correction Center.\n\nIn February 2017, Hardin shot and killed 59-year-old James Appleton. According to an affidavit filed in the case, Appleton worked for the Gateway water department and was talking to his brother-in-law, then Gateway Mayor Andrew Tillman, when he was shot in the head near Garfield. His body was found inside a car. Hardin was charged with capital murder, but later pleaded guilty to a lesser charge of first degree murder and was sentenced to 30 years in prison. In court, he apologized, but never explained why he killed Appleton.\n\n>\"I wish I knew the motive. Grant Hardin is the only one that knows. He did not have the courage to tell it.\"\n\nWhile in prison, Hardin was tied to an unsolved rape case from the 1990s. According to an affidavit filed in that case, Amy Harrison, an elementary schoolteacher and the wife of a police officer in Rogers, Arkansas, had arrived at her classroom on November 9, 1997, to prepare for the week. When she was leaving, she was confronted by a man who raped her at gunpoint. The attack occurred around the same time as a community church service down the hall. After Hardin went to prison, he was found to be a match for the DNA.\n\nIn 2018, Hardin pleaded guilty to rape and had 25 years added to his sentence.",
                "Crazy to be seeing this considering my grandfather was the mayor of this town. The woman he raped was the teacher of my mother and father. I don’t live in the area anymore, but it’s crazy he got out. He was a very violent man. I even had a conversation with him at Gateway park. He used to sit there in the parking lot at nights and waited for high school kids to come in their vehicles to have sex, and watch. (This was fairly common) My best friend and his wife had this happen to them at the park. This guy is a certified freak, and I hope they find him.",
                "Don't worry. They'll find him working as a police chief one county over.",
                "I wonder if this will get wall to wall coverage like the guys in New Orleans who escaped",
                "So when's his cabinet appointment?",
                "So did everyone decide to break out of prison in the same month or",
                "These are the types of people the police keep hiring, THINK ABOUT THAT.",
                "It’s easy to believe that a police chief would have connections within the judicial system. Prison guards are often in courtrooms, bringing defendants in. If this is foul play, who knows how hard the men of the Arkansas police forces would look for this guy. I would hope “damned hard.”",
                "Escaped, or was set loose?",
                "Sounds like he has prison guard accomplices."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "WWII bomber crash left 11 dead and ‘non-recoverable.’ 4 are finally coming home",
            "external_url": "https://apnews.com/article/american-bomber-wwii-remains-divers-212ba07efdab40941f09026c79fdb5c0",
            "upvotes": 267,
            "date": "05/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Sheppick, 26, and Tennyson, 24, each left behind pregnant wives who would sometimes write them two or three letters a day. Darrigan, 26, also was married, and had been able to attend his son’s baptism while on leave. A photo shows him in uniform, smiling as he holds the boy.\n\n>Darrigan’s wife, Florence, remarried but quietly held on to photos of her late husband, as well as a telegram informing her of his death.\n\n>Tennyson’s wife, Jean, lived until age 96 and never remarried.\n\n>“She never stopped believing that he was going to come home,” said her grandson, Scott Jefferson.\n\nSo rough on the families too. Glad they were able to help bring closure for some of them.",
                "Their bomber was called *'Heaven Can Wait'*. Thank you gentlemen. Youe wait is over.",
                "Welcome home gentlemen. Rest in peace - your service shall not be forgotten."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Duck Dynasty founding father Phil Robertson dies at 79",
            "external_url": "https://www.nbcnews.com/news/obituaries/duck-dynasty-founding-father-phil-robertson-dies-79-rcna209035",
            "upvotes": 2621,
            "date": "05/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250526-Phil-Robertson-DD-RS-408024.jpg",
            "top_comments": [
                "My son lived in the area and they idolized this family in Monroe. We went to the shop and saw the family leave and run away to their very expensive estates. \n\nI can say they did actually run the business, but hillbillies from the bayou they were not. They were a rich southern Christian family cosplaying for television. \n\nI was far less irritated about the circus effect it had on the community; there was a lot of tourist money involved there, than I was the outright juxtaposition between their actual lives versus their fame",
                "What's crazy is he went to college and played QB and a very high level",
                "Goldnecks: rich people who like pretending they're just some country boys",
                "Is that the super racist one?",
                "Hmmmm… a grifting father of a family of grifters no longer alive to grift. \n\nSo, what’s everyone doing for Memorial Day?",
                "When that racist, homophobic piece of crap gets to the pearly gates there's going to be a big old padlock on them. It's going to be quite tropical where he's going.",
                "Today in \"News That Will Have Absolutely No Impact on Your Life Whatsoever\".....",
                "And the world improved ever so slightly.",
                "What's everyone having for breakfast?",
                "And nothing of great value was lost."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Ex-police chief escapes from Arkansas prison where he was serving murder, rape sentences",
            "external_url": "https://www.cbsnews.com/news/grant-hardin-arkansas-prison-escape/",
            "upvotes": 4924,
            "date": "05/26/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/26/c4e4b220-3f6d-437e-87ce-45f405a660b9/thumbnail/1200x630/0dae33da6db213d4a59f739177cb86f5/screenshot-2025-05-25-at-9-50-46-pm.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                ">[KFSM reported in 2019](https://www.5newsonline.com/article/news/local/outreach/back-to-school/former-police-chief-convicted-murderer-pleads-guilty-to-raping-rogers-teacher-in-1997/527-accc272d-e94b-4c00-b9cb-6a4ee5e42125) that police in 2003 used DNA samples from the rape victim's clothes to apply for a \"John Doe\" warrant since the statute of limitations was close to expiring. Investigators eventually got a match after Hardin was imprisoned for Appleton's killing.\n\nMurders someone, then his DNA sample during processing matches a rape case.\n\nWinning through and through.",
                "Hardin pleaded guilty in October 2017 to first-degree murder in connection with the shooting death of 59-year-old James Appleton. According to an affidavit filed in the case, Appleton worked for the Gateway water department and was talking to his brother-in-law, then-Gateway Mayor Andrew Tillman, when he was shot in the head on Feb. 23, 2017, near Garfield. Police found Appleton's body inside a car.",
                "“Ex-police chief, who escaped from prison for rape and murder sentences, is found as the new police chief a town in a neighboring state”",
                "What's with all the prison breaks that have been happening lately? Have there actually been more of them, or is the news just reporting on them because they're trending? Or is the *Prison Break* reboot going hard with its marketing?",
                "Totally “accidentally”",
                "Wouldn't he have been out of genpop for being a former cop anyway? How he escaped has to either be a serious fuck up or extremely daring.",
                "he likely just knew the layout and knew exactly what was needed to go with no fuss. \n\ni worked in a psych ward for a few years and realize im not exempt to being subjected to a place like this if i decided on a whim that i was done. if i had landed in the facility i worked i'd probably beg them not to take me to this particular place, mostly out of embarrassment, specifically telling them that i know the entire layout and how to get out if i needed to. this highlights the flaw in the system. if i told them this en route, they wouldnt care. its not their problem. the intake department might have some concerns, but the facility manager would likely pass it off as some random manic episode. they certainly wouldnt check records, because the paycheck of holding someone is the single most important factor for them.\n\ni left that job btw, because someone on another unit successfully committed suicide on their watch. this is literally the most important part of our job, but they wanted to cut corners, and go against doctors orders to save a few dollars. the only positive takeaway i have from the entire situation that it wasnt my unit. i only heard things. never interacted with the individual myself...",
                "Gonna end up dead soon.",
                "Am I crazy or have there been a significant increase in prison escapes over the last 3 months.",
                "Pretty sure there’s Datelines, and a few YouTube docs about this guys case"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Japan flight made emergency landing after man tried opening door",
            "external_url": "https://www.bbc.com/news/articles/cgmjzlj0g30o",
            "upvotes": 844,
            "date": "05/26/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4d40/live/c8831680-3a0f-11f0-a4ca-c350ccf42b30.jpg",
            "top_comments": [
                "Just in case anyone is wondering, it's basically impossible to open the doors of a commercial airliner at altitude. They open inward first before swinging out, and the interior of the aircraft is pressurized when flying, forcing the door into its frame. That pressure applies too much interior force to the door for a human to overcome and prevents it from opening.",
                "When my sister flew with Air New Zealand as a stewardess, she relates how a gentleman came up to her in the galley, and asked if he could get off. He said he’d had enough of flying and just wanted off. He was subsequently gently sedated.",
                "A Japanese plane headed from Tokyo to Texas had to make an emergency landing after a passenger tried to open one of its doors during the flight.\n\nAll Nippon Airways (ANA) Flight 114 was diverted to Seattle hours after taking off on Saturday \"due to an unruly passenger\", the airline said.\n\nPort of Seattle police told media they had been notified of a man who \"attempted to open exit doors during the flight\".",
                "I keep seeing headlines about people doing this. Whats actually happening with these people? What “medical crisis” makes someone think they can just open a door and get off an airplane in mid-air? Are they on weird sleep/anxiety medications and having some sort of reaction or episode? Are they crazy and having a delusion?",
                "A lot of very not-normal people going to Japan for trips recently. It makes me not want to go just to not contribute to their disrespectful tourist epidemic, even if I'd never be of that group.",
                "It’s coming to the point where I am constantly seeing people not knowing how to behave or being dangerous on flights that I wouldn’t be surprised if you had to have a background check and interview to be allowed on planes in the future",
                "You're not in the movie Air Force One, brother.",
                "Odd, when you realise it's the altitude holding the door closed.",
                "Intrusive thoughts win again!",
                "Unless they can fly or survived fallen from high attitude, those are just dumb clueless people who probably in their first flight."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump delays 50% tariffs on EU to July 9",
            "external_url": "https://www.cnbc.com/2025/05/25/trump-50percent-tariffs-eu-july-9.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
            "upvotes": 15069,
            "date": "05/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108150321-1748213510226-AP20021497359027.jpg?v=1748213621&w=1920&h=1080",
            "top_comments": [
                "No way. What, wow. Did not see that coming.",
                "Another day, another method to manipulate the markets.",
                "Come Tuesday, it will be 100% tariffs on the EU, then by Friday they will be delayed again.  Guaranteed the Trump family will make millions this week",
                "We've seen this movie already. First time was shitty by the way",
                "Friendly reminder that Congress could stop this at any time. They, specifically Republicans, are actively choosing not to, likely because they are also benefiting from this blatant market manipulation.",
                "Today. Tomorrow it will take effect immediately. On Thursday he will double it if a single European citizen complains about US tariffs. Friday he will have forgotten about all of the tariffs and will wonder why European citizens are cold to his administration until his aides remind him, which he will at first deny, and then go on an hours long xenophobic rant, claiming Latvian as the next new state, and quadruple the already doubled tariffs. Repeat.",
                "lol they saw stock market futures and said yah, no.... this is the fat nixon market manipulation cycle of walking back tariffs so they never get imposed when his bluff is called. now the markets will be happy on Tuesday. i guess our judicial system is ignoring this blatant illegal activity like god sleeping through the holocaust",
                "Is it really a delay if you were never going to do it in the first place? If so, then I'm announcing my decision to delay my upcoming date with Margot Robbie.",
                "Trump’s foreign policy strategy: threaten fire, then call it a favor when you delay the match.",
                "Insider trading go brrr."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "National parks ordered to police negative history under Trump directive",
            "external_url": "https://www.sfgate.com/california-parks/article/national-parks-negative-history-trump-20343308.php",
            "upvotes": 22954,
            "date": "05/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So, we're in the, \"Report your neighbor for wrong think,\" phase.",
                "It's so interesting how statues are history that can't be challenged, but actual history needs to be hidden.",
                "\"The battle of Gettysburg was a decisive win for the confederacy.   Afterwards both sides celebrated with dancing and singing to the historic tune \"YMCA\" by the legendary people of the village. \"",
                "History is *supposed* to make you uncomfortable.",
                "[removed]",
                "Negative history... like his administration?",
                "“Those who cannot remember the past are condemned to repeat it.” – George Santayana, The Life of Reason, 1905",
                "“The signs will state that the property belongs to the American people and ask visitors to report any areas in need of repair, services requiring improvement, or signage and information that present past or living Americans in a negative light or “fail to emphasize the beauty, grandeur, and abundance of the natural landscape,””\n\nSo this is about finding signs that don’t glaze America enough? To what standard? Are we going to ask Elon’s AI to grade each sign and rank it by how good the glaze is?",
                "So let me guess, countrywide its going to start being taught as \"The War of Northern Aggression\" and how the Union cruelly stole Blacks \"happiness in slavery.\" Or perhaps something about how Americans never harmed Native Americans and always honored their treaties. You know, just straight up ignore history so Cletus doesn't have to feel uncomfortable. ",
                "Executive order for revisionist history thats certainly something "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "At least 11 hospitalized after shooting in South Carolina: Police",
            "external_url": "https://abcnews.go.com/US/11-hospitalized-after-shooting-river-south-carolina-police/story?id=122186737",
            "upvotes": 1426,
            "date": "05/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/4e481934-8b15-42bf-a8bf-b2032c7df4b2/sc_1748230661591_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Seems it was a drunken dispute that escalated in a crowded area, not a targeted attack but still early.",
                "No information other than the shooting taking place on a street in a town 30 minutes away from Myrtle Beach.\n\n11 people injured is kind of a fucking lot though",
                "Good ol’ Bike Week! This is why I’ve never been in my life. Someone gets killed EVERY year. Someone just got killed on Thursday night out there. Thought they’d make it through the rest of the weekend but damn. Not surprised.",
                "This is clearly fake, South Carolina is a staunchly conservative state, and I was told just this week that it's only Liberal areas with such crime.\n\n*Nice try, liberal media.*\n\nYes, I'm being facetious.",
                "Jesus Christ stop fuckin shooting people you ASSHOLES",
                "In Little River there have always been a lot of guns and a lot of alcohol its never a good combination.",
                "Summer fun is starting.",
                "Maybe this time thought and prayers will do something",
                "be american on memorial day weekend\n\nget shot",
                "Oh well they like mass shooting deaths down there that's why they keep voting for em."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Comic book legend Peter David dies after series of health issues at age 68",
            "external_url": "https://www.the-independent.com/arts-entertainment/books/news/peter-david-death-cause-hulk-b2757683.html",
            "upvotes": 2664,
            "date": "05/25/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/25/21/48/Peter-David.jpeg?trim=105,0,272,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "> Family friend restarted GoFundMe to help raise money for medical expenses after he was rejected from Medicaid",
                "He's one of the greats of Marvel. He redefined the Hulk, and his run on X-Factor was terrific.  He had a knack for deep diving into Marvel characters that were two-dimensional and redefining them as people. By the time his run was complete, we knew who The Multiple Man was, for example.\n\nVale, Peter David, writer of Stuff.",
                "Why would someone be denied Medicaid? That's ridiculous.",
                "He wrote some of the best Star Trek novels.\n\nVendetta, Imzadi and Q-Squared were mainstays when I was a kid. \n\nRest easy PAD, Writer of Stuff.",
                "If you read comics in the '90s and didn't cry, laugh, and rethink reality a little, you werent reading Peter David.\n\nHe wrote Spider-Man 2099, but honestly, he was always about 30 years ahead of everyone else anyway.",
                "He has a far-reaching legacy.  This is being discussed on r/babylon5 also.",
                "He wrote some of the best Star Trek novels - I always enjoyed his Deep Space Nine ones and his original creation New Frontier. He was incredibly witty and would insert all sorts of jokes into them. \n\nHe wrote for many genres and it was easy to see he was a full-blown geek who was very passionate about his fandoms - he just did what so many of us wish we could do and made a living doing it. \n\nRIP to a legend of sci-fi and fantasy literature.",
                "He was one of the first online comic authors.  Back in 1990-1991, he and a few others were part of FidoNet, answering questions and regaling other users with stories.  And that doesn't even start to include all the great comics and novels he produced.  We've lost a great one.",
                "This is such a weird little thing but it’s stuck with me forever, there is a Star Trek novel he wrote that I read when I was a kid and for no apparent thematic reason he made all the aliens or one planet have names that come from the Seder plate, like used in Passover. Like their names are Maror, Charoset, Karpas and Matza if I remember correctly. Such a weird choice it’s stuck in my head forever",
                "The greatest health system in the whole world!"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/26/2025 16:10:38 UTC"
}