{
    "posts": [
        {
            "category": "HOT",
            "title": "Actor Val Kilmer, star of 'Batman Forever', dies at 65",
            "external_url": "https://www.reuters.com/world/us/actor-val-kilmer-star-batman-forever-dies-65-nyt-reports-2025-04-02/",
            "upvotes": 17979,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Fair winds and following seas, Iceman.",
                "Damn. He had so many legendary roles in his career. And great comedic chops as well.",
                "I'm your huckleberry. RIP",
                "I highly recommend his 2020 book called I’m your Huckleberry, I just finished it last month. Since he couldn’t read the audiobook, he had three different people read it for him, including Will Forte from SNL. He really lived a great life. Rest in peace.",
                "I wondered for months before the movie came out how Iceman would be portrayed in Top Gun 2, since Val’s illness took his voice away. \n\nIt was a pleasant surprise how they did it, and did right by him to honor his character. \n\nOne of my favorites from the 90s growing up. His guest spot on Entourage was a hilarious surprise. \n\nHe will be missed dearly.",
                "I am glad we got to see him star Top Gun 2. He was a fighter and held on for a long time despite a very aggressive and terrible disease. I hope he is now at peace.",
                "RIP. I'm glad he isn't suffering anymore. he'd been battling cancer for so long",
                "Batman Forever is the one they picked for the headline?",
                "“Star of Batman Forever”… seriously? Rest in peace. Reuters has questionable taste in movies.",
                "Willow. It’s a favorite. What a legend."
            ],
            "aggregate_sentiment": 73.0
        },
        {
            "category": "HOT",
            "title": "Susan Crawford wins Wisconsin Supreme Court race, defying Elon Musk",
            "external_url": "https://www.nbcnews.com/politics/elections/wisconsin-supreme-court-election-results-rcna198353",
            "upvotes": 54151,
            "date": "04/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250327-Susan-Crawford-Brad-Schimel-CH-1007-8c869d.jpg",
            "top_comments": [
                "And the margin wasn't even close either.\n\nFL two deep red districts, while staying red, also swung 20 points toward the Dem.  People are not happy, period.",
                "So proud of my state today!",
                "Fuck off Elon. We hate you.",
                "It just feels nice to read a positive headline for once. \n\nCongratulations to Susan, fuck you Elon.",
                "Hello from Wisconsin. Nearly $100M was poured into this race. It was fucking miserable for all of us. We should all be embarrassed that we have let this happen to our democracy.\n\nFuck oligarchs, fuck big money in politics.",
                "Good. Elon's money can't buy everything. ",
                "And Elon spent millions on this race lmao",
                "The thought of Elon coping and seething at this brings me great joy",
                "Well now trump is going to go extra nuclear tomorrow with whatever the plan was instead of firing elon for doing a piss poor job.",
                "Imagine being one of the richest people in human history and you still fail to use your unimaginable wealth to blatantly manipulate votes in a state election.\n\nIt's hard for me to think of anyone who has ever existed that is a bigger loser than Elon Musk."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Sen. Cory Booker’s speech in protest of Trump breaks the Senate record",
            "external_url": "https://apnews.com/live/donald-trump-news-updates-4-1-2025",
            "upvotes": 27534,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Booker broke a record previously held by Strom Thurmond, a segregationist who filibustered for 24 hours and 18 minutes against the Civil Rights Act of 1957, according to the Senate’s records.\"\n\n\nNice",
                "He beat Strom Thurmond. And unlike Ted Cruz, he didn't read from Dr. Seuss or the phonebook, but rather recited letters and personal accounts from Americans. \n\nWell done.",
                "He's stopping at 25 hours. The strength of this man is admirable. He's had over 100k watching for the last hour.",
                "Over 25 hours before he finally rested. Bravo sir, and may your pillow be extra cold when you sleep tonight.",
                "Good. Strom Thurmond was an abhorrent scumbag. The fact that South Carolina had him in office until he was a century old is nothing short of shameful.",
                "The coolest part is that the record was originally set by a racist piece of shit who was filibustering *The Civil Rights Act*",
                "This was Crazy ……than man has stood up for 24 hours …I wonder if Trump ever stood up for 24 hours in his entire life 🤔🤔",
                "I may not agree with 100% of what he stands for, but will be the first to say that Senator Booker is a motherfucking patriot.",
                "The length in itself is a statement.\n\nCan you imagine musk or trump having the self-discipline to do this for 24-hours?\n\nThey'd do it for 13 minutes then say \"I think I've proven I could do it\"",
                "It's remarkable that Cory Booker is willing to literally, physically stand up for over a whole day, and it's nice to see him beat the Senate record previously held by Strom Thurmond. But, the thing that nobody is really talking about is how he admitted that he is \"inadequate\" (his word) for the time, and that he does not know what the hell to do. Nearly every Senator who asked him a question to give him reprieve from the moment also asked him what they are supposed to do; which is concerning. 0 Senators have an answer. They are doing \\*something\\* here, sure. But their response is going to be null if they actually can't figure out what to do."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Alabama can’t prosecute groups who help women travel to get an abortion, federal judge says",
            "external_url": "https://www.cnn.com/2025/04/01/us/alabama-abortion-groups-ruling/index.html",
            "upvotes": 20304,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1144017267.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">“It is one thing for Alabama to outlaw by statute what happens in its own backyard. It is another thing for the state to enforce its values and laws, as chosen by the attorney general, outside its boundaries by punishing its citizens and others who help individuals travel to another state to engage in conduct that is lawful there but the attorney general finds to be contrary to Alabama’s values and laws,” Thompson wrote in the 131-page opinion.\n\nMight as well prosecute airlines taking Alabamans going to Vegas to spin the roulette wheel. Or taking your kid from Mobile to Mississippi to spray some silly string.",
                "\"States rights! Except when I want to prosecute you for doing something that's legal in another state!\"",
                "Fuck yeah.  Get out with this Christian nationalist fascist bullshit, Alabama.\n\nWomen aren't property.  Their wombs aren't property.  Interstate travel is still legal and anyone who tries to prevent that should be told to fuck off, the voters should throw them out of office and a crowd of people in pilgrim's clothing should follow them around every time they leave the house shouting \"SHAME! SHAME!\" at them.",
                "How long until states get border checks where you cant leave without state visa or minors cant leave without parental permission and minors becomes boosted to under 25s. But i feel like they'd go for trying to get a national ban on abortion instead. They wont stop trying find a win",
                "\"Alabama [bans abortion](https://www.cnn.com/2019/05/15/politics/alabama-governor-signs-bill/index.html) at any stage of pregnancy with no exceptions for rape and incest.\"\n\nDumb Fucks.",
                "This kind of across-state-borders legal wrangling is very similar to that preceding the civil war, only then it was Alabama etc. trying to force northern states to enforce southern laws about escaped slaves. ",
                "Always said as soon as they run into interstate commerce these guys' arguments are DOA. It's such a slippery slope, broad argument to make.",
                "The Trump administration is running the \"doing it anyway\" play and giving a whooooooole bunch of people the go-ahead to do the same.\n\nSo a judge might say they can't, but I'm pretty sure they will.",
                "Alabama in a couple years: \"We gave you a speeding ticket for exceeding the posted speed limit in Iowa.\"",
                "You can donate to Yellowhammer Fund here:\n\nhttps://www.yellowhammerfund.org"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "DOJ to seek death penalty for Luigi Mangione in CEO murder case",
            "external_url": "https://www.cnbc.com/2025/04/01/luigi-mangione-death-penalty-brian-thompson.html",
            "upvotes": 40137,
            "date": "04/01/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108124291-1743523094454-108124291-17435230372025-04-01t154224z_1209086563_rc22zca5958d_rtrmadp_0_unitedhealth-ceo.jpg?v=1743523101&w=1920&h=1080",
            "top_comments": [
                "Not surprising. Do I think the jury is going to recommend the death penalty? My gut says no, but I think life is still on the table ",
                "Kinda wild to announce this, playing up the whole “Luigi killed a father” thing, on the same day that you sent a father to die in El Salvador.",
                "I still don't understand why the DoJ is even involved. This shouldn't be a federal case. It should be handled by the state of New York",
                "[removed]",
                "What a surprise.\n\nAnd the execution will probably be streamed pay per view on X.",
                "The Parkland school shooter killed 17 people and wasn’t sentenced to death. \n\nThis is a politically driven punishment. \n\nEdit: I’ve learned the prosecutors in the Parkland shooting trial did try for the death penalty but the jury was not unanimous in agreement so the shooter avoided that punishment. Thanks for those who gave me some learning in the child comments. ",
                "Sure, make him a martyr. Go ahead.",
                "Universal Healthcare would have saved Brian Thompson's life.",
                "He sure has heck rattled the cage. \n\nThey really want to make an example out of him but in the end, all it will do is make him a martyr.",
                "Oh they’re scared scared. \n\nMaking him a martyr is the worst possible thing these cowards could do. Good luck with all that."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Palestinian paramedics shot by Israeli forces had hands tied, eyewitnesses say | Gaza",
            "external_url": "https://www.theguardian.com/world/2025/apr/01/palestinian-paramedics-shot-by-israeli-forces-had-hands-tied-eyewitnesses-say",
            "upvotes": 1717,
            "date": "04/02/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/aa4b53d72572c85144df8719dd5aa383abe9b766/0_127_3362_2017/master/3362.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8055f3f6c81bc54345ee4bd260ee64f1",
            "top_comments": [
                "They hate being called out for war crimes but just can't seem to stop themselves from doing them in pretty obvious ways.",
                "You can guarantee this won't appear on r/worldnews",
                "I tried posting this on r/worldnews and my post was taken down rather quickly",
                "S*ome of the bodies of 15 Palestinian paramedics and rescue workers, killed by Israeli forces and buried in a mass grave nine days ago in Gaza, were found with their hands or legs tied and had gunshot wounds to the head and chest, according to two eyewitnesses.*\n\n*The witness accounts add to an accumulating body of evidence pointing to a potentially serious war crime on 23 March, when Palestinian Red Crescent ambulance crews and civil defence rescue workers were sent to the scene of an airstrike in the early hours of the morning in the al-Hashashin district of Rafah, Gaza’s southernmost city.*\n\n*International humanitarian teams were only allowed access to the site this weekend. One body was recovered on Saturday. Fourteen more were found in a sandy grave at the site on Sunday and were brought back for autopsies in the nearby city of Khan Younis.*\n\n*Dr Ahmed al-Farra, a senior doctor at the Nasser medical complex in Khan Younis, witnessed the arrival of some of the remains.*\n\n*“I was able to see three bodies when they were transferred to the Nasser hospital. They had bullets in their chest and head. They were executed. They had their hands tied,’’ Farra said. “They tied them so they were unable to move and then they killed them.”*\n\n*He provided photographs he said he had taken of one of the dead on arrival at the hospital. The pictures show a hand at the end of a long-sleeved black shirt with a black cord knotted around the wrist.*\n\n*Another witness, an official from an international aid agency who took part in the recovery of remains from Rafah on Sunday, also said they saw evidence of one of the dead having been shot after being detained.*\n\n*“I saw the bodies with my own eyes when we found them in the mass grave,” the witness, who did not want his name used for his own safety, told the Guardian in a telephone interview. “They had signs of multiple shots in the chest. One of them had legs tied. One was shot in the head. They were executed.”*\n\n*...*",
                "War Crime #1768. Maybe one day, the Israeli leadership and the goons on the ground will be held accountable for this, but probably not.",
                "Israel is a terrorist state.",
                "Can't wait to see Reddit's resident Israel cheerleaders spin this one...   defending the indefensible time and time again.\n\nEDIT: Hey look, the Israel government's empirically existent online downvote force has arrived...   One of the most pathetic concepts I could even envision, but I guess it goes hand in hand with a sociopathic ethnostate",
                "Israel represents a larger slide into lawlessness.\n\nThis impunity will expand to other actors, countries, and situations. We are all losers.\n\nIf countries don't stand together and enforce judgments then reactions will only be violent. Institutions will unravel.\n\nIt's a universal law of motion. Every action creates a reaction",
                "After 80 YEARS of existence is there truly *nothing more* the United Nations can offer in the face of such atrocity than verbal condemnation?! I don’t have the proper words to describe the inadequacy ",
                "\"they're using hostages ontop of schools and hospitals! They're hiding in the basements\"\n\nAnd it doesn't stop them from bombing."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Mississippi governor signs typo tax overhaul bill into law to phase out income tax",
            "external_url": "https://apnews.com/us-news/taxes-tate-reeves-mississippi-general-news-573ad75c52cb94af8f8adc90d1cd5e96",
            "upvotes": 2865,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I couldn't find what the typo was in this article. So I had to look [around](https://mississippitoday.org/2025/03/24/how-did-the-mississippi-typo-tax-swap-act-of-2025-happen-legislative-recap/). For anyone else wondering:\n\nThe latter parts of the tax reduction only occur:\n\n>when revenue surplus equals 85% or more of the cost of a 1% cut in the tax rate.\n\nBut the bill was passed and signed as `.85%`. So the cuts are almost guranteed to continue.",
                "Good god, MS. You really are a sitcom at this point:\n\n\"The Senate bill had typos that essentially nullified the growth triggers and would eliminate the income tax nearly as quickly as the House proposed. The House passed the flawed bill on to the governor, who signed it into law Thursday.\"",
                "If those Mississippi legislators could read they'd be very upset",
                "So they say Mississippi is open for business and a bunch of people will move there. Do people really want to live there with no schools, libraries, hospitals, or maybe even fire stations and police? They already can't pay for these things, what is going to happen with no income tax?",
                "These paragraphs explain how the typo affected things:\n\n>House leaders have long pushed to eliminate the state personal income tax in relatively short order. The Senate had urged a longer-term approach, arguing it would be unwise to slash a third of the state’s revenue in uncertain economic times. Senators last week had conceded to eliminate the income tax, but only with economic growth “triggers” as safeguards — the tax wouldn’t phase out unless the state saw robust economic growth and controlled spending. It would have likely taken many years.\n\n>Or so they thought. The Senate bill had typos that essentially nullified the growth triggers and would eliminate the income tax nearly as quickly as the House proposed. The House passed the flawed bill on to the governor, who signed it into law Thursday.",
                "Nothing screams \"governing with competence\" like accidentally fast-tracking a massive tax overhaul \\*because of typos\\*. This wasn’t just a clerical hiccup. This is generational economic policy passed by people who \\*didn’t read the fine print\\*. Or maybe they did and hoped no one else would. Either way, Mississippi just gave its wealthiest residents a high-five and told the working poor to budget harder. \n\n\n\nThey’ll tell you it’s bold reform. But behind the curtain? It’s austerity cosplaying as prosperity.",
                "As a lifetime Mississippi resident, let me assure you - we don’t hide our idiots away, we put them in political positions such as Governor.",
                "Stop giving this deadbeat red state more federal money than it kicks in.",
                "Wait until y'all find out [why we no longer have ballot initiatives ](https://apnews.com/article/ms-state-wire-mississippi-marijuana-health-4f81d577aeb2ed8a04849f62c86c707e)",
                ">Or so they thought. The Senate bill had typos that essentially nullified the growth triggers and would eliminate the income tax nearly as quickly as the House proposed. The House passed the flawed bill on to the governor, who signed it into law Thursday.\n\n>In a social media post last week, Reeves, who did not mention the bizarre series of events that helped send the bill to his desk, said “liberal activists” were “making claims of errors, omissions, mistakes, and changes.” Since then, both House Speaker Jason White and Lt. Gov Delbert Hosemann, both Republicans, have acknowledged the legislation signed into law Thursday contained errors.\n\n>Hosemann downplayed the typos at the ceremony.\n\n>“Some of y’all are focused on a typo in the bill, and I’d use the biblical analogy, let he who has not had a typo cast the first stone.”\n\nDamn liberal activists, being right.  Just deflect it and prey on the praying!"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Medical Student Convicted Of Raping Another Student Escapes Sentence As “He Is Young And Talented”",
            "external_url": "https://www.vrt.be/vrtnws/en/2025/04/01/medical-student-convicted-of-raping-another-student-escapes-sent/",
            "upvotes": 4923,
            "date": "04/01/2025",
            "thumbnail": "https://images.vrt.be/vrtnws_share/2025/04/01/93759d66-b14b-42bc-aa5d-8469165278ca.png",
            "top_comments": [
                ">In his summing up the judge said “It has been proven that sexual intercourse took place at a time that she was in a state that meant that she couldn’t possibly consent to it. The offence is serious and unacceptable.”\n\n>Nevertheless, the judge refrained from passing sentence. “It is undeniable that he passed the line of what is permissible. The man showed a lack of respect for the victim's physical, psychological and sexual boundaries. However, he is still young and has no criminal record. He is also a talented and committed person both in his professional and private live. By finding him guilty but not punishing him, he will be made to feel guilty and the chance of him reoffending will be prevented, without socially impairing the man”.\n\n\"Its **unacceptable**! But I won't punish him.\"",
                "Young and talented at what, raping?",
                "Unfortunately, the title must exactly match the article, so I couldn’t emphasize that the medical student is actually A GYNAECOLOGY RESIDENT!!!!!!! In other words, while the man is young and talented, the woman he raped—and the women who will be vulnerable and naked alone with him in his practice—apparently are not. :)\n\n\nA similar thing occurred a few years ago in the same belgian courthouse when white elite student club called Reuzegom left their only black member, Sanda Dia, for dead after subjecting him to hours of torture as part of an initiation ritual. He eventually died, and the perpetrators tried to cover their tracks. The verdict was the same: they were found guilty but did not receive any sentencing besides a very low fine of €400 and some community service (in Belgium, you only get a criminal record if there's an actual sentence and the fine needs to exceed X amount which wasn't the case here so they still have clean records) because they were considered “young and promising.” In reality, they were white, wealthy, and one of their fathers was a judge in the same court. A YouTuber who doxxed them was fined €20K—roughly equivalent to 22K dollars—because it is illegal to publish the names of individuals who do not have a criminal record.",
                "Gynecologist that raped an unconscious woman. \n\nWho the hell would ever risk hiring this scum??\n\nWhat woman would ever want to be examined by him?!?",
                "That's disgusting. The judge and rapist should both be in prison.",
                "If you lack the critical thinking skills to not rape someone, I couldn't care less how talented you are. Straight to jail, do not pass go.",
                "His medical license should be revoked.",
                "Young and Talented? At what? Rape?",
                "And this is why so many rapes go unreported.  What's the point?  I am boiling angry at this.",
                "Sounds like the judge should be dismissed. Make an example. There needs to be better oversight of judges, considering it is known that even the smallest power makes some abuse it. Abuse need not be believed to be abuse by the abuser."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "An ‘Administrative Error’ Sends a Maryland Father to a Salvadoran Prison: The Trump administration says that it mistakenly deported an immigrant with protected status but that courts are powerless to order his return.",
            "external_url": "https://www.theatlantic.com/politics/archive/2025/03/an-administrative-error-sends-a-man-to-a-salvadoran-prison/682254/?gift=m9xwDJisxGbFpOkF7Nlt_LdBPvjg3gv0j8150ryU4l0&utm_source=copy-link&utm_medium=social&utm_campaign=share",
            "upvotes": 12152,
            "date": "04/01/2025",
            "thumbnail": "https://cdn.theatlantic.com/thumbor/oYFNnmLZ35HdlZiS_QaeWjloPCY=/0x64:2995x1624/1200x625/media/img/mt/2025/03/25_3_garcia_elsalvador-1/original.jpg",
            "top_comments": [
                "Pretty cool how we have enough diplomatic leverage over El Salvador to get them to run a gulag for us, but not enough leverage to get them to release a wrongfully detained person.",
                "The Trump administration is not powerless they don't care and are in fact malicious in not caring. Without due process this can happen to any of you",
                "Some highlights surrounding this illegal kidnapping and deportation to a concentration camp of a person with lawful protected status in the U.S. lawfully here, married to a U.S. citizen, with a 5 year old disabled child who is also a citizen.\n\n>“They claim that the court is powerless to order any relief,’’ Sandoval-Moshenberg told me. **“If that’s true, the immigration laws are meaningless—all of them—because the government can deport whoever they want, wherever they want, whenever they want, and no court can do anything about it once it’s done.”**\n> . . .\n>Abrego Garcia’s family has had no contact with him since he was sent to the megaprison in El Salvador, known as CECOT. His wife spotted her husband in news photographs released by Salvadoran President Nayib Bukele on the morning of March 16, after a U.S. district judge had told the Trump administration to halt the flights.\n\n> **“Oopsie,” Bukele wrote on social media, taunting the judge.**\n\n>Abrego Garcia’s wife recognized her husband’s decorative arm tattoo and scars, according to the court filing. The image showed Salvadoran guards in black ski masks frog-marching him into the prison, with his head shoved down toward the floor. CECOT is the same prison that Department of Homeland Security Secretary Kristi Noem visited last week, recording videos for social media while standing in front of a cell packed with silent detainees.\n\n>If the government wants to deport someone with protected status, the standard course would be to reopen the case and introduce new evidence arguing for deportation. The deportation of a protected-status holder has even stunned some government attorneys I’ve been in touch with who are tracking the case, who declined to be named because they weren’t authorized to speak to the press. “What. The. Fuck,” one texted me.\n\n>**Sandoval-Moshenberg told the court that he believes Trump officials deported his client “through extrajudicial means because they believed that going through the immigration judge process took too long, and they feared that they might not win all of their cases.’’**",
                "If they can send anyone to a foreign prison without due process and refuse to get them back, they can do it to YOU, my fellow Americans. We aren’t far from the final solution at this point. Every alarm should be going off, it won’t just be limited to brown people for long, it’ll slowly get worse and worse, until it comes for YOU.",
                "This was no accident. They are testing the limits of who they can get away with deporting. It's all horrifying.",
                "Would you look at that, the mask is finally, truly, coming off.\n\nRepublicans and Trump are Nazi's.\n\nWill be yelling it as loud as possible.",
                "But I was told things like this wouldn’t happen!?",
                "As a non-white living in the US, I am terrified for my family. We’re all US citizens but these people aren’t even checking anymore",
                "Then the judge should jail the administration lawyers till the man is returned and fine the administration a million dollars a day to be given to the family.\n\nI doubt Trump will care, but the lawyers ending up in jail migjt.",
                "I feel like there was this other time in history where a country started rounding people up and shipping them to some sort of camps. "
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "23 states, DC sue Trump administration over billions in lost public health funding",
            "external_url": "https://www.cnn.com/2025/04/01/health/public-health-funding-states-sue-hhs-rfk/index.html",
            "upvotes": 7569,
            "date": "04/01/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2204189381.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Lawyers doing what they can with lawsuits in system thats already being undermined. But its up to general public to call representatives and join protests to show how unpopular these cuts are",
                "STATE OF COLORADO; STATE OF RHODE ISLAND; STATE OF CALIFORNIA; STATE OF\nMINNESOTA; STATE OF WASHINGTON; STATE\nOF ARIZONA; STATE OF CONNECTICUT;\nSTATE OF DELAWARE; DISTRICT OF\nCOLUMBIA; STATE OF HAWAI‘I; STATE OF\nILLINOIS; OFFICE OF THE GOVERNOR ex rel.\nAndy Beshear, in his official capacity as Governor of the COMMONWEALTH OF KENTUCKY;STATE OF MAINE; STATE OF MARYLAND; COMMONWEALTH OF MASSACHUSETTS; STATE OF MICHIGAN; STATE OF NEVADA;STATE OF NEW JERSEY; STATE OF NEW MEXICO; STATE OF NEW YORK; STATE OF NORTH CAROLINA; STATE OF OREGON; JOSH SHAPIRO, in his official capacity as Governor of the COMMONWEALTH OF PENNSYLVANIA;\nand STATE OF WISCONSIN\n\nThere’s the list after clicking 3 links so you don’t have to",
                "For the sake of the American people, let's hope they win.\n\nContact your Congressional reps.  Tell them you are unhappy that your, your friend's and your family's health are being put in jeopardy",
                "Are any of those states republican states?",
                "SUE HIM? How about impeach him?\n\nEdit and this time remove his ass.",
                "April 5th. Fid a local protest in your area.",
                "I'll bet Indiana isn't one of them. Our AG is busy mocking gay people for April fool's day.",
                "States needs electoral reform.\n\nThe end\n\nIt's a mediocre system full of loop holes and corruption at every level and Trump has truly exposed it.",
                "Louisiana had millions cut in grants treating mental health and substance abuse. My mental health care was being paid for by one of these grants. It was a real god send as I care for and support my 84 year old elderly father as well as myself and things are very tight around here. But now I'm just screwed. And there is seemly no where to turn and no one in the entire state that cares. I hate it here. I should add, I didn't vote for the moron in office and I've never voted or supported the GOP in any way, shape or form.",
                "I do not have any faith that our judiciary will check or balance anything the Trump admin does. There will be some judges that stand up, but they’ll just be removed, silenced, ignored, or overruled by the wildly corrupt Supreme Court."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Germany seeking to deport two Irish citizens for taking part in pro-Palestine protests",
            "external_url": "https://www.thejournal.ie/germany-seeking-to-deport-two-irish-citizens-for-taking-part-in-pro-palestine-protests-6665056-Apr2025/",
            "upvotes": 9,
            "date": "04/02/2025",
            "thumbnail": "https://img2.thejournal.ie/article/6665056/river/?height=400&version=6665057",
            "top_comments": [
                "And forcefully entered a building while peacefully swinging an axe. Sometimes the small details matters."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "A man wielding an axe wounds 3 people at the Assyrian Christian new year parade in Iraq",
            "external_url": "https://apnews.com/article/iraq-assyrians-parade-new-year-attack-axe-bb5d1d323329b3117a2b2b930b0f64db",
            "upvotes": 12,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“The parade, held every year on April 1, drew thousands of Assyrians from Iraq and across the diaspora, who marched through Dohuk in northern Iraq waving Assyrian flags and wearing colorful traditional clothes.\n\nWitnesses said the attacker, who has not been officially identified, ran toward the crowd shouting Islamic slogans.\n\nHe struck three people with the axe before being stopped by participants and security forces. Videos circulated online showed him pinned to the ground, repeatedly shouting, “Islamic State, the Islamic State remains.”\n\nA 17-year-old boy and a 75-year-old woman suffered skull fractures. A member of the local security forces, who was operating a surveillance drone, was also wounded. All three were hospitalized, local security officials said.”",
                "wtf is wrong with people"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Actor Val Kilmer, star of 'Batman Forever', dies at 65",
            "external_url": "https://www.reuters.com/world/us/actor-val-kilmer-star-batman-forever-dies-65-nyt-reports-2025-04-02/",
            "upvotes": 17975,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Fair winds and following seas, Iceman.",
                "Damn. He had so many legendary roles in his career. And great comedic chops as well.",
                "I'm your huckleberry. RIP",
                "I highly recommend his 2020 book called I’m your Huckleberry, I just finished it last month. Since he couldn’t read the audiobook, he had three different people read it for him, including Will Forte from SNL. He really lived a great life. Rest in peace.",
                "I wondered for months before the movie came out how Iceman would be portrayed in Top Gun 2, since Val’s illness took his voice away. \n\nIt was a pleasant surprise how they did it, and did right by him to honor his character. \n\nOne of my favorites from the 90s growing up. His guest spot on Entourage was a hilarious surprise. \n\nHe will be missed dearly.",
                "I am glad we got to see him star Top Gun 2. He was a fighter and held on for a long time despite a very aggressive and terrible disease. I hope he is now at peace.",
                "RIP. I'm glad he isn't suffering anymore. he'd been battling cancer for so long",
                "Batman Forever is the one they picked for the headline?",
                "“Star of Batman Forever”… seriously? Rest in peace. Reuters has questionable taste in movies.",
                "Willow. It’s a favorite. What a legend."
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "NEW",
            "title": "HHS layoffs hit Meals on Wheels and other services for seniors and disabled",
            "external_url": "https://www.npr.org/sections/shots-health-news/2025/04/01/g-s1-57716/hhs-layoffs-seniors-disabled-liheap-acl",
            "upvotes": 329,
            "date": "04/02/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3600x2025+0+172/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F6b%2F1914cfc4456d8075ef2d40cb1e3b%2Fap120314048774.jpg",
            "top_comments": [
                "Elon would say this is \"wasteful spending\". He has no clue what it's like not to be able to buy a meal, what it's like to not be able to go shopping for yourself, what it's like to be alone in your house all day, day after day.\n\nMeals on Wheels is a literal life-saver.",
                "This administration would rather those people just die ",
                "I cannot praise meals on wheels enough. They run affordable to comped meals for seniors and disabled individuals on barebones crews. My mom worked with them for several years. They frequently cooked from scratch with ingredients provided, mostly ran deliveries on volunteer efforts, provided isolated people with not only food and sometimes basic essentials like toiletries, but also provided seniors who could travel meals in social settings. My mom became friends with several seniors at the locations she served, keeping up with their lives until they passed. It was so clear that these services not only provided basic survival to these people, but life enrichment. It is a travesty to see social services like this come to harm.\n\nI saw what my mom and her coworkers went through during covid to keep this service alive. They lost their volunteers and had to manage half staffed. They did it, but it broke a lot of them. These services are run on the backs of hard working people serving their communities. Shame on this government!",
                "I hate this so much. For many seniors, meals on wheels might be one of the few social interactions they’ll have all week.",
                "My adult special needs son says that helping at Meals on Wheels by handing out the meals to all his \"older friends\" is the best part of his Community Connections at Day Support. \n\nThink about that.\nOld people who need nutritional support lose needed hot meals and disabled adults who love finding meaning and purpose by helping to deliver the food lose out as well.",
                "When Elon talks about cutting waste, he's talking about people like this.",
                "Older voters flipped to Orange. This is their reward.",
                "Is is working like intended.",
                "The entire \"doge\" hysterics were always going to end up like this.\n\n\nThey can't \"find nothing\", because that would mean admitting they were wrong. So they have to cut somewhere.\n\n\nGovernment spending is very simple. The top 5 categories that make up 85% of spending are SS, Medicare/Medicaid, defense, VA, and interest expense.\n\n\nYou can't cut interest or defense, so that leaves the other three. Illegal immigrants don't collect any of them, so guess where the cuts are coming from?\n\n\nNobody really ever paused to think that, from an economic perspective, the majority of govt spending goes to helping old and sick people.",
                "Way to go gramps: just had to vote red til you're dead"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Susan Crawford wins Wisconsin Supreme Court race, defying Elon Musk",
            "external_url": "https://www.nbcnews.com/politics/elections/wisconsin-supreme-court-election-results-rcna198353",
            "upvotes": 54157,
            "date": "04/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250327-Susan-Crawford-Brad-Schimel-CH-1007-8c869d.jpg",
            "top_comments": [
                "And the margin wasn't even close either.\n\nFL two deep red districts, while staying red, also swung 20 points toward the Dem.  People are not happy, period.",
                "So proud of my state today!",
                "Fuck off Elon. We hate you.",
                "It just feels nice to read a positive headline for once. \n\nCongratulations to Susan, fuck you Elon.",
                "Hello from Wisconsin. Nearly $100M was poured into this race. It was fucking miserable for all of us. We should all be embarrassed that we have let this happen to our democracy.\n\nFuck oligarchs, fuck big money in politics.",
                "Good. Elon's money can't buy everything. ",
                "And Elon spent millions on this race lmao",
                "The thought of Elon coping and seething at this brings me great joy",
                "Well now trump is going to go extra nuclear tomorrow with whatever the plan was instead of firing elon for doing a piss poor job.",
                "Imagine being one of the richest people in human history and you still fail to use your unimaginable wealth to blatantly manipulate votes in a state election.\n\nIt's hard for me to think of anyone who has ever existed that is a bigger loser than Elon Musk."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Palestinian paramedics shot by Israeli forces had hands tied, eyewitnesses say | Gaza",
            "external_url": "https://www.theguardian.com/world/2025/apr/01/palestinian-paramedics-shot-by-israeli-forces-had-hands-tied-eyewitnesses-say",
            "upvotes": 1722,
            "date": "04/02/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/aa4b53d72572c85144df8719dd5aa383abe9b766/0_127_3362_2017/master/3362.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8055f3f6c81bc54345ee4bd260ee64f1",
            "top_comments": [
                "They hate being called out for war crimes but just can't seem to stop themselves from doing them in pretty obvious ways.",
                "You can guarantee this won't appear on r/worldnews",
                "I tried posting this on r/worldnews and my post was taken down rather quickly",
                "S*ome of the bodies of 15 Palestinian paramedics and rescue workers, killed by Israeli forces and buried in a mass grave nine days ago in Gaza, were found with their hands or legs tied and had gunshot wounds to the head and chest, according to two eyewitnesses.*\n\n*The witness accounts add to an accumulating body of evidence pointing to a potentially serious war crime on 23 March, when Palestinian Red Crescent ambulance crews and civil defence rescue workers were sent to the scene of an airstrike in the early hours of the morning in the al-Hashashin district of Rafah, Gaza’s southernmost city.*\n\n*International humanitarian teams were only allowed access to the site this weekend. One body was recovered on Saturday. Fourteen more were found in a sandy grave at the site on Sunday and were brought back for autopsies in the nearby city of Khan Younis.*\n\n*Dr Ahmed al-Farra, a senior doctor at the Nasser medical complex in Khan Younis, witnessed the arrival of some of the remains.*\n\n*“I was able to see three bodies when they were transferred to the Nasser hospital. They had bullets in their chest and head. They were executed. They had their hands tied,’’ Farra said. “They tied them so they were unable to move and then they killed them.”*\n\n*He provided photographs he said he had taken of one of the dead on arrival at the hospital. The pictures show a hand at the end of a long-sleeved black shirt with a black cord knotted around the wrist.*\n\n*Another witness, an official from an international aid agency who took part in the recovery of remains from Rafah on Sunday, also said they saw evidence of one of the dead having been shot after being detained.*\n\n*“I saw the bodies with my own eyes when we found them in the mass grave,” the witness, who did not want his name used for his own safety, told the Guardian in a telephone interview. “They had signs of multiple shots in the chest. One of them had legs tied. One was shot in the head. They were executed.”*\n\n*...*",
                "War Crime #1768. Maybe one day, the Israeli leadership and the goons on the ground will be held accountable for this, but probably not.",
                "Israel is a terrorist state.",
                "Can't wait to see Reddit's resident Israel cheerleaders spin this one...   defending the indefensible time and time again.\n\nEDIT: Hey look, the Israel government's empirically existent online downvote force has arrived...   One of the most pathetic concepts I could even envision, but I guess it goes hand in hand with a sociopathic ethnostate",
                "Israel represents a larger slide into lawlessness.\n\nThis impunity will expand to other actors, countries, and situations. We are all losers.\n\nIf countries don't stand together and enforce judgments then reactions will only be violent. Institutions will unravel.\n\nIt's a universal law of motion. Every action creates a reaction",
                "After 80 YEARS of existence is there truly *nothing more* the United Nations can offer in the face of such atrocity than verbal condemnation?! I don’t have the proper words to describe the inadequacy ",
                "\"they're using hostages ontop of schools and hospitals! They're hiding in the basements\"\n\nAnd it doesn't stop them from bombing."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "At least 2,700 people killed in Myanmar earthquake as aid agencies concerned about access to food, water and medicine",
            "external_url": "https://www.abc.net.au/news/2025-04-02/myanmar-earthquake-death-toll-rises-water-food-shortages/105124958?utm_source=abc_news_app&utm_medium=content_shared&utm_campaign=abc_news_app&utm_content=link",
            "upvotes": 461,
            "date": "04/02/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/5be9e6d9e471787db328433bf2ab0512?impolicy=wcms_watermark_news&cropH=1396&cropW=2482&xPos=39&yPos=0&width=862&height=485&imformat=generic",
            "top_comments": [
                "In the past there would’ve been us Air Force planes full of shit and people already on the ground.  This is embarrassing and shameful.  Sorry world.  I’m really not even sure what my tax dollars are paying for because we don’t have shit here either.",
                "The actual toll will probably be 4-10 times higher as is often the case with such major natural disasters.",
                "In before American conservatives try to explain why it’s a good thing to cut off USAID.",
                "There’s currently a civil war ongoing. I wonder if this will eventually lead to that wrapping up like the Aceh insurgency after the 2004 earthquake. Then again, Myanmar has pretty much constantly had some sort of civil war since independence in 1948.",
                "*The country's military ruler, Min Aung Hlaing, said Friday's magnitude-7.7 quake was expected to surpass 3,000 deaths, having reached 2,719 on Tuesday, with 4,521 people injured and 441 missing.*\n\nClimate crisis combined with poor construction, equates to death and depredation."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Hungarians keep up protests against Orban's move to ban Pride",
            "external_url": "https://www.reuters.com/world/europe/hungarians-keep-up-protests-against-orbans-move-ban-pride-2025-04-01/",
            "upvotes": 1053,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Hate, hate and more hate.",
                "If nothing else, we can take peace in the fact that watching America fall to right wing fascism appears to have been enough of a slap to cause other countries to get serious about expelling their own wannabe dictators.\n\n\nNow if only we could",
                ">Pride goeth before destruction, and an haughty spirit before a fall.\n\n\nAccording to King James."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Sackets Harbor community calls for return of three children taken during ICE dairy farm visit",
            "external_url": "https://www.northcountrypublicradio.org/news/story/51511/20250331/sackets-harbor-community-calls-for-return-of-three-children-taken-during-ice-dairy-farm-visit",
            "upvotes": 1361,
            "date": "04/01/2025",
            "thumbnail": "https://www.northcountrypublicradio.org/news/images/250331SacketHarborCSDBuildingWebsitePhoto.jpg",
            "top_comments": [
                "wow, I feel so much safer with those children gone, thanks Republicans.  Frist you save me from pronouns and DEI, and now three children.",
                "*\"He explained to me how detrimental and how terrifying it was to see those kids \\[taken\\] by masked, armed Homeland Security agents and ICE agents, handcuffed and put in the van, and escorted off his far...,\"  DeCillis says the farmer described his workers - and the children - as his family.* \n\nAll three children/teens are productive local students.",
                "With ice acting this way we are doomed to see waco 2.0",
                "Are we sure they're even in the country anymore? This administration is cruel and twisted",
                "They are one small step from killing people. This has to be stopped.",
                "I wish there was a visual to go with this story. A video of this family working on the farm and the kids in school and then masked men hauling them away. This needs to be seen to reach this country. All farmers who value their workers should video document what their workers do on the farms because who is going to do their work once they are gone?  The laid off Federal workers….I doubt that.",
                "The same county that voted 61.8% for Trump…",
                "This is a heavily Republican area of Northern NY state. They likely voted for this.",
                "Why was a third grader working at a dairy farm?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Sen. Cory Booker’s speech in protest of Trump breaks the Senate record",
            "external_url": "https://apnews.com/live/donald-trump-news-updates-4-1-2025",
            "upvotes": 27535,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Booker broke a record previously held by Strom Thurmond, a segregationist who filibustered for 24 hours and 18 minutes against the Civil Rights Act of 1957, according to the Senate’s records.\"\n\n\nNice",
                "He beat Strom Thurmond. And unlike Ted Cruz, he didn't read from Dr. Seuss or the phonebook, but rather recited letters and personal accounts from Americans. \n\nWell done.",
                "He's stopping at 25 hours. The strength of this man is admirable. He's had over 100k watching for the last hour.",
                "Over 25 hours before he finally rested. Bravo sir, and may your pillow be extra cold when you sleep tonight.",
                "Good. Strom Thurmond was an abhorrent scumbag. The fact that South Carolina had him in office until he was a century old is nothing short of shameful.",
                "The coolest part is that the record was originally set by a racist piece of shit who was filibustering *The Civil Rights Act*",
                "This was Crazy ……than man has stood up for 24 hours …I wonder if Trump ever stood up for 24 hours in his entire life 🤔🤔",
                "I may not agree with 100% of what he stands for, but will be the first to say that Senator Booker is a motherfucking patriot.",
                "The length in itself is a statement.\n\nCan you imagine musk or trump having the self-discipline to do this for 24-hours?\n\nThey'd do it for 13 minutes then say \"I think I've proven I could do it\"",
                "It's remarkable that Cory Booker is willing to literally, physically stand up for over a whole day, and it's nice to see him beat the Senate record previously held by Strom Thurmond. But, the thing that nobody is really talking about is how he admitted that he is \"inadequate\" (his word) for the time, and that he does not know what the hell to do. Nearly every Senator who asked him a question to give him reprieve from the moment also asked him what they are supposed to do; which is concerning. 0 Senators have an answer. They are doing \\*something\\* here, sure. But their response is going to be null if they actually can't figure out what to do."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Palestinian paramedics shot by Israeli forces had hands tied, eyewitnesses say | Gaza",
            "external_url": "https://www.theguardian.com/world/2025/apr/01/palestinian-paramedics-shot-by-israeli-forces-had-hands-tied-eyewitnesses-say",
            "upvotes": 1717,
            "date": "04/02/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/aa4b53d72572c85144df8719dd5aa383abe9b766/0_127_3362_2017/master/3362.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8055f3f6c81bc54345ee4bd260ee64f1",
            "top_comments": [
                "They hate being called out for war crimes but just can't seem to stop themselves from doing them in pretty obvious ways.",
                "You can guarantee this won't appear on r/worldnews",
                "I tried posting this on r/worldnews and my post was taken down rather quickly",
                "S*ome of the bodies of 15 Palestinian paramedics and rescue workers, killed by Israeli forces and buried in a mass grave nine days ago in Gaza, were found with their hands or legs tied and had gunshot wounds to the head and chest, according to two eyewitnesses.*\n\n*The witness accounts add to an accumulating body of evidence pointing to a potentially serious war crime on 23 March, when Palestinian Red Crescent ambulance crews and civil defence rescue workers were sent to the scene of an airstrike in the early hours of the morning in the al-Hashashin district of Rafah, Gaza’s southernmost city.*\n\n*International humanitarian teams were only allowed access to the site this weekend. One body was recovered on Saturday. Fourteen more were found in a sandy grave at the site on Sunday and were brought back for autopsies in the nearby city of Khan Younis.*\n\n*Dr Ahmed al-Farra, a senior doctor at the Nasser medical complex in Khan Younis, witnessed the arrival of some of the remains.*\n\n*“I was able to see three bodies when they were transferred to the Nasser hospital. They had bullets in their chest and head. They were executed. They had their hands tied,’’ Farra said. “They tied them so they were unable to move and then they killed them.”*\n\n*He provided photographs he said he had taken of one of the dead on arrival at the hospital. The pictures show a hand at the end of a long-sleeved black shirt with a black cord knotted around the wrist.*\n\n*Another witness, an official from an international aid agency who took part in the recovery of remains from Rafah on Sunday, also said they saw evidence of one of the dead having been shot after being detained.*\n\n*“I saw the bodies with my own eyes when we found them in the mass grave,” the witness, who did not want his name used for his own safety, told the Guardian in a telephone interview. “They had signs of multiple shots in the chest. One of them had legs tied. One was shot in the head. They were executed.”*\n\n*...*",
                "War Crime #1768. Maybe one day, the Israeli leadership and the goons on the ground will be held accountable for this, but probably not.",
                "Israel is a terrorist state.",
                "Can't wait to see Reddit's resident Israel cheerleaders spin this one...   defending the indefensible time and time again.\n\nEDIT: Hey look, the Israel government's empirically existent online downvote force has arrived...   One of the most pathetic concepts I could even envision, but I guess it goes hand in hand with a sociopathic ethnostate",
                "Israel represents a larger slide into lawlessness.\n\nThis impunity will expand to other actors, countries, and situations. We are all losers.\n\nIf countries don't stand together and enforce judgments then reactions will only be violent. Institutions will unravel.\n\nIt's a universal law of motion. Every action creates a reaction",
                "After 80 YEARS of existence is there truly *nothing more* the United Nations can offer in the face of such atrocity than verbal condemnation?! I don’t have the proper words to describe the inadequacy ",
                "\"they're using hostages ontop of schools and hospitals! They're hiding in the basements\"\n\nAnd it doesn't stop them from bombing."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Actor Val Kilmer, star of 'Batman Forever', dies at 65",
            "external_url": "https://www.reuters.com/world/us/actor-val-kilmer-star-batman-forever-dies-65-nyt-reports-2025-04-02/",
            "upvotes": 17982,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Fair winds and following seas, Iceman.",
                "Damn. He had so many legendary roles in his career. And great comedic chops as well.",
                "I'm your huckleberry. RIP",
                "I highly recommend his 2020 book called I’m your Huckleberry, I just finished it last month. Since he couldn’t read the audiobook, he had three different people read it for him, including Will Forte from SNL. He really lived a great life. Rest in peace.",
                "I wondered for months before the movie came out how Iceman would be portrayed in Top Gun 2, since Val’s illness took his voice away. \n\nIt was a pleasant surprise how they did it, and did right by him to honor his character. \n\nOne of my favorites from the 90s growing up. His guest spot on Entourage was a hilarious surprise. \n\nHe will be missed dearly.",
                "I am glad we got to see him star Top Gun 2. He was a fighter and held on for a long time despite a very aggressive and terrible disease. I hope he is now at peace.",
                "RIP. I'm glad he isn't suffering anymore. he'd been battling cancer for so long",
                "Batman Forever is the one they picked for the headline?",
                "“Star of Batman Forever”… seriously? Rest in peace. Reuters has questionable taste in movies.",
                "Willow. It’s a favorite. What a legend."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "HHS layoffs hit Meals on Wheels and other services for seniors and disabled",
            "external_url": "https://www.npr.org/sections/shots-health-news/2025/04/01/g-s1-57716/hhs-layoffs-seniors-disabled-liheap-acl",
            "upvotes": 324,
            "date": "04/02/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3600x2025+0+172/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F6b%2F1914cfc4456d8075ef2d40cb1e3b%2Fap120314048774.jpg",
            "top_comments": [
                "Elon would say this is \"wasteful spending\". He has no clue what it's like not to be able to buy a meal, what it's like to not be able to go shopping for yourself, what it's like to be alone in your house all day, day after day.\n\nMeals on Wheels is a literal life-saver.",
                "This administration would rather those people just die ",
                "I cannot praise meals on wheels enough. They run affordable to comped meals for seniors and disabled individuals on barebones crews. My mom worked with them for several years. They frequently cooked from scratch with ingredients provided, mostly ran deliveries on volunteer efforts, provided isolated people with not only food and sometimes basic essentials like toiletries, but also provided seniors who could travel meals in social settings. My mom became friends with several seniors at the locations she served, keeping up with their lives until they passed. It was so clear that these services not only provided basic survival to these people, but life enrichment. It is a travesty to see social services like this come to harm.\n\nI saw what my mom and her coworkers went through during covid to keep this service alive. They lost their volunteers and had to manage half staffed. They did it, but it broke a lot of them. These services are run on the backs of hard working people serving their communities. Shame on this government!",
                "I hate this so much. For many seniors, meals on wheels might be one of the few social interactions they’ll have all week.",
                "My adult special needs son says that helping at Meals on Wheels by handing out the meals to all his \"older friends\" is the best part of his Community Connections at Day Support. \n\nThink about that.\nOld people who need nutritional support lose needed hot meals and disabled adults who love finding meaning and purpose by helping to deliver the food lose out as well.",
                "When Elon talks about cutting waste, he's talking about people like this.",
                "Older voters flipped to Orange. This is their reward.",
                "Is is working like intended.",
                "The entire \"doge\" hysterics were always going to end up like this.\n\n\nThey can't \"find nothing\", because that would mean admitting they were wrong. So they have to cut somewhere.\n\n\nGovernment spending is very simple. The top 5 categories that make up 85% of spending are SS, Medicare/Medicaid, defense, VA, and interest expense.\n\n\nYou can't cut interest or defense, so that leaves the other three. Illegal immigrants don't collect any of them, so guess where the cuts are coming from?\n\n\nNobody really ever paused to think that, from an economic perspective, the majority of govt spending goes to helping old and sick people.",
                "Way to go gramps: just had to vote red til you're dead"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Hungarians keep up protests against Orban's move to ban Pride",
            "external_url": "https://www.reuters.com/world/europe/hungarians-keep-up-protests-against-orbans-move-ban-pride-2025-04-01/",
            "upvotes": 1056,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Hate, hate and more hate.",
                "If nothing else, we can take peace in the fact that watching America fall to right wing fascism appears to have been enough of a slap to cause other countries to get serious about expelling their own wannabe dictators.\n\n\nNow if only we could",
                ">Pride goeth before destruction, and an haughty spirit before a fall.\n\n\nAccording to King James."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Susan Crawford wins Wisconsin Supreme Court race, defying Elon Musk",
            "external_url": "https://www.nbcnews.com/politics/elections/wisconsin-supreme-court-election-results-rcna198353",
            "upvotes": 54151,
            "date": "04/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250327-Susan-Crawford-Brad-Schimel-CH-1007-8c869d.jpg",
            "top_comments": [
                "And the margin wasn't even close either.\n\nFL two deep red districts, while staying red, also swung 20 points toward the Dem.  People are not happy, period.",
                "So proud of my state today!",
                "Fuck off Elon. We hate you.",
                "It just feels nice to read a positive headline for once. \n\nCongratulations to Susan, fuck you Elon.",
                "Hello from Wisconsin. Nearly $100M was poured into this race. It was fucking miserable for all of us. We should all be embarrassed that we have let this happen to our democracy.\n\nFuck oligarchs, fuck big money in politics.",
                "Good. Elon's money can't buy everything. ",
                "And Elon spent millions on this race lmao",
                "The thought of Elon coping and seething at this brings me great joy",
                "Well now trump is going to go extra nuclear tomorrow with whatever the plan was instead of firing elon for doing a piss poor job.",
                "Imagine being one of the richest people in human history and you still fail to use your unimaginable wealth to blatantly manipulate votes in a state election.\n\nIt's hard for me to think of anyone who has ever existed that is a bigger loser than Elon Musk."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Sen. Cory Booker’s speech in protest of Trump breaks the Senate record",
            "external_url": "https://apnews.com/live/donald-trump-news-updates-4-1-2025",
            "upvotes": 27537,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Booker broke a record previously held by Strom Thurmond, a segregationist who filibustered for 24 hours and 18 minutes against the Civil Rights Act of 1957, according to the Senate’s records.\"\n\n\nNice",
                "He beat Strom Thurmond. And unlike Ted Cruz, he didn't read from Dr. Seuss or the phonebook, but rather recited letters and personal accounts from Americans. \n\nWell done.",
                "He's stopping at 25 hours. The strength of this man is admirable. He's had over 100k watching for the last hour.",
                "Over 25 hours before he finally rested. Bravo sir, and may your pillow be extra cold when you sleep tonight.",
                "Good. Strom Thurmond was an abhorrent scumbag. The fact that South Carolina had him in office until he was a century old is nothing short of shameful.",
                "The coolest part is that the record was originally set by a racist piece of shit who was filibustering *The Civil Rights Act*",
                "This was Crazy ……than man has stood up for 24 hours …I wonder if Trump ever stood up for 24 hours in his entire life 🤔🤔",
                "I may not agree with 100% of what he stands for, but will be the first to say that Senator Booker is a motherfucking patriot.",
                "The length in itself is a statement.\n\nCan you imagine musk or trump having the self-discipline to do this for 24-hours?\n\nThey'd do it for 13 minutes then say \"I think I've proven I could do it\"",
                "It's remarkable that Cory Booker is willing to literally, physically stand up for over a whole day, and it's nice to see him beat the Senate record previously held by Strom Thurmond. But, the thing that nobody is really talking about is how he admitted that he is \"inadequate\" (his word) for the time, and that he does not know what the hell to do. Nearly every Senator who asked him a question to give him reprieve from the moment also asked him what they are supposed to do; which is concerning. 0 Senators have an answer. They are doing \\*something\\* here, sure. But their response is going to be null if they actually can't figure out what to do."
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "RISING",
            "title": "At least 2,700 people killed in Myanmar earthquake as aid agencies concerned about access to food, water and medicine",
            "external_url": "https://www.abc.net.au/news/2025-04-02/myanmar-earthquake-death-toll-rises-water-food-shortages/105124958?utm_source=abc_news_app&utm_medium=content_shared&utm_campaign=abc_news_app&utm_content=link",
            "upvotes": 459,
            "date": "04/02/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/5be9e6d9e471787db328433bf2ab0512?impolicy=wcms_watermark_news&cropH=1396&cropW=2482&xPos=39&yPos=0&width=862&height=485&imformat=generic",
            "top_comments": [
                "In the past there would’ve been us Air Force planes full of shit and people already on the ground.  This is embarrassing and shameful.  Sorry world.  I’m really not even sure what my tax dollars are paying for because we don’t have shit here either.",
                "The actual toll will probably be 4-10 times higher as is often the case with such major natural disasters.",
                "In before American conservatives try to explain why it’s a good thing to cut off USAID.",
                "There’s currently a civil war ongoing. I wonder if this will eventually lead to that wrapping up like the Aceh insurgency after the 2004 earthquake. Then again, Myanmar has pretty much constantly had some sort of civil war since independence in 1948.",
                "*The country's military ruler, Min Aung Hlaing, said Friday's magnitude-7.7 quake was expected to surpass 3,000 deaths, having reached 2,719 on Tuesday, with 4,521 people injured and 441 missing.*\n\nClimate crisis combined with poor construction, equates to death and depredation."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Sackets Harbor community calls for return of three children taken during ICE dairy farm visit",
            "external_url": "https://www.northcountrypublicradio.org/news/story/51511/20250331/sackets-harbor-community-calls-for-return-of-three-children-taken-during-ice-dairy-farm-visit",
            "upvotes": 1358,
            "date": "04/01/2025",
            "thumbnail": "https://www.northcountrypublicradio.org/news/images/250331SacketHarborCSDBuildingWebsitePhoto.jpg",
            "top_comments": [
                "wow, I feel so much safer with those children gone, thanks Republicans.  Frist you save me from pronouns and DEI, and now three children.",
                "*\"He explained to me how detrimental and how terrifying it was to see those kids \\[taken\\] by masked, armed Homeland Security agents and ICE agents, handcuffed and put in the van, and escorted off his far...,\"  DeCillis says the farmer described his workers - and the children - as his family.* \n\nAll three children/teens are productive local students.",
                "With ice acting this way we are doomed to see waco 2.0",
                "Are we sure they're even in the country anymore? This administration is cruel and twisted",
                "They are one small step from killing people. This has to be stopped.",
                "I wish there was a visual to go with this story. A video of this family working on the farm and the kids in school and then masked men hauling them away. This needs to be seen to reach this country. All farmers who value their workers should video document what their workers do on the farms because who is going to do their work once they are gone?  The laid off Federal workers….I doubt that.",
                "The same county that voted 61.8% for Trump…",
                "This is a heavily Republican area of Northern NY state. They likely voted for this.",
                "Why was a third grader working at a dairy farm?"
            ],
            "aggregate_sentiment": 32.0
        },
        {
            "category": "RISING",
            "title": "Bankruptcy judge denies J&J settlement plan related to baby powder containing talc",
            "external_url": "https://abcnews.go.com/Business/wireStory/bankruptcy-judge-denies-jj-settlement-plan-related-baby-120367510",
            "upvotes": 535,
            "date": "04/01/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8478001b-9461-45c2-8e75-0a3fc79c08ef/wirestory_92635cde7709ede6712a6a56b1342ee2_16x9.jpg?w=1600",
            "top_comments": [
                "They keep trying to throw the baby powder out with the bath water.  This is their third try at it.",
                "Here's the part of this case that has mystified me throughout:\n\n\nIn 1982-83, I was in sixth grade, aged 11-12.  The science class I had that year was heavily focused on geology.  Two things that I learned about talc that year were that (a) it's what baby powder is made from and (b) it's often contaminated with asbestos.  \n\n\nAt age 12, in 1983, from paying attention to my sixth grade science class, I understood the hazard that baby powder represented.\n\n\nA fucking twelve year old kid understood this over forty years ago.  Why didn't anyone else seem to understand this until maybe ten years ago?",
                "They call it talk powder when its asbestos!",
                "In order to fund their court costs, J&J launches new Asbest-O's breakfast cereal.",
                "This has been one of those interesting cases where science points one way and the courts (and public opinion) have run the other. There's a number of reasons that courts can diverge from scientific consensus, but what I find really curious is how the bias against the weight of evidence is also over represented in Internet searches and AI responses.\n\nYou'd think that given a company with resources like J&J they would be more effective of getting their narrative out but you have to get pretty deep into a search engine to find critical analysis of the talc claims. And it would be one thing if the critical analysis were coming from small organizations or orgaorg without much prestigious, but that's not the case. \n\nthe American Cancer Society (ACS) states that research on talc and ovarian cancer “have been mixed, with some studies reporting a slightly increased risk and some reporting no increase … For any individual woman, if there is an increased risk, the overall increase is likely to be very small.”\n\nThe NCI concludes that “the weight of evidence does not support an association between perineal talc exposure and an increased risk of ovarian cancer.”\n\nSo you've got two major cancer based orgs stating that the evidence is either weak or absent, and yet their messages are not ones you'd come across readily with a quick search asking about the evidence. \n\nIt's probably because this topic is on the more nuanced end of the spectrum where you have to really look at how to weigh different studies in determining whether there's a cause and effect connection, and it's one most of us just don't have the skill sets to interpret correctly",
                "They should ask Trump for a parson…they’ve poisoned the middle class and he’s sure to let them off for it"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Mississippi governor signs typo tax overhaul bill into law to phase out income tax",
            "external_url": "https://apnews.com/us-news/taxes-tate-reeves-mississippi-general-news-573ad75c52cb94af8f8adc90d1cd5e96",
            "upvotes": 2870,
            "date": "04/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I couldn't find what the typo was in this article. So I had to look [around](https://mississippitoday.org/2025/03/24/how-did-the-mississippi-typo-tax-swap-act-of-2025-happen-legislative-recap/). For anyone else wondering:\n\nThe latter parts of the tax reduction only occur:\n\n>when revenue surplus equals 85% or more of the cost of a 1% cut in the tax rate.\n\nBut the bill was passed and signed as `.85%`. So the cuts are almost guranteed to continue.",
                "Good god, MS. You really are a sitcom at this point:\n\n\"The Senate bill had typos that essentially nullified the growth triggers and would eliminate the income tax nearly as quickly as the House proposed. The House passed the flawed bill on to the governor, who signed it into law Thursday.\"",
                "If those Mississippi legislators could read they'd be very upset",
                "So they say Mississippi is open for business and a bunch of people will move there. Do people really want to live there with no schools, libraries, hospitals, or maybe even fire stations and police? They already can't pay for these things, what is going to happen with no income tax?",
                "These paragraphs explain how the typo affected things:\n\n>House leaders have long pushed to eliminate the state personal income tax in relatively short order. The Senate had urged a longer-term approach, arguing it would be unwise to slash a third of the state’s revenue in uncertain economic times. Senators last week had conceded to eliminate the income tax, but only with economic growth “triggers” as safeguards — the tax wouldn’t phase out unless the state saw robust economic growth and controlled spending. It would have likely taken many years.\n\n>Or so they thought. The Senate bill had typos that essentially nullified the growth triggers and would eliminate the income tax nearly as quickly as the House proposed. The House passed the flawed bill on to the governor, who signed it into law Thursday.",
                "Nothing screams \"governing with competence\" like accidentally fast-tracking a massive tax overhaul \\*because of typos\\*. This wasn’t just a clerical hiccup. This is generational economic policy passed by people who \\*didn’t read the fine print\\*. Or maybe they did and hoped no one else would. Either way, Mississippi just gave its wealthiest residents a high-five and told the working poor to budget harder. \n\n\n\nThey’ll tell you it’s bold reform. But behind the curtain? It’s austerity cosplaying as prosperity.",
                "As a lifetime Mississippi resident, let me assure you - we don’t hide our idiots away, we put them in political positions such as Governor.",
                "Stop giving this deadbeat red state more federal money than it kicks in.",
                "Wait until y'all find out [why we no longer have ballot initiatives ](https://apnews.com/article/ms-state-wire-mississippi-marijuana-health-4f81d577aeb2ed8a04849f62c86c707e)",
                ">Or so they thought. The Senate bill had typos that essentially nullified the growth triggers and would eliminate the income tax nearly as quickly as the House proposed. The House passed the flawed bill on to the governor, who signed it into law Thursday.\n\n>In a social media post last week, Reeves, who did not mention the bizarre series of events that helped send the bill to his desk, said “liberal activists” were “making claims of errors, omissions, mistakes, and changes.” Since then, both House Speaker Jason White and Lt. Gov Delbert Hosemann, both Republicans, have acknowledged the legislation signed into law Thursday contained errors.\n\n>Hosemann downplayed the typos at the ceremony.\n\n>“Some of y’all are focused on a typo in the bill, and I’d use the biblical analogy, let he who has not had a typo cast the first stone.”\n\nDamn liberal activists, being right.  Just deflect it and prey on the praying!"
            ],
            "aggregate_sentiment": 42.0
        }
    ],
    "last_updated": "04/02/2025 08:12:09 UTC"
}