{
    "posts": [
        {
            "category": "HOT",
            "title": "Biden diagnosed with ‘aggressive form’ of prostate cancer",
            "external_url": "https://www.cnn.com/2025/05/18/politics/joe-biden-prostate-cancer",
            "upvotes": 42178,
            "date": "05/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2193208062.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Former US president Joe Biden has been diagnosed with prostate cancer, a statement from his office said on Sunday.\n\n>Biden, 82, was diagnosed on Friday after he saw a doctor last week for urinary symptoms.\n\n>The cancer is characterised by a Gleason score of 9 with metastasis to the bone, his office said, meaning it is a more aggressive form of the disease.\n\n>Biden and his family are said to be reviewing treatment options, the statement said. The former president's office added that the cancer is hormone-sensitive, meaning it can likely be managed.\n\n>This is a developing story.\n\n>This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version.\n\n/saved you a click. Sad news.",
                "As someone who has had a father and a grandfather who were both diagnosed with early onset prostate cancer, my heart goes out to Biden and his family. A Gleason 9 score with bone involvement is not good news. \n\nProstate cancer typically is very slow growing and easily catchable in the early stages. However, every now and then there are some really nasty aggressive forms. Unfortunately, it sounds like the former president might be dealing with the latter. I’ll be praying for him.",
                "‪Fuck prostate cancer. Lost my dad and so many other family members to it. Regardless of your politics, don’t wish cancer on anyone. Prayers up Mr. President. ‬ may we one day have a cure for this awful disease.",
                "Biden has viewed cancer as one of the most important changes he can make in his position for the past decade. His experience with losing Beau clearly made it a health policy focus, and it’s reflected in the research programs he helped establish and re-establish through the Cancer Moonshot effort. \n\nI hope he has the opportunity to benefit from the care he helped enable.",
                "Fuck cancer.  I lost my mom to it and I would give my own life to have taken away the pain and degeneration she faced in her final year.  \n\nI hope for the best for Biden and his treatment, and my heart goes out to the whole Biden family.",
                "Seems like the writing’s on the wall and wish we could skip the shitshow that’ll inevitably ensue",
                "The hate on FoxNews page is absolutely horrible.\n\nThe nicest comment was something along the lines of, \"horrible president, don't wish this on him, but he might deserve it.\"\n\nThe fuck is wrong with these people.",
                "How long until Trump says something awful about it?",
                "That’s rough. Absolutely fuck cancer.",
                "I'm still recovering from having my prostate removed last Wednesday, due to prostate cancer with the score of Gleason 7.  I'm still in that awful period where I have to wear a catheter. I just got the pathology results that showed the surgeon got it all and hopefully there  should be none remaining in the body. Best day of my life. Biden's Gleason 9 is a pretty poor diagnosis. I wish him well and a positive result."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Primary school evacuated after student brings in a grenade for show and tell",
            "external_url": "https://www.the-independent.com/news/uk/home-news/grenade-osmaston-school-evacuation-derbyshire-b2752851.html",
            "upvotes": 2602,
            "date": "05/19/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/17/10/00/iStock-1018660080.jpeg?trim=83,0,83,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                ">“It was quite an eventful assembly,” said Mrs Hart. “It was going fine and there was a boy who brought an old bullet case in, which I knew about, but then his friend produced a hand grenade from his pocket. That, I was not expecting.”\n\nPoor kid who brought in the bullet case must have been feeling so good thinking, *\"What a badass I am\"* before his friend followed it up with the grenade. Crushing.",
                "Brick where did you get a hand grenade?",
                "Someone in my class brought one in in middle school. It was defused but a real grenade. The teacher played a prank by rolling into the other classroom right up to the other teachers feet. Everyone laughed and I went home that day. This was pre-9/11.",
                "Better to learn now than on the streets",
                "I remember bringing in a Hamilton Model 27 .22 caliber boys rifle to school for my son to use for a show and tell.\n\nI called the principal to see if I needed to case it up when I brought it in, and he said, \"Nope, just stop at the office.\"\n\n1990, obviously. \n\nFast forward to now, his autistic son made a comment about shooting  an Uzi and now has to be searched every morning before school, while escorted by his father.\n\nI get it, but he has trouble sometimes with impulsive talk.\n\nHe is 11, and I feel bad for him.",
                "Article completely left the most important part out: Did he count to three, no more, no less?",
                "I almost did this as a kid. It was a much simpler time back then.",
                "Say what you will but if the goal of show and tell is to share your story then I'd say this kid blew the assignment out of the water. I'm honored and confused to learn about his family's heirloom grenade.",
                "Why evacuate the entire school when you could have just evacuated the grenade? It’s not like there was a fear there was an arsenal to go with it.",
                "My dad was the town GP and did a lot of housecalls. According to staff at the local clinic, he was the first and last person a lot of people in town ever saw. \n\nHe had a box in the garage filled with all kind of stuff that he'd taken out of his medicine bag. Expired medicine, gadgets gifted by medical reps, equipment he didn't need at the moment, you name it.\n\nAs a kid, the box fascinated me. One morning, I remembered that I needed to bring something to school for show-and-tell and decided to take something from the box. Without telling my parents.\n\nMom was called in to come get the speculum I'd chosen. Dad found it hilarious. Mom was not impressed. \n\n(We'd later raid his bag and use the surgical tubing in our slingshots. We could shoot a glass marble through an empty oil can with those. It's a miracle we didn't maim anyone. )"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Oklahoma high schools to teach 2020 election conspiracy theories as fact",
            "external_url": "https://www.theguardian.com/us-news/2025/may/17/oklahoma-high-schools-election-conspiracy-theories",
            "upvotes": 33096,
            "date": "05/18/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/16b2b84aeae19cad575afd8829f50cd8f82c7f2d/271_0_3118_2494/master/3118.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=968bba047d85bc933cf6b80361ca1617",
            "top_comments": [
                "Big move from the “schools are indoctrinating our kids!” crowd",
                "Their idea is to radicalize an entire generation.",
                "they have to defend their position, ranked - 49th out of 50.  another sickening waste.",
                "They've been writing their own history based on their 'alternative facts' this whole time. It is wild watching the victors revise and rewrite history in real time to suit their twisted agenda.\n\nThe kids already can't read as it is. This isn't the first bullshit Oklahoma wants to ram into children's minds. They're on about creationism and the ten commandments there, too. No wonder their education consistently ranks at or near the bottom of nearly every single metric conducted by nearly every single study.",
                "Reminds me of a college course I took, where a segment of that class covered \"Unlearning what I learned in school.\" And it was things like, the truth about Christopher Columbus.\n\nThese Oklahoma kids are going to need a whole semester dedicated to \"Unlearning what I learned in school.\" Going line by line of everything they learned and how it was debunked.\n\nIronically, MAGA will cry \"indoctrination\" but that's exactly what is going on in high school. Indoctrinating kids with a history of debunked theories taught as historical facts. Why? Because this guy wants to promote himself in the MAGA circle. Get to a higher level of the MAGA grift.",
                "From the state that tried to require the Trump bible in every school?  Shouldn’t shock anyone.  Crazy and infuriating time period we live in.",
                "Colleges shouldn’t accept their diplomas.",
                ">As part of his revisions, Walters also proposed removing education about Black Lives Matter and George Floyd’s murder, Tulsa’s NBC affiliate KJRH\n\nI hate this timeline",
                "I can’t imagine being so butthurt about a politician, one who couldn’t care less about Oklahoma, losing an election that it would ever even occur to me to make up a rigged election story, much less mandate the fantasy into educational curriculum. MAGA insecurity is a hell of a drug.",
                "Ranked #49/50 for a reason!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "FBI says suspect in US fertility clinic blast had 'nihilistic ideations'",
            "external_url": "https://www.bbc.com/news/articles/c787j90wp6po",
            "upvotes": 5940,
            "date": "05/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3c77/live/d21852f0-33fc-11f0-9fcc-0f444dbba5ff.jpg",
            "top_comments": [
                "> The FBI said they believe he is the sole fatality in the incident.\n\n\nGreat news.",
                "[removed]",
                "We believe in nothing, Lebowski. Nothing. And tomorrow we come back and we cut off your chonson",
                "Not sure they understand the words they're using there.\n\nA nihilist wouldn't be all that concerned with whether or not people have kids since nothing matters anyway",
                "Based on what I’ve read, he was allegedly an antinatalist, so this will be a very different scenario from what a lot were first hypothesizing.",
                "[removed]",
                "“the suspect used a 2010 silver Ford Fusion sedan”\n\nIt was a fusion bomb!",
                "This aggression will not stand.",
                "Man looking at these comments I would assume most of these are bots but even bots aren’t this stupid.",
                "Call it what it is, a terrorist attack. Not a blast."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "7 escaped New Orleans jail inmates still at large as search enters third day",
            "external_url": "https://www.cbsnews.com/news/new-orleans-inmates-escape-update/",
            "upvotes": 1656,
            "date": "05/18/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/18/003c47cd-37f8-4812-b3e3-a6142740696a/thumbnail/1200x630/cea96c2976cdaa498e8a9fae08680039/image.png?v=6df9366690ed146f169dd0670c453f91",
            "top_comments": [
                "Update:\n\nhttps://www.wdsu.com/article/new-orleans-jail-inmate-escape-lockdown/64793237\n\nhttps://kpel965.com/louisiana-authorities-under-fire-orleans-parish-jail-escape/\n\nSheriff Susan Hutson believes those who escaped received help from individuals inside the Orleans Parish Sheriff’s Office. Hutson said the inmates would have needed a tool that they couldn't access to dig the hole in the wall of the cell.",
                "Have they tried looking outside the prison yet?",
                "Most recent video showing two of them wearing new clothes.\n\nhttps://www.wdsu.com/article/new-video-two-escaped-inmates-in-french-quarter/64805151",
                "I wonder what their crimes were?",
                "I give it a 0% chance that this goes into June",
                "How dumb do you have to be to go out in public after an escape? And not only in public but the tourist hotspot in your area?? \n\nAt least hide out at a home somewhere for a few months till the trail goes cold!",
                "Yeah they ran through the briars and they ran through the brambles\nAnd they ran through the bushes where a rabbit couldn't go\nThey ran so fast that the hounds couldn't catch'em\nOn down the Mississippi to the Gulf of MEXICO",
                "Am I the only one who kind of secretly always roots for escaped convicts?",
                "“Do not seek the treasure!”",
                "Here, a video with pictures of all of them plus description of the felonies.\n\nhttps://youtu.be/TBc9qc67Ngs?si=x1Goa4MPoM_tiWdp"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Guy Bartkus, law enforcement sources name ‘pro-mortalist’ as suspect in Palm Springs IVF clinic explosion",
            "external_url": "https://www.the-independent.com/news/world/americas/crime/guy-bartkus-palm-springs-fertility-clinic-b2753287.html",
            "upvotes": 3145,
            "date": "05/18/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/18/18/55/Guy-Butkus.jpeg?trim=508,0,227,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "So not anti-abortion, just anti-birth in general?  Makes more sense why an IVF center was targeted but it makes it all most messed up.  He is against bringing people into the world against their will but seems okay in sending people back against their will.",
                "“Pro-mortalist”\n\n*blows himself up*\n\nOk buddy",
                "> Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nWhen you fall for the propaganda too hard.",
                "Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nIn addition to his writings, Bartkus also recorded a 30-minute audio clip describing his motives.\n\n“I figured I would just make a recording explaining why I’ve decided to bomb an IVF building, or clinic. Basically, it just comes down to I’m angry that I exist and that, you know, nobody got my consent to bring me here,” he said in the recording.\n\nHe must have been an absolute joy to live with. Essentially it sounds like he was suicidal, and also incredibly resentful and selfish. \"I don't want to exist, so other people can't exist,.either\"? \n\n None of us gave consent to be here.   Not a single one.",
                "This honestly sounds like suicide but with more steps. What happened to crazy people like this doing death by police?",
                "“Guy Bartkus” exactly the name one would have when doing what he did.",
                ">According to several reports, the suspect died in the attack.\n\nWell, then. One dead anti-mortalist.",
                "[removed]",
                "[removed]",
                "\"pro-mortalist\"? \"nihilistic ideations\"? Why are these terms being used?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Tornado warnings delayed because of DOGE cuts",
            "external_url": "https://www.mesoscalenews.com/p/tornado-warnings-delayed-because",
            "upvotes": 64,
            "date": "05/19/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbf1204d0-dd21-493d-b55a-0394aebc6880_1800x2250.jpeg",
            "top_comments": [
                "But think of the money nobody saved.",
                "Something something votes matter."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump cuts to National Weather Service leave Kentucky offices understaffed",
            "external_url": "https://www.kentucky.com/news/politics-government/article306549111.html",
            "upvotes": 15346,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Shit like this is going to keep happening, too. Fuckin sucks, man.",
                "Well, if it isn't the predictable result of the actions taken since 47 took office.",
                "\"More than 600 National Weather Service staff out of more than 4,200 were fired or took early retirement since January, according to Fahy. That’s the same number of people who left the service over a 15-year period from 2010 to early January, Fahy said.\"\n\n\"Tornado-spawning storms leave 25 dead in 2 states and swaths of destruction across central US\"\n\nPeople are dead due to the NOAA cuts of the Trump admin. Disgusting",
                "Can confirm,  we had a tornado touch down 5 miles away and received no alerts. We were watching the news but our area had major outages and a phone alert could have been the difference for some people seeking shelter.",
                "That’s one way to stop the democrats weather machine.",
                "\"On election night, Kentucky voted Republican for former president Donald Trump by a wide margin for the third time in a row, with him winning the state by 30.53%, a considerable increase from his 25.94% victory in 2020 and to a lesser extent his 29.84% victory in 2016.\"",
                "So... we are cutting essential personnel so that the President can have a nice big military parade and billionaires can get another tax cut\n\ncool, cool",
                "lmao just wait until hurricane season rolls around, it’s gonna get real bad.",
                "A LOT of residents in red states have no idea that so much of what seems like basic services have been funded by federal money coming directly from blue states. They are the \"welfare queens\" they complain about and they always have been. They're like house cats. They have a mistaken idea that they're fiercely independent, while being completely dependent on a complex system they neither appreciate nor understand.",
                "Kentucky here. We got a warning - finally - through somebody making a facebook post nearby that a tornado had touched down. Then we lost power, so anyone not USING FACEBOOK on their PHONES had no idea."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Mexican Navy training ship strikes Brooklyn Bridge",
            "external_url": "https://www.cnn.com/2025/05/17/us/manhattan-brooklyn-bridge-ship",
            "upvotes": 7275,
            "date": "05/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/05-gettyimages-2215097286.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "There were people on the masts...",
                "[FYI](https://www.nytimes.com/2025/05/17/nyregion/brooklyn-bridge-ship-crash-nyc.html?smid=nytcore-ios-share&referringSource=articleShare&sgrp=c&pvid=0EA689FF-AC34-4C3B-A5F8-C6BABE486D56) “The crash happened days before the beginning of Fleet Week in New York on May 21. **The event, in which sailors from the United States and other navies around the world converge on the city, features a parade of ships around Manhattan**.”",
                "truly the most unlucky accident that could've happened bar it being a canadian ship. \n\nthis is going to go so incredibly stupidly i can already see the posts",
                "Paywall Removed: [https://archive.is/fVtpJ](https://archive.is/fVtpJ)\n\n* Edit: Link and content below updated.\n\n# A Mexican Navy training ship struck the Brooklyn Bridge, killing at least 2. Here’s what we know\n\nAt least two people were killed and about 20 injured when a Mexican Navy training ship on a global goodwill tour struck the underside of the Brooklyn Bridge in New York Saturday night, officials said.\n\nThere were 277 people on the sailing ship, called the Cuauhtémoc, at the time of the incident and everyone is believed to be accounted for, officials said Saturday\n\n[Related live-story: 2 dead after Mexican Navy training ship carrying more than 200 people strikes underside of Brooklyn Bridge](https://archive.is/o/fVtpJ/https://www.cnn.com/us/live-news/brooklyn-bridge-mexican-navy-ship-05-18-25-hnk)\n\nDramatic video shows the Cuauhtémoc’s masts hitting the underside of the bridge and breaking as the vessel passes underneath, with pieces falling down toward the deck.\n\nHere’s what we know:\n\n**What happened**\n\nThe incident occurred around 8:20 p.m. local time as the ship was departing from New York’s Pier 17, where it had been docked at the South Street Seaport Museum for five days of public viewing.\n\nThe ship’s masts – bedecked in lights - struck the bridge, breaking on impact and sending debris falling onto the vessel’s deck.\n\nNew York City Mayor Eric Adams said the ship lost power. City officials earlier said “mechanical issues” may have caused the incident, but cautioned all information so far is preliminary. An investigation is ongoing.\n\nThe New York Fire Department said in an email to CNN it received the call that a ship had struck the bridge around 8:39 p.m. More than 100 fire and emergency medical service personnel responded to the scene, NYFD said in its email.\n\nVideo of the Mexican Navy training ship shortly after it struck the Brooklyn Bridge showed people hanging from at least one of its masts. On tall ships like the Cuauhtémoc, it is a ceremonial tradition for sailors to climb the masts and rigging when departing or arriving into harbor.\n\n“We could see some people being kind of dragged,” an eyewitness, Flavio Moreira, told CNN. “I believe it was some of the staff, they were on the top of the boat. And they were swinging around, back and forth as soon as the ship hit the bridge.”\n\n**Multiple killed**\n\nTwo people were killed and two remain in critical condition, Adams said. The two who died fell from one of the ship’s masts, the law enforcement official told CNN. They were pronounced dead after being taken to a nearby hospital, the official said.\n\n“At this time, of the 277 on board, 19 sustained injuries, 2 of which remain in critical condition, and 2 more have sadly passed away from their injuries,” Adams [wrote on X](https://archive.is/o/fVtpJ/https://x.com/NYCMayor/status/1923956324737351832).\n\nThe Mexican Navy said earlier a total of 22 people were injured, 19 of whom were taken to hospitals.\n\nMexican President Claudia Sheinbaum said the two people killed were crew members and sent her condolences to their families.\n\n“We are deeply saddened by the loss of two crew members of the Cuauhtémoc Training Ship, who lost their lives in the unfortunate accident in New York Harbor. Our sympathy and support go out to their families,” Sheinbaum said in a post on X early Sunday.\n\nSheinbaum said the Mexican Navy is supporting those injured in the incident, and that the Mexican ambassador to the United States and Mexican Consulate General were supporting the navy.\n\n**An investigation underway**\n\nThe ship appeared to lose power around 8:20 p.m. as the captain was maneuvering the ship, which forced the vessel toward the bridge’s pillar and the ship’s mast struck the bridge, New York Police Department Chief Wilson Aramboles said at a news conference Saturday.\n\nThe National Transportation Safety Board is conducting an investigation.\n\nMexican authorities described the Cuauhtémoc ship as a steel-hulled three-masted barque with a length of around 300 feet and a height of roughly 160 feet, a 2024 [news release](https://archive.is/o/fVtpJ/https://sailleeuwin.com/news-stories/cuauhtemoc-press-release-australia-nz-2024/) from one of its training cruises said.\n\nGovernment [documents](https://archive.is/o/fVtpJ/https://nauticalcharts.noaa.gov/publications/coast-pilot/files/cp2/CPB2_C09_WEB.pdf) show the Brooklyn Bridge has a navigational clearance of 127 feet, roughly 30 feet shorter than the height of the sailing ship.\n\nThere was no visible damage to the Brooklyn Bridge, which appeared to be left structurally intact.\n\n“While inspections will remain ongoing, there are no signs of structural damage to the Brooklyn Bridge,” NY Department of Transportation said in a [post](https://archive.is/o/fVtpJ/https://x.com/NYC_DOT/status/1923934086554349869) on X.\n\nTraffic was temporarily closed in both directions for about 40 minutes as emergency services responded to the scene. It was later reopened following a preliminary inspection, Adams said.\n\nThis ship has been moved to Manhattan’s Pier 36, located along the East River less than a mile from the Brooklyn Bridge, according to the law enforcement official.\n\n**What do we know about the ship?**\n\nThe Cuauhtémoc is a training sailing ship of the Mexican Navy and described by officials as a diplomatic symbol of Mexico abroad.\n\nKnown as the “Ambassador and Knight of the Seas,” the ship was in New York as part of a global goodwill tour and was en route to Iceland at the time of the incident.\n\nA spokesperson for the New York City-area [Sail4th 250](https://archive.is/o/fVtpJ/https://www.sail4th.org/) events told CNN that the Cuauhtémoc ship had “welcomed dignitaries and media” as part of its New York stop on its global tour.\n\nThe sailing ship was expected to join the parade of international tall ships to celebrate the United States’s 250 anniversary on July 4, 2026 – in what the event is calling “the largest-ever flotilla of tall ships from around the world.\n\n”Built in Spain in 1981, the ship was acquired by the Mexican Navy to train cadets and officers. It regularly takes part in major regattas around the world. According to a [news release ](https://archive.is/o/fVtpJ/https://sailleeuwin.com/news-stories/cuauhtemoc-press-release-australia-nz-2024/)from one of its global cruises, it was used for training by the Heroic Naval Military School, an elite military academy in Mexico.\n\nThe ship, as of last year, had visited 212 ports in 64 countries with 756,085 nautical miles sailed, the latter equivalent to making 35 trips around the world, the release said.\n\nThis story has been updated with additional information.",
                "Wonder how long he'll have caps lock on this time",
                "Omg 🤦‍♀️ we all know where this is going…",
                "prez is going to call it an international conflict /smh",
                "I got scared i thought this was the baltimore bridge incident times 10",
                "Videos:\n\n* [Just watched the Brooklyn Bridge get smoked live by a boat with a massive Mexican flag](https://x.com/TheWillieNelson/status/1923902044051550591)\n* [A massive pirate ship just hit the Brooklyn Bridge](https://x.com/Corso52/status/1923898855763972396)",
                "This is like those bikers that run into parked cars. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "One dead after bomb explodes outside reproductive center in Downtown Palm Springs",
            "external_url": "https://thepalmspringspost.com/one-dead-after-bomb-explodes-outside-reproductive-center-in-downtown-palm-springs/",
            "upvotes": 42226,
            "date": "05/17/2025",
            "thumbnail": "https://thepalmspringspost.com/wp-content/uploads/2025/05/Bombed-Building-Chris-Andersen-scaled.jpeg",
            "top_comments": [
                "Hopfully it was the idiot who planted it.",
                "Okay but from everything I'm reading this was straight up an IVF clinic? Where people who desperately WANT babies come?\n\nWhat the actual fuck.",
                "Actual domestic terrorism.",
                "I have family at desert regional across the street. My sister in law was in the parking lot waiting in the car with windows down saw the explosion and was rocked by the shock wave. She said her ears are still ringing from it and there’s people that got injured by debris from the car bomb. They are currently locked down in the hospital.",
                "Fun fact: this was NOT an abortion center. They don’t even provide abortion, or anything like it, as a service. It was an IVF facility. 🤷🏻‍♀️",
                "So Google says this clinic is closed on Saturdays. It takes a lot of planning to create a bomb that big, but then they set it off when the building was not in use?",
                "[removed]",
                "Caused by someone who is \"pro life\"",
                "[ Removed by Reddit ]",
                "One of my siblings was there having lunch nearby and, thankfully, only heard the explosion. They left immediately and, before the news reported it, they were under the impression that a meth lab had blown up.\n\nWhoever did this deserves to rot in hell."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Tornado warnings delayed because of DOGE cuts",
            "external_url": "https://www.mesoscalenews.com/p/tornado-warnings-delayed-because",
            "upvotes": 66,
            "date": "05/19/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbf1204d0-dd21-493d-b55a-0394aebc6880_1800x2250.jpeg",
            "top_comments": [
                "But think of the money nobody saved.",
                "Something something votes matter."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Primary school evacuated after student brings in a grenade for show and tell",
            "external_url": "https://www.the-independent.com/news/uk/home-news/grenade-osmaston-school-evacuation-derbyshire-b2752851.html",
            "upvotes": 2606,
            "date": "05/19/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/17/10/00/iStock-1018660080.jpeg?trim=83,0,83,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                ">“It was quite an eventful assembly,” said Mrs Hart. “It was going fine and there was a boy who brought an old bullet case in, which I knew about, but then his friend produced a hand grenade from his pocket. That, I was not expecting.”\n\nPoor kid who brought in the bullet case must have been feeling so good thinking, *\"What a badass I am\"* before his friend followed it up with the grenade. Crushing.",
                "Brick where did you get a hand grenade?",
                "Someone in my class brought one in in middle school. It was defused but a real grenade. The teacher played a prank by rolling into the other classroom right up to the other teachers feet. Everyone laughed and I went home that day. This was pre-9/11.",
                "Better to learn now than on the streets",
                "I remember bringing in a Hamilton Model 27 .22 caliber boys rifle to school for my son to use for a show and tell.\n\nI called the principal to see if I needed to case it up when I brought it in, and he said, \"Nope, just stop at the office.\"\n\n1990, obviously. \n\nFast forward to now, his autistic son made a comment about shooting  an Uzi and now has to be searched every morning before school, while escorted by his father.\n\nI get it, but he has trouble sometimes with impulsive talk.\n\nHe is 11, and I feel bad for him.",
                "Article completely left the most important part out: Did he count to three, no more, no less?",
                "I almost did this as a kid. It was a much simpler time back then.",
                "Say what you will but if the goal of show and tell is to share your story then I'd say this kid blew the assignment out of the water. I'm honored and confused to learn about his family's heirloom grenade.",
                "Why evacuate the entire school when you could have just evacuated the grenade? It’s not like there was a fear there was an arsenal to go with it.",
                "My dad was the town GP and did a lot of housecalls. According to staff at the local clinic, he was the first and last person a lot of people in town ever saw. \n\nHe had a box in the garage filled with all kind of stuff that he'd taken out of his medicine bag. Expired medicine, gadgets gifted by medical reps, equipment he didn't need at the moment, you name it.\n\nAs a kid, the box fascinated me. One morning, I remembered that I needed to bring something to school for show-and-tell and decided to take something from the box. Without telling my parents.\n\nMom was called in to come get the speculum I'd chosen. Dad found it hilarious. Mom was not impressed. \n\n(We'd later raid his bag and use the surgical tubing in our slingshots. We could shoot a glass marble through an empty oil can with those. It's a miracle we didn't maim anyone. )"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "7 escaped New Orleans jail inmates still at large as search enters third day",
            "external_url": "https://www.cbsnews.com/news/new-orleans-inmates-escape-update/",
            "upvotes": 1662,
            "date": "05/18/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/18/003c47cd-37f8-4812-b3e3-a6142740696a/thumbnail/1200x630/cea96c2976cdaa498e8a9fae08680039/image.png?v=6df9366690ed146f169dd0670c453f91",
            "top_comments": [
                "Update:\n\nhttps://www.wdsu.com/article/new-orleans-jail-inmate-escape-lockdown/64793237\n\nhttps://kpel965.com/louisiana-authorities-under-fire-orleans-parish-jail-escape/\n\nSheriff Susan Hutson believes those who escaped received help from individuals inside the Orleans Parish Sheriff’s Office. Hutson said the inmates would have needed a tool that they couldn't access to dig the hole in the wall of the cell.",
                "Have they tried looking outside the prison yet?",
                "Most recent video showing two of them wearing new clothes.\n\nhttps://www.wdsu.com/article/new-video-two-escaped-inmates-in-french-quarter/64805151",
                "I wonder what their crimes were?",
                "I give it a 0% chance that this goes into June",
                "How dumb do you have to be to go out in public after an escape? And not only in public but the tourist hotspot in your area?? \n\nAt least hide out at a home somewhere for a few months till the trail goes cold!",
                "Yeah they ran through the briars and they ran through the brambles\nAnd they ran through the bushes where a rabbit couldn't go\nThey ran so fast that the hounds couldn't catch'em\nOn down the Mississippi to the Gulf of MEXICO",
                "Am I the only one who kind of secretly always roots for escaped convicts?",
                "“Do not seek the treasure!”",
                "Here, a video with pictures of all of them plus description of the felonies.\n\nhttps://youtu.be/TBc9qc67Ngs?si=x1Goa4MPoM_tiWdp"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "'He wanted a boy': Man sentenced for murdering pregnant wife, stabbing daughters",
            "external_url": "https://abc3340.com/news/nation-world/he-wanted-boy-man-sentenced-murdering-pregnant-wife-stabbing-daughters-murder-homicide-killed-stab-weapon-knife-violent-delaware-county-new-york-drew-garnier-attacked-assaulted-police-investigation-no-contact-order-horrific-crime-cincinnati",
            "upvotes": 2001,
            "date": "05/18/2025",
            "thumbnail": "https://abc3340.com/resources/media2/16x9/847/986/0x1/90/88fe00ed-7dfd-4d39-99ec-5995d74bb33c-BADDADFRDONETHISTIME.PNG",
            "top_comments": [
                ">Samantha Garnier was airlifted to a hospital, where she was pronounced dead. The daughters were treated for stab wounds and later recovered.\n\n>During Drew Garnier's sentencing on Thursday, Samantha Garnier's father addressed the court.\n\n>\"He had wanted a boy,\" said Samantha Garnier's father.\n\n>He added that the daughters who survived were traumatized by the crime.\n\n>\"I am their father now. I will protect them,\" said Samantha Garnier's father.\n\n>Drew Garnier requested contact with his daughters while serving his sentence, but Delaware County District Attorney Shawn Smith objected, seeking no-contact orders. Judge John Hubbard agreed, issuing stay-away orders until 2056, though he noted the girls could choose to contact their father if they wished.\n\n>Drew Garnier reportedly refused to sign the orders.\n\n\nThese people live in a different reality. Why would you ever think you should see your daughters again after you tried to murder them?",
                "He blamed his wife because HIS XX-focused sperm were superior",
                "[removed]",
                "Man, some couples desperately wish for baby and they never get such opportunity.  This AH killed his pregnant wife because she \"failed\" to have boy.\n\nAnd yet, he only received 30-year sentencing plus 15 year probations instead of receiving at least life with no parole sentence.\n\nA slap on wrist punishment.",
                "30 years prison + 15 years probation.  Saved you a click.",
                "I wanted a girl. I have 5 boys.  I still have 5 boys.  Not that complicated.",
                "That is just idiotic in addition to being evil. Never heard of a divorce? You can always walk out and be a deadbeat without killing anyone.",
                "You know what’s crazy? There is almost nothing you can’t do with a daughter that you can do with a son. Throw a ball? Wear the color blue? Play in the mud? Teach music? Build a birdhouse? Work on a car? Ride four wheelers? Wear pants? I know it’s a shock but girls can do ALL THOSE THINGS.",
                "*Drew Garnier requested contact with his daughters while serving his sentence, but Delaware County District Attorney Shawn Smith objected, seeking no-contact orders. Judge John Hubbard agreed, issuing stay-away orders until 2056, though he noted the girls could choose to contact their father if they wished.*\n\n*Drew Garnier reportedly refused to sign the orders.*\n\nHe wants his daughters, aged 6 and 9 at the time, to visit him in jail? Even though he stabbed them and murdered their mother? \n\nSo many things wrong with this.",
                "Clear case of femicide."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Biden diagnosed with ‘aggressive form’ of prostate cancer",
            "external_url": "https://www.cnn.com/2025/05/18/politics/joe-biden-prostate-cancer",
            "upvotes": 42183,
            "date": "05/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2193208062.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Former US president Joe Biden has been diagnosed with prostate cancer, a statement from his office said on Sunday.\n\n>Biden, 82, was diagnosed on Friday after he saw a doctor last week for urinary symptoms.\n\n>The cancer is characterised by a Gleason score of 9 with metastasis to the bone, his office said, meaning it is a more aggressive form of the disease.\n\n>Biden and his family are said to be reviewing treatment options, the statement said. The former president's office added that the cancer is hormone-sensitive, meaning it can likely be managed.\n\n>This is a developing story.\n\n>This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version.\n\n/saved you a click. Sad news.",
                "As someone who has had a father and a grandfather who were both diagnosed with early onset prostate cancer, my heart goes out to Biden and his family. A Gleason 9 score with bone involvement is not good news. \n\nProstate cancer typically is very slow growing and easily catchable in the early stages. However, every now and then there are some really nasty aggressive forms. Unfortunately, it sounds like the former president might be dealing with the latter. I’ll be praying for him.",
                "‪Fuck prostate cancer. Lost my dad and so many other family members to it. Regardless of your politics, don’t wish cancer on anyone. Prayers up Mr. President. ‬ may we one day have a cure for this awful disease.",
                "Biden has viewed cancer as one of the most important changes he can make in his position for the past decade. His experience with losing Beau clearly made it a health policy focus, and it’s reflected in the research programs he helped establish and re-establish through the Cancer Moonshot effort. \n\nI hope he has the opportunity to benefit from the care he helped enable.",
                "Fuck cancer.  I lost my mom to it and I would give my own life to have taken away the pain and degeneration she faced in her final year.  \n\nI hope for the best for Biden and his treatment, and my heart goes out to the whole Biden family.",
                "Seems like the writing’s on the wall and wish we could skip the shitshow that’ll inevitably ensue",
                "The hate on FoxNews page is absolutely horrible.\n\nThe nicest comment was something along the lines of, \"horrible president, don't wish this on him, but he might deserve it.\"\n\nThe fuck is wrong with these people.",
                "How long until Trump says something awful about it?",
                "That’s rough. Absolutely fuck cancer.",
                "I'm still recovering from having my prostate removed last Wednesday, due to prostate cancer with the score of Gleason 7.  I'm still in that awful period where I have to wear a catheter. I just got the pathology results that showed the surgeon got it all and hopefully there  should be none remaining in the body. Best day of my life. Biden's Gleason 9 is a pretty poor diagnosis. I wish him well and a positive result."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "FBI says suspect in US fertility clinic blast had 'nihilistic ideations'",
            "external_url": "https://www.bbc.com/news/articles/c787j90wp6po",
            "upvotes": 5939,
            "date": "05/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3c77/live/d21852f0-33fc-11f0-9fcc-0f444dbba5ff.jpg",
            "top_comments": [
                "> The FBI said they believe he is the sole fatality in the incident.\n\n\nGreat news.",
                "[removed]",
                "We believe in nothing, Lebowski. Nothing. And tomorrow we come back and we cut off your chonson",
                "Not sure they understand the words they're using there.\n\nA nihilist wouldn't be all that concerned with whether or not people have kids since nothing matters anyway",
                "Based on what I’ve read, he was allegedly an antinatalist, so this will be a very different scenario from what a lot were first hypothesizing.",
                "[removed]",
                "“the suspect used a 2010 silver Ford Fusion sedan”\n\nIt was a fusion bomb!",
                "This aggression will not stand.",
                "Man looking at these comments I would assume most of these are bots but even bots aren’t this stupid.",
                "Call it what it is, a terrorist attack. Not a blast."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Guy Bartkus, law enforcement sources name ‘pro-mortalist’ as suspect in Palm Springs IVF clinic explosion",
            "external_url": "https://www.the-independent.com/news/world/americas/crime/guy-bartkus-palm-springs-fertility-clinic-b2753287.html",
            "upvotes": 3152,
            "date": "05/18/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/18/18/55/Guy-Butkus.jpeg?trim=508,0,227,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "So not anti-abortion, just anti-birth in general?  Makes more sense why an IVF center was targeted but it makes it all most messed up.  He is against bringing people into the world against their will but seems okay in sending people back against their will.",
                "“Pro-mortalist”\n\n*blows himself up*\n\nOk buddy",
                "> Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nWhen you fall for the propaganda too hard.",
                "Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nIn addition to his writings, Bartkus also recorded a 30-minute audio clip describing his motives.\n\n“I figured I would just make a recording explaining why I’ve decided to bomb an IVF building, or clinic. Basically, it just comes down to I’m angry that I exist and that, you know, nobody got my consent to bring me here,” he said in the recording.\n\nHe must have been an absolute joy to live with. Essentially it sounds like he was suicidal, and also incredibly resentful and selfish. \"I don't want to exist, so other people can't exist,.either\"? \n\n None of us gave consent to be here.   Not a single one.",
                "This honestly sounds like suicide but with more steps. What happened to crazy people like this doing death by police?",
                "“Guy Bartkus” exactly the name one would have when doing what he did.",
                ">According to several reports, the suspect died in the attack.\n\nWell, then. One dead anti-mortalist.",
                "[removed]",
                "[removed]",
                "\"pro-mortalist\"? \"nihilistic ideations\"? Why are these terms being used?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Oklahoma high schools to teach 2020 election conspiracy theories as fact",
            "external_url": "https://www.theguardian.com/us-news/2025/may/17/oklahoma-high-schools-election-conspiracy-theories",
            "upvotes": 33091,
            "date": "05/18/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/16b2b84aeae19cad575afd8829f50cd8f82c7f2d/271_0_3118_2494/master/3118.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=968bba047d85bc933cf6b80361ca1617",
            "top_comments": [
                "Big move from the “schools are indoctrinating our kids!” crowd",
                "Their idea is to radicalize an entire generation.",
                "they have to defend their position, ranked - 49th out of 50.  another sickening waste.",
                "They've been writing their own history based on their 'alternative facts' this whole time. It is wild watching the victors revise and rewrite history in real time to suit their twisted agenda.\n\nThe kids already can't read as it is. This isn't the first bullshit Oklahoma wants to ram into children's minds. They're on about creationism and the ten commandments there, too. No wonder their education consistently ranks at or near the bottom of nearly every single metric conducted by nearly every single study.",
                "Reminds me of a college course I took, where a segment of that class covered \"Unlearning what I learned in school.\" And it was things like, the truth about Christopher Columbus.\n\nThese Oklahoma kids are going to need a whole semester dedicated to \"Unlearning what I learned in school.\" Going line by line of everything they learned and how it was debunked.\n\nIronically, MAGA will cry \"indoctrination\" but that's exactly what is going on in high school. Indoctrinating kids with a history of debunked theories taught as historical facts. Why? Because this guy wants to promote himself in the MAGA circle. Get to a higher level of the MAGA grift.",
                "From the state that tried to require the Trump bible in every school?  Shouldn’t shock anyone.  Crazy and infuriating time period we live in.",
                "Colleges shouldn’t accept their diplomas.",
                ">As part of his revisions, Walters also proposed removing education about Black Lives Matter and George Floyd’s murder, Tulsa’s NBC affiliate KJRH\n\nI hate this timeline",
                "I can’t imagine being so butthurt about a politician, one who couldn’t care less about Oklahoma, losing an election that it would ever even occur to me to make up a rigged election story, much less mandate the fantasy into educational curriculum. MAGA insecurity is a hell of a drug.",
                "Ranked #49/50 for a reason!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Mexican Navy training ship strikes Brooklyn Bridge",
            "external_url": "https://www.cnn.com/2025/05/17/us/manhattan-brooklyn-bridge-ship",
            "upvotes": 7277,
            "date": "05/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/05-gettyimages-2215097286.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "There were people on the masts...",
                "[FYI](https://www.nytimes.com/2025/05/17/nyregion/brooklyn-bridge-ship-crash-nyc.html?smid=nytcore-ios-share&referringSource=articleShare&sgrp=c&pvid=0EA689FF-AC34-4C3B-A5F8-C6BABE486D56) “The crash happened days before the beginning of Fleet Week in New York on May 21. **The event, in which sailors from the United States and other navies around the world converge on the city, features a parade of ships around Manhattan**.”",
                "truly the most unlucky accident that could've happened bar it being a canadian ship. \n\nthis is going to go so incredibly stupidly i can already see the posts",
                "Paywall Removed: [https://archive.is/fVtpJ](https://archive.is/fVtpJ)\n\n* Edit: Link and content below updated.\n\n# A Mexican Navy training ship struck the Brooklyn Bridge, killing at least 2. Here’s what we know\n\nAt least two people were killed and about 20 injured when a Mexican Navy training ship on a global goodwill tour struck the underside of the Brooklyn Bridge in New York Saturday night, officials said.\n\nThere were 277 people on the sailing ship, called the Cuauhtémoc, at the time of the incident and everyone is believed to be accounted for, officials said Saturday\n\n[Related live-story: 2 dead after Mexican Navy training ship carrying more than 200 people strikes underside of Brooklyn Bridge](https://archive.is/o/fVtpJ/https://www.cnn.com/us/live-news/brooklyn-bridge-mexican-navy-ship-05-18-25-hnk)\n\nDramatic video shows the Cuauhtémoc’s masts hitting the underside of the bridge and breaking as the vessel passes underneath, with pieces falling down toward the deck.\n\nHere’s what we know:\n\n**What happened**\n\nThe incident occurred around 8:20 p.m. local time as the ship was departing from New York’s Pier 17, where it had been docked at the South Street Seaport Museum for five days of public viewing.\n\nThe ship’s masts – bedecked in lights - struck the bridge, breaking on impact and sending debris falling onto the vessel’s deck.\n\nNew York City Mayor Eric Adams said the ship lost power. City officials earlier said “mechanical issues” may have caused the incident, but cautioned all information so far is preliminary. An investigation is ongoing.\n\nThe New York Fire Department said in an email to CNN it received the call that a ship had struck the bridge around 8:39 p.m. More than 100 fire and emergency medical service personnel responded to the scene, NYFD said in its email.\n\nVideo of the Mexican Navy training ship shortly after it struck the Brooklyn Bridge showed people hanging from at least one of its masts. On tall ships like the Cuauhtémoc, it is a ceremonial tradition for sailors to climb the masts and rigging when departing or arriving into harbor.\n\n“We could see some people being kind of dragged,” an eyewitness, Flavio Moreira, told CNN. “I believe it was some of the staff, they were on the top of the boat. And they were swinging around, back and forth as soon as the ship hit the bridge.”\n\n**Multiple killed**\n\nTwo people were killed and two remain in critical condition, Adams said. The two who died fell from one of the ship’s masts, the law enforcement official told CNN. They were pronounced dead after being taken to a nearby hospital, the official said.\n\n“At this time, of the 277 on board, 19 sustained injuries, 2 of which remain in critical condition, and 2 more have sadly passed away from their injuries,” Adams [wrote on X](https://archive.is/o/fVtpJ/https://x.com/NYCMayor/status/1923956324737351832).\n\nThe Mexican Navy said earlier a total of 22 people were injured, 19 of whom were taken to hospitals.\n\nMexican President Claudia Sheinbaum said the two people killed were crew members and sent her condolences to their families.\n\n“We are deeply saddened by the loss of two crew members of the Cuauhtémoc Training Ship, who lost their lives in the unfortunate accident in New York Harbor. Our sympathy and support go out to their families,” Sheinbaum said in a post on X early Sunday.\n\nSheinbaum said the Mexican Navy is supporting those injured in the incident, and that the Mexican ambassador to the United States and Mexican Consulate General were supporting the navy.\n\n**An investigation underway**\n\nThe ship appeared to lose power around 8:20 p.m. as the captain was maneuvering the ship, which forced the vessel toward the bridge’s pillar and the ship’s mast struck the bridge, New York Police Department Chief Wilson Aramboles said at a news conference Saturday.\n\nThe National Transportation Safety Board is conducting an investigation.\n\nMexican authorities described the Cuauhtémoc ship as a steel-hulled three-masted barque with a length of around 300 feet and a height of roughly 160 feet, a 2024 [news release](https://archive.is/o/fVtpJ/https://sailleeuwin.com/news-stories/cuauhtemoc-press-release-australia-nz-2024/) from one of its training cruises said.\n\nGovernment [documents](https://archive.is/o/fVtpJ/https://nauticalcharts.noaa.gov/publications/coast-pilot/files/cp2/CPB2_C09_WEB.pdf) show the Brooklyn Bridge has a navigational clearance of 127 feet, roughly 30 feet shorter than the height of the sailing ship.\n\nThere was no visible damage to the Brooklyn Bridge, which appeared to be left structurally intact.\n\n“While inspections will remain ongoing, there are no signs of structural damage to the Brooklyn Bridge,” NY Department of Transportation said in a [post](https://archive.is/o/fVtpJ/https://x.com/NYC_DOT/status/1923934086554349869) on X.\n\nTraffic was temporarily closed in both directions for about 40 minutes as emergency services responded to the scene. It was later reopened following a preliminary inspection, Adams said.\n\nThis ship has been moved to Manhattan’s Pier 36, located along the East River less than a mile from the Brooklyn Bridge, according to the law enforcement official.\n\n**What do we know about the ship?**\n\nThe Cuauhtémoc is a training sailing ship of the Mexican Navy and described by officials as a diplomatic symbol of Mexico abroad.\n\nKnown as the “Ambassador and Knight of the Seas,” the ship was in New York as part of a global goodwill tour and was en route to Iceland at the time of the incident.\n\nA spokesperson for the New York City-area [Sail4th 250](https://archive.is/o/fVtpJ/https://www.sail4th.org/) events told CNN that the Cuauhtémoc ship had “welcomed dignitaries and media” as part of its New York stop on its global tour.\n\nThe sailing ship was expected to join the parade of international tall ships to celebrate the United States’s 250 anniversary on July 4, 2026 – in what the event is calling “the largest-ever flotilla of tall ships from around the world.\n\n”Built in Spain in 1981, the ship was acquired by the Mexican Navy to train cadets and officers. It regularly takes part in major regattas around the world. According to a [news release ](https://archive.is/o/fVtpJ/https://sailleeuwin.com/news-stories/cuauhtemoc-press-release-australia-nz-2024/)from one of its global cruises, it was used for training by the Heroic Naval Military School, an elite military academy in Mexico.\n\nThe ship, as of last year, had visited 212 ports in 64 countries with 756,085 nautical miles sailed, the latter equivalent to making 35 trips around the world, the release said.\n\nThis story has been updated with additional information.",
                "Wonder how long he'll have caps lock on this time",
                "Omg 🤦‍♀️ we all know where this is going…",
                "prez is going to call it an international conflict /smh",
                "I got scared i thought this was the baltimore bridge incident times 10",
                "Videos:\n\n* [Just watched the Brooklyn Bridge get smoked live by a boat with a massive Mexican flag](https://x.com/TheWillieNelson/status/1923902044051550591)\n* [A massive pirate ship just hit the Brooklyn Bridge](https://x.com/Corso52/status/1923898855763972396)",
                "This is like those bikers that run into parked cars. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump cuts to National Weather Service leave Kentucky offices understaffed",
            "external_url": "https://www.kentucky.com/news/politics-government/article306549111.html",
            "upvotes": 15349,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Shit like this is going to keep happening, too. Fuckin sucks, man.",
                "Well, if it isn't the predictable result of the actions taken since 47 took office.",
                "\"More than 600 National Weather Service staff out of more than 4,200 were fired or took early retirement since January, according to Fahy. That’s the same number of people who left the service over a 15-year period from 2010 to early January, Fahy said.\"\n\n\"Tornado-spawning storms leave 25 dead in 2 states and swaths of destruction across central US\"\n\nPeople are dead due to the NOAA cuts of the Trump admin. Disgusting",
                "Can confirm,  we had a tornado touch down 5 miles away and received no alerts. We were watching the news but our area had major outages and a phone alert could have been the difference for some people seeking shelter.",
                "That’s one way to stop the democrats weather machine.",
                "\"On election night, Kentucky voted Republican for former president Donald Trump by a wide margin for the third time in a row, with him winning the state by 30.53%, a considerable increase from his 25.94% victory in 2020 and to a lesser extent his 29.84% victory in 2016.\"",
                "So... we are cutting essential personnel so that the President can have a nice big military parade and billionaires can get another tax cut\n\ncool, cool",
                "lmao just wait until hurricane season rolls around, it’s gonna get real bad.",
                "A LOT of residents in red states have no idea that so much of what seems like basic services have been funded by federal money coming directly from blue states. They are the \"welfare queens\" they complain about and they always have been. They're like house cats. They have a mistaken idea that they're fiercely independent, while being completely dependent on a complex system they neither appreciate nor understand.",
                "Kentucky here. We got a warning - finally - through somebody making a facebook post nearby that a tornado had touched down. Then we lost power, so anyone not USING FACEBOOK on their PHONES had no idea."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Primary school evacuated after student brings in a grenade for show and tell",
            "external_url": "https://www.the-independent.com/news/uk/home-news/grenade-osmaston-school-evacuation-derbyshire-b2752851.html",
            "upvotes": 2600,
            "date": "05/19/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/17/10/00/iStock-1018660080.jpeg?trim=83,0,83,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                ">“It was quite an eventful assembly,” said Mrs Hart. “It was going fine and there was a boy who brought an old bullet case in, which I knew about, but then his friend produced a hand grenade from his pocket. That, I was not expecting.”\n\nPoor kid who brought in the bullet case must have been feeling so good thinking, *\"What a badass I am\"* before his friend followed it up with the grenade. Crushing.",
                "Brick where did you get a hand grenade?",
                "Someone in my class brought one in in middle school. It was defused but a real grenade. The teacher played a prank by rolling into the other classroom right up to the other teachers feet. Everyone laughed and I went home that day. This was pre-9/11.",
                "Better to learn now than on the streets",
                "I remember bringing in a Hamilton Model 27 .22 caliber boys rifle to school for my son to use for a show and tell.\n\nI called the principal to see if I needed to case it up when I brought it in, and he said, \"Nope, just stop at the office.\"\n\n1990, obviously. \n\nFast forward to now, his autistic son made a comment about shooting  an Uzi and now has to be searched every morning before school, while escorted by his father.\n\nI get it, but he has trouble sometimes with impulsive talk.\n\nHe is 11, and I feel bad for him.",
                "Article completely left the most important part out: Did he count to three, no more, no less?",
                "I almost did this as a kid. It was a much simpler time back then.",
                "Say what you will but if the goal of show and tell is to share your story then I'd say this kid blew the assignment out of the water. I'm honored and confused to learn about his family's heirloom grenade.",
                "Why evacuate the entire school when you could have just evacuated the grenade? It’s not like there was a fear there was an arsenal to go with it.",
                "My dad was the town GP and did a lot of housecalls. According to staff at the local clinic, he was the first and last person a lot of people in town ever saw. \n\nHe had a box in the garage filled with all kind of stuff that he'd taken out of his medicine bag. Expired medicine, gadgets gifted by medical reps, equipment he didn't need at the moment, you name it.\n\nAs a kid, the box fascinated me. One morning, I remembered that I needed to bring something to school for show-and-tell and decided to take something from the box. Without telling my parents.\n\nMom was called in to come get the speculum I'd chosen. Dad found it hilarious. Mom was not impressed. \n\n(We'd later raid his bag and use the surgical tubing in our slingshots. We could shoot a glass marble through an empty oil can with those. It's a miracle we didn't maim anyone. )"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "7 escaped New Orleans jail inmates still at large as search enters third day",
            "external_url": "https://www.cbsnews.com/news/new-orleans-inmates-escape-update/",
            "upvotes": 1660,
            "date": "05/18/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/18/003c47cd-37f8-4812-b3e3-a6142740696a/thumbnail/1200x630/cea96c2976cdaa498e8a9fae08680039/image.png?v=6df9366690ed146f169dd0670c453f91",
            "top_comments": [
                "Update:\n\nhttps://www.wdsu.com/article/new-orleans-jail-inmate-escape-lockdown/64793237\n\nhttps://kpel965.com/louisiana-authorities-under-fire-orleans-parish-jail-escape/\n\nSheriff Susan Hutson believes those who escaped received help from individuals inside the Orleans Parish Sheriff’s Office. Hutson said the inmates would have needed a tool that they couldn't access to dig the hole in the wall of the cell.",
                "Have they tried looking outside the prison yet?",
                "Most recent video showing two of them wearing new clothes.\n\nhttps://www.wdsu.com/article/new-video-two-escaped-inmates-in-french-quarter/64805151",
                "I wonder what their crimes were?",
                "I give it a 0% chance that this goes into June",
                "How dumb do you have to be to go out in public after an escape? And not only in public but the tourist hotspot in your area?? \n\nAt least hide out at a home somewhere for a few months till the trail goes cold!",
                "Yeah they ran through the briars and they ran through the brambles\nAnd they ran through the bushes where a rabbit couldn't go\nThey ran so fast that the hounds couldn't catch'em\nOn down the Mississippi to the Gulf of MEXICO",
                "Am I the only one who kind of secretly always roots for escaped convicts?",
                "“Do not seek the treasure!”",
                "Here, a video with pictures of all of them plus description of the felonies.\n\nhttps://youtu.be/TBc9qc67Ngs?si=x1Goa4MPoM_tiWdp"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "FBI says suspect in US fertility clinic blast had 'nihilistic ideations'",
            "external_url": "https://www.bbc.com/news/articles/c787j90wp6po",
            "upvotes": 5946,
            "date": "05/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3c77/live/d21852f0-33fc-11f0-9fcc-0f444dbba5ff.jpg",
            "top_comments": [
                "> The FBI said they believe he is the sole fatality in the incident.\n\n\nGreat news.",
                "[removed]",
                "We believe in nothing, Lebowski. Nothing. And tomorrow we come back and we cut off your chonson",
                "Not sure they understand the words they're using there.\n\nA nihilist wouldn't be all that concerned with whether or not people have kids since nothing matters anyway",
                "Based on what I’ve read, he was allegedly an antinatalist, so this will be a very different scenario from what a lot were first hypothesizing.",
                "[removed]",
                "“the suspect used a 2010 silver Ford Fusion sedan”\n\nIt was a fusion bomb!",
                "This aggression will not stand.",
                "Man looking at these comments I would assume most of these are bots but even bots aren’t this stupid.",
                "Call it what it is, a terrorist attack. Not a blast."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Biden diagnosed with ‘aggressive form’ of prostate cancer",
            "external_url": "https://www.cnn.com/2025/05/18/politics/joe-biden-prostate-cancer",
            "upvotes": 42203,
            "date": "05/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2193208062.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Former US president Joe Biden has been diagnosed with prostate cancer, a statement from his office said on Sunday.\n\n>Biden, 82, was diagnosed on Friday after he saw a doctor last week for urinary symptoms.\n\n>The cancer is characterised by a Gleason score of 9 with metastasis to the bone, his office said, meaning it is a more aggressive form of the disease.\n\n>Biden and his family are said to be reviewing treatment options, the statement said. The former president's office added that the cancer is hormone-sensitive, meaning it can likely be managed.\n\n>This is a developing story.\n\n>This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version.\n\n/saved you a click. Sad news.",
                "As someone who has had a father and a grandfather who were both diagnosed with early onset prostate cancer, my heart goes out to Biden and his family. A Gleason 9 score with bone involvement is not good news. \n\nProstate cancer typically is very slow growing and easily catchable in the early stages. However, every now and then there are some really nasty aggressive forms. Unfortunately, it sounds like the former president might be dealing with the latter. I’ll be praying for him.",
                "‪Fuck prostate cancer. Lost my dad and so many other family members to it. Regardless of your politics, don’t wish cancer on anyone. Prayers up Mr. President. ‬ may we one day have a cure for this awful disease.",
                "Biden has viewed cancer as one of the most important changes he can make in his position for the past decade. His experience with losing Beau clearly made it a health policy focus, and it’s reflected in the research programs he helped establish and re-establish through the Cancer Moonshot effort. \n\nI hope he has the opportunity to benefit from the care he helped enable.",
                "Fuck cancer.  I lost my mom to it and I would give my own life to have taken away the pain and degeneration she faced in her final year.  \n\nI hope for the best for Biden and his treatment, and my heart goes out to the whole Biden family.",
                "Seems like the writing’s on the wall and wish we could skip the shitshow that’ll inevitably ensue",
                "The hate on FoxNews page is absolutely horrible.\n\nThe nicest comment was something along the lines of, \"horrible president, don't wish this on him, but he might deserve it.\"\n\nThe fuck is wrong with these people.",
                "How long until Trump says something awful about it?",
                "That’s rough. Absolutely fuck cancer.",
                "I'm still recovering from having my prostate removed last Wednesday, due to prostate cancer with the score of Gleason 7.  I'm still in that awful period where I have to wear a catheter. I just got the pathology results that showed the surgeon got it all and hopefully there  should be none remaining in the body. Best day of my life. Biden's Gleason 9 is a pretty poor diagnosis. I wish him well and a positive result."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Oklahoma high schools to teach 2020 election conspiracy theories as fact",
            "external_url": "https://www.theguardian.com/us-news/2025/may/17/oklahoma-high-schools-election-conspiracy-theories",
            "upvotes": 33104,
            "date": "05/18/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/16b2b84aeae19cad575afd8829f50cd8f82c7f2d/271_0_3118_2494/master/3118.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=968bba047d85bc933cf6b80361ca1617",
            "top_comments": [
                "Big move from the “schools are indoctrinating our kids!” crowd",
                "Their idea is to radicalize an entire generation.",
                "they have to defend their position, ranked - 49th out of 50.  another sickening waste.",
                "They've been writing their own history based on their 'alternative facts' this whole time. It is wild watching the victors revise and rewrite history in real time to suit their twisted agenda.\n\nThe kids already can't read as it is. This isn't the first bullshit Oklahoma wants to ram into children's minds. They're on about creationism and the ten commandments there, too. No wonder their education consistently ranks at or near the bottom of nearly every single metric conducted by nearly every single study.",
                "Reminds me of a college course I took, where a segment of that class covered \"Unlearning what I learned in school.\" And it was things like, the truth about Christopher Columbus.\n\nThese Oklahoma kids are going to need a whole semester dedicated to \"Unlearning what I learned in school.\" Going line by line of everything they learned and how it was debunked.\n\nIronically, MAGA will cry \"indoctrination\" but that's exactly what is going on in high school. Indoctrinating kids with a history of debunked theories taught as historical facts. Why? Because this guy wants to promote himself in the MAGA circle. Get to a higher level of the MAGA grift.",
                "From the state that tried to require the Trump bible in every school?  Shouldn’t shock anyone.  Crazy and infuriating time period we live in.",
                "Colleges shouldn’t accept their diplomas.",
                ">As part of his revisions, Walters also proposed removing education about Black Lives Matter and George Floyd’s murder, Tulsa’s NBC affiliate KJRH\n\nI hate this timeline",
                "I can’t imagine being so butthurt about a politician, one who couldn’t care less about Oklahoma, losing an election that it would ever even occur to me to make up a rigged election story, much less mandate the fantasy into educational curriculum. MAGA insecurity is a hell of a drug.",
                "Ranked #49/50 for a reason!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Guy Bartkus, law enforcement sources name ‘pro-mortalist’ as suspect in Palm Springs IVF clinic explosion",
            "external_url": "https://www.the-independent.com/news/world/americas/crime/guy-bartkus-palm-springs-fertility-clinic-b2753287.html",
            "upvotes": 3148,
            "date": "05/18/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/18/18/55/Guy-Butkus.jpeg?trim=508,0,227,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "So not anti-abortion, just anti-birth in general?  Makes more sense why an IVF center was targeted but it makes it all most messed up.  He is against bringing people into the world against their will but seems okay in sending people back against their will.",
                "“Pro-mortalist”\n\n*blows himself up*\n\nOk buddy",
                "> Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nWhen you fall for the propaganda too hard.",
                "Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nIn addition to his writings, Bartkus also recorded a 30-minute audio clip describing his motives.\n\n“I figured I would just make a recording explaining why I’ve decided to bomb an IVF building, or clinic. Basically, it just comes down to I’m angry that I exist and that, you know, nobody got my consent to bring me here,” he said in the recording.\n\nHe must have been an absolute joy to live with. Essentially it sounds like he was suicidal, and also incredibly resentful and selfish. \"I don't want to exist, so other people can't exist,.either\"? \n\n None of us gave consent to be here.   Not a single one.",
                "This honestly sounds like suicide but with more steps. What happened to crazy people like this doing death by police?",
                "“Guy Bartkus” exactly the name one would have when doing what he did.",
                ">According to several reports, the suspect died in the attack.\n\nWell, then. One dead anti-mortalist.",
                "[removed]",
                "[removed]",
                "\"pro-mortalist\"? \"nihilistic ideations\"? Why are these terms being used?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump cuts to National Weather Service leave Kentucky offices understaffed",
            "external_url": "https://www.kentucky.com/news/politics-government/article306549111.html",
            "upvotes": 15342,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Shit like this is going to keep happening, too. Fuckin sucks, man.",
                "Well, if it isn't the predictable result of the actions taken since 47 took office.",
                "\"More than 600 National Weather Service staff out of more than 4,200 were fired or took early retirement since January, according to Fahy. That’s the same number of people who left the service over a 15-year period from 2010 to early January, Fahy said.\"\n\n\"Tornado-spawning storms leave 25 dead in 2 states and swaths of destruction across central US\"\n\nPeople are dead due to the NOAA cuts of the Trump admin. Disgusting",
                "Can confirm,  we had a tornado touch down 5 miles away and received no alerts. We were watching the news but our area had major outages and a phone alert could have been the difference for some people seeking shelter.",
                "That’s one way to stop the democrats weather machine.",
                "\"On election night, Kentucky voted Republican for former president Donald Trump by a wide margin for the third time in a row, with him winning the state by 30.53%, a considerable increase from his 25.94% victory in 2020 and to a lesser extent his 29.84% victory in 2016.\"",
                "So... we are cutting essential personnel so that the President can have a nice big military parade and billionaires can get another tax cut\n\ncool, cool",
                "lmao just wait until hurricane season rolls around, it’s gonna get real bad.",
                "A LOT of residents in red states have no idea that so much of what seems like basic services have been funded by federal money coming directly from blue states. They are the \"welfare queens\" they complain about and they always have been. They're like house cats. They have a mistaken idea that they're fiercely independent, while being completely dependent on a complex system they neither appreciate nor understand.",
                "Kentucky here. We got a warning - finally - through somebody making a facebook post nearby that a tornado had touched down. Then we lost power, so anyone not USING FACEBOOK on their PHONES had no idea."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Mexican Navy training ship strikes Brooklyn Bridge",
            "external_url": "https://www.cnn.com/2025/05/17/us/manhattan-brooklyn-bridge-ship",
            "upvotes": 7279,
            "date": "05/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/05-gettyimages-2215097286.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "There were people on the masts...",
                "[FYI](https://www.nytimes.com/2025/05/17/nyregion/brooklyn-bridge-ship-crash-nyc.html?smid=nytcore-ios-share&referringSource=articleShare&sgrp=c&pvid=0EA689FF-AC34-4C3B-A5F8-C6BABE486D56) “The crash happened days before the beginning of Fleet Week in New York on May 21. **The event, in which sailors from the United States and other navies around the world converge on the city, features a parade of ships around Manhattan**.”",
                "truly the most unlucky accident that could've happened bar it being a canadian ship. \n\nthis is going to go so incredibly stupidly i can already see the posts",
                "Paywall Removed: [https://archive.is/fVtpJ](https://archive.is/fVtpJ)\n\n* Edit: Link and content below updated.\n\n# A Mexican Navy training ship struck the Brooklyn Bridge, killing at least 2. Here’s what we know\n\nAt least two people were killed and about 20 injured when a Mexican Navy training ship on a global goodwill tour struck the underside of the Brooklyn Bridge in New York Saturday night, officials said.\n\nThere were 277 people on the sailing ship, called the Cuauhtémoc, at the time of the incident and everyone is believed to be accounted for, officials said Saturday\n\n[Related live-story: 2 dead after Mexican Navy training ship carrying more than 200 people strikes underside of Brooklyn Bridge](https://archive.is/o/fVtpJ/https://www.cnn.com/us/live-news/brooklyn-bridge-mexican-navy-ship-05-18-25-hnk)\n\nDramatic video shows the Cuauhtémoc’s masts hitting the underside of the bridge and breaking as the vessel passes underneath, with pieces falling down toward the deck.\n\nHere’s what we know:\n\n**What happened**\n\nThe incident occurred around 8:20 p.m. local time as the ship was departing from New York’s Pier 17, where it had been docked at the South Street Seaport Museum for five days of public viewing.\n\nThe ship’s masts – bedecked in lights - struck the bridge, breaking on impact and sending debris falling onto the vessel’s deck.\n\nNew York City Mayor Eric Adams said the ship lost power. City officials earlier said “mechanical issues” may have caused the incident, but cautioned all information so far is preliminary. An investigation is ongoing.\n\nThe New York Fire Department said in an email to CNN it received the call that a ship had struck the bridge around 8:39 p.m. More than 100 fire and emergency medical service personnel responded to the scene, NYFD said in its email.\n\nVideo of the Mexican Navy training ship shortly after it struck the Brooklyn Bridge showed people hanging from at least one of its masts. On tall ships like the Cuauhtémoc, it is a ceremonial tradition for sailors to climb the masts and rigging when departing or arriving into harbor.\n\n“We could see some people being kind of dragged,” an eyewitness, Flavio Moreira, told CNN. “I believe it was some of the staff, they were on the top of the boat. And they were swinging around, back and forth as soon as the ship hit the bridge.”\n\n**Multiple killed**\n\nTwo people were killed and two remain in critical condition, Adams said. The two who died fell from one of the ship’s masts, the law enforcement official told CNN. They were pronounced dead after being taken to a nearby hospital, the official said.\n\n“At this time, of the 277 on board, 19 sustained injuries, 2 of which remain in critical condition, and 2 more have sadly passed away from their injuries,” Adams [wrote on X](https://archive.is/o/fVtpJ/https://x.com/NYCMayor/status/1923956324737351832).\n\nThe Mexican Navy said earlier a total of 22 people were injured, 19 of whom were taken to hospitals.\n\nMexican President Claudia Sheinbaum said the two people killed were crew members and sent her condolences to their families.\n\n“We are deeply saddened by the loss of two crew members of the Cuauhtémoc Training Ship, who lost their lives in the unfortunate accident in New York Harbor. Our sympathy and support go out to their families,” Sheinbaum said in a post on X early Sunday.\n\nSheinbaum said the Mexican Navy is supporting those injured in the incident, and that the Mexican ambassador to the United States and Mexican Consulate General were supporting the navy.\n\n**An investigation underway**\n\nThe ship appeared to lose power around 8:20 p.m. as the captain was maneuvering the ship, which forced the vessel toward the bridge’s pillar and the ship’s mast struck the bridge, New York Police Department Chief Wilson Aramboles said at a news conference Saturday.\n\nThe National Transportation Safety Board is conducting an investigation.\n\nMexican authorities described the Cuauhtémoc ship as a steel-hulled three-masted barque with a length of around 300 feet and a height of roughly 160 feet, a 2024 [news release](https://archive.is/o/fVtpJ/https://sailleeuwin.com/news-stories/cuauhtemoc-press-release-australia-nz-2024/) from one of its training cruises said.\n\nGovernment [documents](https://archive.is/o/fVtpJ/https://nauticalcharts.noaa.gov/publications/coast-pilot/files/cp2/CPB2_C09_WEB.pdf) show the Brooklyn Bridge has a navigational clearance of 127 feet, roughly 30 feet shorter than the height of the sailing ship.\n\nThere was no visible damage to the Brooklyn Bridge, which appeared to be left structurally intact.\n\n“While inspections will remain ongoing, there are no signs of structural damage to the Brooklyn Bridge,” NY Department of Transportation said in a [post](https://archive.is/o/fVtpJ/https://x.com/NYC_DOT/status/1923934086554349869) on X.\n\nTraffic was temporarily closed in both directions for about 40 minutes as emergency services responded to the scene. It was later reopened following a preliminary inspection, Adams said.\n\nThis ship has been moved to Manhattan’s Pier 36, located along the East River less than a mile from the Brooklyn Bridge, according to the law enforcement official.\n\n**What do we know about the ship?**\n\nThe Cuauhtémoc is a training sailing ship of the Mexican Navy and described by officials as a diplomatic symbol of Mexico abroad.\n\nKnown as the “Ambassador and Knight of the Seas,” the ship was in New York as part of a global goodwill tour and was en route to Iceland at the time of the incident.\n\nA spokesperson for the New York City-area [Sail4th 250](https://archive.is/o/fVtpJ/https://www.sail4th.org/) events told CNN that the Cuauhtémoc ship had “welcomed dignitaries and media” as part of its New York stop on its global tour.\n\nThe sailing ship was expected to join the parade of international tall ships to celebrate the United States’s 250 anniversary on July 4, 2026 – in what the event is calling “the largest-ever flotilla of tall ships from around the world.\n\n”Built in Spain in 1981, the ship was acquired by the Mexican Navy to train cadets and officers. It regularly takes part in major regattas around the world. According to a [news release ](https://archive.is/o/fVtpJ/https://sailleeuwin.com/news-stories/cuauhtemoc-press-release-australia-nz-2024/)from one of its global cruises, it was used for training by the Heroic Naval Military School, an elite military academy in Mexico.\n\nThe ship, as of last year, had visited 212 ports in 64 countries with 756,085 nautical miles sailed, the latter equivalent to making 35 trips around the world, the release said.\n\nThis story has been updated with additional information.",
                "Wonder how long he'll have caps lock on this time",
                "Omg 🤦‍♀️ we all know where this is going…",
                "prez is going to call it an international conflict /smh",
                "I got scared i thought this was the baltimore bridge incident times 10",
                "Videos:\n\n* [Just watched the Brooklyn Bridge get smoked live by a boat with a massive Mexican flag](https://x.com/TheWillieNelson/status/1923902044051550591)\n* [A massive pirate ship just hit the Brooklyn Bridge](https://x.com/Corso52/status/1923898855763972396)",
                "This is like those bikers that run into parked cars. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Tornado warnings delayed because of DOGE cuts",
            "external_url": "https://www.mesoscalenews.com/p/tornado-warnings-delayed-because",
            "upvotes": 68,
            "date": "05/19/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbf1204d0-dd21-493d-b55a-0394aebc6880_1800x2250.jpeg",
            "top_comments": [
                "But think of the money nobody saved.",
                "Something something votes matter."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "One dead after bomb explodes outside reproductive center in Downtown Palm Springs",
            "external_url": "https://thepalmspringspost.com/one-dead-after-bomb-explodes-outside-reproductive-center-in-downtown-palm-springs/",
            "upvotes": 42223,
            "date": "05/17/2025",
            "thumbnail": "https://thepalmspringspost.com/wp-content/uploads/2025/05/Bombed-Building-Chris-Andersen-scaled.jpeg",
            "top_comments": [
                "Hopfully it was the idiot who planted it.",
                "Okay but from everything I'm reading this was straight up an IVF clinic? Where people who desperately WANT babies come?\n\nWhat the actual fuck.",
                "Actual domestic terrorism.",
                "I have family at desert regional across the street. My sister in law was in the parking lot waiting in the car with windows down saw the explosion and was rocked by the shock wave. She said her ears are still ringing from it and there’s people that got injured by debris from the car bomb. They are currently locked down in the hospital.",
                "Fun fact: this was NOT an abortion center. They don’t even provide abortion, or anything like it, as a service. It was an IVF facility. 🤷🏻‍♀️",
                "So Google says this clinic is closed on Saturdays. It takes a lot of planning to create a bomb that big, but then they set it off when the building was not in use?",
                "[removed]",
                "Caused by someone who is \"pro life\"",
                "[ Removed by Reddit ]",
                "One of my siblings was there having lunch nearby and, thankfully, only heard the explosion. They left immediately and, before the news reported it, they were under the impression that a meth lab had blown up.\n\nWhoever did this deserves to rot in hell."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/19/2025 04:18:22 UTC"
}