{
    "posts": [
        {
            "category": "HOT",
            "title": "US cancels more than $700 million funding for Moderna bird flu vaccine",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-cancels-more-700-million-funding-moderna-bird-flu-vaccine-2025-05-28/",
            "upvotes": 25482,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Really don’t get how they can just decide to not pay things already contracted",
                "How does the Executive Branch keep cancelling Congressionally-appropriated funds with no consequences?",
                "> Moderna in January was awarded $590 million by the Biden administration to advance the development of its bird flu vaccine, and support the expansion of clinical studies for up to five additional subtypes of pandemic influenza\n\nCancelled by the Trump administration just 4 months later.",
                "The pharmaceutical industry will respond with - checks notes - massive donations to current and future Republicans, including Trump.",
                "Dumb bastards.  An ounce of prevention is worth a pound of cure.",
                "Is this going to bring down the price of chicken?",
                "Known pandemic mass murderer makes it so he can kill again. More at 11.",
                "Can we remove this guy from office solely on the grounds that he's actively trying to kill us?",
                "Then when there's another bird flu epidemic Maga is going to be scratching their heads and bend over backwards not to blame trump",
                "Why is the Trump administration so pro-bird flu?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Elon Musk bids farewell to White House but says Doge will continue",
            "external_url": "https://www.bbc.com/news/articles/cz9y4exj822o",
            "upvotes": 4593,
            "date": "05/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4149/live/bb4c3ee0-3c28-11f0-af00-f94ff1cabcc0.jpg",
            "top_comments": [
                "Is this why he disabled community notes?",
                "To whatever extent \"leaving\" counts when you still have your aides appointed to the highest levels of government agencies",
                "Yeah but only because he has to, his status as a “special government employee” grants him only 130 days before he needs to leave and his time is up. This has to happen, it’s not voluntary.\n\nI would be surprised if this is the last Elon has to do with this administration. It’s a presidency he bought and paid for, after all.\n\nIn the meantime, fuck Tesla, fuck SpaceX, fuck X, and fuck Donald Trump.",
                "The amount of times I’ve seen rich people come into an organization, fuck things completely up, fire the people who were trying to save them, ruin lives and walk away like they just won the superbowl is too damn high.",
                "Does that mean Big Balls is in charge now?",
                "[removed]",
                "Look at this clown trying to save face:\n\n*The BBC understands that the White House will begin \"offboarding\" Musk as a special government employee on Wednesday night.\nMusk's exit comes after he said he was \"disappointed\" with Trump's budget, which proposes multi-trillion dollar tax breaks and a boost to defence spending.\nThe SpaceX and Tesla boss said in an interview with BBC's US partner CBS that the bill would increase the federal deficit, adding that he thought it \"undermines the work\" being done at Doge.*",
                "This fuckin schmuck will be back for midterms writing checks and pressuring people, fuck these stories about him leaving, theyre cover for his damaging actions that help weaken our country and our social safety net. Fuck billionaires, take their money now.",
                "Timescale on Trump claiming he didn't know him?",
                "Don’t let up on his businesses, he stole our information, got his government contracts, he got what he needed and is trying to walk away. Don’t let up."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Federal trade court blocks Trump from imposing sweeping tariffs under emergency powers law",
            "external_url": "https://apnews.com/article/trump-tariffs-trade-court-0392dbd59f548e49ad4f64254ae3f94a",
            "upvotes": 7240,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "...and here is the kicker;\n\n>The court’s ruling also means that **the government may have to pay back duties it has already collected**. “Anybody that has had to pay tariffs so far will be able to get them refunded,” said Ilya Somin, a professor of law at George Mason University\n\n[https://www.politico.com/news/2025/05/28/federal-court-strikes-down-trumps-april-2-tariffs-00373843](https://www.politico.com/news/2025/05/28/federal-court-strikes-down-trumps-april-2-tariffs-00373843)",
                "Between this and being called TACO, it’s going to be a long night of tweeting.",
                ".......and there we have it folks.\n\nMarkets will be so green tomorrow..!",
                "The fact it took this long for a ruling is a problem.",
                "\"The Congress shall have Power To lay and collect Taxes, Duties, Imposts and Excises, to pay the Debts and provide for the common Defence and general Welfare of the United States; but all Duties, Imposts and Excises shall be uniform throughout the United States; . . .\"\n\n\nArtI.S8.C1.1.1 of the United States Constitution \n\n\n\nMy #1 issue with almost everything that Trump does is not that I think it's wrong (which I almost always do) but that it's clearly against the law. If he had operated within the bounds of the law and worked with congress to pass a law setting tariffs, then boom the tariffs go into effect and theres no judge ruling that congress doesn't have that power, and democrats have way less of a leg to stand on. Deal with it, win the next election, right?\n\n\n\n\n\nIt's the same thing with all the doge stuff, or eliminating the dept of education, or mass deportations. All of these goals could 100% be achieved if the law was followed. But Trump is an authoritarian piece of shit and doesn't believe that the law applies to him.",
                "Turns out if you're a TACO-ing, it pretty much ruins any chance you have for claiming the tariffs are necessary.",
                "tonight's twitter storm will be Hilarious",
                "Just the latest round of TACO Don's pump 'n dump scheme. SCOTUS will overturn this to cause the next downturn.",
                "Is this going to stop him from issuing tariffs? Like does this court order have merit and it will actually stop the orange monster from continuing this path of self destruction?",
                "I think this might just be the off ramp Trump has been looking for. ever since he made the april tariff announcement he has been walking them back.. and now the courts just handed him a beauty of an off ramp.. everyone saves face here and the market will light up like an xmas tree. brilliant really."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US judge allows states' lawsuit against DOGE to proceed",
            "external_url": "https://www.reuters.com/world/us/us-judge-allows-states-lawsuit-against-doge-proceed-2025-05-27/",
            "upvotes": 11772,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I won't be surprised if the eventual accounting shows that Elon Musk cost the United States, in law suits for illegal firings, broken contracts, and all the other nonsense \"DOGE\" has done, a great deal more than any imagined \"savings\".",
                "Hope something comes out of it, not expecting much.",
                "Impeach the judge request incoming and another truth social rant post.",
                "This whole fiasco is going to cost us so much.",
                "The judge is Tanya Chutkan, whom Trump escaped in the J6 case in Washington, with Jack Smith of DOJ prosecuting. She is an Obama nominee. \n\nJudge Chutkan is a Black woman who was born in Kingston, Jamaica and came here at 17. She is a tough, competent jurist, a former public defender. In a 2021 ruling, she said \"Presidents are not kings, and Plaintiff is not President.” \n\nMusk has no immunity, and he has no privilege to withhold documents or other evidence. He has committed crimes, and if he is deposed, he will take the Fifth. \n\nHugely important case with massive resources from Blue State AG's Office. DOJ is investigating Letitia James, the NY AG who beat Trump in his NY civil fraud case.",
                "Something something taco.",
                "I would like to see lawsuits directly against Musk.  Since he was not a government employee, and there were no official duties, he should be personally liable.",
                "News flash to MAGA:  Trump is not a king, he's just your fantasy of one.",
                "The story of how Elon Musk of all people worked his way into Donald Trump's inner circle is going to be an excellent Netflix series in 2035.  Truely frightening times we live in.",
                "What is worrying to me, is that the current ~~Administration~~ gangsters are restraining [the freedom of many law firms](https://www.theguardian.com/us-news/2025/apr/02/trump-law-firm-executive-order) and ensuring millions of dollars of free law services flow towards the Federal government."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "\"I’m not a criminal’: Military wife detained, deported at Honolulu airport",
            "external_url": "https://www.hawaiinewsnow.com/2025/05/24/im-not-criminal-australian-woman-recounts-detention-experience-while-trying-visit-us-military-spouse-hawaii/?fbclid=IwY2xjawKkVUdleHRuA2FlbQIxMQABHordgmoKzV2MVhiQfVIIoEXXefpvq910XuO2hUdxPtIIF9pInkRUkBmECSCr_aem_HeGqd9GxlHAyRWPk63rhvA",
            "upvotes": 6426,
            "date": "05/28/2025",
            "thumbnail": "https://gray-khnl-prod.gtv-cdn.com/resizer/v2/FXDTVUNGCNC3POGLPA5BBNWGGE.JPEG?auth=20d68e119c5835c6ea99f936965c428ad59380f540cd4049245bb92f4cac11a3&width=1200&height=600&smart=true",
            "top_comments": [
                "> U.S. Customs and Border Protection told HNN they are working on a statement for this story.\n\nThis signals that they know they fucked up.\n\nOtherwise they would reply that they don’t comment on individual matters or on matters before a judge (or something similar).\n\n\nMaybe this will be the first chip to fall and get the military to start pushing back.",
                "This is just stupid and horrible. The simple thing to do, even if you want to deny her entry, is just let her buy a ticket, even on her own dime, and return home.\n\nShe is an Australian who have NOT even entered into the US yet. Being at the border asking for permission to enter is not a crime and not grounds for detention.\n\nIf you really want to turn back people (and not that I support that, but let's say that is legal), there is ALREADY a waiting area behind the counter. Just make sure there are airline representatives there to let them buy tickets to get out of there ASAP. I am sure most of them want to be out of the US and never come back right that second.",
                "Why can’t they just let the person change their flights and go back home? Why is the sexual assault and night in prison required?",
                "> The official checking their passports “went from completely composed to just yelling at the top of his lungs, telling my mother to go stand at the back of the line and to excuse my language, ‘shut up,’” Saroukos recalled.\n\n>“So I automatically started crying because that was my first response,” she said.\n\n>Saroukos said they were then taken to a holding room, their bags and phones were searched, and they were asked a slew of questions — everything from her work as a former police officer to whether her tattoos were gang-related to her marriage to an American.\n\n>“When I did say that I was married to somebody in the U.S. Army, the officers laughed at me. They thought it was quite comical. I don’t know whether they thought I was telling the truth or not,” she said.\n\n>“They kept telling me that I had too many clothes in my suitcase. So because of that, they assumed that I was going to overstay my visa,” she said.\n\n>Saroukos was subject to more screening. Her fingerprints and a DNA swab of her mouth were taken.\n\n>Meanwhile, her mother was free to go.\n\n>Saroukos said her heart sank when officials told her she would be declined entry to the U.S. and deported back to Australia the next day.\n\n>“[The officer] said ‘so basically what is going to happen is we’re going to send you to a prison overnight where you will stay,’” she said. “Not detention center, he said prison, and I automatically just, I started crying again.”\n\n>“Because when you think prison, you think, big time criminals. I don’t know who I’m being housed with,” she said.\n\n>According to Saroukos, border officials told her they would contact her husband on her behalf, but she found out later they didn’t.\n\n>Saroukos said officials conducted a body cavity search, walked her through the airport in handcuffs, and drove her to the Federal Detention Center.\n\n>“They stated, ‘No, you’re not under arrest. You haven’t done anything wrong, and you’ll be facing no criminal charges.’ So I was very confused as to why this was all happening,” she said.\n\n>At the prison, Saroukos was strip searched and detained with women who had been convicted of murder and drug offenses. She shared a cell with a woman from Fiji, who was also denied entry and waiting to be deported.\n\nJust, put yourself in her position for 10 seconds. You’ve done everything right. You’ve followed the laws and procedures. And just because someone decides today’s the day, they take you and your family, berate you, *rape* you, then parade you in front of the entire airport, and send you off to *prison* where you’re sexually harassed again. They cut you off from any means to contact anyone outside. They admit you’ve done no crime, they tell you this to your face. But they’ve kidnapped you, violated you, trampled your rights, and were one plane trip away from having you disappeared forever. Welcome to America.\n\nThis is fascism. This is what authoritarianism looks like. It’s not just happening to illegals or people you don’t like. It is everywhere. It is pervasive. It is growing. And it is not going away on its own.\n\n*It can happen to you.*",
                ">U.S. Customs and Border Protection told HNN they are working on a statement for this story.\n\nTranslation: “we have to come up with some story about how she was smuggling drugs and her husband was an awful serviceman.”",
                "Either their marriage will end, or he will quit the military and move to Australia (or someplace that doesn't strip search military spouses because they are on an ego trip). Fucking embarrassing being an American these days.",
                "> Saroukos said officials ***conducted a body cavity search***, walked her through the airport in handcuffs, and drove her to the Federal Detention Center.\n\n# “They stated, ‘No, you’re not under arrest. You haven’t done anything wrong, and you’ll be facing no criminal charges.’ So I was very confused as to why this was all happening,” she said.\n\nAh I see, so they decided \"well we might as well sexually assault her since there aren't any consequences\"\n\nLand of the Free™® brought to you by Blackwater USA!",
                "And they wonder why tourism numbers into the USA are dropping. Sorry, plummeting!",
                "I'd love to see the base Commander send the MPs to arrest the local ICE officials and hold them in military lockup for a while for hindering military readiness...",
                "More stories like this have me wondering before trump just how much CBP agents held back over the years.\n\nNow they do these acts with no fear of repercussions, in fact it's like they do this to move up the merit board and get a bonus.\n\nThis story alone has 2 women detained in prison vice flying out on next flight or at least in a humane holding room. Makes outsiders like me curious as to how many similar stories are out there that have not been told or documented.\n\nBut much like russian media, the loudest part of US media will make sure the average US citizen only hears and sees what they want them to see and how they see their leader. \n\nI hope that the mid-terms swing against the current administration because the States is on its way to imploding and the world will sit back and watch."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Family found mother's dead body eaten by dogs at LA homeless encampment. They're demanding answers",
            "external_url": "https://laist.com/news/housing-homelessness/mother-found-dead-at-homeless-encampment-the-city-should-have-taken-down-family-says",
            "upvotes": 2024,
            "date": "05/29/2025",
            "thumbnail": "https://scpr.brightspotcdn.com/dims4/default/376ef93/2147483647/strip/true/crop/7769x4079+0+193/resize/1200x630!/quality/90/?url=http%3A%2F%2Fscpr-brightspot.s3.us-west-2.amazonaws.com%2F33%2F65%2Ff12131094f2e9bb763bc90ce3459%2Fbarajas-family.jpg",
            "top_comments": [
                "Unfortunately agree with the down voted comments. Although no matter what, nobody deserves to die like this. Poor choices or not.\n\nOD'ing and being eaten by dogs...nobody deserves that. Just gruesome and unfortunate.",
                "Well, unfortunately there is no answer. Not any that will be satisfactory. \n\nHomeless people died everyday without anyone giving a sh\\*t. The only reason that this becomes a new story is because this mom is \\*not\\* homeless. \n\nI bet nothing will be done. More homeless people will die and be forgotten. The only outcome is that other people will stay away from homeless encampment with a ten foot pole. Clearly it is not safe in there.",
                "This is one of those headlines that just gets worse… and worse… and worse.\n\nThat poor woman. That poor family. This fucking country.",
                "Terrible news for the family. Sounds like the mother had her own history of homelessness. Was there a possibility of drug use? I really wish I knew how to end homelessness, but it seems to have always existed.",
                "That’s just grim. Why are we accepting that this is the world we live in?",
                "This is a terribly tragic story in every way. \n\nBut what do encampments have to do with it? It does sound like 2 people ODed together. Could have been at a home too. \n\nVery sad but nobody else caused it. ",
                "Places where people are sleeping on the streets are dangerous and inhumane but, honestly, I don't know what the answer is in terms of dealing with the many different reasons that propel people into lives of daily desperation, pain and suffering. It's a problem you can throw huge sums of money and it doesn't really alleviate the problem nor change the societal direction of homelessness. It's not just people who lack economic resource. If it was *just* about money, we'd have it nailed by now. Mental illness and other disabilities make up a large portion of the homeless community. A lot of these people, constitutionally, cannot care for themselves. They aren't lazy. They aren't unmotivated. They suffer from conditions that, often, render them literally incapable of doing the most basic elements of self-care. We need a system entirely devoted to this totally vulnerable part of our population. These are people that need assistance and have no way of paying for that assistance. We must help them in an organized, society-wide way because it is both he moral thing to do *and* the most practical thing we could to help restore some order to how our streets function. Meeting the needs of the homeless disabled population is a win win. And once we figure out the best way of helping that part of the homeless population you can build institutions designed to uniquely address the needs of other groups of homeless people. For some, it's going to be to offer shelter and assistance while they pursue better employment. For others, it may mean help with alcoholism and/or addiction. There are paths forward for people. it is of distinct benefit to all of us to help manifest the successful transformation of their lives.",
                "This is such a hard problem- so complicated. Probably needs multiple solutions.",
                "Who did it get to a point where they didn’t know where she was?",
                "This seems to be an OD. If her  \"friend\" had been housed, the OD likely still happens. Just no dogs involved."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Police officers who pepper-sprayed and tasered 92 year old amputee in care home cleared of assault.",
            "external_url": "https://news.sky.com/story/police-officers-who-pepper-sprayed-and-tasered-92-year-old-amputee-in-care-home-cleared-of-assault-13376045",
            "upvotes": 17238,
            "date": "05/28/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-stephen-smith-rachel-comotto_6929709.jpg?20250528152345",
            "top_comments": [
                "[Moment Pensioner Pepper Sprayed And Tasered By Police](https://youtu.be/pqyH9eORA24)   \n   \nVideo is on YouTube.",
                "Reminds me of way back when, houston pd killed a 1 armed man in a wheel chair for weilding a pencil. The police claimed to fear for their lives",
                "How hearty was the 92 year old?\n\nWe talking heihachi or junior soprano?",
                "How is that even possible?!? What a broken system!",
                "Before busting out the pitchforks in the US, this was in the UK. Poor training knows no borders.",
                "Oh no, what a horribly dangerous situation that couldn't literally just be solved by closing the door and waiting until he got bored.\n\nAnd they wonder why police are getting less and less respect.",
                "Gonna be honest, I expected this to be a US story.",
                "You see, that 92 year-old could've been a serious threat...",
                "Bro from the article they made it seem like this guy was holding a hostage and going nuts..... Guy is barely moving... You're telling me there wasn't a better way to handle what was obviously a old man having an episode? Fucking ridiculous.",
                "Because it isn't clarified in the headline - This took place in the United Kingdom."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "“Half the families we serve are already skipping meals,” Iowa food banks react to tariff impacts",
            "external_url": "https://www.kcrg.com/2025/05/28/half-families-we-serve-are-already-skipping-meals-iowa-food-banks-react-tariff-impacts/",
            "upvotes": 9024,
            "date": "05/28/2025",
            "thumbnail": "https://gray-kcrg-prod.gtv-cdn.com/resizer/v2/L77AX6YCNJAEPL5W3VV57AJB4Q.jpg?auth=2bb7731ba524269d281454ff69b48feb5cc7e4a75a128c6b06f605651a0b363a&width=1200&height=600&smart=true",
            "top_comments": [
                "My Trump supporting friend says to me, “Since Trump banned trans in the military, recruitment has sky rocketed.”  I said, “Are you sure that’s not because young people can’t afford food and housing?”",
                "and the oligarchs laugh about it. \n\nand idiots vote for the con men grifters who tell you that other poor people are the reason you can't have fair wages and healthcare when in fact it's greedy billionaires who pay to buy politicians to keep them from paying taxes.",
                "Iowa carried Trump and voted Chuck Grassley BACK in and have voted Joni Ernst in MANY times. They are a red state about to find out that voting/not voting has consequences. Maybe all of those farmers who voted the criminal in should be donating to the food pantries. Oh that’s right, he screwed them too. Of course they are banking on him coming thru with handouts like he did last term.",
                "Iowa prides itself on Christian values and corporate corn.\n So feeding the hungry is out of the question.",
                "With the Big Beautiful Bill we are gonna see this get so much worse.",
                "56% of votes were for this.",
                "My son is making bread today because we don't have money to go to the grocery store. Glad we had the flour.",
                "“…but they can’t wait to vote R in the next election”, he continued",
                "Just go out and farm for $4 per hour, like Trump says! Or work in a factory sewing a button on a shirt for $50 a day.",
                "If you have to join the army to eat, the troops should turn on the Commander in Chief."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump commutes sentence of former Gangster Disciples leader Larry Hoover",
            "external_url": "https://www.cbsnews.com/chicago/news/larry-hoover-gangster-disciples-sentence-commuted-president-trump/",
            "upvotes": 1389,
            "date": "05/29/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/28/4e825457-d6a7-43c5-a2a7-480b65aefe37/thumbnail/1200x630/9e1339b0c7be9037645f2e8e05450e74/larry-hoover-1993-file.png?v=0ec0a9b0c45ecf3b0dd269ffc8f350b0",
            "top_comments": [
                "Hoover still has a 150 to 200 year sentence on a state murder conviction from 1973. However, since the crime was committed before Illinois abolished discretionary parole in 1978, Hoover is eligible for a hearing with the Illinois Prisoner Review Board.\n\nIn all likelihood, Illinois will let Hoover out of prison. According to the Chicago Sun-Times, the Illinois Prisoner Review Board has freed [far worse criminals](https://chicago.suntimes.com/2020/7/24/21336624/illinois-prisoner-review-board-parole-larry-hoover-gangster-disciples-otis-williams-hatchet-murderer) convicted under the older law, many of whom absolutely would've been sent to prison for life or even executed had they committed their crimes a few years later. For example, in 2018, 70-year-old Ruben Taylor, a convicted mass murderer and probable serial killer, was paroled after 46 years in prison. He was part of a gang that killed 10 people in Chicago in 1972.\n\n>Ruben Taylor, 70, a member of the De Mau Mau gang that killed a Barrington Hills family in 1972. The gang randomly picked the home to rob. They forced Paul and Marion Corbett, their 22-year-old daughter and her aunt into a pantry. Their pet dachshund barked at the intruders, and a robber threw a knife at it. The daughter told him to stay away from the dog, and Taylor shot her in the chest. His brother Donald shot each of the other three family members in the head. Taylor was sentenced to 100 to 150 years. Asked by a parole board member how he'd respond to being called \"unrepentant,\" he answered, \"They don't know me and haven't walked in my shoes\" but also said, \"What can you say, other than you're sorry?\"\n> \n>The board granted Taylor parole by a vote of 8-4 in 2018.",
                "Why bother doing this? Why was this guy even on Trump's radar?",
                "Is Trump *trying* to be hated? Because I can't imagine how this makes him money or get him power, which are generally the only things he cares about.",
                "I'm shocked the tiger king hasn't received his pardon yet",
                "How many trump coins did it cost for his freedom? I hear the going rate for a pardon is around 2 million now.",
                "I get it now.   Trump doesn't want foreign gangs taking the jobs of American gangs.   So he is deporting the foreign gang members and releasing the American gang members from prison so they can get their gang jobs back.  \n\nsigh.",
                "So we send supposed immigrant killers to El Salvador \nbut the ones here can just go free\n\nI guess this is beyond my thinking bc I just can’t it gives me a headache and anxiety",
                "He seems to be trying to be law and order by pardoning enough people his administration will seem reasonable by comparison.",
                "Diddy is so getting pardoned!",
                "It feels like Trump is trying to create new friends because everyone is starting to distance themselves"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "A new variant of Covid-19 may be driving up cases in some parts of the world, WHO says",
            "external_url": "https://www.nbcnews.com/world/europe/new-variant-covid-19-may-driving-cases-parts-world-says-rcna209648",
            "upvotes": 248,
            "date": "05/29/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250529-covid-RS-74d50d.jpg",
            "top_comments": [
                "For anyone who won’t click the article, here is the byline. \n\n>The WHO has designated NB.1.8.1 a “variant under monitoring” and considers the public health risk low at the global level with current vaccines expected to remain effective.",
                "Airport screening in the United States has detected the new variant in travelers arriving from those regions to destinations in California, Washington state, Virginia and New York.\n\nThe new variant is called NB.1.8.1. It arrives as the United States’ official stance on Covid-19 vaccination is changing. On Tuesday, Health Secretary Robert F. Kennedy Jr. announced that Covid-19 shots are no longer recommended for healthy children and pregnant women — a move immediately questioned by several public health experts.",
                "Nothing will be done. All trust is gone. It’s every man for himself. It’s the American way.",
                "One thing guaranteed to make America even more of a pariah that none of us want to visit, is exploding covid cases thanks to the idiots and 'muh freedoms'.",
                " Just call it COVID update 25H2",
                "People like to shit on the US (rightfully so, especially recently) but is any other country talking about this/tracking it as we are outside of China? Or does nobody really care all that much?\n\nI go back and forth about my concern with COVID (and my approval rating of my home country the US, which happens to be currently VERY LOW), but just trying to understand where the world is at with concern around this new strain that appears to be driving what may be a summer proliferation of this virus."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "A new variant of Covid-19 may be driving up cases in some parts of the world, WHO says",
            "external_url": "https://www.nbcnews.com/world/europe/new-variant-covid-19-may-driving-cases-parts-world-says-rcna209648",
            "upvotes": 247,
            "date": "05/29/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250529-covid-RS-74d50d.jpg",
            "top_comments": [
                "For anyone who won’t click the article, here is the byline. \n\n>The WHO has designated NB.1.8.1 a “variant under monitoring” and considers the public health risk low at the global level with current vaccines expected to remain effective.",
                "Airport screening in the United States has detected the new variant in travelers arriving from those regions to destinations in California, Washington state, Virginia and New York.\n\nThe new variant is called NB.1.8.1. It arrives as the United States’ official stance on Covid-19 vaccination is changing. On Tuesday, Health Secretary Robert F. Kennedy Jr. announced that Covid-19 shots are no longer recommended for healthy children and pregnant women — a move immediately questioned by several public health experts.",
                "Nothing will be done. All trust is gone. It’s every man for himself. It’s the American way.",
                "One thing guaranteed to make America even more of a pariah that none of us want to visit, is exploding covid cases thanks to the idiots and 'muh freedoms'.",
                " Just call it COVID update 25H2",
                "People like to shit on the US (rightfully so, especially recently) but is any other country talking about this/tracking it as we are outside of China? Or does nobody really care all that much?\n\nI go back and forth about my concern with COVID (and my approval rating of my home country the US, which happens to be currently VERY LOW), but just trying to understand where the world is at with concern around this new strain that appears to be driving what may be a summer proliferation of this virus."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Texas push to ban minors under 18 from social media fades with time running out",
            "external_url": "https://abcnews.go.com/Technology/wireStory/texas-push-ban-minors-18-social-media-fades-122297882",
            "upvotes": 131,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/9fc4f934-c8d4-47b1-9952-aeb14701ce77/wirestory_2f254f6a90dd140e2f35381788e3a97b_16x9.jpg?w=1600",
            "top_comments": [
                "The proposed Texas ban aimed at minors is the latest move in a growing bipartisan push nationwide to address the impacts of social media on the well-being of children. Critics accuse platforms of using addictive functions to lure children onto their site and keep them there, and of not doing enough to curb violent or age-inappropriate content, or online abuse.",
                "Parents looking for scapegoats.",
                "Anytime a politician uses for the children I'm suspicious they're sneaking more freedom stealing aspects into the legislation / bill because we all know the politicians / the rich couldn't give a shit about children",
                "Why not take it one step further and make it legal for these tech companies to collect data on minors?",
                "I thought parents were free to raise their kids they wanted to without the nanny state telling them what to do?",
                "Are we living in Russia already?",
                "If engagement driven social media favored the left, it would have been banned 8 years ago. The right would be incapable of winning elections without ragebaiting voters into voting against imaginary problems. There is no reality where they ban any age group from using it, but they will pretend to care just long enough to trick people who don't really pay attention to politics.",
                "I understand what its going for. But the government gets to have absolutely no say in what my kid does regarding social media. Government doesnt get to monitor screen time.",
                "Parents don't want their hyperactive kids stuck in the house with nothing to do. Like television before it, the internet is this generation's babysitter."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US defence chief looks to woo allies in Asian security forum debut",
            "external_url": "https://www.reuters.com/world/china/us-defence-chief-looks-woo-allies-asian-security-forum-debut-2025-05-28/",
            "upvotes": 37,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "With his deep background in make-up, tattoos, gossiping, hound-dogging and hair products, Hegseth might just turn allies into adversaries.",
                "What an absolute embarrassment it is to have these half wit, dumb as rocks, intellectual dwarfs representing the United States in these summits. Especially with our Asian allies who geopolitically are quite advanced. It's like sending a bunch of Little Leaguers to play in the World Series against the Yankees or Dodgers. Outclassed, outmaneuvered and sure to make us look horrible on the world stage, but what can you expect when the man they report to is worse than they are.",
                "LMAO good luck with that. We're the laughingstock of the world right now.",
                "Hegseth, who has spent a large portion of his first months on the job focused on domestic issues, countering diversity, equity and inclusion in the military and taking aim at the press, will make his first extended remarks in Singapore on Saturday about how he envisions U.S. defence policy in the Indo-Pacific.",
                "Ant betting websites have odds for him attempting to extort protection money?",
                "What I don't like is that these folks can't talk about partnerships or mutual respect, they just go out and blab, saying Trump's name 30 times in a 10 minute speech",
                "Better keep the liquor away",
                "https://m.youtube.com/watch?v=FqJwD35wWhY",
                "[https://www.nbcnews.com/world/asia/us-will-aggressively-revoke-chinese-students-visas-rubio-says-rcna209637](https://www.nbcnews.com/world/asia/us-will-aggressively-revoke-chinese-students-visas-rubio-says-rcna209637)",
                "I’ll guess he’s resorting to threats by his second sentence"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Alpine village largely destroyed after glacier collapse causes 'major catastrophe'",
            "external_url": "https://abcnews.go.com/International/wireStory/rock-slide-hits-swiss-alpine-village-authorities-ordered-122271419",
            "upvotes": 213,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/84c9b957-fd27-4322-88f8-a33f659df28d/wirestory_28e15e240eacb40bcbdb6a8f15d49398_16x9.jpg?w=1600",
            "top_comments": [
                "The article does not cover the scale of this:\n* 90 percent of the village is buried under a mudslide several meters high. 300 people lost their homes.\n* 3 million cubic meters of rock, ice, and debris\n* The landslide area is two kilometers long and up to 200 meters wide\n* Caused an earthquake of magnitude 3.1\n* The river that ran though is now blocked and flooded the remaining houses. Two municipalities that are downstream have now been evacuated.\n\n\nSources: (English) https://www.bluewin.ch/en/news/switzerland/two-further-communities-partially-evacuated-almost-90-percent-of-blatten-buried-under-mudslide-2699647.html (German) https://www.srf.ch/news/schweiz/gletscherabbruch-blatten-letzte-haeuser-in-blatten-ueberflutet-nachbardoerfer-teilevakuiert",
                "Climate crisis doing climate crisis things",
                "The regional government said in a statement that a large chunk of the Birch Glacier located above the village had broken off, causing the landslide which as well as covering the village had also buried the nearby Lonza River bed, raising the possibility of dammed water flows.",
                "The people funding this \"climate change hoax\" are super committed to the bit, aren't they? /s",
                "Some of the first casualties of the billionaires' war against Earth for money.",
                "They'll continue to deny the horrors of man made and exacerbated climate change until they're under water.\n\nAnd then they'll blame the democrats for not being more adamant about explaining it to them.",
                "Living in the mountain is becoming riskier and riskier, I advise moving down away from mountains."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Pacific Island nations support China's Taiwan claims at high-profile foreign ministers' meeting",
            "external_url": "https://www.abc.net.au/news/2025-05-29/china-wang-yi-pacific-islands-meeting-climate-taiwan/105353012",
            "upvotes": 62,
            "date": "05/29/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/35ed8d86c77df135905889f365fa756e?impolicy=wcms_watermark_news&cropH=2676&cropW=4757&xPos=166&yPos=532&width=862&height=485&imformat=generic",
            "top_comments": [
                "Strange how America seems to be giving up all its soft power and the world is already turning to China to replace them.",
                "Now we'd like to hear about relevant countries that weren't bought by China.",
                "It matters little what these nations think about Taiwan's sovereignty. The only thing that matters is the opinion of the Taiwanese people themselves. They are the ones who shall decide the future of their country.",
                "So China expands its influence around the globe while Trump shrinks ours......."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "U.S. will 'aggressively' revoke Chinese students' visas, Rubio says",
            "external_url": "https://www.nbcnews.com/world/asia/us-will-aggressively-revoke-chinese-students-visas-rubio-says-rcna209637",
            "upvotes": 506,
            "date": "05/29/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250513-marco-rubio-ac-956p-007aa1.jpg",
            "top_comments": [
                "And eventually be struck down in court for being discrimination. All this stuff creates a ton of headlines but generates very few results.",
                "One of the best and brightest PhD candidates in my high output research laboratory at one of the best schools in the country is now extremely worried about her position. Fuck these people man.",
                "I really really don't think this administration understands how many American students' tuition is subsidised by international students.",
                "This just fucking sucks man. I know a foreign exchange student from China in my class who’s heading to one of the best colleges in the country next semester. She’s worked so hard to learn English and get good grades and stuff and now it might all get taken away because of this 😭",
                "I don't like this at all. But I *really* don't like the path it suggests we're walking down.",
                "They aren't finding as many illegal immigrants as they thought they would so they're creating illegal immigrants in easy to target areas.",
                "It would be interesting if one day his family end up being deported because they were immigrants.\nAnd if they revoke birthright citizenship, he would get booted too.",
                "Milk that xenophobic cow baby!",
                "This guy will regret being so aggressive on deportations, and fighting for foreign travelers/ students from coming to this country.  He could easily be deported by any administration, even his own.  Reprehensible.",
                "Ah we’ve moved down the track of fascism. \n\nFirst the “mexicans”. Now the Chinese."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Get Ready for Several Years of Killer Heat, Top Weather Forecasters Warn",
            "external_url": "https://apnews.com/article/climate-change-deadly-record-heat-wildfires-hurricanes-535b4df63b476d0f36ec553a1a78669d",
            "upvotes": 555,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Several years?  You mean couple of decades since we're still pumping carbon dioxides into air unabated for the most part.",
                "You mean the rest of our lives",
                "I used to live in Arizona-- I don't even want to imagine this.",
                "I, for one, am comforted by the fact that a video told me that climate change is a hoax, so we have nothing to fear. ",
                "From now until the end of humanity",
                "[deleted]",
                "No way to have prevented this says everyone who ignored scientists warning about this for the last forty years.",
                "It was too expensive to force companies to do anything about climate change so oh well guess we just gotta pay billions and billions now.",
                "Get ready for crescendo killer heat becoming the norm for centuries, get ready for AMOC disruption, get ready for water wars, get ready for insects and mushroom diet, get ready for acid seas that don't foster life beyond micro-organism.",
                "Antarctica loves this one neat trick!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Family found mother's dead body eaten by dogs at LA homeless encampment. They're demanding answers",
            "external_url": "https://laist.com/news/housing-homelessness/mother-found-dead-at-homeless-encampment-the-city-should-have-taken-down-family-says",
            "upvotes": 2022,
            "date": "05/29/2025",
            "thumbnail": "https://scpr.brightspotcdn.com/dims4/default/376ef93/2147483647/strip/true/crop/7769x4079+0+193/resize/1200x630!/quality/90/?url=http%3A%2F%2Fscpr-brightspot.s3.us-west-2.amazonaws.com%2F33%2F65%2Ff12131094f2e9bb763bc90ce3459%2Fbarajas-family.jpg",
            "top_comments": [
                "Unfortunately agree with the down voted comments. Although no matter what, nobody deserves to die like this. Poor choices or not.\n\nOD'ing and being eaten by dogs...nobody deserves that. Just gruesome and unfortunate.",
                "Well, unfortunately there is no answer. Not any that will be satisfactory. \n\nHomeless people died everyday without anyone giving a sh\\*t. The only reason that this becomes a new story is because this mom is \\*not\\* homeless. \n\nI bet nothing will be done. More homeless people will die and be forgotten. The only outcome is that other people will stay away from homeless encampment with a ten foot pole. Clearly it is not safe in there.",
                "This is one of those headlines that just gets worse… and worse… and worse.\n\nThat poor woman. That poor family. This fucking country.",
                "Terrible news for the family. Sounds like the mother had her own history of homelessness. Was there a possibility of drug use? I really wish I knew how to end homelessness, but it seems to have always existed.",
                "That’s just grim. Why are we accepting that this is the world we live in?",
                "This is a terribly tragic story in every way. \n\nBut what do encampments have to do with it? It does sound like 2 people ODed together. Could have been at a home too. \n\nVery sad but nobody else caused it. ",
                "Places where people are sleeping on the streets are dangerous and inhumane but, honestly, I don't know what the answer is in terms of dealing with the many different reasons that propel people into lives of daily desperation, pain and suffering. It's a problem you can throw huge sums of money and it doesn't really alleviate the problem nor change the societal direction of homelessness. It's not just people who lack economic resource. If it was *just* about money, we'd have it nailed by now. Mental illness and other disabilities make up a large portion of the homeless community. A lot of these people, constitutionally, cannot care for themselves. They aren't lazy. They aren't unmotivated. They suffer from conditions that, often, render them literally incapable of doing the most basic elements of self-care. We need a system entirely devoted to this totally vulnerable part of our population. These are people that need assistance and have no way of paying for that assistance. We must help them in an organized, society-wide way because it is both he moral thing to do *and* the most practical thing we could to help restore some order to how our streets function. Meeting the needs of the homeless disabled population is a win win. And once we figure out the best way of helping that part of the homeless population you can build institutions designed to uniquely address the needs of other groups of homeless people. For some, it's going to be to offer shelter and assistance while they pursue better employment. For others, it may mean help with alcoholism and/or addiction. There are paths forward for people. it is of distinct benefit to all of us to help manifest the successful transformation of their lives.",
                "This is such a hard problem- so complicated. Probably needs multiple solutions.",
                "Who did it get to a point where they didn’t know where she was?",
                "This seems to be an OD. If her  \"friend\" had been housed, the OD likely still happens. Just no dogs involved."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Elon Musk bids farewell to White House but says Doge will continue",
            "external_url": "https://www.bbc.com/news/articles/cz9y4exj822o",
            "upvotes": 4604,
            "date": "05/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4149/live/bb4c3ee0-3c28-11f0-af00-f94ff1cabcc0.jpg",
            "top_comments": [
                "Is this why he disabled community notes?",
                "To whatever extent \"leaving\" counts when you still have your aides appointed to the highest levels of government agencies",
                "Yeah but only because he has to, his status as a “special government employee” grants him only 130 days before he needs to leave and his time is up. This has to happen, it’s not voluntary.\n\nI would be surprised if this is the last Elon has to do with this administration. It’s a presidency he bought and paid for, after all.\n\nIn the meantime, fuck Tesla, fuck SpaceX, fuck X, and fuck Donald Trump.",
                "The amount of times I’ve seen rich people come into an organization, fuck things completely up, fire the people who were trying to save them, ruin lives and walk away like they just won the superbowl is too damn high.",
                "Does that mean Big Balls is in charge now?",
                "[removed]",
                "Look at this clown trying to save face:\n\n*The BBC understands that the White House will begin \"offboarding\" Musk as a special government employee on Wednesday night.\nMusk's exit comes after he said he was \"disappointed\" with Trump's budget, which proposes multi-trillion dollar tax breaks and a boost to defence spending.\nThe SpaceX and Tesla boss said in an interview with BBC's US partner CBS that the bill would increase the federal deficit, adding that he thought it \"undermines the work\" being done at Doge.*",
                "This fuckin schmuck will be back for midterms writing checks and pressuring people, fuck these stories about him leaving, theyre cover for his damaging actions that help weaken our country and our social safety net. Fuck billionaires, take their money now.",
                "Timescale on Trump claiming he didn't know him?",
                "Don’t let up on his businesses, he stole our information, got his government contracts, he got what he needed and is trying to walk away. Don’t let up."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump commutes sentence of former Gangster Disciples leader Larry Hoover",
            "external_url": "https://www.cbsnews.com/chicago/news/larry-hoover-gangster-disciples-sentence-commuted-president-trump/",
            "upvotes": 1390,
            "date": "05/29/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/28/4e825457-d6a7-43c5-a2a7-480b65aefe37/thumbnail/1200x630/9e1339b0c7be9037645f2e8e05450e74/larry-hoover-1993-file.png?v=0ec0a9b0c45ecf3b0dd269ffc8f350b0",
            "top_comments": [
                "Hoover still has a 150 to 200 year sentence on a state murder conviction from 1973. However, since the crime was committed before Illinois abolished discretionary parole in 1978, Hoover is eligible for a hearing with the Illinois Prisoner Review Board.\n\nIn all likelihood, Illinois will let Hoover out of prison. According to the Chicago Sun-Times, the Illinois Prisoner Review Board has freed [far worse criminals](https://chicago.suntimes.com/2020/7/24/21336624/illinois-prisoner-review-board-parole-larry-hoover-gangster-disciples-otis-williams-hatchet-murderer) convicted under the older law, many of whom absolutely would've been sent to prison for life or even executed had they committed their crimes a few years later. For example, in 2018, 70-year-old Ruben Taylor, a convicted mass murderer and probable serial killer, was paroled after 46 years in prison. He was part of a gang that killed 10 people in Chicago in 1972.\n\n>Ruben Taylor, 70, a member of the De Mau Mau gang that killed a Barrington Hills family in 1972. The gang randomly picked the home to rob. They forced Paul and Marion Corbett, their 22-year-old daughter and her aunt into a pantry. Their pet dachshund barked at the intruders, and a robber threw a knife at it. The daughter told him to stay away from the dog, and Taylor shot her in the chest. His brother Donald shot each of the other three family members in the head. Taylor was sentenced to 100 to 150 years. Asked by a parole board member how he'd respond to being called \"unrepentant,\" he answered, \"They don't know me and haven't walked in my shoes\" but also said, \"What can you say, other than you're sorry?\"\n> \n>The board granted Taylor parole by a vote of 8-4 in 2018.",
                "Why bother doing this? Why was this guy even on Trump's radar?",
                "Is Trump *trying* to be hated? Because I can't imagine how this makes him money or get him power, which are generally the only things he cares about.",
                "I'm shocked the tiger king hasn't received his pardon yet",
                "How many trump coins did it cost for his freedom? I hear the going rate for a pardon is around 2 million now.",
                "I get it now.   Trump doesn't want foreign gangs taking the jobs of American gangs.   So he is deporting the foreign gang members and releasing the American gang members from prison so they can get their gang jobs back.  \n\nsigh.",
                "So we send supposed immigrant killers to El Salvador \nbut the ones here can just go free\n\nI guess this is beyond my thinking bc I just can’t it gives me a headache and anxiety",
                "He seems to be trying to be law and order by pardoning enough people his administration will seem reasonable by comparison.",
                "Diddy is so getting pardoned!",
                "It feels like Trump is trying to create new friends because everyone is starting to distance themselves"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "A new variant of Covid-19 may be driving up cases in some parts of the world, WHO says",
            "external_url": "https://www.nbcnews.com/world/europe/new-variant-covid-19-may-driving-cases-parts-world-says-rcna209648",
            "upvotes": 248,
            "date": "05/29/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250529-covid-RS-74d50d.jpg",
            "top_comments": [
                "For anyone who won’t click the article, here is the byline. \n\n>The WHO has designated NB.1.8.1 a “variant under monitoring” and considers the public health risk low at the global level with current vaccines expected to remain effective.",
                "Airport screening in the United States has detected the new variant in travelers arriving from those regions to destinations in California, Washington state, Virginia and New York.\n\nThe new variant is called NB.1.8.1. It arrives as the United States’ official stance on Covid-19 vaccination is changing. On Tuesday, Health Secretary Robert F. Kennedy Jr. announced that Covid-19 shots are no longer recommended for healthy children and pregnant women — a move immediately questioned by several public health experts.",
                "Nothing will be done. All trust is gone. It’s every man for himself. It’s the American way.",
                "One thing guaranteed to make America even more of a pariah that none of us want to visit, is exploding covid cases thanks to the idiots and 'muh freedoms'.",
                " Just call it COVID update 25H2",
                "People like to shit on the US (rightfully so, especially recently) but is any other country talking about this/tracking it as we are outside of China? Or does nobody really care all that much?\n\nI go back and forth about my concern with COVID (and my approval rating of my home country the US, which happens to be currently VERY LOW), but just trying to understand where the world is at with concern around this new strain that appears to be driving what may be a summer proliferation of this virus."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "U.S. will 'aggressively' revoke Chinese students' visas, Rubio says",
            "external_url": "https://www.nbcnews.com/world/asia/us-will-aggressively-revoke-chinese-students-visas-rubio-says-rcna209637",
            "upvotes": 507,
            "date": "05/29/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250513-marco-rubio-ac-956p-007aa1.jpg",
            "top_comments": [
                "And eventually be struck down in court for being discrimination. All this stuff creates a ton of headlines but generates very few results.",
                "One of the best and brightest PhD candidates in my high output research laboratory at one of the best schools in the country is now extremely worried about her position. Fuck these people man.",
                "I really really don't think this administration understands how many American students' tuition is subsidised by international students.",
                "This just fucking sucks man. I know a foreign exchange student from China in my class who’s heading to one of the best colleges in the country next semester. She’s worked so hard to learn English and get good grades and stuff and now it might all get taken away because of this 😭",
                "I don't like this at all. But I *really* don't like the path it suggests we're walking down.",
                "They aren't finding as many illegal immigrants as they thought they would so they're creating illegal immigrants in easy to target areas.",
                "It would be interesting if one day his family end up being deported because they were immigrants.\nAnd if they revoke birthright citizenship, he would get booted too.",
                "Milk that xenophobic cow baby!",
                "This guy will regret being so aggressive on deportations, and fighting for foreign travelers/ students from coming to this country.  He could easily be deported by any administration, even his own.  Reprehensible.",
                "Ah we’ve moved down the track of fascism. \n\nFirst the “mexicans”. Now the Chinese."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Alpine village largely destroyed after glacier collapse causes 'major catastrophe'",
            "external_url": "https://abcnews.go.com/International/wireStory/rock-slide-hits-swiss-alpine-village-authorities-ordered-122271419",
            "upvotes": 209,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/84c9b957-fd27-4322-88f8-a33f659df28d/wirestory_28e15e240eacb40bcbdb6a8f15d49398_16x9.jpg?w=1600",
            "top_comments": [
                "The article does not cover the scale of this:\n* 90 percent of the village is buried under a mudslide several meters high. 300 people lost their homes.\n* 3 million cubic meters of rock, ice, and debris\n* The landslide area is two kilometers long and up to 200 meters wide\n* Caused an earthquake of magnitude 3.1\n* The river that ran though is now blocked and flooded the remaining houses. Two municipalities that are downstream have now been evacuated.\n\n\nSources: (English) https://www.bluewin.ch/en/news/switzerland/two-further-communities-partially-evacuated-almost-90-percent-of-blatten-buried-under-mudslide-2699647.html (German) https://www.srf.ch/news/schweiz/gletscherabbruch-blatten-letzte-haeuser-in-blatten-ueberflutet-nachbardoerfer-teilevakuiert",
                "Climate crisis doing climate crisis things",
                "The regional government said in a statement that a large chunk of the Birch Glacier located above the village had broken off, causing the landslide which as well as covering the village had also buried the nearby Lonza River bed, raising the possibility of dammed water flows.",
                "The people funding this \"climate change hoax\" are super committed to the bit, aren't they? /s",
                "Some of the first casualties of the billionaires' war against Earth for money.",
                "They'll continue to deny the horrors of man made and exacerbated climate change until they're under water.\n\nAnd then they'll blame the democrats for not being more adamant about explaining it to them.",
                "Living in the mountain is becoming riskier and riskier, I advise moving down away from mountains."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Elon Musk bids farewell to White House but says Doge will continue",
            "external_url": "https://www.bbc.com/news/articles/cz9y4exj822o",
            "upvotes": 4599,
            "date": "05/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4149/live/bb4c3ee0-3c28-11f0-af00-f94ff1cabcc0.jpg",
            "top_comments": [
                "Is this why he disabled community notes?",
                "To whatever extent \"leaving\" counts when you still have your aides appointed to the highest levels of government agencies",
                "Yeah but only because he has to, his status as a “special government employee” grants him only 130 days before he needs to leave and his time is up. This has to happen, it’s not voluntary.\n\nI would be surprised if this is the last Elon has to do with this administration. It’s a presidency he bought and paid for, after all.\n\nIn the meantime, fuck Tesla, fuck SpaceX, fuck X, and fuck Donald Trump.",
                "The amount of times I’ve seen rich people come into an organization, fuck things completely up, fire the people who were trying to save them, ruin lives and walk away like they just won the superbowl is too damn high.",
                "Does that mean Big Balls is in charge now?",
                "[removed]",
                "Look at this clown trying to save face:\n\n*The BBC understands that the White House will begin \"offboarding\" Musk as a special government employee on Wednesday night.\nMusk's exit comes after he said he was \"disappointed\" with Trump's budget, which proposes multi-trillion dollar tax breaks and a boost to defence spending.\nThe SpaceX and Tesla boss said in an interview with BBC's US partner CBS that the bill would increase the federal deficit, adding that he thought it \"undermines the work\" being done at Doge.*",
                "This fuckin schmuck will be back for midterms writing checks and pressuring people, fuck these stories about him leaving, theyre cover for his damaging actions that help weaken our country and our social safety net. Fuck billionaires, take their money now.",
                "Timescale on Trump claiming he didn't know him?",
                "Don’t let up on his businesses, he stole our information, got his government contracts, he got what he needed and is trying to walk away. Don’t let up."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Family found mother's dead body eaten by dogs at LA homeless encampment. They're demanding answers",
            "external_url": "https://laist.com/news/housing-homelessness/mother-found-dead-at-homeless-encampment-the-city-should-have-taken-down-family-says",
            "upvotes": 2025,
            "date": "05/29/2025",
            "thumbnail": "https://scpr.brightspotcdn.com/dims4/default/376ef93/2147483647/strip/true/crop/7769x4079+0+193/resize/1200x630!/quality/90/?url=http%3A%2F%2Fscpr-brightspot.s3.us-west-2.amazonaws.com%2F33%2F65%2Ff12131094f2e9bb763bc90ce3459%2Fbarajas-family.jpg",
            "top_comments": [
                "Unfortunately agree with the down voted comments. Although no matter what, nobody deserves to die like this. Poor choices or not.\n\nOD'ing and being eaten by dogs...nobody deserves that. Just gruesome and unfortunate.",
                "Well, unfortunately there is no answer. Not any that will be satisfactory. \n\nHomeless people died everyday without anyone giving a sh\\*t. The only reason that this becomes a new story is because this mom is \\*not\\* homeless. \n\nI bet nothing will be done. More homeless people will die and be forgotten. The only outcome is that other people will stay away from homeless encampment with a ten foot pole. Clearly it is not safe in there.",
                "This is one of those headlines that just gets worse… and worse… and worse.\n\nThat poor woman. That poor family. This fucking country.",
                "Terrible news for the family. Sounds like the mother had her own history of homelessness. Was there a possibility of drug use? I really wish I knew how to end homelessness, but it seems to have always existed.",
                "That’s just grim. Why are we accepting that this is the world we live in?",
                "This is a terribly tragic story in every way. \n\nBut what do encampments have to do with it? It does sound like 2 people ODed together. Could have been at a home too. \n\nVery sad but nobody else caused it. ",
                "Places where people are sleeping on the streets are dangerous and inhumane but, honestly, I don't know what the answer is in terms of dealing with the many different reasons that propel people into lives of daily desperation, pain and suffering. It's a problem you can throw huge sums of money and it doesn't really alleviate the problem nor change the societal direction of homelessness. It's not just people who lack economic resource. If it was *just* about money, we'd have it nailed by now. Mental illness and other disabilities make up a large portion of the homeless community. A lot of these people, constitutionally, cannot care for themselves. They aren't lazy. They aren't unmotivated. They suffer from conditions that, often, render them literally incapable of doing the most basic elements of self-care. We need a system entirely devoted to this totally vulnerable part of our population. These are people that need assistance and have no way of paying for that assistance. We must help them in an organized, society-wide way because it is both he moral thing to do *and* the most practical thing we could to help restore some order to how our streets function. Meeting the needs of the homeless disabled population is a win win. And once we figure out the best way of helping that part of the homeless population you can build institutions designed to uniquely address the needs of other groups of homeless people. For some, it's going to be to offer shelter and assistance while they pursue better employment. For others, it may mean help with alcoholism and/or addiction. There are paths forward for people. it is of distinct benefit to all of us to help manifest the successful transformation of their lives.",
                "This is such a hard problem- so complicated. Probably needs multiple solutions.",
                "Who did it get to a point where they didn’t know where she was?",
                "This seems to be an OD. If her  \"friend\" had been housed, the OD likely still happens. Just no dogs involved."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Get Ready for Several Years of Killer Heat, Top Weather Forecasters Warn",
            "external_url": "https://apnews.com/article/climate-change-deadly-record-heat-wildfires-hurricanes-535b4df63b476d0f36ec553a1a78669d",
            "upvotes": 554,
            "date": "05/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Several years?  You mean couple of decades since we're still pumping carbon dioxides into air unabated for the most part.",
                "You mean the rest of our lives",
                "I used to live in Arizona-- I don't even want to imagine this.",
                "I, for one, am comforted by the fact that a video told me that climate change is a hoax, so we have nothing to fear. ",
                "From now until the end of humanity",
                "[deleted]",
                "No way to have prevented this says everyone who ignored scientists warning about this for the last forty years.",
                "It was too expensive to force companies to do anything about climate change so oh well guess we just gotta pay billions and billions now.",
                "Get ready for crescendo killer heat becoming the norm for centuries, get ready for AMOC disruption, get ready for water wars, get ready for insects and mushroom diet, get ready for acid seas that don't foster life beyond micro-organism.",
                "Antarctica loves this one neat trick!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump commutes sentence of former Gangster Disciples leader Larry Hoover",
            "external_url": "https://www.cbsnews.com/chicago/news/larry-hoover-gangster-disciples-sentence-commuted-president-trump/",
            "upvotes": 1391,
            "date": "05/29/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/28/4e825457-d6a7-43c5-a2a7-480b65aefe37/thumbnail/1200x630/9e1339b0c7be9037645f2e8e05450e74/larry-hoover-1993-file.png?v=0ec0a9b0c45ecf3b0dd269ffc8f350b0",
            "top_comments": [
                "Hoover still has a 150 to 200 year sentence on a state murder conviction from 1973. However, since the crime was committed before Illinois abolished discretionary parole in 1978, Hoover is eligible for a hearing with the Illinois Prisoner Review Board.\n\nIn all likelihood, Illinois will let Hoover out of prison. According to the Chicago Sun-Times, the Illinois Prisoner Review Board has freed [far worse criminals](https://chicago.suntimes.com/2020/7/24/21336624/illinois-prisoner-review-board-parole-larry-hoover-gangster-disciples-otis-williams-hatchet-murderer) convicted under the older law, many of whom absolutely would've been sent to prison for life or even executed had they committed their crimes a few years later. For example, in 2018, 70-year-old Ruben Taylor, a convicted mass murderer and probable serial killer, was paroled after 46 years in prison. He was part of a gang that killed 10 people in Chicago in 1972.\n\n>Ruben Taylor, 70, a member of the De Mau Mau gang that killed a Barrington Hills family in 1972. The gang randomly picked the home to rob. They forced Paul and Marion Corbett, their 22-year-old daughter and her aunt into a pantry. Their pet dachshund barked at the intruders, and a robber threw a knife at it. The daughter told him to stay away from the dog, and Taylor shot her in the chest. His brother Donald shot each of the other three family members in the head. Taylor was sentenced to 100 to 150 years. Asked by a parole board member how he'd respond to being called \"unrepentant,\" he answered, \"They don't know me and haven't walked in my shoes\" but also said, \"What can you say, other than you're sorry?\"\n> \n>The board granted Taylor parole by a vote of 8-4 in 2018.",
                "Why bother doing this? Why was this guy even on Trump's radar?",
                "Is Trump *trying* to be hated? Because I can't imagine how this makes him money or get him power, which are generally the only things he cares about.",
                "I'm shocked the tiger king hasn't received his pardon yet",
                "How many trump coins did it cost for his freedom? I hear the going rate for a pardon is around 2 million now.",
                "I get it now.   Trump doesn't want foreign gangs taking the jobs of American gangs.   So he is deporting the foreign gang members and releasing the American gang members from prison so they can get their gang jobs back.  \n\nsigh.",
                "So we send supposed immigrant killers to El Salvador \nbut the ones here can just go free\n\nI guess this is beyond my thinking bc I just can’t it gives me a headache and anxiety",
                "He seems to be trying to be law and order by pardoning enough people his administration will seem reasonable by comparison.",
                "Diddy is so getting pardoned!",
                "It feels like Trump is trying to create new friends because everyone is starting to distance themselves"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US cancels more than $700 million funding for Moderna bird flu vaccine",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-cancels-more-700-million-funding-moderna-bird-flu-vaccine-2025-05-28/",
            "upvotes": 25495,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Really don’t get how they can just decide to not pay things already contracted",
                "How does the Executive Branch keep cancelling Congressionally-appropriated funds with no consequences?",
                "> Moderna in January was awarded $590 million by the Biden administration to advance the development of its bird flu vaccine, and support the expansion of clinical studies for up to five additional subtypes of pandemic influenza\n\nCancelled by the Trump administration just 4 months later.",
                "The pharmaceutical industry will respond with - checks notes - massive donations to current and future Republicans, including Trump.",
                "Dumb bastards.  An ounce of prevention is worth a pound of cure.",
                "Is this going to bring down the price of chicken?",
                "Known pandemic mass murderer makes it so he can kill again. More at 11.",
                "Can we remove this guy from office solely on the grounds that he's actively trying to kill us?",
                "Then when there's another bird flu epidemic Maga is going to be scratching their heads and bend over backwards not to blame trump",
                "Why is the Trump administration so pro-bird flu?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Federal trade court blocks Trump from imposing sweeping tariffs under emergency powers law",
            "external_url": "https://apnews.com/article/trump-tariffs-trade-court-0392dbd59f548e49ad4f64254ae3f94a",
            "upvotes": 7246,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "...and here is the kicker;\n\n>The court’s ruling also means that **the government may have to pay back duties it has already collected**. “Anybody that has had to pay tariffs so far will be able to get them refunded,” said Ilya Somin, a professor of law at George Mason University\n\n[https://www.politico.com/news/2025/05/28/federal-court-strikes-down-trumps-april-2-tariffs-00373843](https://www.politico.com/news/2025/05/28/federal-court-strikes-down-trumps-april-2-tariffs-00373843)",
                "Between this and being called TACO, it’s going to be a long night of tweeting.",
                ".......and there we have it folks.\n\nMarkets will be so green tomorrow..!",
                "The fact it took this long for a ruling is a problem.",
                "\"The Congress shall have Power To lay and collect Taxes, Duties, Imposts and Excises, to pay the Debts and provide for the common Defence and general Welfare of the United States; but all Duties, Imposts and Excises shall be uniform throughout the United States; . . .\"\n\n\nArtI.S8.C1.1.1 of the United States Constitution \n\n\n\nMy #1 issue with almost everything that Trump does is not that I think it's wrong (which I almost always do) but that it's clearly against the law. If he had operated within the bounds of the law and worked with congress to pass a law setting tariffs, then boom the tariffs go into effect and theres no judge ruling that congress doesn't have that power, and democrats have way less of a leg to stand on. Deal with it, win the next election, right?\n\n\n\n\n\nIt's the same thing with all the doge stuff, or eliminating the dept of education, or mass deportations. All of these goals could 100% be achieved if the law was followed. But Trump is an authoritarian piece of shit and doesn't believe that the law applies to him.",
                "Turns out if you're a TACO-ing, it pretty much ruins any chance you have for claiming the tariffs are necessary.",
                "tonight's twitter storm will be Hilarious",
                "Just the latest round of TACO Don's pump 'n dump scheme. SCOTUS will overturn this to cause the next downturn.",
                "Is this going to stop him from issuing tariffs? Like does this court order have merit and it will actually stop the orange monster from continuing this path of self destruction?",
                "I think this might just be the off ramp Trump has been looking for. ever since he made the april tariff announcement he has been walking them back.. and now the courts just handed him a beauty of an off ramp.. everyone saves face here and the market will light up like an xmas tree. brilliant really."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US judge allows states' lawsuit against DOGE to proceed",
            "external_url": "https://www.reuters.com/world/us/us-judge-allows-states-lawsuit-against-doge-proceed-2025-05-27/",
            "upvotes": 11777,
            "date": "05/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I won't be surprised if the eventual accounting shows that Elon Musk cost the United States, in law suits for illegal firings, broken contracts, and all the other nonsense \"DOGE\" has done, a great deal more than any imagined \"savings\".",
                "Hope something comes out of it, not expecting much.",
                "Impeach the judge request incoming and another truth social rant post.",
                "This whole fiasco is going to cost us so much.",
                "The judge is Tanya Chutkan, whom Trump escaped in the J6 case in Washington, with Jack Smith of DOJ prosecuting. She is an Obama nominee. \n\nJudge Chutkan is a Black woman who was born in Kingston, Jamaica and came here at 17. She is a tough, competent jurist, a former public defender. In a 2021 ruling, she said \"Presidents are not kings, and Plaintiff is not President.” \n\nMusk has no immunity, and he has no privilege to withhold documents or other evidence. He has committed crimes, and if he is deposed, he will take the Fifth. \n\nHugely important case with massive resources from Blue State AG's Office. DOJ is investigating Letitia James, the NY AG who beat Trump in his NY civil fraud case.",
                "Something something taco.",
                "I would like to see lawsuits directly against Musk.  Since he was not a government employee, and there were no official duties, he should be personally liable.",
                "News flash to MAGA:  Trump is not a king, he's just your fantasy of one.",
                "The story of how Elon Musk of all people worked his way into Donald Trump's inner circle is going to be an excellent Netflix series in 2035.  Truely frightening times we live in.",
                "What is worrying to me, is that the current ~~Administration~~ gangsters are restraining [the freedom of many law firms](https://www.theguardian.com/us-news/2025/apr/02/trump-law-firm-executive-order) and ensuring millions of dollars of free law services flow towards the Federal government."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/29/2025 12:16:43 UTC"
}