{
    "posts": [
        {
            "category": "HOT",
            "title": "Georgia mother says she is being forced to keep brain-dead pregnant daughter alive under abortion ban law",
            "external_url": "https://www.nbcnews.com/news/us-news/family-forced-keep-brain-dead-pregnant-woman-alive-rcna207002",
            "upvotes": 4421,
            "date": "05/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250515-adriana-smith-template-mn-1045-39e074.jpg",
            "top_comments": [
                ">  \"It should have been left up to the family,” Newkirk said, telling the station that doctors informed the family they are legally not allowed to consider any other options.\n“I’m not saying that we would have chose to terminate her pregnancy, but what I’m saying is, we should have had a choice,” she said.\nA spokesperson for Emory Healthcare said it “uses consensus from clinical experts, medical literature, and legal guidance to support our providers as they make individualized treatment recommendations in compliance with Georgia’s abortion laws and all other applicable laws.”\n“Our top priorities continue to be the safety and wellbeing of the patients we serve,” the spokesperson said.\nNewkirk said the family is also having to deal with the financial responsibility of keeping Smith on life support. \n\nDisregarding the family's wishes and then dumping all the financial costs which will be astronomical on them. Truly heinous.",
                "And of course she first went to the hospital where she was basically ignored, and now they are throwing everything they can at her to keep her body as an incubator for a baby that, even if it somehow survives, will be thrown to the wolves by the state.",
                "This is a literal plot point from the TV show The Handmaid's Tale, where a brain-dead woman is kept hooked up in a hospital until they can cut the baby out of her. Nice to know that our current society is mirroring an incredibly depressing dystopian hellscape of a show.",
                "Not only has she been brain dead and on life support to maintain her body as an incubator for more than 90 days, she was only nine weeks pregnant so she has another couple of months to go.\n\nMeanwhile, her toddler son doesn’t actually know she’s (brain) dead because he sees his mommy looking asleep so he hasn’t gotten a chance to grieve yet. Her family hasn’t gotten a chance to grieve. Her mother is going to live with this trauma for the rest of her life. \n\nAnd they’re going to get the bill for all of this when they’re finally allowed to let her pass.\n\nThe cruelty is the point, but it’s amazing how often they keep coming up with new ways of being even crueler.",
                "That photo is this woman pregnant with her FIRST child. \n\nShe was only 8/9 weeks pregnant when she became braindead. That wasn't a viable fetus. They're keeping her body on machines for months and months for the slight chance this baby doesn't die immediately after artificial birth.",
                "This is some genuine Handmaids Tale shit.",
                "Ghoulish behavior by the state. On top of the lack of control over her own daughter's end of life and the general indignity of the situation, the mother has to deal with the costs of keeping her on life support.",
                "How is the death of the mother considered an abortion? Removal of life support is about the mother/designated representative’s wishes. Are we going to make sure to run a pregnancy test on every woman before announcing time of death in cases where brain activity is gone just to be sure there isn’t a “collateral abortion” happening?",
                "Skipping Handmaid's Tale straight to the Axlotl Tanks. Damn, we may get a God Emperor soon.",
                "Okay, then the state of Georgia should foot the bill for every bit of the medical costs."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "RFK Jr orders mifepristone review as anti-abortion groups push for ban",
            "external_url": "https://www.theguardian.com/us-news/2025/may/14/rfk-jr-fda-abortion-pill-mifepristone",
            "upvotes": 9373,
            "date": "05/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/67a815aac24a9d2dd041bbfd8fd6798a959d51d4/500_0_5000_4000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a1a221076062851cf9016b33ab6cb595",
            "top_comments": [
                "Didn't this man just say nobody should take health advice from him yesterday? This country has fully turned into a farce.",
                "We need to spread a rumor that mifepristone treats measles. He will defend it with gusto.",
                "Ladies and people who care about ladies: if you can acquire this, do so. The day is coming when it will be more difficult than just about anything to get, if not impossible. Miscarriages are incredibly dangerous if all of the tissue is not expelled, and many hospitals refuse to offer any kind of aid due to the new laws across much of the South until a woman is nearly dead.\n\n  \nAnd even then, if your baby is viable and you are not, they'll just keep you on machines until you deliver. Adriana Smith is suffering this fate in Georgia as we speak after a hospital refused care for a brain bleed when she was 9 weeks. She is now 21 weeks, and is being kept alive against her family's wishes due to the heartbeat law.",
                "The party of forced birth and indifference toward living children strikes again.",
                "“LeAvE iT tO tHe StAtEs”",
                "Weird that anyone doesn't believe that they are really just trying to legislate that women are basically children that need men to make their decisions, so if you think about it that's why it is OK for them to marry children.\n\nLiterally, that is a pretty clear overlap on the venn diagram of legislating agenda they have been on target for.\n\n  \n\\----\n\nA quick edit so I don't come accross as hyperbolic or simply lobbing petty insults:  \n\nI realized I should probably [bring reciepts](https://www.rollingstone.com/politics/politics-features/republican-lawmakers-child-marriage-abortion-1235018777/). \n\nThere are a [*lot*](https://www.nbcnews.com/politics/politics-news/end-child-marriage-u-s-you-might-be-surprised-who-n1050471) of reciepts. \n\nThey've tried \"[defending child marriage is actually pretty pro-choice of me](https://www.newsweek.com/republican-defends-child-marriage-im-pro-choice-1898619)\" and \"[if you ban child marriage, you're letting the gays win](https://www.tba.org/?pg=Articles&blAction=showEntry&blogEntry=30366)\"  along the way . . . landing on their most successful attack yet . . .  \n\n\"[a woman is like a child](https://www.yahoo.com/news/woman-child-maga-quickly-turns-105907677.html)\" . . . and if woman == child, then it stands to reason that child == women . . . \n\nObviously, you wouldn't say women shouldn't be allowed to have an adult sexual relationship within the confines of a legally binding marriage contract that they can leave anytime they want to have enough money and a good lawyer. Which is also why child labor is so important, so that they could obviously have left the marriage if they didn't want to be there.\n\nIt also makes sense of other agenda pushes that would otherwise feel pointless and unrelated, like the absolute insane amounts of hate against women they've pushed on the youth in recent years.",
                "Review has already been done. It does exactly what it says it does and is perfectly safe",
                "The US health secretary, Robert F Kennedy Jr, said on Wednesday that he had directed the FDA to review the regulations around the abortion pill mifepristone.\n\nThe review, he said, was necessary due to “new data” – data that emerged from a flawed analysis that top US anti-abortion groups are now using to pressure the Trump administration to reimpose restrictions on the abortion pill, if not pull it from the market entirely.\n\n...**The analysis, which has not been peer-reviewed or published in a medical journal**, came after the Food and Drug Administration commissioner said he was open to reviewing new safety data on the pills, which are used in nearly two-thirds of abortions nationwide.\n\nThe conservative organizations are rallying behind a paper published on 28 April by a rightwing thinktank, the Ethics and Public Policy Center, which claims there are higher complication rates from taking mifepristone than previously known.\n\nThe paper has attracted scrutiny for appearing to dramatically overstate what it characterizes as “serious adverse effects” associated with the pill, according to medical experts. For example, it counts ectopic pregnancies – when an embryo implants somewhere other than the uterine lining – as a serious complication.\n\nMifepristone does not cause an ectopic pregnancy and taking it will not harm someone with an ectopic. It also claims that needing an in-clinic procedure to complete the abortion is a complication, when patients are counseled in advance about the pills’ failure rate of about 3 to 4%.\n\n**The data, the authors say, means the FDA should reinstate earlier restrictions on mifepristone, including a ban on telemedicine and limiting use to the first seven weeks of pregnancy – but they do not intend to stop there.**\n\nThe authors note that restoring the limits could lead to better monitoring that could help “determine whether this drug should remain on the market”, statements that echo proposals found in Project 2025, the 900-page playbook published by the Heritage Foundation and for which the EPPC was an advisory board member.\n\n**Project 2025 calls to end telemedicine prescriptions of abortion pills as an “interim step” to revoking mifepristone’s approval altogether.**\n\nMore than 100 scientific studies have found the medications cited in the paper are safe and effective for ending a pregnancy.",
                "For my miscarriage- I took mifepristone so that I would be in pain for a weekend instead of an indefinite time over the course of 4 weeks.  There was no fetal development.  But if my body couldn’t pass the tissue on its own, then I could have been in excruciating pain for a month or more and on the line to lose my job, or worse possibly developed sepsis.\n\n1 in 4 known pregnancies end in miscarriage.  It’s even higher for first time pregnancy.  This is not an outlier situation.  You know people who have had miscarriages and gotten treatment for it.  All this medication ban would do is make women suffer. \n\nThese people are extreme lunatics.   Death cult material who think women are property and status symbols, not people.",
                "Someone called it - first it’s the fluoride for kids that need it and next it would be abortion pills. This admin is hellbent on destroying the land of the free. Only freedom if you’re rich. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Walmart warns of higher prices, withholds second-quarter profit guidance",
            "external_url": "https://www.reuters.com/business/retail-consumer/walmart-warns-higher-prices-withholds-second-quarter-profit-guidance-2025-05-15/",
            "upvotes": 7687,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Article does not mention how they will address the empty shelves.  Wonder if they talked about this during their earnings call. ",
                "in a couple of years time there will be a lot less money to go around, and the billionaires will be on the race to being the first trillionaire.",
                "I wonder what on Earth might be causing those higher prices?  ;-)",
                "How many people on r/stocks are telling you tariffs are “priced in” and Walmart can’t even provide guidance for next quarter?",
                "This isn’t good coming from Wally’s World.  More bad to come this summer.",
                "They aren’t “withholding” profit guidance. Attempting to forecast it accurately in this environment is a step away from lying. It is literally the only responsible thing to do because they have no idea what their supply, revenue, profit, etc will be because policy changes literally by the minute.",
                "Not just walmart, everyone should get used to buying less stuff. Hard times are coming.\n\nwww.BoycottOligarchs.com",
                "I just got a notice on my Amazon cart/wishlist yesterday that 15 items I had went up in price, and not by cents. Seen some stuff go up from 30-60%",
                "I’m glad at least Walmart isn’t afraid to state this publicly unlike so many others who fear repercussions from this “regime”.",
                "80% of all Wal-Mart goods come from China…."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Penn State blames looming campus closures on ‘declining’ Pennsylvania",
            "external_url": "https://www.pennlive.com/education/2025/05/penn-state-blames-looming-campus-closures-on-declining-pennsylvania.html",
            "upvotes": 4704,
            "date": "05/15/2025",
            "thumbnail": "https://www.pennlive.com/resizer/v2/SVFYZVYLHBHFFHBSMBUKIE2VCU.jpeg?auth=1f592a318cc78efd45dd0748ac1753d315988f84eb6d57aa3de008a877cff527&width=1280&quality=90",
            "top_comments": [
                "Grew up and went to one of those satellite campuses. It was a great school and opportunity for the rural area I lived in. I’m grateful to have had it.\n\nThey’re right though about the demographics. I left PA because there was so little there as an adult. It never fully recovered (in my area) after coal dried up and then 08 hit. My county was old even when I was young. \n\nIt’ll always be home, but I didn’t have it in me to stay.",
                "Have they tried increasing Pennsylvania?",
                "Almost no one here read the article or understands what it really means. Penn State is closing branch campuses, which cater almost entirely to local populations. No one from out of state dreams of going to Penn State Shenango on the border of Ohio, which is over an hour from any major population center. No one is moving to Sharon PA either. The population peaked in the 50's and is half of what it was then. It is #197 of cities by population in PA. Sure Penn States tuition is bonkers, blah blah. But declining rural populations and branch campuses in nowheresville are the reason for this.",
                "..and 20 years later, almost all the children had been left behind.",
                "Meanwhile at Penn State‘s main campus, they are aiming to increase enrollment by thousands of students, but the local borough passed a zoning ordinance effectively banning most off-campus apartments from the core of downtown.\n\nTo nobody’s surprise, housing is becoming crushingly unaffordable there. I’m sure the landlords on the Planning Commission are more than happy about that!\n\nWe’re going to see much more of this “feast or famine” in higher education over the next couple decades, and it’s going to get ugly.",
                "I read the article and frankly I suggest many others to as well as it feels like the posts in here are either bad jokes are personal quips....while the article is providing quotes such as: \n\n> The Keystone State is among five states expected to account for three-fourths of the national decline in high school graduates, with a 17% reduction projected through 2043, the report says.\n\nand \n\n> The report cites lower birth rates following the 2008 recession and reduced K-12 enrollment trends, exacerbated by the COVID-19 pandemic’s “lingering effects on earlier grade retention” for what it calls Pennsylvania’s looming “demographic cliff.”\n\nand \n\n> “Pennsylvania is facing widespread population declines, with rural areas experiencing the most pronounced reductions. Forty-one of Pennsylvania’s 67 counties are facing significant population declines: rural counties are projected to lose 5.8% of their total population by 2050, while urban counties are projected to grow slightly (+4.1%),” the report states.\n\nYea, this isn't a joking matter. It's a state university who is seeing a demographic that they don't think will latent their college alongside a trend they think is going to rock PA and shrinking itself now so it doesn't embarrass itself later. I don't know the state of PA so I don't know how this affects those closing campuses but I do feel that it's better to close than to occupy at limited capacity just to state that you're still open. I bet this also means that unless something magical happens tuition will also unfortunately increase as more students will funnel into their other campuses which will potentially stress resources \n\nAwful all around but better to do now than later",
                "Why doesn’t Pennsylvania simply eat the other states?",
                "Many public universities just shoot themselves on the foot by building elaborate stuff that the students don't need at all for their education and having ever increasing \"administrative costs\". This leads to tuition hikes and then they wonder why less people want to go to college.",
                "The children yearn for the mines.",
                "I’m fucking begging every state to increase taxes on large corporations"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Denver air traffic control went dark for 90 seconds, FAA confirms",
            "external_url": "https://www.denverpost.com/2025/05/15/denver-international-airport-air-traffic-control-outage-longmont/",
            "upvotes": 1519,
            "date": "05/15/2025",
            "thumbnail": "https://www.denverpost.com/wp-content/uploads/2019/01/ai-traffic.jpg?w=300&h=206",
            "top_comments": [
                "I thought it was newark that went dark, am i misremembering or is this a separate incident",
                "We are extremely lucky nothing critical happened during those 90 seconds.",
                "This is becoming something of a frightening, reoccurring, and self-inflicted problem.",
                "They wanted to break the federal government and everything that keeps Americans safe. It’s working.",
                "Johnny holds the end of a long extension cord in his hand. \"Just Kidding!\"",
                "Republicans want nothing more than to dismantle the federal government but they have no appetite to accept responsibility for the shit show that will follow.",
                "This incident, and Newark and the ground stoppage at ATL due to \"equipment failure\" this week... \n\nOur infrastructure is falling apart.",
                "I don’t understand why Pete Buttigieg keeps doing this! /s",
                "Man where’s that guy who told me it was just newarks outdated system? Wish he didn’t delete his account",
                "I wonder how many unplanned, possible mass-casualty incidents involving systemic atc failure at major airports have happened in the history of aviation when Donald ‘Incompetent Puppet’ Trump was NOT President; in the history of aviation? \n\n\nHmmm.  Northeast Radar failure; ‘91, I remember that.   \n\nChicago Center fire in 04; didn’t know about that one.  \n\n\nAnd… three in the last six months.  I’m going to change the oil in my car this weekend, in case I have to travel."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "‘We tried to save those kids’: Texas doctor watched children die of measles. Now it’s back in Texas",
            "external_url": "https://www.keranews.org/texas-news/2025-05-14/measles-texas-outbreak-vaccine",
            "upvotes": 1243,
            "date": "05/15/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/0d9864c/2147483647/strip/true/crop/1283x674+0+147/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6d%2F61%2Fafaa2a3747e5b494dc6a61f179f8%2Fcdc-crop-edit-measles-7.png",
            "top_comments": [
                "Meanwhile, [poison centers are seeing an increase of vitamin A toxicity in children during this measles outbreak.](https://poisoncenters.org/news-alerts/13484508) RFK Jr was right when he said no one should be taking his medical advice. His advice will hurt and even kill children. Get your kids vaccinated people.",
                "And yet, we're going to see Texas somehow blame Biden for all of this.",
                "Hey, can someone get Bobby out of literal Shits Creek and tell him to do his job.",
                "It’s cool, cvs has a new shipment of vitamin a in. ",
                "Worm head isn't going to fix it and far too many people think vaccines cause autism because they believe what stupid people say.",
                "They get what they voted for. Hopefully some day the parents are held accountable, but with our current government I don't think it will be any time soon.",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US Supreme Court scrutinizes Trump bid to restrict birthright citizenship",
            "external_url": "https://www.reuters.com/world/us/us-supreme-court-hear-trump-bid-restrict-birthright-citizenship-2025-05-15/",
            "upvotes": 1882,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So if we want to be very clear, the SCOTUS are not debating the birthright citizenship issue outright. They are debating/ruling on whether the lower courts had the authority to put an injunction on Trump's end to birthright citizenship. Obviously this will have an immediate direct effect on birthright citizenship if the courts overturn it, but then the executive order itself would have to be brought before the SCOTUS.",
                "This case is not really about the merits of the administration’s interpretation of the 14th amendment and birthright citizenship.\n\nRather, the questions are focused more on whether courts has the authority to enjoin executive action, nationwide, through something called a “universal injunction.”\n\nSurprisingly, several of the conservatives justices seemed skeptical of the administration’s position on these universal injunctions, as they pressed the solicitor general to explain how affected individuals would even have an effective remedy for constitutional-rights violations if a court has no authority to impose a universal injunction on facially unconstitutional executive action.  ",
                "As it’s been the law of the land up to now, I’m hoping the Court will fall back on the historical application of the law and not restrict it now.  Crossing fingers!",
                "More insidious than that.\n\nThe trump admin is trying to get the SC to rule that lower courts cannot grant injunction relief except in their own court and affecting only those specific plaintiffs.    This would slow down and increase the cost of taking the government to court for unlawful actions.   They want the court to change due process on injunctive relief.  And by change, I mean , take away.",
                "When you stop adhering to some of the Constitution its not long before none of is adhered to at all.",
                "So when trump says that birthright citizenship was intended for slaves, can we counter that and ask about removing the 2nd amendment because that was intended for muskets???",
                "Service Guarantees Citizenship! Would you like to know more?",
                "Up until this ruling I believed I was a US citizen by virtue of being born here and having a birth certificate to attest that fact.  Now I have no clear way of determining whether in fact I am a citizen, what rules apply?  How are those rules changed and how does it affect whose citizenship?  It’s all crazy.",
                "If you really want to be picky then everyone except native Americans should leave the land in this case.",
                "It's an international crime to make someone stateless. We'll put that on your tab, you orange prick. I can't wait for the world to impose sanctions against the US and switch from the dollar to the euro as an international reserve currency."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Dick's Sporting to buy Foot Locker for $2.4 billion to fight soft demand",
            "external_url": "https://www.reuters.com/markets/deals/dicks-sporting-goods-acquire-foot-locker-24-billion-2025-05-15/",
            "upvotes": 1254,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Will rename all stores to Foot Long Dick's to harden demand.",
                "I could totally see Dick’s using the Footlocker branding for their shoe section of the store. ",
                "Demand is falling stores, let's pay a premium to add more stores that are also struggling.\n\n🤦",
                "Everything is dicks and feet these days.",
                "And there goes the last bit of Woolworths that still existed.",
                "Fun Fact: Foot Locker is what’s left of Woolworths which was founded in 1879 as a 5¢ Store, the equivalent of today’s dollar stores. They were one of the first stores to put merchandise out where customers could handle it without a clerk’s assistance.",
                "How does Dick's have all this money? Who is shopping at Dick's Sporting Goods?",
                "I didn't realize footlocker still existed",
                "Finally, soft disk's demand, my time to shine.",
                "“Tariffs may be forcing (the companies') hand to some extent, but this is also a strategic moment to acquire additional scale and strengthen buying power in the footwear market”\n\nSo basically reducing competition to get better prices?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Wisconsin judge pleads not guilty on charges of concealing undocumented immigrant",
            "external_url": "https://www.axios.com/2025/05/15/hannah-dugan-arraignment-judge-undocumented-immigrant",
            "upvotes": 1130,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The story out of Nashville has managers of republican-owned restaurants specifically telling their undocumented staff to leave before an ICE raid.   \n\nSeems like those restaurant owners and managers would be a better target for arrest than this judge.    I wonder how ICE decides when to apply the law... hmmm...",
                "Trump should be the one in prison …he is a convicted felon",
                "It's sad to see people believe wholeheartedly that an indictment is enough justification to demand a removal of a judge, yet many of those same people believe 34 felony convictions doesn't disqualify a candidate from being President.",
                "Always plead innocence. Otherwise the judge just throws the book at you. Remorse usually does not get you far in court, it usually gets you the maximum sentence.  \n\nHaving said that, what this judge did, legal or not, was the right thing to do.  Laws are not always right or fair, but they should be.",
                "I'm betting in a couple decades, when historians look back on things like this, it will be viewed similarly to the underground railroad that helped escaped slaves, or the people who helped shelter Jews in Nazi Germany.",
                "An Official Acts Immunity claim referencing trumps own SCOTUS ruling is chefs kiss",
                "On the basis that she was somehow doing it in an official capacity?",
                "She is a heroin! Our democracy is at steak!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Singer Chris Brown arrested in UK over alleged 2023 assault",
            "external_url": "https://www.reuters.com/world/singer-chris-brown-arrested-uk-over-alleged-2023-assault-2025-05-15/",
            "upvotes": 558,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And the hits just keep on coming",
                "Good. IDC if we have to outsource justice, I just like seeing it doled out.",
                "What a gigantic piece of shit. ",
                "Need to go dig up the age old Andy Levy clip ripping him over the whole Rhianna thing.",
                "I had forgotten that piece of shit still exists.",
                "Kind of uncertain how he was allowed in the UK with his previous record?!?!",
                "Please UK. Please keep him there.",
                "The news part is he's actually getting in trouble for it",
                "His past actions coming back to make this watched up clown relative again in such a justified way.",
                "I remember back when Chris Brown did that Larry King interview (with his mommy by his side) months after beating the holy hell out of Rhianna, pleading for forgiveness to the world. \n\nNow here we are 15 years later and the **'Millennial Ike Turner'** Chris Brown is at it again."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Denver air traffic control went dark for 90 seconds, FAA confirms",
            "external_url": "https://www.denverpost.com/2025/05/15/denver-international-airport-air-traffic-control-outage-longmont/",
            "upvotes": 1520,
            "date": "05/15/2025",
            "thumbnail": "https://www.denverpost.com/wp-content/uploads/2019/01/ai-traffic.jpg?w=300&h=206",
            "top_comments": [
                "I thought it was newark that went dark, am i misremembering or is this a separate incident",
                "We are extremely lucky nothing critical happened during those 90 seconds.",
                "This is becoming something of a frightening, reoccurring, and self-inflicted problem.",
                "They wanted to break the federal government and everything that keeps Americans safe. It’s working.",
                "Johnny holds the end of a long extension cord in his hand. \"Just Kidding!\"",
                "Republicans want nothing more than to dismantle the federal government but they have no appetite to accept responsibility for the shit show that will follow.",
                "This incident, and Newark and the ground stoppage at ATL due to \"equipment failure\" this week... \n\nOur infrastructure is falling apart.",
                "I don’t understand why Pete Buttigieg keeps doing this! /s",
                "Man where’s that guy who told me it was just newarks outdated system? Wish he didn’t delete his account",
                "I wonder how many unplanned, possible mass-casualty incidents involving systemic atc failure at major airports have happened in the history of aviation when Donald ‘Incompetent Puppet’ Trump was NOT President; in the history of aviation? \n\n\nHmmm.  Northeast Radar failure; ‘91, I remember that.   \n\nChicago Center fire in 04; didn’t know about that one.  \n\n\nAnd… three in the last six months.  I’m going to change the oil in my car this weekend, in case I have to travel."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Chris Brown arrested in UK over alleged attack in 2023",
            "external_url": "https://www.bbc.com/news/articles/c15nzv18ddvo",
            "upvotes": 124,
            "date": "05/15/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e14a/live/19e08660-318d-11f0-96c3-cf669419a2b0.jpg",
            "top_comments": [
                "I remember back when Chris Brown did that Larry King interview (with his mommy by his side) months after beating the holy hell out of Rhianna.  Crying and trying to save his reputation for an hour on CNN, it was pathetic. \n\nNow here we are 15 years later and the **'Millennial Ike Turner**' Chris Brown is at it again.",
                "Chris Brown who beats women? That Chris Brown?",
                "Just last night he was saying Free Torey Lanez. \n\n\nSome delicious karma here.",
                "I dont believe it. He seems like such a nice guy. ",
                "This is going to ruin the tour.",
                "Can this guy go a week without assaulting somebody?",
                "As much as I'd rather *not* be on the same island as this idiot, I'm pleased he's being treated like the criminal he is.",
                "Oh noooooooo. You’re telling me notoriously violent Chris Brown got arrested for being violent??? Nooooooooo"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Victorville foster children kept journals of strangulation, other abuse, DA says",
            "external_url": "https://www.sbsun.com/2025/05/14/victorville-foster-children-kept-journals-of-strangulation-other-abuse-da-says/",
            "upvotes": 128,
            "date": "05/15/2025",
            "thumbnail": "https://www.sbsun.com/wp-content/uploads/2025/05/SBS-L-FOSTER-FOLO-0515-01.jpg?w=1024&h=679",
            "top_comments": [
                "*“There is some indication that when there were visits by social workers, the kids were told to go on script,” Anderson said.*\n\nA \"family\" foster home can be as oppressive as a private or public foster home.  All three make use of fear in employing more and more control over their children."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Georgia mother says she is being forced to keep brain-dead pregnant daughter alive under abortion ban law",
            "external_url": "https://www.nbcnews.com/news/us-news/family-forced-keep-brain-dead-pregnant-woman-alive-rcna207002",
            "upvotes": 4448,
            "date": "05/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250515-adriana-smith-template-mn-1045-39e074.jpg",
            "top_comments": [
                ">  \"It should have been left up to the family,” Newkirk said, telling the station that doctors informed the family they are legally not allowed to consider any other options.\n“I’m not saying that we would have chose to terminate her pregnancy, but what I’m saying is, we should have had a choice,” she said.\nA spokesperson for Emory Healthcare said it “uses consensus from clinical experts, medical literature, and legal guidance to support our providers as they make individualized treatment recommendations in compliance with Georgia’s abortion laws and all other applicable laws.”\n“Our top priorities continue to be the safety and wellbeing of the patients we serve,” the spokesperson said.\nNewkirk said the family is also having to deal with the financial responsibility of keeping Smith on life support. \n\nDisregarding the family's wishes and then dumping all the financial costs which will be astronomical on them. Truly heinous.",
                "And of course she first went to the hospital where she was basically ignored, and now they are throwing everything they can at her to keep her body as an incubator for a baby that, even if it somehow survives, will be thrown to the wolves by the state.",
                "This is a literal plot point from the TV show The Handmaid's Tale, where a brain-dead woman is kept hooked up in a hospital until they can cut the baby out of her. Nice to know that our current society is mirroring an incredibly depressing dystopian hellscape of a show.",
                "Not only has she been brain dead and on life support to maintain her body as an incubator for more than 90 days, she was only nine weeks pregnant so she has another couple of months to go.\n\nMeanwhile, her toddler son doesn’t actually know she’s (brain) dead because he sees his mommy looking asleep so he hasn’t gotten a chance to grieve yet. Her family hasn’t gotten a chance to grieve. Her mother is going to live with this trauma for the rest of her life. \n\nAnd they’re going to get the bill for all of this when they’re finally allowed to let her pass.\n\nThe cruelty is the point, but it’s amazing how often they keep coming up with new ways of being even crueler.",
                "That photo is this woman pregnant with her FIRST child. \n\nShe was only 8/9 weeks pregnant when she became braindead. That wasn't a viable fetus. They're keeping her body on machines for months and months for the slight chance this baby doesn't die immediately after artificial birth.",
                "This is some genuine Handmaids Tale shit.",
                "Ghoulish behavior by the state. On top of the lack of control over her own daughter's end of life and the general indignity of the situation, the mother has to deal with the costs of keeping her on life support.",
                "How is the death of the mother considered an abortion? Removal of life support is about the mother/designated representative’s wishes. Are we going to make sure to run a pregnancy test on every woman before announcing time of death in cases where brain activity is gone just to be sure there isn’t a “collateral abortion” happening?",
                "Skipping Handmaid's Tale straight to the Axlotl Tanks. Damn, we may get a God Emperor soon.",
                "Okay, then the state of Georgia should foot the bill for every bit of the medical costs."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Autopsies misclassified in-custody deaths that were actually homicides, Maryland officials say",
            "external_url": "https://apnews.com/article/david-fowler-maryland-autopsy-homicides-george-floyd-71e52a4cd2cc4103eab9648a127f1835",
            "upvotes": 213,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Medical examiners under Dr. David Fowler were “especially unlikely to classify a death as a homicide if the decedent was Black, or if they died after being restrained by police,” Attorney General Anthony Brown said Thursday during a news conference.\n\nI recall during the BLM protests people telling me to my fucking face \"All lives matters, not just black people!\"\n\nThe problem is we keep proving - in America, no they don't.  When a cop can kill you and \"Well, they were black - it doesn't matter, you won't have the consequences\" - it proves **once again** that black lives do **not** matter, and will not matter until we force the people who keep abusing them to own up to it and suffer the consequences for it.",
                "Imagine all the atrocities done before body cameras (and other cameras such as CCTV and smartphones)"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Outage leaves up to 20 pilots headed to Denver airport unable to contact air traffic control on Monday",
            "external_url": "https://www.denver7.com/news/investigations/outage-leaves-up-to-20-pilots-headed-to-denver-airport-unable-to-contact-air-traffic-control-on-monday",
            "upvotes": 245,
            "date": "05/15/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/f4e9616/2147483647/strip/true/crop/800x420+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F5c%2F83%2Fe3b74fef4750a0f720783d4d55b8%2Fatc-web-1-copy.jpg",
            "top_comments": [
                "Just to clarify this was the regional high altitude Air Traffic Control, not Denver International Airport's Approach Control. The former controls aircraft at cruising altitude; they are handed off to Approach Control approximately 50 miles out from the airport. Approach is responsible for vectoring and separation beyond that point.",
                "And cue the \"It's the Biden administration's fault - they should have asked harder for the money to fix things!\n\n\"Also - no we aren't going to fix things, just get a private jet like rich people do!\"",
                "You wonder how many airports air traffic control have kept up equipment update and maintenance.\n\nMy guess is woefully low and throw in shortage of air traffic controllers it is a receipt for disaster in waiting.",
                "Supposed to fly into Denver tomorrow. Very reassuring!",
                "6 minutes of WTF, terror\n\n> Multiple inside sources told Denver7 Investigates' Chief Investigator Tony Kovaleski that the outage occurred around 2 p.m., leaving between 15 and 20 aircraft unable to communicate with air traffic control during a critical time. A controller eventually was able to contact one pilot on what’s called a guard line — which is typically used when a pilot is in distress — and that pilot was able to contact the other aircraft to tell them to change frequencies."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Singer Chris Brown arrested in UK over alleged 2023 assault",
            "external_url": "https://www.reuters.com/world/singer-chris-brown-arrested-uk-over-alleged-2023-assault-2025-05-15/",
            "upvotes": 556,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And the hits just keep on coming",
                "Good. IDC if we have to outsource justice, I just like seeing it doled out.",
                "What a gigantic piece of shit. ",
                "Need to go dig up the age old Andy Levy clip ripping him over the whole Rhianna thing.",
                "I had forgotten that piece of shit still exists.",
                "Kind of uncertain how he was allowed in the UK with his previous record?!?!",
                "Please UK. Please keep him there.",
                "The news part is he's actually getting in trouble for it",
                "His past actions coming back to make this watched up clown relative again in such a justified way.",
                "I remember back when Chris Brown did that Larry King interview (with his mommy by his side) months after beating the holy hell out of Rhianna, pleading for forgiveness to the world. \n\nNow here we are 15 years later and the **'Millennial Ike Turner'** Chris Brown is at it again."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "‘We tried to save those kids’: Texas doctor watched children die of measles. Now it’s back in Texas",
            "external_url": "https://www.keranews.org/texas-news/2025-05-14/measles-texas-outbreak-vaccine",
            "upvotes": 1252,
            "date": "05/15/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/0d9864c/2147483647/strip/true/crop/1283x674+0+147/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6d%2F61%2Fafaa2a3747e5b494dc6a61f179f8%2Fcdc-crop-edit-measles-7.png",
            "top_comments": [
                "Meanwhile, [poison centers are seeing an increase of vitamin A toxicity in children during this measles outbreak.](https://poisoncenters.org/news-alerts/13484508) RFK Jr was right when he said no one should be taking his medical advice. His advice will hurt and even kill children. Get your kids vaccinated people.",
                "And yet, we're going to see Texas somehow blame Biden for all of this.",
                "Hey, can someone get Bobby out of literal Shits Creek and tell him to do his job.",
                "It’s cool, cvs has a new shipment of vitamin a in. ",
                "Worm head isn't going to fix it and far too many people think vaccines cause autism because they believe what stupid people say.",
                "They get what they voted for. Hopefully some day the parents are held accountable, but with our current government I don't think it will be any time soon.",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Coinbase said cyber crooks stole customer information and demanded $20 million ransom payment",
            "external_url": "https://apnews.com/article/coinbase-hack-crypto-exchange-ransom-e3ef5297dfea296eb7b7320d8c58647e",
            "upvotes": 150,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Coinbase, the largest [cryptocurrency exchange](https://apnews.com/article/coinbase-sec-cryptocurrency-trump-f6f7b6b0e546c854c18cf322658699b1) based in the U.S., said Thursday that criminals had improperly obtained personal data on the exchange’s customers for use in crypto-stealing scams and were demanding a $20 million payment not to publicly release the info.\n\nLook at what these awful criminal did! Aren't they just so awful and terrible. My gosh, what is happening in the world? What are we, Coinbase, to do in the face of such intense unscrupulousness??\n\n>..criminals had bribed some of the company’s customer service agents..\n\nWait hold up. Seems like Coinbase sucks?\n\n>Armstrong said the company was refusing to pay the ransom and would instead offer a $20 million bounty for anyone who provided information that led to the attackers’ arrest.\n\n.... OR... ? Well ok then. That was a wild ride.",
                "This aligns with a few weeks ago me starting to receive daily multiple password reset text messages for coinbase but clearly from scammers. Wish there was recourse against the company when they require this very sensitive information for KYC.",
                "That explains the text messages I've been getting.\n\nI used Coinbase once, years ago, and all of a sudden I've been getting text messages for password resets and the like. I've just been ignoring them, figuring that it was a shot-in-the-dark scam, but maybe I should log in and delete my account?",
                "Yup\n\n* Just days after joining the S&P 500, the U.S. crypto exchange revealed a cyberattack\n* Hackers stole customer data and demanded a $20 million ransom\n* Coinbase refused to pay\n* Instead it's offering a bounty for tips and plans to reimburse users, costing up to $400 million\n* Stock is down nearly 7% today\n\nI read it on this [newsletter](https://dailystockspotlight.com/subscribe?utm_source=reddit&utm_medium=comment). It talks about stock movers every day"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Dick's Sporting to buy Foot Locker for $2.4 billion to fight soft demand",
            "external_url": "https://www.reuters.com/markets/deals/dicks-sporting-goods-acquire-foot-locker-24-billion-2025-05-15/",
            "upvotes": 1252,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Will rename all stores to Foot Long Dick's to harden demand.",
                "I could totally see Dick’s using the Footlocker branding for their shoe section of the store. ",
                "Demand is falling stores, let's pay a premium to add more stores that are also struggling.\n\n🤦",
                "Everything is dicks and feet these days.",
                "And there goes the last bit of Woolworths that still existed.",
                "Fun Fact: Foot Locker is what’s left of Woolworths which was founded in 1879 as a 5¢ Store, the equivalent of today’s dollar stores. They were one of the first stores to put merchandise out where customers could handle it without a clerk’s assistance.",
                "How does Dick's have all this money? Who is shopping at Dick's Sporting Goods?",
                "I didn't realize footlocker still existed",
                "Finally, soft disk's demand, my time to shine.",
                "“Tariffs may be forcing (the companies') hand to some extent, but this is also a strategic moment to acquire additional scale and strengthen buying power in the footwear market”\n\nSo basically reducing competition to get better prices?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "‘We tried to save those kids’: Texas doctor watched children die of measles. Now it’s back in Texas",
            "external_url": "https://www.keranews.org/texas-news/2025-05-14/measles-texas-outbreak-vaccine",
            "upvotes": 1246,
            "date": "05/15/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/0d9864c/2147483647/strip/true/crop/1283x674+0+147/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6d%2F61%2Fafaa2a3747e5b494dc6a61f179f8%2Fcdc-crop-edit-measles-7.png",
            "top_comments": [
                "Meanwhile, [poison centers are seeing an increase of vitamin A toxicity in children during this measles outbreak.](https://poisoncenters.org/news-alerts/13484508) RFK Jr was right when he said no one should be taking his medical advice. His advice will hurt and even kill children. Get your kids vaccinated people.",
                "And yet, we're going to see Texas somehow blame Biden for all of this.",
                "Hey, can someone get Bobby out of literal Shits Creek and tell him to do his job.",
                "It’s cool, cvs has a new shipment of vitamin a in. ",
                "Worm head isn't going to fix it and far too many people think vaccines cause autism because they believe what stupid people say.",
                "They get what they voted for. Hopefully some day the parents are held accountable, but with our current government I don't think it will be any time soon.",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Denver air traffic control went dark for 90 seconds, FAA confirms",
            "external_url": "https://www.denverpost.com/2025/05/15/denver-international-airport-air-traffic-control-outage-longmont/",
            "upvotes": 1521,
            "date": "05/15/2025",
            "thumbnail": "https://www.denverpost.com/wp-content/uploads/2019/01/ai-traffic.jpg?w=300&h=206",
            "top_comments": [
                "I thought it was newark that went dark, am i misremembering or is this a separate incident",
                "We are extremely lucky nothing critical happened during those 90 seconds.",
                "This is becoming something of a frightening, reoccurring, and self-inflicted problem.",
                "They wanted to break the federal government and everything that keeps Americans safe. It’s working.",
                "Johnny holds the end of a long extension cord in his hand. \"Just Kidding!\"",
                "Republicans want nothing more than to dismantle the federal government but they have no appetite to accept responsibility for the shit show that will follow.",
                "This incident, and Newark and the ground stoppage at ATL due to \"equipment failure\" this week... \n\nOur infrastructure is falling apart.",
                "I don’t understand why Pete Buttigieg keeps doing this! /s",
                "Man where’s that guy who told me it was just newarks outdated system? Wish he didn’t delete his account",
                "I wonder how many unplanned, possible mass-casualty incidents involving systemic atc failure at major airports have happened in the history of aviation when Donald ‘Incompetent Puppet’ Trump was NOT President; in the history of aviation? \n\n\nHmmm.  Northeast Radar failure; ‘91, I remember that.   \n\nChicago Center fire in 04; didn’t know about that one.  \n\n\nAnd… three in the last six months.  I’m going to change the oil in my car this weekend, in case I have to travel."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Georgia mother says she is being forced to keep brain-dead pregnant daughter alive under abortion ban law",
            "external_url": "https://www.nbcnews.com/news/us-news/family-forced-keep-brain-dead-pregnant-woman-alive-rcna207002",
            "upvotes": 4447,
            "date": "05/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250515-adriana-smith-template-mn-1045-39e074.jpg",
            "top_comments": [
                ">  \"It should have been left up to the family,” Newkirk said, telling the station that doctors informed the family they are legally not allowed to consider any other options.\n“I’m not saying that we would have chose to terminate her pregnancy, but what I’m saying is, we should have had a choice,” she said.\nA spokesperson for Emory Healthcare said it “uses consensus from clinical experts, medical literature, and legal guidance to support our providers as they make individualized treatment recommendations in compliance with Georgia’s abortion laws and all other applicable laws.”\n“Our top priorities continue to be the safety and wellbeing of the patients we serve,” the spokesperson said.\nNewkirk said the family is also having to deal with the financial responsibility of keeping Smith on life support. \n\nDisregarding the family's wishes and then dumping all the financial costs which will be astronomical on them. Truly heinous.",
                "And of course she first went to the hospital where she was basically ignored, and now they are throwing everything they can at her to keep her body as an incubator for a baby that, even if it somehow survives, will be thrown to the wolves by the state.",
                "This is a literal plot point from the TV show The Handmaid's Tale, where a brain-dead woman is kept hooked up in a hospital until they can cut the baby out of her. Nice to know that our current society is mirroring an incredibly depressing dystopian hellscape of a show.",
                "Not only has she been brain dead and on life support to maintain her body as an incubator for more than 90 days, she was only nine weeks pregnant so she has another couple of months to go.\n\nMeanwhile, her toddler son doesn’t actually know she’s (brain) dead because he sees his mommy looking asleep so he hasn’t gotten a chance to grieve yet. Her family hasn’t gotten a chance to grieve. Her mother is going to live with this trauma for the rest of her life. \n\nAnd they’re going to get the bill for all of this when they’re finally allowed to let her pass.\n\nThe cruelty is the point, but it’s amazing how often they keep coming up with new ways of being even crueler.",
                "That photo is this woman pregnant with her FIRST child. \n\nShe was only 8/9 weeks pregnant when she became braindead. That wasn't a viable fetus. They're keeping her body on machines for months and months for the slight chance this baby doesn't die immediately after artificial birth.",
                "This is some genuine Handmaids Tale shit.",
                "Ghoulish behavior by the state. On top of the lack of control over her own daughter's end of life and the general indignity of the situation, the mother has to deal with the costs of keeping her on life support.",
                "How is the death of the mother considered an abortion? Removal of life support is about the mother/designated representative’s wishes. Are we going to make sure to run a pregnancy test on every woman before announcing time of death in cases where brain activity is gone just to be sure there isn’t a “collateral abortion” happening?",
                "Skipping Handmaid's Tale straight to the Axlotl Tanks. Damn, we may get a God Emperor soon.",
                "Okay, then the state of Georgia should foot the bill for every bit of the medical costs."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Autopsies misclassified in-custody deaths that were actually homicides, Maryland officials say",
            "external_url": "https://apnews.com/article/david-fowler-maryland-autopsy-homicides-george-floyd-71e52a4cd2cc4103eab9648a127f1835",
            "upvotes": 213,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Medical examiners under Dr. David Fowler were “especially unlikely to classify a death as a homicide if the decedent was Black, or if they died after being restrained by police,” Attorney General Anthony Brown said Thursday during a news conference.\n\nI recall during the BLM protests people telling me to my fucking face \"All lives matters, not just black people!\"\n\nThe problem is we keep proving - in America, no they don't.  When a cop can kill you and \"Well, they were black - it doesn't matter, you won't have the consequences\" - it proves **once again** that black lives do **not** matter, and will not matter until we force the people who keep abusing them to own up to it and suffer the consequences for it.",
                "Imagine all the atrocities done before body cameras (and other cameras such as CCTV and smartphones)"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Singer Chris Brown arrested in UK over alleged 2023 assault",
            "external_url": "https://www.reuters.com/world/singer-chris-brown-arrested-uk-over-alleged-2023-assault-2025-05-15/",
            "upvotes": 555,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And the hits just keep on coming",
                "Good. IDC if we have to outsource justice, I just like seeing it doled out.",
                "What a gigantic piece of shit. ",
                "Need to go dig up the age old Andy Levy clip ripping him over the whole Rhianna thing.",
                "I had forgotten that piece of shit still exists.",
                "Kind of uncertain how he was allowed in the UK with his previous record?!?!",
                "Please UK. Please keep him there.",
                "The news part is he's actually getting in trouble for it",
                "His past actions coming back to make this watched up clown relative again in such a justified way.",
                "I remember back when Chris Brown did that Larry King interview (with his mommy by his side) months after beating the holy hell out of Rhianna, pleading for forgiveness to the world. \n\nNow here we are 15 years later and the **'Millennial Ike Turner'** Chris Brown is at it again."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Wisconsin judge pleads not guilty on charges of concealing undocumented immigrant",
            "external_url": "https://www.axios.com/2025/05/15/hannah-dugan-arraignment-judge-undocumented-immigrant",
            "upvotes": 1126,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The story out of Nashville has managers of republican-owned restaurants specifically telling their undocumented staff to leave before an ICE raid.   \n\nSeems like those restaurant owners and managers would be a better target for arrest than this judge.    I wonder how ICE decides when to apply the law... hmmm...",
                "Trump should be the one in prison …he is a convicted felon",
                "It's sad to see people believe wholeheartedly that an indictment is enough justification to demand a removal of a judge, yet many of those same people believe 34 felony convictions doesn't disqualify a candidate from being President.",
                "Always plead innocence. Otherwise the judge just throws the book at you. Remorse usually does not get you far in court, it usually gets you the maximum sentence.  \n\nHaving said that, what this judge did, legal or not, was the right thing to do.  Laws are not always right or fair, but they should be.",
                "I'm betting in a couple decades, when historians look back on things like this, it will be viewed similarly to the underground railroad that helped escaped slaves, or the people who helped shelter Jews in Nazi Germany.",
                "An Official Acts Immunity claim referencing trumps own SCOTUS ruling is chefs kiss",
                "On the basis that she was somehow doing it in an official capacity?",
                "She is a heroin! Our democracy is at steak!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US Supreme Court scrutinizes Trump bid to restrict birthright citizenship",
            "external_url": "https://www.reuters.com/world/us/us-supreme-court-hear-trump-bid-restrict-birthright-citizenship-2025-05-15/",
            "upvotes": 1881,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So if we want to be very clear, the SCOTUS are not debating the birthright citizenship issue outright. They are debating/ruling on whether the lower courts had the authority to put an injunction on Trump's end to birthright citizenship. Obviously this will have an immediate direct effect on birthright citizenship if the courts overturn it, but then the executive order itself would have to be brought before the SCOTUS.",
                "This case is not really about the merits of the administration’s interpretation of the 14th amendment and birthright citizenship.\n\nRather, the questions are focused more on whether courts has the authority to enjoin executive action, nationwide, through something called a “universal injunction.”\n\nSurprisingly, several of the conservatives justices seemed skeptical of the administration’s position on these universal injunctions, as they pressed the solicitor general to explain how affected individuals would even have an effective remedy for constitutional-rights violations if a court has no authority to impose a universal injunction on facially unconstitutional executive action.  ",
                "As it’s been the law of the land up to now, I’m hoping the Court will fall back on the historical application of the law and not restrict it now.  Crossing fingers!",
                "More insidious than that.\n\nThe trump admin is trying to get the SC to rule that lower courts cannot grant injunction relief except in their own court and affecting only those specific plaintiffs.    This would slow down and increase the cost of taking the government to court for unlawful actions.   They want the court to change due process on injunctive relief.  And by change, I mean , take away.",
                "When you stop adhering to some of the Constitution its not long before none of is adhered to at all.",
                "So when trump says that birthright citizenship was intended for slaves, can we counter that and ask about removing the 2nd amendment because that was intended for muskets???",
                "Service Guarantees Citizenship! Would you like to know more?",
                "Up until this ruling I believed I was a US citizen by virtue of being born here and having a birth certificate to attest that fact.  Now I have no clear way of determining whether in fact I am a citizen, what rules apply?  How are those rules changed and how does it affect whose citizenship?  It’s all crazy.",
                "If you really want to be picky then everyone except native Americans should leave the land in this case.",
                "It's an international crime to make someone stateless. We'll put that on your tab, you orange prick. I can't wait for the world to impose sanctions against the US and switch from the dollar to the euro as an international reserve currency."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Outage leaves up to 20 pilots headed to Denver airport unable to contact air traffic control on Monday",
            "external_url": "https://www.denver7.com/news/investigations/outage-leaves-up-to-20-pilots-headed-to-denver-airport-unable-to-contact-air-traffic-control-on-monday",
            "upvotes": 244,
            "date": "05/15/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/f4e9616/2147483647/strip/true/crop/800x420+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F5c%2F83%2Fe3b74fef4750a0f720783d4d55b8%2Fatc-web-1-copy.jpg",
            "top_comments": [
                "Just to clarify this was the regional high altitude Air Traffic Control, not Denver International Airport's Approach Control. The former controls aircraft at cruising altitude; they are handed off to Approach Control approximately 50 miles out from the airport. Approach is responsible for vectoring and separation beyond that point.",
                "And cue the \"It's the Biden administration's fault - they should have asked harder for the money to fix things!\n\n\"Also - no we aren't going to fix things, just get a private jet like rich people do!\"",
                "You wonder how many airports air traffic control have kept up equipment update and maintenance.\n\nMy guess is woefully low and throw in shortage of air traffic controllers it is a receipt for disaster in waiting.",
                "Supposed to fly into Denver tomorrow. Very reassuring!",
                "6 minutes of WTF, terror\n\n> Multiple inside sources told Denver7 Investigates' Chief Investigator Tony Kovaleski that the outage occurred around 2 p.m., leaving between 15 and 20 aircraft unable to communicate with air traffic control during a critical time. A controller eventually was able to contact one pilot on what’s called a guard line — which is typically used when a pilot is in distress — and that pilot was able to contact the other aircraft to tell them to change frequencies."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "RFK Jr orders mifepristone review as anti-abortion groups push for ban",
            "external_url": "https://www.theguardian.com/us-news/2025/may/14/rfk-jr-fda-abortion-pill-mifepristone",
            "upvotes": 9368,
            "date": "05/15/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/67a815aac24a9d2dd041bbfd8fd6798a959d51d4/500_0_5000_4000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a1a221076062851cf9016b33ab6cb595",
            "top_comments": [
                "Didn't this man just say nobody should take health advice from him yesterday? This country has fully turned into a farce.",
                "We need to spread a rumor that mifepristone treats measles. He will defend it with gusto.",
                "Ladies and people who care about ladies: if you can acquire this, do so. The day is coming when it will be more difficult than just about anything to get, if not impossible. Miscarriages are incredibly dangerous if all of the tissue is not expelled, and many hospitals refuse to offer any kind of aid due to the new laws across much of the South until a woman is nearly dead.\n\n  \nAnd even then, if your baby is viable and you are not, they'll just keep you on machines until you deliver. Adriana Smith is suffering this fate in Georgia as we speak after a hospital refused care for a brain bleed when she was 9 weeks. She is now 21 weeks, and is being kept alive against her family's wishes due to the heartbeat law.",
                "The party of forced birth and indifference toward living children strikes again.",
                "“LeAvE iT tO tHe StAtEs”",
                "Weird that anyone doesn't believe that they are really just trying to legislate that women are basically children that need men to make their decisions, so if you think about it that's why it is OK for them to marry children.\n\nLiterally, that is a pretty clear overlap on the venn diagram of legislating agenda they have been on target for.\n\n  \n\\----\n\nA quick edit so I don't come accross as hyperbolic or simply lobbing petty insults:  \n\nI realized I should probably [bring reciepts](https://www.rollingstone.com/politics/politics-features/republican-lawmakers-child-marriage-abortion-1235018777/). \n\nThere are a [*lot*](https://www.nbcnews.com/politics/politics-news/end-child-marriage-u-s-you-might-be-surprised-who-n1050471) of reciepts. \n\nThey've tried \"[defending child marriage is actually pretty pro-choice of me](https://www.newsweek.com/republican-defends-child-marriage-im-pro-choice-1898619)\" and \"[if you ban child marriage, you're letting the gays win](https://www.tba.org/?pg=Articles&blAction=showEntry&blogEntry=30366)\"  along the way . . . landing on their most successful attack yet . . .  \n\n\"[a woman is like a child](https://www.yahoo.com/news/woman-child-maga-quickly-turns-105907677.html)\" . . . and if woman == child, then it stands to reason that child == women . . . \n\nObviously, you wouldn't say women shouldn't be allowed to have an adult sexual relationship within the confines of a legally binding marriage contract that they can leave anytime they want to have enough money and a good lawyer. Which is also why child labor is so important, so that they could obviously have left the marriage if they didn't want to be there.\n\nIt also makes sense of other agenda pushes that would otherwise feel pointless and unrelated, like the absolute insane amounts of hate against women they've pushed on the youth in recent years.",
                "Review has already been done. It does exactly what it says it does and is perfectly safe",
                "The US health secretary, Robert F Kennedy Jr, said on Wednesday that he had directed the FDA to review the regulations around the abortion pill mifepristone.\n\nThe review, he said, was necessary due to “new data” – data that emerged from a flawed analysis that top US anti-abortion groups are now using to pressure the Trump administration to reimpose restrictions on the abortion pill, if not pull it from the market entirely.\n\n...**The analysis, which has not been peer-reviewed or published in a medical journal**, came after the Food and Drug Administration commissioner said he was open to reviewing new safety data on the pills, which are used in nearly two-thirds of abortions nationwide.\n\nThe conservative organizations are rallying behind a paper published on 28 April by a rightwing thinktank, the Ethics and Public Policy Center, which claims there are higher complication rates from taking mifepristone than previously known.\n\nThe paper has attracted scrutiny for appearing to dramatically overstate what it characterizes as “serious adverse effects” associated with the pill, according to medical experts. For example, it counts ectopic pregnancies – when an embryo implants somewhere other than the uterine lining – as a serious complication.\n\nMifepristone does not cause an ectopic pregnancy and taking it will not harm someone with an ectopic. It also claims that needing an in-clinic procedure to complete the abortion is a complication, when patients are counseled in advance about the pills’ failure rate of about 3 to 4%.\n\n**The data, the authors say, means the FDA should reinstate earlier restrictions on mifepristone, including a ban on telemedicine and limiting use to the first seven weeks of pregnancy – but they do not intend to stop there.**\n\nThe authors note that restoring the limits could lead to better monitoring that could help “determine whether this drug should remain on the market”, statements that echo proposals found in Project 2025, the 900-page playbook published by the Heritage Foundation and for which the EPPC was an advisory board member.\n\n**Project 2025 calls to end telemedicine prescriptions of abortion pills as an “interim step” to revoking mifepristone’s approval altogether.**\n\nMore than 100 scientific studies have found the medications cited in the paper are safe and effective for ending a pregnancy.",
                "For my miscarriage- I took mifepristone so that I would be in pain for a weekend instead of an indefinite time over the course of 4 weeks.  There was no fetal development.  But if my body couldn’t pass the tissue on its own, then I could have been in excruciating pain for a month or more and on the line to lose my job, or worse possibly developed sepsis.\n\n1 in 4 known pregnancies end in miscarriage.  It’s even higher for first time pregnancy.  This is not an outlier situation.  You know people who have had miscarriages and gotten treatment for it.  All this medication ban would do is make women suffer. \n\nThese people are extreme lunatics.   Death cult material who think women are property and status symbols, not people.",
                "Someone called it - first it’s the fluoride for kids that need it and next it would be abortion pills. This admin is hellbent on destroying the land of the free. Only freedom if you’re rich. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump's sanctions on ICC prosecutor have halted tribunal's work",
            "external_url": "https://apnews.com/article/icc-trump-sanctions-karim-khan-court-a4b4c02751ab84c09718b1b95cbd5db3",
            "upvotes": 205,
            "date": "05/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From members of the \"party of law and order\".",
                "Duterte bought some Trump coin?",
                "Title doesn't say that the Americans working for the ICC were warned not to return to America or they could be arrested. Y'all need to start asking yourselves what you're willing to do against this government.",
                "How does one post about politics without the auto mod removing?",
                "Usa interference a disgrace. Perfectly reasonable to issue arrest warrants for Israel pm and others\n\nI bet this would not have happened if icc only issd warrants for hamas.\n\nThe bullying of usa in so many organisations and countries is astonishing",
                "That’s insane. Why were the attorney’s bank accounts in the UK frozen? The UK is going along with US sanctions? ",
                "https://nypost.com/2025/05/14/world-news/icc-prosecutor-cited-palestine-to-hush-sex-scandalreport/"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/15/2025 20:10:27 UTC"
}