{
    "posts": [
        {
            "category": "HOT",
            "title": "Black Medal of Honor recipient removed from US Department of Defense website",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/16/defense-department-black-medal-of-honor-veteran",
            "upvotes": 23274,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "Changing “medal” to “deimedal” in the url is so fucking gross",
                "*On Saturday, US army Maj Gen Charles Calvin Rogers’s Medal of Honor webpage led to a “404” error message. The URL was also changed, with the word “medal” changed to “deimedal”.*",
                "Erasing the heroic accomplishments of black Americans is certainly not going to “Make America Great Again.” Hopefully no one is still fooled by what is going on here.",
                "Read the Medal of Honor citation for this man. This wasn’t DEI.  This guy was a legit badass who was several times wounded and fought for 24 hours against repeated attacks and prevented the slaughter of an entire fire base.  His leadership and direction are the reason the Vietnam wall is short a few names today.  I would dare any of the doge kids, musk or commander bone spurs to tell Major General Rogers he got it because he’s black.  Oh wait, he’s dead so it’s easy.  Fuck these pussies. Rogers was a soldier and a warrior.\n\nFor the people bitching about my use of the word dei who can’t be bothered to actually read a fucking bit about the person their commenting on read the legacy section [here](https://en.wikipedia.org/wiki/Charles_Calvin_Rogers)",
                "What’s funny is that MAGA loves Clarence Thomas who is 100% a DEI judge picked to replace Thurgood Marshall.",
                "This has nothing to do with DEI even though MAGA thinks it does. This medal was given under Nixon, their ultra racist hero.",
                "Republicans in Congress: SAY SOMETHING \n\ntrump is your guy. Do you approve of trump disappearing members of the military who served this country?",
                "I am waiting for veterans to be pissed off really bad...",
                "Hegseth must be a yuge racist like his boss.",
                "**Please read this!**\n\nJust removing him would have been bad enough on its own accord, but there could have been a tiny bit of plausible deniability.\n\nThat’s not the fucking case here.  The link where his page use to be (now an error page) has **DEIMedal-of-Honor** in the god damn link.\n\n>https://www.defense.gov/News/Feature-Stories/Story/Article/2824721/deimedal-of-honor-monday-army-maj-gen-charles-calvin-rogers/\n\nIt wasn’t enough to just erase him from the pages, they posthumously shit on his medal calling it the DEI Medal of Honor\n\n\n>For conspicuous gallantry and intrepidity in action at the risk of his life above and beyond the call of duty. Lt. Col. Rogers, Field Artillery, distinguished himself in action while serving as commanding officer, 1st Battalion, during the defense of a forward fire support base. In the early morning hours, the fire support base was subjected to a concentrated bombardment of heavy mortar, rocket and rocket propelled grenade fire. Simultaneously the position was struck by a human wave ground assault, led by sappers who breached the defensive barriers with bangalore torpedoes and penetrated the defensive perimeter. Lt. Col. Rogers with complete disregard for his safety moved through the hail of fragments from bursting enemy rounds to the embattled area. He aggressively rallied the dazed artillery crewmen to man their howitzers and he directed their fire on the assaulting enemy. Although knocked to the ground and wounded by an exploding round, Lt. Col. Rogers sprang to his feet and led a small counterattack force against an enemy element that had penetrated the howitzer positions. Although painfully wounded a second time during the assault, Lt. Col. Rogers pressed the attack killing several of the enemy and driving the remainder from the positions. Refusing medical treatment, Lt. Col. Rogers reestablished and reinforced the defensive positions. As a second human wave attack was launched against another sector of the perimeter, Lt. Col. Rogers directed artillery fire on the assaulting enemy and led a second counterattack against the charging forces. His valorous example rallied the beleaguered defenders to repulse and defeat the enemy onslaught. Lt. Col. Rogers moved from position to position through the heavy enemy fire, giving encouragement and direction to his men. At dawn the determined enemy launched a third assault against the fire base in an attempt to overrun the position. Lt. Col. Rogers moved to the threatened area and directed lethal fire on the enemy forces. Seeing a howitzer inoperative due to casualties, Lt. Col. Rogers joined the surviving members of the crew to return the howitzer to action. While directing the position defense, Lt. Col. Rogers was seriously wounded by fragments from a heavy mortar round which exploded on the parapet of the gun position. Although too severely wounded to physically lead the defenders, Lt. Col. Rogers continued to give encouragement and direction to his men in the defeating and repelling of the enemy attack. Lt. Col. Rogers’ dauntless courage and heroism inspired the defenders of the fire support base to the heights of valor to defeat a determined and numerically superior enemy force. His relentless spirit of aggressiveness in action are in the highest traditions of the military service and reflects great credit upon himself, his unit, and the U.S. Army.\nhttps://en.wikipedia.org/wiki/Charles_Calvin_Rogers"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Finland turns down US request for eggs",
            "external_url": "https://yle.fi/a/74-20149786",
            "upvotes": 23369,
            "date": "03/16/2025",
            "thumbnail": "https://images.cdn.yle.fi/image/upload/c_crop,x_0,y_0,w_1597,h_901/w_1200,ar_1.91,c_fill/q_auto:eco,f_auto,fl_lossy/v1723193249/39-133049966b5d6a6d2abd",
            "top_comments": [
                "Maybe JD didn’t say please",
                "So let me get this straight....\n\nYou expect to get something you need from someone you've pissed off?",
                "”US authorities have turned to Europe for help with the country's severe egg shortage. The shortfall is due to bird flu, which has plagued the United States for several years.\n\nThe Finnish Poultry Association says it has been contacted about exporting eggs to the US. The organisation's executive director, Veera Lehtilä, told Yle on Saturday that exporting eggs does not seem to be possible at the moment because no market access negotiations have been held with US authorities. This can be a drawn-out process involving extensive inspections and studies.”",
                "1. Fuck everyone, we’re not subsidizing any of you anymore, you’re not even a real country, America first, USA, USA, etc. etc.\n\n2. Can we have some eggs please? \n\n\nCan’t make this shit up.",
                "There is little to no goodwill left for the US in Europe. No eggs for you. \n\n\nThe US spent 80 years building up their role as a big brother to the western world, recognized as the leader of the free world.\n\n\nIt took Trump 3 weeks to destroy its reputation, and it will probably take several generations to make it \"great again\" ",
                "Coming soon: *\"Nasty people in Finland, maybe we're looking at it becoming a US state...\"*",
                "Imagine how much cheaper things would get if we just worked with allies instead of pissing them off.\n\nIt’s all a show. The current administration has no plans on making the lives of Americans better. Same with doge. Cost cutting that cuts 02% of federal budget. America strong economic policy that makes us weak.",
                "You don’t have the cards",
                "You could ask Canada... oh, wait.",
                "Any dealings in that magnitude has to be done through an EU negotiated trade agreement. \nAnd considering that the US has just started a trade war with the EU and threatens to invade EU territory.. that's gonna be a no from us dawg."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Brown Medicine professor, doctor deported to Lebanon despite having valid visa, court filings claim",
            "external_url": "https://www.nbcnews.com/news/us-news/brown-medicine-professor-doctor-deported-lebanon-valid-visa-court-fili-rcna196638",
            "upvotes": 3389,
            "date": "03/17/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-04/230424-brown-university-al-1003-908a6b.jpg",
            "top_comments": [
                "There’s a fellow in our office from Mexico who is winding down his time here in preparation for his medical residency. I just found out he has to go back home to update his visa from doing his service hours with us, to one for his residency. I worry that there will be “some problem or the other” and he won’t be let back in and there goes one more good man and good young doctor.",
                "You got a PhD? Gtfo.  \n\n\nYou got $5 mil? Come on in!",
                "We have a deep Lebanese community and a need for doctors here in Canada!",
                "As long as the machine is designed to vilify and persecute and see enemies everywhere, we are going to keep seeing innocent victims caught up in its teeth. ",
                "Watch immigration officers not let her back in for some bullshit reason.",
                "Wouldn’t be surprised if she never comes back, can’t blame her. The brain drain we are seeing is gonna be legendary, except in a terrifying way. ",
                "> “Our CBP Officers adhere to strict protocols to identify and stop threats, using rigorous screening, vetting, strong law enforcement partnerships, and keen inspectional skills to keep threats out of the country,” Hilton Beckham, CBP’s assistant commissioner of public affairs, said in the statement. \n\nSo… what was the threat here?\n\nI’m getting “ocular pat down” vibes from that sentence.",
                "The one expected deportation that hasn’t happened yet is the Statue of Liberty. ",
                "Oh yes, get rid of doctors. \n\n\nThat's totally not going to blow up in our faces.\n\n\n\nIs the government going to make a list of people who know multiple languages and wear glasses next?",
                "“Brown Medicine” isn’t what they think it is."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "US deports hundreds of Venezuelans despite court order",
            "external_url": "https://www.bbc.co.uk/news/articles/cp9yv1gnzyvo",
            "upvotes": 32972,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3465/live/53f1c740-0287-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "We didn’t deport them to Venezuela though. We paid El Salvador to imprison them in some sort of work camp super max prison site situation\n\n[bet the range of people and dissidents exported here grows](https://x.com/nayibbukele/status/1901245427216978290?s=46)",
                "How? I thought by avoiding shutdown the courts would still be functioning and they would stop Trump in his tracks. Schumer said so.\n\nHow can he just ignore the court orders, that's not following the rules. I guess no one could have anticipated that.",
                "Fine, we can't arrest the president for giving illegal order? Arrest the people that carry them out.",
                "Time to start holding people in prison for contempt. When there are worse repercussions to the lawyers and administrators defying court orders than possibly losing their jobs, they'll stop defying them. Checks and balances, the executive can't be free to ignore the judiciary.",
                "Our government ultimately relies on the assumption that the POTUS will fulfill his Constitutional obligations. We do not have that now. We have a criminal.",
                "I think we are burying the lede\n\n>Bukele wrote that the detainees were immediately transferred to El Salvador’s Terrorism Confinement Center (Cecot) “for a period of one year”, something that was “renewable” - suggesting they could be held there for longer.\n>“The United States will pay a very low fee for them, but a high one for us,” he added.\n\nWe are paying (a lot it sounds like) for other countries to run our internment camps",
                "Ladies and gentlemen: the \"Party of Law and Order\", once more fully displaying that they do not, in fact, give a shit about laws.",
                "Looks like we got a good ol' fashioned constitutional crisis on our hands. Grab the pitchforks.",
                "Wouldn’t the Alien Enemies Act of 1798 require the US to be at war for this to be legal deportations? Does this mean then that Congress gave a declaration of war to both Mexico and Venezuela which is what the constitution requires or is Trump violating the U.S. constitution that he swore to uphold?",
                "I will never forget that people tried to argue that democrats are as bad as this"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "US military: ISIS No.2 leader killed in Iraq | NHK WORLD-JAPAN News",
            "external_url": "https://www3.nhk.or.jp/nhkworld/en/news/20250316_04/",
            "upvotes": 3049,
            "date": "03/16/2025",
            "thumbnail": "https://www3.nhk.or.jp/nhkworld/upld/thumbnails/en/news/20250316_04_1503575_L.jpg",
            "top_comments": [
                "ABU\nBAKAR\nAL BAGDADI\n\nIs dead",
                "New Shane Gillis material incoming.",
                "Japan: the world's best source for American news. ",
                "if they got the #3 guy now, would that just be the #2 guy again? if so, is the #2 guy even dead then?",
                "\"Who doe number 2 work for\"",
                "Is ISIS even a thing now? I thought the entire organisation just got annihilated few years back?",
                "Well some good news today",
                "*US forces carried out the strike in Iraq's Anbar Province in cooperation with the country's intelligence and security personnel.*\n\nOr in cooperation with itself.",
                "“OK, everyone in Isis leadership, take one step forward.”",
                "ISIS number 3 leader made President of Syria"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Greek government debt raised to investment grade by Moody's, closing the door on a painful era",
            "external_url": "https://apnews.com/article/greece-moodys-debt-credit-rating-politics-7b9f0902d0d858323b1998aec52e11a0",
            "upvotes": 1518,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Holy cow I never thought I'd be alive to see this. I wonder if the economy will ever rebound to the point where Greeks move back.",
                "And soon enough US bonds will be downgraded by Moody’s. So that’s neat!",
                "Praise be to [**Plutus**](https://en.wikipedia.org/wiki/Plutus)",
                "\"So Greece is insolvent?\"  \n\"Brian, put it this way. If it were a privately owned company there'd be a fire there on Saturday about 4 o' clock in the morning.\"",
                "An era exacerbated by a discredited study centered around a spreadsheet using flawed math.",
                "Cool! I can now invest at a Nick the Greek franchise",
                "Don’t forget that they got there and it took this long to recover because they implemented austerity measures. You know, like Trump is trying to do despite congress being responsible for funding.",
                "it's a AAA trenche.\n* In \"ridiculously hot girl in a bathtub with a flute of Moet\" voice",
                "What kind of rates do they offer? I have to figure people aren't flocking to buying their bond.",
                "Lower tzatziki prices?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "At least 32 Dead as Monster Storm System Sweeps across US South with Multiple Tornadoes",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/15/massive-storm-system-south-tornado-warnings-extreme-weather",
            "upvotes": 7788,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ecb1e814a589538afde609d31570f2f6e89dcc17/0_79_1796_1078/master/1796.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e5aaf03d42cc6335c886d36342ebfe59",
            "top_comments": [
                "NOAA cut. NWS cut. FEMA cut. Tariffs on metals, wood, and other raw materials impact the cost of repairs and rebuilding. Eliminating immigrants from the labor pool so there aren't enough workers to repair and rebuild.\n\nAt least they're owning the libs.",
                "FEMA defunded, government officials cannot travel with $1 credit card limit, and no leadership.",
                "Given the nature of climate change, this is only going to get worse, much worse.",
                "A good time to gut NOAA.",
                "It'll be that non-existent climate change up to its old tricks! I'm sure he'll blame FEMA for it and cut their funding even more.",
                "Three deaths in my county so far. Governor Sarah Huckabee Sanders declared a state of emergency. Pretty sure that’s her calling on the same federal agencies she just supported massive cuts for but whatever.",
                "Thoughts and tariffs <3",
                "If anyone complains we can just claim they're in a gang and deport them. They probably can't find their ID in the wreckage to prove they're citizens anyway.",
                "Trump won the golf tournament at his club, though, don’t you people care about the IMPORTANT STUFF????",
                "[removed]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Iranian general raises prospect of response amid US strikes on Houthis",
            "external_url": "https://abcnews.go.com/International/iranian-general-raises-prospect-response-amid-us-strikes/story?id=119847045&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 424,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0c7b8af1-0bce-4726-9779-15725547cd67/trump-main_1742126398911_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "They pretty much always say some inflammatory comment but don't follow through.",
                "Someone is not very good at the \"those guys have nothing to do with us\" denial game.",
                "Like what? Try to murder defenseless girls outside of Iran because of hair?",
                ">SINCE BUCKO DELETED HIS COMMENT \"America is trying to instigate a conflict it can frame as a war for national security and defense, not of aggression. They are going to continue to poke and prod until they have their justification and then bring the hammer down. Trump claims to want peace, but he is drooling at the thought of flexing American military might.\"\n\nAs much as I hate t-man, weren't the Houthis the ones threatening EVERYONE, and I mean EVERYONE a while back?\n\nSaudi Oil tankers in 2020, China ships were threatened, IIRC they accidentally did hit a russian ship, and I believe an American one and another one from the EU were hit but survived, unless someone else rememebrs more precisely to correct so I can edit?\n\nDid some searching, heres more info: between 2023-2024 houthi forces have targetted ships in the **Bab-el-Mandeb Strait** and the **Red Sea**. **Saudi Arabia**, **UAE**, **global shipping** (especially vessels from countries like **Japan**, **South Korea**, **India**, **China**.)\n\nSo yeah, you've striked against Saudi Arabia and UAE, some of the biggest powers next to you; attacked not only American, Chinese, but also **Russian** commercial ships at some point in the past 4 years threaneing **WORLD** trade and not just one part, but a huge pathway that would cause tons of economic turmoil for all countries involved that work on schedules. Can't say I'm shocked. I just hope it isn't too bad and the U.S shows some sort of \"restraint\" and by restraint I just mean precise.",
                "The scary thing is that we’ve never been more vulnerable to terror attacks than we are right now with the federal government in disarray.\n\nThere are highly unqualified people running the CIA and FBI",
                "I would certainly hope they don't retaliate by dropping a bomb on Mar a Lago 🏌️‍♂️⛳",
                "It’s hard to take a general seriously when his name sounds like the special of the day at Katz’s Delicatessen",
                "[deleted]",
                "Anti War President says the loser lying fascist scumbag MAGA posers.",
                "Remember rRump’s last administration when he killed that Iranian general and then let Iran bomb the shit out of one of our bases?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Fishermen sue San Diego’s Bumble Bee Foods for forced labor, abuse",
            "external_url": "https://www.nbcsandiego.com/news/local/fishermen-sue-san-diegos-bumble-bee-foods-for-forced-labor-abuse/3779868/",
            "upvotes": 1614,
            "date": "03/16/2025",
            "thumbnail": "https://media.nbcsandiego.com/2019/09/Bumble-Bee-Tuna-AP_643616039433.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "So, to save some people a click... Bumble Bee Foods itself isn't the one that is accused of wrongdoing, but one of the companies in its supply chain. Specifically some boat captain around Indonesia. \n\nAssuming the reports that the people were beaten, stabbed, and suffered various other injuries, they absolutely are owed some justice, but going after Bumble Bee Foods in this specific instance seems like an effort to go after the deeper pockets. Now, if they have evidence Bumble Bee knew about these practices and didn't cut ties with the company, then that would definitely change things. Of course the Foreign Corrupt Practices Act doesn't really make a distinction between whether you knew someone you were doing business with was doing something illegal. \n\nI just hope the people who did the actual beating and stabbing were subjected to the full extent of the law.",
                "I will always stand by labor in their struggle against industry. ",
                "I may be wrong...but wasn't it tuna fisherman and labor questions at the source of the original Chevron ruling by the Supreme Court?",
                "“Bumble bee tuna, Bumble bee tuna. Excuse me, your balls are showing.”",
                "Thank goodness these workers are getting the chance to fight back. Full context for this would take way too much time to explain (I've contributed to a 40-page paper on human rights violations in the seafood industry), so here's a very basic summary. The seafood industry is wrought with criminal activity ranging from theft/misrepresentation to forced labor/genuine slavery. Bumble Bee and their parent company, FCF, are some of the biggest abusers of modern-day slavery.\n\nThe common practice is to hire a ship from another country (usually China, Taiwan, or the Phillipines). That ship hires laborers in a country that has lots of cheap labor (usually Indonesia or Cambodia). Once these people are hired and on the ship, the ship goes out to sea for months, if not years. These workers are stuck without any way to contact their homes and no guarantee that their wages are getting to their families. They're forced to work long hours in unsafe and unsanitary conditions with just enough food to keep them alive. I am not exaggerating when I say complaints are often met with a beating or a bullet to the head. After all that, if the ship does finally dock (which is often delayed due to transshipment and is often only happening for repairs or changing flags at ports of convenience), the workers aren't allowed onto shore or they might get [abandoned in a foreign country](https://apnews.com/article/abandoned-seafarers-labor-unpaid-wages-oceans-83ad0a42debbaf67c18373393fcea753).\n\nOn top of all this, going back to the recruiting process, most honest recruitment agencies know about this and do what they can to prevent people from getting enslaved. So, the companies that are doing this are often connected to organized crime or terrorist organizations. Corruption is a major issue in Indonesia, [especially in their seafood industry](https://www.abc.net.au/news/2020-11-27/rolex-watches-seized-as-indonesian-minister-arrested-corruption/12922796). Fighting back against this is extremely risky.\n\nThese workers are extremely brave as they're potentially facing corruption in multiple countries, organized crime, and massive corporations. Going after Bumble Bee will be difficult as the US doesn't have many laws that can be used to make Bumble Bee liable for human rights violations down its supply chain. If we had many laws for this, Nestlé would've been taken down a long time ago. The contents of the article detail the abuse they faced but didn't clarify the nationality of the captain and registry of the ship. I hope the best for these workers.\n\nAlso, I haven't looked into human rights groups addressing the seafood industry in Indonesia, but if you'd like to help, I recommend [Destructive Fishing Watch - Indonesia](https://dfw.or.id/english-page/).They support workers and fisheries in adopting sustainable fishing practices while providing on the ground resources to those caught in human rights abuses. When I worked with them, they were a little more on the environmental side of things, but it looks like they've been successful in expanding their efforts to organize and represent laborers. Their 2024 report outlines some of the success they've had addressing human rights violations as part of their second strategy. Give them some love so they can keep fighting the good fight!",
                "[RELEVANT SKA](https://youtu.be/63nMcrwporQ?si=uvLzzy4OIEGtTjvq)",
                "That’s why we at Schooner Tuna are reducing the price of our tuna by 50 cents a can.",
                "I love bumblebee, bumblebee tuna",
                "As god as my witness, I saw the headline and immediately thought of Bee Movie."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "HOT",
            "title": "Peru: Fisherman rescued after 95 days adrift, surviving on turtles - BBC News",
            "external_url": "https://www.bbc.com/news/articles/cj92438d3xmo.amp",
            "upvotes": 1173,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c60d/live/734788b0-0281-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "I wonder what percentage of these people rescued at sea just say fuck it and never get on a boat again...",
                "Sailors have been surviving on turtles for centuries.  The islands of the Caribbean were stoping points for ships to stock up on fresh water, and food (turtles).\n\nChristopher Columbus named The Cayman Islands Los Tortugas because of all the sea turtles there.",
                "Wait, were they EATING them, or just, ya know, surviving ON (top of) them?",
                "I think I read this book",
                "Cockroaches, birds and turtles.  I wonder if he was able to cook this stuff on his boat?  As a fisherman I wonder why he didn’t just catch and eat fish.",
                "Saved by the turtle gods.",
                "There's good eating on a turtle.",
                "Sea turtle lives matter",
                "I wonder if he likes turtles in a cuisine sense now.",
                "Perhaps stuffing his face with turtles was his plan all along? I think there was a bit on QI about giant tortoises being extremely delicious."
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "NEW",
            "title": "Black Medal of Honor recipient removed from US Department of Defense website",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/16/defense-department-black-medal-of-honor-veteran",
            "upvotes": 23304,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "Changing “medal” to “deimedal” in the url is so fucking gross",
                "*On Saturday, US army Maj Gen Charles Calvin Rogers’s Medal of Honor webpage led to a “404” error message. The URL was also changed, with the word “medal” changed to “deimedal”.*",
                "Erasing the heroic accomplishments of black Americans is certainly not going to “Make America Great Again.” Hopefully no one is still fooled by what is going on here.",
                "Read the Medal of Honor citation for this man. This wasn’t DEI.  This guy was a legit badass who was several times wounded and fought for 24 hours against repeated attacks and prevented the slaughter of an entire fire base.  His leadership and direction are the reason the Vietnam wall is short a few names today.  I would dare any of the doge kids, musk or commander bone spurs to tell Major General Rogers he got it because he’s black.  Oh wait, he’s dead so it’s easy.  Fuck these pussies. Rogers was a soldier and a warrior.\n\nFor the people bitching about my use of the word dei who can’t be bothered to actually read a fucking bit about the person their commenting on read the legacy section [here](https://en.wikipedia.org/wiki/Charles_Calvin_Rogers)",
                "What’s funny is that MAGA loves Clarence Thomas who is 100% a DEI judge picked to replace Thurgood Marshall.",
                "This has nothing to do with DEI even though MAGA thinks it does. This medal was given under Nixon, their ultra racist hero.",
                "Republicans in Congress: SAY SOMETHING \n\ntrump is your guy. Do you approve of trump disappearing members of the military who served this country?",
                "I am waiting for veterans to be pissed off really bad...",
                "Hegseth must be a yuge racist like his boss.",
                "**Please read this!**\n\nJust removing him would have been bad enough on its own accord, but there could have been a tiny bit of plausible deniability.\n\nThat’s not the fucking case here.  The link where his page use to be (now an error page) has **DEIMedal-of-Honor** in the god damn link.\n\n>https://www.defense.gov/News/Feature-Stories/Story/Article/2824721/deimedal-of-honor-monday-army-maj-gen-charles-calvin-rogers/\n\nIt wasn’t enough to just erase him from the pages, they posthumously shit on his medal calling it the DEI Medal of Honor\n\n\n>For conspicuous gallantry and intrepidity in action at the risk of his life above and beyond the call of duty. Lt. Col. Rogers, Field Artillery, distinguished himself in action while serving as commanding officer, 1st Battalion, during the defense of a forward fire support base. In the early morning hours, the fire support base was subjected to a concentrated bombardment of heavy mortar, rocket and rocket propelled grenade fire. Simultaneously the position was struck by a human wave ground assault, led by sappers who breached the defensive barriers with bangalore torpedoes and penetrated the defensive perimeter. Lt. Col. Rogers with complete disregard for his safety moved through the hail of fragments from bursting enemy rounds to the embattled area. He aggressively rallied the dazed artillery crewmen to man their howitzers and he directed their fire on the assaulting enemy. Although knocked to the ground and wounded by an exploding round, Lt. Col. Rogers sprang to his feet and led a small counterattack force against an enemy element that had penetrated the howitzer positions. Although painfully wounded a second time during the assault, Lt. Col. Rogers pressed the attack killing several of the enemy and driving the remainder from the positions. Refusing medical treatment, Lt. Col. Rogers reestablished and reinforced the defensive positions. As a second human wave attack was launched against another sector of the perimeter, Lt. Col. Rogers directed artillery fire on the assaulting enemy and led a second counterattack against the charging forces. His valorous example rallied the beleaguered defenders to repulse and defeat the enemy onslaught. Lt. Col. Rogers moved from position to position through the heavy enemy fire, giving encouragement and direction to his men. At dawn the determined enemy launched a third assault against the fire base in an attempt to overrun the position. Lt. Col. Rogers moved to the threatened area and directed lethal fire on the enemy forces. Seeing a howitzer inoperative due to casualties, Lt. Col. Rogers joined the surviving members of the crew to return the howitzer to action. While directing the position defense, Lt. Col. Rogers was seriously wounded by fragments from a heavy mortar round which exploded on the parapet of the gun position. Although too severely wounded to physically lead the defenders, Lt. Col. Rogers continued to give encouragement and direction to his men in the defeating and repelling of the enemy attack. Lt. Col. Rogers’ dauntless courage and heroism inspired the defenders of the fire support base to the heights of valor to defeat a determined and numerically superior enemy force. His relentless spirit of aggressiveness in action are in the highest traditions of the military service and reflects great credit upon himself, his unit, and the U.S. Army.\nhttps://en.wikipedia.org/wiki/Charles_Calvin_Rogers"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Iranian general raises prospect of response amid US strikes on Houthis",
            "external_url": "https://abcnews.go.com/International/iranian-general-raises-prospect-response-amid-us-strikes/story?id=119847045&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 422,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0c7b8af1-0bce-4726-9779-15725547cd67/trump-main_1742126398911_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "They pretty much always say some inflammatory comment but don't follow through.",
                "Someone is not very good at the \"those guys have nothing to do with us\" denial game.",
                "Like what? Try to murder defenseless girls outside of Iran because of hair?",
                ">SINCE BUCKO DELETED HIS COMMENT \"America is trying to instigate a conflict it can frame as a war for national security and defense, not of aggression. They are going to continue to poke and prod until they have their justification and then bring the hammer down. Trump claims to want peace, but he is drooling at the thought of flexing American military might.\"\n\nAs much as I hate t-man, weren't the Houthis the ones threatening EVERYONE, and I mean EVERYONE a while back?\n\nSaudi Oil tankers in 2020, China ships were threatened, IIRC they accidentally did hit a russian ship, and I believe an American one and another one from the EU were hit but survived, unless someone else rememebrs more precisely to correct so I can edit?\n\nDid some searching, heres more info: between 2023-2024 houthi forces have targetted ships in the **Bab-el-Mandeb Strait** and the **Red Sea**. **Saudi Arabia**, **UAE**, **global shipping** (especially vessels from countries like **Japan**, **South Korea**, **India**, **China**.)\n\nSo yeah, you've striked against Saudi Arabia and UAE, some of the biggest powers next to you; attacked not only American, Chinese, but also **Russian** commercial ships at some point in the past 4 years threaneing **WORLD** trade and not just one part, but a huge pathway that would cause tons of economic turmoil for all countries involved that work on schedules. Can't say I'm shocked. I just hope it isn't too bad and the U.S shows some sort of \"restraint\" and by restraint I just mean precise.",
                "The scary thing is that we’ve never been more vulnerable to terror attacks than we are right now with the federal government in disarray.\n\nThere are highly unqualified people running the CIA and FBI",
                "I would certainly hope they don't retaliate by dropping a bomb on Mar a Lago 🏌️‍♂️⛳",
                "It’s hard to take a general seriously when his name sounds like the special of the day at Katz’s Delicatessen",
                "[deleted]",
                "Anti War President says the loser lying fascist scumbag MAGA posers.",
                "Remember rRump’s last administration when he killed that Iranian general and then let Iran bomb the shit out of one of our bases?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Swiss Government's New Airplane is Bigger than its Hangar, Runway",
            "external_url": "https://luxurylaunches.com/other_stuff/swiss-government-cant-use-new-private-jet-16032025.php",
            "upvotes": 342,
            "date": "03/17/2025",
            "thumbnail": "https://luxurylaunches.com/wp-content/uploads/2025/03/bombardier-global-7500-business-jet.jpg",
            "top_comments": [
                "Likely intentional. Something like the story of the US Air force: they’re given a chunk of money to build a base , and the build the barracks, golf course and base facilities first, and run out of money before the make the runway. That way they require more money without any further justification.\n\nThis seems like they wanted an upgrade to the airfield to me.",
                "What if they just tried putting the tip in for a second and see how that goes",
                "*while they fly to the Climate Chanhe Summit 2025*",
                "I wouldn’t have thought that a Swiss person would play the \"mine’s bigger than yours\" game.",
                "Sigh. That's airplane building 101. The plane has to fit INSIDE of the hangar and be able to take off FROM the runway.",
                "Don’t let Swiss engineers and project managers fool you with their precision they are experts at malicious compliance. They will give you exactly what you specified.\n\nEdit: autocorrect swill to swiss",
                ">When the delegation needed to reach La Paz, Bolivia, they discovered that their multi-million-franc chariot lacked certification for high-altitude airports. \n\nThat's the bigger issue",
                "Dutch military bought trucks that are to high for the roads and to heavy for the naval barges. Stupidity knows no borders.",
                "I've had that dream too...",
                "Maybe wait for a cold day and try again?"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Brown Medicine professor, doctor deported to Lebanon despite having valid visa, court filings claim",
            "external_url": "https://www.nbcnews.com/news/us-news/brown-medicine-professor-doctor-deported-lebanon-valid-visa-court-fili-rcna196638",
            "upvotes": 3384,
            "date": "03/17/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-04/230424-brown-university-al-1003-908a6b.jpg",
            "top_comments": [
                "There’s a fellow in our office from Mexico who is winding down his time here in preparation for his medical residency. I just found out he has to go back home to update his visa from doing his service hours with us, to one for his residency. I worry that there will be “some problem or the other” and he won’t be let back in and there goes one more good man and good young doctor.",
                "You got a PhD? Gtfo.  \n\n\nYou got $5 mil? Come on in!",
                "We have a deep Lebanese community and a need for doctors here in Canada!",
                "As long as the machine is designed to vilify and persecute and see enemies everywhere, we are going to keep seeing innocent victims caught up in its teeth. ",
                "Watch immigration officers not let her back in for some bullshit reason.",
                "Wouldn’t be surprised if she never comes back, can’t blame her. The brain drain we are seeing is gonna be legendary, except in a terrifying way. ",
                "> “Our CBP Officers adhere to strict protocols to identify and stop threats, using rigorous screening, vetting, strong law enforcement partnerships, and keen inspectional skills to keep threats out of the country,” Hilton Beckham, CBP’s assistant commissioner of public affairs, said in the statement. \n\nSo… what was the threat here?\n\nI’m getting “ocular pat down” vibes from that sentence.",
                "The one expected deportation that hasn’t happened yet is the Statue of Liberty. ",
                "Oh yes, get rid of doctors. \n\n\nThat's totally not going to blow up in our faces.\n\n\n\nIs the government going to make a list of people who know multiple languages and wear glasses next?",
                "“Brown Medicine” isn’t what they think it is."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Greek government debt raised to investment grade by Moody's, closing the door on a painful era",
            "external_url": "https://apnews.com/article/greece-moodys-debt-credit-rating-politics-7b9f0902d0d858323b1998aec52e11a0",
            "upvotes": 1518,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Holy cow I never thought I'd be alive to see this. I wonder if the economy will ever rebound to the point where Greeks move back.",
                "And soon enough US bonds will be downgraded by Moody’s. So that’s neat!",
                "Praise be to [**Plutus**](https://en.wikipedia.org/wiki/Plutus)",
                "\"So Greece is insolvent?\"  \n\"Brian, put it this way. If it were a privately owned company there'd be a fire there on Saturday about 4 o' clock in the morning.\"",
                "An era exacerbated by a discredited study centered around a spreadsheet using flawed math.",
                "Cool! I can now invest at a Nick the Greek franchise",
                "Don’t forget that they got there and it took this long to recover because they implemented austerity measures. You know, like Trump is trying to do despite congress being responsible for funding.",
                "it's a AAA trenche.\n* In \"ridiculously hot girl in a bathtub with a flute of Moet\" voice",
                "What kind of rates do they offer? I have to figure people aren't flocking to buying their bond.",
                "Lower tzatziki prices?"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "NEW",
            "title": "US military: ISIS No.2 leader killed in Iraq | NHK WORLD-JAPAN News",
            "external_url": "https://www3.nhk.or.jp/nhkworld/en/news/20250316_04/",
            "upvotes": 3049,
            "date": "03/16/2025",
            "thumbnail": "https://www3.nhk.or.jp/nhkworld/upld/thumbnails/en/news/20250316_04_1503575_L.jpg",
            "top_comments": [
                "ABU\nBAKAR\nAL BAGDADI\n\nIs dead",
                "New Shane Gillis material incoming.",
                "Japan: the world's best source for American news. ",
                "if they got the #3 guy now, would that just be the #2 guy again? if so, is the #2 guy even dead then?",
                "\"Who doe number 2 work for\"",
                "Is ISIS even a thing now? I thought the entire organisation just got annihilated few years back?",
                "Well some good news today",
                "*US forces carried out the strike in Iraq's Anbar Province in cooperation with the country's intelligence and security personnel.*\n\nOr in cooperation with itself.",
                "“OK, everyone in Isis leadership, take one step forward.”",
                "ISIS number 3 leader made President of Syria"
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "NEW",
            "title": "An assailant sets a woman on fire on a tram in eastern Germany and flees",
            "external_url": "https://apnews.com/article/germany-gera-tram-attack-fire-81b7977336dd626016d40aa6240b3db7",
            "upvotes": 372,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If you read the article, it clearly states that it was her husband.  This was not a random attack.",
                "Weird article.  It talks about an assailant and then says the police are searching for the victim’s husband and “couldn’t rule out that he is a danger to the public”. The article makes no mention of the husband being with his wife when she was set on fire. \n\nIt’s like a bad AI wrote the article.  Shouldn’t it just say “the husband is a suspect”?",
                "Hard to catch the dude if they don't provide any description.",
                "\\*L'amour toujours intensifies",
                "[deleted]"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Finland turns down US request for eggs",
            "external_url": "https://yle.fi/a/74-20149786",
            "upvotes": 23372,
            "date": "03/16/2025",
            "thumbnail": "https://images.cdn.yle.fi/image/upload/c_crop,x_0,y_0,w_1597,h_901/w_1200,ar_1.91,c_fill/q_auto:eco,f_auto,fl_lossy/v1723193249/39-133049966b5d6a6d2abd",
            "top_comments": [
                "Maybe JD didn’t say please",
                "So let me get this straight....\n\nYou expect to get something you need from someone you've pissed off?",
                "”US authorities have turned to Europe for help with the country's severe egg shortage. The shortfall is due to bird flu, which has plagued the United States for several years.\n\nThe Finnish Poultry Association says it has been contacted about exporting eggs to the US. The organisation's executive director, Veera Lehtilä, told Yle on Saturday that exporting eggs does not seem to be possible at the moment because no market access negotiations have been held with US authorities. This can be a drawn-out process involving extensive inspections and studies.”",
                "1. Fuck everyone, we’re not subsidizing any of you anymore, you’re not even a real country, America first, USA, USA, etc. etc.\n\n2. Can we have some eggs please? \n\n\nCan’t make this shit up.",
                "There is little to no goodwill left for the US in Europe. No eggs for you. \n\n\nThe US spent 80 years building up their role as a big brother to the western world, recognized as the leader of the free world.\n\n\nIt took Trump 3 weeks to destroy its reputation, and it will probably take several generations to make it \"great again\" ",
                "Coming soon: *\"Nasty people in Finland, maybe we're looking at it becoming a US state...\"*",
                "Imagine how much cheaper things would get if we just worked with allies instead of pissing them off.\n\nIt’s all a show. The current administration has no plans on making the lives of Americans better. Same with doge. Cost cutting that cuts 02% of federal budget. America strong economic policy that makes us weak.",
                "You don’t have the cards",
                "You could ask Canada... oh, wait.",
                "Any dealings in that magnitude has to be done through an EU negotiated trade agreement. \nAnd considering that the US has just started a trade war with the EU and threatens to invade EU territory.. that's gonna be a no from us dawg."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Peru: Fisherman rescued after 95 days adrift, surviving on turtles - BBC News",
            "external_url": "https://www.bbc.com/news/articles/cj92438d3xmo.amp",
            "upvotes": 1175,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c60d/live/734788b0-0281-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "I wonder what percentage of these people rescued at sea just say fuck it and never get on a boat again...",
                "Sailors have been surviving on turtles for centuries.  The islands of the Caribbean were stoping points for ships to stock up on fresh water, and food (turtles).\n\nChristopher Columbus named The Cayman Islands Los Tortugas because of all the sea turtles there.",
                "Wait, were they EATING them, or just, ya know, surviving ON (top of) them?",
                "I think I read this book",
                "Cockroaches, birds and turtles.  I wonder if he was able to cook this stuff on his boat?  As a fisherman I wonder why he didn’t just catch and eat fish.",
                "Saved by the turtle gods.",
                "There's good eating on a turtle.",
                "Sea turtle lives matter",
                "I wonder if he likes turtles in a cuisine sense now.",
                "Perhaps stuffing his face with turtles was his plan all along? I think there was a bit on QI about giant tortoises being extremely delicious."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "US launches wave of air strikes on Yemen's Houthis",
            "external_url": "https://www.bbc.com/news/articles/c05mvr3j3yro",
            "upvotes": 1222,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e143/live/2f8cd9f0-024e-11f0-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "It appears as though we may be about to strike [Iranian targets](https://bsky.app/profile/maks23.bsky.social/post/3lkj5kqsji22t) in Yemen too.",
                "I can't believe how many Republicans (and similar) kept saying that Trump would end US foreign involvement. How they came to that belief was really beyond me.",
                "Gee.. nobody has ever tried bombing Yemen before.",
                "And he’s talking about military action to take the Panama Canal. WTF?!",
                "How about a wave of strikes on Putins goblins?",
                "Y'all are mental I'll if you support the Houthis.",
                "As a liberal I am so, utterly and devastatingly owned by Trump blowing up this genocidal pirate death cult.",
                "Hasabi about to be furious.",
                "Sounds weird but, I expected this without expecting it? Everything is starting to stumble and the world is realizing the administration is full of shit, and that its allies want no part of the Trump World Order. So what to do? Oh, shoot some missiles to show that something’s working. ",
                "Trump the anti war president."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Greek government debt raised to investment grade by Moody's, closing the door on a painful era",
            "external_url": "https://apnews.com/article/greece-moodys-debt-credit-rating-politics-7b9f0902d0d858323b1998aec52e11a0",
            "upvotes": 1515,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Holy cow I never thought I'd be alive to see this. I wonder if the economy will ever rebound to the point where Greeks move back.",
                "And soon enough US bonds will be downgraded by Moody’s. So that’s neat!",
                "Praise be to [**Plutus**](https://en.wikipedia.org/wiki/Plutus)",
                "\"So Greece is insolvent?\"  \n\"Brian, put it this way. If it were a privately owned company there'd be a fire there on Saturday about 4 o' clock in the morning.\"",
                "An era exacerbated by a discredited study centered around a spreadsheet using flawed math.",
                "Cool! I can now invest at a Nick the Greek franchise",
                "Don’t forget that they got there and it took this long to recover because they implemented austerity measures. You know, like Trump is trying to do despite congress being responsible for funding.",
                "it's a AAA trenche.\n* In \"ridiculously hot girl in a bathtub with a flute of Moet\" voice",
                "What kind of rates do they offer? I have to figure people aren't flocking to buying their bond.",
                "Lower tzatziki prices?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Brown Medicine professor, doctor deported to Lebanon despite having valid visa, court filings claim",
            "external_url": "https://www.nbcnews.com/news/us-news/brown-medicine-professor-doctor-deported-lebanon-valid-visa-court-fili-rcna196638",
            "upvotes": 3388,
            "date": "03/17/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-04/230424-brown-university-al-1003-908a6b.jpg",
            "top_comments": [
                "There’s a fellow in our office from Mexico who is winding down his time here in preparation for his medical residency. I just found out he has to go back home to update his visa from doing his service hours with us, to one for his residency. I worry that there will be “some problem or the other” and he won’t be let back in and there goes one more good man and good young doctor.",
                "You got a PhD? Gtfo.  \n\n\nYou got $5 mil? Come on in!",
                "We have a deep Lebanese community and a need for doctors here in Canada!",
                "As long as the machine is designed to vilify and persecute and see enemies everywhere, we are going to keep seeing innocent victims caught up in its teeth. ",
                "Watch immigration officers not let her back in for some bullshit reason.",
                "Wouldn’t be surprised if she never comes back, can’t blame her. The brain drain we are seeing is gonna be legendary, except in a terrifying way. ",
                "> “Our CBP Officers adhere to strict protocols to identify and stop threats, using rigorous screening, vetting, strong law enforcement partnerships, and keen inspectional skills to keep threats out of the country,” Hilton Beckham, CBP’s assistant commissioner of public affairs, said in the statement. \n\nSo… what was the threat here?\n\nI’m getting “ocular pat down” vibes from that sentence.",
                "The one expected deportation that hasn’t happened yet is the Statue of Liberty. ",
                "Oh yes, get rid of doctors. \n\n\nThat's totally not going to blow up in our faces.\n\n\n\nIs the government going to make a list of people who know multiple languages and wear glasses next?",
                "“Brown Medicine” isn’t what they think it is."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Black Medal of Honor recipient removed from US Department of Defense website",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/16/defense-department-black-medal-of-honor-veteran",
            "upvotes": 23254,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "Changing “medal” to “deimedal” in the url is so fucking gross",
                "*On Saturday, US army Maj Gen Charles Calvin Rogers’s Medal of Honor webpage led to a “404” error message. The URL was also changed, with the word “medal” changed to “deimedal”.*",
                "Erasing the heroic accomplishments of black Americans is certainly not going to “Make America Great Again.” Hopefully no one is still fooled by what is going on here.",
                "Read the Medal of Honor citation for this man. This wasn’t DEI.  This guy was a legit badass who was several times wounded and fought for 24 hours against repeated attacks and prevented the slaughter of an entire fire base.  His leadership and direction are the reason the Vietnam wall is short a few names today.  I would dare any of the doge kids, musk or commander bone spurs to tell Major General Rogers he got it because he’s black.  Oh wait, he’s dead so it’s easy.  Fuck these pussies. Rogers was a soldier and a warrior.\n\nFor the people bitching about my use of the word dei who can’t be bothered to actually read a fucking bit about the person their commenting on read the legacy section [here](https://en.wikipedia.org/wiki/Charles_Calvin_Rogers)",
                "What’s funny is that MAGA loves Clarence Thomas who is 100% a DEI judge picked to replace Thurgood Marshall.",
                "This has nothing to do with DEI even though MAGA thinks it does. This medal was given under Nixon, their ultra racist hero.",
                "Republicans in Congress: SAY SOMETHING \n\ntrump is your guy. Do you approve of trump disappearing members of the military who served this country?",
                "I am waiting for veterans to be pissed off really bad...",
                "Hegseth must be a yuge racist like his boss.",
                "**Please read this!**\n\nJust removing him would have been bad enough on its own accord, but there could have been a tiny bit of plausible deniability.\n\nThat’s not the fucking case here.  The link where his page use to be (now an error page) has **DEIMedal-of-Honor** in the god damn link.\n\n>https://www.defense.gov/News/Feature-Stories/Story/Article/2824721/deimedal-of-honor-monday-army-maj-gen-charles-calvin-rogers/\n\nIt wasn’t enough to just erase him from the pages, they posthumously shit on his medal calling it the DEI Medal of Honor\n\n\n>For conspicuous gallantry and intrepidity in action at the risk of his life above and beyond the call of duty. Lt. Col. Rogers, Field Artillery, distinguished himself in action while serving as commanding officer, 1st Battalion, during the defense of a forward fire support base. In the early morning hours, the fire support base was subjected to a concentrated bombardment of heavy mortar, rocket and rocket propelled grenade fire. Simultaneously the position was struck by a human wave ground assault, led by sappers who breached the defensive barriers with bangalore torpedoes and penetrated the defensive perimeter. Lt. Col. Rogers with complete disregard for his safety moved through the hail of fragments from bursting enemy rounds to the embattled area. He aggressively rallied the dazed artillery crewmen to man their howitzers and he directed their fire on the assaulting enemy. Although knocked to the ground and wounded by an exploding round, Lt. Col. Rogers sprang to his feet and led a small counterattack force against an enemy element that had penetrated the howitzer positions. Although painfully wounded a second time during the assault, Lt. Col. Rogers pressed the attack killing several of the enemy and driving the remainder from the positions. Refusing medical treatment, Lt. Col. Rogers reestablished and reinforced the defensive positions. As a second human wave attack was launched against another sector of the perimeter, Lt. Col. Rogers directed artillery fire on the assaulting enemy and led a second counterattack against the charging forces. His valorous example rallied the beleaguered defenders to repulse and defeat the enemy onslaught. Lt. Col. Rogers moved from position to position through the heavy enemy fire, giving encouragement and direction to his men. At dawn the determined enemy launched a third assault against the fire base in an attempt to overrun the position. Lt. Col. Rogers moved to the threatened area and directed lethal fire on the enemy forces. Seeing a howitzer inoperative due to casualties, Lt. Col. Rogers joined the surviving members of the crew to return the howitzer to action. While directing the position defense, Lt. Col. Rogers was seriously wounded by fragments from a heavy mortar round which exploded on the parapet of the gun position. Although too severely wounded to physically lead the defenders, Lt. Col. Rogers continued to give encouragement and direction to his men in the defeating and repelling of the enemy attack. Lt. Col. Rogers’ dauntless courage and heroism inspired the defenders of the fire support base to the heights of valor to defeat a determined and numerically superior enemy force. His relentless spirit of aggressiveness in action are in the highest traditions of the military service and reflects great credit upon himself, his unit, and the U.S. Army.\nhttps://en.wikipedia.org/wiki/Charles_Calvin_Rogers"
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "RISING",
            "title": "Iranian general raises prospect of response amid US strikes on Houthis",
            "external_url": "https://abcnews.go.com/International/iranian-general-raises-prospect-response-amid-us-strikes/story?id=119847045&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 424,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0c7b8af1-0bce-4726-9779-15725547cd67/trump-main_1742126398911_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "They pretty much always say some inflammatory comment but don't follow through.",
                "Someone is not very good at the \"those guys have nothing to do with us\" denial game.",
                "Like what? Try to murder defenseless girls outside of Iran because of hair?",
                ">SINCE BUCKO DELETED HIS COMMENT \"America is trying to instigate a conflict it can frame as a war for national security and defense, not of aggression. They are going to continue to poke and prod until they have their justification and then bring the hammer down. Trump claims to want peace, but he is drooling at the thought of flexing American military might.\"\n\nAs much as I hate t-man, weren't the Houthis the ones threatening EVERYONE, and I mean EVERYONE a while back?\n\nSaudi Oil tankers in 2020, China ships were threatened, IIRC they accidentally did hit a russian ship, and I believe an American one and another one from the EU were hit but survived, unless someone else rememebrs more precisely to correct so I can edit?\n\nDid some searching, heres more info: between 2023-2024 houthi forces have targetted ships in the **Bab-el-Mandeb Strait** and the **Red Sea**. **Saudi Arabia**, **UAE**, **global shipping** (especially vessels from countries like **Japan**, **South Korea**, **India**, **China**.)\n\nSo yeah, you've striked against Saudi Arabia and UAE, some of the biggest powers next to you; attacked not only American, Chinese, but also **Russian** commercial ships at some point in the past 4 years threaneing **WORLD** trade and not just one part, but a huge pathway that would cause tons of economic turmoil for all countries involved that work on schedules. Can't say I'm shocked. I just hope it isn't too bad and the U.S shows some sort of \"restraint\" and by restraint I just mean precise.",
                "The scary thing is that we’ve never been more vulnerable to terror attacks than we are right now with the federal government in disarray.\n\nThere are highly unqualified people running the CIA and FBI",
                "I would certainly hope they don't retaliate by dropping a bomb on Mar a Lago 🏌️‍♂️⛳",
                "It’s hard to take a general seriously when his name sounds like the special of the day at Katz’s Delicatessen",
                "[deleted]",
                "Anti War President says the loser lying fascist scumbag MAGA posers.",
                "Remember rRump’s last administration when he killed that Iranian general and then let Iran bomb the shit out of one of our bases?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Finland turns down US request for eggs",
            "external_url": "https://yle.fi/a/74-20149786",
            "upvotes": 23392,
            "date": "03/16/2025",
            "thumbnail": "https://images.cdn.yle.fi/image/upload/c_crop,x_0,y_0,w_1597,h_901/w_1200,ar_1.91,c_fill/q_auto:eco,f_auto,fl_lossy/v1723193249/39-133049966b5d6a6d2abd",
            "top_comments": [
                "Maybe JD didn’t say please",
                "So let me get this straight....\n\nYou expect to get something you need from someone you've pissed off?",
                "”US authorities have turned to Europe for help with the country's severe egg shortage. The shortfall is due to bird flu, which has plagued the United States for several years.\n\nThe Finnish Poultry Association says it has been contacted about exporting eggs to the US. The organisation's executive director, Veera Lehtilä, told Yle on Saturday that exporting eggs does not seem to be possible at the moment because no market access negotiations have been held with US authorities. This can be a drawn-out process involving extensive inspections and studies.”",
                "1. Fuck everyone, we’re not subsidizing any of you anymore, you’re not even a real country, America first, USA, USA, etc. etc.\n\n2. Can we have some eggs please? \n\n\nCan’t make this shit up.",
                "There is little to no goodwill left for the US in Europe. No eggs for you. \n\n\nThe US spent 80 years building up their role as a big brother to the western world, recognized as the leader of the free world.\n\n\nIt took Trump 3 weeks to destroy its reputation, and it will probably take several generations to make it \"great again\" ",
                "Coming soon: *\"Nasty people in Finland, maybe we're looking at it becoming a US state...\"*",
                "Imagine how much cheaper things would get if we just worked with allies instead of pissing them off.\n\nIt’s all a show. The current administration has no plans on making the lives of Americans better. Same with doge. Cost cutting that cuts 02% of federal budget. America strong economic policy that makes us weak.",
                "You don’t have the cards",
                "You could ask Canada... oh, wait.",
                "Any dealings in that magnitude has to be done through an EU negotiated trade agreement. \nAnd considering that the US has just started a trade war with the EU and threatens to invade EU territory.. that's gonna be a no from us dawg."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Fishermen sue San Diego’s Bumble Bee Foods for forced labor, abuse",
            "external_url": "https://www.nbcsandiego.com/news/local/fishermen-sue-san-diegos-bumble-bee-foods-for-forced-labor-abuse/3779868/",
            "upvotes": 1613,
            "date": "03/16/2025",
            "thumbnail": "https://media.nbcsandiego.com/2019/09/Bumble-Bee-Tuna-AP_643616039433.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "So, to save some people a click... Bumble Bee Foods itself isn't the one that is accused of wrongdoing, but one of the companies in its supply chain. Specifically some boat captain around Indonesia. \n\nAssuming the reports that the people were beaten, stabbed, and suffered various other injuries, they absolutely are owed some justice, but going after Bumble Bee Foods in this specific instance seems like an effort to go after the deeper pockets. Now, if they have evidence Bumble Bee knew about these practices and didn't cut ties with the company, then that would definitely change things. Of course the Foreign Corrupt Practices Act doesn't really make a distinction between whether you knew someone you were doing business with was doing something illegal. \n\nI just hope the people who did the actual beating and stabbing were subjected to the full extent of the law.",
                "I will always stand by labor in their struggle against industry. ",
                "I may be wrong...but wasn't it tuna fisherman and labor questions at the source of the original Chevron ruling by the Supreme Court?",
                "“Bumble bee tuna, Bumble bee tuna. Excuse me, your balls are showing.”",
                "Thank goodness these workers are getting the chance to fight back. Full context for this would take way too much time to explain (I've contributed to a 40-page paper on human rights violations in the seafood industry), so here's a very basic summary. The seafood industry is wrought with criminal activity ranging from theft/misrepresentation to forced labor/genuine slavery. Bumble Bee and their parent company, FCF, are some of the biggest abusers of modern-day slavery.\n\nThe common practice is to hire a ship from another country (usually China, Taiwan, or the Phillipines). That ship hires laborers in a country that has lots of cheap labor (usually Indonesia or Cambodia). Once these people are hired and on the ship, the ship goes out to sea for months, if not years. These workers are stuck without any way to contact their homes and no guarantee that their wages are getting to their families. They're forced to work long hours in unsafe and unsanitary conditions with just enough food to keep them alive. I am not exaggerating when I say complaints are often met with a beating or a bullet to the head. After all that, if the ship does finally dock (which is often delayed due to transshipment and is often only happening for repairs or changing flags at ports of convenience), the workers aren't allowed onto shore or they might get [abandoned in a foreign country](https://apnews.com/article/abandoned-seafarers-labor-unpaid-wages-oceans-83ad0a42debbaf67c18373393fcea753).\n\nOn top of all this, going back to the recruiting process, most honest recruitment agencies know about this and do what they can to prevent people from getting enslaved. So, the companies that are doing this are often connected to organized crime or terrorist organizations. Corruption is a major issue in Indonesia, [especially in their seafood industry](https://www.abc.net.au/news/2020-11-27/rolex-watches-seized-as-indonesian-minister-arrested-corruption/12922796). Fighting back against this is extremely risky.\n\nThese workers are extremely brave as they're potentially facing corruption in multiple countries, organized crime, and massive corporations. Going after Bumble Bee will be difficult as the US doesn't have many laws that can be used to make Bumble Bee liable for human rights violations down its supply chain. If we had many laws for this, Nestlé would've been taken down a long time ago. The contents of the article detail the abuse they faced but didn't clarify the nationality of the captain and registry of the ship. I hope the best for these workers.\n\nAlso, I haven't looked into human rights groups addressing the seafood industry in Indonesia, but if you'd like to help, I recommend [Destructive Fishing Watch - Indonesia](https://dfw.or.id/english-page/).They support workers and fisheries in adopting sustainable fishing practices while providing on the ground resources to those caught in human rights abuses. When I worked with them, they were a little more on the environmental side of things, but it looks like they've been successful in expanding their efforts to organize and represent laborers. Their 2024 report outlines some of the success they've had addressing human rights violations as part of their second strategy. Give them some love so they can keep fighting the good fight!",
                "[RELEVANT SKA](https://youtu.be/63nMcrwporQ?si=uvLzzy4OIEGtTjvq)",
                "That’s why we at Schooner Tuna are reducing the price of our tuna by 50 cents a can.",
                "I love bumblebee, bumblebee tuna",
                "As god as my witness, I saw the headline and immediately thought of Bee Movie."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Swiss Government's New Airplane is Bigger than its Hangar, Runway",
            "external_url": "https://luxurylaunches.com/other_stuff/swiss-government-cant-use-new-private-jet-16032025.php",
            "upvotes": 344,
            "date": "03/17/2025",
            "thumbnail": "https://luxurylaunches.com/wp-content/uploads/2025/03/bombardier-global-7500-business-jet.jpg",
            "top_comments": [
                "Likely intentional. Something like the story of the US Air force: they’re given a chunk of money to build a base , and the build the barracks, golf course and base facilities first, and run out of money before the make the runway. That way they require more money without any further justification.\n\nThis seems like they wanted an upgrade to the airfield to me.",
                "What if they just tried putting the tip in for a second and see how that goes",
                "*while they fly to the Climate Chanhe Summit 2025*",
                "I wouldn’t have thought that a Swiss person would play the \"mine’s bigger than yours\" game.",
                "Sigh. That's airplane building 101. The plane has to fit INSIDE of the hangar and be able to take off FROM the runway.",
                "Don’t let Swiss engineers and project managers fool you with their precision they are experts at malicious compliance. They will give you exactly what you specified.\n\nEdit: autocorrect swill to swiss",
                ">When the delegation needed to reach La Paz, Bolivia, they discovered that their multi-million-franc chariot lacked certification for high-altitude airports. \n\nThat's the bigger issue",
                "Dutch military bought trucks that are to high for the roads and to heavy for the naval barges. Stupidity knows no borders.",
                "I've had that dream too...",
                "Maybe wait for a cold day and try again?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Peru: Fisherman rescued after 95 days adrift, surviving on turtles - BBC News",
            "external_url": "https://www.bbc.com/news/articles/cj92438d3xmo.amp",
            "upvotes": 1174,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c60d/live/734788b0-0281-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "I wonder what percentage of these people rescued at sea just say fuck it and never get on a boat again...",
                "Sailors have been surviving on turtles for centuries.  The islands of the Caribbean were stoping points for ships to stock up on fresh water, and food (turtles).\n\nChristopher Columbus named The Cayman Islands Los Tortugas because of all the sea turtles there.",
                "Wait, were they EATING them, or just, ya know, surviving ON (top of) them?",
                "I think I read this book",
                "Cockroaches, birds and turtles.  I wonder if he was able to cook this stuff on his boat?  As a fisherman I wonder why he didn’t just catch and eat fish.",
                "Saved by the turtle gods.",
                "There's good eating on a turtle.",
                "Sea turtle lives matter",
                "I wonder if he likes turtles in a cuisine sense now.",
                "Perhaps stuffing his face with turtles was his plan all along? I think there was a bit on QI about giant tortoises being extremely delicious."
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "RISING",
            "title": "US military: ISIS No.2 leader killed in Iraq | NHK WORLD-JAPAN News",
            "external_url": "https://www3.nhk.or.jp/nhkworld/en/news/20250316_04/",
            "upvotes": 3042,
            "date": "03/16/2025",
            "thumbnail": "https://www3.nhk.or.jp/nhkworld/upld/thumbnails/en/news/20250316_04_1503575_L.jpg",
            "top_comments": [
                "ABU\nBAKAR\nAL BAGDADI\n\nIs dead",
                "New Shane Gillis material incoming.",
                "Japan: the world's best source for American news. ",
                "if they got the #3 guy now, would that just be the #2 guy again? if so, is the #2 guy even dead then?",
                "\"Who doe number 2 work for\"",
                "Is ISIS even a thing now? I thought the entire organisation just got annihilated few years back?",
                "Well some good news today",
                "*US forces carried out the strike in Iraq's Anbar Province in cooperation with the country's intelligence and security personnel.*\n\nOr in cooperation with itself.",
                "“OK, everyone in Isis leadership, take one step forward.”",
                "ISIS number 3 leader made President of Syria"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "An assailant sets a woman on fire on a tram in eastern Germany and flees",
            "external_url": "https://apnews.com/article/germany-gera-tram-attack-fire-81b7977336dd626016d40aa6240b3db7",
            "upvotes": 376,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If you read the article, it clearly states that it was her husband.  This was not a random attack.",
                "Weird article.  It talks about an assailant and then says the police are searching for the victim’s husband and “couldn’t rule out that he is a danger to the public”. The article makes no mention of the husband being with his wife when she was set on fire. \n\nIt’s like a bad AI wrote the article.  Shouldn’t it just say “the husband is a suspect”?",
                "Hard to catch the dude if they don't provide any description.",
                "\\*L'amour toujours intensifies",
                "[deleted]"
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "03/17/2025 04:10:44 UTC"
}