{
    "posts": [
        {
            "category": "HOT",
            "title": "Top US officials appeared to message a journalist Houthi strike plans",
            "external_url": "https://www.bbc.com/news/articles/cy4v3ndg28jo",
            "upvotes": 17731,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/9379/live/b4019cf0-08db-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "The defense department has [confirmed.](https://abcnews.go.com/Politics/trump-officials-accidentally-shared-yemen-war-plans-group/story?id=120106043)\n\n\nInsane",
                "Not appeared, they DID message a journalist by mistake on their group text chain discussing war plans.",
                ">Jeffrey Goldberg, editor-in-chief of The Atlantic, [reported](https://www.theatlantic.com/politics/archive/2025/03/trump-administration-accidentally-texted-me-its-war-plans/682151) on Monday that he was added to a Signal message group which included accounts labelled as White House National Security Adviser Michael Waltz and Vice-President JD Vance.\n\nWhy are updates on military operations being communicated over Signal rather than secure DoD communications?\n\nEdit:  \nAnyone who remotely (and rightfully) criticized Hillary Clinton for using her own Email server should be furious about this news story.",
                "The headline really downplays the absolute fuckery of what happened here. \n\n1) Cabinet level, real-time military operational planning was being done on a commercial messaging platform instead of a secure government IS. \n\n2) They fucking didn't notice a private citizen was sitting in the group chat. \n\n\nThis is an absolutely catastrophic failure of information and operational security that puts previous scandals (Hillary emails, even Trump documents) to shame. This is unauthorized disclosure of the most sensitive government information imaginable. All of these people should be fired if not criminally charged.",
                "\"Any unauthorized release of classified information is a violation of the law and will be treated as such.\"\n\n-Tulsi Gabbard 3/14/25\n\nFor those keeping track that is the day before these events took place and she's on the group chat on question.",
                "Old whiskey finger hegseth at it again. To be fair, when you’re that drunk, names just blur together in your phone. ",
                "Wow. I’m stunned that the president of the US, Elon Musk wasn’t added to this amateur hour group chat too. \n\nHe’s probably insulted. ",
                "Thank you, Trump voters, for enabling these many opportunities to see that your people are as embarrassing behind closed doors as they are publicly. \n\n\nIt's going to take decades to recover from just the past 2 months.  Pretty much an entire term to go.",
                "From the story in the Atlantic:\n\n>Brian Hughes, the spokesman for the National Security Council, responded two hours later, confirming the veracity of the Signal group. “This appears to be an authentic message chain, and we are reviewing how an inadvertent number was added to the chain,” Hughes wrote. “The thread is a demonstration of the deep and thoughtful policy coordination between senior officials.”\n\nThese assholes were using goddamned emojis.",
                "Anyone have odds that the administration tries to blame the journalist?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Oscar-winning Palestinian director attacked by Israeli settlers and arrested",
            "external_url": "https://www.theguardian.com/world/2025/mar/24/oscar-winning-palestinian-director-attacked-by-israeli-settlers-and-arrested",
            "upvotes": 6315,
            "date": "03/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1c062253020fbc7665681aec4d4423d7d450f595/0_247_1365_819/master/1365.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=94da34fd8ec7e1b54b4756a49420ead3",
            "top_comments": [
                "To clarify, he was apparently attacked by Israeli settlers at his home and was subsequently detained and disappeared by the Israeli military. \n\nHis Israeli co-director stated that the attack by the settlers left Ballal bleeding from the head. When an ambulance arrived for him, Israeli soldiers prevented medics from treating him, pulled him out of the ambulance, blindfolded him, forced him and another attack victim into a car, and drove away.\n\n[The Associated Press](https://apnews.com/article/no-other-land-oscar-israel-palestinians-084c63f33e748a3279646759e9b705c2) is reporting that they have received verified video showing part of the attack, which targeted both Jewish Israeli and Palestinian peace activists alike:\n\n> Video provided by the Center for Jewish Nonviolence showed a masked settler shoving and swinging his fists at two activists from the group in a dusty field at night. The activists rush back to their car. “Get in, get in!” one shouts, and they duck inside as the thuds of rocks being thrown can be heard. “Car window was broken,” the driver says as they drive off.\n\nThe Israeli military has refused to comment or provide any information about Ballal’s whereabouts.\n\nEdit: [This](https://www.reddit.com/r/Fauxmoi/s/mBJ3EfPMEc) is purportedly video of the attack from the peace activists’ perspective.",
                "Talk about quite literally hammering home the point of the movie.",
                "Can we stop calling them settlers? They’re invaders.",
                "This is one of the biggest Hollywood stories in the century.",
                "“Arrested” reports are saying he was taken from an ambulance and lynched..",
                "\"But do you condemn Hamas?\"",
                "How are we not sanctioning these scumbags? This is insane.",
                "In other news, Zionism continues to ruin the lives of millions while the world watches in effective silence.",
                "\"arrested\" \n\nJust like how it's Israeli \"hostages\" and Palestinian  \"prisoners\"",
                "Free Palestine and Fuck the IDF & Netanyahu"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "HOT",
            "title": "Woman says United Airlines crew tried to make her remove son's ventilator",
            "external_url": "https://www.nbcnews.com/news/us-news/woman-united-airlines-crew-tried-make-remove-sons-ventilator-rcna197695",
            "upvotes": 13492,
            "date": "03/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-01/250108-united-airlines-ch-1424-5c7329.jpg",
            "top_comments": [
                "> United said it has contacted Sotomayor \"to address her concerns and apologized for any frustration she may have experienced.\" The airline did not provide further details.\n\n\n> Sotomayor told NBC...the airline’s apology “was not sincere.”\n\n\nObviously, because that wasn't a real apology.  \"I'm sorry you felt bad\" is not an acknowledgement of any wrongdoing.  \n\n\nThat said, they have to know they are toast if they are sued over this so maybe not admitting wrongdoing is part of their litigation damage control.  She even went the extra mile \"she shared the documentation with the airline before the trip and that the airline cleared her son's medical equipment with no problem.\"  Combine that with the flight attendants providing B.S. medical advice that the son would \"be OK until we're in the air at a high enough altitude.\"  This whole incident stinks.",
                "United Airlines 🤜🤛 United Healthcare\n\n\"One way or another that two-year old has to go.\"",
                "This is actually nuts. The whole plane crew working together really trying to kill that kid",
                "My baseline for United customer service is \"better or worse than beating up a doctor and dragging him off the plane?\"",
                "Ma'am, he'll need that to live.",
                "Sounds like the flight attendants need to attend a little training course.",
                "Wow. It’s a trach tube not an earring. Thank God the mom stuck to her documentation and did not take away her son’s lifeline until they got to cruising altitude.",
                "It’s like they have a quota to kill and maim folks",
                "So many of these crazy stories come from United Airlines",
                "I’m just thinking about that poor child just trying to survive the flight and the audacity of an airline attendant to suggest he would be ok without oxygen is insane. Hopefully she makes millions in her lawsuit and have plenty of funds to take care of herself and her child."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Austin Tesla dealership bomb investigation; suspicious devices found",
            "external_url": "https://www.fox7austin.com/news/austin-tesla-dealership-bomb-investigation-suspicious-devices-found",
            "upvotes": 1992,
            "date": "03/24/2025",
            "thumbnail": "https://images.foxtv.com/static.fox7austin.com/www.fox7austin.com/content/uploads/2025/03/1280/720/tesla-showroom-incident-ktbceme001_11_05_23.mpg_ktbca579_132.mpg_.11_06_01_22.still001.jpg?ve=1&tl=1",
            "top_comments": [
                "Like Tesla dealerships aren't covered in cameras?",
                "Since this is Texas, I'm going to assume Ken Paxton paid to set this up.",
                "This reminds me of the time Trump said, \"He who saves his country does not violate any law.\"",
                "Looks like the reichstag fire will be at a Tesla dealership this time.",
                "That’s just a Roman Firework.",
                "Are they sure the people weren't just tourists looking at the showroom?",
                "Those aren't bombs, they're just Cybertrucks. I understand why someone might confuse the two",
                "Remember that time White Nationalist were caught breaking into AutoZone during the Floyd protests?    Or that White Nationalist started firebombing Police buildings, just so BLM protesters would get blamed for it.\n\n[Source](https://abcnews.go.com/US/man-helped-ignite-george-floyd-riots-identified-white/story?id=72051536)\n\nAnd \n\n[This](https://www.voanews.com/a/usa_whos-behind-violence-george-floyd-protests-us/6190522.html)\n\nOh and this [ONE](https://theblackwallsttimes.com/2021/10/08/white-supremacist-admits-to-firing-ak-47-into-minneapolis-police-station-during-george-floyd-protests/)\n\nDon’t be fooled again into this this is Anti-Tesla peeps, could just be more the same people trying to start a war.  Fooling POTUS into doing what he claims he will do to anyone that protests.   Sending the against their will to El Salvador.",
                "The peacefulness is getting ramped up again",
                "None of them exploded, false flag?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Bumble Bee sued by deep-sea crew who say they were forced into ‘fishing boat slavery’",
            "external_url": "https://www.cnn.com/2025/03/21/business/bumble-bee-forced-labor-fishing-lawsuit-intl-hnk/index.html",
            "upvotes": 4442,
            "date": "03/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/greenpeace-2.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> Last year, Bumble Bee agreed to remove claims of a “fair and safe supply chain” and “fair and responsible working conditions” from its website, social media and other advertising as part of a settlement with Global Labor Justice-International Labor Rights Forum. \n\n\"Oh my god, he admit it!\"",
                "I remember reading how bad it was in shrimp fishing side but its kinda obvious its more wide spread in fishing industry.\n\nOrganised crime is deep in agriculture and fishing and people with debts or just trafficked get caught up in it. Larger companies dont care or turned blind eye to their suppliers or where they get their catch. The scale of demand makes it easier too. If theres money to be made it’s corrupt easily with no oversight\n\nEvery country is one civil war or collapse away to having its population picked off by slavers when fleeing borders",
                "Sadly, [this isn't new](https://www.npr.org/2016/09/13/493801034/ap-report-exposes-slave-like-conditions-on-hawaii-fishing-fleets). The US [fought a war](https://www.archives.gov/publications/prologue/2012/summer/1812-impressment.html) over it as a matter of fact.",
                "Yikes. It’s dolphin safe but not fisherman safe. ",
                "\"Pardon me, your slavery is showing. Bumble Bee tuna!\"",
                "It's insane that, at most, Bumble Bee will face *civil* penalties. They turned a blind eye to criminal acts.",
                "What the fuck. Well no reason to buy their brand ever again, fucking slavers.",
                "Bumble Bee is really dreadful. Their CEO was sentenced to prison awhile back. And I know a worker was killed in one of their canning facilities. https://www.justice.gov/archives/opa/pr/former-bumble-bee-ceo-sentenced-prison-fixing-prices-canned-tuna",
                "Shrimp is another big one. I recall seeing a documentary on slave vessels for shrimp. Migrants in south east Asia get kidnapped and you either slave away or get beaten or thrown overboard.",
                "But line on index funds must go up."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "The U.S. is not prepared to win an economic war against China-built containerships, farmers, ocean carriers warn",
            "external_url": "https://www.cnbc.com/2025/03/24/us-not-prepared-to-win-economic-war-against-china-built-containerships.html",
            "upvotes": 754,
            "date": "03/24/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108120335-1742832282349-gettyimages-2094114700-vcg111486238545.jpeg?v=1742832321&w=1920&h=1080",
            "top_comments": [
                "> The U.S. is considering steep fines on containerships made in China as a way to help revive domestic shipbuilding.\n\n\nJesus christ, they really think they can tariff their way out of this problem. They're so fucking stupid it's astounding.",
                "The Trump Strategy appears to be to hold down China and other countries so as to give the appearance that America is great again.  But the truth is that it is fake and hurts to real progress of this world.",
                "This administration is weakening the U.S. to be lapdogs to Putin and Xi going forward. It’s a shame too many Americans are stuck with their Facebook feeds and FOX News on TV to realize that",
                "Trump is the WORST leader in the world",
                "Global trade is too big to fail. Not a great bone to pick.",
                "The main reason the United States won't win anything are because of the \"elite geniuses\" at the helm of the government. ***NONE*** of them \"care\", for America.",
                "I don't think winning is the goal.  I think the goal is weakening the USA.",
                "I guess a 25% tarrif on steel is great for shipbuilders. They just need to build ship out of wood like in the good days.  \nOh fuck there's tarifs on that too?",
                "Meanwhile most of the US is just going about their lives eating ,sleeping & working like normal.\n\nI'm just waiting on Thursday , it's opening day. \n\nWhats everyone else waiting for this week?",
                "They really think that everything they tariff will magically be produced domestically huh. While simultaneously waging war on legal/illegal immigrants, announcing that they want to annex their neighbors, destroying social services, FDA, education, etc. What a bunch of chucklefucks."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "FBI launches Tesla threats task force",
            "external_url": "https://www.cnbc.com/2025/03/24/fbi-tesla-elon-musk-task-force-threats-trump-doge.html",
            "upvotes": 289,
            "date": "03/24/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118254-1742392318191-gettyimages-2205773069-em043847_2025031824339609.jpeg?v=1742844317&w=1920&h=1080",
            "top_comments": [
                "Did the FBI just become mall cops?",
                "“If you touch my boyfriend’s car you’re gonna regret it hugely!” Donald Trump",
                "They should launch a task force to look into the crimes committed by musk and the missing money in teslas balance sheet",
                "And suddenly it’s ok to weaponize them when your side controls the weapon…",
                "Attack the government to stage a hostile takeover? Pardoned and lauded by idiot president.   \n\nSpray paint a car? Domestic terrorist. \n\nIdiots. The lot of them.",
                "Gotta protect the Oligarchs companies but don’t worry about massive breaches of National Security.",
                "Your tax dollars at work.",
                "Sorry kids - we could pay attention to people telling us that their neighbor is outside screaming they’re going to kill every child in the local school and has enough guns to make the Republican convention jizz just at the sight of it -\n\nBut a billionaire has their property threatened. And since police are descended from the old slave catchers who protected people’s “property” what else can we do - actually give a shit about child safety? \n\nWe have a rich ketamine addict to protect from his awful actions by hurting you!",
                "Ah, diverting the FBI to a new task that's not about any texts, huh?\n\n\"This is not a national security threat. *This* is!\"",
                "Fix kids getting killed by guns, Nope.\n\nThe company of an unelected Nazi co-president who wants your parents or grandparents homeless; FIX IT NOW"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Airlines threaten Heathrow with legal action",
            "external_url": "https://news.sky.com/story/airlines-threaten-heathrow-with-legal-action-13335133",
            "upvotes": 593,
            "date": "03/24/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-heathrow-plane_6865974.jpg?20250324184037",
            "top_comments": [
                "TL;DR: Airlines want money for time they couldn't fly during a fire at the airport.",
                "This seems odd because the fire wasn't at the airport- it was at a large electrical substation that also served surrounding businesses and homes.  \n\nHeathrow really is a victim here not a cause.",
                "Do people not understand how legal stuff works? They have to sue the airport for the airports insurance to kick in. When the doctor fucks up you sue the doctor and then their malpractice insurance kicks in. That’s just the way things are done.",
                "Best I can do is a $10 meal voucher.",
                "I hope the airport tells them, “sorry, you’re SOL—we’re calling it an ‘Act of God.’” 🤷‍♀️",
                "I hate airlines as much as anyone but they paid for a time slot they did not receive. Why aren't they being refunded?",
                "Why should airlines lose millions because Heathrow couldn’t organise decent backup power for events like this? \n\nHeathrow uses less power than an amazon data centre and you wouldn’t find an amazon data centre going down if power goes out at one substation.",
                "Heathrow should be liable to the airlines, per their contractual agreement to provide a service/slot. And Heathrow should have insurance to cover instances like this. \n\nThat’s the way the world works.",
                "I flew through Heathrow a few months ago. Horrendous airport. All other airports around the world have advanced except Heathrow it seems. They are stuck in 2002. Broken screens, a thirty minute bus ride stuffed to the brim with people just to get from one terminal to another. Dirt on the floors, aggressive staff. Fuck me it was bad",
                "Heaven forbid a disaster or possible attack hurt billion dollar companies profit margin for a day"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Turkey announces 1,133 arrests have been made in relation to protests.",
            "external_url": "https://www.bbc.co.uk/news/live/cq6yde479gdt?post=asset%3Ae185b269-c225-4fbc-802f-6746e2130039#post",
            "upvotes": 1797,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e839/live/bec7c780-08d7-11f0-97d3-37df2b293ed1.jpg",
            "top_comments": [
                "How long until these headlines are about USA?",
                "\" . . . Arrests have been made in ~~relation to protests~~. Fascist Crackdown.",
                "Is it coup season in Turkey already?",
                "The photos from the protests have been astounding.",
                "Turkey, as long as Erdogan and his party is in power, has no place in the EU. It’s a semi-dictatorship and would never live up to the rules in the Maastricht Treaty. Maybe after at least one peaceful transfer of power to a free opposition.",
                "But they gave us eggs! Can't be that bad /s",
                "Shall we… applaud? 👏\n\nOk that’s enough\n\nEdit: it was one Applaus for the government with an /s… not as obvious as I thought."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "South Korean court overturns impeachment of Prime Minister Han, reinstating him as acting president",
            "external_url": "https://apnews.com/article/south-korea-impeachment-han-ducksoo-20daed0fb3c90c02ca229c977d230b06",
            "upvotes": 5994,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This guy isn't Yoon (The president who started the Martial Law Order), he is up for sentencing next. If he doesn't get impeached, then shit will go down.",
                "Context on the quorum bit, since AP doesn’t provide it - Korea’s national assembly has 300 seats. A simple majority is enough to impeach most officials, but a 2/3 majority is required to impeach the president. It was (and maybe still is) an open question what the requirement was to impeach an acting president - 151 because he is the prime minister, or 200 because he is (acting) president? Apparently some of the justices think it’s the latter, (edit) but it seems like the majority ruled that it’s 151.\n\nThis feels like it was the weakest of the cases, for what it’s worth. He was consistently saying he was against the martial law, and it seems like they failed to prove he was actually involved with it.",
                ">On Monday, seven of the court’s eight justices overturned or dismissed Han’s impeachment. They ruled the accusations against him weren’t against the law or weren’t serious enough to remove him from office or his impeachment motion didn’t even meet a required quorum when it passed through the assembly.\n\nNot having a quorum seems sketchy. The other parts of South Korean law, I can't comment on.",
                "The amount of people who are r/confidentlyincorrect here is astonishing...",
                "If you didn't read the article before commenting, you're part of the problem.",
                "Not the guy most people are assuming, but very interesting that the court can overturn an impeachment.",
                "Wow the world is going crazy",
                "[removed]",
                "So I don't know a l9t about the court system in Korea. Is this outrageous, or is this something that sometimes happens?",
                "Interesting that the court is ruling on matters of Parliamentary procedure. My reference point is westminster systems (eg. AU, UK) where the high court wouldn't want to touch parliamentary rules with a 20ft pole - I think they'd just tell parliament to vote on a point of order to decide what their own rules are."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "The U.S. is not prepared to win an economic war against China-built containerships, farmers, ocean carriers warn",
            "external_url": "https://www.cnbc.com/2025/03/24/us-not-prepared-to-win-economic-war-against-china-built-containerships.html",
            "upvotes": 752,
            "date": "03/24/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108120335-1742832282349-gettyimages-2094114700-vcg111486238545.jpeg?v=1742832321&w=1920&h=1080",
            "top_comments": [
                "> The U.S. is considering steep fines on containerships made in China as a way to help revive domestic shipbuilding.\n\n\nJesus christ, they really think they can tariff their way out of this problem. They're so fucking stupid it's astounding.",
                "The Trump Strategy appears to be to hold down China and other countries so as to give the appearance that America is great again.  But the truth is that it is fake and hurts to real progress of this world.",
                "This administration is weakening the U.S. to be lapdogs to Putin and Xi going forward. It’s a shame too many Americans are stuck with their Facebook feeds and FOX News on TV to realize that",
                "Trump is the WORST leader in the world",
                "Global trade is too big to fail. Not a great bone to pick.",
                "The main reason the United States won't win anything are because of the \"elite geniuses\" at the helm of the government. ***NONE*** of them \"care\", for America.",
                "I don't think winning is the goal.  I think the goal is weakening the USA.",
                "I guess a 25% tarrif on steel is great for shipbuilders. They just need to build ship out of wood like in the good days.  \nOh fuck there's tarifs on that too?",
                "Meanwhile most of the US is just going about their lives eating ,sleeping & working like normal.\n\nI'm just waiting on Thursday , it's opening day. \n\nWhats everyone else waiting for this week?",
                "They really think that everything they tariff will magically be produced domestically huh. While simultaneously waging war on legal/illegal immigrants, announcing that they want to annex their neighbors, destroying social services, FDA, education, etc. What a bunch of chucklefucks."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "New fire maps increase hazard zones in L.A. and Southern California by 3.5 million acres",
            "external_url": "https://www.latimes.com/environment/story/2025-03-24/new-fire-hazard-maps-for-los-angeles-and-southern-california",
            "upvotes": 58,
            "date": "03/24/2025",
            "thumbnail": "https://ca-times.brightspotcdn.com/dims4/default/139de81/2147483647/strip/true/crop/5121x2689+0+363/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F07%2F80%2Ffb1802b640ed8c471a53c98d6f9a%2F1499583-me-protest-altadena-golf-course-jja-045.jpg",
            "top_comments": [
                "This will have real consequences...\n\n>>The hazard severity zone maps are referenced in more than 50 sections of California law. They require homeowners in “high” and “very high” hazard zones to follow fire-safe building codes for new construction — including installing multi-pane windows that are less likely to break in extreme heat and covering vents and other openings to prevent embers from entering the house. Homeowners in the “very high” zones must maintain defensible space around their properties and disclose the “very high” status when they put their houses up for sale",
                "My house is just barely outside of the \"high fire risk\" zone. This time. But if there is another one like the Eaton Fire, I don't think I will be so lucky."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "FBI launches Tesla threats task force",
            "external_url": "https://www.cnbc.com/2025/03/24/fbi-tesla-elon-musk-task-force-threats-trump-doge.html",
            "upvotes": 292,
            "date": "03/24/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118254-1742392318191-gettyimages-2205773069-em043847_2025031824339609.jpeg?v=1742844317&w=1920&h=1080",
            "top_comments": [
                "Did the FBI just become mall cops?",
                "“If you touch my boyfriend’s car you’re gonna regret it hugely!” Donald Trump",
                "They should launch a task force to look into the crimes committed by musk and the missing money in teslas balance sheet",
                "And suddenly it’s ok to weaponize them when your side controls the weapon…",
                "Attack the government to stage a hostile takeover? Pardoned and lauded by idiot president.   \n\nSpray paint a car? Domestic terrorist. \n\nIdiots. The lot of them.",
                "Gotta protect the Oligarchs companies but don’t worry about massive breaches of National Security.",
                "Your tax dollars at work.",
                "Sorry kids - we could pay attention to people telling us that their neighbor is outside screaming they’re going to kill every child in the local school and has enough guns to make the Republican convention jizz just at the sight of it -\n\nBut a billionaire has their property threatened. And since police are descended from the old slave catchers who protected people’s “property” what else can we do - actually give a shit about child safety? \n\nWe have a rich ketamine addict to protect from his awful actions by hurting you!",
                "Ah, diverting the FBI to a new task that's not about any texts, huh?\n\n\"This is not a national security threat. *This* is!\"",
                "Fix kids getting killed by guns, Nope.\n\nThe company of an unelected Nazi co-president who wants your parents or grandparents homeless; FIX IT NOW"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Oscar-winning Palestinian director attacked by Israeli settlers and arrested",
            "external_url": "https://www.theguardian.com/world/2025/mar/24/oscar-winning-palestinian-director-attacked-by-israeli-settlers-and-arrested",
            "upvotes": 6317,
            "date": "03/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1c062253020fbc7665681aec4d4423d7d450f595/0_247_1365_819/master/1365.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=94da34fd8ec7e1b54b4756a49420ead3",
            "top_comments": [
                "To clarify, he was apparently attacked by Israeli settlers at his home and was subsequently detained and disappeared by the Israeli military. \n\nHis Israeli co-director stated that the attack by the settlers left Ballal bleeding from the head. When an ambulance arrived for him, Israeli soldiers prevented medics from treating him, pulled him out of the ambulance, blindfolded him, forced him and another attack victim into a car, and drove away.\n\n[The Associated Press](https://apnews.com/article/no-other-land-oscar-israel-palestinians-084c63f33e748a3279646759e9b705c2) is reporting that they have received verified video showing part of the attack, which targeted both Jewish Israeli and Palestinian peace activists alike:\n\n> Video provided by the Center for Jewish Nonviolence showed a masked settler shoving and swinging his fists at two activists from the group in a dusty field at night. The activists rush back to their car. “Get in, get in!” one shouts, and they duck inside as the thuds of rocks being thrown can be heard. “Car window was broken,” the driver says as they drive off.\n\nThe Israeli military has refused to comment or provide any information about Ballal’s whereabouts.\n\nEdit: [This](https://www.reddit.com/r/Fauxmoi/s/mBJ3EfPMEc) is purportedly video of the attack from the peace activists’ perspective.",
                "Talk about quite literally hammering home the point of the movie.",
                "Can we stop calling them settlers? They’re invaders.",
                "This is one of the biggest Hollywood stories in the century.",
                "“Arrested” reports are saying he was taken from an ambulance and lynched..",
                "\"But do you condemn Hamas?\"",
                "How are we not sanctioning these scumbags? This is insane.",
                "In other news, Zionism continues to ruin the lives of millions while the world watches in effective silence.",
                "\"arrested\" \n\nJust like how it's Israeli \"hostages\" and Palestinian  \"prisoners\"",
                "Free Palestine and Fuck the IDF & Netanyahu"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Top US officials appeared to message a journalist Houthi strike plans",
            "external_url": "https://www.bbc.com/news/articles/cy4v3ndg28jo",
            "upvotes": 17753,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/9379/live/b4019cf0-08db-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "The defense department has [confirmed.](https://abcnews.go.com/Politics/trump-officials-accidentally-shared-yemen-war-plans-group/story?id=120106043)\n\n\nInsane",
                "Not appeared, they DID message a journalist by mistake on their group text chain discussing war plans.",
                ">Jeffrey Goldberg, editor-in-chief of The Atlantic, [reported](https://www.theatlantic.com/politics/archive/2025/03/trump-administration-accidentally-texted-me-its-war-plans/682151) on Monday that he was added to a Signal message group which included accounts labelled as White House National Security Adviser Michael Waltz and Vice-President JD Vance.\n\nWhy are updates on military operations being communicated over Signal rather than secure DoD communications?\n\nEdit:  \nAnyone who remotely (and rightfully) criticized Hillary Clinton for using her own Email server should be furious about this news story.",
                "The headline really downplays the absolute fuckery of what happened here. \n\n1) Cabinet level, real-time military operational planning was being done on a commercial messaging platform instead of a secure government IS. \n\n2) They fucking didn't notice a private citizen was sitting in the group chat. \n\n\nThis is an absolutely catastrophic failure of information and operational security that puts previous scandals (Hillary emails, even Trump documents) to shame. This is unauthorized disclosure of the most sensitive government information imaginable. All of these people should be fired if not criminally charged.",
                "\"Any unauthorized release of classified information is a violation of the law and will be treated as such.\"\n\n-Tulsi Gabbard 3/14/25\n\nFor those keeping track that is the day before these events took place and she's on the group chat on question.",
                "Old whiskey finger hegseth at it again. To be fair, when you’re that drunk, names just blur together in your phone. ",
                "Wow. I’m stunned that the president of the US, Elon Musk wasn’t added to this amateur hour group chat too. \n\nHe’s probably insulted. ",
                "Thank you, Trump voters, for enabling these many opportunities to see that your people are as embarrassing behind closed doors as they are publicly. \n\n\nIt's going to take decades to recover from just the past 2 months.  Pretty much an entire term to go.",
                "From the story in the Atlantic:\n\n>Brian Hughes, the spokesman for the National Security Council, responded two hours later, confirming the veracity of the Signal group. “This appears to be an authentic message chain, and we are reviewing how an inadvertent number was added to the chain,” Hughes wrote. “The thread is a demonstration of the deep and thoughtful policy coordination between senior officials.”\n\nThese assholes were using goddamned emojis.",
                "Anyone have odds that the administration tries to blame the journalist?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Austin Tesla dealership bomb investigation; suspicious devices found",
            "external_url": "https://www.fox7austin.com/news/austin-tesla-dealership-bomb-investigation-suspicious-devices-found",
            "upvotes": 1991,
            "date": "03/24/2025",
            "thumbnail": "https://images.foxtv.com/static.fox7austin.com/www.fox7austin.com/content/uploads/2025/03/1280/720/tesla-showroom-incident-ktbceme001_11_05_23.mpg_ktbca579_132.mpg_.11_06_01_22.still001.jpg?ve=1&tl=1",
            "top_comments": [
                "Like Tesla dealerships aren't covered in cameras?",
                "Since this is Texas, I'm going to assume Ken Paxton paid to set this up.",
                "This reminds me of the time Trump said, \"He who saves his country does not violate any law.\"",
                "Looks like the reichstag fire will be at a Tesla dealership this time.",
                "That’s just a Roman Firework.",
                "Are they sure the people weren't just tourists looking at the showroom?",
                "Those aren't bombs, they're just Cybertrucks. I understand why someone might confuse the two",
                "Remember that time White Nationalist were caught breaking into AutoZone during the Floyd protests?    Or that White Nationalist started firebombing Police buildings, just so BLM protesters would get blamed for it.\n\n[Source](https://abcnews.go.com/US/man-helped-ignite-george-floyd-riots-identified-white/story?id=72051536)\n\nAnd \n\n[This](https://www.voanews.com/a/usa_whos-behind-violence-george-floyd-protests-us/6190522.html)\n\nOh and this [ONE](https://theblackwallsttimes.com/2021/10/08/white-supremacist-admits-to-firing-ak-47-into-minneapolis-police-station-during-george-floyd-protests/)\n\nDon’t be fooled again into this this is Anti-Tesla peeps, could just be more the same people trying to start a war.  Fooling POTUS into doing what he claims he will do to anyone that protests.   Sending the against their will to El Salvador.",
                "The peacefulness is getting ramped up again",
                "None of them exploded, false flag?"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Airlines threaten Heathrow with legal action",
            "external_url": "https://news.sky.com/story/airlines-threaten-heathrow-with-legal-action-13335133",
            "upvotes": 593,
            "date": "03/24/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-heathrow-plane_6865974.jpg?20250324184037",
            "top_comments": [
                "TL;DR: Airlines want money for time they couldn't fly during a fire at the airport.",
                "This seems odd because the fire wasn't at the airport- it was at a large electrical substation that also served surrounding businesses and homes.  \n\nHeathrow really is a victim here not a cause.",
                "Do people not understand how legal stuff works? They have to sue the airport for the airports insurance to kick in. When the doctor fucks up you sue the doctor and then their malpractice insurance kicks in. That’s just the way things are done.",
                "Best I can do is a $10 meal voucher.",
                "I hope the airport tells them, “sorry, you’re SOL—we’re calling it an ‘Act of God.’” 🤷‍♀️",
                "I hate airlines as much as anyone but they paid for a time slot they did not receive. Why aren't they being refunded?",
                "Why should airlines lose millions because Heathrow couldn’t organise decent backup power for events like this? \n\nHeathrow uses less power than an amazon data centre and you wouldn’t find an amazon data centre going down if power goes out at one substation.",
                "Heathrow should be liable to the airlines, per their contractual agreement to provide a service/slot. And Heathrow should have insurance to cover instances like this. \n\nThat’s the way the world works.",
                "I flew through Heathrow a few months ago. Horrendous airport. All other airports around the world have advanced except Heathrow it seems. They are stuck in 2002. Broken screens, a thirty minute bus ride stuffed to the brim with people just to get from one terminal to another. Dirt on the floors, aggressive staff. Fuck me it was bad",
                "Heaven forbid a disaster or possible attack hurt billion dollar companies profit margin for a day"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Bumble Bee sued by deep-sea crew who say they were forced into ‘fishing boat slavery’",
            "external_url": "https://www.cnn.com/2025/03/21/business/bumble-bee-forced-labor-fishing-lawsuit-intl-hnk/index.html",
            "upvotes": 4439,
            "date": "03/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/greenpeace-2.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> Last year, Bumble Bee agreed to remove claims of a “fair and safe supply chain” and “fair and responsible working conditions” from its website, social media and other advertising as part of a settlement with Global Labor Justice-International Labor Rights Forum. \n\n\"Oh my god, he admit it!\"",
                "I remember reading how bad it was in shrimp fishing side but its kinda obvious its more wide spread in fishing industry.\n\nOrganised crime is deep in agriculture and fishing and people with debts or just trafficked get caught up in it. Larger companies dont care or turned blind eye to their suppliers or where they get their catch. The scale of demand makes it easier too. If theres money to be made it’s corrupt easily with no oversight\n\nEvery country is one civil war or collapse away to having its population picked off by slavers when fleeing borders",
                "Sadly, [this isn't new](https://www.npr.org/2016/09/13/493801034/ap-report-exposes-slave-like-conditions-on-hawaii-fishing-fleets). The US [fought a war](https://www.archives.gov/publications/prologue/2012/summer/1812-impressment.html) over it as a matter of fact.",
                "Yikes. It’s dolphin safe but not fisherman safe. ",
                "\"Pardon me, your slavery is showing. Bumble Bee tuna!\"",
                "It's insane that, at most, Bumble Bee will face *civil* penalties. They turned a blind eye to criminal acts.",
                "What the fuck. Well no reason to buy their brand ever again, fucking slavers.",
                "Bumble Bee is really dreadful. Their CEO was sentenced to prison awhile back. And I know a worker was killed in one of their canning facilities. https://www.justice.gov/archives/opa/pr/former-bumble-bee-ceo-sentenced-prison-fixing-prices-canned-tuna",
                "Shrimp is another big one. I recall seeing a documentary on slave vessels for shrimp. Migrants in south east Asia get kidnapped and you either slave away or get beaten or thrown overboard.",
                "But line on index funds must go up."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Former Utah Rep. Mia Love, the first Black Republican woman elected to the US House, has died",
            "external_url": "https://apnews.com/article/mia-love-congress-black-republican-died-440edac7923942e9329e0224a3d053c1",
            "upvotes": 322,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Brain cancer for those who don’t click.",
                "I'm impressed Utah has ever had a black representative tbh. Looking at the census, Utah is only 1% black.",
                "May she rest in peace, and may her family find comfort and solace during their time of mourning. Regardless of her political ideology, dying at 49 from cancer is tragically unfortunate.",
                "She was only 49.  Way too young to go.  Fuck cancer",
                "Hated her politics, but no one should have to face cancer. Fuck cancer.",
                "Are they celebrating her accomplishments or calling her dei"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Man drives car into protesters outside a Tesla dealership, nobody hurt, sheriff says",
            "external_url": "https://apnews.com/article/musk-doge-tesla-trump-protest-car-9c93cf15d863359730298f2729319810",
            "upvotes": 1064,
            "date": "03/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Were they arrested, charged with terrorism and sent to El Salvador?",
                "Is this the same guy? Lol\n\nhttps://www.trumpettesusa.com/andrew-dutil-trumpster/",
                "> The protest on Saturday was interrupted when Andrew Dutil drove his vehicle onto the sidewalk full of protesters at a slow speed, forcing people to scramble out of the way to avoid the being hit, according to the Palm Beach County Sheriff’s Office.\n\n> Dutil was arrested and faces an assault charge, according to court records. An attorney who could speak on Dutil’s behalf wasn’t immediately listed in court records.\n\nBefore I read the article, I was hoping it was something like a Tesla on autonomous mode slow-rolled through a crowd of protesters, but that was not the case. Still, how is the guy facing only one assault charge and not one for every pedestrian that had to move?",
                "That *sick terrorist thug* needs to be sent to prison in El Salvador.",
                "Protesting the growing power of the oligarchy... terrorism \n\nAttempting to murder those protesters...not terrorism \n\nIt's an utterly corrupted system.",
                "I have to assume he wasn't driving a Tesla because otherwise it would have caught on fire and locked him in.",
                "What goes thru someone’s mind and thinks, “yea. This is a good idea”",
                "During the revolutions of 19th century Europe, the protestors would use whatever means they could to erect barricades.\n\nProbably something we will have to start doing here in order to protect our rights to assembly and speech",
                "Now that was a hate crime.",
                "The guy is lucky. It's Florida, lots of people there carry and it's a stand your ground state."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "The U.S. is not prepared to win an economic war against China-built containerships, farmers, ocean carriers warn",
            "external_url": "https://www.cnbc.com/2025/03/24/us-not-prepared-to-win-economic-war-against-china-built-containerships.html",
            "upvotes": 753,
            "date": "03/24/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108120335-1742832282349-gettyimages-2094114700-vcg111486238545.jpeg?v=1742832321&w=1920&h=1080",
            "top_comments": [
                "> The U.S. is considering steep fines on containerships made in China as a way to help revive domestic shipbuilding.\n\n\nJesus christ, they really think they can tariff their way out of this problem. They're so fucking stupid it's astounding.",
                "The Trump Strategy appears to be to hold down China and other countries so as to give the appearance that America is great again.  But the truth is that it is fake and hurts to real progress of this world.",
                "This administration is weakening the U.S. to be lapdogs to Putin and Xi going forward. It’s a shame too many Americans are stuck with their Facebook feeds and FOX News on TV to realize that",
                "Trump is the WORST leader in the world",
                "Global trade is too big to fail. Not a great bone to pick.",
                "The main reason the United States won't win anything are because of the \"elite geniuses\" at the helm of the government. ***NONE*** of them \"care\", for America.",
                "I don't think winning is the goal.  I think the goal is weakening the USA.",
                "I guess a 25% tarrif on steel is great for shipbuilders. They just need to build ship out of wood like in the good days.  \nOh fuck there's tarifs on that too?",
                "Meanwhile most of the US is just going about their lives eating ,sleeping & working like normal.\n\nI'm just waiting on Thursday , it's opening day. \n\nWhats everyone else waiting for this week?",
                "They really think that everything they tariff will magically be produced domestically huh. While simultaneously waging war on legal/illegal immigrants, announcing that they want to annex their neighbors, destroying social services, FDA, education, etc. What a bunch of chucklefucks."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Oscar-winning Palestinian director attacked by Israeli settlers and arrested",
            "external_url": "https://www.theguardian.com/world/2025/mar/24/oscar-winning-palestinian-director-attacked-by-israeli-settlers-and-arrested",
            "upvotes": 6309,
            "date": "03/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1c062253020fbc7665681aec4d4423d7d450f595/0_247_1365_819/master/1365.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=94da34fd8ec7e1b54b4756a49420ead3",
            "top_comments": [
                "To clarify, he was apparently attacked by Israeli settlers at his home and was subsequently detained and disappeared by the Israeli military. \n\nHis Israeli co-director stated that the attack by the settlers left Ballal bleeding from the head. When an ambulance arrived for him, Israeli soldiers prevented medics from treating him, pulled him out of the ambulance, blindfolded him, forced him and another attack victim into a car, and drove away.\n\n[The Associated Press](https://apnews.com/article/no-other-land-oscar-israel-palestinians-084c63f33e748a3279646759e9b705c2) is reporting that they have received verified video showing part of the attack, which targeted both Jewish Israeli and Palestinian peace activists alike:\n\n> Video provided by the Center for Jewish Nonviolence showed a masked settler shoving and swinging his fists at two activists from the group in a dusty field at night. The activists rush back to their car. “Get in, get in!” one shouts, and they duck inside as the thuds of rocks being thrown can be heard. “Car window was broken,” the driver says as they drive off.\n\nThe Israeli military has refused to comment or provide any information about Ballal’s whereabouts.\n\nEdit: [This](https://www.reddit.com/r/Fauxmoi/s/mBJ3EfPMEc) is purportedly video of the attack from the peace activists’ perspective.",
                "Talk about quite literally hammering home the point of the movie.",
                "Can we stop calling them settlers? They’re invaders.",
                "This is one of the biggest Hollywood stories in the century.",
                "“Arrested” reports are saying he was taken from an ambulance and lynched..",
                "\"But do you condemn Hamas?\"",
                "How are we not sanctioning these scumbags? This is insane.",
                "In other news, Zionism continues to ruin the lives of millions while the world watches in effective silence.",
                "\"arrested\" \n\nJust like how it's Israeli \"hostages\" and Palestinian  \"prisoners\"",
                "Free Palestine and Fuck the IDF & Netanyahu"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "FBI launches Tesla threats task force",
            "external_url": "https://www.cnbc.com/2025/03/24/fbi-tesla-elon-musk-task-force-threats-trump-doge.html",
            "upvotes": 291,
            "date": "03/24/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118254-1742392318191-gettyimages-2205773069-em043847_2025031824339609.jpeg?v=1742844317&w=1920&h=1080",
            "top_comments": [
                "Did the FBI just become mall cops?",
                "“If you touch my boyfriend’s car you’re gonna regret it hugely!” Donald Trump",
                "They should launch a task force to look into the crimes committed by musk and the missing money in teslas balance sheet",
                "And suddenly it’s ok to weaponize them when your side controls the weapon…",
                "Attack the government to stage a hostile takeover? Pardoned and lauded by idiot president.   \n\nSpray paint a car? Domestic terrorist. \n\nIdiots. The lot of them.",
                "Gotta protect the Oligarchs companies but don’t worry about massive breaches of National Security.",
                "Your tax dollars at work.",
                "Sorry kids - we could pay attention to people telling us that their neighbor is outside screaming they’re going to kill every child in the local school and has enough guns to make the Republican convention jizz just at the sight of it -\n\nBut a billionaire has their property threatened. And since police are descended from the old slave catchers who protected people’s “property” what else can we do - actually give a shit about child safety? \n\nWe have a rich ketamine addict to protect from his awful actions by hurting you!",
                "Ah, diverting the FBI to a new task that's not about any texts, huh?\n\n\"This is not a national security threat. *This* is!\"",
                "Fix kids getting killed by guns, Nope.\n\nThe company of an unelected Nazi co-president who wants your parents or grandparents homeless; FIX IT NOW"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Top US officials appeared to message a journalist Houthi strike plans",
            "external_url": "https://www.bbc.com/news/articles/cy4v3ndg28jo",
            "upvotes": 17760,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/9379/live/b4019cf0-08db-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "The defense department has [confirmed.](https://abcnews.go.com/Politics/trump-officials-accidentally-shared-yemen-war-plans-group/story?id=120106043)\n\n\nInsane",
                "Not appeared, they DID message a journalist by mistake on their group text chain discussing war plans.",
                ">Jeffrey Goldberg, editor-in-chief of The Atlantic, [reported](https://www.theatlantic.com/politics/archive/2025/03/trump-administration-accidentally-texted-me-its-war-plans/682151) on Monday that he was added to a Signal message group which included accounts labelled as White House National Security Adviser Michael Waltz and Vice-President JD Vance.\n\nWhy are updates on military operations being communicated over Signal rather than secure DoD communications?\n\nEdit:  \nAnyone who remotely (and rightfully) criticized Hillary Clinton for using her own Email server should be furious about this news story.",
                "The headline really downplays the absolute fuckery of what happened here. \n\n1) Cabinet level, real-time military operational planning was being done on a commercial messaging platform instead of a secure government IS. \n\n2) They fucking didn't notice a private citizen was sitting in the group chat. \n\n\nThis is an absolutely catastrophic failure of information and operational security that puts previous scandals (Hillary emails, even Trump documents) to shame. This is unauthorized disclosure of the most sensitive government information imaginable. All of these people should be fired if not criminally charged.",
                "\"Any unauthorized release of classified information is a violation of the law and will be treated as such.\"\n\n-Tulsi Gabbard 3/14/25\n\nFor those keeping track that is the day before these events took place and she's on the group chat on question.",
                "Old whiskey finger hegseth at it again. To be fair, when you’re that drunk, names just blur together in your phone. ",
                "Wow. I’m stunned that the president of the US, Elon Musk wasn’t added to this amateur hour group chat too. \n\nHe’s probably insulted. ",
                "Thank you, Trump voters, for enabling these many opportunities to see that your people are as embarrassing behind closed doors as they are publicly. \n\n\nIt's going to take decades to recover from just the past 2 months.  Pretty much an entire term to go.",
                "From the story in the Atlantic:\n\n>Brian Hughes, the spokesman for the National Security Council, responded two hours later, confirming the veracity of the Signal group. “This appears to be an authentic message chain, and we are reviewing how an inadvertent number was added to the chain,” Hughes wrote. “The thread is a demonstration of the deep and thoughtful policy coordination between senior officials.”\n\nThese assholes were using goddamned emojis.",
                "Anyone have odds that the administration tries to blame the journalist?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Austin Tesla dealership bomb investigation; suspicious devices found",
            "external_url": "https://www.fox7austin.com/news/austin-tesla-dealership-bomb-investigation-suspicious-devices-found",
            "upvotes": 1993,
            "date": "03/24/2025",
            "thumbnail": "https://images.foxtv.com/static.fox7austin.com/www.fox7austin.com/content/uploads/2025/03/1280/720/tesla-showroom-incident-ktbceme001_11_05_23.mpg_ktbca579_132.mpg_.11_06_01_22.still001.jpg?ve=1&tl=1",
            "top_comments": [
                "Like Tesla dealerships aren't covered in cameras?",
                "Since this is Texas, I'm going to assume Ken Paxton paid to set this up.",
                "This reminds me of the time Trump said, \"He who saves his country does not violate any law.\"",
                "Looks like the reichstag fire will be at a Tesla dealership this time.",
                "That’s just a Roman Firework.",
                "Are they sure the people weren't just tourists looking at the showroom?",
                "Those aren't bombs, they're just Cybertrucks. I understand why someone might confuse the two",
                "Remember that time White Nationalist were caught breaking into AutoZone during the Floyd protests?    Or that White Nationalist started firebombing Police buildings, just so BLM protesters would get blamed for it.\n\n[Source](https://abcnews.go.com/US/man-helped-ignite-george-floyd-riots-identified-white/story?id=72051536)\n\nAnd \n\n[This](https://www.voanews.com/a/usa_whos-behind-violence-george-floyd-protests-us/6190522.html)\n\nOh and this [ONE](https://theblackwallsttimes.com/2021/10/08/white-supremacist-admits-to-firing-ak-47-into-minneapolis-police-station-during-george-floyd-protests/)\n\nDon’t be fooled again into this this is Anti-Tesla peeps, could just be more the same people trying to start a war.  Fooling POTUS into doing what he claims he will do to anyone that protests.   Sending the against their will to El Salvador.",
                "The peacefulness is getting ramped up again",
                "None of them exploded, false flag?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Bumble Bee sued by deep-sea crew who say they were forced into ‘fishing boat slavery’",
            "external_url": "https://www.cnn.com/2025/03/21/business/bumble-bee-forced-labor-fishing-lawsuit-intl-hnk/index.html",
            "upvotes": 4436,
            "date": "03/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/greenpeace-2.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> Last year, Bumble Bee agreed to remove claims of a “fair and safe supply chain” and “fair and responsible working conditions” from its website, social media and other advertising as part of a settlement with Global Labor Justice-International Labor Rights Forum. \n\n\"Oh my god, he admit it!\"",
                "I remember reading how bad it was in shrimp fishing side but its kinda obvious its more wide spread in fishing industry.\n\nOrganised crime is deep in agriculture and fishing and people with debts or just trafficked get caught up in it. Larger companies dont care or turned blind eye to their suppliers or where they get their catch. The scale of demand makes it easier too. If theres money to be made it’s corrupt easily with no oversight\n\nEvery country is one civil war or collapse away to having its population picked off by slavers when fleeing borders",
                "Sadly, [this isn't new](https://www.npr.org/2016/09/13/493801034/ap-report-exposes-slave-like-conditions-on-hawaii-fishing-fleets). The US [fought a war](https://www.archives.gov/publications/prologue/2012/summer/1812-impressment.html) over it as a matter of fact.",
                "Yikes. It’s dolphin safe but not fisherman safe. ",
                "\"Pardon me, your slavery is showing. Bumble Bee tuna!\"",
                "It's insane that, at most, Bumble Bee will face *civil* penalties. They turned a blind eye to criminal acts.",
                "What the fuck. Well no reason to buy their brand ever again, fucking slavers.",
                "Bumble Bee is really dreadful. Their CEO was sentenced to prison awhile back. And I know a worker was killed in one of their canning facilities. https://www.justice.gov/archives/opa/pr/former-bumble-bee-ceo-sentenced-prison-fixing-prices-canned-tuna",
                "Shrimp is another big one. I recall seeing a documentary on slave vessels for shrimp. Migrants in south east Asia get kidnapped and you either slave away or get beaten or thrown overboard.",
                "But line on index funds must go up."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Airlines threaten Heathrow with legal action",
            "external_url": "https://news.sky.com/story/airlines-threaten-heathrow-with-legal-action-13335133",
            "upvotes": 591,
            "date": "03/24/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-heathrow-plane_6865974.jpg?20250324184037",
            "top_comments": [
                "TL;DR: Airlines want money for time they couldn't fly during a fire at the airport.",
                "This seems odd because the fire wasn't at the airport- it was at a large electrical substation that also served surrounding businesses and homes.  \n\nHeathrow really is a victim here not a cause.",
                "Do people not understand how legal stuff works? They have to sue the airport for the airports insurance to kick in. When the doctor fucks up you sue the doctor and then their malpractice insurance kicks in. That’s just the way things are done.",
                "Best I can do is a $10 meal voucher.",
                "I hope the airport tells them, “sorry, you’re SOL—we’re calling it an ‘Act of God.’” 🤷‍♀️",
                "I hate airlines as much as anyone but they paid for a time slot they did not receive. Why aren't they being refunded?",
                "Why should airlines lose millions because Heathrow couldn’t organise decent backup power for events like this? \n\nHeathrow uses less power than an amazon data centre and you wouldn’t find an amazon data centre going down if power goes out at one substation.",
                "Heathrow should be liable to the airlines, per their contractual agreement to provide a service/slot. And Heathrow should have insurance to cover instances like this. \n\nThat’s the way the world works.",
                "I flew through Heathrow a few months ago. Horrendous airport. All other airports around the world have advanced except Heathrow it seems. They are stuck in 2002. Broken screens, a thirty minute bus ride stuffed to the brim with people just to get from one terminal to another. Dirt on the floors, aggressive staff. Fuck me it was bad",
                "Heaven forbid a disaster or possible attack hurt billion dollar companies profit margin for a day"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Three men found guilty of plotting to murder £54m Securitas robber Paul Allen",
            "external_url": "https://news.sky.com/story/three-guilty-of-plot-to-murder-54m-securitas-heist-gang-member-13330360",
            "upvotes": 522,
            "date": "03/24/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-paul-allen-securitas_6858758.jpg?20250316161011",
            "top_comments": [
                "Let’s see Paul Allen’s card",
                "I'm left speculating about what the motive was here. Where is the £54M now? Was the attempted hit related to that or some other job they crossed paths over?",
                "These all read like a movie plot",
                "Try getting a reservation at Dorsia now you stupid fucking bastard",
                "But I had dinner with Paul Allen in London.",
                "Does this Paul Allen like Huey Lewis and The News?",
                "Try getting a reservation at Dorsia now you stupid fucking bastards!",
                "I came to see if people were referencing the movie. Reddit does not disappoint.",
                "Linen textured business cards cited as motive for hit.",
                "You like huey Lewis and the news?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Woman says United Airlines crew tried to make her remove son's ventilator",
            "external_url": "https://www.nbcnews.com/news/us-news/woman-united-airlines-crew-tried-make-remove-sons-ventilator-rcna197695",
            "upvotes": 13496,
            "date": "03/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-01/250108-united-airlines-ch-1424-5c7329.jpg",
            "top_comments": [
                "> United said it has contacted Sotomayor \"to address her concerns and apologized for any frustration she may have experienced.\" The airline did not provide further details.\n\n\n> Sotomayor told NBC...the airline’s apology “was not sincere.”\n\n\nObviously, because that wasn't a real apology.  \"I'm sorry you felt bad\" is not an acknowledgement of any wrongdoing.  \n\n\nThat said, they have to know they are toast if they are sued over this so maybe not admitting wrongdoing is part of their litigation damage control.  She even went the extra mile \"she shared the documentation with the airline before the trip and that the airline cleared her son's medical equipment with no problem.\"  Combine that with the flight attendants providing B.S. medical advice that the son would \"be OK until we're in the air at a high enough altitude.\"  This whole incident stinks.",
                "United Airlines 🤜🤛 United Healthcare\n\n\"One way or another that two-year old has to go.\"",
                "This is actually nuts. The whole plane crew working together really trying to kill that kid",
                "My baseline for United customer service is \"better or worse than beating up a doctor and dragging him off the plane?\"",
                "Ma'am, he'll need that to live.",
                "Sounds like the flight attendants need to attend a little training course.",
                "Wow. It’s a trach tube not an earring. Thank God the mom stuck to her documentation and did not take away her son’s lifeline until they got to cruising altitude.",
                "It’s like they have a quota to kill and maim folks",
                "So many of these crazy stories come from United Airlines",
                "I’m just thinking about that poor child just trying to survive the flight and the audacity of an airline attendant to suggest he would be ok without oxygen is insane. Hopefully she makes millions in her lawsuit and have plenty of funds to take care of herself and her child."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Turkey announces 1,133 arrests have been made in relation to protests.",
            "external_url": "https://www.bbc.co.uk/news/live/cq6yde479gdt?post=asset%3Ae185b269-c225-4fbc-802f-6746e2130039#post",
            "upvotes": 1797,
            "date": "03/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e839/live/bec7c780-08d7-11f0-97d3-37df2b293ed1.jpg",
            "top_comments": [
                "How long until these headlines are about USA?",
                "\" . . . Arrests have been made in ~~relation to protests~~. Fascist Crackdown.",
                "Is it coup season in Turkey already?",
                "The photos from the protests have been astounding.",
                "Turkey, as long as Erdogan and his party is in power, has no place in the EU. It’s a semi-dictatorship and would never live up to the rules in the Maastricht Treaty. Maybe after at least one peaceful transfer of power to a free opposition.",
                "But they gave us eggs! Can't be that bad /s",
                "Shall we… applaud? 👏\n\nOk that’s enough\n\nEdit: it was one Applaus for the government with an /s… not as obvious as I thought."
            ],
            "aggregate_sentiment": 18.0
        }
    ],
    "last_updated": "03/25/2025 00:41:05 UTC"
}