{
    "posts": [
        {
            "category": "HOT",
            "title": "Trump asks Supreme Court to allow him to end birthright citizenship | CNN Politics",
            "external_url": "https://www.cnn.com/2025/03/13/politics/birthright-citizenship-trump-supreme-court/index.html",
            "upvotes": 27642,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2198243247-1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If the Supreme Court says anything but no, there should be secession. Explicit text requires an amendment to undo.",
                "If they say “yes” to him, Then the constitution no longer matters.",
                "So, that requires an amendment. Does anyone have a copy of The Constitution For Dummies?",
                "Immigrants are bad except when a rogue immigrant billionaire wants to destroy the country.",
                "There's an insidious corollary, of course. If\n\n> the benefit applies only to people who are “subject to the jurisdiction” of the United States. Immigrants in the country illegally, the theory goes, are subject to the jurisdiction of their native homeland. \n\nthen people in the country illegally aren't subject to the laws of the US, and they can be treated in any manner the administration decides.",
                "Does that mean we can deport Cuban-canadian and birthright citizen Ted Cruz? Please?",
                "To which, in a just world, they would reply: Fuck off",
                "If this one goes through supreme court, IT IS OVER for democracy in USA. Officially a Tyrannical government. \n\nInterpretation of words in the constitution like the president sees fit. Tomorrow it could mean the 1st and 2nd amendment which are also being challenged. \n\nRise up americans.",
                "We shouldn't be laughing at this. We've been laughing at things like this before.\n\nThen they happened for real.",
                "He’s only a generation removed from birthright citizenship. What a crock of shit."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Judge orders Trump administration to reinstate thousands of fired employees at VA, Defense Department and other agencies",
            "external_url": "https://www.cnn.com/2025/03/13/politics/judge-opm-probationary-employees-fired-hearing",
            "upvotes": 11777,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/judge-alsup-with-book-crop.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This will fast track to SCOTUS",
                "You know what would make the federal government lean and efficient? A competent leader. \n\nOne who understands basic bureaucracy and the fundamentals of representative democracy well enough to administer an entire nation for the benefit of the whole constituency. The Musk/Trump administration doesn't even care about the people who elected them into office to make the distinctions during this power grab.",
                "Doge is now claiming they had nothing to do with it. What a massive mess. \n\nThis is just costing US taxpayers more money. \n\nI do know for the US Forest Service and the National Park Service, is this early part of the year is critical planning time to get ready for summer visitation. \n\nInstead, key employees weren’t in the office. Now they’ll get paid for the time but none of their critical responsibilities have been completed. \n\nThe National Parks had their highest visitation ever in 2024. They need more employees now, not fewer. \n\nI imagine the National Forest visitation is similarly at record levels.",
                "Constitutional crisis if the felon doesn't follow the order.",
                "Trump is the opposite of the saying, \"When uou do things right, people won't be sure you've done anything at all.\"  Like love or hate, Biden, all you want, at least for 4 years, we didn't have to deal with new shit every day.",
                "I get the feeling of \"well the courts won't follow through\" etc. And yes, the Supreme Court is a vile corrupt pack of trash.\n\n\nBut don't underestimate the individual egos of judges as they watch their authority undermined time and time again by this administration. It's all too late but just like the business leaders seeing the economic devastation Trump is causing and finally coming around, many judges are starting to realize that Trump is trying to make them powerless and obsolete. They're like cops, they'll protect their own. And there's a potential tipping point here.",
                "They probably already shredded the records like they’ve been doing with other agencies.",
                "From the news, it seems that the judges are the only ones willing to fight back against this dictator while the Congress has completely bended the knee to him. His priority now is to have the supreme court bend the knee to him and he can finally become the autocrat he always wanted to be. The supreme court is the final line of defense, now. Let's see how it goes.",
                "This is why DOGE was deleting records and shredding paperwork. By mass deleting everything to non recoverability, they can’t actually rehire anyone because they have no paperwork to enable them to do so. It was a deliberate choice to destroy those records just in case they were forced to reinstate them, or if they were all thrown out of office and new management took over.",
                "Alright so the obvious question will be: “what happens when the Trump Administration tells this judge to kick rocks”?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "White House withdraws CDC director nomination just before his Senate confirmation hearing",
            "external_url": "https://www.nbcnews.com/politics/trump-administration/white-house-pulls-cdc-director-nomination-day-confirmation-hearing-rcna196208",
            "upvotes": 7024,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-11/241125-Dave-Weldon-2-aa-234p-7a721e.jpg",
            "top_comments": [
                "*\"he defended the work of Andrew Wakefield, the British physician who published a study that falsely claimed the vaccine for measles, mumps and rubella causes autism.\"*\n\nYeah.",
                "> In a lengthy statement, Weldon said he assumed the White House withdrew his nomination because Sen. Susan Collins, R-Maine, had reservations, and Cassidy also planned to vote against him. \n\nOK, that's the excuse. What's the real reason? Because I find it hard to believe Collins having \"reservations\" is ever a showstopper.",
                "They probably found someone who is worse for the job. Maybe a redneck grandmother who will provide universal castor oil and exorcisms mental health issues. ",
                "If his past comments had just stuck to Nazi adoration and glorifying sexual assault, he would have made it through!",
                "Guess you're only allowed to say that vaccines cause autism if your last name is Kennedy or Trump.",
                "Im assuming a better candidate (Kid Rock probably) has become available.",
                "What happened, did it turn out that he was qualified for the job?",
                "That's a face that says \"I just woke up and I have no idea what's going on.\"",
                "Must've accidentally once Tweeted, \"I don't think people should get sick.\"",
                "This administration really exudes competence"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "HOT",
            "title": "Judge Chutkan demands ‘some kind of evidence’ from Trump’s EPA to halt climate grants. \"You can't even tell me what the evidence of malfeasance is.\"",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/13/epa-grants-trump-judge-tanya-chutkan",
            "upvotes": 2135,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a06c5b96b2d43f44495a018ab9f5b673dccd439f/0_80_5410_3245/master/5410.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=26fe43c2241b4b05506a2da652e15a4b",
            "top_comments": [
                "Because they're making shit up.",
                "They run the House, the Senate, the Supreme Court, and the presidency and this fucking dipshit still can't get anything done despite using executive orders for everything.",
                "The don't know what malfeasance means so ...",
                "Conservatives: The rules were you weren't going to fact-check!",
                "\"Evidence is for losers.\"\n\n--Donald Trump",
                "“Your honor, we are under direct orders by President Trump to bombard the courts with bullshit cases and see what sticks.”",
                "The sad part is that we have One Judge Chutkan for every 4 Judge Cannons. \n\nAll they have to do is shift it to the right court and they will get whatever they want.",
                "Please, I'm begging the justice system to stop giving endless deference to this mindless legal nonsense.\n\nJust ask them for evidence, and when they don't provide it, pound the gavel and send them  packing.",
                "An oil tycoon is running the EPA what do you think his agenda is.",
                "Put him in his place Chutkin - we too know he should be in orison instead of destroying our country."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Stolen Telsa Driven Into Calgary's Bow River",
            "external_url": "https://www.ctvnews.ca/calgary/article/stolen-tesla-drives-into-calgarys-bow-river/",
            "upvotes": 1598,
            "date": "03/14/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/7NJBAQJO55GNXGZG6UFHZFJJII.jpg?smart=true&auth=e1c5e4cc13c4389c09c1ec0bcef5d14b5d5b30e87b077fae33bc714ad315e432&width=1200&height=630",
            "top_comments": [
                "The driver had to make quick decision: Should I be electrocuted by the batteries or be eaten by the Bow River sharks.",
                "[removed]",
                "Are they sure it wasn’t the self driving software?",
                "I hope Elon loses another 30 billion this week ….",
                "It's not stolen, its just returning to the stream to spawn.",
                "Boston Harbour  might have made a bigger.......splash!",
                "Ah yes. A \"stolen\" Tesla. \nDefinitely not a Tesla owner living with regret and a car they can't sell. \n\n\nTotal conjecture on my part. But I'm suspicious. ",
                "Pardon this bastsrd and let me shake his hand",
                "Just put that shit in some rice",
                "Prayers up for the river"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Dow slides and S&P closes in correction as Trump’s trade war escalates",
            "external_url": "https://www.cnn.com/2025/03/13/investing/us-stocks-global-trade-tensions",
            "upvotes": 3662,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25062863572137.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The stock market is not the problem. It's the recession that I'm worried about.\n\nPeople will lose their jobs just when their 401Ks are low. Sad.",
                "It really should not be this easy to fuck things up this much.",
                "Trump 💩is killing the USA",
                "Honestly, Donald just seems like the kind of guy to preheat a microwave.",
                "Let’s see how long the money puts up with this",
                "trump and his minions are going to make a killing  make it fall buy cheap",
                "Is \"correction\" another term for economic suicide?",
                "Jesus fucking Christ ! Can I please get 1 decade where this bullshit doesn't happen?",
                "Don’t forget that even after Berlin was in ashes and the Red Army occupied Germany, most Germans still adored their Fuher and longed for Nazi Germany. MAGA will never learn and this is what they desperately crave. They just love Trump, more than anything. Let them have it.",
                "Great Depression 2 is here, y'all."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Jewish protesters flood Trump Tower's lobby to demand the Columbia University activist's release",
            "external_url": "https://apnews.com/article/columbia-university-protests-khalil-trump-tower-8e2f455134a2f1b82458e32aecbb59f7",
            "upvotes": 6909,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Jewish people having a problem with agents of the state disappearing someone without the government publicly saying what he did wrong?\n\nWeird.",
                "As a jew -- and one who certainly does not agree with everything this activist says -- much, MUCH more of this please.\n\nNo extrajudicial governmental disappearances. Ever. No matter the disagreement. That is a hallmark of fascism, as if we needed any further evidence of the unhinged authoritarian tendencies of this administration.",
                "trump: they’re all Palestinians, members of Hamas just like Schumer…",
                "Ok but Fox News was telling me these were all anti semetic protesters who hate America. Why would they say that? /s",
                "Hell yeah! Solidarity",
                "Okay, how long until they're labeled as Hamas supporters and/or paid agitators?",
                "Many Jews in the US are not supporters of Trump and his policies. What Trump is doing is an attack on our freedom.",
                "Wonder if Jon Stewart is ready to call him fascist yet",
                "\"Its not just the right of the person who speaks to be heard, it is the right of everyone in the audience to listen and to hear, and every time you silence somebody you make yourself a prisoner of your own action because you deny yourself the right to hear something.\"\n\n\" Bear in mind, ladies and gentlemen, that every time you violate or propose to violate the free speech of someone else you, in potentia, you're making a rod for your own back because the other question raised by justice Oliver Wendell Holmes is simply this: \"Whose going to decide? To whom do you reward the right to decide which speech is harmful? Or who is the harmful speaker? Or to determine in advance what are the harmful consequences going to be that we know enough about in advance to prevent? To whom would you give this job? To whom are you going to award the task of being the censor?\"\n\n- Christopher Hitchens - On free Speech",
                "Absolutely this is a Democratic Country! We are not going to accept that people can be arrested without cause and disappeared without due process. Respect the rule of law."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Canadians who visit US for more than 30 days will be fingerprinted",
            "external_url": "https://www.theguardian.com/world/2025/mar/13/canada-fingerprint-visit-us",
            "upvotes": 9085,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ba10c375cb1e5b1586ed64ae5133e0ac2597c5f2/0_120_3600_2161/master/3600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=668367ca2ae33ce304afbb4d7814f743",
            "top_comments": [
                "1996. The USA had Clinton, Canada had Chretien. The US economy was roaring, and the dot com boom was just taking off. And I learned in geography class that our nations had the largest friendly border in the world.\n\nFive years later the worst terrorist attack on US soil occurred. 15 of the hijackers were Saudi nationals. None of the terrorists entered through the Canadian border. For the first and only time, the USA invoked Article 5 of NATO, and Canada fought alongside the US for damn near two decades in Afghanistan. 165 of our soldiers died fighting for the US.\n\nToday the Trump administration - after cutting a deal with the enemy Taliban, one of the world's most repressive regimes - now takes a friendlier attitude to Saudi Arabia than it does Canada.  A sickening betrayal and a reversal on more than a century of friendship that will harm Canada, but it will also do the USA more harm than good.",
                "Canada to employ large handed border agents to cavity search US visitors.",
                "Canadians who come and stay for more than 30 days are likely to be wealthy snowbirds.\n\nDiscouraging them from visiting and treating them like criminals is a weird strategy. \n\nDo Canadians suddenly become criminal troublemakers after 30 days?\n\nA lot of European, Pacific, and Central and South American beach towns thank the USA for the boost in polite, wealthy tourists.",
                "I would just suggest that our Canadian friends not come here if you don’t absolutely have to. Our government is hostile, chaotic, unstable, and untrustworthy right now. Many of us are hoping to fix that problem in the future, but it is going to take a while to get there.",
                "Not to worry-all the Canadians I know have no interest in visiting the US, let alone staying here for over 30 days.",
                "Just like US midwesterners, there are a good sized number of Canadians who spend their winters in the US south and it’s a lot of money to the towns who cater to them. Many Canadians have been already reconsidering their winter homes and  I suspect this will be the last straw for most.  It will be devastating to these communities when Canadian dollars decide to stay in Canada   ",
                "From an American, Canadians please don't come here if this is going to happen. We care about you and your safety. Stay out of here until we can burn this shit out.",
                "It has been embarrassing to be an American since November…. Apologies to my Canadian friends",
                "As long as Trump is in power, I will never travel to the US to spend my hard earned money again.",
                "I work as a health inspector in Phoenix in a district with a high retirement population. The businesses here rely on the “snowbirds” to keep their doors open. This last winter, due to the election and not severe weather up north, most of the snowbirds didn’t come down till late December early January. All of my restaurants were freaking out because they were loosing so much money every day. Three restaurants in my district had to close shop because they were foreclosed on. \n\nIf this goes into effect, the impact down here is going to devastate our small businesses that rely on the snowbirds. We will still get a lot from the northern states, but a large population in these retirement communities are Canadian. \n\nBut I am sure all of this was considered when the great orange dictator lashed out to our northern neighbor because his fragile ego was bruised."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "‘Ruined this place’: chorus of boos against JD Vance at Washington concert",
            "external_url": "https://www.theguardian.com/world/2025/mar/14/jd-vance-booed-national-symphony-orchestra-concert-washington-kennedy-center",
            "upvotes": 479,
            "date": "03/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/237c2180b80bf56ca869dc7b0e1b6eb7f00ea50c/60_0_1800_1080/master/1800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2ad43ddef753c4ddb674bee73155dbd1",
            "top_comments": [
                "The irony of JD Vance going to a Shostakovich concert after Trump fired the board of the Kennedy Center is lost on every one of his supporters.",
                "Oh they love it. You have a bunch of college educated, sometimes Ivy League educated, guys who worked at hedge funds or ran insurance companies talking about \"elites\" this and that",
                "You know its a good sign for democracy where yes men are everywhere to back up dear leader.",
                "“You’re Intolerant because you don’t love our hatred and Intolerance!!!”\n\n\nYep",
                "I assume he's sitting up there so that those below don't have the angle to see him copulating with his seat.",
                "Oh I think on some level the boo’s smarted.  But he will spin it as vindication of adulterating art’s beauty.  But then…..You never once said, “Thank you!” Vance.  That is “Thank you sir! May I have another!”",
                "It irritates me when people who constantly mock a made up version of the sensitive liberals and want to defund/ban anything slightly artistic or expressive then think they’re entitled to enjoy art. May they never find peace",
                "I’m pretty sure JD Vance soon will tweet how his wife and him was nearly attacked by an angry liberal mob paid for by Soros while attending a concert.",
                "Call those boos, more like a whimper"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "US meat trade days away from getting 'kicked out' of China",
            "external_url": "https://www.abc.net.au/news/2025-03-14/3-billion-united-states-meat-trade-to-china-at-risk/105052220",
            "upvotes": 500,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/1c99f16be5073db8a407da33b9d26f25?impolicy=wcms_watermark_news&cropH=788&cropW=1400&xPos=0&yPos=73&width=862&height=485&imformat=generic",
            "top_comments": [
                "Looks like someone doesn’t have all the cards…",
                "Art of the deal, now we can all buy it for less money, right? Right?",
                "Good for China. The US gets what it voted for.",
                "Looks like American decisions in the ballot box have consequences...",
                "I buy Australian beef anyway in China. Much better quality than American beef.",
                "I mean if they want the dump all that produce in the American market I would love to pick up some nice cuts of steak for the cheap.",
                "he'll wait till the last minute sign it and claim credit for saving the beef industry....",
                "Has anyone in the white house read a history book? Because the current consequences seem easily avoided based on the way things have turned out previously.",
                "So much winning, non stop winning. The voters must be so proud",
                "What sucks more? The \"art\" or the \"deal\"?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "US tells Vietnam to improve trade balance amid tariff risks",
            "external_url": "https://www.bangkokpost.com/business/general/2979853/us-tells-vietnam-to-improve-trade-balance-amid-tariff-risks",
            "upvotes": 35,
            "date": "03/14/2025",
            "thumbnail": "https://static.bangkokpost.com/media/content/20250314/c1_2979853_250314111233_700.jpg",
            "top_comments": [
                "US so obsessed with making good relations with old enemy while so mean to old friends....",
                "And add another one to the list of \"Countries the Trump administration has pissed off for no reason\"",
                "So Trump wants to countries to buy more American, even if it’s shit, or not cheaper/better quality stuff (whatever the reason is they sell more/buy less). What happened to the American way of best of the best-guess that is not part of Make America Great Again. Maybe it’s Canada again, trying to tell them to buy more American stuff or Trump will make Americans pay more for things they really need (like raw materials and energy). The guy is destroying USA and trying to replace it with USSR or something  (like that crap of forcing folks to buy USSR products even if they are far from the best/cheapest on markets). For someone who claims they are all about capitalism, it sure looks like he’s an economic communist)."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Iran, Russia, China discuss Tehran’s nuclear programme at Beijing meeting | Nuclear Weapons News",
            "external_url": "https://www.aljazeera.com/news/2025/3/14/iran-russia-china-discuss-tehrans-nuclear-programme-at-beijing-meeting",
            "upvotes": 21,
            "date": "03/14/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/03/2023-02-14T071554Z_910572135_RC2PAZ9BKMLM_RTRMADP_3_CHINA-IRAN-1741930198_747656-1741932232.jpg?resize=1200%2C630&quality=80",
            "top_comments": [
                ">Ayatollah Khamenei maintains Tehran **does not** have or **want nuclear weapons**, but a recent report from the International Atomic Energy Agency said Iran’s stockpile of enriched uranium was close to the requirements for a nuclear bomb.\n\nI can't see how that would be true, they really need a nuke or ten to protect against Israel convincing the US to invade them - but they can't say that until it's complete or we'll use it as justification to preemptively bomb them in an attempt to stop it."
            ],
            "aggregate_sentiment": 23.0
        },
        {
            "category": "NEW",
            "title": "‘Ruined this place’: chorus of boos against JD Vance at Washington concert",
            "external_url": "https://www.theguardian.com/world/2025/mar/14/jd-vance-booed-national-symphony-orchestra-concert-washington-kennedy-center",
            "upvotes": 480,
            "date": "03/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/237c2180b80bf56ca869dc7b0e1b6eb7f00ea50c/60_0_1800_1080/master/1800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2ad43ddef753c4ddb674bee73155dbd1",
            "top_comments": [
                "The irony of JD Vance going to a Shostakovich concert after Trump fired the board of the Kennedy Center is lost on every one of his supporters.",
                "Oh they love it. You have a bunch of college educated, sometimes Ivy League educated, guys who worked at hedge funds or ran insurance companies talking about \"elites\" this and that",
                "You know its a good sign for democracy where yes men are everywhere to back up dear leader.",
                "“You’re Intolerant because you don’t love our hatred and Intolerance!!!”\n\n\nYep",
                "I assume he's sitting up there so that those below don't have the angle to see him copulating with his seat.",
                "Oh I think on some level the boo’s smarted.  But he will spin it as vindication of adulterating art’s beauty.  But then…..You never once said, “Thank you!” Vance.  That is “Thank you sir! May I have another!”",
                "It irritates me when people who constantly mock a made up version of the sensitive liberals and want to defund/ban anything slightly artistic or expressive then think they’re entitled to enjoy art. May they never find peace",
                "I’m pretty sure JD Vance soon will tweet how his wife and him was nearly attacked by an angry liberal mob paid for by Soros while attending a concert.",
                "Call those boos, more like a whimper"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Influencer who snatched baby wombat leaves Australia",
            "external_url": "https://www.abc.net.au/news/2025-03-14/sam-jones-baby-wombat-video-leaves-australia/105051630",
            "upvotes": 241,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/cfd3459afa4febabed3f2ab124a7eb6c?impolicy=wcms_watermark_news&cropH=336&cropW=597&xPos=0&yPos=45&width=862&height=485&imformat=generic",
            "top_comments": [
                "She went from something like 2k followers to almost 100k. Thats completely gross. She got exactly what she wanted.",
                "*On her profile, she describes herself as a \"wildlife biologist and environmental scientist\", an \"outdoor enthusiast\" and a hunter*.\n\nthe only thing i believe is the hunter part",
                "Can we not allow her back in the US?",
                "should not have been allowed to leave the country without paying some sort of fine imo",
                "Insert Australian Northern Territory tourism slogan here.",
                "Nothing but ignorance.  Imagine gaining notoriety through lack of decency and pure stupidity.",
                "Shell never be allowed back, no visa office will approve it... only level of justice i can find",
                "I hope she gets a middle seat between two giant people for her flight home. And then they lose her luggage.",
                "Embarrassing for Montana and Americans.",
                "do u guys think the baby found its mama 🥺"
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "NEW",
            "title": "US meat trade days away from getting 'kicked out' of China",
            "external_url": "https://www.abc.net.au/news/2025-03-14/3-billion-united-states-meat-trade-to-china-at-risk/105052220",
            "upvotes": 499,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/1c99f16be5073db8a407da33b9d26f25?impolicy=wcms_watermark_news&cropH=788&cropW=1400&xPos=0&yPos=73&width=862&height=485&imformat=generic",
            "top_comments": [
                "Looks like someone doesn’t have all the cards…",
                "Art of the deal, now we can all buy it for less money, right? Right?",
                "Good for China. The US gets what it voted for.",
                "Looks like American decisions in the ballot box have consequences...",
                "I buy Australian beef anyway in China. Much better quality than American beef.",
                "I mean if they want the dump all that produce in the American market I would love to pick up some nice cuts of steak for the cheap.",
                "he'll wait till the last minute sign it and claim credit for saving the beef industry....",
                "Has anyone in the white house read a history book? Because the current consequences seem easily avoided based on the way things have turned out previously.",
                "So much winning, non stop winning. The voters must be so proud",
                "What sucks more? The \"art\" or the \"deal\"?"
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "NEW",
            "title": "School employee accused of inappropriate relationship with student",
            "external_url": "https://www.wsfa.com/2025/02/23/school-employee-accused-inappropriate-relationship-with-student/?utm_source=taboola&utm_medium=organicclicks",
            "upvotes": 44,
            "date": "03/14/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/3P3GEYT52BAZNHXTUNRBEJ5OEA.jpg?auth=e027da333f599b88f90b4d26d1aa8b7542aed2e5beb6710e5de5e89b5998db3c&width=1200&height=600&smart=true",
            "top_comments": [
                "She’s obviously legally innocent until proven guilty, but if she is being charged with statutory rape, the article should say she’s being accused of statutory rape.  I don’t know why the news tiptoes around this type of allegation.",
                "\"Having a relationship\"",
                "Stop this crap. \n\n“Relationship.” NO\n\nAbusing, victimizing, raping.  Those are the only potentially appropriate verbs here, depending on what she’s actually accused of.",
                "And just like always.  when it's a woman, it's \"inappropriate relationship\".  I'm not sexist...ladies have it goddamn rough in society and I absolutely do NOT understand just how bad it is, but I know it is pretty bad...but when it comes to sexual misconduct of any kind the men are always the ones saddled with 'rape' by the media, and the women get 'inappropriate relationship'.",
                "3 week old news. Thanks",
                "Is it Texas or Florida?",
                "\"We had a good thing, you stupid son of a bitch! We had Fring, we had a lab, we had everything we needed, and it all ran like clockwork! You could have shut your mouth, cooked, and made as much money as you ever needed! It was perfect! But no! You just had to blow it up! You, and your pride and your ego! You just had to be the man! If you'd done your job, known your place, we'd all be fine right now!\"",
                "i feel like more and more female teachers lately are making it their mission to single-handedly lessen the gender gap of child sexual violence",
                "I personally just don’t want to hear the idiot dude say she’s hot and where she when I was in school",
                "Inb4 the men who whine about men's issues not being taken seriously while also making comments like: \"where was she when I was in school?\" \"Nice\", \"lucky kid\""
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Apple accused of discrimination for telling employee to stop wearing jewellery supporting Gaza",
            "external_url": "https://www.abc.net.au/news/2025-03-13/apple-accused-discrimination-jewellery-supporting-gaza/105042996",
            "upvotes": 396,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/2b158d5aa18917d229c4f2bd195f2dbf?impolicy=wcms_watermark_news&cropH=2354&cropW=4185&xPos=414&yPos=1147&width=862&height=485&imformat=generic",
            "top_comments": [
                "IANAL in Aus, but usually private companies can have uniform policies. They have a right to protect the brand..",
                "Im sure some coworker or customer complained that this person was supporting terror.",
                "I think its normal for a retail employee to be told not to wear any clothing or accessories that imply political.\n\nThis was true for me even in highschool and I am 40 now.\n\nThis is barely news.",
                "> in the shape of historic Palestine\n\nLOL\n\nAnyway, in spite of such jokes, the fact that his coworkers were scared of him and multiple people accuse him of antisemitism says that maybe this wasn't just about the Free Palestine bracelet and the Palestine necklace.\n\nI wonder what the viewpoints of his managers and coworkers are.  They didn't seem to be quoted anywhere.",
                "Let's see them tell employees to stop wearing star of David necklaces and see how well that goes for them.",
                "Imagine the reaction if the had banned a cross,  star of David, or the moon and star ....",
                "Title Fix\n 'A brown person done something and it upset white people, a manger was called'",
                "Your beliefs on your own time. You’re paid to work not politicize the office. This is just basic rules that have always been in effect. It’s just these days it needs to be spoken aloud or written in a handbook for those with less common sense and self awareness. \nWork is hard enough without having people bicker over personal stuff."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Judge Chutkan demands ‘some kind of evidence’ from Trump’s EPA to halt climate grants. \"You can't even tell me what the evidence of malfeasance is.\"",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/13/epa-grants-trump-judge-tanya-chutkan",
            "upvotes": 2143,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a06c5b96b2d43f44495a018ab9f5b673dccd439f/0_80_5410_3245/master/5410.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=26fe43c2241b4b05506a2da652e15a4b",
            "top_comments": [
                "Because they're making shit up.",
                "They run the House, the Senate, the Supreme Court, and the presidency and this fucking dipshit still can't get anything done despite using executive orders for everything.",
                "The don't know what malfeasance means so ...",
                "Conservatives: The rules were you weren't going to fact-check!",
                "\"Evidence is for losers.\"\n\n--Donald Trump",
                "“Your honor, we are under direct orders by President Trump to bombard the courts with bullshit cases and see what sticks.”",
                "The sad part is that we have One Judge Chutkan for every 4 Judge Cannons. \n\nAll they have to do is shift it to the right court and they will get whatever they want.",
                "Please, I'm begging the justice system to stop giving endless deference to this mindless legal nonsense.\n\nJust ask them for evidence, and when they don't provide it, pound the gavel and send them  packing.",
                "An oil tycoon is running the EPA what do you think his agenda is.",
                "Put him in his place Chutkin - we too know he should be in orison instead of destroying our country."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Federal Cuts Prompt Johns Hopkins to Cut More Than 2,000 Workers",
            "external_url": "https://www.nytimes.com/2025/03/13/us/trump-cuts-johns-hopkins-university-layoffs.html?unlocked_article_code=1.304.EFUS.chI-h1pFmD5L&smid=nytcore-android-share",
            "upvotes": 610,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Someone who needed medical care might die. But hey - those three trans kids in the entire state of Idaho won’t get to play sports so worth it, amiright?",
                "Hey let’s screw up the best medical research hospital in the whole freaking world. That sounds like a great idea! /s",
                "So this is what so called conservatives completely miss in the fed cut conversation. Absolutely no concept of the multiplier effect of government spending. At this point I’m convinced that they fall into one of two camps:  The truly clueless and the 1% who are trying to intentionally drive markets into the dirt so they can snatch up the bargains.",
                "There's going to be so many down stream job losses from this. Most of these cuts were well paid middle-class jobs. How many restaurants, landscapers, maids and pretty much anything that's not a basic need might go under because they just lost 10-20% of their business? And how many more from those going out of business?",
                "Are we great again yet?",
                "2000 more families with upended lives",
                "This is like refusing to water a tree that will later provide fruit and shade.",
                "Only 3 years and 10 more months of disaster left.   \n\nHopefully we still have a country left by then",
                "I am still mind blown the first six weeks have been almost entirely about cutting good American jobs. I will never understand how people voted for this",
                "Hey, but they made that kid an honorary secret service member or whatever. Why aren't y'all clapping more?!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Stolen Telsa Driven Into Calgary's Bow River",
            "external_url": "https://www.ctvnews.ca/calgary/article/stolen-tesla-drives-into-calgarys-bow-river/",
            "upvotes": 1596,
            "date": "03/14/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/7NJBAQJO55GNXGZG6UFHZFJJII.jpg?smart=true&auth=e1c5e4cc13c4389c09c1ec0bcef5d14b5d5b30e87b077fae33bc714ad315e432&width=1200&height=630",
            "top_comments": [
                "The driver had to make quick decision: Should I be electrocuted by the batteries or be eaten by the Bow River sharks.",
                "[removed]",
                "Are they sure it wasn’t the self driving software?",
                "I hope Elon loses another 30 billion this week ….",
                "It's not stolen, its just returning to the stream to spawn.",
                "Boston Harbour  might have made a bigger.......splash!",
                "Ah yes. A \"stolen\" Tesla. \nDefinitely not a Tesla owner living with regret and a car they can't sell. \n\n\nTotal conjecture on my part. But I'm suspicious. ",
                "Pardon this bastsrd and let me shake his hand",
                "Just put that shit in some rice",
                "Prayers up for the river"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "‘Ruined this place’: chorus of boos against JD Vance at Washington concert",
            "external_url": "https://www.theguardian.com/world/2025/mar/14/jd-vance-booed-national-symphony-orchestra-concert-washington-kennedy-center",
            "upvotes": 480,
            "date": "03/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/237c2180b80bf56ca869dc7b0e1b6eb7f00ea50c/60_0_1800_1080/master/1800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2ad43ddef753c4ddb674bee73155dbd1",
            "top_comments": [
                "The irony of JD Vance going to a Shostakovich concert after Trump fired the board of the Kennedy Center is lost on every one of his supporters.",
                "Oh they love it. You have a bunch of college educated, sometimes Ivy League educated, guys who worked at hedge funds or ran insurance companies talking about \"elites\" this and that",
                "You know its a good sign for democracy where yes men are everywhere to back up dear leader.",
                "“You’re Intolerant because you don’t love our hatred and Intolerance!!!”\n\n\nYep",
                "I assume he's sitting up there so that those below don't have the angle to see him copulating with his seat.",
                "Oh I think on some level the boo’s smarted.  But he will spin it as vindication of adulterating art’s beauty.  But then…..You never once said, “Thank you!” Vance.  That is “Thank you sir! May I have another!”",
                "It irritates me when people who constantly mock a made up version of the sensitive liberals and want to defund/ban anything slightly artistic or expressive then think they’re entitled to enjoy art. May they never find peace",
                "I’m pretty sure JD Vance soon will tweet how his wife and him was nearly attacked by an angry liberal mob paid for by Soros while attending a concert.",
                "Call those boos, more like a whimper"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Judge Chutkan demands ‘some kind of evidence’ from Trump’s EPA to halt climate grants. \"You can't even tell me what the evidence of malfeasance is.\"",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/13/epa-grants-trump-judge-tanya-chutkan",
            "upvotes": 2149,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a06c5b96b2d43f44495a018ab9f5b673dccd439f/0_80_5410_3245/master/5410.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=26fe43c2241b4b05506a2da652e15a4b",
            "top_comments": [
                "Because they're making shit up.",
                "They run the House, the Senate, the Supreme Court, and the presidency and this fucking dipshit still can't get anything done despite using executive orders for everything.",
                "The don't know what malfeasance means so ...",
                "Conservatives: The rules were you weren't going to fact-check!",
                "\"Evidence is for losers.\"\n\n--Donald Trump",
                "“Your honor, we are under direct orders by President Trump to bombard the courts with bullshit cases and see what sticks.”",
                "The sad part is that we have One Judge Chutkan for every 4 Judge Cannons. \n\nAll they have to do is shift it to the right court and they will get whatever they want.",
                "Please, I'm begging the justice system to stop giving endless deference to this mindless legal nonsense.\n\nJust ask them for evidence, and when they don't provide it, pound the gavel and send them  packing.",
                "An oil tycoon is running the EPA what do you think his agenda is.",
                "Put him in his place Chutkin - we too know he should be in orison instead of destroying our country."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US meat trade days away from getting 'kicked out' of China",
            "external_url": "https://www.abc.net.au/news/2025-03-14/3-billion-united-states-meat-trade-to-china-at-risk/105052220",
            "upvotes": 500,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/1c99f16be5073db8a407da33b9d26f25?impolicy=wcms_watermark_news&cropH=788&cropW=1400&xPos=0&yPos=73&width=862&height=485&imformat=generic",
            "top_comments": [
                "Looks like someone doesn’t have all the cards…",
                "Art of the deal, now we can all buy it for less money, right? Right?",
                "Good for China. The US gets what it voted for.",
                "Looks like American decisions in the ballot box have consequences...",
                "I buy Australian beef anyway in China. Much better quality than American beef.",
                "I mean if they want the dump all that produce in the American market I would love to pick up some nice cuts of steak for the cheap.",
                "he'll wait till the last minute sign it and claim credit for saving the beef industry....",
                "Has anyone in the white house read a history book? Because the current consequences seem easily avoided based on the way things have turned out previously.",
                "So much winning, non stop winning. The voters must be so proud",
                "What sucks more? The \"art\" or the \"deal\"?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Apple accused of discrimination for telling employee to stop wearing jewellery supporting Gaza",
            "external_url": "https://www.abc.net.au/news/2025-03-13/apple-accused-discrimination-jewellery-supporting-gaza/105042996",
            "upvotes": 396,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/2b158d5aa18917d229c4f2bd195f2dbf?impolicy=wcms_watermark_news&cropH=2354&cropW=4185&xPos=414&yPos=1147&width=862&height=485&imformat=generic",
            "top_comments": [
                "IANAL in Aus, but usually private companies can have uniform policies. They have a right to protect the brand..",
                "Im sure some coworker or customer complained that this person was supporting terror.",
                "I think its normal for a retail employee to be told not to wear any clothing or accessories that imply political.\n\nThis was true for me even in highschool and I am 40 now.\n\nThis is barely news.",
                "> in the shape of historic Palestine\n\nLOL\n\nAnyway, in spite of such jokes, the fact that his coworkers were scared of him and multiple people accuse him of antisemitism says that maybe this wasn't just about the Free Palestine bracelet and the Palestine necklace.\n\nI wonder what the viewpoints of his managers and coworkers are.  They didn't seem to be quoted anywhere.",
                "Let's see them tell employees to stop wearing star of David necklaces and see how well that goes for them.",
                "Imagine the reaction if the had banned a cross,  star of David, or the moon and star ....",
                "Title Fix\n 'A brown person done something and it upset white people, a manger was called'",
                "Your beliefs on your own time. You’re paid to work not politicize the office. This is just basic rules that have always been in effect. It’s just these days it needs to be spoken aloud or written in a handbook for those with less common sense and self awareness. \nWork is hard enough without having people bicker over personal stuff."
            ],
            "aggregate_sentiment": 27.0
        },
        {
            "category": "RISING",
            "title": "Influencer who snatched baby wombat leaves Australia",
            "external_url": "https://www.abc.net.au/news/2025-03-14/sam-jones-baby-wombat-video-leaves-australia/105051630",
            "upvotes": 242,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/cfd3459afa4febabed3f2ab124a7eb6c?impolicy=wcms_watermark_news&cropH=336&cropW=597&xPos=0&yPos=45&width=862&height=485&imformat=generic",
            "top_comments": [
                "She went from something like 2k followers to almost 100k. Thats completely gross. She got exactly what she wanted.",
                "*On her profile, she describes herself as a \"wildlife biologist and environmental scientist\", an \"outdoor enthusiast\" and a hunter*.\n\nthe only thing i believe is the hunter part",
                "Can we not allow her back in the US?",
                "should not have been allowed to leave the country without paying some sort of fine imo",
                "Insert Australian Northern Territory tourism slogan here.",
                "Nothing but ignorance.  Imagine gaining notoriety through lack of decency and pure stupidity.",
                "Shell never be allowed back, no visa office will approve it... only level of justice i can find",
                "I hope she gets a middle seat between two giant people for her flight home. And then they lose her luggage.",
                "Embarrassing for Montana and Americans.",
                "do u guys think the baby found its mama 🥺"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Federal Cuts Prompt Johns Hopkins to Cut More Than 2,000 Workers",
            "external_url": "https://www.nytimes.com/2025/03/13/us/trump-cuts-johns-hopkins-university-layoffs.html?unlocked_article_code=1.304.EFUS.chI-h1pFmD5L&smid=nytcore-android-share",
            "upvotes": 614,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Someone who needed medical care might die. But hey - those three trans kids in the entire state of Idaho won’t get to play sports so worth it, amiright?",
                "Hey let’s screw up the best medical research hospital in the whole freaking world. That sounds like a great idea! /s",
                "So this is what so called conservatives completely miss in the fed cut conversation. Absolutely no concept of the multiplier effect of government spending. At this point I’m convinced that they fall into one of two camps:  The truly clueless and the 1% who are trying to intentionally drive markets into the dirt so they can snatch up the bargains.",
                "There's going to be so many down stream job losses from this. Most of these cuts were well paid middle-class jobs. How many restaurants, landscapers, maids and pretty much anything that's not a basic need might go under because they just lost 10-20% of their business? And how many more from those going out of business?",
                "Are we great again yet?",
                "2000 more families with upended lives",
                "This is like refusing to water a tree that will later provide fruit and shade.",
                "Only 3 years and 10 more months of disaster left.   \n\nHopefully we still have a country left by then",
                "I am still mind blown the first six weeks have been almost entirely about cutting good American jobs. I will never understand how people voted for this",
                "Hey, but they made that kid an honorary secret service member or whatever. Why aren't y'all clapping more?!"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Stolen Telsa Driven Into Calgary's Bow River",
            "external_url": "https://www.ctvnews.ca/calgary/article/stolen-tesla-drives-into-calgarys-bow-river/",
            "upvotes": 1593,
            "date": "03/14/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/7NJBAQJO55GNXGZG6UFHZFJJII.jpg?smart=true&auth=e1c5e4cc13c4389c09c1ec0bcef5d14b5d5b30e87b077fae33bc714ad315e432&width=1200&height=630",
            "top_comments": [
                "The driver had to make quick decision: Should I be electrocuted by the batteries or be eaten by the Bow River sharks.",
                "[removed]",
                "Are they sure it wasn’t the self driving software?",
                "I hope Elon loses another 30 billion this week ….",
                "It's not stolen, its just returning to the stream to spawn.",
                "Boston Harbour  might have made a bigger.......splash!",
                "Ah yes. A \"stolen\" Tesla. \nDefinitely not a Tesla owner living with regret and a car they can't sell. \n\n\nTotal conjecture on my part. But I'm suspicious. ",
                "Pardon this bastsrd and let me shake his hand",
                "Just put that shit in some rice",
                "Prayers up for the river"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Columbia University expels some students who seized building last year, suspends others",
            "external_url": "https://www.cbsnews.com/newyork/news/columbia-university-protest-expulsions-suspension/",
            "upvotes": 1823,
            "date": "03/13/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/04/30/b9b52e61-44ff-4e31-9d62-7323ffe2f139/thumbnail/1200x630/130ddf3519e72011a40229f1bee35cbb/gettyimages-2150288162.jpg?v=906a31f1d4c74cf15e139a5e9bae4f67",
            "top_comments": [
                ">temporarily revoked the diplomas of some students who have since graduated.\n\nWhat does \"temporarily revoked\" mean? How do they get unrevoked?",
                "Honestly isnt the consequences of a protest what make it so impactful? Its not like we look at the civil rights movement and give it so much reverance because black people were politely asked to leave the white only restaurant. ",
                "https://en.wikipedia.org/wiki/1968_Columbia_University_protests\n\nThe protests of 1968 and the way the university handled them led to a decrease in donations for 20 years.  \n\nFor a University it really isn't learning...",
                "Say what you want about their right to protest but you ain’t doing yourself any favors by committing a hostile takeover of a university building",
                "Columbia invited NAZI’s to speak on their campus in the 1930’s and expelled the students protesting AGAINST NAZI’s. Fuck them. The school, not the protestors.",
                "Are they doing this expecting Trump to reverse the recent cuts to grant funding, or are they only doing it to stop Trump from cutting even more funding?",
                "Yeah i don’t really see an issue expelling kids who actively took over a building. People protesting in outside shouldn’t have any action done against them.",
                "This just in: First Amendment still doesn’t cover occupying buildings and vandalism. Using Trump pardoning rioters doesn’t make it less true, it just means Colombia has higher standards ",
                "For those who this that this is wrong due to the first amendment, you should really make sure you k ow what the first amendment does.\n\nIt means THE GOVERMENT cannot punish you for things like speech. Columbia can punish you for speech it doesn't like, and probably laid out situations like this in the student handbook",
                "People in the comments“I would have supported MLK back in the day.” Also people in the comments: those students deserved it for sit-ins. You are the people who would have been relieved when MLK died, 21st century edition. Good luck with that."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Dow slides and S&P closes in correction as Trump’s trade war escalates",
            "external_url": "https://www.cnn.com/2025/03/13/investing/us-stocks-global-trade-tensions",
            "upvotes": 3664,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25062863572137.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The stock market is not the problem. It's the recession that I'm worried about.\n\nPeople will lose their jobs just when their 401Ks are low. Sad.",
                "It really should not be this easy to fuck things up this much.",
                "Trump 💩is killing the USA",
                "Honestly, Donald just seems like the kind of guy to preheat a microwave.",
                "Let’s see how long the money puts up with this",
                "trump and his minions are going to make a killing  make it fall buy cheap",
                "Is \"correction\" another term for economic suicide?",
                "Jesus fucking Christ ! Can I please get 1 decade where this bullshit doesn't happen?",
                "Don’t forget that even after Berlin was in ashes and the Red Army occupied Germany, most Germans still adored their Fuher and longed for Nazi Germany. MAGA will never learn and this is what they desperately crave. They just love Trump, more than anything. Let them have it.",
                "Great Depression 2 is here, y'all."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Trump asks Supreme Court to allow him to end birthright citizenship | CNN Politics",
            "external_url": "https://www.cnn.com/2025/03/13/politics/birthright-citizenship-trump-supreme-court/index.html",
            "upvotes": 27637,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2198243247-1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If the Supreme Court says anything but no, there should be secession. Explicit text requires an amendment to undo.",
                "If they say “yes” to him, Then the constitution no longer matters.",
                "So, that requires an amendment. Does anyone have a copy of The Constitution For Dummies?",
                "Immigrants are bad except when a rogue immigrant billionaire wants to destroy the country.",
                "There's an insidious corollary, of course. If\n\n> the benefit applies only to people who are “subject to the jurisdiction” of the United States. Immigrants in the country illegally, the theory goes, are subject to the jurisdiction of their native homeland. \n\nthen people in the country illegally aren't subject to the laws of the US, and they can be treated in any manner the administration decides.",
                "Does that mean we can deport Cuban-canadian and birthright citizen Ted Cruz? Please?",
                "To which, in a just world, they would reply: Fuck off",
                "If this one goes through supreme court, IT IS OVER for democracy in USA. Officially a Tyrannical government. \n\nInterpretation of words in the constitution like the president sees fit. Tomorrow it could mean the 1st and 2nd amendment which are also being challenged. \n\nRise up americans.",
                "We shouldn't be laughing at this. We've been laughing at things like this before.\n\nThen they happened for real.",
                "He’s only a generation removed from birthright citizenship. What a crock of shit."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "03/14/2025 08:11:30 UTC"
}