{
    "posts": [
        {
            "category": "HOT",
            "title": "Trump administration fires senior Navy female officer at NATO. She appeared on a 'woke' list",
            "external_url": "https://apnews.com/article/pentagon-hegseth-trump-dei-chatfield-nato-23df15b59766458d106567ba782d2f15",
            "upvotes": 15130,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*The letter said Chatfield posted supportive comments on LinkedIn about a diversity summit and gave a speech in 2015 at Women’s Equality Day. The group quoted her as saying that investing in empowering women can unlock human potential.*\n\n*And they also said she was quoted as saying, “our diversity is our strength” — a phrase that Hegseth has repeatedly condemned.*\n\n\nShe was fired for years old comments that didn't draw any ire if you are a rational adult.",
                "This is the administration blatantly being assholes in broad daylight and seemingly getting away with it. \n\nTrump and the GOP are making a mockery of this once great country.\nTheir pettiness knows no bounds, they are off the leash, shitting and pissing on everything, pandering to the MAGA weirdos and destroying any goodwill with our allies. \nHow is anyone OK with this?",
                "When this is over, they need to mount a plaque at the Pentagon with the names of all the service members that were sacrificed in the name of MAGA's woke phobia.",
                "I assume denounciations, false accusations by right wing influencers and grifters will slowly deplete our government and armed forces of competent employees and leaders. What could possibly go wrong?",
                "Admiraling while female is enough to get you fired these days.",
                "Evangelicals are worried about the persecution of Christians.\n\nJesus reached out to the marginalized. He’d be considered ‘woke’.\n\nAnd woke is now being persecuted.",
                "They just can’t stand smart women.",
                "This is a wild and scary timeline! For as long as I've been working (20 years) making openly discriminatory statements would (rightfully) get you fired. Now saying you SHOULDN'T discriminate is a reason to be fired? When will \"hate quotas\" become a requirement for employment? Will people start getting fired if they DON'T  use slurs against others? Will employees have to organize group harassment initiatives against people considered \"other\"? Where is the line?",
                "You know…once they get rid of all the “woke” people, they’re gonna have to work with just each other and realize how insufferable they actually are. And likely, how incompetent they all are…annnnndd we have reached the year of Idiocracy.",
                "I guess I have to keep mentioning this.... I mean... it only happened a year ago, but here we go... again:\n\nLast year Bangladesh had a revolution for \\[checking my notes, dramatically\\] basically filling all the government jobs with party loyalists....\n\nNow Trump and co. are \\[checking my notes, dramatically\\] basically filling all the government jobs with party loyalists....\n\nThis should end well...."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Supreme Court allows Trump to enforce Alien Enemies Act for rapid deportations for now",
            "external_url": "https://edition.cnn.com/2025/04/07/politics/supreme-court-deportation-flights-trump/index.html",
            "upvotes": 19944,
            "date": "04/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21484239-3434220-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> The unsigned decision in the case, the most closely watched emergency appeal pending at the Supreme Court, lets Trump invoke the 1798 law to speed removals while litigation over the act’s use plays out in lower courts. The court stressed that people deported going forward should receive notice they are subject to the act and an opportunity to have their removal reviewed.\n\nThis strikes me as SCOTUS knowing it won't stand up, but wanting to give the administration more time to mass deport people until the cases play out in the lower courts and actually require a final decision from them. It's the same thing they did with the presidential immunity case. Delay enough that the damage is done by the time they make a decision.\n\n\n> The court’s three liberal justices dissented from the decision, and Justice Amy Coney Barrett, a member of the court’s conservative wing, partially dissented.\n\nAmy Coney Barrett being the dark horse. I know it's only a partial dissent, but of the conservative justices, she's seemed the most likely to not go blindly along.",
                "AP article - \"In a bitterly divided 5-4 decision, the court said the migrants still must get a chance to challenge their deportation before they are taken out of the country and said the Trump administration must give them “reasonable time” to go to court.\n\nBut the conservative majority said the legal challenges must take place in Texas, instead of a Washington courtroom.\"",
                "Oh, is this the same Supreme Court that gave Trump broad immunity from prosecution for illegal acts he committed during his time as President?",
                "OFC they are. They are Trump puppets.",
                "This order is going to immediately be abused despite everyone knowing what’s going to happen.  The Supreme Court just shit its pants and leaving us with the mess.  If you look like someone who could be deported. you might want to start carrying information that proves your citizenship, but let’s be real it probably won’t matter to ice.  You can be damn sure that trump and his band of dip ships will do everything in their power to make sure any errors that result in people being harmed won’t be fixed.",
                "The Supreme Court is allowing Trump to break the law and seize unconstitutional power. How dare they disgrace our nation.",
                "Congress never declared war, so I guess it is official. Congress is no longer needed unless a Democrat is President.",
                "Like Cory Booker said, if there’s no due process, how do we know that an American citizen wont be deported.\n\nTrump will use this as justification to escalate.",
                "\"Supreme Court Anoints Trump Emperor With Power to Arrest and Deport Anyone Without Recourse\"\n\nftfy",
                "Remember when the supreme Court said that forgiving student debt was a unlawful use of presidential executive orders?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Lawyer for U-M protester detained at airport after spring break trip with family",
            "external_url": "https://www.freep.com/story/news/local/michigan/wayne/2025/04/07/lawyer-for-u-m-protester-held-at-airport-refused-to-give-feds-his-phone/82978891007/",
            "upvotes": 6388,
            "date": "04/08/2025",
            "thumbnail": "https://www.freep.com/gcdn/authoring/authoring-images/2025/04/07/PDTF/82982490007-amir-makled.png?crop=558,314,x0,y66&width=558&height=314&format=pjpg&auto=webp",
            "top_comments": [
                "You have to wonder about the type of person who willingly engages in these Gestapo tactics. I wonder what they try to pretend their profession is to others. They might be delusional enough to think the common reaction to finding out what they are is \"respect\" and not disgusted aversion, but perhaps some of them have the self awareness to be ashamed to be known for their affiliation.",
                "“and questioned about … his clients”\n\nIf you are not scared, you should be",
                "Apparently it’s not enough for the state to go after those that exercise their right to free speech, but their legal representation too.",
                "US is transforming into an authoritarian regime right before our eyes.",
                "This will get out of hand and we'll be lucky to live through it.",
                "Can someone *not* go along with this super villain shit?\n\n\nAre there no cops in this country with *any* dignity?",
                "It is called fascism. Is that better, everyone?",
                ">This administration is doing something that no administration has done — they're attacking attorneys\n\n\nImagine if the lie of both parties are the same hadn't been pushed for decades? Maybe we'd have more liberal supreme court justices and judges in general. ",
                "If they took his phone, he could easily argue the government violated attorney-client privilege and ask to have his clients’ cases tossed.",
                "Spineless enablers doing all the dirty work they're ordered to do from top to bottom\n\nThey're all accomplices in the installment of a fascist regime\n\nYou would think any sane citizen would refuse to participate but you are witnessing how pathetically their brainwashed minds comply"
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "HOT",
            "title": "Chief Justice Roberts pauses deadline for return of Maryland man mistakenly deported to El Salvador",
            "external_url": "https://apnews.com/article/supreme-court-trump-deportation-salvador-maryland-40136c5aa844b6c12ba20ee67ab4df9a",
            "upvotes": 21164,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“The Executive branch may not seize individuals from the streets, deposit them in foreign prisons in violation of court orders, and then invoke the separation of powers to insulate its unlawful actions from judicial scrutiny,”\n\nWho can disagree with this?",
                "UPDATES: \n\n[Chief Justice John Roberts temporarily lifts order requiring Trump administration to un-deport Dilmar Abrego Garcia from a prison in El Salvador by midnight tonight.](https://www.documentcloud.org/documents/25881586-24a949-admin-stay-and-cfr/)\nhttps://www.documentcloud.org/documents/25881586-24a949-admin-stay-and-cfr/\n\n[Abrego Garcia filed a response already:](https://www.supremecourt.gov/DocketPDF/24/24A949/354927/20250407153131040_2025.04.07%20Respondents%20Opp%20to%20App%20to%20Vacate.pdf)\n\nThe Supreme Court docket doesn't show timestamps, but this was filed around the same time as Chief Justice Roberts' order (which requested a response by tomorrow).",
                "Even if the SC rules against the Trump admin, the fact that they're treating this blatantly illegal and immoral act as the status quo which must stand in the interim is in itself absolutely monstrous.",
                ">But he is no longer in U.S. custody and the government has no way to get him back, the administration argued.\n\nIf this full ordeal passes Supreme Court muster, the Musk/Trump administration can effectively *'memory hole'* anyone. Oopsies we accidentally misplaced [a journalist](https://www.theguardian.com/us-news/2025/apr/07/markwayne-mullin-journalists-violence-comments). Sorry, we accidentally deported a [sitting congresswoman](https://www.axios.com/2025/02/11/ilhan-omar-deport-brandon-gill-fundraisng). It starts here with this.",
                "Then, how are they *ever* supposed to come back? Were they sentenced to life in a foreign prison with no due process? Because, let's be clear about what happened; they were not deported. They were imprisoned.",
                "It would be one thing if we merely deported him where he got off the plane in his home country and we said ‘good luck’. But we took him directly to a notorious prison.",
                "This is the death of ALL civil rights. If the courts can't order his return they can't order yours.",
                "Time for federal courts to start sanctioning and holding DOJ/agency lawyers in contempt. They say they cannot demand someone be returned, but they themselves can spend a night or two in jail to consider it.",
                "**April 19th is the next national day of protest**. Channel the anger into something useful and find a protest near you [here](https://www.fiftyfifty.one) or start one of your own.",
                "Roberts is now complicit in the extrajudicial kidnapping of a man."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Dozens of free measles vaccine clinics close in Texas as federal funding is cut",
            "external_url": "https://www.nbcnews.com/health/health-news/texas-measles-outbreak-dallas-vaccines-hhs-funding-cuts-rcna199144",
            "upvotes": 3610,
            "date": "04/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250326-measles-vaccine-se-336p-1bc8b4.jpg",
            "top_comments": [
                "Republicans love killing children",
                "The amount of destruction that’s happened to critical programs under the current administration is abhorrent. We really didn’t learn anything from the last pandemic I guess",
                "Morals aside, this is stupid financially. So you want a bunch of sick kids taking up hospital resources and perhaps dealing with the ramifications of measles infection for the rest of their lives....vs a fast cheap vaccine. So they are even stupid when it comes to money saving and efficiency.",
                "[removed]",
                "That can't be true. Secretary Roadkill totally said vaccines are best way to fight the measles.",
                "I truly hate the mind virus/worm that has overtaken a portion of the American population. It's like living in a Zombie apocalypse where the virus or parasite is Fox News and a sub-mediocre reality-TV douche.",
                "When you let the dumbest cabinet in the history of this country take over this is what happens.",
                "Some of them Texas \"smarts\".",
                "Did y’all ever notice that ALL of the worst shit always starts in TEXAS? Don’t get me started on women’s rights there!!",
                "No worries though. RFK Jr will show up at your kids funeral if they die from measles"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "US Supreme Court clears way for Alien Enemies Act deportations – but migrants must get court hearing | First Thing",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/08/first-thing-us-supreme-court-clears-way-for-alien-enemies-act-deportations-but-migrants-must-get-court-hearing",
            "upvotes": 454,
            "date": "04/08/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d34e159c401c1c13ef0d18a64d4929dd90a3a9d/0_73_6000_3599/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=11dbabb721f8239c7c2bbadd1bd6a4e1",
            "top_comments": [
                "Must get hearing *in Texas*. Important detail to leave out from the title there because we all know how that will go",
                "\"But migrants must get court hearing\"\n\nHow much you wanna bet that they actually don't get one?",
                "They'll simply find a judge that agrees with them and quickly at that.  Then the race to evil will begin again.",
                "I heard 75% of the deported people were mistakenly identified as gang members. No criminal records. That's insane if true.",
                "I'm gonna make MAGAs life hell anyway I can. I fucking hate them.",
                "Im willing to bet the court hearing will be a Skype call from El Salvador",
                "Devils bargain made by a pack of cowards whose oath and country meant nothing to them.  Easily corrupted by power and pampering from billionaires.",
                "I don’t know how the courts ruled this way when the act was designed to boot out people from a country we are at war with. I mean, why aren’t we deporting Russian and Chinese folks since we are in competition with them. How long till we boot out Canadians?",
                "The hearings will just be a sham.  It'll just be a judge saying everyone's guilty without any actual review.",
                "I'm gonna take a wild guess and assume they're just gonna ignore that last part about migrants getting court hearings."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Villanova Student Demands Man Who Recorded Her Sexual Assault Not Walk at Graduation",
            "external_url": "https://www.phillymag.com/news/2025/04/07/juan-eguiguren-villanova-sexual-assault/",
            "upvotes": 5432,
            "date": "04/07/2025",
            "thumbnail": "https://cdn10.phillymag.com/wp-content/uploads/sites/3/2024/08/villanova-rape-sexual-assault-lawsuit-social.jpg",
            "top_comments": [
                "It's insane to me that this guy was never charged with a crime. It's also insane to me that the actual rapist got a plea bargain with zero prison time.\n\nThis isn't a \"he said, she said\" sort of case, there's *actual fucking video of the guy raping an unconscious woman*. There's zero question regarding whether it happened or whether it was consensual. It did and it wasn't. This is an open-and-shut case. Everyone involved should have been charged and very quickly convicted, and all three of them should be sitting in a prison cell at this very moment.",
                "So he not only filmed the assault in her dorm, the rapist and the cameraman removed her unconscious body and dumped her in a bathroom on the ground floor of the dorm..\n\n\nUmmm what the fuck? Why aren't they both rotting in prison?",
                "name 'em, shame 'em\n\nFuck Juan Eguiguren of Villanova University and Andrew Polun of Towson University for helping and recording the rape of an unconscious woman.\n\nand the biggest fuck you to ELIJAH KATZENELL for raping her. None of these men went to jail for what they did. Disgusting.",
                "> I do have a feeling that this repulsive little man is going to walk across the stage with the rest of us. They’ll read his name. They’ll hand him his diploma. And then he gets to just forget about all this. She’ll never forget.\n\nWe need to start tattooing foreheads or something else permanent, because this is a good point.\n\nThis assault will likely be foundational for the victim, something that shapes the way she lives the rest of her life.\n\nThis guy who recorded and helped dumped her body, along with a third guy who helped \"move her head around\", didn't even get charged with a crime. And the guy who did the actual assaulting didn't even get any jail time.\n\nThey just get to walk away.",
                "We, as a society, should not and cannot allow people like this to just walk away. This young woman’s life will never be the same because of what these assholes did to her. And Villanova should be fucking ashamed of themselves already, notwithstanding possibly allowing this guy to walk at graduation. This is a complete failure by the school administration and the so called “justice system” in the US. Women’s rights, and voices, are being taken away every fucking day and I cannot believe there are not more men standing up about this. I have a mother, a wife, a sister, and a niece. Every time I read something like this it pisses me off that some sexual assaulter/rapist just gets to proceed with their lives while the woman is expected to maintain her silence. It’s infuriating, depressing, and sickening all at once. \n\nEdit: I just wrote an email to the Villanova administration imploring them to not allow this rapist to walk at commencement in front of his victim. That would set a tremendously awful precedent. ",
                "Why are any of these rapist still in School much less graduating. They should be in jail.",
                "The fact that Villanova allowed him to finish his education there is damning.  That's an easy expulsion in my view.  Of COURSE he shouldn't be allowed to walk at the ceremony.",
                "As a Rosemont alumna, I just called Fr Donohue and raised hell. VU and Rosemont alums, join me. Augustinian Catholic values my foot. \nPresident's Phone: 610-519-8881\nFax: 610-519-4514",
                "If they don’t have the moral courage to expel the kid after he recorded and basically participated in a sexual assault, I doubt they’ll suddenly grow it to prevent him from walking at graduation.",
                "Just going to go out there and say to any Villanova redditors:\n\nIf he walks across the stage, boo him, scream out sex offender, do whatever they can to shame that piece of shit off the stage and make his family recordong it, record that their son is a rapist(by association) involved in the crime."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Family of Texas teen accused in fatal stabbing raises over $150K",
            "external_url": "https://www.lmtonline.com/news/article/texas-teen-stabbing-fundraiser-20262648.php",
            "upvotes": 5788,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Unfortunately, the only winners are the lawyers' bank accounts",
                "Wait a minute. The stabbers name is actually Karmelo Anthony?? GTFOH!",
                "He better hope they get a good lawyer with all that money because he sounds guilty as fuck.",
                "I want to know who is donating to this and why??",
                "Bottom line:  Stabbing someone to death is not an appropriate reaction to getting pushed.",
                "I been in track and I’ve been to track as a spectator um. Never needed to kill anyone with a knife",
                "Wild there are people in this thread defending the stabber. You people are nuts.",
                "All you 'stand your ground' jackasses are beyond dumb. He was in another schools tent, was told to leave, reached into his bag and basically said make me then stabbed the kid that tried to make him. This isn't standing your ground. This is being a piece of shit that brought a knife to a track meet looking for trouble. Fuck him, and fuck anyone that's defending him.",
                "Who brings a knife to a track meet? Sorry, but that I don't get. Both families are devastated. Period.",
                "Nah fuck people for using this story for a Left vs Right/White vs Black argument. \n\nI’m as left leaning on the political spectrum nowadays as anyone could be but no matter how many factors you insert into this story, it’s cut and dry. \n\nOnly one party decided to pull out a knife and stab another in the heart. Fuck every other variable, and every one defending the piece of shit that did the crime.\n\nEdit: Also a double fuck you to the person further down and in my DM’s with the “whataboutism” in the Kyle Rittenhouse case. Rittenhouse is a fucking dork and should’ve been guilty too. Again this isn’t a left vs right thing no matter how much TikTok or Faux News is trying to make it out to be"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Sailor killed in Pearl Harbor attack finally ID'd 84 years later, bringing closure to family",
            "external_url": "https://www.nbcnews.com/news/us-news/sailor-killed-pearl-harbor-attack-finally-idd-84-years-later-bringing-rcna199986",
            "upvotes": 6540,
            "date": "04/07/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250407-Neil-D-Frye-ew-1128a-c15aa1.jpg",
            "top_comments": [
                "“My mom used to say she loved to people watch,” McCrimmon told WHRO. “She would go anywhere she could get a chance to go to a little town and just watch all the men go by to see if she could see Neil.” \n\nthat’s so heartbreaking omg\n\nit’s a shame that only his youngest sister is left and not a couple more of his siblings, but I’m glad there was at least one of them left to see this. Rip",
                "I'm glad his family will finally get some closure. It's insane to think about the scale of death and tragedy of WW2. 80 years later, the DPAA is still IDing unknown remains on an almost daily basis. Theyve made a lot of progress lately with remains from Pearl Harbor and Japanese POW camps.",
                "He was so young. That's sad",
                "Still had a baby face. RIP",
                "Just in time for the current admiration to erase his name from history.",
                "He looks like a kid.  How sad.",
                "Im so glad he got to come home.",
                "Rest easy brother. We have the watch.",
                "Look at that face. We had children saving the world, only for one doddering, diaper-filling old coward to dismantle it.",
                "He looks like a kid. I think we sometimes forget how young these heroes were that fought in our wars."
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "HOT",
            "title": "Rubio says US is revoking all visas held by South Sudanese passport holders",
            "external_url": "https://apnews.com/article/rubio-south-sudan-visas-f2716e1871d8d1422546fdc447bac215",
            "upvotes": 1601,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Rubio: we welcome those who come here legally through the official process and obey the law\n\nSouth Sudanese Students: We came here on student visa and haven’t broken any law\n\nRubio: Get out",
                "Good thing there's not an NBA lottery prospect from South Sudan that would bring more publicity to this issue than Rubio probably expected",
                "What are we doing, man?",
                "\"We're not against immigrants, but you have to do it legally\"",
                "This is a death sentence and Rubio knows it.",
                "Many of you in the comments probably already realize this, but this is a test run. South Sudan is in an active Civil War, is a new country in general, and basically has no sway on the world stage whatsoever so basically nobody is going to speak up about this. Same thing with Venezuela, they are intentionally starting what countries and people with little to no recourse to stop this. The idea being that by the time they get to more significant country’s people will be so used to it doesn’t even matter anymore. Don’t let them wear you down with bullshit, and never convince yourself that this is just a one time thing, there is absolutely a more long-term horrible plan in play here",
                "Rubio has to be charged at some point",
                "Marco Rubio is an anchor baby.",
                "Such overt racism - Rubio is from an immigrant family but now you can't even come here legally. All their rhetoric is BS.",
                "And so dumbo falls right in line for the Nazis"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "US Supreme Court clears way for Alien Enemies Act deportations – but migrants must get court hearing | First Thing",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/08/first-thing-us-supreme-court-clears-way-for-alien-enemies-act-deportations-but-migrants-must-get-court-hearing",
            "upvotes": 453,
            "date": "04/08/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d34e159c401c1c13ef0d18a64d4929dd90a3a9d/0_73_6000_3599/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=11dbabb721f8239c7c2bbadd1bd6a4e1",
            "top_comments": [
                "Must get hearing *in Texas*. Important detail to leave out from the title there because we all know how that will go",
                "\"But migrants must get court hearing\"\n\nHow much you wanna bet that they actually don't get one?",
                "They'll simply find a judge that agrees with them and quickly at that.  Then the race to evil will begin again.",
                "I heard 75% of the deported people were mistakenly identified as gang members. No criminal records. That's insane if true.",
                "I'm gonna make MAGAs life hell anyway I can. I fucking hate them.",
                "Im willing to bet the court hearing will be a Skype call from El Salvador",
                "Devils bargain made by a pack of cowards whose oath and country meant nothing to them.  Easily corrupted by power and pampering from billionaires.",
                "I don’t know how the courts ruled this way when the act was designed to boot out people from a country we are at war with. I mean, why aren’t we deporting Russian and Chinese folks since we are in competition with them. How long till we boot out Canadians?",
                "The hearings will just be a sham.  It'll just be a judge saying everyone's guilty without any actual review.",
                "I'm gonna take a wild guess and assume they're just gonna ignore that last part about migrants getting court hearings."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Actor Hirosue Ryoko arrested on suspicion of causing injury",
            "external_url": "https://www3.nhk.or.jp/nhkworld/en/news/20250408_11/",
            "upvotes": 23,
            "date": "04/08/2025",
            "thumbnail": "https://www3.nhk.or.jp/nhkworld/upld/thumbnails/en/news/20250408_11_1512555_L.jpg",
            "top_comments": [
                "For kicking and scratching a nurse. I've heard plenty of stories of much worse over on this side of the pond, with merely a warning dispensed."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Chemical burns, assaults, electric shocks - Gazans tell BBC of torture in Israeli detention",
            "external_url": "https://www.bbc.com/news/articles/cn7vje365rno",
            "upvotes": 168,
            "date": "04/08/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/443f/live/ec86ce60-1132-11f0-ac9f-c37d6fd89579.png",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Budget airline Avelo to fly deportation flights for ICE from Arizona",
            "external_url": "https://apnews.com/article/avelo-airline-deportation-ice-arizona-463bc3e5c65b002c0cca9976be066df6",
            "upvotes": 259,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Not that I’m flying, but it’s good to know to avoid this company going forward.",
                "Can't wait to see current and former employees spill the tea about Avelo.",
                "Brown Shirt Air, reporting for duty!",
                "Absolutely disgusting. Avelo Airlines is now profiting off human suffering by partnering with ICE for deportation flights? Instead of offering affordable travel, they're turning into a private wing of a broken, inhumane immigration system. Boycott this airline — no company should make money tearing families apart.",
                "Instead of trains the fascists are now using airlines",
                "Train companies took Nazi money to shuttle Jews to the camps, this isn't surprising.",
                "Well that gives me one less airline to consider flying with. \n\nThe petition from New Haven Immigrants Coalition mentioned in the article, on Change.org: [https://chng.it/7XPQLF9RsJ](https://chng.it/7XPQLF9RsJ)",
                "He also announced that he would use his planes to bomb Ukraine if there was a decent paycheck.",
                "Fuck these capitalist vultures. I’m losing it from inflation devouring my paycheck, and i can’t get a decent doctor cause healthcare is basically a joke. every day i see trump’s lingering toxic vibes fueling more bullshit. we’re all stuck in a broken system that worships money while we drown in student debt. i’m done pretending. tear it all down, rebuild from the ashes, maybe?",
                "[removed]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Trump administration fires senior Navy female officer at NATO. She appeared on a 'woke' list",
            "external_url": "https://apnews.com/article/pentagon-hegseth-trump-dei-chatfield-nato-23df15b59766458d106567ba782d2f15",
            "upvotes": 15105,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*The letter said Chatfield posted supportive comments on LinkedIn about a diversity summit and gave a speech in 2015 at Women’s Equality Day. The group quoted her as saying that investing in empowering women can unlock human potential.*\n\n*And they also said she was quoted as saying, “our diversity is our strength” — a phrase that Hegseth has repeatedly condemned.*\n\n\nShe was fired for years old comments that didn't draw any ire if you are a rational adult.",
                "This is the administration blatantly being assholes in broad daylight and seemingly getting away with it. \n\nTrump and the GOP are making a mockery of this once great country.\nTheir pettiness knows no bounds, they are off the leash, shitting and pissing on everything, pandering to the MAGA weirdos and destroying any goodwill with our allies. \nHow is anyone OK with this?",
                "When this is over, they need to mount a plaque at the Pentagon with the names of all the service members that were sacrificed in the name of MAGA's woke phobia.",
                "I assume denounciations, false accusations by right wing influencers and grifters will slowly deplete our government and armed forces of competent employees and leaders. What could possibly go wrong?",
                "Admiraling while female is enough to get you fired these days.",
                "Evangelicals are worried about the persecution of Christians.\n\nJesus reached out to the marginalized. He’d be considered ‘woke’.\n\nAnd woke is now being persecuted.",
                "They just can’t stand smart women.",
                "This is a wild and scary timeline! For as long as I've been working (20 years) making openly discriminatory statements would (rightfully) get you fired. Now saying you SHOULDN'T discriminate is a reason to be fired? When will \"hate quotas\" become a requirement for employment? Will people start getting fired if they DON'T  use slurs against others? Will employees have to organize group harassment initiatives against people considered \"other\"? Where is the line?",
                "You know…once they get rid of all the “woke” people, they’re gonna have to work with just each other and realize how insufferable they actually are. And likely, how incompetent they all are…annnnndd we have reached the year of Idiocracy.",
                "I guess I have to keep mentioning this.... I mean... it only happened a year ago, but here we go... again:\n\nLast year Bangladesh had a revolution for \\[checking my notes, dramatically\\] basically filling all the government jobs with party loyalists....\n\nNow Trump and co. are \\[checking my notes, dramatically\\] basically filling all the government jobs with party loyalists....\n\nThis should end well...."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Nevada man arrested after 7 'emotional support' tigers are seized from his home",
            "external_url": "https://www.nbcnews.com/news/us-news/nevada-man-arrested-7-emotional-support-tigers-seized-home-rcna199984",
            "upvotes": 463,
            "date": "04/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250407-tigers-nevada-mn-1045-b39e42.jpg",
            "top_comments": [
                "What sort of emotional trauma was he experiencing that even 6 tigers couldn’t fix?",
                ">Officials raided Karl Mitchell's home in Pahrump on Wednesday morning and arrested him on suspicion of resisting arrest. \n\nUh, what? The lack of permits is one thing. But how does one get arrested on suspicion of resisting arrest? Seems a legal tautology is afoot.",
                "Emotional support tigers is a thing I never knew I needed in my life.",
                "Was expecting to read that he was from Florida originally",
                "I want an emotional support octopus.",
                "Keeping several big animals in cage for \"emotional support\"...\n\nDude should be put in cage and used as an emotional support for group therapy.\n\nArrogant criminal POS.",
                "Does emotional support in this case mean ripping your head off and carrying it around",
                "He will never financially recover from this. ",
                "I volunteered at a Nevada zoo and at least in 2010 they were a pretty friendly you-owning-bunch-of-tigers state, like you’d have to really mess up to get to this point. Like if you had ranch property and proper enclosures where they can’t get out and permits for all of this you were probably fine. I don’t know the finer points of Nevada big cat ownership laws or what they’re like now.\n\nI know that our cougar used to live in somebody’s house and they donated her to us because she’d do normal cat stuff like clawing furniture or getting up on tables and batting things off to watch them fall, but she was a cougar so this was like lamps and coffee makers",
                "Hey buddy, save some for the rest of us. You're not the only one who needs emotional support in these trying times."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Rubio says US is revoking all visas held by South Sudanese passport holders",
            "external_url": "https://apnews.com/article/rubio-south-sudan-visas-f2716e1871d8d1422546fdc447bac215",
            "upvotes": 1613,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Rubio: we welcome those who come here legally through the official process and obey the law\n\nSouth Sudanese Students: We came here on student visa and haven’t broken any law\n\nRubio: Get out",
                "Good thing there's not an NBA lottery prospect from South Sudan that would bring more publicity to this issue than Rubio probably expected",
                "What are we doing, man?",
                "\"We're not against immigrants, but you have to do it legally\"",
                "This is a death sentence and Rubio knows it.",
                "Many of you in the comments probably already realize this, but this is a test run. South Sudan is in an active Civil War, is a new country in general, and basically has no sway on the world stage whatsoever so basically nobody is going to speak up about this. Same thing with Venezuela, they are intentionally starting what countries and people with little to no recourse to stop this. The idea being that by the time they get to more significant country’s people will be so used to it doesn’t even matter anymore. Don’t let them wear you down with bullshit, and never convince yourself that this is just a one time thing, there is absolutely a more long-term horrible plan in play here",
                "Rubio has to be charged at some point",
                "Marco Rubio is an anchor baby.",
                "Such overt racism - Rubio is from an immigrant family but now you can't even come here legally. All their rhetoric is BS.",
                "And so dumbo falls right in line for the Nazis"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Detained students sent to remote ICE facilities in Louisiana accused of human rights abuses",
            "external_url": "https://www.nbcnews.com/news/us-news/ice-student-detainees-louisiana-mahmoud-khalil-alireza-doroudi-rcna198959",
            "upvotes": 1234,
            "date": "04/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250401-ice-detention-center-lasalle-jena-louisiana-vl-1148a-01dfe4.jpg",
            "top_comments": [
                "The article says the facility has tainted water, served expired food, and detainees weren’t given any medical care at all and people were walking around with uncovered open wounds.",
                "The facilities are accused of rights abuses, not the students\n\nShit headline",
                "On today’s episode of “If Any Other Administration Did This They’d Get Impeached…”\n\nBut it’s Trump so he gets a pass.",
                "Fascist government conduct being drip-drip normalized in the USA.\n\nToday the Supreme Court demonstrated that it will back this Dictator's contempt for rule of law.",
                "Keyword \"students\". We are only year one of this administration, wait those protest start ramping up and the military get involved. Things aren't looking good...",
                "We don't need to send them to a El Salvador terrorist prison when we got such great shithole detention centers in Louisiana.  Buy American, Incarcerate American.",
                "God it is so depressing that there are so many  awful things happening to humans all around us right now",
                "We are detaining people here legally, and sending them to random ice facilities rife with abuse for…being pro Palestine.  \n\nThis is incredibly fucked up.",
                "The biggest threat to this administration is students. That's very telling.",
                "I now equate ICE with the Nazi SS. I have for a while, but anyone who continues to work for ICE is just contributing to the problem. Stop hiding your faces when you go out and grab people, quit. There is nothing moral or ethical about being an ICE agent. Every action by them is blatantly unconstitutional and wholly unconscionable."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Dozens of free measles vaccine clinics close in Texas as federal funding is cut",
            "external_url": "https://www.nbcnews.com/health/health-news/texas-measles-outbreak-dallas-vaccines-hhs-funding-cuts-rcna199144",
            "upvotes": 3606,
            "date": "04/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250326-measles-vaccine-se-336p-1bc8b4.jpg",
            "top_comments": [
                "Republicans love killing children",
                "The amount of destruction that’s happened to critical programs under the current administration is abhorrent. We really didn’t learn anything from the last pandemic I guess",
                "Morals aside, this is stupid financially. So you want a bunch of sick kids taking up hospital resources and perhaps dealing with the ramifications of measles infection for the rest of their lives....vs a fast cheap vaccine. So they are even stupid when it comes to money saving and efficiency.",
                "[removed]",
                "That can't be true. Secretary Roadkill totally said vaccines are best way to fight the measles.",
                "I truly hate the mind virus/worm that has overtaken a portion of the American population. It's like living in a Zombie apocalypse where the virus or parasite is Fox News and a sub-mediocre reality-TV douche.",
                "When you let the dumbest cabinet in the history of this country take over this is what happens.",
                "Some of them Texas \"smarts\".",
                "Did y’all ever notice that ALL of the worst shit always starts in TEXAS? Don’t get me started on women’s rights there!!",
                "No worries though. RFK Jr will show up at your kids funeral if they die from measles"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Lawyer for U-M protester detained at airport after spring break trip with family",
            "external_url": "https://www.freep.com/story/news/local/michigan/wayne/2025/04/07/lawyer-for-u-m-protester-held-at-airport-refused-to-give-feds-his-phone/82978891007/",
            "upvotes": 6390,
            "date": "04/08/2025",
            "thumbnail": "https://www.freep.com/gcdn/authoring/authoring-images/2025/04/07/PDTF/82982490007-amir-makled.png?crop=558,314,x0,y66&width=558&height=314&format=pjpg&auto=webp",
            "top_comments": [
                "You have to wonder about the type of person who willingly engages in these Gestapo tactics. I wonder what they try to pretend their profession is to others. They might be delusional enough to think the common reaction to finding out what they are is \"respect\" and not disgusted aversion, but perhaps some of them have the self awareness to be ashamed to be known for their affiliation.",
                "“and questioned about … his clients”\n\nIf you are not scared, you should be",
                "Apparently it’s not enough for the state to go after those that exercise their right to free speech, but their legal representation too.",
                "US is transforming into an authoritarian regime right before our eyes.",
                "This will get out of hand and we'll be lucky to live through it.",
                "Can someone *not* go along with this super villain shit?\n\n\nAre there no cops in this country with *any* dignity?",
                "It is called fascism. Is that better, everyone?",
                ">This administration is doing something that no administration has done — they're attacking attorneys\n\n\nImagine if the lie of both parties are the same hadn't been pushed for decades? Maybe we'd have more liberal supreme court justices and judges in general. ",
                "If they took his phone, he could easily argue the government violated attorney-client privilege and ask to have his clients’ cases tossed.",
                "Spineless enablers doing all the dirty work they're ordered to do from top to bottom\n\nThey're all accomplices in the installment of a fascist regime\n\nYou would think any sane citizen would refuse to participate but you are witnessing how pathetically their brainwashed minds comply"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "US Supreme Court clears way for Alien Enemies Act deportations – but migrants must get court hearing | First Thing",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/08/first-thing-us-supreme-court-clears-way-for-alien-enemies-act-deportations-but-migrants-must-get-court-hearing",
            "upvotes": 450,
            "date": "04/08/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d34e159c401c1c13ef0d18a64d4929dd90a3a9d/0_73_6000_3599/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=11dbabb721f8239c7c2bbadd1bd6a4e1",
            "top_comments": [
                "Must get hearing *in Texas*. Important detail to leave out from the title there because we all know how that will go",
                "\"But migrants must get court hearing\"\n\nHow much you wanna bet that they actually don't get one?",
                "They'll simply find a judge that agrees with them and quickly at that.  Then the race to evil will begin again.",
                "I heard 75% of the deported people were mistakenly identified as gang members. No criminal records. That's insane if true.",
                "I'm gonna make MAGAs life hell anyway I can. I fucking hate them.",
                "Im willing to bet the court hearing will be a Skype call from El Salvador",
                "Devils bargain made by a pack of cowards whose oath and country meant nothing to them.  Easily corrupted by power and pampering from billionaires.",
                "I don’t know how the courts ruled this way when the act was designed to boot out people from a country we are at war with. I mean, why aren’t we deporting Russian and Chinese folks since we are in competition with them. How long till we boot out Canadians?",
                "The hearings will just be a sham.  It'll just be a judge saying everyone's guilty without any actual review.",
                "I'm gonna take a wild guess and assume they're just gonna ignore that last part about migrants getting court hearings."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Chemical burns, assaults, electric shocks - Gazans tell BBC of torture in Israeli detention",
            "external_url": "https://www.bbc.com/news/articles/cn7vje365rno",
            "upvotes": 165,
            "date": "04/08/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/443f/live/ec86ce60-1132-11f0-ac9f-c37d6fd89579.png",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Dozens of free measles vaccine clinics close in Texas as federal funding is cut",
            "external_url": "https://www.nbcnews.com/health/health-news/texas-measles-outbreak-dallas-vaccines-hhs-funding-cuts-rcna199144",
            "upvotes": 3607,
            "date": "04/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250326-measles-vaccine-se-336p-1bc8b4.jpg",
            "top_comments": [
                "Republicans love killing children",
                "The amount of destruction that’s happened to critical programs under the current administration is abhorrent. We really didn’t learn anything from the last pandemic I guess",
                "Morals aside, this is stupid financially. So you want a bunch of sick kids taking up hospital resources and perhaps dealing with the ramifications of measles infection for the rest of their lives....vs a fast cheap vaccine. So they are even stupid when it comes to money saving and efficiency.",
                "[removed]",
                "That can't be true. Secretary Roadkill totally said vaccines are best way to fight the measles.",
                "I truly hate the mind virus/worm that has overtaken a portion of the American population. It's like living in a Zombie apocalypse where the virus or parasite is Fox News and a sub-mediocre reality-TV douche.",
                "When you let the dumbest cabinet in the history of this country take over this is what happens.",
                "Some of them Texas \"smarts\".",
                "Did y’all ever notice that ALL of the worst shit always starts in TEXAS? Don’t get me started on women’s rights there!!",
                "No worries though. RFK Jr will show up at your kids funeral if they die from measles"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Budget airline Avelo to fly deportation flights for ICE from Arizona",
            "external_url": "https://apnews.com/article/avelo-airline-deportation-ice-arizona-463bc3e5c65b002c0cca9976be066df6",
            "upvotes": 264,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Not that I’m flying, but it’s good to know to avoid this company going forward.",
                "Can't wait to see current and former employees spill the tea about Avelo.",
                "Brown Shirt Air, reporting for duty!",
                "Absolutely disgusting. Avelo Airlines is now profiting off human suffering by partnering with ICE for deportation flights? Instead of offering affordable travel, they're turning into a private wing of a broken, inhumane immigration system. Boycott this airline — no company should make money tearing families apart.",
                "Instead of trains the fascists are now using airlines",
                "Train companies took Nazi money to shuttle Jews to the camps, this isn't surprising.",
                "Well that gives me one less airline to consider flying with. \n\nThe petition from New Haven Immigrants Coalition mentioned in the article, on Change.org: [https://chng.it/7XPQLF9RsJ](https://chng.it/7XPQLF9RsJ)",
                "He also announced that he would use his planes to bomb Ukraine if there was a decent paycheck.",
                "Fuck these capitalist vultures. I’m losing it from inflation devouring my paycheck, and i can’t get a decent doctor cause healthcare is basically a joke. every day i see trump’s lingering toxic vibes fueling more bullshit. we’re all stuck in a broken system that worships money while we drown in student debt. i’m done pretending. tear it all down, rebuild from the ashes, maybe?",
                "[removed]"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Trump administration fires senior Navy female officer at NATO. She appeared on a 'woke' list",
            "external_url": "https://apnews.com/article/pentagon-hegseth-trump-dei-chatfield-nato-23df15b59766458d106567ba782d2f15",
            "upvotes": 15116,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*The letter said Chatfield posted supportive comments on LinkedIn about a diversity summit and gave a speech in 2015 at Women’s Equality Day. The group quoted her as saying that investing in empowering women can unlock human potential.*\n\n*And they also said she was quoted as saying, “our diversity is our strength” — a phrase that Hegseth has repeatedly condemned.*\n\n\nShe was fired for years old comments that didn't draw any ire if you are a rational adult.",
                "This is the administration blatantly being assholes in broad daylight and seemingly getting away with it. \n\nTrump and the GOP are making a mockery of this once great country.\nTheir pettiness knows no bounds, they are off the leash, shitting and pissing on everything, pandering to the MAGA weirdos and destroying any goodwill with our allies. \nHow is anyone OK with this?",
                "When this is over, they need to mount a plaque at the Pentagon with the names of all the service members that were sacrificed in the name of MAGA's woke phobia.",
                "I assume denounciations, false accusations by right wing influencers and grifters will slowly deplete our government and armed forces of competent employees and leaders. What could possibly go wrong?",
                "Admiraling while female is enough to get you fired these days.",
                "Evangelicals are worried about the persecution of Christians.\n\nJesus reached out to the marginalized. He’d be considered ‘woke’.\n\nAnd woke is now being persecuted.",
                "They just can’t stand smart women.",
                "This is a wild and scary timeline! For as long as I've been working (20 years) making openly discriminatory statements would (rightfully) get you fired. Now saying you SHOULDN'T discriminate is a reason to be fired? When will \"hate quotas\" become a requirement for employment? Will people start getting fired if they DON'T  use slurs against others? Will employees have to organize group harassment initiatives against people considered \"other\"? Where is the line?",
                "You know…once they get rid of all the “woke” people, they’re gonna have to work with just each other and realize how insufferable they actually are. And likely, how incompetent they all are…annnnndd we have reached the year of Idiocracy.",
                "I guess I have to keep mentioning this.... I mean... it only happened a year ago, but here we go... again:\n\nLast year Bangladesh had a revolution for \\[checking my notes, dramatically\\] basically filling all the government jobs with party loyalists....\n\nNow Trump and co. are \\[checking my notes, dramatically\\] basically filling all the government jobs with party loyalists....\n\nThis should end well...."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Detained students sent to remote ICE facilities in Louisiana accused of human rights abuses",
            "external_url": "https://www.nbcnews.com/news/us-news/ice-student-detainees-louisiana-mahmoud-khalil-alireza-doroudi-rcna198959",
            "upvotes": 1240,
            "date": "04/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250401-ice-detention-center-lasalle-jena-louisiana-vl-1148a-01dfe4.jpg",
            "top_comments": [
                "The article says the facility has tainted water, served expired food, and detainees weren’t given any medical care at all and people were walking around with uncovered open wounds.",
                "The facilities are accused of rights abuses, not the students\n\nShit headline",
                "On today’s episode of “If Any Other Administration Did This They’d Get Impeached…”\n\nBut it’s Trump so he gets a pass.",
                "Fascist government conduct being drip-drip normalized in the USA.\n\nToday the Supreme Court demonstrated that it will back this Dictator's contempt for rule of law.",
                "Keyword \"students\". We are only year one of this administration, wait those protest start ramping up and the military get involved. Things aren't looking good...",
                "We don't need to send them to a El Salvador terrorist prison when we got such great shithole detention centers in Louisiana.  Buy American, Incarcerate American.",
                "God it is so depressing that there are so many  awful things happening to humans all around us right now",
                "We are detaining people here legally, and sending them to random ice facilities rife with abuse for…being pro Palestine.  \n\nThis is incredibly fucked up.",
                "The biggest threat to this administration is students. That's very telling.",
                "I now equate ICE with the Nazi SS. I have for a while, but anyone who continues to work for ICE is just contributing to the problem. Stop hiding your faces when you go out and grab people, quit. There is nothing moral or ethical about being an ICE agent. Every action by them is blatantly unconstitutional and wholly unconscionable."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Nevada man arrested after 7 'emotional support' tigers are seized from his home",
            "external_url": "https://www.nbcnews.com/news/us-news/nevada-man-arrested-7-emotional-support-tigers-seized-home-rcna199984",
            "upvotes": 460,
            "date": "04/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250407-tigers-nevada-mn-1045-b39e42.jpg",
            "top_comments": [
                "What sort of emotional trauma was he experiencing that even 6 tigers couldn’t fix?",
                ">Officials raided Karl Mitchell's home in Pahrump on Wednesday morning and arrested him on suspicion of resisting arrest. \n\nUh, what? The lack of permits is one thing. But how does one get arrested on suspicion of resisting arrest? Seems a legal tautology is afoot.",
                "Emotional support tigers is a thing I never knew I needed in my life.",
                "Was expecting to read that he was from Florida originally",
                "I want an emotional support octopus.",
                "Keeping several big animals in cage for \"emotional support\"...\n\nDude should be put in cage and used as an emotional support for group therapy.\n\nArrogant criminal POS.",
                "Does emotional support in this case mean ripping your head off and carrying it around",
                "He will never financially recover from this. ",
                "I volunteered at a Nevada zoo and at least in 2010 they were a pretty friendly you-owning-bunch-of-tigers state, like you’d have to really mess up to get to this point. Like if you had ranch property and proper enclosures where they can’t get out and permits for all of this you were probably fine. I don’t know the finer points of Nevada big cat ownership laws or what they’re like now.\n\nI know that our cougar used to live in somebody’s house and they donated her to us because she’d do normal cat stuff like clawing furniture or getting up on tables and batting things off to watch them fall, but she was a cougar so this was like lamps and coffee makers",
                "Hey buddy, save some for the rest of us. You're not the only one who needs emotional support in these trying times."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Rubio says US is revoking all visas held by South Sudanese passport holders",
            "external_url": "https://apnews.com/article/rubio-south-sudan-visas-f2716e1871d8d1422546fdc447bac215",
            "upvotes": 1606,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Rubio: we welcome those who come here legally through the official process and obey the law\n\nSouth Sudanese Students: We came here on student visa and haven’t broken any law\n\nRubio: Get out",
                "Good thing there's not an NBA lottery prospect from South Sudan that would bring more publicity to this issue than Rubio probably expected",
                "What are we doing, man?",
                "\"We're not against immigrants, but you have to do it legally\"",
                "This is a death sentence and Rubio knows it.",
                "Many of you in the comments probably already realize this, but this is a test run. South Sudan is in an active Civil War, is a new country in general, and basically has no sway on the world stage whatsoever so basically nobody is going to speak up about this. Same thing with Venezuela, they are intentionally starting what countries and people with little to no recourse to stop this. The idea being that by the time they get to more significant country’s people will be so used to it doesn’t even matter anymore. Don’t let them wear you down with bullshit, and never convince yourself that this is just a one time thing, there is absolutely a more long-term horrible plan in play here",
                "Rubio has to be charged at some point",
                "Marco Rubio is an anchor baby.",
                "Such overt racism - Rubio is from an immigrant family but now you can't even come here legally. All their rhetoric is BS.",
                "And so dumbo falls right in line for the Nazis"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court allows Trump to enforce Alien Enemies Act for rapid deportations for now",
            "external_url": "https://edition.cnn.com/2025/04/07/politics/supreme-court-deportation-flights-trump/index.html",
            "upvotes": 19935,
            "date": "04/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21484239-3434220-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> The unsigned decision in the case, the most closely watched emergency appeal pending at the Supreme Court, lets Trump invoke the 1798 law to speed removals while litigation over the act’s use plays out in lower courts. The court stressed that people deported going forward should receive notice they are subject to the act and an opportunity to have their removal reviewed.\n\nThis strikes me as SCOTUS knowing it won't stand up, but wanting to give the administration more time to mass deport people until the cases play out in the lower courts and actually require a final decision from them. It's the same thing they did with the presidential immunity case. Delay enough that the damage is done by the time they make a decision.\n\n\n> The court’s three liberal justices dissented from the decision, and Justice Amy Coney Barrett, a member of the court’s conservative wing, partially dissented.\n\nAmy Coney Barrett being the dark horse. I know it's only a partial dissent, but of the conservative justices, she's seemed the most likely to not go blindly along.",
                "AP article - \"In a bitterly divided 5-4 decision, the court said the migrants still must get a chance to challenge their deportation before they are taken out of the country and said the Trump administration must give them “reasonable time” to go to court.\n\nBut the conservative majority said the legal challenges must take place in Texas, instead of a Washington courtroom.\"",
                "Oh, is this the same Supreme Court that gave Trump broad immunity from prosecution for illegal acts he committed during his time as President?",
                "OFC they are. They are Trump puppets.",
                "This order is going to immediately be abused despite everyone knowing what’s going to happen.  The Supreme Court just shit its pants and leaving us with the mess.  If you look like someone who could be deported. you might want to start carrying information that proves your citizenship, but let’s be real it probably won’t matter to ice.  You can be damn sure that trump and his band of dip ships will do everything in their power to make sure any errors that result in people being harmed won’t be fixed.",
                "The Supreme Court is allowing Trump to break the law and seize unconstitutional power. How dare they disgrace our nation.",
                "Congress never declared war, so I guess it is official. Congress is no longer needed unless a Democrat is President.",
                "Like Cory Booker said, if there’s no due process, how do we know that an American citizen wont be deported.\n\nTrump will use this as justification to escalate.",
                "\"Supreme Court Anoints Trump Emperor With Power to Arrest and Deport Anyone Without Recourse\"\n\nftfy",
                "Remember when the supreme Court said that forgiving student debt was a unlawful use of presidential executive orders?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Lawyer for U-M protester detained at airport after spring break trip with family",
            "external_url": "https://www.freep.com/story/news/local/michigan/wayne/2025/04/07/lawyer-for-u-m-protester-held-at-airport-refused-to-give-feds-his-phone/82978891007/",
            "upvotes": 6395,
            "date": "04/08/2025",
            "thumbnail": "https://www.freep.com/gcdn/authoring/authoring-images/2025/04/07/PDTF/82982490007-amir-makled.png?crop=558,314,x0,y66&width=558&height=314&format=pjpg&auto=webp",
            "top_comments": [
                "You have to wonder about the type of person who willingly engages in these Gestapo tactics. I wonder what they try to pretend their profession is to others. They might be delusional enough to think the common reaction to finding out what they are is \"respect\" and not disgusted aversion, but perhaps some of them have the self awareness to be ashamed to be known for their affiliation.",
                "“and questioned about … his clients”\n\nIf you are not scared, you should be",
                "Apparently it’s not enough for the state to go after those that exercise their right to free speech, but their legal representation too.",
                "US is transforming into an authoritarian regime right before our eyes.",
                "This will get out of hand and we'll be lucky to live through it.",
                "Can someone *not* go along with this super villain shit?\n\n\nAre there no cops in this country with *any* dignity?",
                "It is called fascism. Is that better, everyone?",
                ">This administration is doing something that no administration has done — they're attacking attorneys\n\n\nImagine if the lie of both parties are the same hadn't been pushed for decades? Maybe we'd have more liberal supreme court justices and judges in general. ",
                "If they took his phone, he could easily argue the government violated attorney-client privilege and ask to have his clients’ cases tossed.",
                "Spineless enablers doing all the dirty work they're ordered to do from top to bottom\n\nThey're all accomplices in the installment of a fascist regime\n\nYou would think any sane citizen would refuse to participate but you are witnessing how pathetically their brainwashed minds comply"
            ],
            "aggregate_sentiment": 38.0
        }
    ],
    "last_updated": "04/08/2025 12:16:17 UTC"
}