{
    "posts": [
        {
            "category": "HOT",
            "title": "Trump administration plans to end the IRS Direct File program for free tax filing, AP sources say",
            "external_url": "https://apnews.com/article/irs-direct-file-tax-returns-free-trump-4bb0bca02fab9b3d06ae6f45ac67b7ab",
            "upvotes": 21432,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*\"Republican lawmakers and commercial tax preparation companies complained it was a waste of taxpayer money\"*  \n\nThe places that are making money from filing taxes and selling peoples information are saying it's a waste of taxpayer money.   As a taxpayer I disagree with them.",
                "“We want the worst for everyone!”\n\n“We are just plain evil”",
                "What if I just don't do my taxes correctly like him?",
                "> The program developed during Joe Biden’s presidency was credited by users with making tax filing easy, fast and economical. But Republican lawmakers and commercial tax preparation companies complained it was a waste of taxpayer money because free filing programs already exist, although they are hard to use.\n\nPeople who like this software: users\n\nPeople who don’t: Republican lawmakers and tax preparation software companies (TurboTax)\n\nPick a side, folks.",
                "I filed my taxes with this in less than 30 minutes and got my return in less than week. Obviously its a terrible inefficient program that needs to go. /s",
                "Every decision, the benefit of our enemies.",
                "MAGA : Let's remove DirectFile, which people like and makes sense.\n\nMAGA : Let's not go after TurboTax though, which is outright scamming us.",
                "It cost $100 to file taxes under H&R Block services. That is insane when the IRS already has our information! It’s ridiculous.",
                "I wonder how much Intuit and H&R Block paid for this. It doesn't help anyone but them to get rid of this service.",
                "Been using freetaxusa"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "US IRS planning to rescind Harvard's tax-exempt status",
            "external_url": "https://www.reuters.com/world/us/us-irs-planning-rescind-harvards-tax-exempt-status-cnn-reports-2025-04-16/",
            "upvotes": 5093,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Isn't it illegal for the president to get the IRS to do that?\n\n\"Prohibition on executive branch influence over taxpayer audits and other investigations\"\n\n[Stated here](https://www.law.cornell.edu/uscode/text/26/7217)",
                "All is fair then when the shoe is on the other foot...every church that participated in preaching about voting (at all for anyone) should lose their tax exempt status too",
                "This is going to be drawn out in court for a long time. Harvard isn't likely to back down.",
                "That's great! That means the next time we have a democratic president in we can just start pulling the tax exempt status of churches right? Just whomever we don't like?",
                "Remember when conservatives cried persecution because the IRS showed extra scrutiny to conservative groups based on keyword usage? (The IRS also did the same for liberal groups as well but conservatives just ignored that since it didn't support their worldview)",
                "Harvard may know some lawyers who can represent them in court.",
                "\"The essence of fascism is to make laws forbidding everything and then enforce them selectively against your enemies.\" - John Lescroart, A Plague of Secrets.",
                "I hope Harvard doesn't blink, here. Stand up for yourselves. Stand up for all of us.",
                "Oh, good.  The dollar is collapsing, U.S. bonds are becoming more unstable and disfavored globally every day, stock market volatility is off the charts with every indication that the bottom is going to fall out, the FED chairman just cautioned that Trump's tariffs are putting the country on track for devastating stagflation ... and instead of dealing with any of this the White House is hyper-focused on abusing the power of the federal government to exact petty retributions against perceived political enemies.  Any Trump supporters want to defend this daily shitshow?",
                "Man the fascism is being ramped up real quick, anyone still have a problem with calling trump a fascist and the death of democracy in america?"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "California the 1st state to sue Trump administration over tariffs",
            "external_url": "https://www.cbc.ca/news/world/california-newsom-trump-tariffs-1.7511493",
            "upvotes": 21359,
            "date": "04/16/2025",
            "thumbnail": "https://i.cbc.ca/1.7511588.1744814544!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_1180/usa-trump.JPG?im=Resize%3D620",
            "top_comments": [
                "Makes a lot of sense. Out of the 50 states, California has the largest economy — the tariffs would significantly impact the golden state",
                "Here's to hoping he gets a preliminary injunction. The Supreme Court will side with Trump in the end, but not if Republicans finally grow a spine and help pass a bill that limits Trump's powers.",
                "LETS GO Washington, Oregon, Illinois... get on board with this.",
                "California is getting specifically targeted/fucked by Trump. National parks, tourism, trade, agriculture (the water thing). \n\nMakes me want to not pay my federal taxes. Not like anyone works at the IRS anymore.",
                "What use is a lawsuit to someone who doesn’t even have to obey the Supreme Court?",
                "Hope the rest follow suit.\n\n\nMake him regret this.",
                "Sue his ass for everything at this point",
                "Proud to live in California. Just watched Newsom’s news conference on it. Really good points made. \n\n“President can’t do unlawful things.” Damn right.\n\nETA: Some of the people here don’t know the history of what happens when Cali sues Trump. \n\nCalifornia has brought over 100 lawsuits against Trump—a majority being during Trump 1.0. 15 so far for Trump 2.0. And in many of those, gains have been made. Lawsuits can work and do work. So it’s not a waste of time for them to be doing this. If anything they’ve fired the first shot, other states will hopefully follow.",
                "As ashamed as I am to be American these days, I'm proud to be a Californian.",
                "I don't think this lawsuit will go anywhere, and will probably be thrown out since tariffs are an international issue with the federal government, not with states.\n\nBut more power to him to try."
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "HOT",
            "title": "Missing toddler who walked 7 miles alone through Arizona wilderness led to safety by rancher's dog",
            "external_url": "https://www.nbcnews.com/news/us-news/missing-toddler-walked-7-miles-alone-arizona-wilderness-led-safety-ran-rcna201479?utm_source=firefox-newtab-en-us",
            "upvotes": 3596,
            "date": "04/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250416-kid-rescue-ch-0514-b0f001.jpg",
            "top_comments": [
                "\n\"I got in my truck to go to town and I see Buford walking down the side of the fence with a little blond kid with him. I had heard about the missing child this morning, so I knew it was him.\"\n\n\nBuford, (best name ever), probably only walked with him about a mile, but the dog did find him.",
                "I hope Buford got a nice treat for being a good boy.",
                "the goodest of good boys.",
                "Cause dogs are awesome. ",
                "7 miles for a 2 year old!",
                "I have a Pyrenees mix (Buford is a full Pyr) and they are one of the smartest and self-sufficient dog breeds.  They can make decisions on their own and I can believe the doggo worked out that the kid shouldn't have been there and that the best thing to do was to lead him home, like a sheep.  They are also hard headed and stubborn, because they believe they are smarter than we are...",
                "It followed me home, dad, can I keep him?",
                "“The more I learn about people, the more I like dogs”",
                "Buford finds small human, herds him to safety. Dogs are the best.",
                "Great to read a positive story with a good ending"
            ],
            "aggregate_sentiment": 78.0
        },
        {
            "category": "HOT",
            "title": "The State Department closes the office that flags disinformation from Russia, China and Iran",
            "external_url": "https://apnews.com/article/rubio-disinformation-russia-china-iran-d53d00551a0a57f3114431c624db0b0f?utm_source=reddit&utm_medium=share",
            "upvotes": 2895,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The only flag the State Department cares about now is the white flag to keep bending over for Russia. This country used to know how to handle traitors.",
                "Wonder if anyone on the Right will hear about this.",
                "Pointless anyway. Didn’t flag Trump‘s blatant Russian propaganda at all",
                "cant say theyve been working hard anyway for the past oh... 10 years?...",
                "I would be surprised but I'm not.",
                "..and Palm Beach County Florida..",
                "And you think Russia, China, and Iran will slow down their operations to try shit on us right now? \n\nTrump is dragging us all down.",
                "Who's even fucking surprised anymore",
                "Imagine being Putin’s buttslut this bad god damn",
                "Yes they're clicking their hobnail boots together wishing away any kind of entity that points out disinformation. Think about it it's in their own best interest to normalize disinformation these are the stepping Stones of authoritarian government. There is a video on YouTube called don't be a sucker from the end of world War II put out by the army people might want to watch."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "JPMorgan Chase sues more customers who allegedly stole cash in 'infinite money glitch'",
            "external_url": "https://www.cnbc.com/2025/04/16/jpmorgan-chase-infinite-money-glitch-bank-lawsuits.html",
            "upvotes": 6059,
            "date": "04/16/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108065444-1732060726356-gettyimages-2185023708-AFP_36MW3R2.jpeg?v=1732060988&w=1920&h=1080",
            "top_comments": [
                "> JPMorgan is also considering pushing back against the bankruptcy filings of alleged “infinite money” fraudsters.\nIn one of the bank’s motions made this week in bankruptcy court in Grand Rapids, Michigan, the company asked a judge for more time to object to the customer’s attempt to discharge his or her debts.\n\nIt is amazing that people have screwed up their lives and finances for YEARS over a trend they saw online. A ChexSystems blacklist is not a fun thing to deal with.",
                "I used to work at a bank. It’s amazing how much check fraud is out there and how susceptible young people are to going through with it. \n\nIt’s usually teenagers that get in trouble. Older people give them a bad check to deposit and promise the kids a share of it. Then the adults get 75% or whatever and the kid winds up being on the hook for the whole thing when it bounces. \n\nIt was pretty sad",
                "Check Fraud. They committed check fraud.",
                "I mean, if you don’t prosecute every single one of them then some idiot on TikTok will double down and say that this actually worked, and he faced no consequences, and the whole thing will start over again.",
                "With everything going on right now, I had forgotten that a bunch of people had committed check fraud while thinking it was a real world \"infinite money glitch.\" As much as I dislike Chase, I'm glad I got reminded, I needed a smile today.",
                "It's wild to me that people thought the bank wouldn't go after them.",
                "Fraud not Glitch but what do I know.",
                "“Infinite money glitch” aka fraud",
                "Of all the institutions to mess with, these bozos chose JP Morgan Chase. Zero sympathies.",
                "I still think it’s dumb that the people that did this refer to it as a “glitch”. \n\nBut what else to expect from these people when they use the funds to buy something stupid like a Gucci wallet. It gives me strong PPP loan without a business vibes. "
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "U.K. Top Court Says Trans Women Are Not Legally Women Under Equality Act",
            "external_url": "https://www.nytimes.com/2025/04/16/world/europe/uk-supreme-court-woman-definition-trans.html?unlocked_article_code=1.AE8.cfzk.pIrpb0-Czz4_&smid=url-share",
            "upvotes": 12223,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> However, he added: “We counsel against reading this judgment as a triumph of one or more groups in our society at the expense of another, it is not.” He said the ruling “does not cause disadvantage to trans people” because they have protections under anti-discrimination and equality laws.\n\n>Lord Hodge began his remarks by acknowledging the national conversation about transgender rights and protections, and described trans people as a “vulnerable and often harassed minority,” while noting that women had fought for centuries for equal rights.\n\n>He added: “It is not the task of this court to make policy on how the interests of these groups should be protected” but “to ascertain the meaning of the legislation which Parliament has enacted.”\n\n  \n   \n   \nSo yeah they’re just interpreting something, it doesn’t mean the Act can’t be changed.",
                "I find it interesting and revealing that the debate is *always* over the definition of \"woman\" and never the definition of \"man\".",
                "For the Americans: Watch how many anti-trans comments pop up, then remember:  \n\n- A teacher in Florida was fired for using a 17 year olds preferred name.\n- Republican lawmakers in Arkansas want to ban children from getting haircuts that “don’t match their gender”\n- A cis woman was fired from her job at Walmart because a male customer followed her into the bathroom and accused her of being trans, all because she happed to be tall for a woman. \n\nAll of this has happened in the last month in America. Normalizing trans hatred will lead to a destruction of all our civil rights. People should be free to dress how they please without fear of being targeted by our government.",
                "> However, he added: “We counsel against reading this judgment as a triumph of one or more groups in our society at the expense of another, it is not.” \n\nTOO LATE, it is already here. \n\nWe will be flooded with \"the great vitory of the common sense\" from thousands and thousands of news site, propagandas, and pundits. \n\nAnd there will be counter fire from opposite position.",
                "This will age as well as what the UK did to Alan Turing.",
                "Someone once said. \"Let it be\". Nowadays some people just won't let it be. Sad times.",
                "When are we going to properly talk about sex v gender.   They are being exchanged so readily with little understanding. I recall a man on LBC happily declaring there are only two genders because you are born that way. 🤔",
                "Massive blow to feminism. This ruling will be used to persecute women of all presentations and genders. Cisgendered women who don’t fit into the narrow box of “woman” will be harassed and oppressed double fold.",
                "Even biology says that sex isn't binary. \n\nI swear, Canada is one of the few English-speaking countries hanging on for dear life against right-wing takeover. Decades of right-wing/neoliberal policies and austerity have made England a hollow shell of its former self and impoverished it outside of London. Starmer is supposed to be a labour politician, but he's doing things like decreasing support for disabled people. Mind you, I'm not sitting on my high horse here in Canada. We were (and still could be pending the election) dangerously close to following the same right-wing path if Trump didn't expose it for the load of shit that it actually is.",
                "TERF Island TERFing not even surprised 🤷🏽‍♀️"
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "HOT",
            "title": "Protester tased by police at Marjorie Taylor Greene's Georgia town hall",
            "external_url": "https://apnews.com/video/demonstrator-apprehended-during-congresswoman-marjorie-taylor-greenes-georgia-town-hall-34521ef711774381acc3e94863a6d371",
            "upvotes": 4694,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "MtG and Boebert screeched like howler monkeys and heckled Biden during his state of the union address. This is rich coming from this hypocritical cu*t. ",
                "My favorite part is that she reportedly said something along the lines that she doesn't tolerate heckling at her town halls.\n\nThis is after all she has ever done is heckle, scream, and rant conspiracy theories for the last 4 years during Biden's administration. The hypocrisy is palpable.",
                "I take it she should have been tased at Biden’s SotU address? 🤔",
                "\"sit and listen\"  \nLady, this is a town hall, not a re-education camp.",
                "So she was removing anybody who stood up and disagreed with her? And they'd get tased if they didn't listen? Party of free speech, everybody.",
                "Of course it would be at a MTG event...",
                "I guess she didn’t want to listen to her constituents concerns.  And this coming from one the best hecklers in the party.",
                "Just a reminder that when public figures respond to questions from the public with violence, it is a sure sign of weakness, not of strength.",
                "Here's how you combat this: \n\nFind your fellow heckler. Establish an order. Only one heckler at a time. Don't stand up. \n\nWhen approached by authorities, quickly volunteer to leave with no resistance. \n\nAs one heckler gets all the attention from the authorities and is escorted from the room, the other starts up. This will delay the response to the 2nd heckler. \n\nStay seated. Why? Because eventually, the authorities won't be able to identify who's heckling, or will heckle next.   It also makes you less of a threat. Supporters of the crook will aim to accuse the hecklers in their midst, creating confusion. \n\nContinue until governance is improved.",
                "Can’t fucken wait for her reckoning. Insider trader would be a great take down. \n\nLock her up. \n\nJust an awful human being and a horrible American and “patriot”"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Harvard researchers say they might have to lay off workers and euthanize research animals due to funding freeze",
            "external_url": "https://www.wxow.com/news/national/harvard-researchers-say-they-might-have-to-lay-off-workers-and-euthanize-research-animals-due/article_90bd9ea0-e8f5-55d4-ab2d-8c96b6e85915.html",
            "upvotes": 662,
            "date": "04/16/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/wxow.com/content/tncms/assets/v3/editorial/3/63/3639369c-7d7d-5b2e-b34b-dbabc632507b/68002f01b8ab8.image.jpg?crop=1600%2C840%2C0%2C113&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "If they have to euthanize animals I vote they do it right in front of the White House, make it known this is something Trump is forcing them to do, make it public",
                "The science and learning don't matter. Only hate.... Welcome to Trump's America",
                "The shit stain country gets shit stainier every day",
                "Lots of people here clearly don't know how endowments work.",
                "i will take the animals :(",
                "I mean Havard has a $53 BILLION endowment. I think they can keep this open until trump is out of the white house.",
                "Give us money or the dog gets it.",
                "aww shucks.\ndarn.\ndrat.",
                "No they don’t. They have the largest endowment probably in the world.",
                "God forbid they tap into the $57 billion endowment so we don't have the euthanize animals."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Fyre Festival 2's fate up in the air after website says tickets unavailable",
            "external_url": "https://www.nbcnews.com/news/us-news/fate-fyre-festival-2-air-website-announces-postponement-rcna198093",
            "upvotes": 981,
            "date": "04/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250416-Billy-McFarland-se-209p-e04eaf.jpg",
            "top_comments": [
                "Anyone who bought tickets to this deserves absolutely everything coming to them.",
                "Fyre Festival is a fraud, you say? Have we timewarped to 2017 or something?",
                "Who could've possibly foreseen any issues with this?",
                "Aw man! I was really looking forward to the documentary.",
                "> McFarland, who pleaded guilty to wire fraud and other crimes tied to the first Fyre Fest fiasco in the Bahamas in 2017, had posted documents on his social media April 4 that he said proves that organizers had been working with local officials since March 5 to obtain permits for a Fyre Festival 2.\n\nAttempting to secure permits just 2 months out from the festival isn't as reassuring as he thinks it is.",
                "How is that possible? I just bought the VIP package from a dude off of Craigslist for $10,000. It looks pretty legit. It's printed on the back of a candy wrapper.",
                "These people deserved to be scammed it's like buying a meme coin in 2025",
                "Organizers of a Fyre Festival sequel announced on its website Wednesday that the event had been postponed before updating the language to say tickets were \"currently not available.\"\n\nThe confusion comes after Mexican officials this month disputed that a multiday musical event will be held next month in the popular resort town of Playa Del Carmen.\n\nThe festival's promoter, Billy McFarland, did not immediately respond to a request for comment.\n\nIn an earlier announcement, the site said: \"FYRE 2 Festival is postponed and will be rescheduled for a later date in the future. If you have purchased tickets already, you will receive an email once the new date is confirmed.\"...",
                "Anyone who has seen either one of the documentaries knows how much of a Con that guy is. He has absolutely no shame either.\n\n…so he’ll probably be president of the United States one day.",
                "Find Ja Rule so I can make sense of all this! WHERE IS JA?!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Congestion pricing is working': MTA says tolls keeping 82k drivers a day out of Manhattan",
            "external_url": "https://gothamist.com/news/congestion-pricing-is-working-mta-says-tolls-keeping-82k-drivers-a-day-out-of-manhattan?utm_source=sfmc&utm_medium=nypr-email&utm_campaign=Gothamist+Daily+Newsletter&utm_term=https%3a%2f%2fgothamist.com%2fnews%2fcongestion-pricing-is-working-mta-says-tolls-keeping-82k-drivers-a-day-out-of-manhattan&utm_id=437122&sfmc_id=53418894&utm_content=2025414&nypr_member=True",
            "upvotes": 0,
            "date": "04/17/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/349119/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "The mysterious firing of a Chinese professor has Asian students on edge: ‘Brings chills to our spines’ | US politics",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/16/chinese-professor-bloomington-indiana",
            "upvotes": 33,
            "date": "04/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1f8bce05a03c92aabccc3a21e478ecf518909baf/0_246_7375_4427/master/7375.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=fcb63289f5d9b7c401a45cc5c4a31b57",
            "top_comments": [
                "*“What is particularly troubling in this case is that Indiana University fired him and his wife without due process, presuming guilt instead of innocence,” Chen says.*\n\nYeah, and fired by email on the very day DHS operatives swooped down upon the campus. No wonder Chinese students are living in fear, and are readying to leave the US on a moment's notice."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "No plans to allow any aid into Gaza, says Israeli minister",
            "external_url": "https://www.theguardian.com/world/2025/apr/16/no-humanitarian-aid-gaza-israeli-minister-israel-katz-hamas",
            "upvotes": 40,
            "date": "04/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/101d32b3c372581966678a16cc6e04617a6537f5/0_353_4032_2419/master/4032.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ee9a6e6cefdf5d2c27b10c8de666db9d",
            "top_comments": [
                "The Trump administration really doing a great job on this one 🙄",
                "So is there outside smuggling going on, or what are they living off?",
                "Ahh!! They sticking to  the final solution as set by Germany in 1942 while Trumps does  the concentration camps,",
                "B-b-but Kamala wouldn’t have been any different to Trump!!!!\n\n/s"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Scientists hail ‘strongest evidence’ so far for life beyond our solar system",
            "external_url": "https://www.theguardian.com/science/2025/apr/17/scientists-hail-strongest-evidence-so-far-for-life-beyond-our-solar-system",
            "upvotes": 58,
            "date": "04/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/58192346609b2168208fe4d6674df709df795be6/120_0_3600_2160/master/3600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=32964ac6f916c3fd2155cf4a6e89a786",
            "top_comments": [
                "Tell it to stay away from Earth!",
                "Sources close to President Trump say he plans to levy tariffs against K2-18 b later this week. /s",
                "Whoever smelt it dealt it",
                "Only 200 or so life times to get in a ship to go find out..."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Astronomers Detect a Possible Signature of Life on a Distant Planet",
            "external_url": "https://www.nytimes.com/2025/04/16/science/astronomy-exoplanets-habitable-k218b.html?unlocked_article_code=1.AE8.5BZ1.3b8-7WRby9m5&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 236,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It took frustratingly long for the article to get to the point: They found hints of the possibility of dimethyl sulfide, a compound thought to be produced only by life.",
                "Cool. What's the planet's immigration policy? Speaking as an American of course.",
                "If the surface gravity is much stronger than earths, then would it even be possible for a human to visit the surface of this planet?   Could we step foot on any planet that has a surface gravity stronger than earths?",
                "I hope they're hostile and highly advanced ",
                "All I could see in my email was “Breaking News:Astronomers detect…”. I honestly got sad when I clicked on it and it didn’t read “…a large asteroid about to hit earth.”",
                "as long as they land on any other soil than the US, we may get a nice 1st contact.",
                "I think we should pretend like we aren’t home. We’ve got lots going on as is.",
                "What's the asylum process like?",
                "God I hate the joking comments up in this bitch",
                "So this is how it ends.\n\nNow that's they know where are, how long does it take before they come?"
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "NEW",
            "title": "US IRS planning to rescind Harvard's tax-exempt status",
            "external_url": "https://www.reuters.com/world/us/us-irs-planning-rescind-harvards-tax-exempt-status-cnn-reports-2025-04-16/",
            "upvotes": 5076,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Isn't it illegal for the president to get the IRS to do that?\n\n\"Prohibition on executive branch influence over taxpayer audits and other investigations\"\n\n[Stated here](https://www.law.cornell.edu/uscode/text/26/7217)",
                "All is fair then when the shoe is on the other foot...every church that participated in preaching about voting (at all for anyone) should lose their tax exempt status too",
                "This is going to be drawn out in court for a long time. Harvard isn't likely to back down.",
                "That's great! That means the next time we have a democratic president in we can just start pulling the tax exempt status of churches right? Just whomever we don't like?",
                "Remember when conservatives cried persecution because the IRS showed extra scrutiny to conservative groups based on keyword usage? (The IRS also did the same for liberal groups as well but conservatives just ignored that since it didn't support their worldview)",
                "Harvard may know some lawyers who can represent them in court.",
                "\"The essence of fascism is to make laws forbidding everything and then enforce them selectively against your enemies.\" - John Lescroart, A Plague of Secrets.",
                "I hope Harvard doesn't blink, here. Stand up for yourselves. Stand up for all of us.",
                "Oh, good.  The dollar is collapsing, U.S. bonds are becoming more unstable and disfavored globally every day, stock market volatility is off the charts with every indication that the bottom is going to fall out, the FED chairman just cautioned that Trump's tariffs are putting the country on track for devastating stagflation ... and instead of dealing with any of this the White House is hyper-focused on abusing the power of the federal government to exact petty retributions against perceived political enemies.  Any Trump supporters want to defend this daily shitshow?",
                "Man the fascism is being ramped up real quick, anyone still have a problem with calling trump a fascist and the death of democracy in america?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Harvard researchers say they might have to lay off workers and euthanize research animals due to funding freeze",
            "external_url": "https://www.wxow.com/news/national/harvard-researchers-say-they-might-have-to-lay-off-workers-and-euthanize-research-animals-due/article_90bd9ea0-e8f5-55d4-ab2d-8c96b6e85915.html",
            "upvotes": 665,
            "date": "04/16/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/wxow.com/content/tncms/assets/v3/editorial/3/63/3639369c-7d7d-5b2e-b34b-dbabc632507b/68002f01b8ab8.image.jpg?crop=1600%2C840%2C0%2C113&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "If they have to euthanize animals I vote they do it right in front of the White House, make it known this is something Trump is forcing them to do, make it public",
                "The science and learning don't matter. Only hate.... Welcome to Trump's America",
                "The shit stain country gets shit stainier every day",
                "Lots of people here clearly don't know how endowments work.",
                "i will take the animals :(",
                "I mean Havard has a $53 BILLION endowment. I think they can keep this open until trump is out of the white house.",
                "Give us money or the dog gets it.",
                "aww shucks.\ndarn.\ndrat.",
                "No they don’t. They have the largest endowment probably in the world.",
                "God forbid they tap into the $57 billion endowment so we don't have the euthanize animals."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Puerto Rico goes completely dark after another island-wide power outage",
            "external_url": "https://www.nbcnews.com/news/us-news/puerto-rico-goes-completely-dark-another-island-wide-power-outage-rcna201643",
            "upvotes": 138,
            "date": "04/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-12/123124-puerto-rico-power-outage-vl-851a-6e98cf.jpg",
            "top_comments": [
                "Something tells me they won't even get paper towels this time",
                "It's time for Trump to yeet a 3-pointer with a pack of toilet paper again /s",
                "Hope this won’t impact medical supplies too badly, the supply chain was already in bad shape",
                "Instead of calling his good friend, the president of Puerto Rico, he'll try to impose tariffs and deport every human off the island.",
                "Can’t wait to see what President Krasnov throws at them this time…"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Arson suspect angry with Pennsylvania Gov. Josh Shapiro over Palestinian stance, search warrants say",
            "external_url": "https://www.nbcnews.com/news/us-news/arson-suspect-angry-pennsylvania-gov-josh-shapiro-palestinian-stance-s-rcna200852",
            "upvotes": 246,
            "date": "04/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250414-josh-shapiro-fire-mn-1110-cbfa4a.jpg",
            "top_comments": [
                "Kind of surprising given the public facing part of his Facebook shows no interest in Palestine but a *lot* of interest in violence and anger towards Biden and Biden-supporters.",
                "Wow a lot of people want to claim this is “fake news” same way Trump would. \n\nLook just because a crazy person has the same position on you doesn’t betray your cause. There are enough crazy people out there there will always be crazy people on both sides of every issue.",
                "So the fact he chose the first day of Passover to attack a Jewish governor’s home is a (strange and  dark) coincidence then? It was 100% just motivated by Palestine and absolutely nothing else?",
                "Five bucks says this guy couldn't find Palestine on a map.",
                "Hasn’t Shapiro been unapologetic in his criticism of Netanyahu?",
                "Yea, no shit white nationalist are wild.",
                "Damn. This completely justifies the genocide. /S",
                "If he's really that angry about Palestine, shouldn't he be going after head honcho in charge instead?",
                "He called and told them why he did it an hour after the arson. They knew at the time. They knew he did it because of Palestine and Shapiro's religion and they waited until the story died out to give us that info. Expect this story to disappear now",
                "Conservative nut bags attacking conservative politicians and Liberal nut bags attacking liberal politicians... man what a fucking timeline."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "NEW",
            "title": "Island-wide blackout hits Puerto Rico as residents prepare for Easter weekend",
            "external_url": "https://www.cnn.com/2025/04/16/us/puerto-rico-island-wide-blackout-easter-weekend?cid=ios_app",
            "upvotes": 395,
            "date": "04/16/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25106695668333.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "San Juan, Puerto Rico (AP) — An island-wide blackout hit Puerto Rico on Wednesday as the largely Catholic residents of the U.S. territory prepared to celebrate the Easter weekend, officials said.\n\nAll 1.4 million clients on the island were without power, Hugo Sorrentini, spokesman for Luma Energy, which oversees the transmission and distribution of power, told The Associated Press. “The entire island is without generation,” he said.\n\nMeanwhile, at least 78,000 clients were without water, with officials warning that power likely won’t be fully restored for another 48 to 72 hours.",
                "I just had a call with my parents and at least for now they have cell signal but water was starting to go out already.  They have solar so gas is no issue for them BUT gas stations already have hour long lines since it caught folks off guard during the regular rush hour",
                "Puerto Rico built up a robust electrical grid that was owned by the public but was sold off to a business to be “more efficient”. After it was privatized prices increased while the quality went down drastically. This situation sucks and happens all the time.",
                "Paper towels incoming...",
                "And they don't have an obvious reason? Going to be a stressful couple days. People were probably doing a lot of food prep at the very least, too.",
                "Major infrastructure (hotels, airport, some markets/restaurants) have sufficient generators to keep going but there's definitely a shift here",
                "What did Puerto Rico say that Trump didn’t like?",
                "So what's the roof top solar panel industry like down there?"
            ],
            "aggregate_sentiment": 46.0
        },
        {
            "category": "RISING",
            "title": "Harvard researchers say they might have to lay off workers and euthanize research animals due to funding freeze",
            "external_url": "https://www.wxow.com/news/national/harvard-researchers-say-they-might-have-to-lay-off-workers-and-euthanize-research-animals-due/article_90bd9ea0-e8f5-55d4-ab2d-8c96b6e85915.html",
            "upvotes": 669,
            "date": "04/16/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/wxow.com/content/tncms/assets/v3/editorial/3/63/3639369c-7d7d-5b2e-b34b-dbabc632507b/68002f01b8ab8.image.jpg?crop=1600%2C840%2C0%2C113&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "If they have to euthanize animals I vote they do it right in front of the White House, make it known this is something Trump is forcing them to do, make it public",
                "The science and learning don't matter. Only hate.... Welcome to Trump's America",
                "The shit stain country gets shit stainier every day",
                "Lots of people here clearly don't know how endowments work.",
                "i will take the animals :(",
                "I mean Havard has a $53 BILLION endowment. I think they can keep this open until trump is out of the white house.",
                "Give us money or the dog gets it.",
                "aww shucks.\ndarn.\ndrat.",
                "No they don’t. They have the largest endowment probably in the world.",
                "God forbid they tap into the $57 billion endowment so we don't have the euthanize animals."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "The State Department closes the office that flags disinformation from Russia, China and Iran",
            "external_url": "https://apnews.com/article/rubio-disinformation-russia-china-iran-d53d00551a0a57f3114431c624db0b0f?utm_source=reddit&utm_medium=share",
            "upvotes": 2898,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The only flag the State Department cares about now is the white flag to keep bending over for Russia. This country used to know how to handle traitors.",
                "Wonder if anyone on the Right will hear about this.",
                "Pointless anyway. Didn’t flag Trump‘s blatant Russian propaganda at all",
                "cant say theyve been working hard anyway for the past oh... 10 years?...",
                "I would be surprised but I'm not.",
                "..and Palm Beach County Florida..",
                "And you think Russia, China, and Iran will slow down their operations to try shit on us right now? \n\nTrump is dragging us all down.",
                "Who's even fucking surprised anymore",
                "Imagine being Putin’s buttslut this bad god damn",
                "Yes they're clicking their hobnail boots together wishing away any kind of entity that points out disinformation. Think about it it's in their own best interest to normalize disinformation these are the stepping Stones of authoritarian government. There is a video on YouTube called don't be a sucker from the end of world War II put out by the army people might want to watch."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "US IRS planning to rescind Harvard's tax-exempt status",
            "external_url": "https://www.reuters.com/world/us/us-irs-planning-rescind-harvards-tax-exempt-status-cnn-reports-2025-04-16/",
            "upvotes": 5085,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Isn't it illegal for the president to get the IRS to do that?\n\n\"Prohibition on executive branch influence over taxpayer audits and other investigations\"\n\n[Stated here](https://www.law.cornell.edu/uscode/text/26/7217)",
                "All is fair then when the shoe is on the other foot...every church that participated in preaching about voting (at all for anyone) should lose their tax exempt status too",
                "This is going to be drawn out in court for a long time. Harvard isn't likely to back down.",
                "That's great! That means the next time we have a democratic president in we can just start pulling the tax exempt status of churches right? Just whomever we don't like?",
                "Remember when conservatives cried persecution because the IRS showed extra scrutiny to conservative groups based on keyword usage? (The IRS also did the same for liberal groups as well but conservatives just ignored that since it didn't support their worldview)",
                "Harvard may know some lawyers who can represent them in court.",
                "\"The essence of fascism is to make laws forbidding everything and then enforce them selectively against your enemies.\" - John Lescroart, A Plague of Secrets.",
                "I hope Harvard doesn't blink, here. Stand up for yourselves. Stand up for all of us.",
                "Oh, good.  The dollar is collapsing, U.S. bonds are becoming more unstable and disfavored globally every day, stock market volatility is off the charts with every indication that the bottom is going to fall out, the FED chairman just cautioned that Trump's tariffs are putting the country on track for devastating stagflation ... and instead of dealing with any of this the White House is hyper-focused on abusing the power of the federal government to exact petty retributions against perceived political enemies.  Any Trump supporters want to defend this daily shitshow?",
                "Man the fascism is being ramped up real quick, anyone still have a problem with calling trump a fascist and the death of democracy in america?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Island-wide blackout hits Puerto Rico as residents prepare for Easter weekend",
            "external_url": "https://www.cnn.com/2025/04/16/us/puerto-rico-island-wide-blackout-easter-weekend?cid=ios_app",
            "upvotes": 397,
            "date": "04/16/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25106695668333.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "San Juan, Puerto Rico (AP) — An island-wide blackout hit Puerto Rico on Wednesday as the largely Catholic residents of the U.S. territory prepared to celebrate the Easter weekend, officials said.\n\nAll 1.4 million clients on the island were without power, Hugo Sorrentini, spokesman for Luma Energy, which oversees the transmission and distribution of power, told The Associated Press. “The entire island is without generation,” he said.\n\nMeanwhile, at least 78,000 clients were without water, with officials warning that power likely won’t be fully restored for another 48 to 72 hours.",
                "I just had a call with my parents and at least for now they have cell signal but water was starting to go out already.  They have solar so gas is no issue for them BUT gas stations already have hour long lines since it caught folks off guard during the regular rush hour",
                "Puerto Rico built up a robust electrical grid that was owned by the public but was sold off to a business to be “more efficient”. After it was privatized prices increased while the quality went down drastically. This situation sucks and happens all the time.",
                "Paper towels incoming...",
                "And they don't have an obvious reason? Going to be a stressful couple days. People were probably doing a lot of food prep at the very least, too.",
                "Major infrastructure (hotels, airport, some markets/restaurants) have sufficient generators to keep going but there's definitely a shift here",
                "What did Puerto Rico say that Trump didn’t like?",
                "So what's the roof top solar panel industry like down there?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Missing toddler who walked 7 miles alone through Arizona wilderness led to safety by rancher's dog",
            "external_url": "https://www.nbcnews.com/news/us-news/missing-toddler-walked-7-miles-alone-arizona-wilderness-led-safety-ran-rcna201479?utm_source=firefox-newtab-en-us",
            "upvotes": 3605,
            "date": "04/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250416-kid-rescue-ch-0514-b0f001.jpg",
            "top_comments": [
                "\n\"I got in my truck to go to town and I see Buford walking down the side of the fence with a little blond kid with him. I had heard about the missing child this morning, so I knew it was him.\"\n\n\nBuford, (best name ever), probably only walked with him about a mile, but the dog did find him.",
                "I hope Buford got a nice treat for being a good boy.",
                "the goodest of good boys.",
                "Cause dogs are awesome. ",
                "7 miles for a 2 year old!",
                "I have a Pyrenees mix (Buford is a full Pyr) and they are one of the smartest and self-sufficient dog breeds.  They can make decisions on their own and I can believe the doggo worked out that the kid shouldn't have been there and that the best thing to do was to lead him home, like a sheep.  They are also hard headed and stubborn, because they believe they are smarter than we are...",
                "It followed me home, dad, can I keep him?",
                "“The more I learn about people, the more I like dogs”",
                "Buford finds small human, herds him to safety. Dogs are the best.",
                "Great to read a positive story with a good ending"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Trump administration plans to end the IRS Direct File program for free tax filing, AP sources say",
            "external_url": "https://apnews.com/article/irs-direct-file-tax-returns-free-trump-4bb0bca02fab9b3d06ae6f45ac67b7ab",
            "upvotes": 21427,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*\"Republican lawmakers and commercial tax preparation companies complained it was a waste of taxpayer money\"*  \n\nThe places that are making money from filing taxes and selling peoples information are saying it's a waste of taxpayer money.   As a taxpayer I disagree with them.",
                "“We want the worst for everyone!”\n\n“We are just plain evil”",
                "What if I just don't do my taxes correctly like him?",
                "> The program developed during Joe Biden’s presidency was credited by users with making tax filing easy, fast and economical. But Republican lawmakers and commercial tax preparation companies complained it was a waste of taxpayer money because free filing programs already exist, although they are hard to use.\n\nPeople who like this software: users\n\nPeople who don’t: Republican lawmakers and tax preparation software companies (TurboTax)\n\nPick a side, folks.",
                "I filed my taxes with this in less than 30 minutes and got my return in less than week. Obviously its a terrible inefficient program that needs to go. /s",
                "Every decision, the benefit of our enemies.",
                "MAGA : Let's remove DirectFile, which people like and makes sense.\n\nMAGA : Let's not go after TurboTax though, which is outright scamming us.",
                "It cost $100 to file taxes under H&R Block services. That is insane when the IRS already has our information! It’s ridiculous.",
                "I wonder how much Intuit and H&R Block paid for this. It doesn't help anyone but them to get rid of this service.",
                "Been using freetaxusa"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "California the 1st state to sue Trump administration over tariffs",
            "external_url": "https://www.cbc.ca/news/world/california-newsom-trump-tariffs-1.7511493",
            "upvotes": 21350,
            "date": "04/16/2025",
            "thumbnail": "https://i.cbc.ca/1.7511588.1744814544!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_1180/usa-trump.JPG?im=Resize%3D620",
            "top_comments": [
                "Makes a lot of sense. Out of the 50 states, California has the largest economy — the tariffs would significantly impact the golden state",
                "Here's to hoping he gets a preliminary injunction. The Supreme Court will side with Trump in the end, but not if Republicans finally grow a spine and help pass a bill that limits Trump's powers.",
                "LETS GO Washington, Oregon, Illinois... get on board with this.",
                "California is getting specifically targeted/fucked by Trump. National parks, tourism, trade, agriculture (the water thing). \n\nMakes me want to not pay my federal taxes. Not like anyone works at the IRS anymore.",
                "What use is a lawsuit to someone who doesn’t even have to obey the Supreme Court?",
                "Hope the rest follow suit.\n\n\nMake him regret this.",
                "Sue his ass for everything at this point",
                "Proud to live in California. Just watched Newsom’s news conference on it. Really good points made. \n\n“President can’t do unlawful things.” Damn right.\n\nETA: Some of the people here don’t know the history of what happens when Cali sues Trump. \n\nCalifornia has brought over 100 lawsuits against Trump—a majority being during Trump 1.0. 15 so far for Trump 2.0. And in many of those, gains have been made. Lawsuits can work and do work. So it’s not a waste of time for them to be doing this. If anything they’ve fired the first shot, other states will hopefully follow.",
                "As ashamed as I am to be American these days, I'm proud to be a Californian.",
                "I don't think this lawsuit will go anywhere, and will probably be thrown out since tariffs are an international issue with the federal government, not with states.\n\nBut more power to him to try."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Arson suspect angry with Pennsylvania Gov. Josh Shapiro over Palestinian stance, search warrants say",
            "external_url": "https://www.nbcnews.com/news/us-news/arson-suspect-angry-pennsylvania-gov-josh-shapiro-palestinian-stance-s-rcna200852",
            "upvotes": 248,
            "date": "04/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250414-josh-shapiro-fire-mn-1110-cbfa4a.jpg",
            "top_comments": [
                "Kind of surprising given the public facing part of his Facebook shows no interest in Palestine but a *lot* of interest in violence and anger towards Biden and Biden-supporters.",
                "Wow a lot of people want to claim this is “fake news” same way Trump would. \n\nLook just because a crazy person has the same position on you doesn’t betray your cause. There are enough crazy people out there there will always be crazy people on both sides of every issue.",
                "So the fact he chose the first day of Passover to attack a Jewish governor’s home is a (strange and  dark) coincidence then? It was 100% just motivated by Palestine and absolutely nothing else?",
                "Five bucks says this guy couldn't find Palestine on a map.",
                "Hasn’t Shapiro been unapologetic in his criticism of Netanyahu?",
                "Yea, no shit white nationalist are wild.",
                "Damn. This completely justifies the genocide. /S",
                "If he's really that angry about Palestine, shouldn't he be going after head honcho in charge instead?",
                "He called and told them why he did it an hour after the arson. They knew at the time. They knew he did it because of Palestine and Shapiro's religion and they waited until the story died out to give us that info. Expect this story to disappear now",
                "Conservative nut bags attacking conservative politicians and Liberal nut bags attacking liberal politicians... man what a fucking timeline."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Astronomers Detect a Possible Signature of Life on a Distant Planet",
            "external_url": "https://www.nytimes.com/2025/04/16/science/astronomy-exoplanets-habitable-k218b.html?unlocked_article_code=1.AE8.5BZ1.3b8-7WRby9m5&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 235,
            "date": "04/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It took frustratingly long for the article to get to the point: They found hints of the possibility of dimethyl sulfide, a compound thought to be produced only by life.",
                "Cool. What's the planet's immigration policy? Speaking as an American of course.",
                "If the surface gravity is much stronger than earths, then would it even be possible for a human to visit the surface of this planet?   Could we step foot on any planet that has a surface gravity stronger than earths?",
                "I hope they're hostile and highly advanced ",
                "All I could see in my email was “Breaking News:Astronomers detect…”. I honestly got sad when I clicked on it and it didn’t read “…a large asteroid about to hit earth.”",
                "as long as they land on any other soil than the US, we may get a nice 1st contact.",
                "I think we should pretend like we aren’t home. We’ve got lots going on as is.",
                "What's the asylum process like?",
                "God I hate the joking comments up in this bitch",
                "So this is how it ends.\n\nNow that's they know where are, how long does it take before they come?"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Police stun 2 demonstrators at Rep. Marjorie Taylor Greene's town hall.",
            "external_url": "https://www.nbcnews.com/politics/congress/police-tase-2-demonstrators-marjorie-taylor-greene-town-hall-acworth-rcna201457",
            "upvotes": 368,
            "date": "04/16/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250415-marjorie-taylor-greene-ac-1002p-fe8a04.jpg",
            "top_comments": [
                "She's still holding town halls???",
                "Time for protestors to start wearing insulated clothing to avoid getting tased.",
                "I sincerely wish her brain would leak out of her orifices and her public life would stop being a part of our society.",
                "She cannot take what she dishes out. Typical.",
                "Did she call the police ahead of time for them to do this to anyone that yelled at her? Looked like a crowd of about 50 people but there were 6-7 cops on hand?",
                "Don’t have to stun them. Most people are already shocked at whatever comes out of her mouth.",
                "If only there were some kind of sign... some, I don't know, way to tell if someone is really representing the people  who elected them to office? It's so confusing, I mean, she knows she's doing an *amazing job!* and everyone loves her and the orange penis in her mouth has gone over so well, especially now that the country is obviously on the right track. *FINALLY!*\n\nBut then something like this happens and antifa or the communists or whoever those brown people really are tries to get in the way of her cute little peaceful town hall meetings where she's just going to politely explain how imprisoning all their neighbors in Central America along with destroying their financial future (did she mention how well she did playing the market last week?!?!) and the fact none of them can afford eggs this Easter... look. Can someone just explain to her what it is she really has to do to get some respect around here?",
                "“Stun” is certainly one way to put it.",
                "Are you sure they weren’t hit by space lasers??",
                "Police stunned to see many demonstrators at Rep. Marjorie Tasers Greene's town hall. \n\nMaybe a building capacity issue."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/17/2025 00:41:39 UTC"
}