{
    "posts": [
        {
            "category": "HOT",
            "title": "US transportation secretary changed wife’s flight from Newark after insisting airport was safe",
            "external_url": "https://www.theguardian.com/us-news/2025/may/14/newark-airport-safety-transportation-secretary-flight",
            "upvotes": 26285,
            "date": "05/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3982795d3dd51db461bdcff43ecc34c2f4846998/492_0_2450_1961/master/2450.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=522598806b4fbad62322ccf0a553dbd4",
            "top_comments": [
                "These people are as comically evil as they are incompetent. You can't trust a single thing they say.",
                "As a Wisconsinite, I’m truly sorry the rest of the country has to deal with this fool now.",
                "I clicked this expecting to see that an intrepid journalist did some deep investigation to find proof of the flight change.\n\nBut no, this idiot just went on a radio show and announced it.",
                "Lmao so he blinked. Got it. I mean they truly think that the general populace is stupid if they think that we are focusing on what they're saying versus what they're doing. Incompetent morons.",
                "If the Dems were this incompetent you'd hear about it everywhere 24/7.",
                "When someone says information is power, the United States from 2010-2025 is a prime example. \n\nOur information ecosystems are fundamentally divergent. Thus tens of millions of people get different I information, news, facts, truths, etc than tens of millions of others. \n\nThat is the ONLY way you achieve what this nation has in the past decade. \n\nThirty years ago, Trump would have been laughed out of the 2015 primaries. \n\nBut after 30+ years (starting in the 1990s) of partisan based escalating Culture War for profit, by the time the “age of information” took hold half the country was just ready and waiting for an anti-lib media ecosystem. \n\nThey had Rush and Fox News and in the days before the World Wide Web was truly ubiquitous that was more than enough to make billions off culture war. But it wasn’t enough to truly alter/diverge realities. The way information traveled was still “slow”. Outlets, regardless of lean were all still covering the same basic news stories. Average Americans may have had bias one way or the other, but they still all got more or less the same basic information from which to understand the world. \n\nBut that stopped being true once the flood gates of digital media opened, and they technology of targeted advertising became the number one business model in the digital age. \n\nThe barrier of entry was lowered so much that millions could start a blog, a community, or a “new media” company. Better yet, there are nearly no rules to how you create and spread information online. Your voice, for free, can carry equal weight to a press outlet that has to pay researchers, editors, reporters, fact checkers, and journalists. Your voice can EARN as much as outlets that  have basic news gathering and reporting standards and practices. \n\nThere was never a version of this world where real news gathering/reporting and real journalism were ever going to survive in the face of millions of people who can just blast their opinions and hot takes. Especially when ad sales platforms do not care what those opinions and hot takes are. Especially when millions of people don’t care if what they say is accurate, true, or even in good faith. \n\nAnd all of the above is BEFORE social media, with its engagement and personalization algos, and it’s built in incentives to create and spread as much content as possible. \n\nWE\n\nARE\n\nBROKEN",
                "Safe for me, but not for thee! Some of you may die, but that is a sacrifice I am willing to make.",
                "To be fair, you should avoid Newark Airport mostly because of the delays this clown is responsible for, not the safety risk.",
                "He's a Republican, would you allow your ***valuable property*** to travel through a dangerous airport???",
                "Okay, but what about her emails?"
            ],
            "aggregate_sentiment": 23.0
        },
        {
            "category": "HOT",
            "title": "More than 1,000 Starbucks baristas go on strike to protest new dress code",
            "external_url": "https://apnews.com/article/starbucks-dress-code-baristas-strike-3a39bbf41247d2090afa9b487ccf3d97",
            "upvotes": 5724,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "**Summary:**\n\nOver 1,000 Starbucks baristas at 75 U.S. stores have gone on strike since Sunday to protest a new dress code requiring solid black shirts and khaki, black, or blue denim bottoms.\n\nPreviously, employees could wear more varied dark colors and patterns. \n\nStarbucks says the change is meant to make its green apron more distinctive and create a more welcoming atmosphere.\n\nHowever, Starbucks Workers United, the union representing employees at 570 company-owned stores, argues that the policy should be negotiated as part of collective bargaining.\n\nWorkers also criticized the company for selling now-banned clothing styles on its internal site.\n\nStarbucks stated the strike has had minimal impact and criticized the union for not prioritizing contract negotiations.\n\nThe union has filed a complaint with the National Labor Relations Board.",
                "I don’t think I’ve ever noticed what a barista was wearing aside from if they had an apron on or a hat of some sort.",
                "Is it really about the dress code? Or was this just the last straw in a line of other grievances?",
                "Hate when I try to order a coffee but none of the workers clothing makes their aprons color pop and I don't feel welcome and have to have a screaming mental breakdown",
                ">create a sense of familiarity for customers as it tries to establish a warmer, more welcoming feeling in its stores.\n\nI don't think that having every store and every person working there looking the same accomplishes this.",
                "I can't believe someone out there is being paid 90 million a year to think up stupid shit like this",
                "They don't even want people drinking their drinks in the store anymore. Why the fuck should customers care how \"inviting\" baristas look? Starbucks corporate wants us out of their stores.",
                "It's very simple: whatever your opinion is on the dress code and it's validity, the union is arguing that the company doesn't have the right to change the dress code without prior consent from the union.\n\n\nThis is simply a case of the union looking out for workers the way it's supposed to, and it wouldn't matter if the dress code was changed to clown shoes and a clown car or to outlaw the color the Puce. The union is arguing that they need to be consulted and negotiated with no matter what the change is.\n\n\nThey are not dying on the hill of the dress code. They are dying on the hill of the rights of the union to collective bargaining. ",
                "The less a job pays, the more controlling it is.\n\nWorking a shit job on your feet for 8-12 hours a day for minimum wage? No sitting, don't you dare be late to and from your 15 minute break, don't you dare have a snack on the job, restroom breaks better not be more than 2-3 minutes, but also don't you DARE clock in or out a minute later or earlier than you're supposed to. But you better be available whenever they call, god help you if you aren't. \n\nAnd of course, the good ol' American tradition of as few days off as they're legally allowed to give you, all the way down to zero. Also don't forget some of that pay is going back into your own healthcare THAT YOU STILL HAVE TO PAY MONEY FOR if something goes wrong.",
                "A lot of people siding with the a union busting company flagrantly ignoring mandatory bargaining when the terms and conditions of employment have being changed.\n\nYeah, ultimately a dress code may or may not be a small thing.  \nSo crazy that the company is violating NLRA to do so when they could have just... bargained with the union.\n\nLots of people probably think it's the customer's fault for the \"Warning: Coffee May Be Hot\" stuff.\n\nStarbucks knows exactly what they're doing: Undermining the union they wish would just go away already."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "Mother allegedly buys ammunition, tactical gear for son's planned 'mass targeted violence' at middle school: Officials",
            "external_url": "https://abcnews.go.com/US/mother-allegedly-buys-ammunition-tactical-gear-sons-planned/story?id=121800886",
            "upvotes": 4013,
            "date": "05/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/26244efe-a01c-486e-bd33-0e51fe7d7e13/ashley-pardo-booking-photo-ht-jt-250514_1747243699979_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "“…as payment for watching his younger siblings”\n\nWow I just give mine VBucks.",
                "Thanks god for that grandmother.",
                ">The son, who was not named in the affidavit, was contacted by officials at the time and described a \"fascination with past mass shooters,\" according to the affidavit.\n\n>On Monday, the boy told his grandmother he was \"going to be famous\" before being picked up by his mom and taken to school, according to officials.\n\nI'm getting the feeling that some of these kids don't really have any personal grievance or genuine malice toward their targets. But are obsessed with the fame and notoriety that surrounds mass shooters.",
                "This is why I support news outlets and other sites not glorifying mass shooters by not mentioning their names or showing photos. Keep the losers as anonymous as possible.",
                "\"Mother, I crave violence.\"\n\n\"Anything for my baby boy.\"",
                "> The explosive device had the words \"For Brenton Tarrant,\" referencing the shooter in the 2019 mosque attack, along with multiple \"SS\" symbols and \"14 words\" -- referencing white supremacy -- written on it, according to the affidavit.\n\nHow does a middle-schooler become so radicalized?  The internet is turning out to be as much a curse as a blessing.  Free speech never ran up against something as powerful as social media, we have to figure this out.",
                "Thank God for that grandmother. She potentially saved many lives. And shame on that mother. What a stupid stupid lady.",
                "Damn. If the report here is accurate, this wasn't simply a case of an inattentive or incompetent parent, this was essentially grooming him to become a mass shooter. It wouldn't surprise me if it comes out she flat out instructed him to do it.",
                "So the kid is a Texican white supremacist? The mom too?\n\nThe key thing was that this kid was idolizing a neonazi mass murderer:\n\n>On Monday, the boy told his grandmother he was \"going to be famous\" before being picked up by his mom and taken to school, according to officials.\n\n>The grandmother then looked through the boy's bedroom, where she found magazines loaded with live rifle ammunition and pistol magazines loaded with live ammunition, the affidavit said.\n\n>She also found an \"improvised explosive device\" -- a mortar-style firework wrapped in duct tape -- among the boy's belongings, the affidavit noted. The explosive device had the words \"For Brenton Tarrant,\" referencing the shooter in the 2019 mosque attack, along with multiple \"SS\" symbols and \"14 words\" -- referencing white supremacy -- written on it, according to the affidavit.\n\n>Along with the weaponry, the grandmother found a handwritten note referring to previous mass shootings, mass shooting suspects and the number of victims in each incident, the affidavit said.\n\nJust another moron brainwashed on White supremacy on the internet, while actually being a minority. 🤦\n\nWhen tf are we going to do something about this nazi/White supremacist garbage that keeps on spreading like a disease on the internet?",
                "And they say parents aren't involved in their kids educations these days."
            ],
            "aggregate_sentiment": 63.0
        },
        {
            "category": "HOT",
            "title": "18-year-old girl escapes captivity from New Jersey home where she was allegedly forced to live in dog crate and abused",
            "external_url": "https://www.nbcnews.com/news/us-news/girl-escapes-new-jersey-home-dog-crate-rcna206746",
            "upvotes": 5029,
            "date": "05/14/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250514-gloucester-township-police-ew-102p-3c05cf.jpg",
            "top_comments": [
                ">A New Jersey couple has been charged after an 18-year-old escaped their residence and said she was forced to live in a dog crate for a year, given a bucket to use as a bathroom and sexually abused.\n\n>Brenda Spencer, 38, and Branndon Mosley, 41, of Gloucester Township, were charged with kidnapping and Mosley with additional counts of sexual assault, The Camden County Prosecutor’s Office and Gloucester Township Police announced Wednesday. \n\n>The 18-year-old female had escaped the home on May 8, assisted by a neighbor, prosecutors and police said in a [news release.](https://camdencountypros.org/news/article/2236?fbclid=IwY2xjawKRp_9leHRuA2FlbQIxMABicmlkETFCY3MzQWJNSDJMSFlrOVNnAR4GzMVmBE9KiKriuG3mfkneWSdhLhN9kX6JEAHEGSzpvMUKbpV3oi2ZlPEk1Q_aem_LxPQvRGtmwszP5CpKS2Hwg) The abuse was then reported to police on Saturday.\n\n>The victim said Spencer and Mosley had abused her since 2018.\n\n>Around that time, she was removed from school when she was in the sixth grade “at Spencer’s discretion and confined to her home,” officials said. The victim said shortly after she was pulled out of school, she was “forced to live in a dog crate for approximately one year and was let out periodically,” the release said. \n\n>Later, she was forced to live in a padlocked bathroom and was chained up. She told police she would be let out of the bathroom when family visited the home. At other times she lived in a bare room with a bucket to use as a toilet.\n\n>The victim told police the room had an alarm system that would “alert Spencer and Mosley if she tried to leave.” The victim also reported being beaten with a belt and sexually abused by Mosley, officials stated.\n\nIt's a horrific story, with more details including a 13-year-old who also lived there as well as the kids being pulled out of school years before. How this couple (assuming they are parents but it doesn't specifically say so) could do that do another human being is unfathomable. The law better come down hard on them, with them never seeing the outside of a prison ever again.",
                "This whole “kids were removed from school by parents discretion” thing is one of the things that makes me so uneasy about homeschooling. I know this isn’t that, but the idea that a parent can lock a child away from the world is terrifying.",
                "What the absolute fuck.\n\nI hope the two girls are getting the help they need. Put the monsters where monsters belong.",
                "It’s horrible what people do to kids",
                "Ah jeez they live next to my old neighborhood. It's right near an elementary school. There needs to be regular welfare checks for home schooled children in an effort to prevent horrible shit like this from happening.",
                "Yeah, if someone gets homeschooled there should be regular wellness checks",
                "This is horrific. \n\nThe couple should get a life sentence with forced physical labor. All their earnings should go to the girl.\n\nI don't get why there aren't semi annual home inspections and  private interviews for home schooled kids.\n\nIs it really this easy to let them slip under the radar?",
                "So El Salvador for these folks? Were they not saying for the worst of the worst even if you are American.",
                "There are some absolute garbage people in this world, hope those girls can get help and try to live a life they deserve",
                "Today was not a good day to be able to read.\n\nThere is true evil in the world. I hope those girls get the help they need."
            ],
            "aggregate_sentiment": 25.0
        },
        {
            "category": "HOT",
            "title": "California Governor Newsom seeks to scale back free healthcare for migrants",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/california-governor-newsom-seeks-scale-back-free-healthcare-migrants-2025-05-14/",
            "upvotes": 4206,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "IMHO this prob has more to do with the insane budget problems MediCal currently faces.",
                "He’s gunning for the moderate republican path to the white house",
                "I wish more people would read the article before commenting.",
                "I don’t understand why we’re paying for migrant’s healthcare when there’s a huge percentage of Americans who can’t afford their own care and aren’t seeing a subsidy.   To get Medicaid, you have to be poor.  To afford quality healthcare when needed, you have to be an upper middle class or higher.  Everyone else in between can’t afford their own healthcare needs.",
                "Democrats: \"running presidential candidates who try to court the center right may have gotten us our shit kicked in twice now....what if we try it again, but with a man?\"",
                "Free health care for migrants? Did they run out of citizens needing free health care? If so, that’s awesome.",
                "Why don’t we focus on providing healthcare to tax payers first.",
                "Probably wasn't an amazing idea to begin with.",
                "We’re gonna get another Hillary Clinton with this one.",
                "Why is this seen as a bad thing? \n\nLike legit people can just pop in illegally and get free healthcare?\n\nThen why would all the actual citizenry bother paying for healthcare?"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "HOT",
            "title": "Minneapolis and state leaders prepare for possible Derek Chauvin pardon",
            "external_url": "https://kstp.com/kstp-news/top-news/minneapolis-and-state-leaders-prepare-for-possible-derek-chauvin-pardon/",
            "upvotes": 1859,
            "date": "05/14/2025",
            "thumbnail": "https://kstp.com/wp-content/uploads/2025/05/MPLS-CIVIL-UNREST-PREPS_PKG_00.01.26.30.jpg",
            "top_comments": [
                "Article says that even if he's pardoned for his Federal crimes, he must still serve his sentences for his state crimes. 22 years. He's not going to be set free.",
                "From the article:\n\n> Multiple sources told 5 EYEWITNESS NEWS that Gov. Tim Walz, the Minnesota National Guard, Mayor Jacob Frey and Hennepin County Sheriff Dawanna Witt have all been briefed on preparations for possible civil unrest if President Donald Trump pardons former Minneapolis Police Officer Derek Chauvin for his federal conviction of killing George Floyd.\n\n> Then, on Monday, when asked about the possibility of a pardon, Gov. Walz told reporters, “No indication whether they’re going to do it, or not, but I think it behooves us to be prepared for it. With this presidency, it seems like something they would do.”\n\nSo it doesn't sound like Trump or the White House have said anything concrete, but there seem to be *rumors* circulating of a potential pardon which is what is causing this preparation.\n\nThe good news: Trump can only pardon him on federal crimes, not the state ones. Chauvin still has a 22 year sentence to serve in Minnesota even if he is pardoned federally.",
                "Trump absolutely will pardon him, but he owes Minnesota 22 additional years.",
                "Can’t be pardoned by Trump for his state convictions which carry a longer sentence.",
                "If they ignore the states 22 year sentence even if pardoned you’re setting a scary precedent",
                "Trump is trying to get black people to start mass protesting so he can declare a national emergency and fuck shit up forever.",
                "This seems like Trump trying to let a federal pardon also pardon a state crime.  Try it on Chauvin and see if it works before he does it to himself and friends.",
                "They’re doing this to get black folk out to protest to lock us up and send us out of the country. \n\nI pray we don’t fall for it.",
                "The irony is that Chauvin is probably safer and more comfortable in federal prison than he would be in state prison. Trump wouldn’t be doing him any favors.",
                "They want to poke the BLM bear into rioting so they can deploy the military."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Mexican security chief confirms cartel family members entered US in a deal with Trump administration",
            "external_url": "https://apnews.com/article/el-chapo-sinaloa-cartel-trump-border-harfuch-86572a31c88a216da7cd5f33006a0011",
            "upvotes": 11618,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "We are deporting students and importing cartels.",
                "Why is this not the top story on every news site?",
                "They must have bought one of Trump's immigration golden tickets.",
                "Ok lemme get this straight. Kids with cancer, Americans, veterans and immigrant with green cards are being deported to a country they’ve never been to BUT Mexican cartel members are being literally invited in? America is beyond fucked.",
                "Another day, another absolute “fuck you” to the American public…",
                "So letting actual violent foreigners in and deporting grad students and working parents",
                "$5 million dollars folks. And you get one of those fancy trump visas.",
                "Trump selling citizenships to cartel families and South African racists.",
                "TRUMP selling America to anybody that will pay him.",
                "Proof that Trump doesn't want to use the military to take out the Mexican Cartels. He just needs to go in and help the ones that pay him enough to take out their competition."
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "HOT",
            "title": "EPA will weaken rule curbing forever chemicals in drinking water",
            "external_url": "https://www.reuters.com/sustainability/climate-energy/epa-rollback-forever-chemical-rule-extend-timelines-2025-05-14/",
            "upvotes": 3689,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Out with the Flouride, In with the Flourine!",
                "Delicious forever chemicals just what I needed.",
                "Who the hell wants this?\n\nLike who's it benefiting? We all live on the same planet.",
                "I wonder how much money Trump was bribed with to get that rule weakened.",
                "Thank God, we're getting something to replace Fluoride.",
                "Finally! I love when corporations dump their chemicals into our drinking water! Trump is the best! I'm an idiot! But I'm winning! ^/s",
                "Conservatism is well known to be incompatible with many things- prosperity, liberty, equality, democracy, science, rule of law, progress- and we can add simple decency of respecting the safety and value of the ordinary persons well being",
                "Environmental Pollution Agency",
                "Veritassium just pushed a video about PFAS\n\nhttps://youtu.be/SC2eSujzrUY",
                "I really don't get it. RFK jr is a fucking idiot, but he does seem to genuinely believe his delusions. Why wouldn't he be the first to speak out against this?"
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "HOT",
            "title": "Robert F. Kennedy Jr. submerges in creek with high bacteria levels, including E. coli",
            "external_url": "https://abcnews.go.com/Politics/robert-kennedy-jr-swimming-park-water-high-bacteria/story?id=121734979",
            "upvotes": 4948,
            "date": "05/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/abf2ddd9-061c-4cef-a5ef-bb4850246c54/robert-kennedy-1-gty-gmh-250512_1747058965848_hpMain_2_16x9.jpg?w=1600",
            "top_comments": [
                "Brain worm’s got some competition now",
                ">\"Mother's Day hike in Dumbarton Oaks Park with Amaryllis, Bobby, Kick, and Jackson, and a swim with my grandchildren, Bobcat and Cassius in Rock Creek,\"\n\nthese names...",
                "Swimming in literal shit. And this is the guy controlling the health decisions for the country. I hope he (also literally) shits his brains out.",
                "Swimming in the swamp is very on brand for this administration.",
                "I love this manly traditional nature loving persona he tries to have, but can't even go further from the city to swim in non polluted water.\n\nSo fluoride in city water = bad\n\nThe city's sewage in swimming water = fine",
                "What amazes me is that he was doing this with his grandchildren. His own daughter described the situation where he cut the head off of a dead whale and tied it to the roof of the car. She was splashed with disgusting fluids from it as they were driving home. The parents of those grandchildren know what he is like and yet allowed them to be in his care",
                "This dude worships Nurgle.",
                "Does everyone in this administration HAVE to go so out of their way to be ASBOLUTELY BATSHIT FUCKING NUTS",
                "I just hope this speeds up the inevitable, the faster the better.",
                "My wife got E Coli just after we started dating.\nFit, 25 year old personal trainer, they almost died. \n\nFingers crossed."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Oklahoma education standards say students must identify 2020 election 'discrepancies'",
            "external_url": "https://www.npr.org/2025/05/14/nx-s1-5384282/oklahoma-education-standards-2020-election",
            "upvotes": 1762,
            "date": "05/14/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4639x2609+0+88/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc3%2F8e%2Ff868d977431fac66f7adec1c1297%2Fap25027772468178.jpg",
            "top_comments": [
                "Honestly, as a teacher I would take this and use it to start teaching about all the discrepancies involving misinformation surrounding the election.",
                "Oklahomans weren't satisfied being ranked 49th in Education. They really want that coveted 50th spot. ",
                "But I bet you can’t teach them the accurate and comprehensive history about slavery, Jim Crow laws, the KKK, the Civil Rights movement..",
                "And for World History they want students to identify what went right in 1933 German politics...",
                "Remember when MAGA called education indoctrination? Maybe they were right",
                "If you can’t win history, rewrite it. Right comrads?",
                "\"TULSA, Okla. — New academic standards in Oklahoma call for the teaching of \"discrepancies\" in the 2020 election results, continuing the spread of a false narrative years after it was first pushed by President Trump and his allies.\"\n\n\"The standards were enacted last month after the Republican-controlled Legislature declined to block them. And while the process to advance the standards has drawn ire from members of Oklahoma's majority party, the question of the standards' content has gotten little pushback.\"\n\n\"The new standards have been championed by Ryan Walters, the state superintendent of public instruction and a conservative firebrand.\"\n\n#  \"These new standards will ensure that kids have an accurate and comprehensive view of historical events, while also reinforcing the values that make our country great,\" Walters said at a February State Board of Education meeting.\n\n\"The new standards were [quietly introduced just hours before that February meeting](https://www.kgou.org/education/2025-04-24/oklahoma-board-of-ed-pushes-back-on-social-studies-standards-senate-gop-poised-to-reject-them), and Walters falsely told board members that to make legislative deadlines, the standards needed to be approved that day. They were.\"\n\n\"While the standards are set to go into effect next school year, a lawsuit filed by a GOP former Oklahoma attorney general could stall their implementation.\"\n\n\"But like other criticisms coming from Republicans, the lawsuit calls out problems in the approval process — not the standards themselves.\"",
                "Why on earth would anyone live there if they had any other option?",
                "You mean the discrepancies that resulted in the people claiming they existed losing a bunch of lawsuits because they had zero evidence to back up their claims? Those discrepancies? ",
                "While shielding them from the truth that the Conservative Supreme Court was presented with these supposed “discrepencies” and they refused to even hear the case, citing lack of evidence… \n\nThat fact blows up any and all claims of a stolen election. If there was a shred of viable evidence that Dems stole the election, the supreme court would have tripped over themselves to hear the case. \n\nTrump lost. Anyone saying anything else is lying to push a political agenda."
            ],
            "aggregate_sentiment": 35.0
        },
        {
            "category": "NEW",
            "title": "Boy Hits Car Concert Canceled After Truck Hits Venue",
            "external_url": "https://www.stereogum.com/2307504/boy-hits-car-concert-canceled-after-truck-hits-venue/news/",
            "upvotes": 153,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ok, how many times did you read that title? Don’t be shy lol",
                "I think I'm having a stroke",
                "Boy Hits Car, the band, has concert canceled after truck hits venue",
                "*Boy Hits Car* concert canceled after truck hits venue\n\nOh, the irony",
                "Godzilla had a stroke reading this and fucking died",
                "A roller coaster ride of a read.\n\nWhat a misleading band name.",
                "Got to say if the OP didnt  capitalize every single word it would be a lot more reader friendly.",
                "Whoever wrote that headline had the best day.",
                "If there was ever a time for quotation marks…",
                "Ok so in a way Truck Hits Venue sounds like a band that went on first and slayed so hard they cancelled the next band, Boy Hits Car. XD props to the journalist, once in a lifetime headline lmao "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Michigan man, 19, accused of planning mass shooting at military base on behalf of ISIS",
            "external_url": "https://www.cbsnews.com/detroit/news/melvindale-michigan-man-accused-attempted-attack-military-base-isis/",
            "upvotes": 358,
            "date": "05/14/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/14/404ae841-ffb7-41fa-ad34-505181b2fa9b/thumbnail/1200x630/c111e2e1f7b98e32881f0f75501da154/ap25134545187943.jpg?v=d8ac70a2c93631c1c3223eab6ec7acf9",
            "top_comments": [
                "> “The man, Ammar Abdulmajid-Mohamed Said, 19, was arrested outside the U.S. Army Tank-Automotive & Armaments Command in Warren, Mich., by federal agents, **with whom he had been unknowingly discussing his plans since last June**, according to a criminal complaint.”\n\nRemember kids: if someone in your group encourages you to do violence, that person is a Fed",
                "\"If convicted, Said faces up to 20 years in prison.\"\n\nEven 20 years would be too light. Although given the option, I hope he does face the maximum amount of time",
                "Only a 20 year maximum for that is insane",
                "“Michigan Man” sounds allot more random and innocent than “Ammar Abdul Muhammad”",
                "30 years in GITMO sounds pretty fair",
                "Oh Mohamed is in his name? That’s crazy…",
                "Wow, Ammar Abdulmajid-Mohamed Said did this? Always the ones you least expect",
                "Cue the Muslim ban. Warm up the El Salvador bound plains. We have ourselves an excuse for mass cruelty on our hands.",
                "There’s the news that Trump has been waiting for…time to implement martial law.",
                "[deleted]"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Minneapolis and state leaders prepare for possible Derek Chauvin pardon",
            "external_url": "https://kstp.com/kstp-news/top-news/minneapolis-and-state-leaders-prepare-for-possible-derek-chauvin-pardon/",
            "upvotes": 1865,
            "date": "05/14/2025",
            "thumbnail": "https://kstp.com/wp-content/uploads/2025/05/MPLS-CIVIL-UNREST-PREPS_PKG_00.01.26.30.jpg",
            "top_comments": [
                "Article says that even if he's pardoned for his Federal crimes, he must still serve his sentences for his state crimes. 22 years. He's not going to be set free.",
                "From the article:\n\n> Multiple sources told 5 EYEWITNESS NEWS that Gov. Tim Walz, the Minnesota National Guard, Mayor Jacob Frey and Hennepin County Sheriff Dawanna Witt have all been briefed on preparations for possible civil unrest if President Donald Trump pardons former Minneapolis Police Officer Derek Chauvin for his federal conviction of killing George Floyd.\n\n> Then, on Monday, when asked about the possibility of a pardon, Gov. Walz told reporters, “No indication whether they’re going to do it, or not, but I think it behooves us to be prepared for it. With this presidency, it seems like something they would do.”\n\nSo it doesn't sound like Trump or the White House have said anything concrete, but there seem to be *rumors* circulating of a potential pardon which is what is causing this preparation.\n\nThe good news: Trump can only pardon him on federal crimes, not the state ones. Chauvin still has a 22 year sentence to serve in Minnesota even if he is pardoned federally.",
                "Trump absolutely will pardon him, but he owes Minnesota 22 additional years.",
                "Can’t be pardoned by Trump for his state convictions which carry a longer sentence.",
                "If they ignore the states 22 year sentence even if pardoned you’re setting a scary precedent",
                "Trump is trying to get black people to start mass protesting so he can declare a national emergency and fuck shit up forever.",
                "This seems like Trump trying to let a federal pardon also pardon a state crime.  Try it on Chauvin and see if it works before he does it to himself and friends.",
                "They’re doing this to get black folk out to protest to lock us up and send us out of the country. \n\nI pray we don’t fall for it.",
                "The irony is that Chauvin is probably safer and more comfortable in federal prison than he would be in state prison. Trump wouldn’t be doing him any favors.",
                "They want to poke the BLM bear into rioting so they can deploy the military."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Qatar Airways signs deal for up to 210 Boeing jets during Trump visit",
            "external_url": "https://www.reuters.com/business/aerospace-defense/qatar-signs-200-bln-deal-buy-jets-boeing-during-trump-visit-2025-05-14/",
            "upvotes": 186,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What a coincidental timing!  Definitely no quid pro quo happening here.",
                "Their entire fleet (passenger and cargo) is 252 planes... unless they are planning to drastically increase the number of flights they are doing, 210 planes would be like decades worth of purchases.",
                "Somewhere between 0 and 210.  Okay.",
                "Deal is for 160 with an option for 50 more. I’d imagine this is spread over something like 15-20 years or so. \n\n- 130 787 Dreamliners \n\n- 30 777-9\n\n\nNot too far in dreamland territory, I’d say.",
                "Go to the BIG factory in Wisconsin, and see a Trump promise.",
                "Does the number of planes keep going up?",
                "If the \"deal\" was with Trump, it is worth nothing. If the deal was with Boeing, can guarantee it is not an actual contract yet, just a 'memorandum of understanding' which is basically \"We're thinking about buying Boeing jets.\"",
                "That’s fine, I don’t want to ever get on a Boeing Jet if I can help it anyway. (Not like I was ever going to go somewhere that I could even use Qatar Air for anyway tbh)",
                "I'm sure it's like all these promises people make trump.  Big promise, little delivery.   Theyre going to end up buying 1 plane and trump will tout the sale as if it was 200.",
                "Man... its gonna be really awkward once they realize no one wants to go to the US anymore."
            ],
            "aggregate_sentiment": 25.0
        },
        {
            "category": "NEW",
            "title": "Yemeni terror suspect placed under house arrest at Toronto mosque",
            "external_url": "https://globalnews.ca/news/11178907/yemeni-terror-suspect-house-arrest-toronto-mosque/",
            "upvotes": 18,
            "date": "05/14/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/04/Al-Sewaiee-Facebook.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "More than 1,000 Starbucks baristas go on strike to protest new dress code",
            "external_url": "https://apnews.com/article/starbucks-dress-code-baristas-strike-3a39bbf41247d2090afa9b487ccf3d97",
            "upvotes": 5720,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "**Summary:**\n\nOver 1,000 Starbucks baristas at 75 U.S. stores have gone on strike since Sunday to protest a new dress code requiring solid black shirts and khaki, black, or blue denim bottoms.\n\nPreviously, employees could wear more varied dark colors and patterns. \n\nStarbucks says the change is meant to make its green apron more distinctive and create a more welcoming atmosphere.\n\nHowever, Starbucks Workers United, the union representing employees at 570 company-owned stores, argues that the policy should be negotiated as part of collective bargaining.\n\nWorkers also criticized the company for selling now-banned clothing styles on its internal site.\n\nStarbucks stated the strike has had minimal impact and criticized the union for not prioritizing contract negotiations.\n\nThe union has filed a complaint with the National Labor Relations Board.",
                "I don’t think I’ve ever noticed what a barista was wearing aside from if they had an apron on or a hat of some sort.",
                "Is it really about the dress code? Or was this just the last straw in a line of other grievances?",
                "Hate when I try to order a coffee but none of the workers clothing makes their aprons color pop and I don't feel welcome and have to have a screaming mental breakdown",
                ">create a sense of familiarity for customers as it tries to establish a warmer, more welcoming feeling in its stores.\n\nI don't think that having every store and every person working there looking the same accomplishes this.",
                "I can't believe someone out there is being paid 90 million a year to think up stupid shit like this",
                "They don't even want people drinking their drinks in the store anymore. Why the fuck should customers care how \"inviting\" baristas look? Starbucks corporate wants us out of their stores.",
                "It's very simple: whatever your opinion is on the dress code and it's validity, the union is arguing that the company doesn't have the right to change the dress code without prior consent from the union.\n\n\nThis is simply a case of the union looking out for workers the way it's supposed to, and it wouldn't matter if the dress code was changed to clown shoes and a clown car or to outlaw the color the Puce. The union is arguing that they need to be consulted and negotiated with no matter what the change is.\n\n\nThey are not dying on the hill of the dress code. They are dying on the hill of the rights of the union to collective bargaining. ",
                "The less a job pays, the more controlling it is.\n\nWorking a shit job on your feet for 8-12 hours a day for minimum wage? No sitting, don't you dare be late to and from your 15 minute break, don't you dare have a snack on the job, restroom breaks better not be more than 2-3 minutes, but also don't you DARE clock in or out a minute later or earlier than you're supposed to. But you better be available whenever they call, god help you if you aren't. \n\nAnd of course, the good ol' American tradition of as few days off as they're legally allowed to give you, all the way down to zero. Also don't forget some of that pay is going back into your own healthcare THAT YOU STILL HAVE TO PAY MONEY FOR if something goes wrong.",
                "A lot of people siding with the a union busting company flagrantly ignoring mandatory bargaining when the terms and conditions of employment have being changed.\n\nYeah, ultimately a dress code may or may not be a small thing.  \nSo crazy that the company is violating NLRA to do so when they could have just... bargained with the union.\n\nLots of people probably think it's the customer's fault for the \"Warning: Coffee May Be Hot\" stuff.\n\nStarbucks knows exactly what they're doing: Undermining the union they wish would just go away already."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Mother allegedly buys ammunition, tactical gear for son's planned 'mass targeted violence' at middle school: Officials",
            "external_url": "https://abcnews.go.com/US/mother-allegedly-buys-ammunition-tactical-gear-sons-planned/story?id=121800886",
            "upvotes": 4019,
            "date": "05/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/26244efe-a01c-486e-bd33-0e51fe7d7e13/ashley-pardo-booking-photo-ht-jt-250514_1747243699979_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "“…as payment for watching his younger siblings”\n\nWow I just give mine VBucks.",
                "Thanks god for that grandmother.",
                ">The son, who was not named in the affidavit, was contacted by officials at the time and described a \"fascination with past mass shooters,\" according to the affidavit.\n\n>On Monday, the boy told his grandmother he was \"going to be famous\" before being picked up by his mom and taken to school, according to officials.\n\nI'm getting the feeling that some of these kids don't really have any personal grievance or genuine malice toward their targets. But are obsessed with the fame and notoriety that surrounds mass shooters.",
                "This is why I support news outlets and other sites not glorifying mass shooters by not mentioning their names or showing photos. Keep the losers as anonymous as possible.",
                "\"Mother, I crave violence.\"\n\n\"Anything for my baby boy.\"",
                "> The explosive device had the words \"For Brenton Tarrant,\" referencing the shooter in the 2019 mosque attack, along with multiple \"SS\" symbols and \"14 words\" -- referencing white supremacy -- written on it, according to the affidavit.\n\nHow does a middle-schooler become so radicalized?  The internet is turning out to be as much a curse as a blessing.  Free speech never ran up against something as powerful as social media, we have to figure this out.",
                "Thank God for that grandmother. She potentially saved many lives. And shame on that mother. What a stupid stupid lady.",
                "Damn. If the report here is accurate, this wasn't simply a case of an inattentive or incompetent parent, this was essentially grooming him to become a mass shooter. It wouldn't surprise me if it comes out she flat out instructed him to do it.",
                "So the kid is a Texican white supremacist? The mom too?\n\nThe key thing was that this kid was idolizing a neonazi mass murderer:\n\n>On Monday, the boy told his grandmother he was \"going to be famous\" before being picked up by his mom and taken to school, according to officials.\n\n>The grandmother then looked through the boy's bedroom, where she found magazines loaded with live rifle ammunition and pistol magazines loaded with live ammunition, the affidavit said.\n\n>She also found an \"improvised explosive device\" -- a mortar-style firework wrapped in duct tape -- among the boy's belongings, the affidavit noted. The explosive device had the words \"For Brenton Tarrant,\" referencing the shooter in the 2019 mosque attack, along with multiple \"SS\" symbols and \"14 words\" -- referencing white supremacy -- written on it, according to the affidavit.\n\n>Along with the weaponry, the grandmother found a handwritten note referring to previous mass shootings, mass shooting suspects and the number of victims in each incident, the affidavit said.\n\nJust another moron brainwashed on White supremacy on the internet, while actually being a minority. 🤦\n\nWhen tf are we going to do something about this nazi/White supremacist garbage that keeps on spreading like a disease on the internet?",
                "And they say parents aren't involved in their kids educations these days."
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "NEW",
            "title": "HIV patient testing falls in South Africa after US aid cuts, data shows",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/hiv-patient-testing-falls-south-africa-after-us-aid-cuts-data-shows-2025-05-14/",
            "upvotes": 293,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They are a BRICS country, surely one of their compatriots who are desperate to replace the US dollar will step in to help",
                "Well, less people will test positive for HIV if we test less people. Epidemic solved!",
                "Maybe South Africa shouldn’t be dependent on the US and handle their own shit",
                "South Africa should have the scratch to provide HIV testing. There are resources there if they are properly administered, HIV tests are not atrociously priced. I'd rather US money to go to AIDS tests than a goddamn bomb, but at some point South Africa has to belly up to the bar and pay the fucking tab if someone doesn't want to do it for them. It's a serious threat for their populaton, the government needs to quit picking its fucking nose and get to work.",
                "It seems odd to cut off funds being used to treat communicable disease so the the diseases don't get to us.  Did they never read \"The Masque of the Red Death\"?",
                "“MAGA”: Well those are just black lives, and we’ve admitted those those matter^to^us .”\n\nAlso MAGA: We’re good Christians and everyone should follow Jesus (except the part about being kind to people, helping the sick, etc.",
                "Trump is importing people from South Africa does that mean they aren't screening them for HIV?",
                "The thinking goes something like this: HIV is something only gays and addicts get and they don't matter, so why even test.\n\nOf course the virus doesn't discriminate, people matter and testing reduces spreading, but the US no longer cares."
            ],
            "aggregate_sentiment": 63.0
        },
        {
            "category": "NEW",
            "title": "California Governor Newsom seeks to scale back free healthcare for migrants",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/california-governor-newsom-seeks-scale-back-free-healthcare-migrants-2025-05-14/",
            "upvotes": 4213,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "IMHO this prob has more to do with the insane budget problems MediCal currently faces.",
                "He’s gunning for the moderate republican path to the white house",
                "I wish more people would read the article before commenting.",
                "I don’t understand why we’re paying for migrant’s healthcare when there’s a huge percentage of Americans who can’t afford their own care and aren’t seeing a subsidy.   To get Medicaid, you have to be poor.  To afford quality healthcare when needed, you have to be an upper middle class or higher.  Everyone else in between can’t afford their own healthcare needs.",
                "Democrats: \"running presidential candidates who try to court the center right may have gotten us our shit kicked in twice now....what if we try it again, but with a man?\"",
                "Free health care for migrants? Did they run out of citizens needing free health care? If so, that’s awesome.",
                "Why don’t we focus on providing healthcare to tax payers first.",
                "Probably wasn't an amazing idea to begin with.",
                "We’re gonna get another Hillary Clinton with this one.",
                "Why is this seen as a bad thing? \n\nLike legit people can just pop in illegally and get free healthcare?\n\nThen why would all the actual citizenry bother paying for healthcare?"
            ],
            "aggregate_sentiment": 35.0
        },
        {
            "category": "NEW",
            "title": "Haitians face record hunger as gang violence grips country in throes of economic crisis",
            "external_url": "https://apnews.com/article/haiti-hunger-starvation-gang-violence-c5f3255aeb6a107ba0e419288bd3503c",
            "upvotes": 466,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In 2023, the UN sent in help from 6 countries to assist Haiti police. They have not been successful in pushing back the gangs.",
                "If you want to know something really dystopian, Royal Caribbean actually owns a little portion of Haiti on the northern coast. That resort is still open and you can take a cruise there. It’s completely fenced off from the rest of Haiti and has armed guards patrolling it. Basically no one is allowed in or out on the ground except a select few local vendors. \n\nSo yea, you can go take a cruise to a nice secluded beach and have a vacation while the rest of the country starves under their violent gang overlords just outside the fence.",
                "This situation is so fucked. And nobody wants to make it their problem, so the world just ignores it. Sad as hell.",
                "Haiti is a situation that’s going to require the direct intervention of military power.  The problem is no one has any interest in doing it as long as the conflict is contained.  Best solution would be some sort of joint Caribbean/ South American peacekeeping force but politics and history make that practically impossible.",
                "Wyclef could do a charity concert",
                "I don't even know how you fix something like this.  Send Nigeria to clean everything up?  Support one gang over another?  Make it a company island and bring in a company to take over everything?",
                "*While food and potable water were commonly distributed at shelters, aid began to dwindle after the administration of U.S. President Donald Trump in late February decided to terminate* [*90% of USAID foreign aid contracts*](https://apnews.com/article/trump-usaid-foreign-aid-cuts-6292f48f8d4025bed0bf5c3e9d623c16)*.*\n\nOur Gaza.",
                "The aftermath of the IMF.",
                "Has France ever made an effort historically to right their wrongs to Haiti?",
                "And the US will soon be deporting folks back there if they have not already started."
            ],
            "aggregate_sentiment": 23.0
        },
        {
            "category": "RISING",
            "title": "Michigan man, 19, accused of planning mass shooting at military base on behalf of ISIS",
            "external_url": "https://www.cbsnews.com/detroit/news/melvindale-michigan-man-accused-attempted-attack-military-base-isis/",
            "upvotes": 358,
            "date": "05/14/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/14/404ae841-ffb7-41fa-ad34-505181b2fa9b/thumbnail/1200x630/c111e2e1f7b98e32881f0f75501da154/ap25134545187943.jpg?v=d8ac70a2c93631c1c3223eab6ec7acf9",
            "top_comments": [
                "> “The man, Ammar Abdulmajid-Mohamed Said, 19, was arrested outside the U.S. Army Tank-Automotive & Armaments Command in Warren, Mich., by federal agents, **with whom he had been unknowingly discussing his plans since last June**, according to a criminal complaint.”\n\nRemember kids: if someone in your group encourages you to do violence, that person is a Fed",
                "\"If convicted, Said faces up to 20 years in prison.\"\n\nEven 20 years would be too light. Although given the option, I hope he does face the maximum amount of time",
                "Only a 20 year maximum for that is insane",
                "“Michigan Man” sounds allot more random and innocent than “Ammar Abdul Muhammad”",
                "30 years in GITMO sounds pretty fair",
                "Oh Mohamed is in his name? That’s crazy…",
                "Wow, Ammar Abdulmajid-Mohamed Said did this? Always the ones you least expect",
                "Cue the Muslim ban. Warm up the El Salvador bound plains. We have ourselves an excuse for mass cruelty on our hands.",
                "There’s the news that Trump has been waiting for…time to implement martial law.",
                "[deleted]"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "Minneapolis and state leaders prepare for possible Derek Chauvin pardon",
            "external_url": "https://kstp.com/kstp-news/top-news/minneapolis-and-state-leaders-prepare-for-possible-derek-chauvin-pardon/",
            "upvotes": 1854,
            "date": "05/14/2025",
            "thumbnail": "https://kstp.com/wp-content/uploads/2025/05/MPLS-CIVIL-UNREST-PREPS_PKG_00.01.26.30.jpg",
            "top_comments": [
                "Article says that even if he's pardoned for his Federal crimes, he must still serve his sentences for his state crimes. 22 years. He's not going to be set free.",
                "From the article:\n\n> Multiple sources told 5 EYEWITNESS NEWS that Gov. Tim Walz, the Minnesota National Guard, Mayor Jacob Frey and Hennepin County Sheriff Dawanna Witt have all been briefed on preparations for possible civil unrest if President Donald Trump pardons former Minneapolis Police Officer Derek Chauvin for his federal conviction of killing George Floyd.\n\n> Then, on Monday, when asked about the possibility of a pardon, Gov. Walz told reporters, “No indication whether they’re going to do it, or not, but I think it behooves us to be prepared for it. With this presidency, it seems like something they would do.”\n\nSo it doesn't sound like Trump or the White House have said anything concrete, but there seem to be *rumors* circulating of a potential pardon which is what is causing this preparation.\n\nThe good news: Trump can only pardon him on federal crimes, not the state ones. Chauvin still has a 22 year sentence to serve in Minnesota even if he is pardoned federally.",
                "Trump absolutely will pardon him, but he owes Minnesota 22 additional years.",
                "Can’t be pardoned by Trump for his state convictions which carry a longer sentence.",
                "If they ignore the states 22 year sentence even if pardoned you’re setting a scary precedent",
                "Trump is trying to get black people to start mass protesting so he can declare a national emergency and fuck shit up forever.",
                "This seems like Trump trying to let a federal pardon also pardon a state crime.  Try it on Chauvin and see if it works before he does it to himself and friends.",
                "They’re doing this to get black folk out to protest to lock us up and send us out of the country. \n\nI pray we don’t fall for it.",
                "The irony is that Chauvin is probably safer and more comfortable in federal prison than he would be in state prison. Trump wouldn’t be doing him any favors.",
                "They want to poke the BLM bear into rioting so they can deploy the military."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Mother allegedly buys ammunition, tactical gear for son's planned 'mass targeted violence' at middle school: Officials",
            "external_url": "https://abcnews.go.com/US/mother-allegedly-buys-ammunition-tactical-gear-sons-planned/story?id=121800886",
            "upvotes": 4015,
            "date": "05/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/26244efe-a01c-486e-bd33-0e51fe7d7e13/ashley-pardo-booking-photo-ht-jt-250514_1747243699979_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "“…as payment for watching his younger siblings”\n\nWow I just give mine VBucks.",
                "Thanks god for that grandmother.",
                ">The son, who was not named in the affidavit, was contacted by officials at the time and described a \"fascination with past mass shooters,\" according to the affidavit.\n\n>On Monday, the boy told his grandmother he was \"going to be famous\" before being picked up by his mom and taken to school, according to officials.\n\nI'm getting the feeling that some of these kids don't really have any personal grievance or genuine malice toward their targets. But are obsessed with the fame and notoriety that surrounds mass shooters.",
                "This is why I support news outlets and other sites not glorifying mass shooters by not mentioning their names or showing photos. Keep the losers as anonymous as possible.",
                "\"Mother, I crave violence.\"\n\n\"Anything for my baby boy.\"",
                "> The explosive device had the words \"For Brenton Tarrant,\" referencing the shooter in the 2019 mosque attack, along with multiple \"SS\" symbols and \"14 words\" -- referencing white supremacy -- written on it, according to the affidavit.\n\nHow does a middle-schooler become so radicalized?  The internet is turning out to be as much a curse as a blessing.  Free speech never ran up against something as powerful as social media, we have to figure this out.",
                "Thank God for that grandmother. She potentially saved many lives. And shame on that mother. What a stupid stupid lady.",
                "Damn. If the report here is accurate, this wasn't simply a case of an inattentive or incompetent parent, this was essentially grooming him to become a mass shooter. It wouldn't surprise me if it comes out she flat out instructed him to do it.",
                "So the kid is a Texican white supremacist? The mom too?\n\nThe key thing was that this kid was idolizing a neonazi mass murderer:\n\n>On Monday, the boy told his grandmother he was \"going to be famous\" before being picked up by his mom and taken to school, according to officials.\n\n>The grandmother then looked through the boy's bedroom, where she found magazines loaded with live rifle ammunition and pistol magazines loaded with live ammunition, the affidavit said.\n\n>She also found an \"improvised explosive device\" -- a mortar-style firework wrapped in duct tape -- among the boy's belongings, the affidavit noted. The explosive device had the words \"For Brenton Tarrant,\" referencing the shooter in the 2019 mosque attack, along with multiple \"SS\" symbols and \"14 words\" -- referencing white supremacy -- written on it, according to the affidavit.\n\n>Along with the weaponry, the grandmother found a handwritten note referring to previous mass shootings, mass shooting suspects and the number of victims in each incident, the affidavit said.\n\nJust another moron brainwashed on White supremacy on the internet, while actually being a minority. 🤦\n\nWhen tf are we going to do something about this nazi/White supremacist garbage that keeps on spreading like a disease on the internet?",
                "And they say parents aren't involved in their kids educations these days."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "More than 1,000 Starbucks baristas go on strike to protest new dress code",
            "external_url": "https://apnews.com/article/starbucks-dress-code-baristas-strike-3a39bbf41247d2090afa9b487ccf3d97",
            "upvotes": 5721,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "**Summary:**\n\nOver 1,000 Starbucks baristas at 75 U.S. stores have gone on strike since Sunday to protest a new dress code requiring solid black shirts and khaki, black, or blue denim bottoms.\n\nPreviously, employees could wear more varied dark colors and patterns. \n\nStarbucks says the change is meant to make its green apron more distinctive and create a more welcoming atmosphere.\n\nHowever, Starbucks Workers United, the union representing employees at 570 company-owned stores, argues that the policy should be negotiated as part of collective bargaining.\n\nWorkers also criticized the company for selling now-banned clothing styles on its internal site.\n\nStarbucks stated the strike has had minimal impact and criticized the union for not prioritizing contract negotiations.\n\nThe union has filed a complaint with the National Labor Relations Board.",
                "I don’t think I’ve ever noticed what a barista was wearing aside from if they had an apron on or a hat of some sort.",
                "Is it really about the dress code? Or was this just the last straw in a line of other grievances?",
                "Hate when I try to order a coffee but none of the workers clothing makes their aprons color pop and I don't feel welcome and have to have a screaming mental breakdown",
                ">create a sense of familiarity for customers as it tries to establish a warmer, more welcoming feeling in its stores.\n\nI don't think that having every store and every person working there looking the same accomplishes this.",
                "I can't believe someone out there is being paid 90 million a year to think up stupid shit like this",
                "They don't even want people drinking their drinks in the store anymore. Why the fuck should customers care how \"inviting\" baristas look? Starbucks corporate wants us out of their stores.",
                "It's very simple: whatever your opinion is on the dress code and it's validity, the union is arguing that the company doesn't have the right to change the dress code without prior consent from the union.\n\n\nThis is simply a case of the union looking out for workers the way it's supposed to, and it wouldn't matter if the dress code was changed to clown shoes and a clown car or to outlaw the color the Puce. The union is arguing that they need to be consulted and negotiated with no matter what the change is.\n\n\nThey are not dying on the hill of the dress code. They are dying on the hill of the rights of the union to collective bargaining. ",
                "The less a job pays, the more controlling it is.\n\nWorking a shit job on your feet for 8-12 hours a day for minimum wage? No sitting, don't you dare be late to and from your 15 minute break, don't you dare have a snack on the job, restroom breaks better not be more than 2-3 minutes, but also don't you DARE clock in or out a minute later or earlier than you're supposed to. But you better be available whenever they call, god help you if you aren't. \n\nAnd of course, the good ol' American tradition of as few days off as they're legally allowed to give you, all the way down to zero. Also don't forget some of that pay is going back into your own healthcare THAT YOU STILL HAVE TO PAY MONEY FOR if something goes wrong.",
                "A lot of people siding with the a union busting company flagrantly ignoring mandatory bargaining when the terms and conditions of employment have being changed.\n\nYeah, ultimately a dress code may or may not be a small thing.  \nSo crazy that the company is violating NLRA to do so when they could have just... bargained with the union.\n\nLots of people probably think it's the customer's fault for the \"Warning: Coffee May Be Hot\" stuff.\n\nStarbucks knows exactly what they're doing: Undermining the union they wish would just go away already."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Boy Hits Car Concert Canceled After Truck Hits Venue",
            "external_url": "https://www.stereogum.com/2307504/boy-hits-car-concert-canceled-after-truck-hits-venue/news/",
            "upvotes": 153,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ok, how many times did you read that title? Don’t be shy lol",
                "I think I'm having a stroke",
                "Boy Hits Car, the band, has concert canceled after truck hits venue",
                "*Boy Hits Car* concert canceled after truck hits venue\n\nOh, the irony",
                "Godzilla had a stroke reading this and fucking died",
                "A roller coaster ride of a read.\n\nWhat a misleading band name.",
                "Got to say if the OP didnt  capitalize every single word it would be a lot more reader friendly.",
                "Whoever wrote that headline had the best day.",
                "If there was ever a time for quotation marks…",
                "Ok so in a way Truck Hits Venue sounds like a band that went on first and slayed so hard they cancelled the next band, Boy Hits Car. XD props to the journalist, once in a lifetime headline lmao "
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "18-year-old girl escapes captivity from New Jersey home where she was allegedly forced to live in dog crate and abused",
            "external_url": "https://www.nbcnews.com/news/us-news/girl-escapes-new-jersey-home-dog-crate-rcna206746",
            "upvotes": 5033,
            "date": "05/14/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250514-gloucester-township-police-ew-102p-3c05cf.jpg",
            "top_comments": [
                ">A New Jersey couple has been charged after an 18-year-old escaped their residence and said she was forced to live in a dog crate for a year, given a bucket to use as a bathroom and sexually abused.\n\n>Brenda Spencer, 38, and Branndon Mosley, 41, of Gloucester Township, were charged with kidnapping and Mosley with additional counts of sexual assault, The Camden County Prosecutor’s Office and Gloucester Township Police announced Wednesday. \n\n>The 18-year-old female had escaped the home on May 8, assisted by a neighbor, prosecutors and police said in a [news release.](https://camdencountypros.org/news/article/2236?fbclid=IwY2xjawKRp_9leHRuA2FlbQIxMABicmlkETFCY3MzQWJNSDJMSFlrOVNnAR4GzMVmBE9KiKriuG3mfkneWSdhLhN9kX6JEAHEGSzpvMUKbpV3oi2ZlPEk1Q_aem_LxPQvRGtmwszP5CpKS2Hwg) The abuse was then reported to police on Saturday.\n\n>The victim said Spencer and Mosley had abused her since 2018.\n\n>Around that time, she was removed from school when she was in the sixth grade “at Spencer’s discretion and confined to her home,” officials said. The victim said shortly after she was pulled out of school, she was “forced to live in a dog crate for approximately one year and was let out periodically,” the release said. \n\n>Later, she was forced to live in a padlocked bathroom and was chained up. She told police she would be let out of the bathroom when family visited the home. At other times she lived in a bare room with a bucket to use as a toilet.\n\n>The victim told police the room had an alarm system that would “alert Spencer and Mosley if she tried to leave.” The victim also reported being beaten with a belt and sexually abused by Mosley, officials stated.\n\nIt's a horrific story, with more details including a 13-year-old who also lived there as well as the kids being pulled out of school years before. How this couple (assuming they are parents but it doesn't specifically say so) could do that do another human being is unfathomable. The law better come down hard on them, with them never seeing the outside of a prison ever again.",
                "This whole “kids were removed from school by parents discretion” thing is one of the things that makes me so uneasy about homeschooling. I know this isn’t that, but the idea that a parent can lock a child away from the world is terrifying.",
                "What the absolute fuck.\n\nI hope the two girls are getting the help they need. Put the monsters where monsters belong.",
                "It’s horrible what people do to kids",
                "Ah jeez they live next to my old neighborhood. It's right near an elementary school. There needs to be regular welfare checks for home schooled children in an effort to prevent horrible shit like this from happening.",
                "Yeah, if someone gets homeschooled there should be regular wellness checks",
                "This is horrific. \n\nThe couple should get a life sentence with forced physical labor. All their earnings should go to the girl.\n\nI don't get why there aren't semi annual home inspections and  private interviews for home schooled kids.\n\nIs it really this easy to let them slip under the radar?",
                "So El Salvador for these folks? Were they not saying for the worst of the worst even if you are American.",
                "There are some absolute garbage people in this world, hope those girls can get help and try to live a life they deserve",
                "Today was not a good day to be able to read.\n\nThere is true evil in the world. I hope those girls get the help they need."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "HIV patient testing falls in South Africa after US aid cuts, data shows",
            "external_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/hiv-patient-testing-falls-south-africa-after-us-aid-cuts-data-shows-2025-05-14/",
            "upvotes": 290,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They are a BRICS country, surely one of their compatriots who are desperate to replace the US dollar will step in to help",
                "Well, less people will test positive for HIV if we test less people. Epidemic solved!",
                "Maybe South Africa shouldn’t be dependent on the US and handle their own shit",
                "South Africa should have the scratch to provide HIV testing. There are resources there if they are properly administered, HIV tests are not atrociously priced. I'd rather US money to go to AIDS tests than a goddamn bomb, but at some point South Africa has to belly up to the bar and pay the fucking tab if someone doesn't want to do it for them. It's a serious threat for their populaton, the government needs to quit picking its fucking nose and get to work.",
                "It seems odd to cut off funds being used to treat communicable disease so the the diseases don't get to us.  Did they never read \"The Masque of the Red Death\"?",
                "“MAGA”: Well those are just black lives, and we’ve admitted those those matter^to^us .”\n\nAlso MAGA: We’re good Christians and everyone should follow Jesus (except the part about being kind to people, helping the sick, etc.",
                "Trump is importing people from South Africa does that mean they aren't screening them for HIV?",
                "The thinking goes something like this: HIV is something only gays and addicts get and they don't matter, so why even test.\n\nOf course the virus doesn't discriminate, people matter and testing reduces spreading, but the US no longer cares."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Haitians face record hunger as gang violence grips country in throes of economic crisis",
            "external_url": "https://apnews.com/article/haiti-hunger-starvation-gang-violence-c5f3255aeb6a107ba0e419288bd3503c",
            "upvotes": 462,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In 2023, the UN sent in help from 6 countries to assist Haiti police. They have not been successful in pushing back the gangs.",
                "If you want to know something really dystopian, Royal Caribbean actually owns a little portion of Haiti on the northern coast. That resort is still open and you can take a cruise there. It’s completely fenced off from the rest of Haiti and has armed guards patrolling it. Basically no one is allowed in or out on the ground except a select few local vendors. \n\nSo yea, you can go take a cruise to a nice secluded beach and have a vacation while the rest of the country starves under their violent gang overlords just outside the fence.",
                "This situation is so fucked. And nobody wants to make it their problem, so the world just ignores it. Sad as hell.",
                "Haiti is a situation that’s going to require the direct intervention of military power.  The problem is no one has any interest in doing it as long as the conflict is contained.  Best solution would be some sort of joint Caribbean/ South American peacekeeping force but politics and history make that practically impossible.",
                "Wyclef could do a charity concert",
                "I don't even know how you fix something like this.  Send Nigeria to clean everything up?  Support one gang over another?  Make it a company island and bring in a company to take over everything?",
                "*While food and potable water were commonly distributed at shelters, aid began to dwindle after the administration of U.S. President Donald Trump in late February decided to terminate* [*90% of USAID foreign aid contracts*](https://apnews.com/article/trump-usaid-foreign-aid-cuts-6292f48f8d4025bed0bf5c3e9d623c16)*.*\n\nOur Gaza.",
                "The aftermath of the IMF.",
                "Has France ever made an effort historically to right their wrongs to Haiti?",
                "And the US will soon be deporting folks back there if they have not already started."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Qatar Airways signs deal for up to 210 Boeing jets during Trump visit",
            "external_url": "https://www.reuters.com/business/aerospace-defense/qatar-signs-200-bln-deal-buy-jets-boeing-during-trump-visit-2025-05-14/",
            "upvotes": 190,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What a coincidental timing!  Definitely no quid pro quo happening here.",
                "Their entire fleet (passenger and cargo) is 252 planes... unless they are planning to drastically increase the number of flights they are doing, 210 planes would be like decades worth of purchases.",
                "Somewhere between 0 and 210.  Okay.",
                "Deal is for 160 with an option for 50 more. I’d imagine this is spread over something like 15-20 years or so. \n\n- 130 787 Dreamliners \n\n- 30 777-9\n\n\nNot too far in dreamland territory, I’d say.",
                "Go to the BIG factory in Wisconsin, and see a Trump promise.",
                "Does the number of planes keep going up?",
                "If the \"deal\" was with Trump, it is worth nothing. If the deal was with Boeing, can guarantee it is not an actual contract yet, just a 'memorandum of understanding' which is basically \"We're thinking about buying Boeing jets.\"",
                "That’s fine, I don’t want to ever get on a Boeing Jet if I can help it anyway. (Not like I was ever going to go somewhere that I could even use Qatar Air for anyway tbh)",
                "I'm sure it's like all these promises people make trump.  Big promise, little delivery.   Theyre going to end up buying 1 plane and trump will tout the sale as if it was 200.",
                "Man... its gonna be really awkward once they realize no one wants to go to the US anymore."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "US overdose deaths fell 27% last year, the largest one-year decline ever seen",
            "external_url": "https://apnews.com/article/us-overdose-deaths-opioids-1561a9f189255ad60c533462f10490a2",
            "upvotes": 1964,
            "date": "05/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "great news.  And we need more good news these days",
                "Surely this is something that health groups trying to limit drug access and stop overdoses can take credit for and not just one person who wasn’t even in office last year, right?",
                "Turns out harm reduction works better than criminalizing drug use or trying to shame people out of it",
                "Going to go up now that MAGA took away Narcan funding",
                "Trump will say it’s his border control while MAGA fucks simultaneously reduce access to life saving medical equipment and procedures.",
                "Seems like a great time to stop providing narcan /s",
                "Trump to claim credit in 3...2...",
                "Well, that went well. Too bad this admin is trashing the programs that helped.",
                "This isn't nationwide tho. Some western states like Alaska had an increase for some reason. Seems like eastern decreases are sweeping westward",
                "When you don’t have people to gather data, lots of things will fall."
            ],
            "aggregate_sentiment": 14.0
        }
    ],
    "last_updated": "05/15/2025 00:42:45 UTC"
}