{
    "posts": [
        {
            "category": "HOT",
            "title": "Florida teacher loses job for calling student by ‘preferred’ name",
            "external_url": "https://www.clickorlando.com/news/local/2025/04/09/florida-teacher-loses-job-for-calling-student-by-preferred-name/",
            "upvotes": 8659,
            "date": "04/10/2025",
            "thumbnail": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/anyclip/fstl-tf/TBZTHJYBJ563IwLrah5g/1744232082153_1920x1080_thumbnail.jpg?_a=DATAdtfiZAA0",
            "top_comments": [
                "So does this apply to nicknames, or just trans kids?",
                "I remember a recent Townhall where a citizen called the chairperson \"Madam Chairwoman\" and the chair said \"I would prefer you call me Mr. Chairman,\" and the citizen responded with \"Per the resolution you just passed, I cannot be compelled to use your preferred pronouns, Madam Chairwoman.\"",
                "My wife is a Florida teacher, she cannot call students named Samuel, \"Sam\". She cannot call students named Samantha, \"Sam\". She can't call someone named Robert, \"Bobby\", unless she has a signed note by the parents allowing it. No, I'm not joking.\n\nShe also teaches 8 non-verbal special needs students, that have so far cut her face several times, choked her (kindergarten), and given her several bloody lips. These are kindergarteners. Many don't even live in a house, they live in shelters, or in a vehicle. The schools have codewords for those students, and offer no help. My wife is the one that gives them the stability their lives lack, and her thanks is being given more and more non-verbal, no IEP (they have no special education plan) and that makes it near impossible to teach the OTHER 30 kids in her class. She's also forced to teach them all together. So while one kid is hitting another, another kid is ripping books, and another has now absconded, with no teacher's aide, she has to deal with all that at the same time. \n\nEducation in Florida is in real danger.",
                "> “BPS supports parents’ rights to be the primary decision-makers in their children’s lives, and Florida law affirms their right to be informed.\n\n\n   \n\nUnless, of course, parents want to direct their transgender child's health care in a way that the state of Florida doesn't like. Then it's \"fuck off, we know best.\"",
                "The party of freedom is all about telling everyone what they can't do.",
                "They aren't just firing her, the state of Florida is taking action to revoke her teachers license so she can never work as a teacher again. This is all happening because her parents contacted the school board to whine about this teacher using their child's preferred name. Imagine how guilty their kid is going to feel for being used to destroy the career of such a beloved compassionate teacher.",
                "Using the name the kid prefers is grounds for dismissal? What kind of bizarro world is this?",
                "\"The teacher is working under a ten-month contract... Calhoun worked for the school district for eleven years\"\n\nHere is a good indication that Education is not considered a Profession in the fine state of Florida.",
                "I still don’t understand how this law isn’t a direct violation of the first amendment. We’re supposed to have freedom of speech but can get fired for calling someone the “wrong” name?",
                "…this whole anti-DEI, anti-trans, anti-woke movement is not only stupid but intentionally harmful… ffs\n\nThe Dems that get voted in, and the ones currently in place, need to treat Republicans EXACTLY how they treat Democrats and Independents: Step on their neck.\n\nTax the rich. Tax the churches. Remove loopholes. Outlaw lobbying. Make it illegal for justices to take bribes"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Elon Musk’s xAI powering its facility in Memphis with ‘illegal’ generators",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/09/elon-musk-xai-memphis",
            "upvotes": 4732,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1de7b9823a50c8556a5bbbf321475f37f23f0a1d/0_200_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3e836e9ed9df4c53d833c4600e85acf5",
            "top_comments": [
                "Once you become an oligarch, legality is a mere inconvenience and laws are polite suggestions!\n\nIn this particular scenario, DOGE will perhaps  identify some relevant government organizations that are in an urgent need for \"efficiency improvements\".",
                "It's okay.\n\nfElon is just going to buy more Carbon Tax credits from this Tesla company so they can just approve the permits!",
                "“If xAI doesn’t comply, the group says, it should be penalized $25,000 each day it violates the Clean Air Act.” Aka, you just informed them it costs $25k/day to operate their generators. Probably cheaper than the permits themselves.",
                "Musk himself is “illegal” can’t stand the sight of him",
                ">“I’m here because today we’ve learned that xAI is using 35 methane gas burning turbines,” said Pearson, who is the director of the advocacy group Memphis Community Against Pollution. “They have submitted a permit to our Shelby county health department for 15, yet they are using double that amount with no permit.”\n\nI applaud this activist that believes in breathing as a human right.\n\nBut Musk believes otherwise, and really, money makes right.\n\n(not /s that's how the USA works)",
                "The rich get richer, the poor get cancer",
                "AI is not worth the monetary and environmental costs:\n\n> It’s been known that xAI, Elon Musk’s artificial intelligence company, has been using around 15 portable generators to help power its massive supercomputer in Memphis without yet securing permits. But new aerial images obtained by the Southern Environmental Law Center show that number is now far higher. The group says these gas turbines combined can generate around 420MW of electricity, enough to power an entire city.\n> \n> …\n> \n>  But Musk has said he needs even more energy to deal with power fluctuation issues at the plant. When the first few methane gas generators appeared outside the xAI facility last summer, it caused a stir because the Shelby county health department and the Environmental Protection Agency said xAI wasn’t using permits to run those generators.\n\nSo that's a total of 570MW of electricity, which could power 380,000 homes! That's energy which is burning loads of fuel, raising the prices of everything and producing plenty of pollution. All for a product that many people don't want but which will be forced on them when they use associated products and services.\n\nNot to mention that most of this generation is not currently permitted by the relevant authorities.",
                "Tennessee politicians already opening their hands for the \"donations\" needed to allow this to become legalized",
                "It's fun when there is clearly a two tier system to rules and laws in the US. If you are rich, you play by completely different rules than us plebs.",
                "The environment is irrelevant to trump and his supporters."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "U.S. stocks slide again as euphoria over Trump's tariff pause starts to fade",
            "external_url": "https://www.npr.org/2025/04/10/g-s1-59342/global-markets-react-trump-tariffs-pause",
            "upvotes": 961,
            "date": "04/10/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+408/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa8%2Fc7%2F92a79a2c4836b9771d5e43dfba5d%2Fgettyimages-2208870658-1.jpg",
            "top_comments": [
                "You can bend a paperclip a few times. It'll hold.\n\nKeep bending it again and again and it breaks.",
                "Bond market is cratering and the Dow riding on feels. These bounces are all money making chances for the billionaires with inside scoops.",
                "China is now at 145% after clarification this morning and there’s still that’s blanket 10% on everyone else, and Mexico and Canada still at 25%.\n\nSo like, it’s not over, shits still going to get expensive and we won’t be able to afford the same amount of stuff we can right now.\n\nOh well. They’re doing an investigation on price gouging eggs! They’re fixing the eggs y’all!",
                "All the money was made yesterday, give them a few weeks, and they'll repeat what they did again.... They may have to investigate themselves for insider trading, but they won't find any wrong doing...",
                "The fomo yesterday gave way to math and realism overnight.",
                "The Titanic hit the iceberg and everything seemed fine. The stewards told people to return to their rooms. But now everyone is noticing a slight tilt...",
                "All this \"Yay! The market is up!\" Is so stupid\n\nIts still down over 6% in a month and down over 10% from the high\n\nTrump is still a disaster for the economy, its just less bad than it was 2 days ago, but its still bad lol",
                "Insider trading isn't a crime if youre the one writing the rules",
                "“Oh shit, we forgot about the Chinese!” -All of Wall Street today",
                "Do not try and play this market. Either you sold a week ago, or just buckle down."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "El Salvador says it shares gang intel with the US — and requests specific deportees | CNN",
            "external_url": "https://www.cnn.com/2025/04/09/americas/el-salvador-shares-gang-intel-with-us-intl-latam/index.html",
            "upvotes": 2136,
            "date": "04/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-05t040942z-1661266844-rc2brda67x5y-rtrmadp-3-usa-trump-migration-el-salvador.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So they are the ones who gave names of non-Salvadorans? \n\nSure, Jan.",
                "So in other words, gangs in El Salvador can pay to have their enemies brought back to El Salvador and placed in a prison where they can be dealt with anyway they desire. \n\nWelcome to manufactured hell on earth.",
                "They’re telling on themselves",
                "Requesting specific deportees to be handed over without due process so they they can perform labour without volition, pay or any means of escape....\n\nSo yeah, the USA is just openly providing slave labour now....",
                "So El Salvador can request specific people to be sent there, but the Trump administration would like us believe it would be impossible to have certain people (i.e. Kilmar Abrego Garcia) returned to the USA?",
                "Sounds like a system perfectly built for abuse.",
                "Republicans want to take your freedom of speech",
                "people trump paid millions to put deportees in slave concentration camp are very reliable source /s",
                "Sounds like theyre shopping to me.",
                "If the El Slavadoran government has evidence, they must produce it. Evidence is only evidence when it is presented to be critically evaluated. And even if there was evidence  this does not change the fact the even proven gang members are entitled to due process before being deported as gang members should be.\n\n\nAlso if I remember correctly, this El Salvadoran regime is pretty famous for being indiscriminant when it came to locking people up to address their gang problem. I'm not exactly sure I trust their evidence when it comes to asylum seekers."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "U.S. slaps 145% tariff on China in sharpest trade escalation yet",
            "external_url": "https://www.thestreet.com/crypto/policy/u-s-slaps-145-tariff-on-china-in-sharpest-trade-escalation-yet",
            "upvotes": 763,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "wake me up when it hits 400%",
                "Heh I legit laughed, this is just so silly it is getting funny now. We are in cartoon territory.",
                "Pushing china to a consumer based economy is going to destroy ours in the process. There are no winners in a trade war.",
                "I believe this is the source \n\nhttps://www.cnbc.com/2025/04/10/china-trump-tariffs-live-updates.html",
                "Exhausting timeline this is. It's April and already 2025 has lasted 10 years.",
                "Tomorrow it will be gone. Next week it will be back. It's exhausting keeping up with a demented man who acts on their ego and refuses help from experts who don't agree with him. ",
                "I wonder if they'll ever realize that it's not China that pays those tariffs.",
                "TJ MAXX, Marshall’s, home goods, Walmart, target, and about 1000 other companies are pissing their pants. INB4 their stock tanks, it’s gobbled up by investment firms, and Trump comes to an agreement with China which send stock prices soaring. ",
                "Pick a number, any number!",
                "Another day, another arbitrary number from the senile old fool."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "HOT",
            "title": "Police shoot best-selling author and wife of Weezer bassist, saying she pointed gun at officers",
            "external_url": "https://www.nbcnews.com/news/us-news/police-shoot-wife-weezers-bassist-say-pointed-gun-officers-rcna200543",
            "upvotes": 744,
            "date": "04/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250409-scott-shriner-weezer-bassist-wife-jillian-lauren-shriner-2015-ac-1021p-c88a84.jpg",
            "top_comments": [
                "can't wait to see this body cam",
                "*A best-selling author was shot by police and accused of attempted murder after authorities said she pointed a gun at officers who were searching for hit-and-run suspects in a residential Los Angeles neighborhood.*\n\n*Police said Shriner was not involved in the hit-and-run incident and the shooting is being investigated by LAPD’s Force Investigation Division.*\n\n*The department said officers encountered Shriner in the backyard of her home in Eagle Rock, north of downtown Los Angeles, Tuesday afternoon after the California Highway Patrol requested help finding three hit-and-run suspects allegedly involved in a crash on a nearby freeway.*\n\nSo she armed herself because strangers were in her yard and they shot her?",
                "she was in her own backyard? wow",
                "Cops: someone commit a crime that we won’t even be putting them in jail for \n\nAlso cops: because of this we must go and shoot someone in their yard",
                "Thank you for highlighting her achievement rather than her marriage",
                "What's with these homies shooting my girl",
                "“One of the hit-and-run suspects was found, cited and released, the department said. Two others were not located.”\n\nShe got shot over something that wasn’t even bad enough to arrest the original suspect? Fuck that!",
                "Love how they tried to charge her to get out of shit. Show the body cam footage.",
                "\"..shot her in the shoulder\" - wait, didn't six officers mag dump into her lifeless body while screaming \"show me your hands\"",
                "Gosh, this story sure has changed since yesterday. From \"she came out the front door shooting\" to \"she was in her back yard with a gun protecting her property\". This is a prime example of \"A lie can travel halfway around the world before the truth can get its boots on.\""
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Video shows 4 captive Ukrainian troops killed by men identified as Russian forces",
            "external_url": "https://apnews.com/article/russia-ukraine-pows-war-crimes-putin-zelenskyy-a2185297338af410fb5122448e62db76",
            "upvotes": 2011,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This probably happens every day",
                "So warcrimes then the Russian soldiers did warcrimes.\n\nWonder what bullshit excuse Vlad has for this.\n\nNo word on Rubio being stern with russia yet either.",
                "The event was filmed by two drones. One Russian, One Ukranian. The Russian video was posted in Russian media showing the men surrendering and lying on the ground, ending there, and reporting they were taken alive. The Ukrainian video goes on to show the men shot in their heads after lying on the ground. These war crimes must be answered for one day. The sooner the better. Long live the Sovreign'd state of Ukraine. May its flag fly one day over Red Square.",
                "I wonder if these russian soldiers were specifically ordered to do this or that they're genuinely evil. \n\nKilling POW is literally another flight of stairs downwards to hell.\n\nI can only imagine that the common soldier is just a dude with no intentions to straight-up murder people who aren't a threat and that they, too, would hope to stay alive and treated accordingly, should they ever be captured by the enemy.",
                "Vile - but is there a reason Ukrainian troops keep surrendering after 3 years of footage of them then being shot? ",
                "Why doesn’t the international court start war crime prosecutions now? At least if Putin and his generals get convicted it restricts the movements internationally.",
                "I genuinely hope for the most horrible things to happen to Putin. Monsters like that deserve to meet their end like monsters, these people should not exist if we hope for global peace.",
                "Anyone has the video without the blurry circle??? Supposedly there are 2 videos from Russian side and Ukrainian side. Would love to see both for comparison.",
                "[deleted]",
                "Yes, that is what happens in war, each side kills the other side’s troops - and sometimes their own. \n\nWarcrimes."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Hundreds of Israeli Air Force Reservists Call for Halt to Gaza War",
            "external_url": "https://www.nytimes.com/2025/04/10/world/middleeast/israel-gaza-hamas-hostages-air-force.html?unlocked_article_code=1.-k4.YDh5.Gmn9DMdrt8ov&smid=url-share",
            "upvotes": 519,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The extent to which Netanyahu has pointlessly fractured Israeli society over first the judical coup and now a pointless war for coalition reasons is astonishing. \n\nMakes me like Begin for heavens sake.",
                "Because my post was taken down in r/worldnews...\n\n\"The letter, signed by roughly a thousand people, including a former chief of staff and other former senior military leaders, laid bare a growing divide in the Israeli military over the handling of the war. The air force has been a key part of Israel’s effort in Gaza, [carrying out airstrikes](https://www.nytimes.com/2025/04/09/world/middleeast/israel-gaza-city-strike-hamas.html) that have flattened much of the enclave and left thousands dead.\n\nThe appeal immediately drew a rebuke from the Israeli prime minister’s office, which said that “statements that weaken the Israel Defense Forces and strengthen our enemy during wartime” were 'unforgivable.'\"",
                "Glad to see some backbone against villains",
                "Good on them. This needs to stop",
                "Israel used to be a democracy...",
                "It’s harder for Americans to criticize Israeli-perpetrated genocide than it is for Israeli soldiers to do it.  THERE IS NO ANTI GENOCIDE PARTY IN AMERICA.  Change my mind.",
                "If they said this in the US they would be deported for antisemitism.",
                "They don't actually have an issue with the genocide they're participating in through the murder of thousands of Palestinians and the annexation of their homes, they just believe the current strategy endangers 24 remaining hostages.",
                "Its good that some of them are sprouting a conscience but regardless Israel should be treated as a pariah for decades to come.",
                "Its not a war, its a genocide.\n\nCome on, say it.\n\nDon't act like bombing ruins and journalists is a war."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Kash Patel removed as acting ATF director, replaced by Army Secretary",
            "external_url": "https://www.reuters.com/world/us/kash-patel-removed-acting-atf-director-replaced-by-army-secretary-sources-say-2025-04-09/",
            "upvotes": 22555,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Wait. So, is the Army Secretary holding both roles? So ATF and a branch of the military report to the same person?\n\n\nI'm not sure that makes me feel all warm and fuzzy...",
                "I’m beginning to think there’s a bit of chaos going on within this current administration…",
                "Guys, this administration is a cornucopia of shit. ",
                "On threads they reported Kash simply stopped coming into work (at the ATF, not the FBI). I’ll take my karma wins where I can.",
                "How many Scaramuccis did he last?",
                "Patel is not fit to run anything.",
                "Removed because he wasn't doing the job and didn't show up.\n\nOn that note, does anyone know if he's been doing his FBI job or showing up there?",
                "Ok, so what's this a distraction for?",
                "Got fired for being there for Ovechkin's 895th goal.",
                "Couldn't keep both eyes on the ball it seems..."
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "HOT",
            "title": "China orders its banks to reduce US dollar purchases.",
            "external_url": "https://www.reuters.com/world/china/chinas-central-bank-asks-state-lenders-reduce-dollar-purchases-sources-say-2025-04-09/",
            "upvotes": 32541,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And 10yr treasure bonds above 4.5%.\n\nChina said fuck this tit for tat tariff bullshit.  They are using all their tools.",
                "There goes the infinite money hack the federal budget depends on. How long before the entire government collapses due to a total lack of funds?",
                "Wow, this is going much quicker than I expected. I thought we'd have to go through the recession before we had to print money. Looks like this is a speed run.",
                "Things are looking good, MAGA. It looks like you're going to get what you wanted. The rest of the world will be just fine without you.",
                "So I have a question what happens when all that US debt that China has bought up over the last 20 years or so what happens if they want to cash it in.",
                "All this because we won't just tax billionaires",
                "Turns out you don’t have the cards, Donald.",
                "Economic pressure is not going to work against China. They felt the impacts of the trade war that Trump started in 2018 and continued under Biden and started to quickly de-couple themselves from the dollar and critical imports. The increased tariffs will hurt everyone globally, but the ones that'll feel the impacts most both short-term and long-term are Americans.",
                "People voted for this goof because they thought it would be a good thing for the country to be run by an experienced \"business man\". Well now they get to see the how incompatible that role is for this fucknut.",
                "No problem. Trump will just order an intern to ask chatGPT to come up with a new executive order declaring that the Chinese are not allowed to stop investing in America. And then he'll threaten them with more tariffs.\n\nProblem solved."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "USDA to close down DC headquarters, lay off thousands of workers: report",
            "external_url": "https://www.fox5dc.com/news/usda-close-down-dc-headquarters-lay-off-thousands-workers-report",
            "upvotes": 17,
            "date": "04/10/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5dc.com/www.fox5dc.com/content/uploads/2024/01/1280/720/Dept-of-Agriculture.jpg?ve=1&tl=1",
            "top_comments": [
                "Cool, this should have zero negative ramifications",
                "What the fuck. \n\nSo we can't get fruit from Mexico and our own farms no longer have insurance to cover the increasing terrible storms",
                "Eh, my food was too safe anyway. Time to take a life altering gamble every time I eat a meal I guess....",
                "Someone is gutting your country from the inside out."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Police shoot best-selling author and wife of Weezer bassist, saying she pointed gun at officers",
            "external_url": "https://www.nbcnews.com/news/us-news/police-shoot-wife-weezers-bassist-say-pointed-gun-officers-rcna200543",
            "upvotes": 745,
            "date": "04/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250409-scott-shriner-weezer-bassist-wife-jillian-lauren-shriner-2015-ac-1021p-c88a84.jpg",
            "top_comments": [
                "can't wait to see this body cam",
                "*A best-selling author was shot by police and accused of attempted murder after authorities said she pointed a gun at officers who were searching for hit-and-run suspects in a residential Los Angeles neighborhood.*\n\n*Police said Shriner was not involved in the hit-and-run incident and the shooting is being investigated by LAPD’s Force Investigation Division.*\n\n*The department said officers encountered Shriner in the backyard of her home in Eagle Rock, north of downtown Los Angeles, Tuesday afternoon after the California Highway Patrol requested help finding three hit-and-run suspects allegedly involved in a crash on a nearby freeway.*\n\nSo she armed herself because strangers were in her yard and they shot her?",
                "she was in her own backyard? wow",
                "Cops: someone commit a crime that we won’t even be putting them in jail for \n\nAlso cops: because of this we must go and shoot someone in their yard",
                "Thank you for highlighting her achievement rather than her marriage",
                "What's with these homies shooting my girl",
                "“One of the hit-and-run suspects was found, cited and released, the department said. Two others were not located.”\n\nShe got shot over something that wasn’t even bad enough to arrest the original suspect? Fuck that!",
                "Love how they tried to charge her to get out of shit. Show the body cam footage.",
                "\"..shot her in the shoulder\" - wait, didn't six officers mag dump into her lifeless body while screaming \"show me your hands\"",
                "Gosh, this story sure has changed since yesterday. From \"she came out the front door shooting\" to \"she was in her back yard with a gun protecting her property\". This is a prime example of \"A lie can travel halfway around the world before the truth can get its boots on.\""
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "U.S. slaps 145% tariff on China in sharpest trade escalation yet",
            "external_url": "https://www.thestreet.com/crypto/policy/u-s-slaps-145-tariff-on-china-in-sharpest-trade-escalation-yet",
            "upvotes": 756,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "wake me up when it hits 400%",
                "Heh I legit laughed, this is just so silly it is getting funny now. We are in cartoon territory.",
                "Pushing china to a consumer based economy is going to destroy ours in the process. There are no winners in a trade war.",
                "I believe this is the source \n\nhttps://www.cnbc.com/2025/04/10/china-trump-tariffs-live-updates.html",
                "Exhausting timeline this is. It's April and already 2025 has lasted 10 years.",
                "Tomorrow it will be gone. Next week it will be back. It's exhausting keeping up with a demented man who acts on their ego and refuses help from experts who don't agree with him. ",
                "I wonder if they'll ever realize that it's not China that pays those tariffs.",
                "TJ MAXX, Marshall’s, home goods, Walmart, target, and about 1000 other companies are pissing their pants. INB4 their stock tanks, it’s gobbled up by investment firms, and Trump comes to an agreement with China which send stock prices soaring. ",
                "Pick a number, any number!",
                "Another day, another arbitrary number from the senile old fool."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "U.S. stocks slide again as euphoria over Trump's tariff pause starts to fade",
            "external_url": "https://www.npr.org/2025/04/10/g-s1-59342/global-markets-react-trump-tariffs-pause",
            "upvotes": 966,
            "date": "04/10/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+408/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa8%2Fc7%2F92a79a2c4836b9771d5e43dfba5d%2Fgettyimages-2208870658-1.jpg",
            "top_comments": [
                "You can bend a paperclip a few times. It'll hold.\n\nKeep bending it again and again and it breaks.",
                "Bond market is cratering and the Dow riding on feels. These bounces are all money making chances for the billionaires with inside scoops.",
                "China is now at 145% after clarification this morning and there’s still that’s blanket 10% on everyone else, and Mexico and Canada still at 25%.\n\nSo like, it’s not over, shits still going to get expensive and we won’t be able to afford the same amount of stuff we can right now.\n\nOh well. They’re doing an investigation on price gouging eggs! They’re fixing the eggs y’all!",
                "All the money was made yesterday, give them a few weeks, and they'll repeat what they did again.... They may have to investigate themselves for insider trading, but they won't find any wrong doing...",
                "The fomo yesterday gave way to math and realism overnight.",
                "The Titanic hit the iceberg and everything seemed fine. The stewards told people to return to their rooms. But now everyone is noticing a slight tilt...",
                "All this \"Yay! The market is up!\" Is so stupid\n\nIts still down over 6% in a month and down over 10% from the high\n\nTrump is still a disaster for the economy, its just less bad than it was 2 days ago, but its still bad lol",
                "Insider trading isn't a crime if youre the one writing the rules",
                "“Oh shit, we forgot about the Chinese!” -All of Wall Street today",
                "Do not try and play this market. Either you sold a week ago, or just buckle down."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Tulsi Gabbard declared her residency in Texas. Then she voted in Hawaii.",
            "external_url": "https://www.cnn.com/2025/04/09/politics/tulsi-gabbard-texas-hawaii-voting-residency-invs/index.html",
            "upvotes": 166,
            "date": "04/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2206328507.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Literal fraud but, as usual, nothing will come of it.",
                "Crystal Mason served 3 years in prison for less.",
                "She probably did it on purpose to give her new overlords an example of \"Democrat\" voter fraud.",
                "I'm sure Texas will prosecute this well documented violation of their voting laws /s",
                "Couldn't HI charge her with voter fraud if she voted in any state or local races?",
                "Seems like another case where Republicans will learn the wrong lesson. Instead of seeing this as a case of an honest mistake that anyone could make\\*, they'll try and claim that this is proof that you need all these restrictions on voting. Restrictions that just, purely by coincidence they pinky swear, happen to disadvantage groups of people that aren't the base of the Republican Party.\n\n\\* If there's evidence she voted twice, or even attempted to, that would be a whole other story",
                "Voter fraud, lock her up",
                "can't we just send her back to her employer in Russia ?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Judge finds Newsmax aired false and defamatory claims about voting-tech company",
            "external_url": "https://www.npr.org/2025/04/09/nx-s1-5357885/newsmax-dominion-defamation-2020-election",
            "upvotes": 91,
            "date": "04/10/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4802x2701+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fda%2Fa8%2F70ac7c7b4d5099cbea29c8bdd419%2Fap25093562580589.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Amazon satellite launch scrubbed due to weather",
            "external_url": "https://www.coastalbreezenews.com/news/national/amazon-to-launch-first-batch-of-satellites-rivaling-musk/article_e240f0fe-78ea-5058-a663-4f3c044ff369.html",
            "upvotes": 15,
            "date": "04/10/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/coastalbreezenews.com/content/tncms/assets/v3/editorial/f/c4/fc4b288d-4f0e-5696-86fe-b30862634800/67f6c7ad42e1a.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "top_comments": [
                "Quick reading:\n\n  \nWeather prevented a rocket carrying the first batch of Amazon satellites designed to compete with Elon Musk's Starlink from lifting off Wednesday, in a setback for the planned Project Kuiper network.\n\n\"Stubborn cumulus clouds and persistent winds make liftoff not possible within the available window,\" read a liveblog update from operator United Launch Alliance (ULA), a joint venture between Boeing and Lockheed Martin.\n\nCumulus clouds are a particular danger for rockets as a nearby launch can trigger lightning strikes, ULA added.\n\nLivestream footage showed steam venting from the white Atlas V rocket laden with 27 Project Kuiper satellites as it stood on the launchpad through successive delays.\n\nLiftoff from Cape Canaveral in the US state of Florida had originally been slated for 7:00 pm (2300 GMT).\n\nLike Starlink, the Kuiper service is designed to provide internet access to even the most remote and underserved areas around the world, including war zones or disaster-struck areas.\n\nOnce in orbit, the satellites will be positioned hundreds of miles above the Earth, where they will form the foundations of Project Kuiper -- a constellation that Amazon says will include more than 3,200 satellites.\n\nAmazon, owned by billionaire Jeff Bezos, has said the internet service will go live this year.\n\nThe project's pricing has not yet been revealed, but Amazon has promised it will be in line with its existing reputation as a low-cost retailer.\n\nIts first launch will put Amazon into direct competition with SpaceX's Starlink and other satellite internet providers.\n\nThe Musk-owned SpaceX launched the first batch of its more than 6,750 operational Starlink satellites in 2019 and is by far the sector's biggest player, boasting over five million customers worldwide.\n\nStarlink has provided internet access to several disaster and war zones, including Morocco after a devastating 2023 earthquake there, as well as on the frontlines in Ukraine in its war with Russia.",
                "If only Elon hadn’t cut funding to the Democrat’s weather controlling machine this could have been avoided."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Hundreds of Israeli Air Force Reservists Call for Halt to Gaza War",
            "external_url": "https://www.nytimes.com/2025/04/10/world/middleeast/israel-gaza-hamas-hostages-air-force.html?unlocked_article_code=1.-k4.YDh5.Gmn9DMdrt8ov&smid=url-share",
            "upvotes": 520,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The extent to which Netanyahu has pointlessly fractured Israeli society over first the judical coup and now a pointless war for coalition reasons is astonishing. \n\nMakes me like Begin for heavens sake.",
                "Because my post was taken down in r/worldnews...\n\n\"The letter, signed by roughly a thousand people, including a former chief of staff and other former senior military leaders, laid bare a growing divide in the Israeli military over the handling of the war. The air force has been a key part of Israel’s effort in Gaza, [carrying out airstrikes](https://www.nytimes.com/2025/04/09/world/middleeast/israel-gaza-city-strike-hamas.html) that have flattened much of the enclave and left thousands dead.\n\nThe appeal immediately drew a rebuke from the Israeli prime minister’s office, which said that “statements that weaken the Israel Defense Forces and strengthen our enemy during wartime” were 'unforgivable.'\"",
                "Glad to see some backbone against villains",
                "Good on them. This needs to stop",
                "Israel used to be a democracy...",
                "It’s harder for Americans to criticize Israeli-perpetrated genocide than it is for Israeli soldiers to do it.  THERE IS NO ANTI GENOCIDE PARTY IN AMERICA.  Change my mind.",
                "If they said this in the US they would be deported for antisemitism.",
                "They don't actually have an issue with the genocide they're participating in through the murder of thousands of Palestinians and the annexation of their homes, they just believe the current strategy endangers 24 remaining hostages.",
                "Its good that some of them are sprouting a conscience but regardless Israel should be treated as a pariah for decades to come.",
                "Its not a war, its a genocide.\n\nCome on, say it.\n\nDon't act like bombing ruins and journalists is a war."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Florida teacher loses job for calling student by ‘preferred’ name",
            "external_url": "https://www.clickorlando.com/news/local/2025/04/09/florida-teacher-loses-job-for-calling-student-by-preferred-name/",
            "upvotes": 8695,
            "date": "04/10/2025",
            "thumbnail": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/anyclip/fstl-tf/TBZTHJYBJ563IwLrah5g/1744232082153_1920x1080_thumbnail.jpg?_a=DATAdtfiZAA0",
            "top_comments": [
                "So does this apply to nicknames, or just trans kids?",
                "I remember a recent Townhall where a citizen called the chairperson \"Madam Chairwoman\" and the chair said \"I would prefer you call me Mr. Chairman,\" and the citizen responded with \"Per the resolution you just passed, I cannot be compelled to use your preferred pronouns, Madam Chairwoman.\"",
                "My wife is a Florida teacher, she cannot call students named Samuel, \"Sam\". She cannot call students named Samantha, \"Sam\". She can't call someone named Robert, \"Bobby\", unless she has a signed note by the parents allowing it. No, I'm not joking.\n\nShe also teaches 8 non-verbal special needs students, that have so far cut her face several times, choked her (kindergarten), and given her several bloody lips. These are kindergarteners. Many don't even live in a house, they live in shelters, or in a vehicle. The schools have codewords for those students, and offer no help. My wife is the one that gives them the stability their lives lack, and her thanks is being given more and more non-verbal, no IEP (they have no special education plan) and that makes it near impossible to teach the OTHER 30 kids in her class. She's also forced to teach them all together. So while one kid is hitting another, another kid is ripping books, and another has now absconded, with no teacher's aide, she has to deal with all that at the same time. \n\nEducation in Florida is in real danger.",
                "> “BPS supports parents’ rights to be the primary decision-makers in their children’s lives, and Florida law affirms their right to be informed.\n\n\n   \n\nUnless, of course, parents want to direct their transgender child's health care in a way that the state of Florida doesn't like. Then it's \"fuck off, we know best.\"",
                "The party of freedom is all about telling everyone what they can't do.",
                "They aren't just firing her, the state of Florida is taking action to revoke her teachers license so she can never work as a teacher again. This is all happening because her parents contacted the school board to whine about this teacher using their child's preferred name. Imagine how guilty their kid is going to feel for being used to destroy the career of such a beloved compassionate teacher.",
                "Using the name the kid prefers is grounds for dismissal? What kind of bizarro world is this?",
                "\"The teacher is working under a ten-month contract... Calhoun worked for the school district for eleven years\"\n\nHere is a good indication that Education is not considered a Profession in the fine state of Florida.",
                "I still don’t understand how this law isn’t a direct violation of the first amendment. We’re supposed to have freedom of speech but can get fired for calling someone the “wrong” name?",
                "…this whole anti-DEI, anti-trans, anti-woke movement is not only stupid but intentionally harmful… ffs\n\nThe Dems that get voted in, and the ones currently in place, need to treat Republicans EXACTLY how they treat Democrats and Independents: Step on their neck.\n\nTax the rich. Tax the churches. Remove loopholes. Outlaw lobbying. Make it illegal for justices to take bribes"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "EU pauses countermeasures following Trump's tariff reprieve",
            "external_url": "https://www.reuters.com/world/trump-u-turns-tariffs-turns-trade-war-heat-china-2025-04-10/",
            "upvotes": 116,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Someone should check out Trump's friends' stock-buying activity. There's something called insider trading.\n\nWho am I kidding? They could announce it on national TV and they wouldn't face any consequences.",
                "It is both baffling and terrifying that our best defense against Donald Trump destroying the American economy (and the world economy with it), is that foreign leaders find ways to stymie his chaos and contain the damage he is doing. I am deeply embarrassed by my country's inability to recognize and stop this fucking travesty.",
                "Trump will do it again in 90 days, or sooner. Needs to make his friends rich. Insider trading without accountability.",
                "Shouldn’t back down. Should still impost tariffs. ",
                "Markets are still crashing today. Overall the average tariff is still 24%, and that's going hurt US tax payers. And the massive US bond selloff damage was already done.  No coming back from that.",
                "good\n\n  \nnow the EU has time to decouple and diversify from the US economy 👍",
                "I didn't expect to se a \"prisoner's dilemma\" game unfolding like this.",
                "Don't pause, keep going."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "U.S. stocks slide again as euphoria over Trump's tariff pause starts to fade",
            "external_url": "https://www.npr.org/2025/04/10/g-s1-59342/global-markets-react-trump-tariffs-pause",
            "upvotes": 963,
            "date": "04/10/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+408/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa8%2Fc7%2F92a79a2c4836b9771d5e43dfba5d%2Fgettyimages-2208870658-1.jpg",
            "top_comments": [
                "You can bend a paperclip a few times. It'll hold.\n\nKeep bending it again and again and it breaks.",
                "Bond market is cratering and the Dow riding on feels. These bounces are all money making chances for the billionaires with inside scoops.",
                "China is now at 145% after clarification this morning and there’s still that’s blanket 10% on everyone else, and Mexico and Canada still at 25%.\n\nSo like, it’s not over, shits still going to get expensive and we won’t be able to afford the same amount of stuff we can right now.\n\nOh well. They’re doing an investigation on price gouging eggs! They’re fixing the eggs y’all!",
                "All the money was made yesterday, give them a few weeks, and they'll repeat what they did again.... They may have to investigate themselves for insider trading, but they won't find any wrong doing...",
                "The fomo yesterday gave way to math and realism overnight.",
                "The Titanic hit the iceberg and everything seemed fine. The stewards told people to return to their rooms. But now everyone is noticing a slight tilt...",
                "All this \"Yay! The market is up!\" Is so stupid\n\nIts still down over 6% in a month and down over 10% from the high\n\nTrump is still a disaster for the economy, its just less bad than it was 2 days ago, but its still bad lol",
                "Insider trading isn't a crime if youre the one writing the rules",
                "“Oh shit, we forgot about the Chinese!” -All of Wall Street today",
                "Do not try and play this market. Either you sold a week ago, or just buckle down."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Hundreds of Israeli Air Force Reservists Call for Halt to Gaza War",
            "external_url": "https://www.nytimes.com/2025/04/10/world/middleeast/israel-gaza-hamas-hostages-air-force.html?unlocked_article_code=1.-k4.YDh5.Gmn9DMdrt8ov&smid=url-share",
            "upvotes": 517,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The extent to which Netanyahu has pointlessly fractured Israeli society over first the judical coup and now a pointless war for coalition reasons is astonishing. \n\nMakes me like Begin for heavens sake.",
                "Because my post was taken down in r/worldnews...\n\n\"The letter, signed by roughly a thousand people, including a former chief of staff and other former senior military leaders, laid bare a growing divide in the Israeli military over the handling of the war. The air force has been a key part of Israel’s effort in Gaza, [carrying out airstrikes](https://www.nytimes.com/2025/04/09/world/middleeast/israel-gaza-city-strike-hamas.html) that have flattened much of the enclave and left thousands dead.\n\nThe appeal immediately drew a rebuke from the Israeli prime minister’s office, which said that “statements that weaken the Israel Defense Forces and strengthen our enemy during wartime” were 'unforgivable.'\"",
                "Glad to see some backbone against villains",
                "Good on them. This needs to stop",
                "Israel used to be a democracy...",
                "It’s harder for Americans to criticize Israeli-perpetrated genocide than it is for Israeli soldiers to do it.  THERE IS NO ANTI GENOCIDE PARTY IN AMERICA.  Change my mind.",
                "If they said this in the US they would be deported for antisemitism.",
                "They don't actually have an issue with the genocide they're participating in through the murder of thousands of Palestinians and the annexation of their homes, they just believe the current strategy endangers 24 remaining hostages.",
                "Its good that some of them are sprouting a conscience but regardless Israel should be treated as a pariah for decades to come.",
                "Its not a war, its a genocide.\n\nCome on, say it.\n\nDon't act like bombing ruins and journalists is a war."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Florida teacher loses job for calling student by ‘preferred’ name",
            "external_url": "https://www.clickorlando.com/news/local/2025/04/09/florida-teacher-loses-job-for-calling-student-by-preferred-name/",
            "upvotes": 8671,
            "date": "04/10/2025",
            "thumbnail": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/anyclip/fstl-tf/TBZTHJYBJ563IwLrah5g/1744232082153_1920x1080_thumbnail.jpg?_a=DATAdtfiZAA0",
            "top_comments": [
                "So does this apply to nicknames, or just trans kids?",
                "I remember a recent Townhall where a citizen called the chairperson \"Madam Chairwoman\" and the chair said \"I would prefer you call me Mr. Chairman,\" and the citizen responded with \"Per the resolution you just passed, I cannot be compelled to use your preferred pronouns, Madam Chairwoman.\"",
                "My wife is a Florida teacher, she cannot call students named Samuel, \"Sam\". She cannot call students named Samantha, \"Sam\". She can't call someone named Robert, \"Bobby\", unless she has a signed note by the parents allowing it. No, I'm not joking.\n\nShe also teaches 8 non-verbal special needs students, that have so far cut her face several times, choked her (kindergarten), and given her several bloody lips. These are kindergarteners. Many don't even live in a house, they live in shelters, or in a vehicle. The schools have codewords for those students, and offer no help. My wife is the one that gives them the stability their lives lack, and her thanks is being given more and more non-verbal, no IEP (they have no special education plan) and that makes it near impossible to teach the OTHER 30 kids in her class. She's also forced to teach them all together. So while one kid is hitting another, another kid is ripping books, and another has now absconded, with no teacher's aide, she has to deal with all that at the same time. \n\nEducation in Florida is in real danger.",
                "> “BPS supports parents’ rights to be the primary decision-makers in their children’s lives, and Florida law affirms their right to be informed.\n\n\n   \n\nUnless, of course, parents want to direct their transgender child's health care in a way that the state of Florida doesn't like. Then it's \"fuck off, we know best.\"",
                "The party of freedom is all about telling everyone what they can't do.",
                "They aren't just firing her, the state of Florida is taking action to revoke her teachers license so she can never work as a teacher again. This is all happening because her parents contacted the school board to whine about this teacher using their child's preferred name. Imagine how guilty their kid is going to feel for being used to destroy the career of such a beloved compassionate teacher.",
                "Using the name the kid prefers is grounds for dismissal? What kind of bizarro world is this?",
                "\"The teacher is working under a ten-month contract... Calhoun worked for the school district for eleven years\"\n\nHere is a good indication that Education is not considered a Profession in the fine state of Florida.",
                "I still don’t understand how this law isn’t a direct violation of the first amendment. We’re supposed to have freedom of speech but can get fired for calling someone the “wrong” name?",
                "…this whole anti-DEI, anti-trans, anti-woke movement is not only stupid but intentionally harmful… ffs\n\nThe Dems that get voted in, and the ones currently in place, need to treat Republicans EXACTLY how they treat Democrats and Independents: Step on their neck.\n\nTax the rich. Tax the churches. Remove loopholes. Outlaw lobbying. Make it illegal for justices to take bribes"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "U.S. slaps 145% tariff on China in sharpest trade escalation yet",
            "external_url": "https://www.thestreet.com/crypto/policy/u-s-slaps-145-tariff-on-china-in-sharpest-trade-escalation-yet",
            "upvotes": 764,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "wake me up when it hits 400%",
                "Heh I legit laughed, this is just so silly it is getting funny now. We are in cartoon territory.",
                "Pushing china to a consumer based economy is going to destroy ours in the process. There are no winners in a trade war.",
                "I believe this is the source \n\nhttps://www.cnbc.com/2025/04/10/china-trump-tariffs-live-updates.html",
                "Exhausting timeline this is. It's April and already 2025 has lasted 10 years.",
                "Tomorrow it will be gone. Next week it will be back. It's exhausting keeping up with a demented man who acts on their ego and refuses help from experts who don't agree with him. ",
                "I wonder if they'll ever realize that it's not China that pays those tariffs.",
                "TJ MAXX, Marshall’s, home goods, Walmart, target, and about 1000 other companies are pissing their pants. INB4 their stock tanks, it’s gobbled up by investment firms, and Trump comes to an agreement with China which send stock prices soaring. ",
                "Pick a number, any number!",
                "Another day, another arbitrary number from the senile old fool."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Police shoot best-selling author and wife of Weezer bassist, saying she pointed gun at officers",
            "external_url": "https://www.nbcnews.com/news/us-news/police-shoot-wife-weezers-bassist-say-pointed-gun-officers-rcna200543",
            "upvotes": 755,
            "date": "04/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250409-scott-shriner-weezer-bassist-wife-jillian-lauren-shriner-2015-ac-1021p-c88a84.jpg",
            "top_comments": [
                "can't wait to see this body cam",
                "*A best-selling author was shot by police and accused of attempted murder after authorities said she pointed a gun at officers who were searching for hit-and-run suspects in a residential Los Angeles neighborhood.*\n\n*Police said Shriner was not involved in the hit-and-run incident and the shooting is being investigated by LAPD’s Force Investigation Division.*\n\n*The department said officers encountered Shriner in the backyard of her home in Eagle Rock, north of downtown Los Angeles, Tuesday afternoon after the California Highway Patrol requested help finding three hit-and-run suspects allegedly involved in a crash on a nearby freeway.*\n\nSo she armed herself because strangers were in her yard and they shot her?",
                "she was in her own backyard? wow",
                "Cops: someone commit a crime that we won’t even be putting them in jail for \n\nAlso cops: because of this we must go and shoot someone in their yard",
                "Thank you for highlighting her achievement rather than her marriage",
                "What's with these homies shooting my girl",
                "“One of the hit-and-run suspects was found, cited and released, the department said. Two others were not located.”\n\nShe got shot over something that wasn’t even bad enough to arrest the original suspect? Fuck that!",
                "Love how they tried to charge her to get out of shit. Show the body cam footage.",
                "\"..shot her in the shoulder\" - wait, didn't six officers mag dump into her lifeless body while screaming \"show me your hands\"",
                "Gosh, this story sure has changed since yesterday. From \"she came out the front door shooting\" to \"she was in her back yard with a gun protecting her property\". This is a prime example of \"A lie can travel halfway around the world before the truth can get its boots on.\""
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk’s xAI powering its facility in Memphis with ‘illegal’ generators",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/09/elon-musk-xai-memphis",
            "upvotes": 4737,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1de7b9823a50c8556a5bbbf321475f37f23f0a1d/0_200_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3e836e9ed9df4c53d833c4600e85acf5",
            "top_comments": [
                "Once you become an oligarch, legality is a mere inconvenience and laws are polite suggestions!\n\nIn this particular scenario, DOGE will perhaps  identify some relevant government organizations that are in an urgent need for \"efficiency improvements\".",
                "It's okay.\n\nfElon is just going to buy more Carbon Tax credits from this Tesla company so they can just approve the permits!",
                "“If xAI doesn’t comply, the group says, it should be penalized $25,000 each day it violates the Clean Air Act.” Aka, you just informed them it costs $25k/day to operate their generators. Probably cheaper than the permits themselves.",
                "Musk himself is “illegal” can’t stand the sight of him",
                ">“I’m here because today we’ve learned that xAI is using 35 methane gas burning turbines,” said Pearson, who is the director of the advocacy group Memphis Community Against Pollution. “They have submitted a permit to our Shelby county health department for 15, yet they are using double that amount with no permit.”\n\nI applaud this activist that believes in breathing as a human right.\n\nBut Musk believes otherwise, and really, money makes right.\n\n(not /s that's how the USA works)",
                "The rich get richer, the poor get cancer",
                "AI is not worth the monetary and environmental costs:\n\n> It’s been known that xAI, Elon Musk’s artificial intelligence company, has been using around 15 portable generators to help power its massive supercomputer in Memphis without yet securing permits. But new aerial images obtained by the Southern Environmental Law Center show that number is now far higher. The group says these gas turbines combined can generate around 420MW of electricity, enough to power an entire city.\n> \n> …\n> \n>  But Musk has said he needs even more energy to deal with power fluctuation issues at the plant. When the first few methane gas generators appeared outside the xAI facility last summer, it caused a stir because the Shelby county health department and the Environmental Protection Agency said xAI wasn’t using permits to run those generators.\n\nSo that's a total of 570MW of electricity, which could power 380,000 homes! That's energy which is burning loads of fuel, raising the prices of everything and producing plenty of pollution. All for a product that many people don't want but which will be forced on them when they use associated products and services.\n\nNot to mention that most of this generation is not currently permitted by the relevant authorities.",
                "Tennessee politicians already opening their hands for the \"donations\" needed to allow this to become legalized",
                "It's fun when there is clearly a two tier system to rules and laws in the US. If you are rich, you play by completely different rules than us plebs.",
                "The environment is irrelevant to trump and his supporters."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "El Salvador says it shares gang intel with the US — and requests specific deportees | CNN",
            "external_url": "https://www.cnn.com/2025/04/09/americas/el-salvador-shares-gang-intel-with-us-intl-latam/index.html",
            "upvotes": 2134,
            "date": "04/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-05t040942z-1661266844-rc2brda67x5y-rtrmadp-3-usa-trump-migration-el-salvador.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So they are the ones who gave names of non-Salvadorans? \n\nSure, Jan.",
                "So in other words, gangs in El Salvador can pay to have their enemies brought back to El Salvador and placed in a prison where they can be dealt with anyway they desire. \n\nWelcome to manufactured hell on earth.",
                "They’re telling on themselves",
                "Requesting specific deportees to be handed over without due process so they they can perform labour without volition, pay or any means of escape....\n\nSo yeah, the USA is just openly providing slave labour now....",
                "So El Salvador can request specific people to be sent there, but the Trump administration would like us believe it would be impossible to have certain people (i.e. Kilmar Abrego Garcia) returned to the USA?",
                "Sounds like a system perfectly built for abuse.",
                "Republicans want to take your freedom of speech",
                "people trump paid millions to put deportees in slave concentration camp are very reliable source /s",
                "Sounds like theyre shopping to me.",
                "If the El Slavadoran government has evidence, they must produce it. Evidence is only evidence when it is presented to be critically evaluated. And even if there was evidence  this does not change the fact the even proven gang members are entitled to due process before being deported as gang members should be.\n\n\nAlso if I remember correctly, this El Salvadoran regime is pretty famous for being indiscriminant when it came to locking people up to address their gang problem. I'm not exactly sure I trust their evidence when it comes to asylum seekers."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Video shows 4 captive Ukrainian troops killed by men identified as Russian forces",
            "external_url": "https://apnews.com/article/russia-ukraine-pows-war-crimes-putin-zelenskyy-a2185297338af410fb5122448e62db76",
            "upvotes": 2008,
            "date": "04/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This probably happens every day",
                "So warcrimes then the Russian soldiers did warcrimes.\n\nWonder what bullshit excuse Vlad has for this.\n\nNo word on Rubio being stern with russia yet either.",
                "The event was filmed by two drones. One Russian, One Ukranian. The Russian video was posted in Russian media showing the men surrendering and lying on the ground, ending there, and reporting they were taken alive. The Ukrainian video goes on to show the men shot in their heads after lying on the ground. These war crimes must be answered for one day. The sooner the better. Long live the Sovreign'd state of Ukraine. May its flag fly one day over Red Square.",
                "I wonder if these russian soldiers were specifically ordered to do this or that they're genuinely evil. \n\nKilling POW is literally another flight of stairs downwards to hell.\n\nI can only imagine that the common soldier is just a dude with no intentions to straight-up murder people who aren't a threat and that they, too, would hope to stay alive and treated accordingly, should they ever be captured by the enemy.",
                "Vile - but is there a reason Ukrainian troops keep surrendering after 3 years of footage of them then being shot? ",
                "Why doesn’t the international court start war crime prosecutions now? At least if Putin and his generals get convicted it restricts the movements internationally.",
                "I genuinely hope for the most horrible things to happen to Putin. Monsters like that deserve to meet their end like monsters, these people should not exist if we hope for global peace.",
                "Anyone has the video without the blurry circle??? Supposedly there are 2 videos from Russian side and Ukrainian side. Would love to see both for comparison.",
                "[deleted]",
                "Yes, that is what happens in war, each side kills the other side’s troops - and sometimes their own. \n\nWarcrimes."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Missouri woman accused of trading child for monkey",
            "external_url": "https://www.nbcnews.com/video/missouri-woman-accused-of-trading-child-for-monkey-236946501547",
            "upvotes": 648,
            "date": "04/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/mpx/2704722219/2025_04/nc_pkg_ksdk_foster_mom_monkey_250409-0h7ds0.jpg",
            "top_comments": [
                "Fuck, that was an option?",
                "I don't know wtf i'm reading anymore.  It's like the world went crazy.",
                "I didn't realize this was an option",
                "Haven't you always wanted a monkey?",
                "The good old Missouri monkey trade. ",
                "This is like one of those classic mom threats, except this one actually did it",
                "Finally a worthy match for Florida man.",
                "I want to see this monkey",
                "Parents, who among us hasn’t entertained this idea once or twice ",
                "I’m going to need to see a side-by-side pic before I pass judgment."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "‘Grubby’ treaty principles bill voted down in New Zealand parliament",
            "external_url": "https://www.theguardian.com/world/2025/apr/10/treaty-principles-bill-voted-down-in-new-zealand-parliament-maori",
            "upvotes": 186,
            "date": "04/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4e6175af3f58d8beb177ffc374d317684b0fa3b5/0_385_5911_3548/master/5911.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=da710e5d5c422c0c35c165bf16a7ba77",
            "top_comments": [
                "A lot of international articles about the Treaty have been bad, but this one is actually quite good. This bill, if passed, would have - among many bad things - allowed one man, a member of a minority party (ACT) to unilaterally rewrite the founding document of our country at the detriment of indigenous people. \n\nWhen the time came for consultation on the proposal, more people wrote submissions against the bill than voted for ACT in the first place.\n\nI am so glad that it was stopped",
                "Well, now kiwis know which 11 people in their parliament to never vote for again.",
                "Some info about the guy who fronted the bill, David Seymour:\n- Ties to Atlas network, a global right wing libertarian “think tank” that he continues to deny has any influence on him despite starting his political career working in one of their organisations and appearing at their events. One of his biggest donors, a matter of public record, is the mother of the Atlas CEO, but whenever one of them is asked about if they feign ignorance and call it a conspiracy theory. \n- New Zealand has extremely high rates of child poverty, the previous government set up a school lunch scheme. David Seymours first large political act after getting into government was to dismantle the school food programme and replace it with slop from a company that was found to be serving horse meat. \n\nTheres so much more, unfortunately.\n\nHis party still appeals to way too many voters, especially fringe voters who feel unheard by the progressive parties or the very old and stale moderate conservatives.",
                "As a Kiwi, I’m so proud of how New Zealand has embraced the Māori culture and language so fully, especially since I now live in the US, where they tend to treat Native Americans and their cultures in a very different way. Mostly as mascots for their sports teams or cigarette brands. I miss Aotearoa.",
                "More people submitted opposition to the bill than voted for ACT.\n\nBy around 20,000 people.",
                "fucking aye!!! fuck outta here you racist cunts, fuck off out of NZ, proud if my country telling these dog cunts to fuck right off David Seymore is a piece of garbage the dude doesn’t deserve the right to call himself kiwi hes a coward racist with zero policy’s that matter and a face that only fists could love"
            ],
            "aggregate_sentiment": 67.0
        }
    ],
    "last_updated": "04/10/2025 16:10:32 UTC"
}