{
    "posts": [
        {
            "category": "HOT",
            "title": "Warren Buffett knocks tariffs and protectionism: 'Trade should not be a weapon'",
            "external_url": "https://www.cnbc.com/2025/05/03/warren-buffett-knocks-tariffs-and-protectionism-trade-should-not-be-a-weapon.html",
            "upvotes": 6872,
            "date": "05/03/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108140448-1746280836757-Screenshot_2025-05-03_at_95634_AM.jpg?v=1746280907&w=1920&h=1080",
            "top_comments": [
                "Trump's not doing this because he actually thinks it can help the US, he's doing to tank the US on purpose and make money on the volatile market which he himself controls the ebbs and flow of with the tariff announcements and delays.",
                "Instead of incentivizing companies to build in America we are punishing them if they don't",
                "Trade has always been a weapon. It's supposed to be used to ensure peace and prosperity. Not naked avarice and greed.",
                "But this is what happens when you put someone from the dumb class in your school into the White House.",
                "Neither should healthcare, home insurance, immigration status, etc. but here we are - victims of our own govt.",
                "BRK.B up 19.04% YTD  \n[https://finance.yahoo.com/quote/BRK-B/](https://finance.yahoo.com/quote/BRK-B/)\n\nHe ain't no fool.",
                "That's *rich* coming from him",
                "he is for free trade and paying his fair share of taxes. one of the few good billionaires.",
                "He is not on the prole side.",
                "Maybe the US should listen to an actual business man for a change."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Marjorie Taylor Greene’s ex-husband publicly apologizes for harassing Muslim women",
            "external_url": "https://www.kold.com/2025/04/07/marjorie-taylor-greenes-ex-husband-publicly-apologizes-harassing-muslim-women/",
            "upvotes": 3244,
            "date": "05/03/2025",
            "thumbnail": "https://gray-kold-prod.gtv-cdn.com/resizer/v2/PCRIEX4PYBEKNDBKZYY6AYWWZ4.png?auth=38f6cf3d626588b20df8a514d7c98cda0bf8eb9b4d337efe47e394ad3bf5f8fe&width=1200&height=600&smart=true",
            "top_comments": [
                "He apologizes for being caught harassing Muslim women. Let’s be real here",
                "Too late, bro. The racism and bigotry are very apparent. Nothing will change with this pig. He only apologized because he was caught on camera.",
                "How romantic. He is wooing her back.",
                "> Greene then got into his Tesla Cybertruck and continued his tirade\n\nOf fucking course he did.",
                "\"Worshipping a false god\". What a douche.",
                "Ex husband?   Maybe he was trying to get her back through some elaborate racist mating ritual.",
                "*”…Georgia Rep. Marjorie Taylor Greene, a far-right Republican known for her unwavering support of President Donald Trump”.*\n\nWell, that’s one thing she’s known for. \n\n*”Greene then got into his Tesla Cybertruck and continued his tirade…”*\n\nOf course he did.",
                "The only surprising thing is that they are divorced.",
                "Now we just got to get her to apologize for being awful.",
                "He even tried it out that classic racist trope \"Go back to your country\" even though they were all born and raised in the US. Ignorant asshole."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Cincinnati police fatally shot an armed 18-year-old. The next day, his father killed a sheriff’s deputy, authorities say | CNN",
            "external_url": "https://www.cnn.com/2025/05/03/us/ohio-rodney-hinton-jr-arrest-hnk",
            "upvotes": 1919,
            "date": "05/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21594534-32264-561-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "To be clear, the sheriff that was killed was not connected to the shooting of the 18 year old.  The father snapped and ran over a sheriff directing traffic.  He watched the body cam video of his son's death and lost it.\n\nSad day for everyone involved",
                "The Sheriff that was killed was doing traffic duty for university of Cincinnati graduation. Heard he was close to retirement.\n\nEdit: already retired and was just helping with traffic",
                "So a guy is killed by police while brandishing a firearm in the commission of a felony and his father responds by murdering a cop who had nothing to do with it, yeah that family sounds like a great value to society",
                "*\"police did recover a handgun with an extended magazine attached near the man who was shot. A second magazine was found in the man's sweatshirt pocket.\"*\n\nAfter they had stolen a car and were confronted by police mind you.\n\nA pretty justified shooting by police it seems.",
                "seems most just read the headline and move on.  Killed kid was with three other kids who stole a car got in a police chase then wrecked.  All got out and ran and one of the kids had a gun which the police saw and yelled gun.  \n\nVideo\n\n[https://www.wcpo.com/news/local-news/cincinnati/east-price-hill/cpd-cincinnati-police-involved-in-shooting-no-officers-injured](https://www.wcpo.com/news/local-news/cincinnati/east-price-hill/cpd-cincinnati-police-involved-in-shooting-no-officers-injured)\n\n  \nnon-issue if the kids would have never stolen the car.",
                "It's not a crime to be armed in Ohio. Gun rights activists should be outraged the cops shot this kid for expressing his rights.",
                "Almost like “1 bad apple ruins the whole barrel.” This is a great example of why it would benefit “good cops” to align themselves with police reform/abolition movements.  \n\nAs long as police face impunity when they murdered citizens, every police officer is in danger of rage-induced crimes of retribution. \n\nTo be clear, the officer murdered was not involved in the murder of the son. But he’s dead now, because he chose to align himself with a fascist police state. \n\nRIP to the victims.",
                "*Hinton Jr.’s son was armed and fleeing from a stolen vehicle when a responding officer fatally shot him, police said. Police body cam footage does not clearly show whether the fleeing man pointed a gun at the officer.  The family reviewed the footage between 10 a.m. and 11 a.m. Friday, and the father was “very distraught...\"*\n\nThe innocent police officer is still alive if this shooting doesn't happen. How does one flee and aim a gun at the same time, esp in split seconds.  And the driving crime happened right after the father saw the footage. But it's going to be very bad for him on one more front--because of his very disturbed state.",
                ">“I do have a plea to everybody. Let the processes play out. Let the investigations play out. Keep calm, take care of one another and I can assure you, as the chief of police for Cincinatti, I will ensure you transparency and a thorough and accurate investigation,” Theetge said.\n\nYeah, if there are two things police are really known for investigating themselves, and being transparent with the public. Not trying to justify the actions here at all but you cannot hear this in modern America and expect much.",
                "[removed]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Kentucky $167.3 million Powerball jackpot winner arrested days after claiming prize",
            "external_url": "https://www.nbcmiami.com/news/local/kentucky-man-arrested-in-florida-days-after-winning-167m-powerball-jackpot/3605610/",
            "upvotes": 5602,
            "date": "05/03/2025",
            "thumbnail": "https://media.nbcmiami.com/2025/05/050225-Kentucky-lottery-winner-James-Farthing.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Sure he can afford a lawyer, but kicking a deputy in the face will probably land him in jail for a bit. \n\nI would not want to be anywhere confined with criminals, with them knowing I had hit a 167.3 million jackpot.",
                "Kentucky man goes to Florida with some New Money... You know it’s gonna be a doozy.",
                "Bro had his life solved forever and decided throwing it down the toilet was the most reasonable thing to do…\n\nDammm",
                "TLDR: He got in a fight with someone at the hotel he was staying at, cops tried to break it up and he kicked a cop in the face and tried to run.",
                "Won the Powerball on Monday. Kicked a cop in the face by Wednesday. That’s one hell of a retirement plan.",
                "Give Kentucky man enough money and what does he become?  Florida/Kentucky man, like some kind of hot mess hybrid experiment.",
                "Guy wins the lottery and to celebrate he takes a trip to…….Tampa.",
                "When keeping it real goes wrong.",
                "Shocking. He looked like such a responsible guy.",
                "My guys wearing a bulls hat. Automatically means he’s in MS-13. Deport his ass"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Guatemalan woman detained by Border Patrol after giving birth at Tucson hospital",
            "external_url": "https://www.kold.com/video/2025/05/03/guatemalan-woman-detained-by-border-patrol-after-giving-birth-tucson-hospital/",
            "upvotes": 2412,
            "date": "05/03/2025",
            "thumbnail": "https://gray-kold-prod.gtv-cdn.com/resizer/v2/https%3A%2F%2Fdo0bihdskp9dy.cloudfront.net%2F05-03-2025%2Ft_fce97cfd4e0c4635bc92fb4422dd9436_name_file_1280x720_2000_v3_1_.jpg?auth=3ae43ee12ac0983a7dc7c57c909ced8d5378d6f03fa3c3aaea4d1b8dad16a21a&width=1200&height=600&smart=true",
            "top_comments": [
                "Jesus Christ The Onion called it again. \n\n\n\n[https://theonion.com/ice-agents-wait-at-edge-of-delivery-table-to-deport-newborn/](https://theonion.com/ice-agents-wait-at-edge-of-delivery-table-to-deport-newborn/)",
                "Better article\n\nhttps://tucson.com/news/local/border/article_7de9b512-e6e1-44bc-a61d-187a2accd22e.html\n\nShe will probably be deported but hopefully will have an actual hearing. \n\nSo sad. She must have been desperate to attempt this whole 8 months pregnant.",
                "History will see ICE and border agents viewed similarly to nazi SS.",
                "Flaming headlines. Sigh.",
                "Where's the article? WTF is with only putting the information in video format? At a minimum include a transcript",
                "[removed]",
                "EDIT - Never mind, watch the video. Still awful,but for different  reasons 🤦‍♀️",
                "Is the issue with ANY sort of detainment/deportation or a specific kind of border enforcement?\n\nI really struggle to have sympathy with folks who don't want to follow the rules for immigrating to the US. I'm sorry your country might suck, might have specific threats aimed at you, etc. But we can't just let everyone in for any reason with or without following protocol. \n\nThe specific complaints being raised in threads like this always blend the reasonable and ridiculous. If you are an \"all borders open at all times\" person, you're a fucking moron. If you have a specific gripe with who ICE is now chasing or how they're doing it, my ears are open to hearing more.",
                "She was walking through the desert this week and the gives birth soon after. She planned to sneak into the border and then give birth immediately.",
                "Nah. I'm out of empathy. No due process involved with coming into the country? No due process being ejected. "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Berkshire Hathaway operating earnings drop more than expected as Buffett warns of tariff uncertainty",
            "external_url": "https://www.nbcnewyork.com/news/business/money-report/berkshire-hathaway-operating-earnings-drop-more-than-expected-as-buffett-warns-of-tariff-uncertainty/6249202/",
            "upvotes": 1677,
            "date": "05/03/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/05/108140441-1746280189515-Screenshot_2025-05-03_at_94538_AM-2.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Insurance profits down nearly 50%, wildfire losses over $1B, and Buffett still won’t spend from his record $347B cash pile. If that doesn’t scream uncertainty, nothing does.",
                "The fact that he has most of his net worth on the sidelines, tells you he is expecting a recession or most likely a depression.",
                "Jeff Bezos is selling a shit ton of stock.\n\nThe ultra wealthy see the writing on the wall.",
                "He also called tariffs an act of war",
                "Buffett is being awfully politically hostile here with those words. Better straighten up, Warren.",
                "He better be careful criticizing tarrifs, Trump will tweet lies and anti-American accusations at him, sicking his altright mob to boycott and harrass him in every way possible.\n\nBut the billionaire class asked for this, so I don't feel bad for the rich that own most of the stock market/these funds. \n\nThe entry barrier to Berkshire Hathaway is super high. There ain't no middle income earners investment portfolio holding Berkshire Hathaway.",
                "It's about time he spoke up!",
                "Good, they need to take down Berkshire and his monopoly",
                "A plutocrat won’t be making as much money.  Oh no! \n/s\n\nEdit:  Wow, the billionaire bootlickers must be out in force today."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "HOT",
            "title": "Warren Buffett announces retirement from leading Berkshire Hathaway",
            "external_url": "https://www.theguardian.com/business/2025/may/03/warren-buffett-retirement-berkshire-hathaway",
            "upvotes": 562,
            "date": "05/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d218a78e339c9698ddcbc45fd9e63371a830d6c/0_167_4352_2611/master/4352.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=15b65b9f6325868b57d16e2ab187bcf7",
            "top_comments": [
                "“I’m getting too old for this shit”",
                "It's crazy to think this should probably be a big news story but the world is such to where something even crazier will probably happen no later than Tuesday.",
                "Fella is turning 95 soon.\n\n>Buffett, a Democrat, has previously said that he [plans to donate](https://www.reuters.com/business/finance/buffett-refines-plans-his-fortune-donates-more-berkshire-shares-2024-11-25/#:~:text=Nov%2025%20(Reuters)%20%2D%20Warren,his%20fortune%20after%20his%20death.) 99.5% of his remaining wealth to a charitable trust overseen by his daughter and two sons when he dies. According to Forbes, Buffett has a net worth of $165.3bn.\n\nAnd to think the level of evil this guy could have unleashed with his understanding of the markets - considering he charitably *spent down* to just 165bn.",
                "I wonder if he’ll follow through with his pledge to the Susan Thompson Buffett Foundation.",
                "He knows it’s about to get real. Even he won’t be able to weather the storm that’s coming and so he’s going out on top with his “wizard” rep in tact.",
                "Fuck him and all his billionaire buddies.",
                "He should buy my half-scale TRON on ebay for funsies lmfao",
                "I'm really worried, how is he gonna keep making money without a job? ",
                "Just because he is a Democrat does not make him one of the “good ones”\n\nHe is just as bad as Musk. "
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "National Science Foundation Halts Funding Indefinitely",
            "external_url": "https://www.scientificamerican.com/article/under-trump-national-science-foundation-cuts-off-all-funding-to-scientists/",
            "upvotes": 5599,
            "date": "05/03/2025",
            "thumbnail": "https://static.scientificamerican.com/dam/m/2737c995ce342838/original/NSF_Logo_on-HQ.jpg?m=1746204485.782&w=1200",
            "top_comments": [
                "With all this \"cost savings\" they conveniently neglect to mention how much investment they're torching by preventing the completion of these studies.  Many years of scientific research and the funding that supported it will rot on the vine because they're effectively preventing the harvest.  They're f@#$&# liquidating taxpayer investments before they mature... At best to claim they saved a buck.  At worst to intentionally sabotage the government, the dollar, the country, and modern western society.",
                "This is so fucked! What's the point of taking intellectualism back to the fucking stone age?!??",
                "Oh God...they told us right there in print what they were going to do and people laughed.  \"Trump just being Trump\" was the most common excuse I heard \n\n\"He doesn't really mean it\"  \n\nYeah none of us are laughing now...more like screaming in terror.",
                "All of these things are traps set for anyone in the future who would try to fix the damage: they would have to spend a LOT of money to restart all these programs.",
                "This is how you truly crash the economy.\n\nCut all funding to science, thus stifling the innovation and invention that drives the economy.",
                "If you don't have a sense for scale, this is IMO the biggest news in weeks. Smart people can't do stuff without their NSF grants. Wow. ",
                "\"Hell is empty, and all the devils are here.\"",
                "Wow, I don't think ppl understand the gravity of this news. Sadly, without scientists they won't have anyone to explain it to them either. This would shutdown most University STEM research programs.",
                "Every day delayed is a week lost. Every week delayed is a month lost. Every month delayed is a year lost. Every year delayed is a decade lost.",
                "\"requires that grants be screened for “alignment with agency priorities\" \n\n\nBasically, if it's not Trump or Republican aligned then it's not happening."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Weekly measles cases hit new record amid worst outbreak since 1990s",
            "external_url": "https://www.cbsnews.com/news/weekly-measles-cases-hit-new-record-amid-worst-outbreak-since-1990s/",
            "upvotes": 1107,
            "date": "05/03/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/10/9cd3b00e-2d7a-4b8c-951b-4ef66e6dfc31/thumbnail/1200x630/afe989398a5be129028acb84db47ac36/measles-0409.png?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "“Modern Americans behave as if intelligence were some sort of hideous deformity.” - Frank Zappa",
                "I will never understand why people deliberately endanger their children with a preventable disease",
                "Great job, Republicans 👏",
                "Learning about immune amnesia from the measles is sobering. \n\nEssentially, wiping up to 73% of antibodies knowledge from ALL previous immune knowledge events (vaccinations, previous infections, babies putting everything in their mouths to kids recovering from illness, etc). Taking on average 2-3 YEARS for the previous level of immune protection knowledge to be restored.  Please consider inviting a conference of knowledge to your immune system. Our bodies need this information ahead of time.\n\n\nhttps://hms.harvard.edu/news/inside-immune-amnesia\n\nhttps://asm.org/articles/2019/may/measles-and-immune-amnesia",
                "It’s sad to see the USA which used to be the leading nation in quite a lot of areas fall down without grace.",
                "Next EO, measles will now be called Freedom Freckles.",
                "The US is going to lose its eradication certification, and the rest of the world will be alerted and issue travel warnings, which in turn will further hurt the tourism industry. Americans will also be subject to heightened scrutiny when traveling. \n\nThese are not opinions. This is how science works.",
                "Not in Europe, strangely enough. What are they doing differently over there? /s",
                "absolutely no correlation whatsoever. https://www.scientificamerican.com/article/under-trump-national-science-foundation-cuts-off-all-funding-to-scientists/",
                "I wonder if the folks in these communities who survive infection and think there out of the woods realize they've got 2-3 years of immunity amnesia to contend with, or as our Secretary of Health and Human Service might call it, \"miasma\"."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump to cut 1,200 CIA positions within larger plan to shrink spy workforce: report",
            "external_url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-cia-job-cuts-nsa-b2744123.html",
            "upvotes": 4554,
            "date": "05/03/2025",
            "thumbnail": "https://static.independent.co.uk/2024/12/11/21/United-States-Israel-Documents_46281.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "Leaking the names of spy's also shrank the workforce...",
                "I wonder which exact/particular people he is going to lay off?",
                "Somebody has to know that can make a difference, that he is purposely destroying America.",
                "The Why is a lie. Never believe trump is acting in good faith.",
                "But why? Oh that’s right, he’s Putins bottom. ",
                "Putin loves this guy ,Trump is a traitor. Russia will not have to fire a shot to control our government.",
                "JFK tried this once.......once.",
                "Spend less on ‘intelligence’ yet more on ‘defense’? Checks out",
                "What will all these unemployed spies do now",
                "It’s perfect. Trump makes lots of enemies and then shrinks our foreign intelligence agencies. Well done Republicans.😞"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Warren Buffett announces retirement from leading Berkshire Hathaway",
            "external_url": "https://www.theguardian.com/business/2025/may/03/warren-buffett-retirement-berkshire-hathaway",
            "upvotes": 561,
            "date": "05/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d218a78e339c9698ddcbc45fd9e63371a830d6c/0_167_4352_2611/master/4352.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=15b65b9f6325868b57d16e2ab187bcf7",
            "top_comments": [
                "“I’m getting too old for this shit”",
                "It's crazy to think this should probably be a big news story but the world is such to where something even crazier will probably happen no later than Tuesday.",
                "Fella is turning 95 soon.\n\n>Buffett, a Democrat, has previously said that he [plans to donate](https://www.reuters.com/business/finance/buffett-refines-plans-his-fortune-donates-more-berkshire-shares-2024-11-25/#:~:text=Nov%2025%20(Reuters)%20%2D%20Warren,his%20fortune%20after%20his%20death.) 99.5% of his remaining wealth to a charitable trust overseen by his daughter and two sons when he dies. According to Forbes, Buffett has a net worth of $165.3bn.\n\nAnd to think the level of evil this guy could have unleashed with his understanding of the markets - considering he charitably *spent down* to just 165bn.",
                "I wonder if he’ll follow through with his pledge to the Susan Thompson Buffett Foundation.",
                "He knows it’s about to get real. Even he won’t be able to weather the storm that’s coming and so he’s going out on top with his “wizard” rep in tact.",
                "Fuck him and all his billionaire buddies.",
                "He should buy my half-scale TRON on ebay for funsies lmfao",
                "I'm really worried, how is he gonna keep making money without a job? ",
                "Just because he is a Democrat does not make him one of the “good ones”\n\nHe is just as bad as Musk. "
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Cincinnati police fatally shot an armed 18-year-old. The next day, his father killed a sheriff’s deputy, authorities say | CNN",
            "external_url": "https://www.cnn.com/2025/05/03/us/ohio-rodney-hinton-jr-arrest-hnk",
            "upvotes": 1934,
            "date": "05/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21594534-32264-561-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "To be clear, the sheriff that was killed was not connected to the shooting of the 18 year old.  The father snapped and ran over a sheriff directing traffic.  He watched the body cam video of his son's death and lost it.\n\nSad day for everyone involved",
                "The Sheriff that was killed was doing traffic duty for university of Cincinnati graduation. Heard he was close to retirement.\n\nEdit: already retired and was just helping with traffic",
                "So a guy is killed by police while brandishing a firearm in the commission of a felony and his father responds by murdering a cop who had nothing to do with it, yeah that family sounds like a great value to society",
                "*\"police did recover a handgun with an extended magazine attached near the man who was shot. A second magazine was found in the man's sweatshirt pocket.\"*\n\nAfter they had stolen a car and were confronted by police mind you.\n\nA pretty justified shooting by police it seems.",
                "seems most just read the headline and move on.  Killed kid was with three other kids who stole a car got in a police chase then wrecked.  All got out and ran and one of the kids had a gun which the police saw and yelled gun.  \n\nVideo\n\n[https://www.wcpo.com/news/local-news/cincinnati/east-price-hill/cpd-cincinnati-police-involved-in-shooting-no-officers-injured](https://www.wcpo.com/news/local-news/cincinnati/east-price-hill/cpd-cincinnati-police-involved-in-shooting-no-officers-injured)\n\n  \nnon-issue if the kids would have never stolen the car.",
                "It's not a crime to be armed in Ohio. Gun rights activists should be outraged the cops shot this kid for expressing his rights.",
                "Almost like “1 bad apple ruins the whole barrel.” This is a great example of why it would benefit “good cops” to align themselves with police reform/abolition movements.  \n\nAs long as police face impunity when they murdered citizens, every police officer is in danger of rage-induced crimes of retribution. \n\nTo be clear, the officer murdered was not involved in the murder of the son. But he’s dead now, because he chose to align himself with a fascist police state. \n\nRIP to the victims.",
                "*Hinton Jr.’s son was armed and fleeing from a stolen vehicle when a responding officer fatally shot him, police said. Police body cam footage does not clearly show whether the fleeing man pointed a gun at the officer.  The family reviewed the footage between 10 a.m. and 11 a.m. Friday, and the father was “very distraught...\"*\n\nThe innocent police officer is still alive if this shooting doesn't happen. How does one flee and aim a gun at the same time, esp in split seconds.  And the driving crime happened right after the father saw the footage. But it's going to be very bad for him on one more front--because of his very disturbed state.",
                ">“I do have a plea to everybody. Let the processes play out. Let the investigations play out. Keep calm, take care of one another and I can assure you, as the chief of police for Cincinatti, I will ensure you transparency and a thorough and accurate investigation,” Theetge said.\n\nYeah, if there are two things police are really known for investigating themselves, and being transparent with the public. Not trying to justify the actions here at all but you cannot hear this in modern America and expect much.",
                "[removed]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Marjorie Taylor Greene’s ex-husband publicly apologizes for harassing Muslim women",
            "external_url": "https://www.kold.com/2025/04/07/marjorie-taylor-greenes-ex-husband-publicly-apologizes-harassing-muslim-women/",
            "upvotes": 3248,
            "date": "05/03/2025",
            "thumbnail": "https://gray-kold-prod.gtv-cdn.com/resizer/v2/PCRIEX4PYBEKNDBKZYY6AYWWZ4.png?auth=38f6cf3d626588b20df8a514d7c98cda0bf8eb9b4d337efe47e394ad3bf5f8fe&width=1200&height=600&smart=true",
            "top_comments": [
                "He apologizes for being caught harassing Muslim women. Let’s be real here",
                "Too late, bro. The racism and bigotry are very apparent. Nothing will change with this pig. He only apologized because he was caught on camera.",
                "How romantic. He is wooing her back.",
                "> Greene then got into his Tesla Cybertruck and continued his tirade\n\nOf fucking course he did.",
                "\"Worshipping a false god\". What a douche.",
                "Ex husband?   Maybe he was trying to get her back through some elaborate racist mating ritual.",
                "*”…Georgia Rep. Marjorie Taylor Greene, a far-right Republican known for her unwavering support of President Donald Trump”.*\n\nWell, that’s one thing she’s known for. \n\n*”Greene then got into his Tesla Cybertruck and continued his tirade…”*\n\nOf course he did.",
                "The only surprising thing is that they are divorced.",
                "Now we just got to get her to apologize for being awful.",
                "He even tried it out that classic racist trope \"Go back to your country\" even though they were all born and raised in the US. Ignorant asshole."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "NEA Grants Canceled for Several Bay Area Nonprofits",
            "external_url": "https://www.kqed.org/arts/13975661/national-endowment-for-the-arts-grants-canceled-nonprofits",
            "upvotes": 112,
            "date": "05/03/2025",
            "thumbnail": "https://ww2.kqed.org/app/uploads/sites/2/2023/11/231108-TheLab-48-BL_2000-1020x680.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "OPEC+ agrees another accelerated oil output hike for June",
            "external_url": "https://www.reuters.com/business/energy/opec-set-make-another-accelerated-oil-output-hike-june-sources-say-2025-05-03/",
            "upvotes": 179,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Increasing the supply of oil into a market that is already declining, because of worsening economic conditions around the world, seems folly. Perhaps, however, they have some understanding that Russian oil output will decline and perhaps Iran’s oil output will also decline, thereby offsetting some of the production hikes being permitted.",
                "Which makes \"drill baby drill\" a stupid thing for Americans to do.",
                "especially in terms of \"oil\", the arab states were always an enemy - they produce more --> price falls below cost for US producers --> US producers go broke --> OPEC limits production again --> price hikes...\n\nand when the US shale producers start to come back up, repeat...",
                "Where can I sign up for the hike? I love those kind of sponsored events.",
                "*oh no, the russian economy~* "
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Warren Buffett knocks tariffs and protectionism: 'Trade should not be a weapon'",
            "external_url": "https://www.cnbc.com/2025/05/03/warren-buffett-knocks-tariffs-and-protectionism-trade-should-not-be-a-weapon.html",
            "upvotes": 6875,
            "date": "05/03/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108140448-1746280836757-Screenshot_2025-05-03_at_95634_AM.jpg?v=1746280907&w=1920&h=1080",
            "top_comments": [
                "Trump's not doing this because he actually thinks it can help the US, he's doing to tank the US on purpose and make money on the volatile market which he himself controls the ebbs and flow of with the tariff announcements and delays.",
                "Instead of incentivizing companies to build in America we are punishing them if they don't",
                "Trade has always been a weapon. It's supposed to be used to ensure peace and prosperity. Not naked avarice and greed.",
                "But this is what happens when you put someone from the dumb class in your school into the White House.",
                "Neither should healthcare, home insurance, immigration status, etc. but here we are - victims of our own govt.",
                "BRK.B up 19.04% YTD  \n[https://finance.yahoo.com/quote/BRK-B/](https://finance.yahoo.com/quote/BRK-B/)\n\nHe ain't no fool.",
                "That's *rich* coming from him",
                "he is for free trade and paying his fair share of taxes. one of the few good billionaires.",
                "He is not on the prole side.",
                "Maybe the US should listen to an actual business man for a change."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Guatemalan woman detained by Border Patrol after giving birth at Tucson hospital",
            "external_url": "https://www.kold.com/video/2025/05/03/guatemalan-woman-detained-by-border-patrol-after-giving-birth-tucson-hospital/",
            "upvotes": 2415,
            "date": "05/03/2025",
            "thumbnail": "https://gray-kold-prod.gtv-cdn.com/resizer/v2/https%3A%2F%2Fdo0bihdskp9dy.cloudfront.net%2F05-03-2025%2Ft_fce97cfd4e0c4635bc92fb4422dd9436_name_file_1280x720_2000_v3_1_.jpg?auth=3ae43ee12ac0983a7dc7c57c909ced8d5378d6f03fa3c3aaea4d1b8dad16a21a&width=1200&height=600&smart=true",
            "top_comments": [
                "Jesus Christ The Onion called it again. \n\n\n\n[https://theonion.com/ice-agents-wait-at-edge-of-delivery-table-to-deport-newborn/](https://theonion.com/ice-agents-wait-at-edge-of-delivery-table-to-deport-newborn/)",
                "Better article\n\nhttps://tucson.com/news/local/border/article_7de9b512-e6e1-44bc-a61d-187a2accd22e.html\n\nShe will probably be deported but hopefully will have an actual hearing. \n\nSo sad. She must have been desperate to attempt this whole 8 months pregnant.",
                "History will see ICE and border agents viewed similarly to nazi SS.",
                "Flaming headlines. Sigh.",
                "Where's the article? WTF is with only putting the information in video format? At a minimum include a transcript",
                "[removed]",
                "EDIT - Never mind, watch the video. Still awful,but for different  reasons 🤦‍♀️",
                "Is the issue with ANY sort of detainment/deportation or a specific kind of border enforcement?\n\nI really struggle to have sympathy with folks who don't want to follow the rules for immigrating to the US. I'm sorry your country might suck, might have specific threats aimed at you, etc. But we can't just let everyone in for any reason with or without following protocol. \n\nThe specific complaints being raised in threads like this always blend the reasonable and ridiculous. If you are an \"all borders open at all times\" person, you're a fucking moron. If you have a specific gripe with who ICE is now chasing or how they're doing it, my ears are open to hearing more.",
                "She was walking through the desert this week and the gives birth soon after. She planned to sneak into the border and then give birth immediately.",
                "Nah. I'm out of empathy. No due process involved with coming into the country? No due process being ejected. "
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Berkshire Hathaway operating earnings drop more than expected as Buffett warns of tariff uncertainty",
            "external_url": "https://www.nbcnewyork.com/news/business/money-report/berkshire-hathaway-operating-earnings-drop-more-than-expected-as-buffett-warns-of-tariff-uncertainty/6249202/",
            "upvotes": 1669,
            "date": "05/03/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/05/108140441-1746280189515-Screenshot_2025-05-03_at_94538_AM-2.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Insurance profits down nearly 50%, wildfire losses over $1B, and Buffett still won’t spend from his record $347B cash pile. If that doesn’t scream uncertainty, nothing does.",
                "The fact that he has most of his net worth on the sidelines, tells you he is expecting a recession or most likely a depression.",
                "Jeff Bezos is selling a shit ton of stock.\n\nThe ultra wealthy see the writing on the wall.",
                "He also called tariffs an act of war",
                "Buffett is being awfully politically hostile here with those words. Better straighten up, Warren.",
                "He better be careful criticizing tarrifs, Trump will tweet lies and anti-American accusations at him, sicking his altright mob to boycott and harrass him in every way possible.\n\nBut the billionaire class asked for this, so I don't feel bad for the rich that own most of the stock market/these funds. \n\nThe entry barrier to Berkshire Hathaway is super high. There ain't no middle income earners investment portfolio holding Berkshire Hathaway.",
                "It's about time he spoke up!",
                "Good, they need to take down Berkshire and his monopoly",
                "A plutocrat won’t be making as much money.  Oh no! \n/s\n\nEdit:  Wow, the billionaire bootlickers must be out in force today."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Kentucky $167.3 million Powerball jackpot winner arrested days after claiming prize",
            "external_url": "https://www.nbcmiami.com/news/local/kentucky-man-arrested-in-florida-days-after-winning-167m-powerball-jackpot/3605610/",
            "upvotes": 5609,
            "date": "05/03/2025",
            "thumbnail": "https://media.nbcmiami.com/2025/05/050225-Kentucky-lottery-winner-James-Farthing.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Sure he can afford a lawyer, but kicking a deputy in the face will probably land him in jail for a bit. \n\nI would not want to be anywhere confined with criminals, with them knowing I had hit a 167.3 million jackpot.",
                "Kentucky man goes to Florida with some New Money... You know it’s gonna be a doozy.",
                "Bro had his life solved forever and decided throwing it down the toilet was the most reasonable thing to do…\n\nDammm",
                "TLDR: He got in a fight with someone at the hotel he was staying at, cops tried to break it up and he kicked a cop in the face and tried to run.",
                "Won the Powerball on Monday. Kicked a cop in the face by Wednesday. That’s one hell of a retirement plan.",
                "Give Kentucky man enough money and what does he become?  Florida/Kentucky man, like some kind of hot mess hybrid experiment.",
                "Guy wins the lottery and to celebrate he takes a trip to…….Tampa.",
                "When keeping it real goes wrong.",
                "Shocking. He looked like such a responsible guy.",
                "My guys wearing a bulls hat. Automatically means he’s in MS-13. Deport his ass"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Worker safety agency NIOSH lays off most remaining staff",
            "external_url": "https://www.cbsnews.com/news/worker-safety-agency-niosh-lays-off-most-remaining-staff/",
            "upvotes": 716,
            "date": "05/03/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2022/12/08/b885b605-fee8-4460-8e82-953d055fc677/thumbnail/1200x630/785fa9b659fe75c9b1f0fe90a651ac14/hypatia-h-4ffc665b28f6f1b8c6eab2cc6e053777-h-b8d48384c916d7e0fdacd908de250f1a.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "Can someone explain to me how Trump is able to legally not spend money Congress has apportioned? Does this mean a Democrat could come in and just fire all federal workers who only do work in red states?",
                "\"New requests for investigations of firefighter injuries and workplace health hazards had already stopped being accepted. A CDC plan to help Texas schools curb the spread of measles infections was also scrapped due to the layoffs. \n\nNIOSH employees receiving layoff notices late Friday included some workers for the World Trade Center Health Program, miner safety, and firefighter health programs\" \n\nThis shit gets worse every day.  Trash country full of trash people.",
                "Finally I can work without a helmet, safety glasses and harness. /s",
                "My blue collar dad used to talk about how unsafe his work was until the government started forcing the company to be safer. \n\nCan't help but wonder if companies are going to revert back.",
                "What’s wild is how much this agency does to help firefighters and protect their long term health.  most firefighters are big time Trump supporters.",
                "I remember working construction in 2005 or so. I would wear a mask and ear plugs doing that nasty indoor shit now. Live and learn. But we want to reverse progress again.",
                "Don’t forget. No respirators or PFT’s any more. Let’s fill our lungs with silica for profit!!!",
                "Here's one most of you will call a lie, but one of my coworkers (I'm retired now) had worked at a chemical plant that made vinyl chloride, and back in the 40's-50's they had to send men inside those tanks to clean them when necessary. \n\nThe way the company did it was to lower naked men into the tank and scrape material off the sides until their scrotums started to burn.\n\nThey would bring them out, send them to shower and lower more naked guys in.\n\nHe was told this by much older and longer tenured guys when he worked there in the early Eighties.",
                "What annoys me is how republicans in blue states probably won't hurt quite as much from stuff like this, so they'll keep benefitting from blue state protections and thinking Trump is doing a great job.",
                "Why does the right hate firefighters so much?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Cincinnati police fatally shot an armed 18-year-old. The next day, his father killed a sheriff’s deputy, authorities say | CNN",
            "external_url": "https://www.cnn.com/2025/05/03/us/ohio-rodney-hinton-jr-arrest-hnk",
            "upvotes": 1927,
            "date": "05/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21594534-32264-561-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "To be clear, the sheriff that was killed was not connected to the shooting of the 18 year old.  The father snapped and ran over a sheriff directing traffic.  He watched the body cam video of his son's death and lost it.\n\nSad day for everyone involved",
                "The Sheriff that was killed was doing traffic duty for university of Cincinnati graduation. Heard he was close to retirement.\n\nEdit: already retired and was just helping with traffic",
                "So a guy is killed by police while brandishing a firearm in the commission of a felony and his father responds by murdering a cop who had nothing to do with it, yeah that family sounds like a great value to society",
                "*\"police did recover a handgun with an extended magazine attached near the man who was shot. A second magazine was found in the man's sweatshirt pocket.\"*\n\nAfter they had stolen a car and were confronted by police mind you.\n\nA pretty justified shooting by police it seems.",
                "seems most just read the headline and move on.  Killed kid was with three other kids who stole a car got in a police chase then wrecked.  All got out and ran and one of the kids had a gun which the police saw and yelled gun.  \n\nVideo\n\n[https://www.wcpo.com/news/local-news/cincinnati/east-price-hill/cpd-cincinnati-police-involved-in-shooting-no-officers-injured](https://www.wcpo.com/news/local-news/cincinnati/east-price-hill/cpd-cincinnati-police-involved-in-shooting-no-officers-injured)\n\n  \nnon-issue if the kids would have never stolen the car.",
                "It's not a crime to be armed in Ohio. Gun rights activists should be outraged the cops shot this kid for expressing his rights.",
                "Almost like “1 bad apple ruins the whole barrel.” This is a great example of why it would benefit “good cops” to align themselves with police reform/abolition movements.  \n\nAs long as police face impunity when they murdered citizens, every police officer is in danger of rage-induced crimes of retribution. \n\nTo be clear, the officer murdered was not involved in the murder of the son. But he’s dead now, because he chose to align himself with a fascist police state. \n\nRIP to the victims.",
                "*Hinton Jr.’s son was armed and fleeing from a stolen vehicle when a responding officer fatally shot him, police said. Police body cam footage does not clearly show whether the fleeing man pointed a gun at the officer.  The family reviewed the footage between 10 a.m. and 11 a.m. Friday, and the father was “very distraught...\"*\n\nThe innocent police officer is still alive if this shooting doesn't happen. How does one flee and aim a gun at the same time, esp in split seconds.  And the driving crime happened right after the father saw the footage. But it's going to be very bad for him on one more front--because of his very disturbed state.",
                ">“I do have a plea to everybody. Let the processes play out. Let the investigations play out. Keep calm, take care of one another and I can assure you, as the chief of police for Cincinatti, I will ensure you transparency and a thorough and accurate investigation,” Theetge said.\n\nYeah, if there are two things police are really known for investigating themselves, and being transparent with the public. Not trying to justify the actions here at all but you cannot hear this in modern America and expect much.",
                "[removed]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Marjorie Taylor Greene’s ex-husband publicly apologizes for harassing Muslim women",
            "external_url": "https://www.kold.com/2025/04/07/marjorie-taylor-greenes-ex-husband-publicly-apologizes-harassing-muslim-women/",
            "upvotes": 3246,
            "date": "05/03/2025",
            "thumbnail": "https://gray-kold-prod.gtv-cdn.com/resizer/v2/PCRIEX4PYBEKNDBKZYY6AYWWZ4.png?auth=38f6cf3d626588b20df8a514d7c98cda0bf8eb9b4d337efe47e394ad3bf5f8fe&width=1200&height=600&smart=true",
            "top_comments": [
                "He apologizes for being caught harassing Muslim women. Let’s be real here",
                "Too late, bro. The racism and bigotry are very apparent. Nothing will change with this pig. He only apologized because he was caught on camera.",
                "How romantic. He is wooing her back.",
                "> Greene then got into his Tesla Cybertruck and continued his tirade\n\nOf fucking course he did.",
                "\"Worshipping a false god\". What a douche.",
                "Ex husband?   Maybe he was trying to get her back through some elaborate racist mating ritual.",
                "*”…Georgia Rep. Marjorie Taylor Greene, a far-right Republican known for her unwavering support of President Donald Trump”.*\n\nWell, that’s one thing she’s known for. \n\n*”Greene then got into his Tesla Cybertruck and continued his tirade…”*\n\nOf course he did.",
                "The only surprising thing is that they are divorced.",
                "Now we just got to get her to apologize for being awful.",
                "He even tried it out that classic racist trope \"Go back to your country\" even though they were all born and raised in the US. Ignorant asshole."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Warren Buffett announces retirement from leading Berkshire Hathaway",
            "external_url": "https://www.theguardian.com/business/2025/may/03/warren-buffett-retirement-berkshire-hathaway",
            "upvotes": 559,
            "date": "05/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d218a78e339c9698ddcbc45fd9e63371a830d6c/0_167_4352_2611/master/4352.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=15b65b9f6325868b57d16e2ab187bcf7",
            "top_comments": [
                "“I’m getting too old for this shit”",
                "It's crazy to think this should probably be a big news story but the world is such to where something even crazier will probably happen no later than Tuesday.",
                "Fella is turning 95 soon.\n\n>Buffett, a Democrat, has previously said that he [plans to donate](https://www.reuters.com/business/finance/buffett-refines-plans-his-fortune-donates-more-berkshire-shares-2024-11-25/#:~:text=Nov%2025%20(Reuters)%20%2D%20Warren,his%20fortune%20after%20his%20death.) 99.5% of his remaining wealth to a charitable trust overseen by his daughter and two sons when he dies. According to Forbes, Buffett has a net worth of $165.3bn.\n\nAnd to think the level of evil this guy could have unleashed with his understanding of the markets - considering he charitably *spent down* to just 165bn.",
                "I wonder if he’ll follow through with his pledge to the Susan Thompson Buffett Foundation.",
                "He knows it’s about to get real. Even he won’t be able to weather the storm that’s coming and so he’s going out on top with his “wizard” rep in tact.",
                "Fuck him and all his billionaire buddies.",
                "He should buy my half-scale TRON on ebay for funsies lmfao",
                "I'm really worried, how is he gonna keep making money without a job? ",
                "Just because he is a Democrat does not make him one of the “good ones”\n\nHe is just as bad as Musk. "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Warren Buffett knocks tariffs and protectionism: 'Trade should not be a weapon'",
            "external_url": "https://www.cnbc.com/2025/05/03/warren-buffett-knocks-tariffs-and-protectionism-trade-should-not-be-a-weapon.html",
            "upvotes": 6860,
            "date": "05/03/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108140448-1746280836757-Screenshot_2025-05-03_at_95634_AM.jpg?v=1746280907&w=1920&h=1080",
            "top_comments": [
                "Trump's not doing this because he actually thinks it can help the US, he's doing to tank the US on purpose and make money on the volatile market which he himself controls the ebbs and flow of with the tariff announcements and delays.",
                "Instead of incentivizing companies to build in America we are punishing them if they don't",
                "Trade has always been a weapon. It's supposed to be used to ensure peace and prosperity. Not naked avarice and greed.",
                "But this is what happens when you put someone from the dumb class in your school into the White House.",
                "Neither should healthcare, home insurance, immigration status, etc. but here we are - victims of our own govt.",
                "BRK.B up 19.04% YTD  \n[https://finance.yahoo.com/quote/BRK-B/](https://finance.yahoo.com/quote/BRK-B/)\n\nHe ain't no fool.",
                "That's *rich* coming from him",
                "he is for free trade and paying his fair share of taxes. one of the few good billionaires.",
                "He is not on the prole side.",
                "Maybe the US should listen to an actual business man for a change."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Guatemalan woman detained by Border Patrol after giving birth at Tucson hospital",
            "external_url": "https://www.kold.com/video/2025/05/03/guatemalan-woman-detained-by-border-patrol-after-giving-birth-tucson-hospital/",
            "upvotes": 2415,
            "date": "05/03/2025",
            "thumbnail": "https://gray-kold-prod.gtv-cdn.com/resizer/v2/https%3A%2F%2Fdo0bihdskp9dy.cloudfront.net%2F05-03-2025%2Ft_fce97cfd4e0c4635bc92fb4422dd9436_name_file_1280x720_2000_v3_1_.jpg?auth=3ae43ee12ac0983a7dc7c57c909ced8d5378d6f03fa3c3aaea4d1b8dad16a21a&width=1200&height=600&smart=true",
            "top_comments": [
                "Jesus Christ The Onion called it again. \n\n\n\n[https://theonion.com/ice-agents-wait-at-edge-of-delivery-table-to-deport-newborn/](https://theonion.com/ice-agents-wait-at-edge-of-delivery-table-to-deport-newborn/)",
                "Better article\n\nhttps://tucson.com/news/local/border/article_7de9b512-e6e1-44bc-a61d-187a2accd22e.html\n\nShe will probably be deported but hopefully will have an actual hearing. \n\nSo sad. She must have been desperate to attempt this whole 8 months pregnant.",
                "History will see ICE and border agents viewed similarly to nazi SS.",
                "Flaming headlines. Sigh.",
                "Where's the article? WTF is with only putting the information in video format? At a minimum include a transcript",
                "[removed]",
                "EDIT - Never mind, watch the video. Still awful,but for different  reasons 🤦‍♀️",
                "Is the issue with ANY sort of detainment/deportation or a specific kind of border enforcement?\n\nI really struggle to have sympathy with folks who don't want to follow the rules for immigrating to the US. I'm sorry your country might suck, might have specific threats aimed at you, etc. But we can't just let everyone in for any reason with or without following protocol. \n\nThe specific complaints being raised in threads like this always blend the reasonable and ridiculous. If you are an \"all borders open at all times\" person, you're a fucking moron. If you have a specific gripe with who ICE is now chasing or how they're doing it, my ears are open to hearing more.",
                "She was walking through the desert this week and the gives birth soon after. She planned to sneak into the border and then give birth immediately.",
                "Nah. I'm out of empathy. No due process involved with coming into the country? No due process being ejected. "
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Berkshire Hathaway operating earnings drop more than expected as Buffett warns of tariff uncertainty",
            "external_url": "https://www.nbcnewyork.com/news/business/money-report/berkshire-hathaway-operating-earnings-drop-more-than-expected-as-buffett-warns-of-tariff-uncertainty/6249202/",
            "upvotes": 1669,
            "date": "05/03/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/05/108140441-1746280189515-Screenshot_2025-05-03_at_94538_AM-2.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Insurance profits down nearly 50%, wildfire losses over $1B, and Buffett still won’t spend from his record $347B cash pile. If that doesn’t scream uncertainty, nothing does.",
                "The fact that he has most of his net worth on the sidelines, tells you he is expecting a recession or most likely a depression.",
                "Jeff Bezos is selling a shit ton of stock.\n\nThe ultra wealthy see the writing on the wall.",
                "He also called tariffs an act of war",
                "Buffett is being awfully politically hostile here with those words. Better straighten up, Warren.",
                "He better be careful criticizing tarrifs, Trump will tweet lies and anti-American accusations at him, sicking his altright mob to boycott and harrass him in every way possible.\n\nBut the billionaire class asked for this, so I don't feel bad for the rich that own most of the stock market/these funds. \n\nThe entry barrier to Berkshire Hathaway is super high. There ain't no middle income earners investment portfolio holding Berkshire Hathaway.",
                "It's about time he spoke up!",
                "Good, they need to take down Berkshire and his monopoly",
                "A plutocrat won’t be making as much money.  Oh no! \n/s\n\nEdit:  Wow, the billionaire bootlickers must be out in force today."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Kentucky $167.3 million Powerball jackpot winner arrested days after claiming prize",
            "external_url": "https://www.nbcmiami.com/news/local/kentucky-man-arrested-in-florida-days-after-winning-167m-powerball-jackpot/3605610/",
            "upvotes": 5606,
            "date": "05/03/2025",
            "thumbnail": "https://media.nbcmiami.com/2025/05/050225-Kentucky-lottery-winner-James-Farthing.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Sure he can afford a lawyer, but kicking a deputy in the face will probably land him in jail for a bit. \n\nI would not want to be anywhere confined with criminals, with them knowing I had hit a 167.3 million jackpot.",
                "Kentucky man goes to Florida with some New Money... You know it’s gonna be a doozy.",
                "Bro had his life solved forever and decided throwing it down the toilet was the most reasonable thing to do…\n\nDammm",
                "TLDR: He got in a fight with someone at the hotel he was staying at, cops tried to break it up and he kicked a cop in the face and tried to run.",
                "Won the Powerball on Monday. Kicked a cop in the face by Wednesday. That’s one hell of a retirement plan.",
                "Give Kentucky man enough money and what does he become?  Florida/Kentucky man, like some kind of hot mess hybrid experiment.",
                "Guy wins the lottery and to celebrate he takes a trip to…….Tampa.",
                "When keeping it real goes wrong.",
                "Shocking. He looked like such a responsible guy.",
                "My guys wearing a bulls hat. Automatically means he’s in MS-13. Deport his ass"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Weekly measles cases hit new record amid worst outbreak since 1990s",
            "external_url": "https://www.cbsnews.com/news/weekly-measles-cases-hit-new-record-amid-worst-outbreak-since-1990s/",
            "upvotes": 1108,
            "date": "05/03/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/10/9cd3b00e-2d7a-4b8c-951b-4ef66e6dfc31/thumbnail/1200x630/afe989398a5be129028acb84db47ac36/measles-0409.png?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "“Modern Americans behave as if intelligence were some sort of hideous deformity.” - Frank Zappa",
                "I will never understand why people deliberately endanger their children with a preventable disease",
                "Great job, Republicans 👏",
                "Learning about immune amnesia from the measles is sobering. \n\nEssentially, wiping up to 73% of antibodies knowledge from ALL previous immune knowledge events (vaccinations, previous infections, babies putting everything in their mouths to kids recovering from illness, etc). Taking on average 2-3 YEARS for the previous level of immune protection knowledge to be restored.  Please consider inviting a conference of knowledge to your immune system. Our bodies need this information ahead of time.\n\n\nhttps://hms.harvard.edu/news/inside-immune-amnesia\n\nhttps://asm.org/articles/2019/may/measles-and-immune-amnesia",
                "It’s sad to see the USA which used to be the leading nation in quite a lot of areas fall down without grace.",
                "Next EO, measles will now be called Freedom Freckles.",
                "The US is going to lose its eradication certification, and the rest of the world will be alerted and issue travel warnings, which in turn will further hurt the tourism industry. Americans will also be subject to heightened scrutiny when traveling. \n\nThese are not opinions. This is how science works.",
                "Not in Europe, strangely enough. What are they doing differently over there? /s",
                "absolutely no correlation whatsoever. https://www.scientificamerican.com/article/under-trump-national-science-foundation-cuts-off-all-funding-to-scientists/",
                "I wonder if the folks in these communities who survive infection and think there out of the woods realize they've got 2-3 years of immunity amnesia to contend with, or as our Secretary of Health and Human Service might call it, \"miasma\"."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Worker safety agency NIOSH lays off most remaining staff",
            "external_url": "https://www.cbsnews.com/news/worker-safety-agency-niosh-lays-off-most-remaining-staff/",
            "upvotes": 719,
            "date": "05/03/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2022/12/08/b885b605-fee8-4460-8e82-953d055fc677/thumbnail/1200x630/785fa9b659fe75c9b1f0fe90a651ac14/hypatia-h-4ffc665b28f6f1b8c6eab2cc6e053777-h-b8d48384c916d7e0fdacd908de250f1a.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "Can someone explain to me how Trump is able to legally not spend money Congress has apportioned? Does this mean a Democrat could come in and just fire all federal workers who only do work in red states?",
                "\"New requests for investigations of firefighter injuries and workplace health hazards had already stopped being accepted. A CDC plan to help Texas schools curb the spread of measles infections was also scrapped due to the layoffs. \n\nNIOSH employees receiving layoff notices late Friday included some workers for the World Trade Center Health Program, miner safety, and firefighter health programs\" \n\nThis shit gets worse every day.  Trash country full of trash people.",
                "Finally I can work without a helmet, safety glasses and harness. /s",
                "My blue collar dad used to talk about how unsafe his work was until the government started forcing the company to be safer. \n\nCan't help but wonder if companies are going to revert back.",
                "What’s wild is how much this agency does to help firefighters and protect their long term health.  most firefighters are big time Trump supporters.",
                "I remember working construction in 2005 or so. I would wear a mask and ear plugs doing that nasty indoor shit now. Live and learn. But we want to reverse progress again.",
                "Don’t forget. No respirators or PFT’s any more. Let’s fill our lungs with silica for profit!!!",
                "Here's one most of you will call a lie, but one of my coworkers (I'm retired now) had worked at a chemical plant that made vinyl chloride, and back in the 40's-50's they had to send men inside those tanks to clean them when necessary. \n\nThe way the company did it was to lower naked men into the tank and scrape material off the sides until their scrotums started to burn.\n\nThey would bring them out, send them to shower and lower more naked guys in.\n\nHe was told this by much older and longer tenured guys when he worked there in the early Eighties.",
                "What annoys me is how republicans in blue states probably won't hurt quite as much from stuff like this, so they'll keep benefitting from blue state protections and thinking Trump is doing a great job.",
                "Why does the right hate firefighters so much?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Former Illinois Gov. George Ryan dies at 91. He halted executions and went to prison for corruption",
            "external_url": "https://apnews.com/article/illinois-governor-george-ryan-hospice-executions-46a5ec5191e8820dd6905d57c8e3cd8a",
            "upvotes": 911,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "TLDR; Former Illinois Governor George Ryan passed away on May 2, 2025, at the age of 91 in Kankakee, Illinois, while under hospice care. A Republican known for his pragmatism, Ryan served as governor from 1999 to 2003. He gained international recognition for halting executions and commuting all death row sentences in Illinois, citing systemic injustices in the capital punishment system. However, his career was marred by a corruption scandal dating back to his tenure as secretary of state, leading to a 2006 conviction for racketeering, bribery, extortion, money laundering, and tax fraud. He served over five years in federal prison and was released in 2013.",
                "Didn't have to mention that an Illinois governor went to prison for corruption.  It's just implied.",
                "A relative met him and he was quite kind, goofy, and grandfatherly - at a time when we had just lost ours. It's a shame he marred his name with corruption. IL's 'wiretap' laws (all party consent everywhere audio recording) basically exist to protect this kind of crap, so it's no wonder IL's history of corruption is long and deep.",
                "If you are a top politician in Illinois and not engaging in corruption are you really even trying?",
                "I’m glad Illinois has held their governors accountable, but so many of them have been criminals that it’s kinda funny at this point.",
                "At the time, I cynically though that clearing death row was a bid for some kind of legacy to distract from licenses for bribes. The ordering of his obituary suggests it worked.",
                "He was absolutely correct about the death penalty.",
                "What is it with Illinois and politicians going to jail?",
                "You just have to say Illinois Governor. Went to prison for corruption is assumed.",
                "A good example of the dialectic of the human being.  somebody can both do a lot of good things, and also do bad things. I would argue this is most human beings."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "05/03/2025 20:08:49 UTC"
}