{
    "posts": [
        {
            "category": "HOT",
            "title": "'Time for you to abandon the United States': Asylum seekers who used app being told to leave",
            "external_url": "https://www.cbc.ca/news/world/us-migration-app-removals-1.7504556",
            "upvotes": 14284,
            "date": "04/08/2025",
            "thumbnail": "https://i.cbc.ca/1.7504565.1744118021!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/trump-immigration.jpg?im=Resize%3D620",
            "top_comments": [
                "I was told by someone that I was making a “big deal” over the Mass Deportations Now signs at his rallies.",
                ">Time for you to abandon the United States\n\nGood advice for everyone, honestly.",
                "Note that everyone using this app was in the country *legally* - the language used by the administration repeatedly attempts to imply otherwise, but the entire point was to create a legal path for asylum seekers.",
                "Calling it now, the rhetoric is gonna switch from “If you’re a citizen who’s **here lawfully** you have nothing to fear” to “if you’re a **lawful citizen** you have nothing to fear” so they could deport anyone who engages in ‘terrorist activities’ like protesting against Israel. The change’ll happen so fast it’ll make your head spin.",
                "The asylum seeker issue is proof that Republicans do not actually support legal immigration. They think that being an \"illegal immigrant\" is an innate quality, closely tied to your ethnicity and the color of your skin, not simply the lack of immigration paperwork.\n\nSeeking asylum in the US is legal. You may disagree with the law, but these people were following the law. They are not illegal immigrants. They are legal immigrants following a process that you don't like. The same was true of the Haitian immigrants that JD Vance made up those disgusting lies about. It has always been racism and xenophobia.",
                "... US abandons refugees. Abdicates global leadership. Shoots self in face with tariff cannon. Genius. ",
                "This is exactly what causes more \"illegal immigration\" - the US creates a pathway, people use that pathway, then someone uses that collected data to punish the folks who were trying to do right. \n\nNext time the US comes and says, \"here's how to do it legally,\" why would anyone listen?",
                "\"Time for you to abandon the United States\" -- Now, there's a piece of advice I can get behind. I'd only apply it to literally everyone in the world rather than only people with a skin color that isn't white.",
                "900,000 is an astounding number of people being asked to leave the country.",
                "1883: \"Give me your tired, your poor,\nYour huddled masses yearning to breathe free.\"\n\n2025: Screw you."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Microsoft 'not moving forward' with $1B Licking County data center plans right now",
            "external_url": "https://abc6onyourside.com/news/local/microsoft-backs-off-1b-licking-county-data-center-plans",
            "upvotes": 2627,
            "date": "04/09/2025",
            "thumbnail": "https://abc6onyourside.com/resources/media2/16x9/1024/986/0x68/90/9d937b81-ae3b-42c7-bc66-acfc0aacf3a7-AP25028129857071.jpg",
            "top_comments": [
                "All the Trump supporters in Ohio trying to find a reason why this is good now.",
                "More jobs lost.  More investment drying up.\n\nThanks Donald.  I see your tariffs are really, really working.\n\nBut then again Ohio, you voted for this, huh.",
                "Smart....\n\n\"We are taking the appropriate steps to ensure the land at two of our   \nsites can be used for farming and are following through with our   \ndevelopment agreements to fund roadway and utility upgrades. We will   \ncontinue to invest in and collaborate with local organizations to   \nsupport digital skills development, restoration efforts, and to   \nstrengthen the communities in Licking County for future generations.”\n\nThis is great selling point if they decide to move forward somewhere else in the future.",
                "This is all so predictable.\n\nEven if the aim of these tariffs was to bring back more factories to the US, the way this is being done could never achieve that.\n\nNobody in their right mind is going to spend billions in capex right now to bring their supply chain back on shore only to have Trump himself or the next administration change its mind. It takes years to rework supply chains and build infrastructure and you need the government helping with the investment in the form of subsidies, tax breaks, training initiatives, R&D and on and on with an actual plan over 5-10 years.\n\nThis is just one moron engaging in a pissing contest with the entire world because he thinks he is a genius.",
                "Smart move. Conserve cash. Wait for the craziness to pass",
                "Trump Tax (tariffs) causing the Trump Recession.",
                "Microsoft has been pushing AI at the marketing level but they're actually aware of the lack of uptake, massive cost, and low return beyond its utility as a marketing term. I think it was Microsoft who put out the paper about Gen ai making employees dumber.",
                "The global economy will come to a complete stop. Corporations are going to sit on cash while they wait for the tariffs to end.\n\nWhy buy something at 200% of the price if it's temporary?",
                "First intel pulls out and now Microsoft. My city is getting screwed over",
                "MAGAs: Well you see this is a GOOD thing because uh....Bill Gates is...Vaccinated...And thats...Uh...yeah, MERICA!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "AP wins reinstatement to White House events after judge rules government can’t bar its journalists",
            "external_url": "https://apnews.com/article/trump-ap-media-court-white-house-events-access-f346a0efe87c1dec4d6f90e6041abd09",
            "upvotes": 4492,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> \"Under the First Amendment, if the Government opens its doors to some journalists—be it to the Oval Office, the East Room, or elsewhere—it cannot then shut those doors to other journalists because of their viewpoints,” McFadden wrote. “The Constitution requires no less.”\n\nThe question is will this administration respect the ruling. They don't seem to have any respect for checks and balances, even though they're a cornerstone of our Constitution.",
                "Freedom of the Press !\n\nI wonder how may question Ms Leave-it will take from the AP...",
                "> U.S. District Judge Trevor N. McFadden, an appointee of President Donald Trump, ruled that the government can’t retaliate against the AP’s decision not to follow the president’s executive order to rename the Gulf of Mexico. The decision handed the AP a major victory at a time the White House has been challenging the press on several levels. \n\nGood.  This was an absurd move by the Trump administration.",
                "Good. Now to the press corps and media - stop being afraid and start challenging this dimwits. Don't just ask questions assuming they have grade 2 intelligence (they don't) and they not ask what the hell they are talking about? Question them, challenge them. Call out the lies, the disrespect, the abuse, the ignorance - be the public that is demanding these clowns be called out for their stupid antics.",
                "I want them to ask follow up questions. Questions like, “Do you have actual proof of that?”  and “What specifically does that mean?”\n\nI’d take it from the AP or any others that follow Bill Burr’s advice.",
                "So basically they’ll appeal it, lose the appeal, and then will send it to SCOTUS, who will come up with some batshit crazy reason to continue to bar the AP. \n\nThere, saved us all some time.",
                "Seems like an impeachable offense, we don’t have kings",
                "Tomorrow's Headline: SCOTUS Overturns Lower Court's Order to Restore AP Access to White House Events.",
                "There's not a snowman's chance in hell that this will be followed.",
                "Everyone should go read about the judge who made this ruling. He’s made some extremely questionable decisions that almost exclusively favored the Trump administration and his supporters. Even he is shutting down one of many of the  Trump administrations’ ridiculously unconstitutional attacks on the press."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Mississippi libraries ordered to delete academic research in response to state laws",
            "external_url": "https://mississippitoday.org/2025/04/08/mississippi-libraries-ordered-to-delete-academic-research-in-response-to-state-laws/",
            "upvotes": 963,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Doing everything they possibly can to suppress us, don't let them win",
                "No wonder why Mississippi is rated as 50th out of all 50 US states on educational metrics. Brain-dead right-wing nut jobs keeping themselves purposely ignorant. Talk about self-sabotage.",
                "just push it to a sever in another jurisdiction",
                "In case anyone is confused, they’re just removing access to academic research. Thankfully, Mississippi isn’t “deleting” their great wealth of knowledge. *cough*",
                "Delete controversial materials, control the narrative and/or create your own alternate information, IS right out of the dictator's play book..\n\n\n\nOnce again America is becoming the very thing we fought against, went to wars over and died for to prevent. Those deaths are meaning less and less every day.\n\n\nedit word\n\n.",
                "This is literally one of the first steps Nazi Germany took. I am not exaggerating.",
                "This is why Mississippi had typos and spelling errors in their state tax overhaul bill",
                "Mississippi is an easy target. They start with an audience that won't fuss too much and slowly move West and North. Deleting academic research in response to state laws will lead to suppression of knowledge, scientific progress, and undermining the principles of academic freedom and open inquiry. This is the start. What they want is no interference.  Libraries, post offices, and Legion halls are the common places for voting and organizing in small towns and rural communities. Especially in retirement counties where transportation and mobility are challenged. That's why eliminating mail-in ballots is so dangerous. It silences a whole lotta people. We must not be complacent. We can't just say, \"Oh, look what they did in...!\" The outcome will result in further untold and unfathomable disasters.",
                "As the great Phil Ochs once sang:\n\n\"Here's to the land\nYou've torn out the heart of,\nMississippi find yourself \nanother country to be part of\"",
                "This sounds like a bunch of nazi crap. They can’t even cite the laws they are using to ‘discern’ which books to burn.. I mean research to delete. I’m not saying they ARE Nazis, But I do think the Nazis would be proud of them right about now."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "Keystone Pipeline ruptures in North Dakota",
            "external_url": "https://apnews.com/article/keystone-oil-pipeline-north-dakota-spill-36e86142566763a5464e1dd132eede56",
            "upvotes": 5124,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sounds like the worker who shut it down quickly should get a raise, could have been way worse.",
                "*“I don’t think it’s going to be that huge,” Suess said.*\n\nThat line is too tired to be true.",
                "I wonder who could have seen this coming.  Like.....who could've known?  Why weren't there protests over this risk?",
                "Oh wait, wait. They promised us it would NEVR leak. What's up with that.",
                "Is this the pipeline that for four years, MAGA folks claimed  Biden shut down, causing a rise in gas prices?  Of course it was actually a future expansion project that he stopped, but they never let facts get in the way. Drill baby drill!",
                "FEMA is on their way with their best people right? ",
                "Thankfully, the EPA's 2 remaining staff will be onsite in a few months.",
                "> In December 2022, nearly 13,000 barrels of oil spilled from Keystone’s line in Kansas into a creek traversing a pasture. An engineering consulting firm said the bend in the pipeline at the site had been “overstressed” since being installed in 2010, likely because of construction activity altering the land around the pipe.\n\nRepublican response: Let's roll back regulations even further so that this can happen more often, yay!",
                "Whoa, remind me again why the expansion of the XL pipeline was shut down? Oh this exact reason?",
                "They will be charged less than the people who tried to warn about this."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Brussels police arrest US State Secretary Rubio's bodyguard",
            "external_url": "https://www.brusselstimes.com/brussels/1526014/brussels-police-arrest-us-state-secretary-rubios-bodyguard-tbtb",
            "upvotes": 27852,
            "date": "04/08/2025",
            "thumbnail": "https://api.brusselstimes.com/wp-content/uploads/2025/04/ad995448-belgaimage-116320348-1024x683.jpg",
            "top_comments": [
                ">Two sources with direct knowledge of the situation told the Washington Examiner that the agent in question was \"behaving erratically\" and \"became irate\" when hotel staff refused to reopen the bar beyond its normal hours, the US media reports.\n\nAnd here I thought it was going to be about some professional disagreement that got out of hand.",
                "These guys are so used to getting away with breaking the law in the USA.\n\nThey take that mindset and ego to other places in the world and get arrested. \n\nGlad there is still integrity elsewhere.",
                "Needed some liquor at 3:00 a.m. just to live with himself.",
                "The party of “law and order” strikes again.",
                "“I have diplomatic immunity!”\n\n>It’s just been revoked.",
                "Since he's not a resident they should ship him to El Salvador",
                "These cavemen have a lot of trouble hearing the word NO.",
                "Violence. Rape. Alcohol. Child Porn. Tinder. Greed. Threats. Abuse. \n\nThe party of Christianity needs to stop “protecting the world from the evil libs” and start looking at what they are supporting.",
                "Was this a \"merit\" hire? Because this shit show of administration keeps showing they aren't hiring the best people in the slightest.",
                "Wait I thought Pete Hegseth ran the Pentagon not a security detail???"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "US Justice Dept disbands crypto enforcement team, citing Trump order",
            "external_url": "https://www.reuters.com/world/us/us-justice-dept-disbands-cryptocurrency-enforcement-unit-2025-04-08/",
            "upvotes": 13862,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Can't have people looking into crypto scams when the President and his family are the ones running the crypto scams.",
                "I'm guessing the SBF pardon will be coming on Friday at around 7 PM.",
                "What is the point of congress anymore? Trump seems to have the power to do everything himself.",
                "It's things like this that will cause the Great Depression to repeat.\n\nThe SEC was created to regulate stock to ensure people didn't do stupid things to buy overpriced stock.\n\nInstead, we're going to have people spending their life savings on meme coins, only to have it get magically wiped out.\n\nCombine that with tariffs and the inevitable ecological disasters that won't be properly responded to... and you have the Great Depression.",
                "He certainly likes dismantling consumer protection agencies.",
                "\"US Justice Department disbands fraud enforcement team, citing Trump order\".",
                "Trump can't have his grifting being investigated.",
                "New trump shitcoin launching in 3… 2…",
                "How long before Trump EOs the entire Treasury into crypto?",
                "You're safe to assume all crypto is a scam. \n\nIt's funny to me that the same people who want to bring back sweatshop manufacturing also push crypto."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Man pleads guilty to trying to kill Brett Kavanaugh at judge’s home",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/08/brett-kavanaugh-man-pleads-guilty",
            "upvotes": 1818,
            "date": "04/09/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/344a253cdd4d7ebd9a98e0f929ed33a140d341af/0_156_5478_3289/master/5478.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=974f323ee4b9322919958879287d30f7",
            "top_comments": [
                "*He later told investigators that he was thinking about how to give his life “a purpose” when he decided to kill Kavanaugh.*\n\nThe events leading up to his attempt seem like those of a lower budget crime movie, except that his thoughts or intentions would never make it onto the screen... just his direct actions... he flies across the country, lands at Dulles, gets a cab, and tells the driver to go to Kavanaugh's home, calls his sister from the back seat to say he loves her, and then thinks about a suicidal death....",
                "I remember this. He got all the way to Kavanaugh‘s house and then called his sister to confess. She called the cops. Why go to all that trouble just to confess at the last moment?",
                "\"Trying\"\n\nI mean, he didn't try. He planned but then changed his mind and turned himself in when he got close. But he never tried, at least not how I think other native English speakers use that word to mean.",
                "This happened in 2022",
                "The Supreme Court just said they were willing to consider the idea that due process is optional. I know this happened years ago, but my opinion about it is different in light of the fact that Supreme Court didn't IMMEDIATELY decide 9-0 that gulags are bad.",
                "[removed]",
                "He was just a tourist",
                "I’m not here to judge",
                "This is why we need universal healthcare, and universal mental healthcare.\n\nConservatives will scream and cry and point out how violent the left is....but won't do anything to solve any problem unless the solution hurts someone else....",
                "Getting tired of these idiots."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Ontario's measles outbreak is so big, even New York health officials are taking notice",
            "external_url": "https://www.cbc.ca/news/canada/toronto/new-york-state-department-of-health-measles-travel-advisory-ontario-1.7504085",
            "upvotes": 4664,
            "date": "04/08/2025",
            "thumbnail": "https://i.cbc.ca/1.5343106.1708113693!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/measles-virus.jpg?im=Resize%3D620",
            "top_comments": [
                "This outbreak in southwestern Ontario, like the Texas outbreak, is concentrated in a very conservative group of Mennonites. It's been ongoing since October.",
                "Im going to guess that most of them are unvaccinated",
                "\"Measles can be a serious disease,' N.Y. official says\"\n\n\nWe carry computers in our pockets. Information has never been easier to access and verify.\n\n\nDumb mother fuckers always seem to find a way.",
                "Disease doesn't care about borders",
                "Clearly vaccines need to be actually required.  Weird religious sects shouldn’t be able to opt out of them.",
                "Hey!!! We here in the US have the market cornered on stupid, Canada!! Don’t try and steal our thunder!!",
                "I cannot find any sympathy here. Darwin is what is supposed to happen. Community has benefits, but also responsibility. this is irresponsible in this day and age, and all they do is hurt others who don't have a choice. they should be banned from any community, give them leper island. Mennonites DO participate in the world around them, and maybe they need to be expelled like other biological weapons. this goes for the rest too, \"Christian scientists,\" Amish, that dumbfuck sahm insisting Facebook is research, Cheetos and their ilk; banish them from society.",
                "We are all inter-connected.  \n\nAbolishing vaccines aid to other poor countries would affect Americans as well.",
                "I think it goes to show you how many people are actually on unvaccinated",
                "You’re supposed to be better than us, Canada."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "HOT",
            "title": "Chinese soldiers captured fighting alongside Russians in Ukraine, says Zelenskyy",
            "external_url": "https://www.abc.net.au/news/2025-04-08/zelenskyy-claims-army-has-captured-chinese-soldiers-in-ukraine/105153948?utm_source=abc_news_app&utm_medium=content_shared&utm_campaign=abc_news_app&utm_content=other",
            "upvotes": 24417,
            "date": "04/08/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/34cd7307c49584a150f2bad7aae83273?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=200&width=862&height=485&imformat=generic",
            "top_comments": [
                "There have been Chinese mercenaries in Ukraine since the start of the war, that’s nothing new. I even saw a PLA veteran filming and doing some sort of video blog on his Chinese social media account.",
                "so it's like, soldiers born in china, not *chinese soldiers*. that's important.",
                "It’s Chinese mercs enlisting to the Russian army. Not actual Chinese soldiers",
                "Big difference between capturing Chinese citizens and capturing Chinese soldiers.\n\nAs stated (several paragraphs deep) in the article, citizens from all over the world have gallavanted off to Ukraine to fight.\n\nShame on ABC for that headline.",
                "It's nothing new,several russian PMCs and military units have been hiring chinese mercenaries since the beginning of the war,some have even fought in the [Pyatnashka Brigade](https://en.wikipedia.org/wiki/Pyatnashka_Brigade)",
                "I mean there have been fighters from many nations on both sides for a while now",
                "It is illegal to desert your post in the army in all countries pretty much. Chinese citizens not soldiers obviously.",
                "Regardless of the nature of the situation, this announcement is clearly a ploy to appeal to the US, given they’ve announced that China is the only foe they care about.",
                "Article feels a bit racist, saying how it’s embarrassing for China if these mercenaries. How about all the mercenaries of other nationalities??",
                "Brits and americans are fighting at Ukrainian side.."
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "NEW",
            "title": "Mississippi libraries ordered to delete academic research in response to state laws",
            "external_url": "https://mississippitoday.org/2025/04/08/mississippi-libraries-ordered-to-delete-academic-research-in-response-to-state-laws/",
            "upvotes": 962,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Doing everything they possibly can to suppress us, don't let them win",
                "No wonder why Mississippi is rated as 50th out of all 50 US states on educational metrics. Brain-dead right-wing nut jobs keeping themselves purposely ignorant. Talk about self-sabotage.",
                "just push it to a sever in another jurisdiction",
                "In case anyone is confused, they’re just removing access to academic research. Thankfully, Mississippi isn’t “deleting” their great wealth of knowledge. *cough*",
                "Delete controversial materials, control the narrative and/or create your own alternate information, IS right out of the dictator's play book..\n\n\n\nOnce again America is becoming the very thing we fought against, went to wars over and died for to prevent. Those deaths are meaning less and less every day.\n\n\nedit word\n\n.",
                "This is literally one of the first steps Nazi Germany took. I am not exaggerating.",
                "This is why Mississippi had typos and spelling errors in their state tax overhaul bill",
                "Mississippi is an easy target. They start with an audience that won't fuss too much and slowly move West and North. Deleting academic research in response to state laws will lead to suppression of knowledge, scientific progress, and undermining the principles of academic freedom and open inquiry. This is the start. What they want is no interference.  Libraries, post offices, and Legion halls are the common places for voting and organizing in small towns and rural communities. Especially in retirement counties where transportation and mobility are challenged. That's why eliminating mail-in ballots is so dangerous. It silences a whole lotta people. We must not be complacent. We can't just say, \"Oh, look what they did in...!\" The outcome will result in further untold and unfathomable disasters.",
                "As the great Phil Ochs once sang:\n\n\"Here's to the land\nYou've torn out the heart of,\nMississippi find yourself \nanother country to be part of\"",
                "This sounds like a bunch of nazi crap. They can’t even cite the laws they are using to ‘discern’ which books to burn.. I mean research to delete. I’m not saying they ARE Nazis, But I do think the Nazis would be proud of them right about now."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "3 dead, at least 3 injured after Spotsylvania County shooting, search for suspect active",
            "external_url": "https://wjla.com/news/local/fredericksburg-heavy-police-spotsylvania-county-presence-incident-report-deputies-old-greenwich-crime-injuries-incident-shot-sheriffs-office-crime",
            "upvotes": 110,
            "date": "04/09/2025",
            "thumbnail": "https://wjla.com/resources/media2/16x9/4032/986/0x378/90/21937b9f-45c8-41c2-9162-febb39ffefd7-IMG_1492.jpg",
            "top_comments": [
                "All these shootings and we never do anything to stop easy access to firearms",
                "Considering where the crime occurred and how it was carried out, this feels like an ex or a family member situation. Though, the fact there were two shooters makes it more likely to be a targeted hit. The footage of the shooters shows what appear to be thin males. The fact they walked through a community with their long rifles out feels like something a bunch of teenagers would do because they think that's how cool assassins would do it.",
                "It's a feature, not a bug. Those poor people.",
                "Need more guns. Thats the solution to all life’s problems."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Microsoft 'not moving forward' with $1B Licking County data center plans right now",
            "external_url": "https://abc6onyourside.com/news/local/microsoft-backs-off-1b-licking-county-data-center-plans",
            "upvotes": 2626,
            "date": "04/09/2025",
            "thumbnail": "https://abc6onyourside.com/resources/media2/16x9/1024/986/0x68/90/9d937b81-ae3b-42c7-bc66-acfc0aacf3a7-AP25028129857071.jpg",
            "top_comments": [
                "All the Trump supporters in Ohio trying to find a reason why this is good now.",
                "More jobs lost.  More investment drying up.\n\nThanks Donald.  I see your tariffs are really, really working.\n\nBut then again Ohio, you voted for this, huh.",
                "Smart....\n\n\"We are taking the appropriate steps to ensure the land at two of our   \nsites can be used for farming and are following through with our   \ndevelopment agreements to fund roadway and utility upgrades. We will   \ncontinue to invest in and collaborate with local organizations to   \nsupport digital skills development, restoration efforts, and to   \nstrengthen the communities in Licking County for future generations.”\n\nThis is great selling point if they decide to move forward somewhere else in the future.",
                "This is all so predictable.\n\nEven if the aim of these tariffs was to bring back more factories to the US, the way this is being done could never achieve that.\n\nNobody in their right mind is going to spend billions in capex right now to bring their supply chain back on shore only to have Trump himself or the next administration change its mind. It takes years to rework supply chains and build infrastructure and you need the government helping with the investment in the form of subsidies, tax breaks, training initiatives, R&D and on and on with an actual plan over 5-10 years.\n\nThis is just one moron engaging in a pissing contest with the entire world because he thinks he is a genius.",
                "Smart move. Conserve cash. Wait for the craziness to pass",
                "Trump Tax (tariffs) causing the Trump Recession.",
                "Microsoft has been pushing AI at the marketing level but they're actually aware of the lack of uptake, massive cost, and low return beyond its utility as a marketing term. I think it was Microsoft who put out the paper about Gen ai making employees dumber.",
                "The global economy will come to a complete stop. Corporations are going to sit on cash while they wait for the tariffs to end.\n\nWhy buy something at 200% of the price if it's temporary?",
                "First intel pulls out and now Microsoft. My city is getting screwed over",
                "MAGAs: Well you see this is a GOOD thing because uh....Bill Gates is...Vaccinated...And thats...Uh...yeah, MERICA!"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "IU provost says 'small number' of student visas revoked",
            "external_url": "https://indianapublicmedia.org/news/iu-provost-says-small-number-of-students-visas-revoked.php",
            "upvotes": 260,
            "date": "04/09/2025",
            "thumbnail": "https://indianapublicmedia.org/images/news-images/shrivastav-pic.jpg",
            "top_comments": [
                "Literally no international students will come to the US anymore. I wonder if anyone thought about the economic impact of that move. Let alone the brain drain.",
                "This is the rhetoric they're going to use. Only a small number of visas were revoked. Only a small number of legal immigrants were sent to super prisons thousands of miles away. Give them an inch and they'll take a mile. This is unacceptable.",
                "Just a lil bit of fascism",
                "This visa revocation is a dumbass move that'll only hurt our economy more. \nThe brain drain will get worse and innovation will stagnate because of it.\nWe need to stop making short-sighted decisions that benefit the few at the expense of the many.",
                "Sure, \"small\" number with no actual figures even though they know.",
                "Lots of people not realizing this is over general immigration issues and not the protests according to the article itself."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "A nightclub roof collapse in the Dominican capital leaves at least 79 dead and 160 injured",
            "external_url": "https://apnews.com/article/dominican-republic-roof-collapse-discotheque-518f9e7b7b212ce90c430139b82c4a18",
            "upvotes": 273,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Damn every time I see an updated number of deaths, it keeps increasing. RIP",
                "RIP to Octavio Dotel and all the others who lost their lives. \n\nThe St Louis Cardinals don’t win the World Series in 2011 without Dotel.",
                "I believe the singer, a famous celebrity in the DR was confirmed dead.",
                "That’s a casualty count that could easily overwhelm even well equipped first world response teams and hospitals. Can’t even imagine having to deal with such a catastrophe in a small third world country.",
                "98 dead now. I've never heard of such a high death toll from a single storey building collapse."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Man pleads guilty to trying to kill Brett Kavanaugh at judge’s home",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/08/brett-kavanaugh-man-pleads-guilty",
            "upvotes": 1815,
            "date": "04/09/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/344a253cdd4d7ebd9a98e0f929ed33a140d341af/0_156_5478_3289/master/5478.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=974f323ee4b9322919958879287d30f7",
            "top_comments": [
                "*He later told investigators that he was thinking about how to give his life “a purpose” when he decided to kill Kavanaugh.*\n\nThe events leading up to his attempt seem like those of a lower budget crime movie, except that his thoughts or intentions would never make it onto the screen... just his direct actions... he flies across the country, lands at Dulles, gets a cab, and tells the driver to go to Kavanaugh's home, calls his sister from the back seat to say he loves her, and then thinks about a suicidal death....",
                "I remember this. He got all the way to Kavanaugh‘s house and then called his sister to confess. She called the cops. Why go to all that trouble just to confess at the last moment?",
                "\"Trying\"\n\nI mean, he didn't try. He planned but then changed his mind and turned himself in when he got close. But he never tried, at least not how I think other native English speakers use that word to mean.",
                "This happened in 2022",
                "The Supreme Court just said they were willing to consider the idea that due process is optional. I know this happened years ago, but my opinion about it is different in light of the fact that Supreme Court didn't IMMEDIATELY decide 9-0 that gulags are bad.",
                "[removed]",
                "He was just a tourist",
                "I’m not here to judge",
                "This is why we need universal healthcare, and universal mental healthcare.\n\nConservatives will scream and cry and point out how violent the left is....but won't do anything to solve any problem unless the solution hurts someone else....",
                "Getting tired of these idiots."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Rise in asylum seekers crossing into Quebec as U.S. revokes status of thousands of migrants | CBC News",
            "external_url": "https://www.cbc.ca/news/canada/montreal/rise-asylum-seekers-quebec-1.7505027?__vfz=medium%3Dsharebar",
            "upvotes": 762,
            "date": "04/08/2025",
            "thumbnail": "https://i.cbc.ca/1.7470147.1740675995!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/quebec-border-crossing-to-receive-100-m-makeover-to-improve-traffic-flow-security-image-1.jpg?im=Resize%3D620",
            "top_comments": [
                "Better get the USA to spend a billion dollars on border control.",
                "Canada: there's no crisis at our southern border!",
                "*The rise in asylum claims drew reaction on the federal campaign trail Tuesday, with Liberal Leader Mark Carney saying it's not acceptable that people leave the U.S. to claim asylum in Canada. That position is in stark contrast to that of his predecessor, Justin Trudeau.*\n\nI'm sure this position is in response to the pressure T is bringing on with his lets-make-a-deal tariffs. Very similar to the arm-twisting of the NYC mayor.",
                "I can smell the taxpayer dollars burning from here",
                "All of our crisis’s going brrrr",
                "As a Canadian-Quebecer... we don't want them here. \n\nWe already have a BIG problem with immigration, it should not be our concern what happens to them south of the border, especially with the actual economic turmoil.\n\nI do hope that our next government is tough on this, but no candidate show anything related to that.",
                "Looks like Canada doesnt want them either ",
                "Build a wall, Canada. America will pay for it with your tariffs.",
                "Oh my gosh, SEND THEM BACK. Canada is full.",
                "We don’t need them and we shouldn’t be paying for them. Send them back across the border."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Near-collision investigation reveals Reagan National Airport controllers failed to stop flights during military flyover",
            "external_url": "https://www.cnn.com/2025/04/08/politics/reagan-national-airport-near-collision-investigation-military-flyover/index.html",
            "upvotes": 134,
            "date": "04/08/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2197594739.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I'm sorry, could we expand on the part where \"a fight broke out in the tower\"!?",
                "They still have air traffic controllers??"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "AP wins reinstatement to White House events after judge rules government can’t bar its journalists",
            "external_url": "https://apnews.com/article/trump-ap-media-court-white-house-events-access-f346a0efe87c1dec4d6f90e6041abd09",
            "upvotes": 4487,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> \"Under the First Amendment, if the Government opens its doors to some journalists—be it to the Oval Office, the East Room, or elsewhere—it cannot then shut those doors to other journalists because of their viewpoints,” McFadden wrote. “The Constitution requires no less.”\n\nThe question is will this administration respect the ruling. They don't seem to have any respect for checks and balances, even though they're a cornerstone of our Constitution.",
                "Freedom of the Press !\n\nI wonder how may question Ms Leave-it will take from the AP...",
                "> U.S. District Judge Trevor N. McFadden, an appointee of President Donald Trump, ruled that the government can’t retaliate against the AP’s decision not to follow the president’s executive order to rename the Gulf of Mexico. The decision handed the AP a major victory at a time the White House has been challenging the press on several levels. \n\nGood.  This was an absurd move by the Trump administration.",
                "Good. Now to the press corps and media - stop being afraid and start challenging this dimwits. Don't just ask questions assuming they have grade 2 intelligence (they don't) and they not ask what the hell they are talking about? Question them, challenge them. Call out the lies, the disrespect, the abuse, the ignorance - be the public that is demanding these clowns be called out for their stupid antics.",
                "I want them to ask follow up questions. Questions like, “Do you have actual proof of that?”  and “What specifically does that mean?”\n\nI’d take it from the AP or any others that follow Bill Burr’s advice.",
                "So basically they’ll appeal it, lose the appeal, and then will send it to SCOTUS, who will come up with some batshit crazy reason to continue to bar the AP. \n\nThere, saved us all some time.",
                "Seems like an impeachable offense, we don’t have kings",
                "Tomorrow's Headline: SCOTUS Overturns Lower Court's Order to Restore AP Access to White House Events.",
                "There's not a snowman's chance in hell that this will be followed.",
                "Everyone should go read about the judge who made this ruling. He’s made some extremely questionable decisions that almost exclusively favored the Trump administration and his supporters. Even he is shutting down one of many of the  Trump administrations’ ridiculously unconstitutional attacks on the press."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "'Time for you to abandon the United States': Asylum seekers who used app being told to leave",
            "external_url": "https://www.cbc.ca/news/world/us-migration-app-removals-1.7504556",
            "upvotes": 14284,
            "date": "04/08/2025",
            "thumbnail": "https://i.cbc.ca/1.7504565.1744118021!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/trump-immigration.jpg?im=Resize%3D620",
            "top_comments": [
                "I was told by someone that I was making a “big deal” over the Mass Deportations Now signs at his rallies.",
                ">Time for you to abandon the United States\n\nGood advice for everyone, honestly.",
                "Note that everyone using this app was in the country *legally* - the language used by the administration repeatedly attempts to imply otherwise, but the entire point was to create a legal path for asylum seekers.",
                "Calling it now, the rhetoric is gonna switch from “If you’re a citizen who’s **here lawfully** you have nothing to fear” to “if you’re a **lawful citizen** you have nothing to fear” so they could deport anyone who engages in ‘terrorist activities’ like protesting against Israel. The change’ll happen so fast it’ll make your head spin.",
                "The asylum seeker issue is proof that Republicans do not actually support legal immigration. They think that being an \"illegal immigrant\" is an innate quality, closely tied to your ethnicity and the color of your skin, not simply the lack of immigration paperwork.\n\nSeeking asylum in the US is legal. You may disagree with the law, but these people were following the law. They are not illegal immigrants. They are legal immigrants following a process that you don't like. The same was true of the Haitian immigrants that JD Vance made up those disgusting lies about. It has always been racism and xenophobia.",
                "... US abandons refugees. Abdicates global leadership. Shoots self in face with tariff cannon. Genius. ",
                "This is exactly what causes more \"illegal immigration\" - the US creates a pathway, people use that pathway, then someone uses that collected data to punish the folks who were trying to do right. \n\nNext time the US comes and says, \"here's how to do it legally,\" why would anyone listen?",
                "\"Time for you to abandon the United States\" -- Now, there's a piece of advice I can get behind. I'd only apply it to literally everyone in the world rather than only people with a skin color that isn't white.",
                "900,000 is an astounding number of people being asked to leave the country.",
                "1883: \"Give me your tired, your poor,\nYour huddled masses yearning to breathe free.\"\n\n2025: Screw you."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Mississippi libraries ordered to delete academic research in response to state laws",
            "external_url": "https://mississippitoday.org/2025/04/08/mississippi-libraries-ordered-to-delete-academic-research-in-response-to-state-laws/",
            "upvotes": 975,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Doing everything they possibly can to suppress us, don't let them win",
                "No wonder why Mississippi is rated as 50th out of all 50 US states on educational metrics. Brain-dead right-wing nut jobs keeping themselves purposely ignorant. Talk about self-sabotage.",
                "just push it to a sever in another jurisdiction",
                "In case anyone is confused, they’re just removing access to academic research. Thankfully, Mississippi isn’t “deleting” their great wealth of knowledge. *cough*",
                "Delete controversial materials, control the narrative and/or create your own alternate information, IS right out of the dictator's play book..\n\n\n\nOnce again America is becoming the very thing we fought against, went to wars over and died for to prevent. Those deaths are meaning less and less every day.\n\n\nedit word\n\n.",
                "This is literally one of the first steps Nazi Germany took. I am not exaggerating.",
                "This is why Mississippi had typos and spelling errors in their state tax overhaul bill",
                "Mississippi is an easy target. They start with an audience that won't fuss too much and slowly move West and North. Deleting academic research in response to state laws will lead to suppression of knowledge, scientific progress, and undermining the principles of academic freedom and open inquiry. This is the start. What they want is no interference.  Libraries, post offices, and Legion halls are the common places for voting and organizing in small towns and rural communities. Especially in retirement counties where transportation and mobility are challenged. That's why eliminating mail-in ballots is so dangerous. It silences a whole lotta people. We must not be complacent. We can't just say, \"Oh, look what they did in...!\" The outcome will result in further untold and unfathomable disasters.",
                "As the great Phil Ochs once sang:\n\n\"Here's to the land\nYou've torn out the heart of,\nMississippi find yourself \nanother country to be part of\"",
                "This sounds like a bunch of nazi crap. They can’t even cite the laws they are using to ‘discern’ which books to burn.. I mean research to delete. I’m not saying they ARE Nazis, But I do think the Nazis would be proud of them right about now."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Microsoft 'not moving forward' with $1B Licking County data center plans right now",
            "external_url": "https://abc6onyourside.com/news/local/microsoft-backs-off-1b-licking-county-data-center-plans",
            "upvotes": 2629,
            "date": "04/09/2025",
            "thumbnail": "https://abc6onyourside.com/resources/media2/16x9/1024/986/0x68/90/9d937b81-ae3b-42c7-bc66-acfc0aacf3a7-AP25028129857071.jpg",
            "top_comments": [
                "All the Trump supporters in Ohio trying to find a reason why this is good now.",
                "More jobs lost.  More investment drying up.\n\nThanks Donald.  I see your tariffs are really, really working.\n\nBut then again Ohio, you voted for this, huh.",
                "Smart....\n\n\"We are taking the appropriate steps to ensure the land at two of our   \nsites can be used for farming and are following through with our   \ndevelopment agreements to fund roadway and utility upgrades. We will   \ncontinue to invest in and collaborate with local organizations to   \nsupport digital skills development, restoration efforts, and to   \nstrengthen the communities in Licking County for future generations.”\n\nThis is great selling point if they decide to move forward somewhere else in the future.",
                "This is all so predictable.\n\nEven if the aim of these tariffs was to bring back more factories to the US, the way this is being done could never achieve that.\n\nNobody in their right mind is going to spend billions in capex right now to bring their supply chain back on shore only to have Trump himself or the next administration change its mind. It takes years to rework supply chains and build infrastructure and you need the government helping with the investment in the form of subsidies, tax breaks, training initiatives, R&D and on and on with an actual plan over 5-10 years.\n\nThis is just one moron engaging in a pissing contest with the entire world because he thinks he is a genius.",
                "Smart move. Conserve cash. Wait for the craziness to pass",
                "Trump Tax (tariffs) causing the Trump Recession.",
                "Microsoft has been pushing AI at the marketing level but they're actually aware of the lack of uptake, massive cost, and low return beyond its utility as a marketing term. I think it was Microsoft who put out the paper about Gen ai making employees dumber.",
                "The global economy will come to a complete stop. Corporations are going to sit on cash while they wait for the tariffs to end.\n\nWhy buy something at 200% of the price if it's temporary?",
                "First intel pulls out and now Microsoft. My city is getting screwed over",
                "MAGAs: Well you see this is a GOOD thing because uh....Bill Gates is...Vaccinated...And thats...Uh...yeah, MERICA!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Man pleads guilty to trying to kill Brett Kavanaugh at judge’s home",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/08/brett-kavanaugh-man-pleads-guilty",
            "upvotes": 1816,
            "date": "04/09/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/344a253cdd4d7ebd9a98e0f929ed33a140d341af/0_156_5478_3289/master/5478.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=974f323ee4b9322919958879287d30f7",
            "top_comments": [
                "*He later told investigators that he was thinking about how to give his life “a purpose” when he decided to kill Kavanaugh.*\n\nThe events leading up to his attempt seem like those of a lower budget crime movie, except that his thoughts or intentions would never make it onto the screen... just his direct actions... he flies across the country, lands at Dulles, gets a cab, and tells the driver to go to Kavanaugh's home, calls his sister from the back seat to say he loves her, and then thinks about a suicidal death....",
                "I remember this. He got all the way to Kavanaugh‘s house and then called his sister to confess. She called the cops. Why go to all that trouble just to confess at the last moment?",
                "\"Trying\"\n\nI mean, he didn't try. He planned but then changed his mind and turned himself in when he got close. But he never tried, at least not how I think other native English speakers use that word to mean.",
                "This happened in 2022",
                "The Supreme Court just said they were willing to consider the idea that due process is optional. I know this happened years ago, but my opinion about it is different in light of the fact that Supreme Court didn't IMMEDIATELY decide 9-0 that gulags are bad.",
                "[removed]",
                "He was just a tourist",
                "I’m not here to judge",
                "This is why we need universal healthcare, and universal mental healthcare.\n\nConservatives will scream and cry and point out how violent the left is....but won't do anything to solve any problem unless the solution hurts someone else....",
                "Getting tired of these idiots."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "A nightclub roof collapse in the Dominican capital leaves at least 79 dead and 160 injured",
            "external_url": "https://apnews.com/article/dominican-republic-roof-collapse-discotheque-518f9e7b7b212ce90c430139b82c4a18",
            "upvotes": 272,
            "date": "04/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Damn every time I see an updated number of deaths, it keeps increasing. RIP",
                "RIP to Octavio Dotel and all the others who lost their lives. \n\nThe St Louis Cardinals don’t win the World Series in 2011 without Dotel.",
                "I believe the singer, a famous celebrity in the DR was confirmed dead.",
                "That’s a casualty count that could easily overwhelm even well equipped first world response teams and hospitals. Can’t even imagine having to deal with such a catastrophe in a small third world country.",
                "98 dead now. I've never heard of such a high death toll from a single storey building collapse."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "IU provost says 'small number' of student visas revoked",
            "external_url": "https://indianapublicmedia.org/news/iu-provost-says-small-number-of-students-visas-revoked.php",
            "upvotes": 258,
            "date": "04/09/2025",
            "thumbnail": "https://indianapublicmedia.org/images/news-images/shrivastav-pic.jpg",
            "top_comments": [
                "Literally no international students will come to the US anymore. I wonder if anyone thought about the economic impact of that move. Let alone the brain drain.",
                "This is the rhetoric they're going to use. Only a small number of visas were revoked. Only a small number of legal immigrants were sent to super prisons thousands of miles away. Give them an inch and they'll take a mile. This is unacceptable.",
                "Just a lil bit of fascism",
                "This visa revocation is a dumbass move that'll only hurt our economy more. \nThe brain drain will get worse and innovation will stagnate because of it.\nWe need to stop making short-sighted decisions that benefit the few at the expense of the many.",
                "Sure, \"small\" number with no actual figures even though they know.",
                "Lots of people not realizing this is over general immigration issues and not the protests according to the article itself."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "'Time for you to abandon the United States': Asylum seekers who used app being told to leave",
            "external_url": "https://www.cbc.ca/news/world/us-migration-app-removals-1.7504556",
            "upvotes": 14282,
            "date": "04/08/2025",
            "thumbnail": "https://i.cbc.ca/1.7504565.1744118021!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/trump-immigration.jpg?im=Resize%3D620",
            "top_comments": [
                "I was told by someone that I was making a “big deal” over the Mass Deportations Now signs at his rallies.",
                ">Time for you to abandon the United States\n\nGood advice for everyone, honestly.",
                "Note that everyone using this app was in the country *legally* - the language used by the administration repeatedly attempts to imply otherwise, but the entire point was to create a legal path for asylum seekers.",
                "Calling it now, the rhetoric is gonna switch from “If you’re a citizen who’s **here lawfully** you have nothing to fear” to “if you’re a **lawful citizen** you have nothing to fear” so they could deport anyone who engages in ‘terrorist activities’ like protesting against Israel. The change’ll happen so fast it’ll make your head spin.",
                "The asylum seeker issue is proof that Republicans do not actually support legal immigration. They think that being an \"illegal immigrant\" is an innate quality, closely tied to your ethnicity and the color of your skin, not simply the lack of immigration paperwork.\n\nSeeking asylum in the US is legal. You may disagree with the law, but these people were following the law. They are not illegal immigrants. They are legal immigrants following a process that you don't like. The same was true of the Haitian immigrants that JD Vance made up those disgusting lies about. It has always been racism and xenophobia.",
                "... US abandons refugees. Abdicates global leadership. Shoots self in face with tariff cannon. Genius. ",
                "This is exactly what causes more \"illegal immigration\" - the US creates a pathway, people use that pathway, then someone uses that collected data to punish the folks who were trying to do right. \n\nNext time the US comes and says, \"here's how to do it legally,\" why would anyone listen?",
                "\"Time for you to abandon the United States\" -- Now, there's a piece of advice I can get behind. I'd only apply it to literally everyone in the world rather than only people with a skin color that isn't white.",
                "900,000 is an astounding number of people being asked to leave the country.",
                "1883: \"Give me your tired, your poor,\nYour huddled masses yearning to breathe free.\"\n\n2025: Screw you."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "AP wins reinstatement to White House events after judge rules government can’t bar its journalists",
            "external_url": "https://apnews.com/article/trump-ap-media-court-white-house-events-access-f346a0efe87c1dec4d6f90e6041abd09",
            "upvotes": 4491,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> \"Under the First Amendment, if the Government opens its doors to some journalists—be it to the Oval Office, the East Room, or elsewhere—it cannot then shut those doors to other journalists because of their viewpoints,” McFadden wrote. “The Constitution requires no less.”\n\nThe question is will this administration respect the ruling. They don't seem to have any respect for checks and balances, even though they're a cornerstone of our Constitution.",
                "Freedom of the Press !\n\nI wonder how may question Ms Leave-it will take from the AP...",
                "> U.S. District Judge Trevor N. McFadden, an appointee of President Donald Trump, ruled that the government can’t retaliate against the AP’s decision not to follow the president’s executive order to rename the Gulf of Mexico. The decision handed the AP a major victory at a time the White House has been challenging the press on several levels. \n\nGood.  This was an absurd move by the Trump administration.",
                "Good. Now to the press corps and media - stop being afraid and start challenging this dimwits. Don't just ask questions assuming they have grade 2 intelligence (they don't) and they not ask what the hell they are talking about? Question them, challenge them. Call out the lies, the disrespect, the abuse, the ignorance - be the public that is demanding these clowns be called out for their stupid antics.",
                "I want them to ask follow up questions. Questions like, “Do you have actual proof of that?”  and “What specifically does that mean?”\n\nI’d take it from the AP or any others that follow Bill Burr’s advice.",
                "So basically they’ll appeal it, lose the appeal, and then will send it to SCOTUS, who will come up with some batshit crazy reason to continue to bar the AP. \n\nThere, saved us all some time.",
                "Seems like an impeachable offense, we don’t have kings",
                "Tomorrow's Headline: SCOTUS Overturns Lower Court's Order to Restore AP Access to White House Events.",
                "There's not a snowman's chance in hell that this will be followed.",
                "Everyone should go read about the judge who made this ruling. He’s made some extremely questionable decisions that almost exclusively favored the Trump administration and his supporters. Even he is shutting down one of many of the  Trump administrations’ ridiculously unconstitutional attacks on the press."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Keystone Pipeline ruptures in North Dakota",
            "external_url": "https://apnews.com/article/keystone-oil-pipeline-north-dakota-spill-36e86142566763a5464e1dd132eede56",
            "upvotes": 5126,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sounds like the worker who shut it down quickly should get a raise, could have been way worse.",
                "*“I don’t think it’s going to be that huge,” Suess said.*\n\nThat line is too tired to be true.",
                "I wonder who could have seen this coming.  Like.....who could've known?  Why weren't there protests over this risk?",
                "Oh wait, wait. They promised us it would NEVR leak. What's up with that.",
                "Is this the pipeline that for four years, MAGA folks claimed  Biden shut down, causing a rise in gas prices?  Of course it was actually a future expansion project that he stopped, but they never let facts get in the way. Drill baby drill!",
                "FEMA is on their way with their best people right? ",
                "Thankfully, the EPA's 2 remaining staff will be onsite in a few months.",
                "> In December 2022, nearly 13,000 barrels of oil spilled from Keystone’s line in Kansas into a creek traversing a pasture. An engineering consulting firm said the bend in the pipeline at the site had been “overstressed” since being installed in 2010, likely because of construction activity altering the land around the pipe.\n\nRepublican response: Let's roll back regulations even further so that this can happen more often, yay!",
                "Whoa, remind me again why the expansion of the XL pipeline was shut down? Oh this exact reason?",
                "They will be charged less than the people who tried to warn about this."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Brussels police arrest US State Secretary Rubio's bodyguard",
            "external_url": "https://www.brusselstimes.com/brussels/1526014/brussels-police-arrest-us-state-secretary-rubios-bodyguard-tbtb",
            "upvotes": 27856,
            "date": "04/08/2025",
            "thumbnail": "https://api.brusselstimes.com/wp-content/uploads/2025/04/ad995448-belgaimage-116320348-1024x683.jpg",
            "top_comments": [
                ">Two sources with direct knowledge of the situation told the Washington Examiner that the agent in question was \"behaving erratically\" and \"became irate\" when hotel staff refused to reopen the bar beyond its normal hours, the US media reports.\n\nAnd here I thought it was going to be about some professional disagreement that got out of hand.",
                "These guys are so used to getting away with breaking the law in the USA.\n\nThey take that mindset and ego to other places in the world and get arrested. \n\nGlad there is still integrity elsewhere.",
                "Needed some liquor at 3:00 a.m. just to live with himself.",
                "The party of “law and order” strikes again.",
                "“I have diplomatic immunity!”\n\n>It’s just been revoked.",
                "Since he's not a resident they should ship him to El Salvador",
                "These cavemen have a lot of trouble hearing the word NO.",
                "Violence. Rape. Alcohol. Child Porn. Tinder. Greed. Threats. Abuse. \n\nThe party of Christianity needs to stop “protecting the world from the evil libs” and start looking at what they are supporting.",
                "Was this a \"merit\" hire? Because this shit show of administration keeps showing they aren't hiring the best people in the slightest.",
                "Wait I thought Pete Hegseth ran the Pentagon not a security detail???"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "US Justice Dept disbands crypto enforcement team, citing Trump order",
            "external_url": "https://www.reuters.com/world/us/us-justice-dept-disbands-cryptocurrency-enforcement-unit-2025-04-08/",
            "upvotes": 13852,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Can't have people looking into crypto scams when the President and his family are the ones running the crypto scams.",
                "I'm guessing the SBF pardon will be coming on Friday at around 7 PM.",
                "What is the point of congress anymore? Trump seems to have the power to do everything himself.",
                "It's things like this that will cause the Great Depression to repeat.\n\nThe SEC was created to regulate stock to ensure people didn't do stupid things to buy overpriced stock.\n\nInstead, we're going to have people spending their life savings on meme coins, only to have it get magically wiped out.\n\nCombine that with tariffs and the inevitable ecological disasters that won't be properly responded to... and you have the Great Depression.",
                "He certainly likes dismantling consumer protection agencies.",
                "\"US Justice Department disbands fraud enforcement team, citing Trump order\".",
                "Trump can't have his grifting being investigated.",
                "New trump shitcoin launching in 3… 2…",
                "How long before Trump EOs the entire Treasury into crypto?",
                "You're safe to assume all crypto is a scam. \n\nIt's funny to me that the same people who want to bring back sweatshop manufacturing also push crypto."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/09/2025 12:15:53 UTC"
}