{
    "posts": [
        {
            "category": "HOT",
            "title": "Texas megachurch founder Robert Morris indicted on charges of lewd acts with a child",
            "external_url": "https://www.nbcnews.com/news/us-news/texas-megachurch-founder-robert-morris-indicted-charges-lewd-acts-chil-rcna161100",
            "upvotes": 38304,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-06/240626-Texas-Megachurch-Pastor-Accused-Robert-Morris-2020-ac-948p-ecbcaf.jpg",
            "top_comments": [
                "Not this Texas pedophile ‘preacher’\nhttps://wgme.com/news/nation-world/texas-megachurch-youth-leader-arrested-for-child-pornography\n\nA different one. ",
                "It's always the ones you most suspect. ",
                "This guy's wife [called the victim](https://thewartburgwatch.com/2024/06/14/i-was-12-years-old-and-wearing-my-pink-pajamas-when-robert-morris-now-of-gateway-church-began-to-molest-me-the-alleged-abuse-lasted-for-4-1-2-years-churchtoo-arctoo/)  and told her that she forgave her.\n\n>Cindy received a call from Debbie Morris, who told Cindy that she “forgave her.” Debbie is a mother. It is inconceivable to me that a mother would blame a 12-year-old child for her husband’s abuse. Cindy believes that Robert Morris might have told Debbie it was “Cindy’s fault!’ Cindy said things fell apart at this point. Their circle of family friends was no more.",
                "Show of hands, who's surprised?\n\nAh, I see... nobody.",
                "Saw him on TV once and went: \"Yeah, this guy is hiding something.\" I worked for a mega church once, I could see the ones who were doing some illegal stuff. Did they get found out? Yep. Did they get fired or arrested? yep. Did it make the parishioners stop going? Nope.",
                "Fucking surprise, surprise. A Republican Christian? Who would have thought?",
                "This is the free space on the BINGO card",
                ">He was 21 and she was 12 at the time.\n\nI'm looking everywhere for drag queens, and I can't find a single one.\n\nI see a Republican, though.",
                "It's sad that it took 40+ years for him to face justice. The article says the accuser tried getting the rapist to pay for therapy in 2007 but she wouldn't sign an NDA so he wouldn't. \n\nThat means for atleast 18 years (probably more) she has been actively trying to get justice. All while he probably made millions of dollars and most likely abused others. \n\n>Morris was a member of President Donald Trump's spiritual advisory committee during his first term.\n\nWow. Of course the guy who raped a 12 year old was in Trump's cabinet.",
                "Matthew 7:15\n “Watch out for false prophets. They come to you in sheep’s clothing, but inwardly they are ferocious wolves.\""
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "U.S. citizen child recovering from brain cancer deported to Mexico with undocumented parents",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-child-recovering-brain-cancer-deported-mexico-undocumented-rcna196049",
            "upvotes": 6182,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-sick-child-1-aa-204-c80154.jpg",
            "top_comments": [
                ">Immigration authorities removed the girl and four of her American siblings from Texas on Feb. 4, when they deported their undocumented parents.\n\n>The family’s ordeal began last month, when they were rushing from Rio Grande, where they lived, to Houston, where their daughter’s specialist doctors are based, for an emergency medical checkup.\n\ntl;dr child is legal US citizen and she needed medical care but ICE says \"Sucks to be you, your mommy and daddy doesn't belong here\" and sent the whole family to Mexico",
                "The rights of a child end when it's born.",
                "ICE agents are some of the most heartless pieces of shit on the planet.",
                "I would love to see what republicans have to say about this considering its a child with brain cancer and they still  talk about the British kid who died while Italy was trying to get the kid transferred to there because the child was terminal (I think this is where the fabled death panels they talk about come from because I remember hearing that from my mother about that case)",
                "Trump treating US citizens like shit is pretty common. Hopefully, she can get the medical treatment she deserves",
                "i think that's illegal",
                "Republicans don’t think children born in the united state to undocumented parents, should be citizens. \n\nThey don’t believe in birth rights. \n\nThey said they would eliminate it. \n\nBelieve them!",
                "This administration is so vile it makes me nauseous",
                "What I cant figure out is where were they stopped at exactly? The article says they were traveling from a ‘Rio Grande’ (city?) to Houston when they were stopped at an immigration check point. Is Rio Grande (not the river) a city in Texas or Mexico? Were they crossing the border or was this ‘immigration check point’ an arbitrary stop point within the US? If the later what are actual US citizens showing at these stops? Are people just carrying their birth certificates around with them now? ",
                "The cruelty is the point. Never let them convince you otherwise."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "SpaceX scrubs astronaut flight that was to retrieve stuck astronauts",
            "external_url": "https://www.reuters.com/technology/space/spacex-nasa-set-astronaut-flight-that-will-retrieve-stuck-astronauts-2025-03-12/",
            "upvotes": 15065,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "After being in space so long that must be hard for them to hear.  They're tough though, or they wouldn't have been selected.",
                "Delayed for technical reasons. Rescheduled for tomorrow. Happens with launches all the time",
                "How interesting after he spent time shit talking the previous administration and saying that they stranded them up there for political reasons.\n\nEdit. For all of those bitching about how oh it’s only for a day blah blah blah it doesn’t matter. The point is that there are reasons that these things happen and Elon Musk and Donald Trump try to politicize it rather than admitting that fucking shit happens like technical issues. That’s all. I’m calling out the hypocrisy of people who pretended like Biden purposely trapped those people up there and the mighty Donald Trump is going to save them.",
                "Well, it's better than having the rocket blow up.",
                "They obviously aren’t going to take risks. Technical issue is what the article said. Was scrubbed for non political reasons from what I see.",
                "I’m all for taking precautions when it comes to launches. They are still planning the launch in the coming days according to the article.",
                "Shocking. Musk once again taking federal funds and not producing anything",
                "If you follow rocket launches in any way, you’d know that this is a pretty common event. Rockets scrub all the time. Could be weather related, could be some sensor that was slightly off… normally they reattempt 24 hours later.",
                "I'm convinced most of you didn't read the article. The flight was postponed because of technical issues. The endeavor to get the stuck astronauts back wasn't cancelled. It's just a misleading headline to make people rage, which seems to have worked.",
                "What he would be sending up is a new capsule with replacements and supplies. They already have a dragon capsule up there if they need to leave the station but it would only leave the Russian portion manned."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "HOT",
            "title": "Baby wombat-snatching US influencer at risk of losing Australian visa",
            "external_url": "https://www.theguardian.com/australia-news/2025/mar/13/sam-jones-us-influencer-baby-wombat-stolen-from-mother-ntwnfb",
            "upvotes": 1539,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/0560f44a8da1ddb4f316428666c2344dcc6a6aa1/632_287_1104_662/master/1104.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b6e7d88616efb53cb511458b3581440d",
            "top_comments": [
                "Good.  Kick her ass out.  I had just watched the video of her doing this.",
                "Stupid influencers are the absolute cancer of society!",
                "What an absolute piece of trash.",
                "Who's the fuckwit with her? Should bloody know better, but clearly doesn't give a shit.",
                ">The Australian prime minister, Anthony Albanese, said it was “an outrage” Jones had separated the joey from its mother.\n\n>“Maybe she might try some other Australian animals,” he said at a press conference, when asked about the incident. “Take a baby crocodile from its mother and see how you go there. Take another animal that can actually fight back rather than stealing a baby wombat from its mother. See how you go there.”\n\nYou guys are the best over there!",
                "I’d rather she sit in jail for a while and then get deported,  but losing her visa and being banned from the country would be a decent next alternative",
                "“I can’t wait to see the back of this individual,” the home affairs minister, Tony Burke\n\nSo is booting actually one of their proudest traditions?",
                "They should have her pay fines. And at the same time add on 50% tariffs on it!",
                "Animal cruelity, fucking psychopath. \n\nThrow her in prison, then throw out and ban this this piece of shit.",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "EPA administrator announces huge rollback of environmental regulations",
            "external_url": "https://www.nbcnews.com/science/environment/epa-rollback-environmental-regulations-zeldin-rcna196112",
            "upvotes": 5364,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-lee-zeldin-ew-306p-40790e.jpg",
            "top_comments": [
                "This is comic-book villain shit right here.",
                "So glad we elected Trump to Make America Healthy Again",
                "I was just thinking:\n\nSomeone would have to be at least 60 to 65 years old to have remembered the oil embargo/fuel crisis and when US smog and pollution was at its worst in the early to mid 1970s. And you'd need to be at least 70 years old to have been a voting age young adult during the first environmental movement around that time. Most voters, and even middle aged to early 50s aged politicians and CEOs, etc, were at most wearing diapers before or during the Carter Administration.\n\n  \nThe only people who understand why the EPA was created are either old or young and history nerds.\n\n  \nBut whatever, I can't wait for the sky to be orange and there to be junk cars and trash floating down the river like in one of those stock film reels made by Documerica. Who needs clean air and water anyways? /s",
                "Do these MAGA idiots not understand that they also live in the same environment that we do, they drink the same water we do and breathe the same air we do? And when it’s all polluted and dirty, they get just as sick?",
                "> “Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.”\n\nI just don’t understand why this country seems so obsessed with going backwards in every possible way imaginable.",
                "\"Sure, we destroyed the climate and environment and thus the world.  But for those last few years, we really created a lot of shareholder value\"",
                "Promising to drive “a dagger through the heart of climate-change religion,” Environmental Protection Agency Administrator Lee Zeldin on Wednesday outlined plans for an aggressive rollback of environmental regulations.\n\nIn a Wall Street Journal opinion piece and an EPA news release, Zeldin announced that he intends to reconsider more than a dozen core EPA rules and regulations, including those pertaining to emissions standards for vehicles, pollution from power plants and the finding that provides the scientific basis for addressing climate change. \n\n“Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.” \n\nThe EPA announced that it will revisit water pollution limits for coal plants, air quality standards for small particles and the mandatory reporting of greenhouse gas emissions by large emitters like oil and gas companies, among other rules. \n\nZeldin also signaled that the EPA would consider upending its own endangerment finding, a 2009 legal decision that says greenhouse gases like carbon dioxide and methane are warming the Earth and that warming presents a threat to public health and welfare. The finding is the lynchpin for the agency’s regulations about greenhouse gas pollution under the Clean Air Act. ",
                "Why does he look like a slightly older Mark Zuckerberg?",
                "I can't wait until Lake Erie catches fire again.\n\nIt will be GREAT. Again.\n\nI can't wait until some community somewhere has a 1000% spike in brain cancer because some shit corporation dumped toxic chemicals all around the place.\n\nThese fucking people are genuinely insane.",
                "“We don’t need trees from Canada, we have National Parks”"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "EPA terminates Biden-era climate grants worth $20 billion",
            "external_url": "https://apnews.com/article/epa-green-bank-zeldin-climate-trump-5168d11b7f63aeaf72001b50221c3c19",
            "upvotes": 14499,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Why is Congress even debating passing a budget right now when Republicans seem to have decided that the President can do whatever the fuck he wants with the money regardless of what Congress approves into law?",
                "All the roadblocks that were in place last term have been replaced with sycophants.\n\nEdit:typo",
                "So more jobs lost. Weren't we supposed to be improving unemployment under a healthy economy?",
                "I don't understand why so many things are able to be undone. This is negating so many things Biden did/awarded etc. Organizations/States/Localities that were allocated these funds relied upon them to start this work just to have it yanked away.",
                "https://www.project2025.observer/",
                "Republican voters:  “choke me harder daddy, make me drink, eat, and breathe toxins, anything you say daddy!”",
                "So destroy the environment, tank the flourishing Biden economy, ruin our National Parks, desecrate domestic education, foreign aid and assistance for  our allies under siege, fire essential workers for no cause and all to just give tax cuts to folks with Yachts that have smaller yachts attached to them. Oh and also make enemies out of our best friends by implementing the “stupidest tariffs of all time” according to conservative WSJ",
                "What a piece of shit government y’all elected. Pure evil. You should be fucking embarrassed.",
                "Fuck the environment, fuck affordable healthcare, fuck vaccines, fuck FDA regulations for food handling! Being alive and healthy is woke liberal garbage! Let me breathe asbestos and eat lead and contract preventable diseases like our forefathers intended 😡",
                "Lee Zeldin is a fuckstick\n\nClimate change and a failure to address it is causing us billions of dollars more each and every year\n\n[The last 3 years we are averaging 24 climate events per year that cost over a billion dollars. Last decade, adjusted for inflation that number was 13. The decade prior it was 6](https://www.ncei.noaa.gov/access/billions/)\n\nIf these people had any interest in fiscal responsibility they'd be addressing climate change like it's world war 3"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Mahmoud Khalil Speaks With Attorneys for First Time Since Detention",
            "external_url": "https://www.dropsitenews.com/p/mahmoud-khalil-speaks-with-attorneys-ice-detention",
            "upvotes": 1000,
            "date": "03/13/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6005cfd2-d8d4-4482-9c12-58c3070c6433_7581x5054.jpeg",
            "top_comments": [
                "Just about to turn 60 and I don't recall a recent time where I've felt as sad for my country as these last few months. One third of this country supports this shit and another third appears asleep. I weep for my country.",
                "It just seems so blatant. Can anybody defend this? Does anybody know anything I'm missing? He has not been charged with any crime. He is in the country legally. I don't care if you are completely on the opposite side of the political spectrum from him. I can see no justification why this arrest is ok. Guess MAGA hates freedom.",
                "Trump was explicitly elected to terrorize the left and MAGA won’t stop until they get a reign of terror instituted as state policy.",
                "Today its him tomorrow it will be you and the reason will not be freedom of speech. Just remember that!",
                "Not a single person who understands what a green card is in this thread. Reddit is incredible.",
                "US support for Israel is immoral and has been since 1948 at least. US policy regarding Israel [led to the 9/11 attacks](https://www.the-independent.com/voices/9-11-osama-bin-laden-interview-robert-fisk-world-trade-center-attack-al-qaeda-terror-a8532256.html) and the October 7 attacks and the $ [8 trillion war on terror](https://watson.brown.edu/costsofwar/figures/2021/BudgetaryCosts) (the wealth equivalent of 20 million homes).\n\n The 9/11 attacks are [why people like Trump exist in the first place](https://www.amazon.com/Reign-Terror-Destabilized-America-Produced/dp/1984879774). \n\n[https://www.reddit.com/r/Global\\_News\\_Hub/comments/1ij11wd/comment/mbcyfk3/](https://www.reddit.com/r/Global_News_Hub/comments/1ij11wd/comment/mbcyfk3/)\n\nEvil is unnatural and requires constant support and maintenance to keep going. This is why the Trump administration is going after people like Khalil.",
                "This makes anonymous protesting all the more important.",
                "I don’t like Trump at all but this guy is a professional agitator paid by Iran. All this goodwill and energy deserves a beter cause.",
                "Fair process and trial.\n\n\nThen hopefully this malignant man is removed from America. Forever.",
                "The internet has been turned into a weapon.  It has turned citizens against people who disagree with the seed that has been planted in their brain."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "EU retaliates against Trump's trade moves and slaps tariffs on produce from Republican states",
            "external_url": "https://www.cbc.ca/news/world/trump-europe-trade-retaliaton-1.7481215",
            "upvotes": 26588,
            "date": "03/12/2025",
            "thumbnail": "https://i.cbc.ca/1.5392012.1741773258!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/belfium-eu-green-deal.jpg?im=Resize%3D620",
            "top_comments": [
                "Just to be clear, the tariffs are on all US imports but happen to be hitting a number of red states.  Goods from blue states will be affected as well.  \n\n>The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson’s Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nVirginia has voted consistently blue in presidential elections and while the governor is Republican, the state house is Dem.  And yes I am aware of the NoVA-southern VA demographics but I doubt the EU cares whether Arlington voted for Trump or not.",
                "> The EU duties aim for pressure points in the U.S. while minimizing additional damage to Europe. The tariffs — taxes on imports — primarily target Republican-held states, hitting soybeans in House Speaker Mike Johnson's Louisiana, and also beef and poultry in Kansas and Nebraska. Produce in Alabama, Georgia and Virginia is also on the list.\n\nThe current administration is trying to bully our long-standing allies, and anyone in our country who doesn't comply with them. I'm not shocked the world is starting to fight back.",
                "Imagine being Putin and planning for this day for so long and finally seeing it come together.",
                "The bourbon industry is not going to have a good time.  They weren't too happy when Canada took their products out of provincially controlled stores.",
                "Cut to 24 hours later when Trump puts a hold on the EU tariffs.",
                "Minnesota is a blue state but all the farm areas are red as hell.  Good hit those soybeans, I have no more empthany for those people.  \n\nFarmers in Blue States really get me upset (I grew up among them), Minnesota has some of the best social programs and protections in the nation and all of them just shit on the Gov and everyone from the Twin Cities.  They themselves benefit from these programs and then talk about how great Christie Noem is from South Dakota.  GO FUCKING MOVE THERE THEN (yeah i know she's not the gov now) \n\nThey also hate anyone who accepts any assistance or benefits like snap or welfare, yet they're the biggest welfare queens I've ever met.",
                "They should have hit tech. That's all trump cares about because they stand in his room. Mark Twitter for being blocked, tons of valid reasons. Mark Apple because they store data in the US.\n\nMake them bleed where they live, they don't care about farmers.",
                "I love the awareness abroad that these horrific policies are not the will of all Americans. Eff those red states!",
                "As a blue stater that has paid for red state subsidies my whole life while they continuously attack all our liberties for no sane reason... we love you.",
                "If this keeps up, 2025 will go down as the beginning of The Great Tariff War.  The worst taxation since our ancestor threw tea into the harbor in protest."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Pentagon 'cherry picked' studies to support transgender service member ban, judge says",
            "external_url": "https://abcnews.go.com/Politics/judges-blocking-mass-firings-transgender-servicemember-ban/story?id=119708856&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 6581,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8be18fd4-62f4-451d-81ce-aa1782d7848d/pentagon-3-ap-gmh-250219_1739995014770_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "pentagon probably didnt do shit. was most likely some project 2025 asshole that told them what to use.",
                "If you can get through boot camp (or OCS), there's a good chance you have what it takes to defend America. Trans or cis. Gay or straight. Male or female.",
                "I really don’t get the anti-transgender fervor from republicans. Transgender people make up, what, less than 0.5% of the population of the US? Probably even lower than that. Why are they such a problem? Can anyone point me to an incident where a trans man, or trans woman, sexually assaulted someone in the military?\n\nThey’re so obsessed with genetalia? It’s pretty fucking weird. I have no idea anymore.",
                "\"Just following orders\"\n\nJust in case anyone thought the US military would be any different than the German NAZI military was.",
                "Duh. Virtually every Republican position on transgender related issues is purely emotional. Let's be real here, this entire election was a social issues election based on emotional reactionaries, it \nwasn't about economics at all.",
                "I'm shocked! Shocked, I say! Well, not shocked...",
                "I was in a combat infantry unit. Our platoon initiation ritual consisted of inducted members holding down the new guys one at a time, yanking their pants down, beating their bare ass red then mock raping them by thrusting against their butt (while still clothed).  \n\nEvery man in my platoon swore up and down he was straight and I have no reason to doubt any of them.  \n\nWould I have trusted them to look after me in combat after that ritual sexual assault? Some of them, sure. Others, not so much. They took too much delight in meteing out pain and humiliation on me. And that's not even mentioning the rabidly Christian guys who found my atheism a cause for concern.  \n\nNot a drag queen. Not a trans person. Not an immigrant without documentation. These were all American men, born and raised, cis-het to the last.",
                "Reminds me of all their arguments against same sex marriage. A whole lot of bullshit with no real basis, just \"trust us, it'll harm straight marriages\" which I'm still waiting to see if it happens 10 years later.",
                "Duh. Thats all conservatives do is fucking cherry pick. Like the now HEAVILY disproven autism/vaccine case study from some fuckwit 30 years ago that studied 12 kids that one time. They call it \"doing independent research\". I call it \"finding the one article that supports their viewpoint, at which point their 'research' ends.\"",
                "Isn't discriminating based on gender identity inherently discriminating based on sex\n\nShit should be illegal"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "French nuclear attack submarine docked in Halifax, Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/video/2025/03/12/french-nuclear-attack-submarine-docked-in-halifax/",
            "upvotes": 6940,
            "date": "03/12/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/https%3A%2F%2Fd3g70guqh4mw9g.cloudfront.net%2F03-12-2025%2Ft_54fd9ebceea143a096852a37f7d34d41_name_11_ATL_SUBMARINE23_VO_frame_0.jpeg?smart=true&auth=83b21a885db7d00d504abfd54a754edecc941e240651702f0ed5f7f16dd08dda&width=1200&height=630",
            "top_comments": [
                "Excellent. \n\nPerhaps we could get British nuclear attack subs based here permanently since we are still a part of the Commonwealth.",
                "Halifax being about 600 km from St Pierre et Miquelon, a territorial overseas collectivity of France.",
                "It's nuclear powered, it doesn't have nuclear warheads. And this happens this time of year.",
                "they definitely worded that headline in a very specific way to garner views, which is nothing new, but this seems to be a pretty extreme case. “Let’s use the public’s fear of a nuclear attack as a way to engage readers!” This is a standard operation for this submarine and it’s being used to further fuel fears of WW3. \n\n“Nuclear attack submarine” is not common terminology. “Nuclear-powered attack submarine” is typically the description. I know it’s pedantic but at a glance (which is how most folks read headlines), one could easily assume a nuclear attack had occurred in France.",
                "So former submariner here, for every docked foreign submarine you see, there’s more patrolling our national waters unseen. A French submarine docked in Canada shouldn’t be making the news when there’s likely 3-4 Russian submarines within spitting distance of the US east coast.",
                "This is not nearly as big a deal as some people think.",
                "Clearly a baguette class submarine",
                "Getting harder and harder to hate the French ffs",
                "I hope it stays there until trump is out of office",
                "Calm down people, it’s nuclear powered, it’s not carrying nuclear weapons"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Sam Jones wombat: US influencer draws backlash for taking baby wombat from mum",
            "external_url": "https://www.bbc.co.uk/news/articles/c3d8m4vk0e9o",
            "upvotes": 198,
            "date": "03/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a9c5/live/16e7c9c0-fffe-11ef-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "Whenever I see the term ‘influencer’ my brain automatically translates it to ‘attention-seeking blowhard’.",
                "I hope they put her in a prison before deport her ass out.",
                "I’m shocked that someone whose entire thing is “I go kill animals around the world for fun and post it online for money” would be cruel to an animal.",
                "Of course she was American. Makes us all look like vain idiots with no regard for wildlife or nature",
                "We are looking at our soon-to-be-appointed new head of the national park service",
                "Please don’t send her back here. We have too many morons in the U.S. as it is.",
                "Soon looking for a new country.",
                "Attention seeking child. I hope they yank her visa.",
                "Attention seeking child. I hope they yank her visa.",
                "She sucks. \n\n\nWhen I was a young kid,  like 6, I found a mama cat with her newborn kittens. I told my other young neighbor about it and she came over and convinced me to play with the kittens. The mama cat started taking away the kittens, but she didn't come back for the littlest one.  My dad tried to help her buy feeding her milk and took it to another family who had cats,  but no one would take it. The kitten ended up dying. I still feel so bad about that.  \n\n\nBut we were 6 and didn't know any better. This is an adult with no respect for wildlife. Sad. "
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "The Associated Press: Russia says it has retaken Sudzha, the biggest town in the Kursk region controlled by Ukraine",
            "external_url": "https://apnews.com/article/russia-ukraine-war-kursk-sudzhba-military-occupation-17cebbc24642ab56d78112eba7eb7509",
            "upvotes": 83,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So Ukraine signed a cease fire while Russia takes land. Art of the deal?",
                "That investment in Donald Trump certainly keeps paying dividends.",
                "So, the U.S. announces a ceasefire, Ukraine attempts to honor it and the chickenhawk dictator Putin in military garb orders his countrymen to press the advantage.",
                "Does anyone else wonder if the U.S. suddenly giving Ukraine intelligence data again consists of false data to give the Russians a boost?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Araghchi: An envoy from an Arab country will deliver Trump's letter to Tehran",
            "external_url": "https://www.avapress.com/en/news/310041/araghchi-an-envoy-from-an-arab-country-will-deliver-trump-s-letter-to-tehran",
            "upvotes": 4,
            "date": "03/13/2025",
            "thumbnail": "https://www.avapress.com/images/docs/000310/n00310041-b.jpg",
            "top_comments": [
                "You know it's bad when the State Department's worried that the messenger won't make it out alive.",
                "Interesting development. It will be crucial to see how Tehran responds to this diplomatic move."
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "NEW",
            "title": "Ex-Barclays boss Jes Staley admits having sex with member of Jeffrey Epstein staff",
            "external_url": "https://www.theguardian.com/business/2025/mar/12/prince-andrew-was-told-epstein-saw-staley-as-close-friend-court-hears",
            "upvotes": 393,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/04e2750c268e7207cf2fb69e13bf809f2fafa13d/0_48_1342_805/master/1342.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=61cf0f7fb1861542bab5330e2f6706c8",
            "top_comments": [
                "I love how the thumbnail to this article is Prince Andrew - despite him having nothing to do with the story. \n\nI guess he’s just the placeholder face of anything to do with Epstein.",
                "In the article:\n\n>***The former chief executive of Barclays, Jes Staley, has admitted to having sex with a member of Jeffrey Epstein’s staff in an apartment owned by the child sex offender’s brother in New York, a court has heard.***\n\n>*Staley made the admission at the end of a testy day of cross-examination at the upper tribunal, but maintained that his friendship with Epstein was not personal and had always been based on business.*\n\n>***The former Barclays boss, who resigned in 2021, is trying to overturn the regulator’s decision to ban him from taking any senior roles in the UK financial sector for allegedly lying about the depth of his relationship with Epstein. Barclays declared to the*** [***Financial Conduct Authority***](https://www.theguardian.com/business/financial-conduct-authority) ***(FCA) in a letter in 2019 that the two men “did not have a close relationship”.***\n\n>***The FCA’s lawyer Leigh-Ann Mulcahy KC handed documents to Staley and tribunal judges without presenting them to the public, before asking Staley: “Do you accept that you had sexual intercourse with a woman at Mr Epstein’s brother’s apartment?”***\n\n>***“Yes,” Staley said. The former CEO, who is married and has two daughters, acknowledged he met the woman through Epstein, but while he told the court “she was part of his staff”, he claimed Epstein did not know they had sex.***\n\n>*“How did it come about that you had sexual intercourse with a woman who worked for him at an apartment, owned by his brother, without him knowing?” Mulcahy asked.*\n\n>*Staley said: “Oftentimes I would go to Epstein’s apartment and he would be late, and she and I got the chance to know each other.” This led to sexual intercourse, he said, “much to my embarrassment today”.*\n\n>*The ex-banker agreed with Mulcahy that he would describe the intercourse as “consensual”. The date of the encounter and the age of the woman were not disclosed in court. The FCA stated that the property was owned by Epstein’s brother.*\n\n>*Mulcahy also put to Staley that the staff member “appeared to have carved you out of a settlement with the Epstein estate”. Staley replied he was “not aware of that”.*\n\n>*The ex-Barclays boss also maintained that he did not remember the context for a separate, and now notorious, exchange with Epstein in 2010 referring to Disney princesses.*",
                "*\"Oftentimes I would go to Epstein’s apartment and he would be late\"* yeah that sounds like a purely \"business\" relationship",
                "“The date of the encounter and age of the woman were not discussed in court” \n\nShe was a minor. Court talking about “maybe we shouldn’t give him a high ranking position in the UK” \n\nwtf?! This creep needs to be tossed off the top of a high rise",
                "His wife and daughters must be proud...",
                "I always imagined perverts living in shacks and trailers in poor under-educated areas of the country. Not in penthouses in rich neighborhoods or parsonages next to churches.",
                "He schtupped Prince Andrew?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Baby wombat-snatching US influencer at risk of losing Australian visa",
            "external_url": "https://www.theguardian.com/australia-news/2025/mar/13/sam-jones-us-influencer-baby-wombat-stolen-from-mother-ntwnfb",
            "upvotes": 1543,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/0560f44a8da1ddb4f316428666c2344dcc6a6aa1/632_287_1104_662/master/1104.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b6e7d88616efb53cb511458b3581440d",
            "top_comments": [
                "Good.  Kick her ass out.  I had just watched the video of her doing this.",
                "Stupid influencers are the absolute cancer of society!",
                "What an absolute piece of trash.",
                "Who's the fuckwit with her? Should bloody know better, but clearly doesn't give a shit.",
                ">The Australian prime minister, Anthony Albanese, said it was “an outrage” Jones had separated the joey from its mother.\n\n>“Maybe she might try some other Australian animals,” he said at a press conference, when asked about the incident. “Take a baby crocodile from its mother and see how you go there. Take another animal that can actually fight back rather than stealing a baby wombat from its mother. See how you go there.”\n\nYou guys are the best over there!",
                "I’d rather she sit in jail for a while and then get deported,  but losing her visa and being banned from the country would be a decent next alternative",
                "“I can’t wait to see the back of this individual,” the home affairs minister, Tony Burke\n\nSo is booting actually one of their proudest traditions?",
                "They should have her pay fines. And at the same time add on 50% tariffs on it!",
                "Animal cruelity, fucking psychopath. \n\nThrow her in prison, then throw out and ban this this piece of shit.",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Mahmoud Khalil Speaks With Attorneys for First Time Since Detention",
            "external_url": "https://www.dropsitenews.com/p/mahmoud-khalil-speaks-with-attorneys-ice-detention",
            "upvotes": 1001,
            "date": "03/13/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6005cfd2-d8d4-4482-9c12-58c3070c6433_7581x5054.jpeg",
            "top_comments": [
                "Just about to turn 60 and I don't recall a recent time where I've felt as sad for my country as these last few months. One third of this country supports this shit and another third appears asleep. I weep for my country.",
                "It just seems so blatant. Can anybody defend this? Does anybody know anything I'm missing? He has not been charged with any crime. He is in the country legally. I don't care if you are completely on the opposite side of the political spectrum from him. I can see no justification why this arrest is ok. Guess MAGA hates freedom.",
                "Trump was explicitly elected to terrorize the left and MAGA won’t stop until they get a reign of terror instituted as state policy.",
                "Today its him tomorrow it will be you and the reason will not be freedom of speech. Just remember that!",
                "Not a single person who understands what a green card is in this thread. Reddit is incredible.",
                "US support for Israel is immoral and has been since 1948 at least. US policy regarding Israel [led to the 9/11 attacks](https://www.the-independent.com/voices/9-11-osama-bin-laden-interview-robert-fisk-world-trade-center-attack-al-qaeda-terror-a8532256.html) and the October 7 attacks and the $ [8 trillion war on terror](https://watson.brown.edu/costsofwar/figures/2021/BudgetaryCosts) (the wealth equivalent of 20 million homes).\n\n The 9/11 attacks are [why people like Trump exist in the first place](https://www.amazon.com/Reign-Terror-Destabilized-America-Produced/dp/1984879774). \n\n[https://www.reddit.com/r/Global\\_News\\_Hub/comments/1ij11wd/comment/mbcyfk3/](https://www.reddit.com/r/Global_News_Hub/comments/1ij11wd/comment/mbcyfk3/)\n\nEvil is unnatural and requires constant support and maintenance to keep going. This is why the Trump administration is going after people like Khalil.",
                "This makes anonymous protesting all the more important.",
                "I don’t like Trump at all but this guy is a professional agitator paid by Iran. All this goodwill and energy deserves a beter cause.",
                "Fair process and trial.\n\n\nThen hopefully this malignant man is removed from America. Forever.",
                "The internet has been turned into a weapon.  It has turned citizens against people who disagree with the seed that has been planted in their brain."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Chinese company develops nuclear battery with ultra-long lifespan",
            "external_url": "http://en.people.cn/n3/2025/0313/c90000-20288708.html",
            "upvotes": 16,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Neat. We used to have Plutonium-238 pacemakers here in the U.S., but nowadays NASA can barely scrounge up enough Pu-238 for a space probe. Carbon-14 should be a lot easier to source!",
                "Sleeping next to my nuclear battery iPhone , how exciting."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "U.S. citizen child recovering from brain cancer deported to Mexico with undocumented parents",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-child-recovering-brain-cancer-deported-mexico-undocumented-rcna196049",
            "upvotes": 6182,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-sick-child-1-aa-204-c80154.jpg",
            "top_comments": [
                ">Immigration authorities removed the girl and four of her American siblings from Texas on Feb. 4, when they deported their undocumented parents.\n\n>The family’s ordeal began last month, when they were rushing from Rio Grande, where they lived, to Houston, where their daughter’s specialist doctors are based, for an emergency medical checkup.\n\ntl;dr child is legal US citizen and she needed medical care but ICE says \"Sucks to be you, your mommy and daddy doesn't belong here\" and sent the whole family to Mexico",
                "The rights of a child end when it's born.",
                "ICE agents are some of the most heartless pieces of shit on the planet.",
                "I would love to see what republicans have to say about this considering its a child with brain cancer and they still  talk about the British kid who died while Italy was trying to get the kid transferred to there because the child was terminal (I think this is where the fabled death panels they talk about come from because I remember hearing that from my mother about that case)",
                "Trump treating US citizens like shit is pretty common. Hopefully, she can get the medical treatment she deserves",
                "i think that's illegal",
                "Republicans don’t think children born in the united state to undocumented parents, should be citizens. \n\nThey don’t believe in birth rights. \n\nThey said they would eliminate it. \n\nBelieve them!",
                "This administration is so vile it makes me nauseous",
                "What I cant figure out is where were they stopped at exactly? The article says they were traveling from a ‘Rio Grande’ (city?) to Houston when they were stopped at an immigration check point. Is Rio Grande (not the river) a city in Texas or Mexico? Were they crossing the border or was this ‘immigration check point’ an arbitrary stop point within the US? If the later what are actual US citizens showing at these stops? Are people just carrying their birth certificates around with them now? ",
                "The cruelty is the point. Never let them convince you otherwise."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "FTC asks judge to delay Amazon trial due to resource constraints",
            "external_url": "https://apnews.com/article/amazon-ftc-trial-date-df069a0a71d9627800a72cf07b6cf5de",
            "upvotes": 173,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is a signal to all of corporate America that they are free to rip off and scam their customers at will and this administration will rip the teeth out of any enforcement of laws that prevent it.",
                "No wonder Bezos was sitting in the front row at the inauguration. Can't prosecute a case if they fire all the prosecutors.",
                "Canceled my Kindle account, canceled my Prime Visa, uninstalled all my Amazon apps. Been a customer since practically the beginning. Fuck Amazon.",
                "Some of these lawyers that are getting threatened by the MAGA cult show volunteer to help the FCC.",
                "Anyone know whether a judge could order the government to spend whatever's necessary to put on their case regardless? Sort of like how they can prevent a lawyer from dropping a client right before trial if the client hasn't paid their lawyer's fees."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Canada hits U.S. with dollar-for-dollar retaliation for Trump’s steel and aluminum tariffs",
            "external_url": "https://www.ctvnews.ca/world/trumps-tariffs/article/canada-to-announce-298-billion-in-retaliatory-tariffs-on-us-official-tells-reuters/",
            "upvotes": 1630,
            "date": "03/13/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/O2Z3R2AGDRBHPAVMLPWN67KEVU.JPG?smart=true&auth=d37064364955204825c361d2b31d8e8e2ee31af7d9968a7e20c781659e87a7af&width=1200&height=630",
            "top_comments": [
                "What's crazy is even Trump still doesn't seem to understand he's taxing Americans.",
                "If only someone could have seen this coming...",
                "Wait until tomorrow I bet Lutnick will make a fool of himself with Ford",
                ">According to the federal government, the list of additional products affected by counter-tariffs includes tools, computers and servers, display monitors, water heaters, sport equipment, and cast-iron products.  \n  \nThe full list of fresh items slated to face tariffs as of Thursday, was issued late Wednesday afternoon. It includes jewelry, watches, tricycles, video game consoles, smartphones, umbrellas, gongs, golf clubs, fishing poles, and lighters.\n\nI wished there was a better way to see the products being tariffed. Even the video game consoles info gave me:\n\n>Video game consoles and machines, table or parlour games, including pintables, billiards, special tables for casino games and automatic bowling equipment, amusement machines operated by coins, bank notes, bank cards, tokens or by any other means of payment.",
                "Don't mess with Canada ",
                "A serious question \n\n\nIs it possible to \"tariff\" US big tech operating in Canada?\n\n\nOr it would be illegal or impossible because they are Canadian entities?",
                "Just flat out punch the US in the nuts.  Pass regulations in Canada to eliminate any US patents for things like John Deere tractors, Teslas, pharmaceuticals and such.  All farmers can jailbreak the tech on the machines to make it easier and cheaper to DIY fix.  Jailbreak teslas to eliminate kill switches, access any function or option and have it transferable to a new owner.  Copy and distribute all US patented drugs and offer them cheap to developing worlds.  Canada can become a tech power while distributing hacks for US products. A whole industry could grow out of programming patches and updates to be distributed.  Watch Leon cry when he has no after sales revenue from the swasticar.",
                "Band for Band, shooter for shooter",
                "God damn Obama and Biden! Look what they're doing.",
                "Canada should make it an automatic $2 for every $1…"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Sam Jones wombat: US influencer draws backlash for taking baby wombat from mum",
            "external_url": "https://www.bbc.co.uk/news/articles/c3d8m4vk0e9o",
            "upvotes": 199,
            "date": "03/13/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a9c5/live/16e7c9c0-fffe-11ef-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "Whenever I see the term ‘influencer’ my brain automatically translates it to ‘attention-seeking blowhard’.",
                "I hope they put her in a prison before deport her ass out.",
                "I’m shocked that someone whose entire thing is “I go kill animals around the world for fun and post it online for money” would be cruel to an animal.",
                "Of course she was American. Makes us all look like vain idiots with no regard for wildlife or nature",
                "We are looking at our soon-to-be-appointed new head of the national park service",
                "Please don’t send her back here. We have too many morons in the U.S. as it is.",
                "Soon looking for a new country.",
                "Attention seeking child. I hope they yank her visa.",
                "Attention seeking child. I hope they yank her visa.",
                "She sucks. \n\n\nWhen I was a young kid,  like 6, I found a mama cat with her newborn kittens. I told my other young neighbor about it and she came over and convinced me to play with the kittens. The mama cat started taking away the kittens, but she didn't come back for the littlest one.  My dad tried to help her buy feeding her milk and took it to another family who had cats,  but no one would take it. The kitten ended up dying. I still feel so bad about that.  \n\n\nBut we were 6 and didn't know any better. This is an adult with no respect for wildlife. Sad. "
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Baby wombat-snatching US influencer at risk of losing Australian visa",
            "external_url": "https://www.theguardian.com/australia-news/2025/mar/13/sam-jones-us-influencer-baby-wombat-stolen-from-mother-ntwnfb",
            "upvotes": 1537,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/0560f44a8da1ddb4f316428666c2344dcc6a6aa1/632_287_1104_662/master/1104.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b6e7d88616efb53cb511458b3581440d",
            "top_comments": [
                "Good.  Kick her ass out.  I had just watched the video of her doing this.",
                "Stupid influencers are the absolute cancer of society!",
                "What an absolute piece of trash.",
                "Who's the fuckwit with her? Should bloody know better, but clearly doesn't give a shit.",
                ">The Australian prime minister, Anthony Albanese, said it was “an outrage” Jones had separated the joey from its mother.\n\n>“Maybe she might try some other Australian animals,” he said at a press conference, when asked about the incident. “Take a baby crocodile from its mother and see how you go there. Take another animal that can actually fight back rather than stealing a baby wombat from its mother. See how you go there.”\n\nYou guys are the best over there!",
                "I’d rather she sit in jail for a while and then get deported,  but losing her visa and being banned from the country would be a decent next alternative",
                "“I can’t wait to see the back of this individual,” the home affairs minister, Tony Burke\n\nSo is booting actually one of their proudest traditions?",
                "They should have her pay fines. And at the same time add on 50% tariffs on it!",
                "Animal cruelity, fucking psychopath. \n\nThrow her in prison, then throw out and ban this this piece of shit.",
                "[ Removed by Reddit ]"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Ex-Barclays boss Jes Staley admits having sex with member of Jeffrey Epstein staff",
            "external_url": "https://www.theguardian.com/business/2025/mar/12/prince-andrew-was-told-epstein-saw-staley-as-close-friend-court-hears",
            "upvotes": 395,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/04e2750c268e7207cf2fb69e13bf809f2fafa13d/0_48_1342_805/master/1342.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=61cf0f7fb1861542bab5330e2f6706c8",
            "top_comments": [
                "I love how the thumbnail to this article is Prince Andrew - despite him having nothing to do with the story. \n\nI guess he’s just the placeholder face of anything to do with Epstein.",
                "In the article:\n\n>***The former chief executive of Barclays, Jes Staley, has admitted to having sex with a member of Jeffrey Epstein’s staff in an apartment owned by the child sex offender’s brother in New York, a court has heard.***\n\n>*Staley made the admission at the end of a testy day of cross-examination at the upper tribunal, but maintained that his friendship with Epstein was not personal and had always been based on business.*\n\n>***The former Barclays boss, who resigned in 2021, is trying to overturn the regulator’s decision to ban him from taking any senior roles in the UK financial sector for allegedly lying about the depth of his relationship with Epstein. Barclays declared to the*** [***Financial Conduct Authority***](https://www.theguardian.com/business/financial-conduct-authority) ***(FCA) in a letter in 2019 that the two men “did not have a close relationship”.***\n\n>***The FCA’s lawyer Leigh-Ann Mulcahy KC handed documents to Staley and tribunal judges without presenting them to the public, before asking Staley: “Do you accept that you had sexual intercourse with a woman at Mr Epstein’s brother’s apartment?”***\n\n>***“Yes,” Staley said. The former CEO, who is married and has two daughters, acknowledged he met the woman through Epstein, but while he told the court “she was part of his staff”, he claimed Epstein did not know they had sex.***\n\n>*“How did it come about that you had sexual intercourse with a woman who worked for him at an apartment, owned by his brother, without him knowing?” Mulcahy asked.*\n\n>*Staley said: “Oftentimes I would go to Epstein’s apartment and he would be late, and she and I got the chance to know each other.” This led to sexual intercourse, he said, “much to my embarrassment today”.*\n\n>*The ex-banker agreed with Mulcahy that he would describe the intercourse as “consensual”. The date of the encounter and the age of the woman were not disclosed in court. The FCA stated that the property was owned by Epstein’s brother.*\n\n>*Mulcahy also put to Staley that the staff member “appeared to have carved you out of a settlement with the Epstein estate”. Staley replied he was “not aware of that”.*\n\n>*The ex-Barclays boss also maintained that he did not remember the context for a separate, and now notorious, exchange with Epstein in 2010 referring to Disney princesses.*",
                "*\"Oftentimes I would go to Epstein’s apartment and he would be late\"* yeah that sounds like a purely \"business\" relationship",
                "“The date of the encounter and age of the woman were not discussed in court” \n\nShe was a minor. Court talking about “maybe we shouldn’t give him a high ranking position in the UK” \n\nwtf?! This creep needs to be tossed off the top of a high rise",
                "His wife and daughters must be proud...",
                "I always imagined perverts living in shacks and trailers in poor under-educated areas of the country. Not in penthouses in rich neighborhoods or parsonages next to churches.",
                "He schtupped Prince Andrew?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "U.S. citizen child recovering from brain cancer deported to Mexico with undocumented parents",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-child-recovering-brain-cancer-deported-mexico-undocumented-rcna196049",
            "upvotes": 6180,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-sick-child-1-aa-204-c80154.jpg",
            "top_comments": [
                ">Immigration authorities removed the girl and four of her American siblings from Texas on Feb. 4, when they deported their undocumented parents.\n\n>The family’s ordeal began last month, when they were rushing from Rio Grande, where they lived, to Houston, where their daughter’s specialist doctors are based, for an emergency medical checkup.\n\ntl;dr child is legal US citizen and she needed medical care but ICE says \"Sucks to be you, your mommy and daddy doesn't belong here\" and sent the whole family to Mexico",
                "The rights of a child end when it's born.",
                "ICE agents are some of the most heartless pieces of shit on the planet.",
                "I would love to see what republicans have to say about this considering its a child with brain cancer and they still  talk about the British kid who died while Italy was trying to get the kid transferred to there because the child was terminal (I think this is where the fabled death panels they talk about come from because I remember hearing that from my mother about that case)",
                "Trump treating US citizens like shit is pretty common. Hopefully, she can get the medical treatment she deserves",
                "i think that's illegal",
                "Republicans don’t think children born in the united state to undocumented parents, should be citizens. \n\nThey don’t believe in birth rights. \n\nThey said they would eliminate it. \n\nBelieve them!",
                "This administration is so vile it makes me nauseous",
                "What I cant figure out is where were they stopped at exactly? The article says they were traveling from a ‘Rio Grande’ (city?) to Houston when they were stopped at an immigration check point. Is Rio Grande (not the river) a city in Texas or Mexico? Were they crossing the border or was this ‘immigration check point’ an arbitrary stop point within the US? If the later what are actual US citizens showing at these stops? Are people just carrying their birth certificates around with them now? ",
                "The cruelty is the point. Never let them convince you otherwise."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Canada hits U.S. with dollar-for-dollar retaliation for Trump’s steel and aluminum tariffs",
            "external_url": "https://www.ctvnews.ca/world/trumps-tariffs/article/canada-to-announce-298-billion-in-retaliatory-tariffs-on-us-official-tells-reuters/",
            "upvotes": 1625,
            "date": "03/13/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/O2Z3R2AGDRBHPAVMLPWN67KEVU.JPG?smart=true&auth=d37064364955204825c361d2b31d8e8e2ee31af7d9968a7e20c781659e87a7af&width=1200&height=630",
            "top_comments": [
                "What's crazy is even Trump still doesn't seem to understand he's taxing Americans.",
                "If only someone could have seen this coming...",
                "Wait until tomorrow I bet Lutnick will make a fool of himself with Ford",
                ">According to the federal government, the list of additional products affected by counter-tariffs includes tools, computers and servers, display monitors, water heaters, sport equipment, and cast-iron products.  \n  \nThe full list of fresh items slated to face tariffs as of Thursday, was issued late Wednesday afternoon. It includes jewelry, watches, tricycles, video game consoles, smartphones, umbrellas, gongs, golf clubs, fishing poles, and lighters.\n\nI wished there was a better way to see the products being tariffed. Even the video game consoles info gave me:\n\n>Video game consoles and machines, table or parlour games, including pintables, billiards, special tables for casino games and automatic bowling equipment, amusement machines operated by coins, bank notes, bank cards, tokens or by any other means of payment.",
                "Don't mess with Canada ",
                "A serious question \n\n\nIs it possible to \"tariff\" US big tech operating in Canada?\n\n\nOr it would be illegal or impossible because they are Canadian entities?",
                "Just flat out punch the US in the nuts.  Pass regulations in Canada to eliminate any US patents for things like John Deere tractors, Teslas, pharmaceuticals and such.  All farmers can jailbreak the tech on the machines to make it easier and cheaper to DIY fix.  Jailbreak teslas to eliminate kill switches, access any function or option and have it transferable to a new owner.  Copy and distribute all US patented drugs and offer them cheap to developing worlds.  Canada can become a tech power while distributing hacks for US products. A whole industry could grow out of programming patches and updates to be distributed.  Watch Leon cry when he has no after sales revenue from the swasticar.",
                "Band for Band, shooter for shooter",
                "God damn Obama and Biden! Look what they're doing.",
                "Canada should make it an automatic $2 for every $1…"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Mahmoud Khalil Speaks With Attorneys for First Time Since Detention",
            "external_url": "https://www.dropsitenews.com/p/mahmoud-khalil-speaks-with-attorneys-ice-detention",
            "upvotes": 1000,
            "date": "03/13/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6005cfd2-d8d4-4482-9c12-58c3070c6433_7581x5054.jpeg",
            "top_comments": [
                "Just about to turn 60 and I don't recall a recent time where I've felt as sad for my country as these last few months. One third of this country supports this shit and another third appears asleep. I weep for my country.",
                "It just seems so blatant. Can anybody defend this? Does anybody know anything I'm missing? He has not been charged with any crime. He is in the country legally. I don't care if you are completely on the opposite side of the political spectrum from him. I can see no justification why this arrest is ok. Guess MAGA hates freedom.",
                "Trump was explicitly elected to terrorize the left and MAGA won’t stop until they get a reign of terror instituted as state policy.",
                "Today its him tomorrow it will be you and the reason will not be freedom of speech. Just remember that!",
                "Not a single person who understands what a green card is in this thread. Reddit is incredible.",
                "US support for Israel is immoral and has been since 1948 at least. US policy regarding Israel [led to the 9/11 attacks](https://www.the-independent.com/voices/9-11-osama-bin-laden-interview-robert-fisk-world-trade-center-attack-al-qaeda-terror-a8532256.html) and the October 7 attacks and the $ [8 trillion war on terror](https://watson.brown.edu/costsofwar/figures/2021/BudgetaryCosts) (the wealth equivalent of 20 million homes).\n\n The 9/11 attacks are [why people like Trump exist in the first place](https://www.amazon.com/Reign-Terror-Destabilized-America-Produced/dp/1984879774). \n\n[https://www.reddit.com/r/Global\\_News\\_Hub/comments/1ij11wd/comment/mbcyfk3/](https://www.reddit.com/r/Global_News_Hub/comments/1ij11wd/comment/mbcyfk3/)\n\nEvil is unnatural and requires constant support and maintenance to keep going. This is why the Trump administration is going after people like Khalil.",
                "This makes anonymous protesting all the more important.",
                "I don’t like Trump at all but this guy is a professional agitator paid by Iran. All this goodwill and energy deserves a beter cause.",
                "Fair process and trial.\n\n\nThen hopefully this malignant man is removed from America. Forever.",
                "The internet has been turned into a weapon.  It has turned citizens against people who disagree with the seed that has been planted in their brain."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Texas megachurch founder Robert Morris indicted on charges of lewd acts with a child",
            "external_url": "https://www.nbcnews.com/news/us-news/texas-megachurch-founder-robert-morris-indicted-charges-lewd-acts-chil-rcna161100",
            "upvotes": 38296,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-06/240626-Texas-Megachurch-Pastor-Accused-Robert-Morris-2020-ac-948p-ecbcaf.jpg",
            "top_comments": [
                "Not this Texas pedophile ‘preacher’\nhttps://wgme.com/news/nation-world/texas-megachurch-youth-leader-arrested-for-child-pornography\n\nA different one. ",
                "It's always the ones you most suspect. ",
                "This guy's wife [called the victim](https://thewartburgwatch.com/2024/06/14/i-was-12-years-old-and-wearing-my-pink-pajamas-when-robert-morris-now-of-gateway-church-began-to-molest-me-the-alleged-abuse-lasted-for-4-1-2-years-churchtoo-arctoo/)  and told her that she forgave her.\n\n>Cindy received a call from Debbie Morris, who told Cindy that she “forgave her.” Debbie is a mother. It is inconceivable to me that a mother would blame a 12-year-old child for her husband’s abuse. Cindy believes that Robert Morris might have told Debbie it was “Cindy’s fault!’ Cindy said things fell apart at this point. Their circle of family friends was no more.",
                "Show of hands, who's surprised?\n\nAh, I see... nobody.",
                "Saw him on TV once and went: \"Yeah, this guy is hiding something.\" I worked for a mega church once, I could see the ones who were doing some illegal stuff. Did they get found out? Yep. Did they get fired or arrested? yep. Did it make the parishioners stop going? Nope.",
                "Fucking surprise, surprise. A Republican Christian? Who would have thought?",
                "This is the free space on the BINGO card",
                ">He was 21 and she was 12 at the time.\n\nI'm looking everywhere for drag queens, and I can't find a single one.\n\nI see a Republican, though.",
                "It's sad that it took 40+ years for him to face justice. The article says the accuser tried getting the rapist to pay for therapy in 2007 but she wouldn't sign an NDA so he wouldn't. \n\nThat means for atleast 18 years (probably more) she has been actively trying to get justice. All while he probably made millions of dollars and most likely abused others. \n\n>Morris was a member of President Donald Trump's spiritual advisory committee during his first term.\n\nWow. Of course the guy who raped a 12 year old was in Trump's cabinet.",
                "Matthew 7:15\n “Watch out for false prophets. They come to you in sheep’s clothing, but inwardly they are ferocious wolves.\""
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "EPA administrator announces huge rollback of environmental regulations",
            "external_url": "https://www.nbcnews.com/science/environment/epa-rollback-environmental-regulations-zeldin-rcna196112",
            "upvotes": 5363,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250312-lee-zeldin-ew-306p-40790e.jpg",
            "top_comments": [
                "This is comic-book villain shit right here.",
                "So glad we elected Trump to Make America Healthy Again",
                "I was just thinking:\n\nSomeone would have to be at least 60 to 65 years old to have remembered the oil embargo/fuel crisis and when US smog and pollution was at its worst in the early to mid 1970s. And you'd need to be at least 70 years old to have been a voting age young adult during the first environmental movement around that time. Most voters, and even middle aged to early 50s aged politicians and CEOs, etc, were at most wearing diapers before or during the Carter Administration.\n\n  \nThe only people who understand why the EPA was created are either old or young and history nerds.\n\n  \nBut whatever, I can't wait for the sky to be orange and there to be junk cars and trash floating down the river like in one of those stock film reels made by Documerica. Who needs clean air and water anyways? /s",
                "Do these MAGA idiots not understand that they also live in the same environment that we do, they drink the same water we do and breathe the same air we do? And when it’s all polluted and dirty, they get just as sick?",
                "> “Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.”\n\nI just don’t understand why this country seems so obsessed with going backwards in every possible way imaginable.",
                "\"Sure, we destroyed the climate and environment and thus the world.  But for those last few years, we really created a lot of shareholder value\"",
                "Promising to drive “a dagger through the heart of climate-change religion,” Environmental Protection Agency Administrator Lee Zeldin on Wednesday outlined plans for an aggressive rollback of environmental regulations.\n\nIn a Wall Street Journal opinion piece and an EPA news release, Zeldin announced that he intends to reconsider more than a dozen core EPA rules and regulations, including those pertaining to emissions standards for vehicles, pollution from power plants and the finding that provides the scientific basis for addressing climate change. \n\n“Today marks the death of the Green New Scam,” Zeldin wrote in The Wall Street Journal, arguing that his deregulation plan would create an environment where “businesses can thrive and infrastructure can be built.” He added that he wants to reassess rules that, in his view, “throttled oil and gas production and unfairly targeted coal-fired power plants,” and suggested that his proposed actions would roll back “trillions of dollars in regulatory costs.” \n\nThe EPA announced that it will revisit water pollution limits for coal plants, air quality standards for small particles and the mandatory reporting of greenhouse gas emissions by large emitters like oil and gas companies, among other rules. \n\nZeldin also signaled that the EPA would consider upending its own endangerment finding, a 2009 legal decision that says greenhouse gases like carbon dioxide and methane are warming the Earth and that warming presents a threat to public health and welfare. The finding is the lynchpin for the agency’s regulations about greenhouse gas pollution under the Clean Air Act. ",
                "Why does he look like a slightly older Mark Zuckerberg?",
                "I can't wait until Lake Erie catches fire again.\n\nIt will be GREAT. Again.\n\nI can't wait until some community somewhere has a 1000% spike in brain cancer because some shit corporation dumped toxic chemicals all around the place.\n\nThese fucking people are genuinely insane.",
                "“We don’t need trees from Canada, we have National Parks”"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "Sandy Hook families ‘no longer see any benefit’ in Alex Jones’ Infowars fight, propose new plan",
            "external_url": "https://www.newstimes.com/news/article/alex-jones-infowars-sandy-hook-families-bankruptcy-20217270.php",
            "upvotes": 465,
            "date": "03/13/2025",
            "thumbnail": "https://s.hdnux.com/photos/01/27/46/40/22964270/5/rawImage.jpg",
            "top_comments": [
                "“In the over three years since (Infowars) and Jones first filed their bankruptcy cases, more than $10 million has been billed by estate professionals in these cases, either defending Jones or responding to objections from Jones … (a)nd yet, the Sandy Hook families have not yet received – and are no closer to receiving – a single dollar,” writes a team of seven attorneys representing the Sandy Hook families. “The Sandy Hook families have determined that the best path for collecting on their judgments against (Infowars) is to work together and pursue remedies in state court, which they will be doing in short order.”",
                "Why Trump hasn't given him a cabinet appointment yet, I'll never know",
                "Why can’t the courts get any money out of Alex Jones? What kind of BS is this",
                "Evan after all this Alex Jones is still only the 4th biggest piece of shit on the planet.",
                "Scum just kept hedging and hedging..",
                "When the President of the United States and the richest man in the world back the person who said you're a paid actor when your child was slaughtered in their school....\n\nI can't even imagine. Maybe it's time to escalate the issue when the legal system no longer has your back.",
                "I figure this will be the next US president the way things are going down there….",
                "American justice for you.",
                "US legal system couldn't hit a cow's arse with a banjo",
                "There are scums and then there is Alex Jones."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "SpaceX scrubs astronaut flight that was to retrieve stuck astronauts",
            "external_url": "https://www.reuters.com/technology/space/spacex-nasa-set-astronaut-flight-that-will-retrieve-stuck-astronauts-2025-03-12/",
            "upvotes": 15073,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "After being in space so long that must be hard for them to hear.  They're tough though, or they wouldn't have been selected.",
                "Delayed for technical reasons. Rescheduled for tomorrow. Happens with launches all the time",
                "How interesting after he spent time shit talking the previous administration and saying that they stranded them up there for political reasons.\n\nEdit. For all of those bitching about how oh it’s only for a day blah blah blah it doesn’t matter. The point is that there are reasons that these things happen and Elon Musk and Donald Trump try to politicize it rather than admitting that fucking shit happens like technical issues. That’s all. I’m calling out the hypocrisy of people who pretended like Biden purposely trapped those people up there and the mighty Donald Trump is going to save them.",
                "Well, it's better than having the rocket blow up.",
                "They obviously aren’t going to take risks. Technical issue is what the article said. Was scrubbed for non political reasons from what I see.",
                "I’m all for taking precautions when it comes to launches. They are still planning the launch in the coming days according to the article.",
                "Shocking. Musk once again taking federal funds and not producing anything",
                "If you follow rocket launches in any way, you’d know that this is a pretty common event. Rockets scrub all the time. Could be weather related, could be some sensor that was slightly off… normally they reattempt 24 hours later.",
                "I'm convinced most of you didn't read the article. The flight was postponed because of technical issues. The endeavor to get the stuck astronauts back wasn't cancelled. It's just a misleading headline to make people rage, which seems to have worked.",
                "What he would be sending up is a new capsule with replacements and supplies. They already have a dragon capsule up there if they need to leave the station but it would only leave the Russian portion manned."
            ],
            "aggregate_sentiment": 58.0
        }
    ],
    "last_updated": "03/13/2025 12:15:55 UTC"
}