{
    "posts": [
        {
            "category": "HOT",
            "title": "George Foreman: Heavyweight boxing legend dies aged 76, says family",
            "external_url": "https://www.bbc.com/news/articles/ckg8ez8201yo",
            "upvotes": 12694,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/05d5/live/82e5e820-06c3-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "[deleted]",
                "R.I.P. George\n\n>George Foreman named all of his five sons \"George Edward Foreman\" as a way to create a sense of unity and shared identity within the family.\n\nThat is going to be one confusing obituary!",
                "RIP legend. Crazy how I wasn’t even into boxing as a kid but still grew up knowing who he was.",
                "Our thoughts are with the George Foremans at this time. ",
                "That grill was so clutch in my college days",
                "Shit. Gotta pull out my old Forman grill and sear up a chicken breast in his memory.",
                "Still set to fight Jake Paul next month.",
                "That's the last of the golden era heavyweights, right? End of an era.",
                "“When we were Kings” is so good if u haven’t seen it.",
                "He was the oldest heavyweight champ in history when he won the belt in 1994 at 45 years old."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "U.S. to revoke legal status of more than a half-million migrants, urges them to self deport",
            "external_url": "https://www.cbsnews.com/news/u-s-to-revoke-legal-status-of-over-a-half-million-migrants-chnv/",
            "upvotes": 9990,
            "date": "03/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/21/f77a5737-9f4d-4bf8-8759-61e97e11ba39/thumbnail/1200x630/732b2e545fbc7cfb3cc1d7a3177155cc/gettyimages-2206282830.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "I feel obliged to point out that Elon Musk and Melanie both worked illegally in the US and on that basis should also be deported. They are deporting folks for that offense, even many years on.",
                "Let’s start with Elon Musk.",
                "\"We don't mind the ones who do it legally\"",
                "He is doing this to up the deportation numbers.  He has run out of undocumented folks.  So now he has to create some new ones by snatching documents away.\n\nThese folks have jobs.  They are paying rent and mortgages. They have started their own businesses.  They are paying taxes.  They have revitalized communities.  They are decent people just trying to live a better life here.  \n\nTrump wants to throw these people out but let white South Africans in.  The racism couldn't be any more overt.",
                "They are so shit at deporting illegal immigrants that they go to legal ones",
                "But I thought they just hated the people here illegally? They kept saying that they were cool with immigrants as long as they do it legally. Were they just lying to mask their racism? Naw...",
                "Is Melania on that list 🤔🤔🤔🤔",
                "An article the other day noted that most of Trump’s immigration policy is currently targeting those who are here legally, but on “borrowed time” due to asylum seeking or refugee status. That is a rapid way to get numbers. The numbers from that policy, and the videos of illegal immigrants being treated inhumanly feeds his sociopath base.\n\nIt should be noted, a lot of posts have been saying, “Is this what you voted for!?” In regards to Cubans seeing Cubans being deported and such. You need to understand: This IS exactly what they voted for. Legal immigrants do not give a shit about their brethren who are not legal. All they see are “illegals” being kicked out of THEIR country that they “earned”. The fact that most MAGA folks would gladly see these same “legal” immigrants kicked out of THEIR country does not even register: Everyone thinks they are one of the “good ones” when it comes to hating immigrants.",
                "That is so fucked up. If you support this for some reason, you're part of an evil empire, full stop. Sending people who did nothing wrong and entered the country legally back to Haiti right now is just purely fucked in the head no empathy psychopath shit. Fucking story-making-up motherfuckers. Just admit you're fucking racist and get it over with. I'm sick of these fucking games where you pretend like you're not.",
                "These are people who came here and followed the rules.  They didn’t sneak across any borders.    They did nothing wrong.   \n\nThe conservatives cant even pretend like this is about respecting the rule of law.   This is just blatant hateful bullshit."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Tate brothers say they have left US to return to Romania",
            "external_url": "https://www.bbc.com/news/articles/cvgw0w7147vo",
            "upvotes": 14941,
            "date": "03/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b815/live/88e93ad0-06bc-11f0-88b7-5556e7b55c5e.jpg",
            "top_comments": [
                "selfies w/ pizza box or it never happened",
                ">\"Innocent men don't run. They clear their name in court.\"\n\nThis guy literally fled to Romania to escape rape charges in the uk.\n\nWhat a fucking dog dong.",
                "And nothing of value was lost. Fuck these twats",
                "They're going back for their court appearance, which was part of the agreement to relax their travel restrictions. That said, I was half-expecting Trump to harbour them.",
                "If I never heard about the Tate brothers again it would make my life better",
                "The only place they should be going is prison. They should never have been allowed to travel here in the first place. Edit: it's also disgusting this dude still has ten MILLION Twitter followers.",
                "Remember, trump wasted time rallying to free these rapists. Time he was supposed to be spending serving the American people. Instead he was fighting for rapists.",
                "[removed]",
                "Bring back oubliettes.",
                "He seems to really take interest in Romania. Wonder if its the secret location of his missing chin."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "US to import eggs from Turkey and South Korea to ease prices",
            "external_url": "https://www.bbc.com/news/articles/c743g135vj9o",
            "upvotes": 3093,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2eb2/live/7b390f80-069b-11f0-ab19-cd63e1c90c04.jpg",
            "top_comments": [
                "By the time it gets to market here they need to rename them century eggs",
                "[removed]",
                "That’s pretty ridiculous considering that Mexico is right next door and has absolutely no issue with any egg shortage whatsoever?",
                "Because nothing does more to make something cheaper than flying it half way around the world.",
                "Shipping them halfway around the world is sure to save money",
                "No word on HOW this will help prices. But who cares it makes a nice headline. \n\n  \nOh and $400 million for farmer relief? Glad we DOGE'd all those socialist programs and cut off the entitled folks!",
                "These eggs better not be brown eggs or they're going straight to Guantanamo Bay.",
                "Hehehe imagine if Americans get turkey eggs instead of eggs\n*from* Turkey because Trump can't read",
                "Would be really funny if Turkey and South Korea imposed tariffs on eggs",
                "I highly doubt the costs associated with importing eggs from that far away could possibly bring a dozen under $10. If only we weren’t destroying our relationships with our neighbors and closest trading partners."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Musk group offers $100 to Wisconsin voters ahead of pivotal state Supreme Court election",
            "external_url": "https://www.cnbc.com/2025/03/21/musk-group-offers-100-to-wisconsin-voters-ahead-of-pivotal-state-supreme-court-election.html",
            "upvotes": 29438,
            "date": "03/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108057782-1730819740490-gettyimages-2182402967-AFP_36LH6F6.jpeg?v=1730819836&w=1920&h=1080",
            "top_comments": [
                "$100 dollars in exchange for your freedom, great deal",
                "George Soros should do the exact same thing so this practice will get banned in one nanosecond.",
                "So he's offering bribes....which is illegal.",
                "Imagine if Democrats paid for votes.\n\nIt would be the end of the world with the MAGA cult. \n\nNone stop 24/7 news coverage of the end of the republic. \n\nBut when Trump and crew do it, perfectly fine.",
                "I would ask how any of this is legal, but apparently everything is legal if no one challenges you on it. He did this during the general election and got away with zero consequences. And got his guy elected. And now that they’re talking about deporting protesters, I don’t know what the fuck we’re supposed to do.",
                "Elon musk is a domestic terrorist",
                "The fact he needs to pay people for their vote suggests that the candidate he supports has no other positive qualifications and cannot win an election based on their merits.",
                "So it sounds like they're paying folks $100 to sign a petition about the upcoming election, which I'm assuming (cynically) is their way of tricking people into voting the way they want.  \n\nReminds me of that time Michael Moore put out an offer to college students that he'd buy them a clean pair of underwear if they registered to vote.  Didn't tell them how to vote, just to register.  And of course the justice system jumped on that with both feet.  Musk is going to get away with this, of course.",
                "Want to do something about it and make your voice heard?\n\nCALL THE WISCONSIN ELECTIONS COMMISSION\n\n608 266 8005\n\nDemand an investigation into this and explain how disgusted you are!",
                "He's such a moron. Gets all teary eyed and wondering why so many people hate him, and then he keeps doing stuff like this.\n\nZero sympathy for him."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "A troubling trend? 4 former and current HCSO deputies take their own lives in last 6 weeks",
            "external_url": "https://abc13.com/post/4-former-current-harris-county-sheriffs-office-deputies-take-own-lives-last-6-weeks/16060117/",
            "upvotes": 439,
            "date": "03/22/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16060176_032025-ktrk-hcso-deputies-img.png?w=1600",
            "top_comments": [
                "Curious what’s going on in this department considering many of its officers have been involved with investigations against them for corruption and organized criminal activity within the last year or so.\n\nhttps://www.fox26houston.com/news/harding-street-raid-charges-dismissed-8-houston-police-officers.amp\n\nhttps://abc13.com/amp/houston-chronicle-unchecked-forces-harris-county-constables-accountability/14603562/",
                "This stinks to high heaven. Those deaths need to be investigated by someone outside that community",
                "Something nasty went down",
                "So who is investigating these \"suicides\"? it sure shouldn't be the same office where they are working.",
                "#Tragic Toll: Four Harris County Officers Take Their Own Lives in Just Six Weeks\n\nQuiet grief has settled over Harris County as the community reels from the shocking loss of four current and former deputies, each taking their own life in the space of just six weeks. The most recent was Deputy Christina Kohler, a well-respected veteran whose death last week was officially ruled a suicide. She was just 37.\n\nKohler had been reported missing, sparking concern across the force. A public alert was issued and the search began. Days later, on 13 March, her body was found. The news stunned friends and colleagues. Just three days after Kohler's death, former deputy Maria Vasquez, who left the sheriff's office in December, also died by apparent suicide. Then, earlier this week, another former deputy, William Bozeman, was found dead. The pattern is as heartbreaking as it is alarming.\n\n“It caught a lot of us by surprise,” said Jose Lopez, president of the Harris County Deputies' Organisation. “One is too many. Two? Three? Yes, it's devastating.”\n\nLopez, who had known two of the fallen deputies for over twenty years, has been helping colleagues come to terms with the grief. He’s also grappling with the death of former deputy Long Nguyen, who took his own life in early February at the age of 58. For Lopez, the pain is personal. For the department, it’s a wake-up call.\n\nThere is growing concern about the toll this profession takes on those who serve. Policing is a job that deals daily with trauma, danger and confrontation. It can grind away at a person’s mental health until there is very little left to give. Dr Thomas McNeese, who heads up the Sheriff's Office Behavioural Health Division, is all too aware of the emotional weight deputies carry. His team offers peer-to-peer support and has been working since 2020 to provide help, but even he admits the past few weeks have been especially hard.\n\n“This profession takes a toll,” said McNeese. “The longer you're in it, the more it changes you.”\n\nLaw enforcement officers have long been known to suffer disproportionately from mental health issues and suicide. The nature of the work, the things they witness, the pressure to remain composed in the face of chaos, it all builds up. McNeese is urging those who are struggling to reach out, to talk, to act.\n\n“Getting help, doing something to not stay stuck, that’s important,” he said.\n\nInside the department, questions are being asked. Despite the resources already in place, Lopez wonders if it is enough. Is there more they could be doing? Is something being missed?\n\n“We can’t help but ask,” he said. “Do we need to take a different approach?”",
                "I want to say someone is covering their tracks, the guilty are taking the easy way out before the hammer falls or a little bit of both.\n\nOn the other hand, suicide is often contagious.",
                "Ah yes, much like how some Russians commit suicide by falling out of windows or two self-inflected shots to the back of the head..  Nothing to see here.",
                "Crazy. All four shot themselves three times in the back.",
                "“Well, the official findings are that it definitely wasn’t one of us,”’ said an HCSO spokesperson. “Not sure we’ll ever know who did it. But we can say with certainty, none of us was involved.”",
                "Let's wait until the number reaches 10 before considering it's not random."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "US blocks Canadian access to cross-border library, sparking outcry",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/21/canada-cross-border-library?CMP=share_btn_url",
            "upvotes": 578,
            "date": "03/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/896590de944abc7f9ddf2c147dceb85b4673350c/0_102_3000_1799/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=312bc3be6ceef427b444ced2c69a4dca",
            "top_comments": [
                "The US government also claimed that people using the library were not wearing suits, hadn’t thanked the US, and weren’t holding the cards.",
                "We’ve officially reached ‘war on literacy’ phase.",
                "For those who don't read past the fold:\n\n\"In a statement to Reuters, a Department of Homeland Security spokesperson said the US was responding to drug trafficking.\n\n“Drug traffickers and smugglers were exploiting the fact that Canadians could use the US entrance without going through customs. We are ending such exploitation by criminals and protecting Americans,” the statement said.\n\nThe department provided no evidence of drug trafficking or smuggling and did not immediately respond to a request for additional information.\"",
                "This Administration is so focused on performative nonsense for the mouth breathing Fox News crowd. It's exhausting.",
                "Can Canada cut off their road access to Alaska?",
                "Killing Education AND pissing off Canada. It's like this is 2 birds with one stone for Trump ",
                "Imagine being able to lie about anything without any consequences. That's what maga people do. We're cooked.",
                "\"Canada blocks access to Alaska\" - Hopefully comes soon",
                "Didn’t the Nazis do that in Germany once upon a time?",
                "bruh they are making me look so bad. embarrassing"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Tesla owners are trading in their EVs at record levels, Edmunds says",
            "external_url": "https://www.cnbc.com/2025/03/20/tesla-owners-are-trading-in-their-evs-at-record-levels-edmunds-says.html",
            "upvotes": 15589,
            "date": "03/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108114358-1741726193117-gettyimages-2203994536-AFP_36ZN8YB.jpeg?v=1742510993&w=1920&h=1080",
            "top_comments": [
                "People trading in their Teslas hurts Elon, because even if the brand doesn’t collapse, it’ll be harder to sell new models because the used surplus will be so huge that the prices will collapse fast on new releases, nobody is going to buy a new model on release year when they can just buy the last years model for a portion of the price when the demand sinks that low. \n\nAnd that’s *if* the company manages to persist into the future.",
                "The people I know who bought Teslas were well off yuppies, liberal and who cared about the environment (mean that in the best way possible).  Teslas are not cheap and the people who bought them did so instead of something like a BMW or Range Rover.  I myself was considering one before I went for a BMW.  \n\nTesla was like the Apple brand of the car world. \n\nAnd Elon just antagonized that entire base.  Those same folks are embarrassed by their purchase now. ",
                "I had one of the first 600 Tesla Model Ys. With taxes, etc., it came out to a pretty penny (north of $60k). It was a fun, engaging car and whoo boy that acceleration was bonkers.\n\nThen the reality set in. I kept trying to push through the inconveniences but damned if they didn’t add up quickly. To whit:\n\n1.) A software update meant to improve the positional accuracy of the map bricked - get this - the A/C system. In the summer. It was literally a guessing game whether the A/C would turn on when I got in the car. Persisted for about 3 months before a patch was rolled out.\n\n2.) The vaunted heat pump quit twice, once in winter (as we were moving across the country). Only a threat of litigation got the service center to replace the unit. Replacing it took the service center nearly a week.\n\n3.) A simple windshield replacement was needed after a rock caused a crack that started spreading. I scheduled service (soonest I could get a spot was 4 weeks out) which got delayed an additional whole month because “Our glass guy is sick,” and yet another whole month because “We don’t have glass.”\n\n4.) At 4 years of ownership, it was found that elements of the sub-frame were developing soon-to-be catastrophic cracks. No, I didn’t rally race it. Yes, I was religious about washing road salt off of it in wintertime. The upper control arm bushing was also “shredded” according to Firestone.\n\nAfter #4 happened, I drove to a dealership that literal same day and traded it in.",
                "Tesla served its original purpose:  making EV's more commonplace.  It's time for them to either go away or fix themselves.",
                "I forgot who in particular said it, but some industry person once said that the best indicator of a downturn of a brand is to take a look at the resale numbers. So inventory rise, and how steep the asking price is. You get those two together - and it's not always merely a supply surge issue - there is something in the underlying that there is no recovering from. \n\nGranted, it would be by far in Tesla's own interest to dump Musk, but the problem won't go away until Musk divests entirely. It must be shown that Musk can not benefit from their own successes - especially one that funded Trump directly.",
                "Gotta do it now before it becomes illegal",
                "\"Hi there, Honest Don Trump here for Musk Motors, or MAGA motors as I like to call it.\n\nWe've got a fire sale a-brewin' and prices are falling faster than Titanic tickets after the iceberg.\n\nWe're located right off the mall, in front of that big white house where I'm standing.\n\nDid I tell you the dashboard looks real neat?\"",
                "Yep, my wife and I just traded her model 3 for a Lucid sedan. We would have 100% stayed with Tesla if not for Mr Dyed Hair Plugs Laminated Face.  Anything I can do to bring about his destruction, I am here for.  This is the start of the class wars.  Choose a side.",
                "https://imgur.com/gallery/z5oA7RV\n\n0% APR Cars because nobody wants a Tesla rn\n\nCan't even give these away with 0% apr and a $7500 tax credit\n\nLol.",
                "Poorly ran company without leadership or any quality control standards on their products. Actively dangerous auto driver system linked to dozens of deaths. \n\nNo idea why anyone would want to own a Tesla right now. They’re like BlackBerry. They’re product is only popular because it was first, not because it’s the best. "
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Anti-Vaxx Mom Whose Daughter Died From Measles Says Disease 'Wasn't That Bad'",
            "external_url": "https://www.latintimes.com/anti-vaxx-mom-whose-daughter-died-measles-says-disease-wasnt-that-bad-578871",
            "upvotes": 39109,
            "date": "03/21/2025",
            "thumbnail": "https://d.latintimes.com/en/full/571807/measles-texas.jpg",
            "top_comments": [
                ">they argued that if measles patients had access to untested treatments, the MMR vaccines would be entirely unnecessary\n\nOf course we need untested treatments because the tested and safe prevention is the problem.",
                "\"Wasn't that bad\"?\n\nIf dead children isn't that bad, what the fuck *IS* that bad?!",
                "How is this not considered child endangerment and neglect?",
                "When there is scientific proof that a medical treatment can save lives, and you still decide against, you should be held accountable. Regardless of their religious beliefs, these parents killed their child and should be convicted. This was a preventable death.",
                "Had some absolute idiot on another thread arguing that a parents opinion on their child's medical care is as valuable as a doctors and like just no, giving birth does not magically imbue you with extra knowledge or critical thinking skills.",
                "It’s beyond sad when political bias and an almost religious fervor towards conspiracy theory makes you belittle even the death of your own child.\n\nEdit: spelling",
                "# 'Wasn't That Bad'\n\nfor me",
                "How do you reason with people who will watch their kids die to “own the libs”.",
                ">Hailing from the Mennonite community\n\nTIL if your kid dies due to neglect, you can just claim that your mythological beliefs are more important than the kids life.",
                "God this country fucking sucks right now."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "George Foreman, heavyweight boxing champion, dies at 76",
            "external_url": "https://www.nbcnews.com/news/obituaries/george-foreman-heavyweight-boxing-champion-dies-76-rcna197589",
            "upvotes": 588,
            "date": "03/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250321-george-foreman-obit-1974-ac-1017p-e05d7c.jpg",
            "top_comments": [
                "Thanks for all the burgers, George",
                "That grill was a game changer during the college years.",
                "Very sad news my condolences. One of the truly great in sport and humanity.",
                "He knocked out the fat.",
                "RIP Big George! Had your grill back in the day, you will forever be an icon.",
                "The air fryer killed him, but his name will live on in perpetuity. Bc he named all his kids George.",
                "\"I'm so proud of it, I put my name on it!\"",
                "He was a great entertainer and showman.\n\nLoved his boxing more tho.\n\nHis unorthodox guard and the feet lifting from the floor of his opponents was great!\n\nMaybe the hardest hiting man on the planet?",
                "Our thoughts are with all George Foremans.",
                "Georgemen grill memes incoming 🔥 🔥 🔥"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Global Happiness Rankings 2025: Finland Leads Again, India Shows Positive Growth",
            "external_url": "https://www.goodreturns.in/news/global-happiness-rankings-2025-finland-leads-again-india-shows-positive-growth-1413477.html",
            "upvotes": 2,
            "date": "03/22/2025",
            "thumbnail": "https://images.goodreturns.in/img/2025/03/finland-1742626177.jpg",
            "top_comments": [
                "https://youtu.be/itEamKJuY28?si=6ljqictbT6ALnj6x",
                ">The United States dropped out of the top 20 list, ranking at No.24 this year.\n\nStill feels high, must have not asked recently. Let's see where we are after a whole year of this lunatic regime"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "RIP George 8(",
            "external_url": "https://apnews.com/article/george-foreman-obituary-boxing-891330d63b5b0eb7b62ec98e0c730fef",
            "upvotes": 0,
            "date": "03/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I have unironically fond memories of my grandma experimenting with the countertop George Foreman grill someone gifted her. Thank you for your contribution to happy moments in my life, Mr. Foreman.",
                "Aside from that overpriced grill, he was a good man.\n\nRIP."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "NEW",
            "title": "A troubling trend? 4 former and current HCSO deputies take their own lives in last 6 weeks",
            "external_url": "https://abc13.com/post/4-former-current-harris-county-sheriffs-office-deputies-take-own-lives-last-6-weeks/16060117/",
            "upvotes": 440,
            "date": "03/22/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16060176_032025-ktrk-hcso-deputies-img.png?w=1600",
            "top_comments": [
                "Curious what’s going on in this department considering many of its officers have been involved with investigations against them for corruption and organized criminal activity within the last year or so.\n\nhttps://www.fox26houston.com/news/harding-street-raid-charges-dismissed-8-houston-police-officers.amp\n\nhttps://abc13.com/amp/houston-chronicle-unchecked-forces-harris-county-constables-accountability/14603562/",
                "This stinks to high heaven. Those deaths need to be investigated by someone outside that community",
                "Something nasty went down",
                "So who is investigating these \"suicides\"? it sure shouldn't be the same office where they are working.",
                "#Tragic Toll: Four Harris County Officers Take Their Own Lives in Just Six Weeks\n\nQuiet grief has settled over Harris County as the community reels from the shocking loss of four current and former deputies, each taking their own life in the space of just six weeks. The most recent was Deputy Christina Kohler, a well-respected veteran whose death last week was officially ruled a suicide. She was just 37.\n\nKohler had been reported missing, sparking concern across the force. A public alert was issued and the search began. Days later, on 13 March, her body was found. The news stunned friends and colleagues. Just three days after Kohler's death, former deputy Maria Vasquez, who left the sheriff's office in December, also died by apparent suicide. Then, earlier this week, another former deputy, William Bozeman, was found dead. The pattern is as heartbreaking as it is alarming.\n\n“It caught a lot of us by surprise,” said Jose Lopez, president of the Harris County Deputies' Organisation. “One is too many. Two? Three? Yes, it's devastating.”\n\nLopez, who had known two of the fallen deputies for over twenty years, has been helping colleagues come to terms with the grief. He’s also grappling with the death of former deputy Long Nguyen, who took his own life in early February at the age of 58. For Lopez, the pain is personal. For the department, it’s a wake-up call.\n\nThere is growing concern about the toll this profession takes on those who serve. Policing is a job that deals daily with trauma, danger and confrontation. It can grind away at a person’s mental health until there is very little left to give. Dr Thomas McNeese, who heads up the Sheriff's Office Behavioural Health Division, is all too aware of the emotional weight deputies carry. His team offers peer-to-peer support and has been working since 2020 to provide help, but even he admits the past few weeks have been especially hard.\n\n“This profession takes a toll,” said McNeese. “The longer you're in it, the more it changes you.”\n\nLaw enforcement officers have long been known to suffer disproportionately from mental health issues and suicide. The nature of the work, the things they witness, the pressure to remain composed in the face of chaos, it all builds up. McNeese is urging those who are struggling to reach out, to talk, to act.\n\n“Getting help, doing something to not stay stuck, that’s important,” he said.\n\nInside the department, questions are being asked. Despite the resources already in place, Lopez wonders if it is enough. Is there more they could be doing? Is something being missed?\n\n“We can’t help but ask,” he said. “Do we need to take a different approach?”",
                "I want to say someone is covering their tracks, the guilty are taking the easy way out before the hammer falls or a little bit of both.\n\nOn the other hand, suicide is often contagious.",
                "Ah yes, much like how some Russians commit suicide by falling out of windows or two self-inflected shots to the back of the head..  Nothing to see here.",
                "Crazy. All four shot themselves three times in the back.",
                "“Well, the official findings are that it definitely wasn’t one of us,”’ said an HCSO spokesperson. “Not sure we’ll ever know who did it. But we can say with certainty, none of us was involved.”",
                "Let's wait until the number reaches 10 before considering it's not random."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Nasa drops plan to land first woman and first person of color on the moon",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/21/nasa-drops-plan-first-woman-moon",
            "upvotes": 405,
            "date": "03/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/aac07bc3d883357f77e67ceb6bb53fc3c2f780a4/0_0_5000_3001/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b698ce2e793d534258c22be90188bb91",
            "top_comments": [
                "How about djt and JD become the first us president/VP to be sent to the moon?",
                "This is a poorly worded and a clickbait title. NASA did not drop the plan— they adjusted the verbiage on their website. Victor Glover and Christina Koch are still on the mission, per the last paragraph of the article. I think it is stupid to adjust the website verbiage, but it is also important to call out yellow journalism.",
                "Well since we’re joining the British Commonwealth apparently, I assume the next person on the moon will no doubt be British.",
                "I’m going to be honest, I don’t think they should have said that in first place. There are more than enough highly qualified women and people of color that they could have just picked and most people wouldn’t bat an eye. Explicitly stating before selecting the astronauts that they were going to choose a woman and POC leaves the wrong impression and is exactly the sort of thing that turns people off DEI.",
                "Let's be real, nobody is going back to the moon. Everyone will be busy spending money killing each other. 🚀",
                "Finally, white men will have their time to shine.   /s",
                "Wooohoo the legacy of pasty white men with fragile egos lives on",
                "Fuck them all. This is so shameful. I really don’t think that there is a single portion of society that he has not managed to fuck over.",
                "Can nasa send trump and elon to the sun",
                "I hate the way the media frames this. More than likely this wasn’t about landing the first female woman of color on the moon, she was just the most qualified candidate. "
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "US gets eggs from Turkey and South Korea",
            "external_url": "https://www.bbc.com/news/articles/c743g135vj9o.amp",
            "upvotes": 0,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2eb2/live/7b390f80-069b-11f0-ab19-cd63e1c90c04.jpg",
            "top_comments": [
                "These won’t be going straight to grocery shelves.  Don’t kid yourself.  It won’t save us a dime.",
                "Most likely for the industry to make processed food.",
                "That’s because everyone else told them to fuck off.",
                "Canadians have some eggs for you.",
                "So the US is transitioning to turkey eggs?",
                "Turkey eggs?  Do they taste the same?",
                "USA should produce its own eggs and leave the world alone.",
                "[https://youtu.be/i7Z6Y0YNQGg?si=87RhXrDBr-Vus271](https://youtu.be/i7Z6Y0YNQGg?si=87RhXrDBr-Vus271)",
                "Trump will tariff them and claim he made us rich.",
                "I’m so sick of hearing about eggs"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "US blocks Canadian access to cross-border library, sparking outcry",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/21/canada-cross-border-library?CMP=share_btn_url",
            "upvotes": 581,
            "date": "03/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/896590de944abc7f9ddf2c147dceb85b4673350c/0_102_3000_1799/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=312bc3be6ceef427b444ced2c69a4dca",
            "top_comments": [
                "The US government also claimed that people using the library were not wearing suits, hadn’t thanked the US, and weren’t holding the cards.",
                "We’ve officially reached ‘war on literacy’ phase.",
                "For those who don't read past the fold:\n\n\"In a statement to Reuters, a Department of Homeland Security spokesperson said the US was responding to drug trafficking.\n\n“Drug traffickers and smugglers were exploiting the fact that Canadians could use the US entrance without going through customs. We are ending such exploitation by criminals and protecting Americans,” the statement said.\n\nThe department provided no evidence of drug trafficking or smuggling and did not immediately respond to a request for additional information.\"",
                "This Administration is so focused on performative nonsense for the mouth breathing Fox News crowd. It's exhausting.",
                "Can Canada cut off their road access to Alaska?",
                "Killing Education AND pissing off Canada. It's like this is 2 birds with one stone for Trump ",
                "Imagine being able to lie about anything without any consequences. That's what maga people do. We're cooked.",
                "\"Canada blocks access to Alaska\" - Hopefully comes soon",
                "Didn’t the Nazis do that in Germany once upon a time?",
                "bruh they are making me look so bad. embarrassing"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "13 year old boy shoots and kills 14 year old girl in Baytown just outside of Houston, Texas.",
            "external_url": "https://www.click2houston.com/news/local/2025/03/21/teenage-boy-shoots-kills-girl-at-baytown-apartment-complex-playground-following-school-bus-altercation/",
            "upvotes": 225,
            "date": "03/22/2025",
            "thumbnail": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/EE4SV5JBWNCHJDNBWSENDAHNSQ.png?_a=DATAdtfiZAA0",
            "top_comments": [
                "Over an altercation on the bus? Fuck, my kid had an altercation on the bus yesterday. I'm glad no child related to it is DEAD. I hate reading the news most days now.",
                "At the very least, an adult somewhere adjacent to that event should go to prison for making the gun available. (whether deliberately or through negligence)",
                "This is so sad. Parents should be charged for not safely securing a firearm.",
                "Uh it's 2025. Dead kids don't matter, only unaware unliving unthinking clumps of fetal tissue.",
                "Baytown is a rough place. Cheap developments overlap rural ghettos, overshadowed by refineries.",
                "From a statistical perspective are shootings done by children increasing?",
                "Oh, Texas. We have tried nothing and are all out of ideas on how to solve gun issues, but we can come up with bills like the Furries Act. \n\n\nMay that poor girl rest in peace, and hopefully her family gets all of the support they need to process their grief. ",
                "Guns readily available are not the issue. \n\nApparently. \n\nFuck this timeline. \n\n(Am a multiple gun owner and tired of this shit.)",
                "The good guys with their guns couldn’t stop this?",
                "Murder is murder. He should be tried as an adult"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "George Foreman, heavyweight boxing champion, dies at 76",
            "external_url": "https://www.nbcnews.com/news/obituaries/george-foreman-heavyweight-boxing-champion-dies-76-rcna197589",
            "upvotes": 594,
            "date": "03/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250321-george-foreman-obit-1974-ac-1017p-e05d7c.jpg",
            "top_comments": [
                "Thanks for all the burgers, George",
                "That grill was a game changer during the college years.",
                "Very sad news my condolences. One of the truly great in sport and humanity.",
                "He knocked out the fat.",
                "RIP Big George! Had your grill back in the day, you will forever be an icon.",
                "The air fryer killed him, but his name will live on in perpetuity. Bc he named all his kids George.",
                "\"I'm so proud of it, I put my name on it!\"",
                "He was a great entertainer and showman.\n\nLoved his boxing more tho.\n\nHis unorthodox guard and the feet lifting from the floor of his opponents was great!\n\nMaybe the hardest hiting man on the planet?",
                "Our thoughts are with all George Foremans.",
                "Georgemen grill memes incoming 🔥 🔥 🔥"
            ],
            "aggregate_sentiment": 73.0
        },
        {
            "category": "NEW",
            "title": "George Foreman: Heavyweight boxing legend dies aged 76, says family",
            "external_url": "https://www.bbc.com/news/articles/ckg8ez8201yo",
            "upvotes": 12693,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/05d5/live/82e5e820-06c3-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "[deleted]",
                "R.I.P. George\n\n>George Foreman named all of his five sons \"George Edward Foreman\" as a way to create a sense of unity and shared identity within the family.\n\nThat is going to be one confusing obituary!",
                "RIP legend. Crazy how I wasn’t even into boxing as a kid but still grew up knowing who he was.",
                "Our thoughts are with the George Foremans at this time. ",
                "That grill was so clutch in my college days",
                "Shit. Gotta pull out my old Forman grill and sear up a chicken breast in his memory.",
                "Still set to fight Jake Paul next month.",
                "That's the last of the golden era heavyweights, right? End of an era.",
                "“When we were Kings” is so good if u haven’t seen it.",
                "He was the oldest heavyweight champ in history when he won the belt in 1994 at 45 years old."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "US to import eggs from Turkey and South Korea to ease prices",
            "external_url": "https://www.bbc.com/news/articles/c743g135vj9o",
            "upvotes": 3096,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2eb2/live/7b390f80-069b-11f0-ab19-cd63e1c90c04.jpg",
            "top_comments": [
                "By the time it gets to market here they need to rename them century eggs",
                "[removed]",
                "That’s pretty ridiculous considering that Mexico is right next door and has absolutely no issue with any egg shortage whatsoever?",
                "Because nothing does more to make something cheaper than flying it half way around the world.",
                "Shipping them halfway around the world is sure to save money",
                "No word on HOW this will help prices. But who cares it makes a nice headline. \n\n  \nOh and $400 million for farmer relief? Glad we DOGE'd all those socialist programs and cut off the entitled folks!",
                "These eggs better not be brown eggs or they're going straight to Guantanamo Bay.",
                "Hehehe imagine if Americans get turkey eggs instead of eggs\n*from* Turkey because Trump can't read",
                "Would be really funny if Turkey and South Korea imposed tariffs on eggs",
                "I highly doubt the costs associated with importing eggs from that far away could possibly bring a dozen under $10. If only we weren’t destroying our relationships with our neighbors and closest trading partners."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "US blocks Canadian access to cross-border library, sparking outcry",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/21/canada-cross-border-library?CMP=share_btn_url",
            "upvotes": 583,
            "date": "03/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/896590de944abc7f9ddf2c147dceb85b4673350c/0_102_3000_1799/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=312bc3be6ceef427b444ced2c69a4dca",
            "top_comments": [
                "The US government also claimed that people using the library were not wearing suits, hadn’t thanked the US, and weren’t holding the cards.",
                "We’ve officially reached ‘war on literacy’ phase.",
                "For those who don't read past the fold:\n\n\"In a statement to Reuters, a Department of Homeland Security spokesperson said the US was responding to drug trafficking.\n\n“Drug traffickers and smugglers were exploiting the fact that Canadians could use the US entrance without going through customs. We are ending such exploitation by criminals and protecting Americans,” the statement said.\n\nThe department provided no evidence of drug trafficking or smuggling and did not immediately respond to a request for additional information.\"",
                "This Administration is so focused on performative nonsense for the mouth breathing Fox News crowd. It's exhausting.",
                "Can Canada cut off their road access to Alaska?",
                "Killing Education AND pissing off Canada. It's like this is 2 birds with one stone for Trump ",
                "Imagine being able to lie about anything without any consequences. That's what maga people do. We're cooked.",
                "\"Canada blocks access to Alaska\" - Hopefully comes soon",
                "Didn’t the Nazis do that in Germany once upon a time?",
                "bruh they are making me look so bad. embarrassing"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "George Foreman: Heavyweight boxing legend dies aged 76, says family",
            "external_url": "https://www.bbc.com/news/articles/ckg8ez8201yo",
            "upvotes": 12697,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/05d5/live/82e5e820-06c3-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "[deleted]",
                "R.I.P. George\n\n>George Foreman named all of his five sons \"George Edward Foreman\" as a way to create a sense of unity and shared identity within the family.\n\nThat is going to be one confusing obituary!",
                "RIP legend. Crazy how I wasn’t even into boxing as a kid but still grew up knowing who he was.",
                "Our thoughts are with the George Foremans at this time. ",
                "That grill was so clutch in my college days",
                "Shit. Gotta pull out my old Forman grill and sear up a chicken breast in his memory.",
                "Still set to fight Jake Paul next month.",
                "That's the last of the golden era heavyweights, right? End of an era.",
                "“When we were Kings” is so good if u haven’t seen it.",
                "He was the oldest heavyweight champ in history when he won the belt in 1994 at 45 years old."
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "RISING",
            "title": "Nasa drops plan to land first woman and first person of color on the moon",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/21/nasa-drops-plan-first-woman-moon",
            "upvotes": 407,
            "date": "03/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/aac07bc3d883357f77e67ceb6bb53fc3c2f780a4/0_0_5000_3001/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b698ce2e793d534258c22be90188bb91",
            "top_comments": [
                "How about djt and JD become the first us president/VP to be sent to the moon?",
                "This is a poorly worded and a clickbait title. NASA did not drop the plan— they adjusted the verbiage on their website. Victor Glover and Christina Koch are still on the mission, per the last paragraph of the article. I think it is stupid to adjust the website verbiage, but it is also important to call out yellow journalism.",
                "Well since we’re joining the British Commonwealth apparently, I assume the next person on the moon will no doubt be British.",
                "I’m going to be honest, I don’t think they should have said that in first place. There are more than enough highly qualified women and people of color that they could have just picked and most people wouldn’t bat an eye. Explicitly stating before selecting the astronauts that they were going to choose a woman and POC leaves the wrong impression and is exactly the sort of thing that turns people off DEI.",
                "Let's be real, nobody is going back to the moon. Everyone will be busy spending money killing each other. 🚀",
                "Finally, white men will have their time to shine.   /s",
                "Wooohoo the legacy of pasty white men with fragile egos lives on",
                "Fuck them all. This is so shameful. I really don’t think that there is a single portion of society that he has not managed to fuck over.",
                "Can nasa send trump and elon to the sun",
                "I hate the way the media frames this. More than likely this wasn’t about landing the first female woman of color on the moon, she was just the most qualified candidate. "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "George Foreman, heavyweight boxing champion, dies at 76",
            "external_url": "https://www.nbcnews.com/news/obituaries/george-foreman-heavyweight-boxing-champion-dies-76-rcna197589",
            "upvotes": 591,
            "date": "03/22/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250321-george-foreman-obit-1974-ac-1017p-e05d7c.jpg",
            "top_comments": [
                "Thanks for all the burgers, George",
                "That grill was a game changer during the college years.",
                "Very sad news my condolences. One of the truly great in sport and humanity.",
                "He knocked out the fat.",
                "RIP Big George! Had your grill back in the day, you will forever be an icon.",
                "The air fryer killed him, but his name will live on in perpetuity. Bc he named all his kids George.",
                "\"I'm so proud of it, I put my name on it!\"",
                "He was a great entertainer and showman.\n\nLoved his boxing more tho.\n\nHis unorthodox guard and the feet lifting from the floor of his opponents was great!\n\nMaybe the hardest hiting man on the planet?",
                "Our thoughts are with all George Foremans.",
                "Georgemen grill memes incoming 🔥 🔥 🔥"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "A troubling trend? 4 former and current HCSO deputies take their own lives in last 6 weeks",
            "external_url": "https://abc13.com/post/4-former-current-harris-county-sheriffs-office-deputies-take-own-lives-last-6-weeks/16060117/",
            "upvotes": 440,
            "date": "03/22/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16060176_032025-ktrk-hcso-deputies-img.png?w=1600",
            "top_comments": [
                "Curious what’s going on in this department considering many of its officers have been involved with investigations against them for corruption and organized criminal activity within the last year or so.\n\nhttps://www.fox26houston.com/news/harding-street-raid-charges-dismissed-8-houston-police-officers.amp\n\nhttps://abc13.com/amp/houston-chronicle-unchecked-forces-harris-county-constables-accountability/14603562/",
                "This stinks to high heaven. Those deaths need to be investigated by someone outside that community",
                "Something nasty went down",
                "So who is investigating these \"suicides\"? it sure shouldn't be the same office where they are working.",
                "#Tragic Toll: Four Harris County Officers Take Their Own Lives in Just Six Weeks\n\nQuiet grief has settled over Harris County as the community reels from the shocking loss of four current and former deputies, each taking their own life in the space of just six weeks. The most recent was Deputy Christina Kohler, a well-respected veteran whose death last week was officially ruled a suicide. She was just 37.\n\nKohler had been reported missing, sparking concern across the force. A public alert was issued and the search began. Days later, on 13 March, her body was found. The news stunned friends and colleagues. Just three days after Kohler's death, former deputy Maria Vasquez, who left the sheriff's office in December, also died by apparent suicide. Then, earlier this week, another former deputy, William Bozeman, was found dead. The pattern is as heartbreaking as it is alarming.\n\n“It caught a lot of us by surprise,” said Jose Lopez, president of the Harris County Deputies' Organisation. “One is too many. Two? Three? Yes, it's devastating.”\n\nLopez, who had known two of the fallen deputies for over twenty years, has been helping colleagues come to terms with the grief. He’s also grappling with the death of former deputy Long Nguyen, who took his own life in early February at the age of 58. For Lopez, the pain is personal. For the department, it’s a wake-up call.\n\nThere is growing concern about the toll this profession takes on those who serve. Policing is a job that deals daily with trauma, danger and confrontation. It can grind away at a person’s mental health until there is very little left to give. Dr Thomas McNeese, who heads up the Sheriff's Office Behavioural Health Division, is all too aware of the emotional weight deputies carry. His team offers peer-to-peer support and has been working since 2020 to provide help, but even he admits the past few weeks have been especially hard.\n\n“This profession takes a toll,” said McNeese. “The longer you're in it, the more it changes you.”\n\nLaw enforcement officers have long been known to suffer disproportionately from mental health issues and suicide. The nature of the work, the things they witness, the pressure to remain composed in the face of chaos, it all builds up. McNeese is urging those who are struggling to reach out, to talk, to act.\n\n“Getting help, doing something to not stay stuck, that’s important,” he said.\n\nInside the department, questions are being asked. Despite the resources already in place, Lopez wonders if it is enough. Is there more they could be doing? Is something being missed?\n\n“We can’t help but ask,” he said. “Do we need to take a different approach?”",
                "I want to say someone is covering their tracks, the guilty are taking the easy way out before the hammer falls or a little bit of both.\n\nOn the other hand, suicide is often contagious.",
                "Ah yes, much like how some Russians commit suicide by falling out of windows or two self-inflected shots to the back of the head..  Nothing to see here.",
                "Crazy. All four shot themselves three times in the back.",
                "“Well, the official findings are that it definitely wasn’t one of us,”’ said an HCSO spokesperson. “Not sure we’ll ever know who did it. But we can say with certainty, none of us was involved.”",
                "Let's wait until the number reaches 10 before considering it's not random."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "U.S. to revoke legal status of more than a half-million migrants, urges them to self deport",
            "external_url": "https://www.cbsnews.com/news/u-s-to-revoke-legal-status-of-over-a-half-million-migrants-chnv/",
            "upvotes": 9993,
            "date": "03/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/21/f77a5737-9f4d-4bf8-8759-61e97e11ba39/thumbnail/1200x630/732b2e545fbc7cfb3cc1d7a3177155cc/gettyimages-2206282830.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "I feel obliged to point out that Elon Musk and Melanie both worked illegally in the US and on that basis should also be deported. They are deporting folks for that offense, even many years on.",
                "Let’s start with Elon Musk.",
                "\"We don't mind the ones who do it legally\"",
                "He is doing this to up the deportation numbers.  He has run out of undocumented folks.  So now he has to create some new ones by snatching documents away.\n\nThese folks have jobs.  They are paying rent and mortgages. They have started their own businesses.  They are paying taxes.  They have revitalized communities.  They are decent people just trying to live a better life here.  \n\nTrump wants to throw these people out but let white South Africans in.  The racism couldn't be any more overt.",
                "They are so shit at deporting illegal immigrants that they go to legal ones",
                "But I thought they just hated the people here illegally? They kept saying that they were cool with immigrants as long as they do it legally. Were they just lying to mask their racism? Naw...",
                "Is Melania on that list 🤔🤔🤔🤔",
                "An article the other day noted that most of Trump’s immigration policy is currently targeting those who are here legally, but on “borrowed time” due to asylum seeking or refugee status. That is a rapid way to get numbers. The numbers from that policy, and the videos of illegal immigrants being treated inhumanly feeds his sociopath base.\n\nIt should be noted, a lot of posts have been saying, “Is this what you voted for!?” In regards to Cubans seeing Cubans being deported and such. You need to understand: This IS exactly what they voted for. Legal immigrants do not give a shit about their brethren who are not legal. All they see are “illegals” being kicked out of THEIR country that they “earned”. The fact that most MAGA folks would gladly see these same “legal” immigrants kicked out of THEIR country does not even register: Everyone thinks they are one of the “good ones” when it comes to hating immigrants.",
                "That is so fucked up. If you support this for some reason, you're part of an evil empire, full stop. Sending people who did nothing wrong and entered the country legally back to Haiti right now is just purely fucked in the head no empathy psychopath shit. Fucking story-making-up motherfuckers. Just admit you're fucking racist and get it over with. I'm sick of these fucking games where you pretend like you're not.",
                "These are people who came here and followed the rules.  They didn’t sneak across any borders.    They did nothing wrong.   \n\nThe conservatives cant even pretend like this is about respecting the rule of law.   This is just blatant hateful bullshit."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "13 year old boy shoots and kills 14 year old girl in Baytown just outside of Houston, Texas.",
            "external_url": "https://www.click2houston.com/news/local/2025/03/21/teenage-boy-shoots-kills-girl-at-baytown-apartment-complex-playground-following-school-bus-altercation/",
            "upvotes": 229,
            "date": "03/22/2025",
            "thumbnail": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/EE4SV5JBWNCHJDNBWSENDAHNSQ.png?_a=DATAdtfiZAA0",
            "top_comments": [
                "Over an altercation on the bus? Fuck, my kid had an altercation on the bus yesterday. I'm glad no child related to it is DEAD. I hate reading the news most days now.",
                "At the very least, an adult somewhere adjacent to that event should go to prison for making the gun available. (whether deliberately or through negligence)",
                "This is so sad. Parents should be charged for not safely securing a firearm.",
                "Uh it's 2025. Dead kids don't matter, only unaware unliving unthinking clumps of fetal tissue.",
                "Baytown is a rough place. Cheap developments overlap rural ghettos, overshadowed by refineries.",
                "From a statistical perspective are shootings done by children increasing?",
                "Oh, Texas. We have tried nothing and are all out of ideas on how to solve gun issues, but we can come up with bills like the Furries Act. \n\n\nMay that poor girl rest in peace, and hopefully her family gets all of the support they need to process their grief. ",
                "Guns readily available are not the issue. \n\nApparently. \n\nFuck this timeline. \n\n(Am a multiple gun owner and tired of this shit.)",
                "The good guys with their guns couldn’t stop this?",
                "Murder is murder. He should be tried as an adult"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "US to import eggs from Turkey and South Korea to ease prices",
            "external_url": "https://www.bbc.com/news/articles/c743g135vj9o",
            "upvotes": 3103,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2eb2/live/7b390f80-069b-11f0-ab19-cd63e1c90c04.jpg",
            "top_comments": [
                "By the time it gets to market here they need to rename them century eggs",
                "[removed]",
                "That’s pretty ridiculous considering that Mexico is right next door and has absolutely no issue with any egg shortage whatsoever?",
                "Because nothing does more to make something cheaper than flying it half way around the world.",
                "Shipping them halfway around the world is sure to save money",
                "No word on HOW this will help prices. But who cares it makes a nice headline. \n\n  \nOh and $400 million for farmer relief? Glad we DOGE'd all those socialist programs and cut off the entitled folks!",
                "These eggs better not be brown eggs or they're going straight to Guantanamo Bay.",
                "Hehehe imagine if Americans get turkey eggs instead of eggs\n*from* Turkey because Trump can't read",
                "Would be really funny if Turkey and South Korea imposed tariffs on eggs",
                "I highly doubt the costs associated with importing eggs from that far away could possibly bring a dozen under $10. If only we weren’t destroying our relationships with our neighbors and closest trading partners."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Columbia agrees to government demands in bid to restore funding",
            "external_url": "https://www.reuters.com/world/us/columbia-research-takes-immediate-hit-trump-funding-cuts-2025-03-21/",
            "upvotes": 495,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "At least the silver lining in this miserable timeline is quickly exposing just how many spineless cowards are amongst us.",
                "“Hires special officers that are allowed to make on campus arrests” \n\nAmerica sure loves their freedom.",
                "There's no point in capitulating to the demands of this government. They don't have any honor and will pull the rug on anything they don't like regardless of what is agreed to.\n\nIt's also not a good look to cave to a fascist regime.",
                "Turns out the Ivory Tower was just as much of a facade as the Shining City on the Hill.",
                "MAGA hates the college educated. It doesn't matter what Columbia does. The Trump administration will just find something else to hold money over.",
                "\"The New York-based university, acquiescing to the demands in a memo released on Friday, laid out plans to ban face masks on campus, empower security officers to remove or arrest individuals, and place a new official in charge of the department that offers courses on the Middle East.\"\n\n\nImagine losing 400 million because you allow students to wear face maks...",
                "I really hope the other universities and colleges grow a spine and challenge trump in court ..",
                "I'm sure this school that offers polysci and law programs won't face any consequences from their students for supporting the anti-law guy",
                "and they just became a satellite campus of Liberty University.",
                "Columbia has an almost $15BN endowment. The worst kind of cowards."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Man found with a live turtle concealed in his pants by TSA at a New Jersey airport",
            "external_url": "https://apnews.com/article/turtle-pants-airport-tsa-newark-airport-pennsylvania-f55bd62d33530e9cfd26488e230ad8df",
            "upvotes": 238,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is that a live turtle in your pants or are you just happy to see me?",
                "Mitch McConnell sure is getting adventurous in his old age...",
                "Should have bit his dick off",
                "Now I have to know why. What are the rest of us missing?",
                "A shell of a good time.",
                "A 'support' turtle no doubt. ",
                "So they have found the almighty ass digger.",
                "This is the same story from last week. Since it was at Newark, I did check the link to see if it was a repost or it happened again.",
                "I mean you can’t drown a turtle \n\nObviously /s ❤️\n\nEdit to add- that poor dog :(",
                "Are you happy to visit New Jersey or is that a turtle in your pants?"
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "03/22/2025 08:10:16 UTC"
}