{
    "posts": [
        {
            "category": "HOT",
            "title": "Cincinnati police fatally shot an armed 18-year-old. The next day, his father killed a sheriff’s deputy, authorities say | CNN",
            "external_url": "https://www.cnn.com/2025/05/03/us/ohio-rodney-hinton-jr-arrest-hnk",
            "upvotes": 15070,
            "date": "05/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21594534-32264-561-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "To be clear, the sheriff that was killed was not connected to the shooting of the 18 year old.  The father snapped and ran over a sheriff directing traffic.  He watched the body cam video of his son's death and lost it.\n\nSad day for everyone involved",
                "He killed him by running into him full speed while he was directing traffic for UC’s graduation…",
                "The Sheriff that was killed was doing traffic duty for university of Cincinnati graduation. Heard he was close to retirement.\n\nEdit: already retired and was just helping with traffic",
                "Very sad story the cop wasn't even involved",
                "*”One of the officers shot the 18-year-old as he emerged from between two dumpsters, the body cam video showed. On the footage, moments before the shooting another officer can be heard yelling, ‘He’s got a gun! He’s got a gun! On your right! On your right!’*\n\n*The officer said after the shooting that the 18-year-old appeared to point the gun at him, according to Theetge.*”\n\n**If**(!!!) this is true it sounds about as justified as it can get.\n\nNot to mention the cop he killed was just some random guy directing traffic… I’ll wait until more evidence comes out before forming an opinion of the son but the dad sounds like an absolute POS.\n\nEdit: also the guy he killed was a retired reserve cop. The dude was just an old man that probably just wanted to do something to keep himself busy. One of my coworkers does this kind of thing. He’s in his 60s and dresses up like a cop every two months to direct traffic at football games lol. I’m not convinced he even gets paid to do it",
                "My advice to others here: I once got into an argument on Reddit with someone who argued that police shooting/killing an active shooter was extrajudicial punishment/illegal murder and was wrong. Just post your comment and move on, do not engage! It's not worth the time!",
                "Armed car thief get shot, his father road kills unrelated officer in rage outburst.\n\nHere you go.",
                "that's a real shitty situation all around.",
                "I can’t believe how a lot of people are blaming cops for this. This guy’s son stole a car. When get caught instead of surrendering he try to run with a gun in his hand. What do you expect a cop to do? Just wait and let him shoot at them??? \nand the next day his dad go and killed a random cop??? I just can’t believe how people are justifying this.",
                "So a guy is killed by police while brandishing a firearm in the commission of a felony and his father responds by murdering a cop who had nothing to do with it, yeah that family sounds like a great value to society"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Sheinbaum says she rejected Trumps offer to send troops to Mexico",
            "external_url": "https://www.reuters.com/world/americas/sheinbaum-says-she-rejected-trumps-offer-send-troops-mexico-2025-05-03/",
            "upvotes": 3041,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was told Donald Trump was the anti-war, anti-Imperialist President.  Hmm 🤔",
                "The cartels are already armed with American weapons.",
                ">\"In one of the calls, (Trump) said, 'How can we help you fight drug trafficking? I propose that the U.S. Army come in to help you,'\"\n\nThis guy is on crack!",
                "It looks like he’s gunna send them anyways",
                "I give it until the end of the year, but probably sooner, that Trump sends in troops on Mexican soil anyway. After he gets riled up there, he could very well threaten or actually try sending troops into Canada. Y'know, for \"security reasons.\" He may even just continue claiming Canada as the \"51st state\" and use that as pretense.",
                "We should've rejected voting in Trump a second time...",
                "“Yeah, I’ll pass on having your military just enter my country”",
                "Thats a funny way to say passive invasion. More of the media sane washing Trump smh. ",
                "The Trump Administration doesn't care about drugs, except for that deadliest of all drugs--fluoride. \n\n\nWe just want their oil. Fighting cartels is a contemporary pretense, because 'weapons of mass destruction' is a pretense that has already been used. \n\n\nThe Empire runs on fossil fuels, and energy dominance is the goal ",
                "Remember kids, vampires can’t enter your house without an invitation."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Warren Buffett announces retirement from leading Berkshire Hathaway",
            "external_url": "https://www.theguardian.com/business/2025/may/03/warren-buffett-retirement-berkshire-hathaway",
            "upvotes": 3689,
            "date": "05/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d218a78e339c9698ddcbc45fd9e63371a830d6c/0_167_4352_2611/master/4352.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=15b65b9f6325868b57d16e2ab187bcf7",
            "top_comments": [
                "“I’m getting too old for this shit”",
                "Fella is turning 95 soon.\n\n>Buffett, a Democrat, has previously said that he [plans to donate](https://www.reuters.com/business/finance/buffett-refines-plans-his-fortune-donates-more-berkshire-shares-2024-11-25/#:~:text=Nov%2025%20(Reuters)%20%2D%20Warren,his%20fortune%20after%20his%20death.) 99.5% of his remaining wealth to a charitable trust overseen by his daughter and two sons when he dies. According to Forbes, Buffett has a net worth of $165.3bn.\n\nAnd to think the level of evil this guy could have unleashed with his understanding of the markets - considering he charitably *spent down* to just 165bn.",
                "It's crazy to think this should probably be a big news story but the world is such to where something even crazier will probably happen no later than Tuesday.",
                "I bet he grows his hair out and starts doing yoga. ",
                "Do you think Warren is eligible for social security?",
                "He's heading for the bunker.",
                "Year in year out he had been repeating he ”will never retire”. Something tells me the current admin might have something to do with this change of mind.",
                "Selling stock over last year and saving $300 billion in cash as markets tanked is some move to go out on, hell of a big decision for next leader on what to do with the cash pile. ",
                "Have fun at Margaritaville",
                "what a legacy! Buffett is the godfather of Value Investing and the realization of Graham & Dodd's valuation theories. Buffett is not only one of the most acute & intuitive investors in the post-war period but a legendary figure of financial theory. Hats off to him & his peers from the Depression era who laid the foundation for the dynamism of American economy & business sectors in the 21st century!"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Former Abercrombie & Fitch CEO is ruled unfit for trial and ordered hospitalized",
            "external_url": "https://abcnews.go.com/US/wireStory/former-abercrombie-fitch-ceo-ruled-unfit-trial-ordered-121417264",
            "upvotes": 1451,
            "date": "05/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1546fa24-1bfa-4c2e-892d-d1f7084e4805/wirestory_be6824abaf11f15b3e82eba45f559e7b_16x9.jpg?w=1600",
            "top_comments": [
                "Poor guy, sex trafficking really takes a toll on your body.",
                "Ah, the Harvey Weinstein defense strategy",
                "That’s cool just take all his money. He won’t remember having it those victims I’m sure would appreciate it.",
                "Looks like Nic Cage in Longlegs",
                "100% predator. He got off easy. Fucker.",
                "Just so hard to believe, the store with near naked teenagers had a predator founder.",
                "lot of people in the comments not realizing that this doesn’t mean his was found not guilty or will never have a trial.",
                "Couldn’t have happened to a more deserving predator",
                "How much did he pay for that ruling?",
                "Ooooh wee he looks evil"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Murdered woman's divorce attorney arrested in her 2013 killing",
            "external_url": "https://www.nbcnews.com/news/us-news/murdered-womans-divorce-attorney-arrested-2013-killing-rcna204619",
            "upvotes": 1797,
            "date": "05/03/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-03/Aliza-Sherman-Main-1920x1080-78da67.jpg",
            "top_comments": [
                ">The grand jury’s indictment said Moore killed Sherman to prevent her divorce trial, which was scheduled to start the following day.\n\n>The indictment states that at the time of Sherman’s murder, Moore was being investigated for sending bomb threats to the courthouse on the days he had to appear in court to similarly avoid trials. Moore knew he was being investigating for the bomb threats, according to the indictment.\n\n>In 2017, Moore pleaded guilty to inducing panic related to the bomb threats and falsification for giving authorities misleading statements during the Sherman investigation.\n\nThe attorney is a piece of work. Along with the murder (which was done to prevent her trial from going forward), he sent bomb threats to the courthouse to avoid going to work to do his job.",
                "I'm so confused as to the motive in this case. He killed her and called in bomb threats to....avoid having to go to the courthouse, when he was an attorney? Why? That is so appalling and crazy that there must be something that we are missing in this whole mess.\n\nWas there someone/something there that he was desperately trying to avoid? Was he entangled in something extremely illegal?\n\nEDIT: This is fascinating, according to another article I pulled up, he was charged with:\n\n\nAt least six counts of inducing panic\n\nThree counts of terroristic threats\n\nTelecommunications fraud\n\nObstructing official business\n\nFalsification\n\nTwo counts of forgery\n\nPossessing criminal tools\n\n\n\nbut pleaded down to charges of two counts of felony inducing panic and one count of falsification and served 6 months. So I'm so curious as to how her murder played into all of this fuckery and what crimes he was involved with during this time.",
                "Why didn’t he want the case to go to trial?",
                "So he killed someone to avoid going to work? This sounds like a Seinfeld episode or something.",
                "His motive was to avoid appearing in court?? Why the hell didn’t he just switch to a line of work that didn’t require appearing in court?",
                "Twelve years later, and the guy who was supposed to protect her turns out to be the monster. Absolutely chilling.",
                "It’s not discussed in the linked article, but the victim Aliza Sherman was divorcing her husband because he had allegedly been abusing her for years, and when she began trying to seperate from him, it escalated to a point that she was fearing for her life. \n\nThe murder suspect wasn’t even her original choice for a divorce attorney; her first lawyer had his license suspended due to professional misconduct, so the law firm handed her case to the suspect, who was a senior associate at the time. Aliza claimed that the suspect would be late for meetings and wouldn’t respond to her texts and emails. He also delayed the divorce proceedings numerous times because he didn’t feel fully prepared, which meant that Aliza had been living in fear of her estranged husband for several months by the time she was murdered.  \n\nSource: https://clevelandmagazine.com/in-the-cle/the-read/articles/aliza-sherman",
                "How shit were the original investigators not to look further  into the guy making bomb threats to avoid work when one of his clients is suddenly off'ed allowing him to... Avoid work....",
                "What in the actual fuck",
                "Talk about conflict of interest!"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Crews working to contain weeklong oil spill in Gulf of Mexico",
            "external_url": "https://www.chron.com/gulf-coast/article/oil-spill-louisiana-gas-discharge-20308502.php",
            "upvotes": 1437,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh, it’s Mexico’s when things go bad.",
                "Upvote for the source calling the Gulf by it's proper name.",
                "An 82-year-old well leaking into the Gulf… sounds like Spectrum’s maintenance plan was “just pray it holds.”",
                "Trump: Gulf of Mexico? Sounds like their problem.",
                "It's a good thing it's not in the Gulf of America.",
                "No worries, Mexico will pay to clean it up.",
                "Oh, so when there’s a spill it’s Mexico’s gulf?",
                "It’s gulf of America unless there’s a oil leak then it’s the Gulf of Mexico",
                "Oh sure when we spill oil in it it’s Mexico’s gulf.",
                "Oh so it’s Mexico when it’s dirty?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Kentucky $167.3 million Powerball jackpot winner arrested days after claiming prize",
            "external_url": "https://www.nbcmiami.com/news/local/kentucky-man-arrested-in-florida-days-after-winning-167m-powerball-jackpot/3605610/",
            "upvotes": 6880,
            "date": "05/03/2025",
            "thumbnail": "https://media.nbcmiami.com/2025/05/050225-Kentucky-lottery-winner-James-Farthing.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Sure he can afford a lawyer, but kicking a deputy in the face will probably land him in jail for a bit. \n\nI would not want to be anywhere confined with criminals, with them knowing I had hit a 167.3 million jackpot.",
                "Kentucky man goes to Florida with some New Money... You know it’s gonna be a doozy.",
                "TLDR: He got in a fight with someone at the hotel he was staying at, cops tried to break it up and he kicked a cop in the face and tried to run.",
                "Bro had his life solved forever and decided throwing it down the toilet was the most reasonable thing to do…\n\nDammm",
                "Won the Powerball on Monday. Kicked a cop in the face by Wednesday. That’s one hell of a retirement plan.",
                "Give Kentucky man enough money and what does he become?  Florida/Kentucky man, like some kind of hot mess hybrid experiment.",
                "Guy wins the lottery and to celebrate he takes a trip to…….Tampa.",
                "When keeping it real goes wrong.",
                "Shocking. He looked like such a responsible guy.",
                "Chain link fence tattoo across chest?  \n\nYeah this isn't his first run in with law enforcement."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Guatemalan woman detained by Border Patrol after giving birth at Tucson hospital",
            "external_url": "https://www.kold.com/video/2025/05/03/guatemalan-woman-detained-by-border-patrol-after-giving-birth-tucson-hospital/",
            "upvotes": 3096,
            "date": "05/03/2025",
            "thumbnail": "https://gray-kold-prod.gtv-cdn.com/resizer/v2/https%3A%2F%2Fdo0bihdskp9dy.cloudfront.net%2F05-03-2025%2Ft_fce97cfd4e0c4635bc92fb4422dd9436_name_file_1280x720_2000_v3_1_.jpg?auth=3ae43ee12ac0983a7dc7c57c909ced8d5378d6f03fa3c3aaea4d1b8dad16a21a&width=1200&height=600&smart=true",
            "top_comments": [
                "Jesus Christ The Onion called it again. \n\n\n\n[https://theonion.com/ice-agents-wait-at-edge-of-delivery-table-to-deport-newborn/](https://theonion.com/ice-agents-wait-at-edge-of-delivery-table-to-deport-newborn/)",
                "Better article\n\nhttps://tucson.com/news/local/border/article_7de9b512-e6e1-44bc-a61d-187a2accd22e.html\n\nShe will probably be deported but hopefully will have an actual hearing. \n\nSo sad. She must have been desperate to attempt this whole 8 months pregnant.",
                "Where's the article? WTF is with only putting the information in video format? At a minimum include a transcript",
                "History will see ICE and border agents viewed similarly to nazi SS.",
                "Flaming headlines. Sigh.",
                "[removed]",
                "She was walking through the desert this week and the gives birth soon after. She planned to sneak into the border and then give birth immediately.",
                "Is the issue with ANY sort of detainment/deportation or a specific kind of border enforcement?\n\nI really struggle to have sympathy with folks who don't want to follow the rules for immigrating to the US. I'm sorry your country might suck, might have specific threats aimed at you, etc. But we can't just let everyone in for any reason with or without following protocol. \n\nThe specific complaints being raised in threads like this always blend the reasonable and ridiculous. If you are an \"all borders open at all times\" person, you're a fucking moron. If you have a specific gripe with who ICE is now chasing or how they're doing it, my ears are open to hearing more.",
                "EDIT - Never mind, watch the video. Still awful,but for different  reasons 🤦‍♀️",
                "\"Guatemalan woman\" who is not in this country legally."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "United Airlines cancels flights at Newark Airport as FAA blames equipment, staffing shortages for delays",
            "external_url": "https://www.cbsnews.com/newyork/news/newark-airport-delays-friday-faa/",
            "upvotes": 869,
            "date": "05/03/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/02/cf242c0b-56be-4462-9b97-5abb078d5ef9/thumbnail/1200x630/d27b43cfe183512bd0eb554436150dda/westbrook-530am-vo-newa-wcbsdrqq-hi-res-still-00-00-5901.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "Gee, FAA, however did that happen?",
                "I’m sure Sean from The Real World is on the case.",
                "uh.... i have a united flight out of newark tomorrow....",
                "Those traffic controllers should be paid more. That's a job with incredible amounts of responsibility and pressure.",
                "I'm sure DOGE will have no problem tracking down all the qualified people they fired. It's only what... Half the air traffic controllers in the country? Easy peasy.",
                "So this is when Elon Musk jumps in, makes a ton of money, and exercises private control over another piece of the public interest",
                "What do you mean nothing works after we fired the people who do the work??",
                "Maybe we should put a different \"MTV's Real World\" alum in charge of all the air traffic in the US- Puck's probably free... 🤔",
                "Is it even safe to fly while Trump is President?",
                "I thought Trump removed all the DEI hires so everything was supposed to run like shit through a goose. Is that nit what is happening?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Berkshire Hathaway operating earnings drop more than expected as Buffett warns of tariff uncertainty",
            "external_url": "https://www.nbcnewyork.com/news/business/money-report/berkshire-hathaway-operating-earnings-drop-more-than-expected-as-buffett-warns-of-tariff-uncertainty/6249202/",
            "upvotes": 2043,
            "date": "05/03/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/05/108140441-1746280189515-Screenshot_2025-05-03_at_94538_AM-2.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Insurance profits down nearly 50%, wildfire losses over $1B, and Buffett still won’t spend from his record $347B cash pile. If that doesn’t scream uncertainty, nothing does.",
                "The fact that he has most of his net worth on the sidelines, tells you he is expecting a recession or most likely a depression.",
                "Jeff Bezos is selling a shit ton of stock.\n\nThe ultra wealthy see the writing on the wall.",
                "He also called tariffs an act of war",
                "Buffett is being awfully politically hostile here with those words. Better straighten up, Warren.",
                "He better be careful criticizing tarrifs, Trump will tweet lies and anti-American accusations at him, sicking his altright mob to boycott and harrass him in every way possible.\n\nBut the billionaire class asked for this, so I don't feel bad for the rich that own most of the stock market/these funds. \n\nThe entry barrier to Berkshire Hathaway is super high. There ain't no middle income earners investment portfolio holding Berkshire Hathaway.",
                "It's about time he spoke up!",
                "A plutocrat won’t be making as much money.  Oh no! \n/s\n\nEdit:  Wow, the billionaire bootlickers must be out in force today.",
                "Good, they need to take down Berkshire and his monopoly"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Another round of auto tariffs just went into effect. They could change the industry forever | CNN Business",
            "external_url": "https://www.cnn.com/2025/05/03/business/auto-parts-tariffs",
            "upvotes": 150,
            "date": "05/04/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2148007829.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "They could, or they could be lifted tomorrow. Or doubled.\n\nWho the fuck knows.",
                "We are speed running the end of America as a global superpower, and it’s honestly stunning to witness.",
                "I had a feeling my stocks were doing too well",
                "*But even with that refund, the added cost of tariffs could still come to an average of about $4,000 per vehicle, according to estimates derived from a CNN analysis of government trade data*\n\nThe tariff on on car parts starts today.... the effect arrive in a few months. Plan ahead. I'm hanging on to what I've got.",
                "Thanks Donny, I’ll drive my car for 20 years, I’m ok with that. I’d like the price of Eggs to be below $5 if that’s Ok. If not then please go FYourself!",
                "The fact that dealers are raising prices on inventory that they have had BEFORE these tariffs were put into place, is beyond criminal.\n\n\nEDIT: Spelling",
                "People will now hold on to their reliable vehicles as long as possible now that price of both new and old will head up North.",
                "I saw the writing on the wall and got a new car 2 months ago. My coworker went in Friday.",
                "Good thing I own a Toyota! Not gonna need a new car anytime soon."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Former Abercrombie & Fitch CEO is ruled unfit for trial and ordered hospitalized",
            "external_url": "https://abcnews.go.com/US/wireStory/former-abercrombie-fitch-ceo-ruled-unfit-trial-ordered-121417264",
            "upvotes": 1442,
            "date": "05/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1546fa24-1bfa-4c2e-892d-d1f7084e4805/wirestory_be6824abaf11f15b3e82eba45f559e7b_16x9.jpg?w=1600",
            "top_comments": [
                "Poor guy, sex trafficking really takes a toll on your body.",
                "Ah, the Harvey Weinstein defense strategy",
                "That’s cool just take all his money. He won’t remember having it those victims I’m sure would appreciate it.",
                "Looks like Nic Cage in Longlegs",
                "100% predator. He got off easy. Fucker.",
                "Just so hard to believe, the store with near naked teenagers had a predator founder.",
                "lot of people in the comments not realizing that this doesn’t mean his was found not guilty or will never have a trial.",
                "Couldn’t have happened to a more deserving predator",
                "How much did he pay for that ruling?",
                "Ooooh wee he looks evil"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Crews working to contain weeklong oil spill in Gulf of Mexico",
            "external_url": "https://www.chron.com/gulf-coast/article/oil-spill-louisiana-gas-discharge-20308502.php",
            "upvotes": 1430,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh, it’s Mexico’s when things go bad.",
                "Upvote for the source calling the Gulf by it's proper name.",
                "An 82-year-old well leaking into the Gulf… sounds like Spectrum’s maintenance plan was “just pray it holds.”",
                "Trump: Gulf of Mexico? Sounds like their problem.",
                "It's a good thing it's not in the Gulf of America.",
                "No worries, Mexico will pay to clean it up.",
                "Oh, so when there’s a spill it’s Mexico’s gulf?",
                "It’s gulf of America unless there’s a oil leak then it’s the Gulf of Mexico",
                "Oh sure when we spill oil in it it’s Mexico’s gulf.",
                "Oh so it’s Mexico when it’s dirty?"
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "NEW",
            "title": "Sheinbaum says she rejected Trumps offer to send troops to Mexico",
            "external_url": "https://www.reuters.com/world/americas/sheinbaum-says-she-rejected-trumps-offer-send-troops-mexico-2025-05-03/",
            "upvotes": 3046,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was told Donald Trump was the anti-war, anti-Imperialist President.  Hmm 🤔",
                "The cartels are already armed with American weapons.",
                ">\"In one of the calls, (Trump) said, 'How can we help you fight drug trafficking? I propose that the U.S. Army come in to help you,'\"\n\nThis guy is on crack!",
                "It looks like he’s gunna send them anyways",
                "I give it until the end of the year, but probably sooner, that Trump sends in troops on Mexican soil anyway. After he gets riled up there, he could very well threaten or actually try sending troops into Canada. Y'know, for \"security reasons.\" He may even just continue claiming Canada as the \"51st state\" and use that as pretense.",
                "We should've rejected voting in Trump a second time...",
                "“Yeah, I’ll pass on having your military just enter my country”",
                "Thats a funny way to say passive invasion. More of the media sane washing Trump smh. ",
                "The Trump Administration doesn't care about drugs, except for that deadliest of all drugs--fluoride. \n\n\nWe just want their oil. Fighting cartels is a contemporary pretense, because 'weapons of mass destruction' is a pretense that has already been used. \n\n\nThe Empire runs on fossil fuels, and energy dominance is the goal ",
                "Remember kids, vampires can’t enter your house without an invitation."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Murdered woman's divorce attorney arrested in her 2013 killing",
            "external_url": "https://www.nbcnews.com/news/us-news/murdered-womans-divorce-attorney-arrested-2013-killing-rcna204619",
            "upvotes": 1799,
            "date": "05/03/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-03/Aliza-Sherman-Main-1920x1080-78da67.jpg",
            "top_comments": [
                ">The grand jury’s indictment said Moore killed Sherman to prevent her divorce trial, which was scheduled to start the following day.\n\n>The indictment states that at the time of Sherman’s murder, Moore was being investigated for sending bomb threats to the courthouse on the days he had to appear in court to similarly avoid trials. Moore knew he was being investigating for the bomb threats, according to the indictment.\n\n>In 2017, Moore pleaded guilty to inducing panic related to the bomb threats and falsification for giving authorities misleading statements during the Sherman investigation.\n\nThe attorney is a piece of work. Along with the murder (which was done to prevent her trial from going forward), he sent bomb threats to the courthouse to avoid going to work to do his job.",
                "I'm so confused as to the motive in this case. He killed her and called in bomb threats to....avoid having to go to the courthouse, when he was an attorney? Why? That is so appalling and crazy that there must be something that we are missing in this whole mess.\n\nWas there someone/something there that he was desperately trying to avoid? Was he entangled in something extremely illegal?\n\nEDIT: This is fascinating, according to another article I pulled up, he was charged with:\n\n\nAt least six counts of inducing panic\n\nThree counts of terroristic threats\n\nTelecommunications fraud\n\nObstructing official business\n\nFalsification\n\nTwo counts of forgery\n\nPossessing criminal tools\n\n\n\nbut pleaded down to charges of two counts of felony inducing panic and one count of falsification and served 6 months. So I'm so curious as to how her murder played into all of this fuckery and what crimes he was involved with during this time.",
                "Why didn’t he want the case to go to trial?",
                "So he killed someone to avoid going to work? This sounds like a Seinfeld episode or something.",
                "His motive was to avoid appearing in court?? Why the hell didn’t he just switch to a line of work that didn’t require appearing in court?",
                "Twelve years later, and the guy who was supposed to protect her turns out to be the monster. Absolutely chilling.",
                "It’s not discussed in the linked article, but the victim Aliza Sherman was divorcing her husband because he had allegedly been abusing her for years, and when she began trying to seperate from him, it escalated to a point that she was fearing for her life. \n\nThe murder suspect wasn’t even her original choice for a divorce attorney; her first lawyer had his license suspended due to professional misconduct, so the law firm handed her case to the suspect, who was a senior associate at the time. Aliza claimed that the suspect would be late for meetings and wouldn’t respond to her texts and emails. He also delayed the divorce proceedings numerous times because he didn’t feel fully prepared, which meant that Aliza had been living in fear of her estranged husband for several months by the time she was murdered.  \n\nSource: https://clevelandmagazine.com/in-the-cle/the-read/articles/aliza-sherman",
                "How shit were the original investigators not to look further  into the guy making bomb threats to avoid work when one of his clients is suddenly off'ed allowing him to... Avoid work....",
                "What in the actual fuck",
                "Talk about conflict of interest!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "United Airlines cancels flights at Newark Airport as FAA blames equipment, staffing shortages for delays",
            "external_url": "https://www.cbsnews.com/newyork/news/newark-airport-delays-friday-faa/",
            "upvotes": 870,
            "date": "05/03/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/02/cf242c0b-56be-4462-9b97-5abb078d5ef9/thumbnail/1200x630/d27b43cfe183512bd0eb554436150dda/westbrook-530am-vo-newa-wcbsdrqq-hi-res-still-00-00-5901.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "Gee, FAA, however did that happen?",
                "I’m sure Sean from The Real World is on the case.",
                "uh.... i have a united flight out of newark tomorrow....",
                "Those traffic controllers should be paid more. That's a job with incredible amounts of responsibility and pressure.",
                "I'm sure DOGE will have no problem tracking down all the qualified people they fired. It's only what... Half the air traffic controllers in the country? Easy peasy.",
                "So this is when Elon Musk jumps in, makes a ton of money, and exercises private control over another piece of the public interest",
                "What do you mean nothing works after we fired the people who do the work??",
                "Maybe we should put a different \"MTV's Real World\" alum in charge of all the air traffic in the US- Puck's probably free... 🤔",
                "Is it even safe to fly while Trump is President?",
                "I thought Trump removed all the DEI hires so everything was supposed to run like shit through a goose. Is that nit what is happening?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Warren Buffett announces retirement from leading Berkshire Hathaway",
            "external_url": "https://www.theguardian.com/business/2025/may/03/warren-buffett-retirement-berkshire-hathaway",
            "upvotes": 3682,
            "date": "05/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d218a78e339c9698ddcbc45fd9e63371a830d6c/0_167_4352_2611/master/4352.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=15b65b9f6325868b57d16e2ab187bcf7",
            "top_comments": [
                "“I’m getting too old for this shit”",
                "Fella is turning 95 soon.\n\n>Buffett, a Democrat, has previously said that he [plans to donate](https://www.reuters.com/business/finance/buffett-refines-plans-his-fortune-donates-more-berkshire-shares-2024-11-25/#:~:text=Nov%2025%20(Reuters)%20%2D%20Warren,his%20fortune%20after%20his%20death.) 99.5% of his remaining wealth to a charitable trust overseen by his daughter and two sons when he dies. According to Forbes, Buffett has a net worth of $165.3bn.\n\nAnd to think the level of evil this guy could have unleashed with his understanding of the markets - considering he charitably *spent down* to just 165bn.",
                "It's crazy to think this should probably be a big news story but the world is such to where something even crazier will probably happen no later than Tuesday.",
                "I bet he grows his hair out and starts doing yoga. ",
                "Do you think Warren is eligible for social security?",
                "He's heading for the bunker.",
                "Year in year out he had been repeating he ”will never retire”. Something tells me the current admin might have something to do with this change of mind.",
                "Selling stock over last year and saving $300 billion in cash as markets tanked is some move to go out on, hell of a big decision for next leader on what to do with the cash pile. ",
                "Have fun at Margaritaville",
                "what a legacy! Buffett is the godfather of Value Investing and the realization of Graham & Dodd's valuation theories. Buffett is not only one of the most acute & intuitive investors in the post-war period but a legendary figure of financial theory. Hats off to him & his peers from the Depression era who laid the foundation for the dynamism of American economy & business sectors in the 21st century!"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "NEW",
            "title": "Cincinnati police fatally shot an armed 18-year-old. The next day, his father killed a sheriff’s deputy, authorities say | CNN",
            "external_url": "https://www.cnn.com/2025/05/03/us/ohio-rodney-hinton-jr-arrest-hnk",
            "upvotes": 15081,
            "date": "05/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21594534-32264-561-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "To be clear, the sheriff that was killed was not connected to the shooting of the 18 year old.  The father snapped and ran over a sheriff directing traffic.  He watched the body cam video of his son's death and lost it.\n\nSad day for everyone involved",
                "He killed him by running into him full speed while he was directing traffic for UC’s graduation…",
                "The Sheriff that was killed was doing traffic duty for university of Cincinnati graduation. Heard he was close to retirement.\n\nEdit: already retired and was just helping with traffic",
                "Very sad story the cop wasn't even involved",
                "*”One of the officers shot the 18-year-old as he emerged from between two dumpsters, the body cam video showed. On the footage, moments before the shooting another officer can be heard yelling, ‘He’s got a gun! He’s got a gun! On your right! On your right!’*\n\n*The officer said after the shooting that the 18-year-old appeared to point the gun at him, according to Theetge.*”\n\n**If**(!!!) this is true it sounds about as justified as it can get.\n\nNot to mention the cop he killed was just some random guy directing traffic… I’ll wait until more evidence comes out before forming an opinion of the son but the dad sounds like an absolute POS.\n\nEdit: also the guy he killed was a retired reserve cop. The dude was just an old man that probably just wanted to do something to keep himself busy. One of my coworkers does this kind of thing. He’s in his 60s and dresses up like a cop every two months to direct traffic at football games lol. I’m not convinced he even gets paid to do it",
                "My advice to others here: I once got into an argument on Reddit with someone who argued that police shooting/killing an active shooter was extrajudicial punishment/illegal murder and was wrong. Just post your comment and move on, do not engage! It's not worth the time!",
                "Armed car thief get shot, his father road kills unrelated officer in rage outburst.\n\nHere you go.",
                "that's a real shitty situation all around.",
                "I can’t believe how a lot of people are blaming cops for this. This guy’s son stole a car. When get caught instead of surrendering he try to run with a gun in his hand. What do you expect a cop to do? Just wait and let him shoot at them??? \nand the next day his dad go and killed a random cop??? I just can’t believe how people are justifying this.",
                "So a guy is killed by police while brandishing a firearm in the commission of a felony and his father responds by murdering a cop who had nothing to do with it, yeah that family sounds like a great value to society"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Army Black Hawk helicopter forces two jetliners to abort landings at DCA",
            "external_url": "https://www.npr.org/2025/05/03/nx-s1-5385802/dca-army-black-hawk-helicopter-airlines-abort-landings",
            "upvotes": 360,
            "date": "05/03/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5637x3171+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F15%2Fe2%2F906621f74b93a35290f51a7898e8%2Fgettyimages-1241669316.jpg",
            "top_comments": [
                "\"No more helicopter rides for VIPs\" I'm guessing that is exactly what this was.",
                "More people are just going to have to die before action is actually taken to reroute military traffic",
                "I’m avoiding Reagan airport for future travels.",
                "How is this happening after Trump banned DEI?!",
                "Nobody should be flying to Washington DC. It's not a safe airport",
                "But but but didn't they get rid of those pesky quadruple amputee black gay free range vegan trans dwarfs with Down syndrome air traffic controllers?",
                "An NTSB analysis found that from 2011 to 2024, there was at least one \"close call\" each month between a commercial plane operating at the airport and a helicopter, she said.\n\nSo instead of blaming “women DEI pilot” or something like that shouldn’t everyone blaming how these helicopters are ran? Seeing that such things happen again two times after the incident showed that the guilty party is not the pilots, but how the airport are operated. The January crash is bound to happen seeing that 100+ close calls are already happened!",
                "Omg. Lets not do this shit. I'm flying out of DCA later this month.",
                "There was also a [near miss a month ago](https://amp.cnn.com/cnn/2025/04/08/politics/reagan-national-airport-near-collision-investigation-military-flyover) due to a flyover of Arlington National Cemetery. There is clearly a major problem with military flights in this area.",
                "Is it weird that I have more faith in the Real World cabinet secretary than the Fox News host cabinet secretary?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "NEA Grants Canceled for Several Bay Area Nonprofits",
            "external_url": "https://www.kqed.org/arts/13975661/national-endowment-for-the-arts-grants-canceled-nonprofits",
            "upvotes": 175,
            "date": "05/03/2025",
            "thumbnail": "https://ww2.kqed.org/app/uploads/sites/2/2023/11/231108-TheLab-48-BL_2000-1020x680.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Sheinbaum says she rejected Trumps offer to send troops to Mexico",
            "external_url": "https://www.reuters.com/world/americas/sheinbaum-says-she-rejected-trumps-offer-send-troops-mexico-2025-05-03/",
            "upvotes": 3051,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I was told Donald Trump was the anti-war, anti-Imperialist President.  Hmm 🤔",
                "The cartels are already armed with American weapons.",
                ">\"In one of the calls, (Trump) said, 'How can we help you fight drug trafficking? I propose that the U.S. Army come in to help you,'\"\n\nThis guy is on crack!",
                "It looks like he’s gunna send them anyways",
                "I give it until the end of the year, but probably sooner, that Trump sends in troops on Mexican soil anyway. After he gets riled up there, he could very well threaten or actually try sending troops into Canada. Y'know, for \"security reasons.\" He may even just continue claiming Canada as the \"51st state\" and use that as pretense.",
                "We should've rejected voting in Trump a second time...",
                "“Yeah, I’ll pass on having your military just enter my country”",
                "Thats a funny way to say passive invasion. More of the media sane washing Trump smh. ",
                "The Trump Administration doesn't care about drugs, except for that deadliest of all drugs--fluoride. \n\n\nWe just want their oil. Fighting cartels is a contemporary pretense, because 'weapons of mass destruction' is a pretense that has already been used. \n\n\nThe Empire runs on fossil fuels, and energy dominance is the goal ",
                "Remember kids, vampires can’t enter your house without an invitation."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "United Airlines cancels flights at Newark Airport as FAA blames equipment, staffing shortages for delays",
            "external_url": "https://www.cbsnews.com/newyork/news/newark-airport-delays-friday-faa/",
            "upvotes": 868,
            "date": "05/03/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/02/cf242c0b-56be-4462-9b97-5abb078d5ef9/thumbnail/1200x630/d27b43cfe183512bd0eb554436150dda/westbrook-530am-vo-newa-wcbsdrqq-hi-res-still-00-00-5901.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "Gee, FAA, however did that happen?",
                "I’m sure Sean from The Real World is on the case.",
                "uh.... i have a united flight out of newark tomorrow....",
                "Those traffic controllers should be paid more. That's a job with incredible amounts of responsibility and pressure.",
                "I'm sure DOGE will have no problem tracking down all the qualified people they fired. It's only what... Half the air traffic controllers in the country? Easy peasy.",
                "So this is when Elon Musk jumps in, makes a ton of money, and exercises private control over another piece of the public interest",
                "What do you mean nothing works after we fired the people who do the work??",
                "Maybe we should put a different \"MTV's Real World\" alum in charge of all the air traffic in the US- Puck's probably free... 🤔",
                "Is it even safe to fly while Trump is President?",
                "I thought Trump removed all the DEI hires so everything was supposed to run like shit through a goose. Is that nit what is happening?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Crews working to contain weeklong oil spill in Gulf of Mexico",
            "external_url": "https://www.chron.com/gulf-coast/article/oil-spill-louisiana-gas-discharge-20308502.php",
            "upvotes": 1434,
            "date": "05/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Oh, it’s Mexico’s when things go bad.",
                "Upvote for the source calling the Gulf by it's proper name.",
                "An 82-year-old well leaking into the Gulf… sounds like Spectrum’s maintenance plan was “just pray it holds.”",
                "Trump: Gulf of Mexico? Sounds like their problem.",
                "It's a good thing it's not in the Gulf of America.",
                "No worries, Mexico will pay to clean it up.",
                "Oh, so when there’s a spill it’s Mexico’s gulf?",
                "It’s gulf of America unless there’s a oil leak then it’s the Gulf of Mexico",
                "Oh sure when we spill oil in it it’s Mexico’s gulf.",
                "Oh so it’s Mexico when it’s dirty?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Former Abercrombie & Fitch CEO is ruled unfit for trial and ordered hospitalized",
            "external_url": "https://abcnews.go.com/US/wireStory/former-abercrombie-fitch-ceo-ruled-unfit-trial-ordered-121417264",
            "upvotes": 1451,
            "date": "05/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1546fa24-1bfa-4c2e-892d-d1f7084e4805/wirestory_be6824abaf11f15b3e82eba45f559e7b_16x9.jpg?w=1600",
            "top_comments": [
                "Poor guy, sex trafficking really takes a toll on your body.",
                "Ah, the Harvey Weinstein defense strategy",
                "That’s cool just take all his money. He won’t remember having it those victims I’m sure would appreciate it.",
                "Looks like Nic Cage in Longlegs",
                "100% predator. He got off easy. Fucker.",
                "Just so hard to believe, the store with near naked teenagers had a predator founder.",
                "lot of people in the comments not realizing that this doesn’t mean his was found not guilty or will never have a trial.",
                "Couldn’t have happened to a more deserving predator",
                "How much did he pay for that ruling?",
                "Ooooh wee he looks evil"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Warren Buffett announces retirement from leading Berkshire Hathaway",
            "external_url": "https://www.theguardian.com/business/2025/may/03/warren-buffett-retirement-berkshire-hathaway",
            "upvotes": 3686,
            "date": "05/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8d218a78e339c9698ddcbc45fd9e63371a830d6c/0_167_4352_2611/master/4352.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=15b65b9f6325868b57d16e2ab187bcf7",
            "top_comments": [
                "“I’m getting too old for this shit”",
                "Fella is turning 95 soon.\n\n>Buffett, a Democrat, has previously said that he [plans to donate](https://www.reuters.com/business/finance/buffett-refines-plans-his-fortune-donates-more-berkshire-shares-2024-11-25/#:~:text=Nov%2025%20(Reuters)%20%2D%20Warren,his%20fortune%20after%20his%20death.) 99.5% of his remaining wealth to a charitable trust overseen by his daughter and two sons when he dies. According to Forbes, Buffett has a net worth of $165.3bn.\n\nAnd to think the level of evil this guy could have unleashed with his understanding of the markets - considering he charitably *spent down* to just 165bn.",
                "It's crazy to think this should probably be a big news story but the world is such to where something even crazier will probably happen no later than Tuesday.",
                "I bet he grows his hair out and starts doing yoga. ",
                "Do you think Warren is eligible for social security?",
                "He's heading for the bunker.",
                "Year in year out he had been repeating he ”will never retire”. Something tells me the current admin might have something to do with this change of mind.",
                "Selling stock over last year and saving $300 billion in cash as markets tanked is some move to go out on, hell of a big decision for next leader on what to do with the cash pile. ",
                "Have fun at Margaritaville",
                "what a legacy! Buffett is the godfather of Value Investing and the realization of Graham & Dodd's valuation theories. Buffett is not only one of the most acute & intuitive investors in the post-war period but a legendary figure of financial theory. Hats off to him & his peers from the Depression era who laid the foundation for the dynamism of American economy & business sectors in the 21st century!"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Murdered woman's divorce attorney arrested in her 2013 killing",
            "external_url": "https://www.nbcnews.com/news/us-news/murdered-womans-divorce-attorney-arrested-2013-killing-rcna204619",
            "upvotes": 1802,
            "date": "05/03/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-03/Aliza-Sherman-Main-1920x1080-78da67.jpg",
            "top_comments": [
                ">The grand jury’s indictment said Moore killed Sherman to prevent her divorce trial, which was scheduled to start the following day.\n\n>The indictment states that at the time of Sherman’s murder, Moore was being investigated for sending bomb threats to the courthouse on the days he had to appear in court to similarly avoid trials. Moore knew he was being investigating for the bomb threats, according to the indictment.\n\n>In 2017, Moore pleaded guilty to inducing panic related to the bomb threats and falsification for giving authorities misleading statements during the Sherman investigation.\n\nThe attorney is a piece of work. Along with the murder (which was done to prevent her trial from going forward), he sent bomb threats to the courthouse to avoid going to work to do his job.",
                "I'm so confused as to the motive in this case. He killed her and called in bomb threats to....avoid having to go to the courthouse, when he was an attorney? Why? That is so appalling and crazy that there must be something that we are missing in this whole mess.\n\nWas there someone/something there that he was desperately trying to avoid? Was he entangled in something extremely illegal?\n\nEDIT: This is fascinating, according to another article I pulled up, he was charged with:\n\n\nAt least six counts of inducing panic\n\nThree counts of terroristic threats\n\nTelecommunications fraud\n\nObstructing official business\n\nFalsification\n\nTwo counts of forgery\n\nPossessing criminal tools\n\n\n\nbut pleaded down to charges of two counts of felony inducing panic and one count of falsification and served 6 months. So I'm so curious as to how her murder played into all of this fuckery and what crimes he was involved with during this time.",
                "Why didn’t he want the case to go to trial?",
                "So he killed someone to avoid going to work? This sounds like a Seinfeld episode or something.",
                "His motive was to avoid appearing in court?? Why the hell didn’t he just switch to a line of work that didn’t require appearing in court?",
                "Twelve years later, and the guy who was supposed to protect her turns out to be the monster. Absolutely chilling.",
                "It’s not discussed in the linked article, but the victim Aliza Sherman was divorcing her husband because he had allegedly been abusing her for years, and when she began trying to seperate from him, it escalated to a point that she was fearing for her life. \n\nThe murder suspect wasn’t even her original choice for a divorce attorney; her first lawyer had his license suspended due to professional misconduct, so the law firm handed her case to the suspect, who was a senior associate at the time. Aliza claimed that the suspect would be late for meetings and wouldn’t respond to her texts and emails. He also delayed the divorce proceedings numerous times because he didn’t feel fully prepared, which meant that Aliza had been living in fear of her estranged husband for several months by the time she was murdered.  \n\nSource: https://clevelandmagazine.com/in-the-cle/the-read/articles/aliza-sherman",
                "How shit were the original investigators not to look further  into the guy making bomb threats to avoid work when one of his clients is suddenly off'ed allowing him to... Avoid work....",
                "What in the actual fuck",
                "Talk about conflict of interest!"
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "RISING",
            "title": "Cincinnati police fatally shot an armed 18-year-old. The next day, his father killed a sheriff’s deputy, authorities say | CNN",
            "external_url": "https://www.cnn.com/2025/05/03/us/ohio-rodney-hinton-jr-arrest-hnk",
            "upvotes": 15062,
            "date": "05/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21594534-32264-561-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "To be clear, the sheriff that was killed was not connected to the shooting of the 18 year old.  The father snapped and ran over a sheriff directing traffic.  He watched the body cam video of his son's death and lost it.\n\nSad day for everyone involved",
                "He killed him by running into him full speed while he was directing traffic for UC’s graduation…",
                "The Sheriff that was killed was doing traffic duty for university of Cincinnati graduation. Heard he was close to retirement.\n\nEdit: already retired and was just helping with traffic",
                "Very sad story the cop wasn't even involved",
                "*”One of the officers shot the 18-year-old as he emerged from between two dumpsters, the body cam video showed. On the footage, moments before the shooting another officer can be heard yelling, ‘He’s got a gun! He’s got a gun! On your right! On your right!’*\n\n*The officer said after the shooting that the 18-year-old appeared to point the gun at him, according to Theetge.*”\n\n**If**(!!!) this is true it sounds about as justified as it can get.\n\nNot to mention the cop he killed was just some random guy directing traffic… I’ll wait until more evidence comes out before forming an opinion of the son but the dad sounds like an absolute POS.\n\nEdit: also the guy he killed was a retired reserve cop. The dude was just an old man that probably just wanted to do something to keep himself busy. One of my coworkers does this kind of thing. He’s in his 60s and dresses up like a cop every two months to direct traffic at football games lol. I’m not convinced he even gets paid to do it",
                "My advice to others here: I once got into an argument on Reddit with someone who argued that police shooting/killing an active shooter was extrajudicial punishment/illegal murder and was wrong. Just post your comment and move on, do not engage! It's not worth the time!",
                "Armed car thief get shot, his father road kills unrelated officer in rage outburst.\n\nHere you go.",
                "that's a real shitty situation all around.",
                "I can’t believe how a lot of people are blaming cops for this. This guy’s son stole a car. When get caught instead of surrendering he try to run with a gun in his hand. What do you expect a cop to do? Just wait and let him shoot at them??? \nand the next day his dad go and killed a random cop??? I just can’t believe how people are justifying this.",
                "So a guy is killed by police while brandishing a firearm in the commission of a felony and his father responds by murdering a cop who had nothing to do with it, yeah that family sounds like a great value to society"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Army Black Hawk helicopter forces two jetliners to abort landings at DCA",
            "external_url": "https://www.npr.org/2025/05/03/nx-s1-5385802/dca-army-black-hawk-helicopter-airlines-abort-landings",
            "upvotes": 360,
            "date": "05/03/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5637x3171+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F15%2Fe2%2F906621f74b93a35290f51a7898e8%2Fgettyimages-1241669316.jpg",
            "top_comments": [
                "\"No more helicopter rides for VIPs\" I'm guessing that is exactly what this was.",
                "More people are just going to have to die before action is actually taken to reroute military traffic",
                "I’m avoiding Reagan airport for future travels.",
                "How is this happening after Trump banned DEI?!",
                "Nobody should be flying to Washington DC. It's not a safe airport",
                "But but but didn't they get rid of those pesky quadruple amputee black gay free range vegan trans dwarfs with Down syndrome air traffic controllers?",
                "An NTSB analysis found that from 2011 to 2024, there was at least one \"close call\" each month between a commercial plane operating at the airport and a helicopter, she said.\n\nSo instead of blaming “women DEI pilot” or something like that shouldn’t everyone blaming how these helicopters are ran? Seeing that such things happen again two times after the incident showed that the guilty party is not the pilots, but how the airport are operated. The January crash is bound to happen seeing that 100+ close calls are already happened!",
                "Omg. Lets not do this shit. I'm flying out of DCA later this month.",
                "There was also a [near miss a month ago](https://amp.cnn.com/cnn/2025/04/08/politics/reagan-national-airport-near-collision-investigation-military-flyover) due to a flyover of Arlington National Cemetery. There is clearly a major problem with military flights in this area.",
                "Is it weird that I have more faith in the Real World cabinet secretary than the Fox News host cabinet secretary?"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Guatemalan woman detained by Border Patrol after giving birth at Tucson hospital",
            "external_url": "https://www.kold.com/video/2025/05/03/guatemalan-woman-detained-by-border-patrol-after-giving-birth-tucson-hospital/",
            "upvotes": 3105,
            "date": "05/03/2025",
            "thumbnail": "https://gray-kold-prod.gtv-cdn.com/resizer/v2/https%3A%2F%2Fdo0bihdskp9dy.cloudfront.net%2F05-03-2025%2Ft_fce97cfd4e0c4635bc92fb4422dd9436_name_file_1280x720_2000_v3_1_.jpg?auth=3ae43ee12ac0983a7dc7c57c909ced8d5378d6f03fa3c3aaea4d1b8dad16a21a&width=1200&height=600&smart=true",
            "top_comments": [
                "Jesus Christ The Onion called it again. \n\n\n\n[https://theonion.com/ice-agents-wait-at-edge-of-delivery-table-to-deport-newborn/](https://theonion.com/ice-agents-wait-at-edge-of-delivery-table-to-deport-newborn/)",
                "Better article\n\nhttps://tucson.com/news/local/border/article_7de9b512-e6e1-44bc-a61d-187a2accd22e.html\n\nShe will probably be deported but hopefully will have an actual hearing. \n\nSo sad. She must have been desperate to attempt this whole 8 months pregnant.",
                "Where's the article? WTF is with only putting the information in video format? At a minimum include a transcript",
                "History will see ICE and border agents viewed similarly to nazi SS.",
                "Flaming headlines. Sigh.",
                "[removed]",
                "She was walking through the desert this week and the gives birth soon after. She planned to sneak into the border and then give birth immediately.",
                "Is the issue with ANY sort of detainment/deportation or a specific kind of border enforcement?\n\nI really struggle to have sympathy with folks who don't want to follow the rules for immigrating to the US. I'm sorry your country might suck, might have specific threats aimed at you, etc. But we can't just let everyone in for any reason with or without following protocol. \n\nThe specific complaints being raised in threads like this always blend the reasonable and ridiculous. If you are an \"all borders open at all times\" person, you're a fucking moron. If you have a specific gripe with who ICE is now chasing or how they're doing it, my ears are open to hearing more.",
                "EDIT - Never mind, watch the video. Still awful,but for different  reasons 🤦‍♀️",
                "\"Guatemalan woman\" who is not in this country legally."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Berkshire Hathaway operating earnings drop more than expected as Buffett warns of tariff uncertainty",
            "external_url": "https://www.nbcnewyork.com/news/business/money-report/berkshire-hathaway-operating-earnings-drop-more-than-expected-as-buffett-warns-of-tariff-uncertainty/6249202/",
            "upvotes": 2046,
            "date": "05/03/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/05/108140441-1746280189515-Screenshot_2025-05-03_at_94538_AM-2.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Insurance profits down nearly 50%, wildfire losses over $1B, and Buffett still won’t spend from his record $347B cash pile. If that doesn’t scream uncertainty, nothing does.",
                "The fact that he has most of his net worth on the sidelines, tells you he is expecting a recession or most likely a depression.",
                "Jeff Bezos is selling a shit ton of stock.\n\nThe ultra wealthy see the writing on the wall.",
                "He also called tariffs an act of war",
                "Buffett is being awfully politically hostile here with those words. Better straighten up, Warren.",
                "He better be careful criticizing tarrifs, Trump will tweet lies and anti-American accusations at him, sicking his altright mob to boycott and harrass him in every way possible.\n\nBut the billionaire class asked for this, so I don't feel bad for the rich that own most of the stock market/these funds. \n\nThe entry barrier to Berkshire Hathaway is super high. There ain't no middle income earners investment portfolio holding Berkshire Hathaway.",
                "It's about time he spoke up!",
                "A plutocrat won’t be making as much money.  Oh no! \n/s\n\nEdit:  Wow, the billionaire bootlickers must be out in force today.",
                "Good, they need to take down Berkshire and his monopoly"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "05/04/2025 00:48:38 UTC"
}