{
    "posts": [
        {
            "category": "HOT",
            "title": "Elon Musk to step back from government role 'in coming months'",
            "external_url": "https://news.sky.com/story/elon-musk-to-step-back-from-government-role-in-coming-months-13340539",
            "upvotes": 12353,
            "date": "04/02/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-elon-musk-wisconsin_6871788.jpg?20250331073658",
            "top_comments": [
                "Just like how Tesla would have full self drive in coming months, 10 years ago?",
                "Is that how long it will take to finish stripping the copper wiring out of every federal building in DC?",
                "Guys:\n\nThis announcement was clearly made to shore up TSLA stock after the news of terrible sales drop in Q1.\n\n\nNothing will change.  \n\nLook at Tesla stock before and after the announcement",
                "Why not today?\n\nWell, he still has so many good, important government agencies to fuck up.  Plus there's probably still a few pieces of data laying around on the floor that he hasn't downloaded yet.",
                "Naturally.  By then, all traces of his illegal activities he's being investigated for will be gone.",
                "He will still be pulling strings behind the scenes",
                "just like how he stepped back from running things at Twitter 🙄",
                "He's already taken everyone's data and installed his cronies, what more does he need to do?",
                "Damage to his professional image is already done.  He went in to stop all the lawsuits that were coming up against him, he did that.  I guess he also gutted a lot of government departments too, but that was just secondary to keeping himself rich.",
                "Technically a special government employee can exist for only 130 days.\n\nBut we're ignoring the rules now so who the hell knows?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "NYC Mayor Eric Adams corruption case dismissed with prejudice, judge rules",
            "external_url": "https://www.cbsnews.com/newyork/news/nyc-mayor-eric-adams-corruption-case-dropped/",
            "upvotes": 8960,
            "date": "04/02/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/02/24/38534070-4ac0-48c8-98f7-131bee4a6782/thumbnail/1200x630/d6cab5ed83afe5450cd346e51971c2c0/gettyimages-2200888728.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Best system of justice money, bribes, and favors can buy",
                "Jesus, this is going to go down in the history books as one of the most corrupt cases ever and a highlight of just how bad the justice system in the US has gotten.\n\nThis is another case where the evidence is overwhelming, obvious, and blatant and he gets off scott free.",
                "Crimes are  legal now. Not that it wasn't always better for rich folks but you're getting banana republic levels of corruption now.",
                "Corruption everywhere! God bless America.",
                "Wild open air corruption",
                "To the surprise of absolutely no one",
                ">That means Adams cannot be re-tried on the same charges at a later time - a stipulation the Justice Department sought in its initial request to dismiss the case.\n\nSuch a fucking corrupt administration.",
                ">“Some will undoubtedly find today’s decision unsatisfying, wondering why, if DOJ’s ostensible reasons for dropping this case are so troubling, the Court does not simply deny the Motion to Dismiss altogether. But, as explained above, the Court cannot order DOJ to continue the prosecution, and it is aware of no authority (outside of the criminal contempt context) that would empower it, as some have urged, to appoint an independent prosecutor,” Judge Ho wrote. “Therefore, any decision by this Court to deny the Government’s Motion to Dismiss would be futile at best, because DOJ could—and, by all indications, unequivocally would—simply refuse to prosecute the case, inevitably resulting in a dismissal after seventy days for violating the Mayor’s right to a speedy trial. That route would simply postpone finality in this case to a date uncomfortably close to the June 24 mayoral primary. The public interest would not be served by such an outcome.”\n\nSo basically the judge is saying, “Yes, the reasons DOJ wanted this dismissed are bad, but I can’t force the prosecution to do their jobs, and if I dismiss with prejudice now they can’t hold these charges over the head of an elected official to manipulate them.”. These are the hard choices people have to make when the government has gone rogue and isn’t interested in prosecuting someone who, by all accounts, very obviously took bribes from a foreign government.",
                "This just sets us on a path where the president, with judicial consent, can decide himself what laws are, and are not, enforceable.",
                "The Trump admin wanted this case dismissed without prejudice, meaning that it could be brought against Adams at a later date. The request would have left the case hanging over Adams' head so that if he did not do exactly what the Trump admin asked, they could refile charges and prosecute Adams as punishment for defying the Trump admin.  It was, in every sense of the word, leverage. A quid pro quo.\n\nThe Judge dismissed the case with prejudice, meaning it cannot be resurrected no matter what happens and there is no longer this leverage hanging over Adam's head. Of course, former prosecutors in the case maintained that Adams was guilty, and given federal prosecutors win rate at trial, you would assume he would have been convicted here.  Eric Adams just hit the lottery.  A very corrupt lottery."
            ],
            "aggregate_sentiment": 27.0
        },
        {
            "category": "HOT",
            "title": "DOGE official at DOJ bragged about hacking, distributing pirated software",
            "external_url": "https://www.reuters.com/technology/cybersecurity/doge-official-doj-bragged-about-hacking-distributing-pirated-software-2025-04-02/",
            "upvotes": 5897,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What we were sold : Computer whiz-kids will optimize government!\n\nWhat we think we got : Computer hackers will gut government.\n\nWhat we actually probably got : Computer script kiddies are taking your data.",
                "> Stanley ran a series of websites and forums starting as far back as 2006, when he was 15, registration data preserved by the internet intelligence firm DomainTools shows. Several of those sites distributed pirated ebooks, bootleg software and video game cheats, according to copies maintained by the Internet Archive, a nonprofit whose 'Wayback Machine' preserves old websites....\n\n> In the hours after Reuters contacted Stanley, several of his old websites vanished from the Internet Archive. Mark Graham, director of the Wayback Machine, declined to answer specific questions about the disappearance of Stanley’s websites but said people who own the rights to sites can request to have their content withheld from the archive.\n\nHe immediately got some of his websites removed from the Wayback Machine to try and cover it up. So sad.",
                "We once hired a college intern and on his first day he was bragging about hacking and was playing around with a keylogger on his own laptop. We walked him out on the spot, called the school and said his internship was canceled. You have to be able to trust employees you're giving access to sensitive data (or even could potentially have access, like an intern). No amount of talent or skills can override a lack of trust.",
                "As an infosec pro, I can say that's pretty common. The difference here is that normally there's 20 years of personal and professional development happening between screwing around as a teenager and having significant responsibility in an organization.",
                "Throughout history, philosophers, scientist, and theologians have often pondered who is the biggest bitch. They can now say, without any doubt, that Elon musk is the biggest, most gigantic bitch. Huge bitch. If there was a mount bitchmore, elons head would be there over and over again. Truly a humongous cunt, I mean bitch. Musk’s bitchiness is beyond measure. He is such a bitch, even his kids hate him. Such a cunty bitch. \n\nFuck that guy. ",
                "My parents are convinced the doge folks are the cream of the crop. Super smart guys that can do no wrong. I guess short of them losing Medicare and social security checks what will it take to convince them otherwise. Unfortunately I think something drastic needs to happen for people to actually wake up.",
                "Hey Elon I can save us millions \n Let's just install hacked Office",
                "As a sys admin what I see when I read this title is “DOGE employee at DOJ just read article about how to unlock O365 products without a license”",
                "when you use personality B around group A",
                "Funny how just that alone would keep them from getting a top secret clearance.   Guess all that is just a suggestion now"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "European police say KidFlix, \"one of the largest pedophile platforms in the world,\" busted in joint operation",
            "external_url": "https://www.cbsnews.com/news/germany-online-child-sexual-abuse-platform-kidflix-busted-europol/",
            "upvotes": 4078,
            "date": "04/02/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/02/b221e717-879c-42b8-94dd-e0c331cd1f99/thumbnail/1200x630/5f1a82d31aeb4a20f5e8ee6262d24351/gettyimages-21925246851.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "I think the 1.8 million users should all be jailed.",
                "Jesus christ that name gives me the heebie jeebies.",
                "That is the creepiest name I have ever heard. I just cannot believe that people are willing to invest their intellect and time into something so sinister.",
                "i remember back when i was growing up there was a site called KidPix that was like a funky version of MS paint with fun sounds and effects. \n\ndefinitely feels like a bad name these days",
                "Bro I would 100% have thought that was a website for family-friendly movie if I just saw the URL in the wild. Gross.",
                "This is good news but holy shit is that gross.",
                "That name is so ridiculously gross. Please jail all of them and toss the keys.",
                "Just the name creeps me the f out.",
                "Anyone heard from Matt Gaetz recently?",
                "Is those one those hiding in plain sight situations?  A name like that … awful that law enforcement didn’t identify and hold people accountable sooner."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Nobel Peace Prize winner Oscar Arias says US cancelled his visa",
            "external_url": "https://www.bbc.com/news/articles/c75dl7rdxexo",
            "upvotes": 2173,
            "date": "04/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b4b7/live/606b9160-0fcd-11f0-9f8d-f125b11f3e53.jpg",
            "top_comments": [
                "And Trump himself wants to win the Nobel peace prize …yeah ok",
                ">He said he had received a \"terse\" email \"of a few lines\" from the US government informing him of the decision.\n\nWell....at least he wasn't apprehended by ICE, I guess....",
                "'' Arias, a Nobel laureate, said he was informed of the decision weeks after he had publicly criticised Donald Trump, comparing the behaviour of the US president to that of a Roman emperor. '' How thin skinned, However comparing him to a  Emperor is a major overstatement ,",
                "To give a bit more context:\n\n>The former president of Costa Rica, Oscar Arias, says his US visa has been revoked.\n\n>Arias, a Nobel laureate, said he was informed of the decision weeks after he had publicly criticised Donald Trump, comparing the behaviour of the US president to that of a Roman emperor.\n\nWay to prove you're not playing the role of a Roman emperor. Trump is a petulant child. Trump voters, this is what you voted for.",
                "No smart people allowed!",
                "And why am I not surprised?",
                "He’s so freaking petty! I assume it’s bc HE didn’t win one??",
                "Now this is sad.  You can't even win a Nobel Prize anymore and get any respect from Trump and his goons if you're not of the Aryan race.\n\nOf course, it could just be Trump is jealous, because he's not getting the Peace Prize any time soon with his bumbling around with Putin and Zelenskyy.",
                "change it to \n\nFairness, Uplifting, Compassion, Kindness, Thoughtfulness, Respect, Unity, Mindfulness, and Patience",
                "Trump doesn't have his \"Noble\" prize yet. So Arias hurt the Tangerine Toddlers feelings and his pathetic and childish vengeance is immediate. This is what the once dignified and respected office of the President of the United States has become. Kiss the ring or face the childish petulance."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "US sends three-person disaster response team to earthquake-stricken Myanmar after USAID gutted",
            "external_url": "https://www.abc.net.au/news/2025-04-02/myanmar-earthquake-usaid-cuts-emergency-response/105125224",
            "upvotes": 7833,
            "date": "04/02/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/2990662b455f59bbc476a59ae6691b22?impolicy=wcms_watermark_news&cropH=2659&cropW=4727&xPos=0&yPos=246&width=862&height=485&imformat=generic",
            "top_comments": [
                "I can imagine them asking the victims to sign a very fair « rescue deal »",
                "That team will most likely be looking for mineral deposits I guess?",
                "Basically a team of real estate assessor",
                "The Trump administration is disbanding FEMA, so this is more than they intend to send to any domestic disasters as well. \n\n\nThey're a bunch of selfish grifters who realized they had finally consolidated enough power to break the system and suck out the marrow.",
                "at this point you could just stay home",
                "I hate that our country is embarrassed on a daily basis by Trump.",
                "Well, they took \"soft power\" in a new direction.",
                "Weak and irrelevant also describes the current lame-duck administration in totality.",
                "I'm stunned they did this much.",
                "Hey, they brought three suitcases of paper towels!"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Tesla reports 336,000 vehicle deliveries in first quarter, 13% drop from a year ago.",
            "external_url": "https://www.nbcnews.com/business/business-news/tesla-reports-336000-vehicle-deliveries-first-quarter-13-percent-drop-rcna199263",
            "upvotes": 1692,
            "date": "04/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250402-tesla-ch-0950-721f15.jpg",
            "top_comments": [
                "weirdly stock up a bit today. I guess rumor mill is saying Musk might be leaving the spotlight, but how does stock go up when sales go down??",
                "They were lying about vehicle sales in Canada and claiming fraudulent EV rebates. Which caused them to be banned from incentive programs and have been put under investigation. \n\nI wouldn't doubt if those numbers are even worse.",
                "That number is probably inflated. They have been lying about sales forever to inflate their stock price.",
                "I know their stock price is down over the last few months but how the heck is it climbing today?  Makes no sense.",
                "Those are deliveries. New orders will have tanked way worse.\n\nNot just a Musk backlash. I read a couple of years ago that they would be in trouble eventually. Cost and fit and finish issues were being tolerated when they were the only game in town but now established car manufacturers are in play and they know how to build cars right.",
                "Not enough till it goes 0",
                "Given that those are deliveries and not orders, I expect the drop in the 2nd quarter to be 50-60%. Musk doesn't care now that he has direct access to the Treasury. God only knows how much money he has stolen.\n\nEdit: Also, why is TSLA's stock going *up*‽ That makes no sense.",
                "> Investors were expecting Tesla to report deliveries of between 360,000 and 370,000 vehicles, according to StreetAccount.\n\nIt's actually even worse than it sounds because these were the most recent estimates. Three months ago the consensus estimates were 457,000. They dropped over 100K from their estimates and were *still* way too high.",
                "Now, what are the sales numbers if you ***don't*** count all the vehicles that were recently set on fire and written-off?  Or all the phantom sales?  Or the corrupt government sales?",
                "13% seems low but the reason is because it's compared to Q1 2024 sales which were not as high.\n\nIf we compare to Q4 2024 (495,570 deliveries) then it's a 32% drop!"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Actor Val Kilmer, star of 'Batman Forever', dies at 65",
            "external_url": "https://www.reuters.com/world/us/actor-val-kilmer-star-batman-forever-dies-65-nyt-reports-2025-04-02/",
            "upvotes": 53791,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I highly recommend his 2020 book called I’m your Huckleberry, I just finished it last month. Since he couldn’t read the audiobook, he had three different people read it for him, including Will Forte from SNL. He really lived a great life. Rest in peace.",
                "I am glad we got to see him star Top Gun 2. He was a fighter and held on for a long time despite a very aggressive and terrible disease. I hope he is now at peace.",
                "I wondered for months before the movie came out how Iceman would be portrayed in Top Gun 2, since Val’s illness took his voice away. \n\nIt was a pleasant surprise how they did it, and did right by him to honor his character. \n\nOne of my favorites from the 90s growing up. His guest spot on Entourage was a hilarious surprise. \n\nHe will be missed dearly.",
                "Damn. He had so many legendary roles in his career. And great comedic chops as well.",
                "RIP. I'm glad he isn't suffering anymore. he'd been battling cancer for so long",
                "Fair winds and following seas, Iceman.",
                "I'm your huckleberry. RIP",
                "Batman Forever is the one they picked for the headline?",
                "Willow. It’s a favorite. What a legend.",
                "He was great in Kiss Kiss Bang Bang"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Over 200 passengers sickened with norovirus aboard luxury cruise ship",
            "external_url": "https://abcnews.go.com/US/200-passengers-sickened-norovirus-aboard-cunard-line-cruise/story?id=120387184",
            "upvotes": 1952,
            "date": "04/02/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/5f55135a-789f-4424-892e-0e61f30bf452/cunard-1-gty-er-250401_1743541838037_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">According to the federal health agency, every year the norovirus causes between 19 and 21 million illnesses, 109,000 hospitalizations and 900 deaths.\n\nI didn't know it was that many deaths per year.",
                "Viruses spread like wildfire on cruises, and norovirus is stupidly  contagious. I wouldn't wish it on most of the people I dislike, it's truly miserable. Not everyone is going to make it to the bathroom, so yay for trying to sanitize and clean surfaces and laundry.",
                "It’s pretty rough. I’ve been hospitalized with it a time or two, C. Diff too. Caught norovirus from a daycare my stepdaughter worked at. Put me into the hospital for a week.",
                "Not suprised. My coworkers favorite story is about how on his cruise he saw someone not wash his hands after shitting and go straight back to the buffet.",
                "I caught norovirus the morning of December 24th and let me tell everyone it wasn't fun..let's just say firing out of both ends for hours....",
                "Maybe it's the numbers but \"Norovirus on cruise ship\" is not normally news. I work in a lab near a cruise port and we are constantly getting outbreak samples.",
                "What kind of hell must that be to be stuck on a ship with hundreds of vomiting and \"diarrheaing\" people.",
                "This sounds like a literal -- and I do mean a literal nightmare. When I had norovirus I was slightly feverish, no vomitting, but I couldn't be more than 10 steps away from a toilet for 3 days. Take a SINGLE SIP of water... on the toilet within 90 seconds guaranteed. \n\nI lost close to 30lbs in 3 days. I was absolutely miserable. I would take multiple bouts of COVID, flu, strep, etc before I have that again.",
                "That's why they call them \"floating petri dishes.\" There's already been a number of outbreaks this year:\n\n[https://www.cdc.gov/vessel-sanitation/cruise-ship-outbreaks/index.html](https://www.cdc.gov/vessel-sanitation/cruise-ship-outbreaks/index.html)\n\nIt doesn't take much for norovirus to spread on a ship, especially where buffets are served. Just one employee who didn't wash hands properly and pretty soon everyone is shitting and puking.",
                "Wash your hands, people. This shouldn’t be happening"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Susan Crawford wins Wisconsin Supreme Court race, defying Elon Musk",
            "external_url": "https://www.nbcnews.com/politics/elections/wisconsin-supreme-court-election-results-rcna198353",
            "upvotes": 87878,
            "date": "04/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250327-Susan-Crawford-Brad-Schimel-CH-1007-8c869d.jpg",
            "top_comments": [
                "So proud of my state today!",
                "And the margin wasn't even close either.\n\nFL two deep red districts, while staying red, also swung 20 points toward the Dem.  People are not happy, period.",
                "Good. Elon's money can't buy everything. ",
                "Fuck off Elon. We hate you.",
                "Hello from Wisconsin. Nearly $100M was poured into this race. It was fucking miserable for all of us. We should all be embarrassed that we have let this happen to our democracy.\n\nFuck oligarchs, fuck big money in politics.",
                "The thought of Elon coping and seething at this brings me great joy",
                "It just feels nice to read a positive headline for once. \n\nCongratulations to Susan, fuck you Elon.",
                "Well now trump is going to go extra nuclear tomorrow with whatever the plan was instead of firing elon for doing a piss poor job.",
                "And Elon spent millions on this race lmao",
                "Imagine being one of the richest people in human history and you still fail to use your unimaginable wealth to blatantly manipulate votes in a state election.\n\nIt's hard for me to think of anyone who has ever existed that is a bigger loser than Elon Musk."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "NEW",
            "title": "North Dakota mayor resigns after sending lewd video to city attorney by mistake",
            "external_url": "https://apnews.com/article/minot-north-dakota-aa59ccb5b37fbc55e1e974dcf8dbbc6c",
            "upvotes": 287,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I went into this thinking that this guy is just a perv that got caught but it sounds like it was a legit accident. He immediately apologized and asked her to not watch it. Then took responsibility, resigned, and praised the woman that reported him. \n\n>Ross said Wednesday he takes full responsibility and holds Stalheim “in the utmost regard and respect.” He said he had not resigned earlier “to respect the process.” He plans to focus on himself, healing and moving forward with his family, he said.",
                "“He sent the video minutes after the two had a telephone call discussing a police officer’s suicide.”\n\nThat’s some fucked up kink.",
                "An investigation and a resignation? Seems like there's a lot left unsaid. If it was truly an accident, an apology would have solved matters, and there'd be no interest in investigating further.",
                "It was a video of Minot Mayor Tom Ross masturbating and sending it to City Attorney Stefanie Stalheim back in January. Tom says the video was meant for his girlfriend, but somehow he claims to have accidentally to this lady. I call bullshit and don't buy that at all. My man knew what he was doing...",
                "The answer is, if you need any level of exhibitionism in your life, get a separate phone or tablet for your boner jams.",
                "Odd, a politician did the correct thing.",
                "\"by mistake\"\n\nYeah sure buddy",
                "....that reminds me, I need to send my girl that \"homework\" video",
                "I think we're going to need to see the video to... ah, \"assess the severity of the indecent\" and decide whether this man should have resigned or not. You know, for posteriors -er, *posterity* sake. Just to be sure. For legal reasons."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "OnlyFans founder, crypto foundation submit late-stage bid to buy TikTok",
            "external_url": "https://www.reuters.com/technology/onlyfans-founder-crypto-foundation-submit-late-stage-bid-buy-tiktok-2025-04-02/",
            "upvotes": 43,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If this headline didn't comes from Reuters, I'd've assumed that MadLibs started a news outlet and this was their first story.",
                "TikTok was already 90% gooner bait, so doubt it'll change much",
                "Y'all need to watch the south park about TikTok",
                "OnlyFans founder buying TikTok means it'll be renamed to TitTok",
                "Hahahahahaha. Next you'll tell me that the Hawk Tuah girl will be part of this bid as well.",
                "AMZN will buy it - my prediction.",
                "Well…at least it isn’t Elon."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Staffers charged in alleged abuse of 26 children at Philadelphia-area school",
            "external_url": "https://www.nbcnews.com/news/us-news/staffers-charged-abusing-children-philadelphia-area-school-rcna198982",
            "upvotes": 156,
            "date": "04/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250331-pa-chester-community-charter-school-google-maps-ac-926p-67af6e.jpg",
            "top_comments": [
                "Twenty workers at a Philadelphia-area charter school were charged in connection with allegations of abuse of young children and failure to report it, prosecutors announced Monday.\n\nThe Chester Township Police Department said in court documents that security video captured roughly 100 incidents at Chester Community Charter School’s West Campus in November and December involving what the district attorney’s office said are 26 victims.\n\nThe victims, in grades K-5, were members of the school’s emotional support program, the office of Delaware County District Attorney Jack Stollsteimer said in a statement. Some of them were as young as 5 years old, the DA’s office said.\n\nStollsteimer said at a news conference Monday that he watched security video of the alleged abuse.\n\n“There are nine individuals who have surveillance video that I’ve watched putting their hands on children, some as young as 5,” Stollsteimer said. “Oftentimes, you can see them using their knee to take a child to the ground.”\n\nStollsteimer said formal charges were filed Monday morning. \n\nPolice filed initial charges in state court March 25 after family members of two students separately raised concerns to the school on Jan. 9 and Jan. 10, according to court documents. \n\nAn unnamed parent said their 7-year-old son was afraid to go to school because two staffers had used physical holds on children in a “positive support room” on campus, part of a program at the school called Team Approach to Achieving Academic Success, according to a police affidavit filed in support of charges.\n\nRelatives of another 7-year-old boy stepped forward the next day with similar complaints, the affidavit said. \n\nInvestigators said they found consistent accounts that staffers used “shoulder work” — including pinching pressure points on the neck, placing children in holds with their arms crossed in front of them and pushing knees into students’ backs — as a way of gaining physical compliance, the affidavit said.\n\nNine defendants alleged to have abused or had physical contact with children were charged with conspiracy, simple assault, unlawful restraint, false imprisonment, endangering the welfare of a child and failure to report endangering the welfare of a child, the DA’s office said.\n\nEleven defendants were charged with failure to report the alleged endangerment. Three of those charged with failure to report are school employees and were placed on leave pending further investigation, the school said in a statement.\n\nBoth groups of defendants include people with multiple counts of each charge. Police indicated a “dean of students” and “teachers” were among the second group.\n\nOn its website, the school lists the dean of students as Dahkeem Williams. \n\n“We take great exception to the District Attorney’s statement that ‘all the adults charged are equally guilty in failing to protect these children,’” Williams’ attorney, who also represents another defendant in the case, told NBC Philadelphia.\n\n\nNone of those charged were in custody, but some have made arrangements to surrender, Stollsteimer’s office said in its statement.\n\nOnline court records did not list attorneys for most defendants. The public defender’s office for Delaware County did not immediately respond to a request for comment Monday night.\n\n“I am proud that today we are holding the support staff, teachers, and even a dean of students accountable for abusing or failing to report the abuse, of vulnerable children,” Chester Township Police Chief Kenneth Coalson said in the DA’s statement.\n\nStollsteimer noted that state law mandates reporting child abuse for those who work in school settings.\n\nIndividual incidents of using physical contact for compliance must each be reported under state regulations, and none were, according to the affidavit. \n\n“This is just unacceptable behavior to happen anywhere, but particularly in a school setting for children who are supposed to be getting emotional support,” Stollsteimer said.\n\nThe school parent-teacher association did not immediately respond to a request for comment Monday night.\n\nThe contractor for whom the DA said most of the defendants work, Peak Performers Staffing LLC, did not respond to a request for comment. Chester Community Charter School said it severed ties with the company and its workers.\n\nThe school said in a statement that 17 of those charged work for Peak Performers, which it said took over a previous, “highly reputable” contractor’s emotional support work after that contractor discontinued the services the school was using.\n\nThe school said it was assured the Peak Performers employees were properly trained in physical contact with students but later learned they had not completed the necessary training.\n\nThe school characterized itself as an unnamed victim in the case, saying it was “duped” by Peak Performers.\n\n“CCCS plans to pursue all appropriate legal recourse against Peak Performers for the reckless and dangerous manner in which it operated,” the school said. “CCCS leaders are outraged at the actions and inactions of Peak Performers and stands in solidarity with the other victims.” \n\nIn 2018, Chester Community Charter School said it was the largest brick-and-mortar charter school in Pennsylvania. The K-8, four-campus school says it serves more than 4,000 students. Chester Township is about 22 miles southwest of Center City Philadelphia.",
                "I*nvestigators said they found consistent accounts that staffers used “shoulder work” — including pinching pressure points on the neck, placing children in holds with their arms crossed in front of them and pushing knees into students’ backs — as a way of gaining physical compliance, the affidavit said.*\n\nTwo levels of staff guilt in this charter school: 1) the coercive actors 2) the silent staff bystanders.",
                "So that's 9 for doing the abusing, and 11 for not reporting them. \n\n  \nAlso, a lot of job openings at the school per their website.",
                "How charter schools work. The company only hires a bear minimum of actual workers mostly just enough to sign the legal documents. Then they contract out everything from food services, janitor service, and teachers to vendors who bid the lowest. Usually these vendors hire people are paid minimum wage but who can't get hired by Target, McDonald's, or any other job that pays $0.50 more per hour than minimum wage. \n\n\nAnd if that's not bad enough these minum wage employees are ridiculously understaffed so only the ones that get off abusing kids stick around on the job, sort of the same that happens with prison guards.",
                "Why would Dahkeem Williams allow this to happen at his school?",
                "I worked with children like this for 20 years. We stopped doing physical holds many many years ago because it was abusive,  it hurts and even kills children AND does nothing to control behavior in the long run.\n\nIt's lazy teaching, behavior management because it takes more time to build relationships, manage behaviors without being physical.\n\nShame on the staff, shame on the ones who didn't stop it or report it.",
                "*The victims, in grades K-5, were members of the school’s emotional support program, the office of Delaware County District Attorney Jack Stollsteimer said in a statement. Some of them were as young as 5 years old, the DA’s office said.*\n\n\nI'm so confused. The kids were the emotional support to the adults that abused them?",
                "[removed]"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Elon Musk to step back from government role 'in coming months'",
            "external_url": "https://news.sky.com/story/elon-musk-to-step-back-from-government-role-in-coming-months-13340539",
            "upvotes": 12363,
            "date": "04/02/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-elon-musk-wisconsin_6871788.jpg?20250331073658",
            "top_comments": [
                "Just like how Tesla would have full self drive in coming months, 10 years ago?",
                "Is that how long it will take to finish stripping the copper wiring out of every federal building in DC?",
                "Guys:\n\nThis announcement was clearly made to shore up TSLA stock after the news of terrible sales drop in Q1.\n\n\nNothing will change.  \n\nLook at Tesla stock before and after the announcement",
                "Why not today?\n\nWell, he still has so many good, important government agencies to fuck up.  Plus there's probably still a few pieces of data laying around on the floor that he hasn't downloaded yet.",
                "Naturally.  By then, all traces of his illegal activities he's being investigated for will be gone.",
                "He will still be pulling strings behind the scenes",
                "just like how he stepped back from running things at Twitter 🙄",
                "He's already taken everyone's data and installed his cronies, what more does he need to do?",
                "Damage to his professional image is already done.  He went in to stop all the lawsuits that were coming up against him, he did that.  I guess he also gutted a lot of government departments too, but that was just secondary to keeping himself rich.",
                "Technically a special government employee can exist for only 130 days.\n\nBut we're ignoring the rules now so who the hell knows?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US Man Arrested for entering restricted North Sentinel Island in Andamans",
            "external_url": "https://www.deccanherald.com/india/us-man-arrested-for-entering-restricted-north-sentinel-island-in-andamans-3474396",
            "upvotes": 162,
            "date": "04/02/2025",
            "thumbnail": "https://images.deccanherald.com/deccanherald%2F2025-04-02%2F659nbhh0%2Farrestistock_1135661328_894614_1601371600.jpg?rect=0%2C39%2C1116%2C586&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
            "top_comments": [
                "He's lucky the law got to him before they did.",
                ">He launched his boat from Kurma Dera beach around 1 am on March 29, carrying a coconut and a can of cola as \"offerings for the Sentinelese\", police said.\n\nOh. Apparently coconuts aren't native to the islands. But the Sentinelese have been observed collecting and eating them as they wash ashore. And Indian anthropologists have given them to the tribe as gifts in the past.",
                "What a dumbass.  I hope this wasn't some influencer/content creator bullshit.",
                "He could have exposed them to disease and sickness they aren’t capable of fending off and killed all of them. Nice work Cortez",
                "Fucking moron, they should have let him get porcupined by a bunch of arrows. Now THAT I would watch on his YouTube channel",
                "Is this another crazy religious type trying to indoctrinate the heathen masses?",
                ">Police said he had planned his journey meticulously -- conducted research on sea conditions, tides, and accessibility from the Kurma Dera beach.\n\nAnd yet he didn't research how the Sentinelese respond.\n\nThis was his THIRD attempt to reach North Sentinel Island. At what point do we prosecute people who do this for attempted genocide? Whether they intend to or not, they are risking the lives of ALL the Sentinelese people.\n\nI'll call it now, he's probably a christian missionary looking to convert the Sentinelese people. Perhaps India should just bar entry to christian missionaries because clearly they're a security risk.",
                "The authorities should have not bothered and let them take care of the problem.",
                "100 bucks its another missionary",
                "Fool has a death wish disguised as delusions of grandeur."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Supreme Court sides with the FDA in dispute over sweet-flavored vaping products",
            "external_url": "https://www.denver7.com/politics/supreme-court/supreme-court-sides-with-the-fda-in-dispute-over-sweet-flavored-vaping-products",
            "upvotes": 122,
            "date": "04/02/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/66b2a87/2147483647/strip/true/crop/3000x1575+0+287/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F56%2F9c%2F310e201249a99d43a57f1e5b8160%2Fap25092546160361.jpg",
            "top_comments": [
                ">But the justices' unanimous decision throwing out a federal appeals court ruling is not the final word in the case, and the FDA could change its approach now that President Donald Trump has promised to “save” vaping.\n\nWait. Why did Trump promise to save vaping?",
                "Ah, so following that logic, surely we’re going to ban sweet/fruit/candy flavored alcohol too right?",
                "So can we ban all junk food now, if the standard is public benefit?",
                "How do we stop teens from vaping?\n\nBy making them have no smell at all and being even more discreet!"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Nobel Peace Prize winner Oscar Arias says US cancelled his visa",
            "external_url": "https://www.bbc.com/news/articles/c75dl7rdxexo",
            "upvotes": 2174,
            "date": "04/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b4b7/live/606b9160-0fcd-11f0-9f8d-f125b11f3e53.jpg",
            "top_comments": [
                "And Trump himself wants to win the Nobel peace prize …yeah ok",
                ">He said he had received a \"terse\" email \"of a few lines\" from the US government informing him of the decision.\n\nWell....at least he wasn't apprehended by ICE, I guess....",
                "'' Arias, a Nobel laureate, said he was informed of the decision weeks after he had publicly criticised Donald Trump, comparing the behaviour of the US president to that of a Roman emperor. '' How thin skinned, However comparing him to a  Emperor is a major overstatement ,",
                "To give a bit more context:\n\n>The former president of Costa Rica, Oscar Arias, says his US visa has been revoked.\n\n>Arias, a Nobel laureate, said he was informed of the decision weeks after he had publicly criticised Donald Trump, comparing the behaviour of the US president to that of a Roman emperor.\n\nWay to prove you're not playing the role of a Roman emperor. Trump is a petulant child. Trump voters, this is what you voted for.",
                "No smart people allowed!",
                "And why am I not surprised?",
                "He’s so freaking petty! I assume it’s bc HE didn’t win one??",
                "Now this is sad.  You can't even win a Nobel Prize anymore and get any respect from Trump and his goons if you're not of the Aryan race.\n\nOf course, it could just be Trump is jealous, because he's not getting the Peace Prize any time soon with his bumbling around with Putin and Zelenskyy.",
                "change it to \n\nFairness, Uplifting, Compassion, Kindness, Thoughtfulness, Respect, Unity, Mindfulness, and Patience",
                "Trump doesn't have his \"Noble\" prize yet. So Arias hurt the Tangerine Toddlers feelings and his pathetic and childish vengeance is immediate. This is what the once dignified and respected office of the President of the United States has become. Kiss the ring or face the childish petulance."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Kohl's changes DEI officer title, broadens supplier diversity program",
            "external_url": "https://www.reuters.com/business/retail-consumer/kohls-changes-dei-officer-title-broadens-supplier-diversity-program-2025-03-14/",
            "upvotes": 804,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Are they really just changing the name to \"inclusion and belonging\" because I have to say, if this is just a way to head fake the anti-DEI crowd it's kind of amazing.",
                "I mean that \"$60\" shirt for 10.99 was always going to be 10.99 so it's pretty on brand for them to change DEI to belonging and inclusion but keep it the same.",
                ">\"We have evolved our framework to focus on inclusion and belonging,\" said Michelle Banks, whose title changed from chief DEI officer to chief inclusion and belonging officer.\n\n\"Diversity\" is what tends to get mentioned, but it's not like Trump and MAGA cult members are fine with the E and I.",
                "ok ok ok kohl's I'll buy a shirt. I like that trick",
                "Redhats really love hating on three letter acronyms...",
                "My company just announced a similar change. Just a name rebrand with all the same groups dedicated to different categories. \nABLE - For folks with Disabilities.\nBEACON - Focus on black people in the work force and historical contributions  to the field I work in.\nPRIDE - Focuses on LGBTQAI+\n\nThese are just just a couple I can name at the top of my head, and being some what vague on purpose. I was really happy when they announced their continued commitment to these values in this political environment.",
                "Should just change it to **BEES**. **B**olstering **E**mployee **E**xcellence and **S**uccess.\n\nA diverse, inclusive, and equitable workforce is often a successful workforce. But instead of calling saying those terms outright, you just change them to what they *lead* to. You know, to throw the simple red hats off the scent.",
                "We just had a transgender remembrance day at work and we didn't die. Was amazing. Today is Holi. It's one thing celebrating having a diverse workforce. Hiding the intention from public view is an interesting strategy.",
                "My work changed DEI office to “employee engagement office”… shhh",
                "Got some cash just burning a whole in my pocket. Guess I'm going to Kohl's."
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "NEW",
            "title": "Girl killed by friend while playing with gun in Sacramento, sheriff says",
            "external_url": "https://www.cbsnews.com/sacramento/news/girl-killed-while-teens-play-with-gun-in-sacramento/",
            "upvotes": 451,
            "date": "04/02/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/01/cd6a9a38-d806-4e59-903b-b3126d799d12/thumbnail/1200x630/aeab7ee7d3e86e220c14694f4896ae75/gettyimages-1889004791.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "from the article:\n\n01 April 2025\n\nSACRAMENTO — A teenager who killed his friend while they were playing with a gun at a south Sacramento home over the weekend has been arrested, authorities said Tuesday:\n\n>The Sacramento County Sheriff's Office said it happened Sunday afternoon at a home on Chriswoods Court. \n\n>Several minors were located at the home during the time of the incident, but authorities said the alleged shooter was a male teen and the victim was a female teen, both 16.\n\n>Investigators learned that the male teen had brought the gun to the home. After they had been playing with the gun, the male teen had shot the female teen in the head and left the scene with the firearm before law enforcement arrived, the sheriff's office said.\n\n>The girl was declared dead at the scene by first responders.\n\n>Authorities said several other minors were detained when law enforcement arrived, as the circumstances of the shooting were still under investigation.\n\n>It was Tuesday morning in Stockton when law enforcement officials located and arrested the alleged shooter. He was booked into the Sacramento County Juvenile Hall on a murder charge, the sheriff's office said.\n\n>Prior to his arrest, investigators said it was revealed the teen had three outstanding felony warrants and had a history of arrests for weapons violations and sex crimes.\n\n>Neither of the involved individuals was identified.",
                "Playing with? Exactly what were they playing?",
                "Terrible. Go find your teenager right now and remind them if anyone they know starts flashing a gun even just to be a show off - that person is a danger and you need to gtfo of there.",
                "[deleted]",
                "They’re *16*! I don’t buy for a second it was an accident. The boy shot the girl in the head and fled the scene!",
                "if they were literal children sure but they’re 16 years old that kid most definitely intended to shoot and kill or should at least be charged with voluntary manslaughter",
                "Guns are not toys.\n\nGuns are not to be \"played\" with.\n\nTeach your children to respect firearms.",
                "[deleted]",
                "Forever making invalid the argument that \"guns don't kill people\".",
                "for a country that's so gung ho about their guns, it sure looks like they should have the least amount of guns available"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Tesla reports 336,000 vehicle deliveries in first quarter, 13% drop from a year ago.",
            "external_url": "https://www.nbcnews.com/business/business-news/tesla-reports-336000-vehicle-deliveries-first-quarter-13-percent-drop-rcna199263",
            "upvotes": 1696,
            "date": "04/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250402-tesla-ch-0950-721f15.jpg",
            "top_comments": [
                "weirdly stock up a bit today. I guess rumor mill is saying Musk might be leaving the spotlight, but how does stock go up when sales go down??",
                "They were lying about vehicle sales in Canada and claiming fraudulent EV rebates. Which caused them to be banned from incentive programs and have been put under investigation. \n\nI wouldn't doubt if those numbers are even worse.",
                "That number is probably inflated. They have been lying about sales forever to inflate their stock price.",
                "I know their stock price is down over the last few months but how the heck is it climbing today?  Makes no sense.",
                "Those are deliveries. New orders will have tanked way worse.\n\nNot just a Musk backlash. I read a couple of years ago that they would be in trouble eventually. Cost and fit and finish issues were being tolerated when they were the only game in town but now established car manufacturers are in play and they know how to build cars right.",
                "Not enough till it goes 0",
                "Given that those are deliveries and not orders, I expect the drop in the 2nd quarter to be 50-60%. Musk doesn't care now that he has direct access to the Treasury. God only knows how much money he has stolen.\n\nEdit: Also, why is TSLA's stock going *up*‽ That makes no sense.",
                "> Investors were expecting Tesla to report deliveries of between 360,000 and 370,000 vehicles, according to StreetAccount.\n\nIt's actually even worse than it sounds because these were the most recent estimates. Three months ago the consensus estimates were 457,000. They dropped over 100K from their estimates and were *still* way too high.",
                "Now, what are the sales numbers if you ***don't*** count all the vehicles that were recently set on fire and written-off?  Or all the phantom sales?  Or the corrupt government sales?",
                "13% seems low but the reason is because it's compared to Q1 2024 sales which were not as high.\n\nIf we compare to Q4 2024 (495,570 deliveries) then it's a 32% drop!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "North Dakota mayor resigns after sending lewd video to city attorney by mistake",
            "external_url": "https://apnews.com/article/minot-north-dakota-aa59ccb5b37fbc55e1e974dcf8dbbc6c",
            "upvotes": 285,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I went into this thinking that this guy is just a perv that got caught but it sounds like it was a legit accident. He immediately apologized and asked her to not watch it. Then took responsibility, resigned, and praised the woman that reported him. \n\n>Ross said Wednesday he takes full responsibility and holds Stalheim “in the utmost regard and respect.” He said he had not resigned earlier “to respect the process.” He plans to focus on himself, healing and moving forward with his family, he said.",
                "“He sent the video minutes after the two had a telephone call discussing a police officer’s suicide.”\n\nThat’s some fucked up kink.",
                "An investigation and a resignation? Seems like there's a lot left unsaid. If it was truly an accident, an apology would have solved matters, and there'd be no interest in investigating further.",
                "It was a video of Minot Mayor Tom Ross masturbating and sending it to City Attorney Stefanie Stalheim back in January. Tom says the video was meant for his girlfriend, but somehow he claims to have accidentally to this lady. I call bullshit and don't buy that at all. My man knew what he was doing...",
                "The answer is, if you need any level of exhibitionism in your life, get a separate phone or tablet for your boner jams.",
                "Odd, a politician did the correct thing.",
                "\"by mistake\"\n\nYeah sure buddy",
                "....that reminds me, I need to send my girl that \"homework\" video",
                "I think we're going to need to see the video to... ah, \"assess the severity of the indecent\" and decide whether this man should have resigned or not. You know, for posteriors -er, *posterity* sake. Just to be sure. For legal reasons."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Nobel Peace Prize winner Oscar Arias says US cancelled his visa",
            "external_url": "https://www.bbc.com/news/articles/c75dl7rdxexo",
            "upvotes": 2175,
            "date": "04/02/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b4b7/live/606b9160-0fcd-11f0-9f8d-f125b11f3e53.jpg",
            "top_comments": [
                "And Trump himself wants to win the Nobel peace prize …yeah ok",
                ">He said he had received a \"terse\" email \"of a few lines\" from the US government informing him of the decision.\n\nWell....at least he wasn't apprehended by ICE, I guess....",
                "'' Arias, a Nobel laureate, said he was informed of the decision weeks after he had publicly criticised Donald Trump, comparing the behaviour of the US president to that of a Roman emperor. '' How thin skinned, However comparing him to a  Emperor is a major overstatement ,",
                "To give a bit more context:\n\n>The former president of Costa Rica, Oscar Arias, says his US visa has been revoked.\n\n>Arias, a Nobel laureate, said he was informed of the decision weeks after he had publicly criticised Donald Trump, comparing the behaviour of the US president to that of a Roman emperor.\n\nWay to prove you're not playing the role of a Roman emperor. Trump is a petulant child. Trump voters, this is what you voted for.",
                "No smart people allowed!",
                "And why am I not surprised?",
                "He’s so freaking petty! I assume it’s bc HE didn’t win one??",
                "Now this is sad.  You can't even win a Nobel Prize anymore and get any respect from Trump and his goons if you're not of the Aryan race.\n\nOf course, it could just be Trump is jealous, because he's not getting the Peace Prize any time soon with his bumbling around with Putin and Zelenskyy.",
                "change it to \n\nFairness, Uplifting, Compassion, Kindness, Thoughtfulness, Respect, Unity, Mindfulness, and Patience",
                "Trump doesn't have his \"Noble\" prize yet. So Arias hurt the Tangerine Toddlers feelings and his pathetic and childish vengeance is immediate. This is what the once dignified and respected office of the President of the United States has become. Kiss the ring or face the childish petulance."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk to step back from government role 'in coming months'",
            "external_url": "https://news.sky.com/story/elon-musk-to-step-back-from-government-role-in-coming-months-13340539",
            "upvotes": 12402,
            "date": "04/02/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-elon-musk-wisconsin_6871788.jpg?20250331073658",
            "top_comments": [
                "Just like how Tesla would have full self drive in coming months, 10 years ago?",
                "Is that how long it will take to finish stripping the copper wiring out of every federal building in DC?",
                "Guys:\n\nThis announcement was clearly made to shore up TSLA stock after the news of terrible sales drop in Q1.\n\n\nNothing will change.  \n\nLook at Tesla stock before and after the announcement",
                "Why not today?\n\nWell, he still has so many good, important government agencies to fuck up.  Plus there's probably still a few pieces of data laying around on the floor that he hasn't downloaded yet.",
                "Naturally.  By then, all traces of his illegal activities he's being investigated for will be gone.",
                "He will still be pulling strings behind the scenes",
                "just like how he stepped back from running things at Twitter 🙄",
                "He's already taken everyone's data and installed his cronies, what more does he need to do?",
                "Damage to his professional image is already done.  He went in to stop all the lawsuits that were coming up against him, he did that.  I guess he also gutted a lot of government departments too, but that was just secondary to keeping himself rich.",
                "Technically a special government employee can exist for only 130 days.\n\nBut we're ignoring the rules now so who the hell knows?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "DOGE official at DOJ bragged about hacking, distributing pirated software",
            "external_url": "https://www.reuters.com/technology/cybersecurity/doge-official-doj-bragged-about-hacking-distributing-pirated-software-2025-04-02/",
            "upvotes": 5904,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What we were sold : Computer whiz-kids will optimize government!\n\nWhat we think we got : Computer hackers will gut government.\n\nWhat we actually probably got : Computer script kiddies are taking your data.",
                "> Stanley ran a series of websites and forums starting as far back as 2006, when he was 15, registration data preserved by the internet intelligence firm DomainTools shows. Several of those sites distributed pirated ebooks, bootleg software and video game cheats, according to copies maintained by the Internet Archive, a nonprofit whose 'Wayback Machine' preserves old websites....\n\n> In the hours after Reuters contacted Stanley, several of his old websites vanished from the Internet Archive. Mark Graham, director of the Wayback Machine, declined to answer specific questions about the disappearance of Stanley’s websites but said people who own the rights to sites can request to have their content withheld from the archive.\n\nHe immediately got some of his websites removed from the Wayback Machine to try and cover it up. So sad.",
                "We once hired a college intern and on his first day he was bragging about hacking and was playing around with a keylogger on his own laptop. We walked him out on the spot, called the school and said his internship was canceled. You have to be able to trust employees you're giving access to sensitive data (or even could potentially have access, like an intern). No amount of talent or skills can override a lack of trust.",
                "As an infosec pro, I can say that's pretty common. The difference here is that normally there's 20 years of personal and professional development happening between screwing around as a teenager and having significant responsibility in an organization.",
                "Throughout history, philosophers, scientist, and theologians have often pondered who is the biggest bitch. They can now say, without any doubt, that Elon musk is the biggest, most gigantic bitch. Huge bitch. If there was a mount bitchmore, elons head would be there over and over again. Truly a humongous cunt, I mean bitch. Musk’s bitchiness is beyond measure. He is such a bitch, even his kids hate him. Such a cunty bitch. \n\nFuck that guy. ",
                "My parents are convinced the doge folks are the cream of the crop. Super smart guys that can do no wrong. I guess short of them losing Medicare and social security checks what will it take to convince them otherwise. Unfortunately I think something drastic needs to happen for people to actually wake up.",
                "Hey Elon I can save us millions \n Let's just install hacked Office",
                "As a sys admin what I see when I read this title is “DOGE employee at DOJ just read article about how to unlock O365 products without a license”",
                "when you use personality B around group A",
                "Funny how just that alone would keep them from getting a top secret clearance.   Guess all that is just a suggestion now"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "European police say KidFlix, \"one of the largest pedophile platforms in the world,\" busted in joint operation",
            "external_url": "https://www.cbsnews.com/news/germany-online-child-sexual-abuse-platform-kidflix-busted-europol/",
            "upvotes": 4089,
            "date": "04/02/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/02/b221e717-879c-42b8-94dd-e0c331cd1f99/thumbnail/1200x630/5f1a82d31aeb4a20f5e8ee6262d24351/gettyimages-21925246851.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "I think the 1.8 million users should all be jailed.",
                "Jesus christ that name gives me the heebie jeebies.",
                "That is the creepiest name I have ever heard. I just cannot believe that people are willing to invest their intellect and time into something so sinister.",
                "i remember back when i was growing up there was a site called KidPix that was like a funky version of MS paint with fun sounds and effects. \n\ndefinitely feels like a bad name these days",
                "Bro I would 100% have thought that was a website for family-friendly movie if I just saw the URL in the wild. Gross.",
                "This is good news but holy shit is that gross.",
                "That name is so ridiculously gross. Please jail all of them and toss the keys.",
                "Just the name creeps me the f out.",
                "Anyone heard from Matt Gaetz recently?",
                "Is those one those hiding in plain sight situations?  A name like that … awful that law enforcement didn’t identify and hold people accountable sooner."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Tesla reports 336,000 vehicle deliveries in first quarter, 13% drop from a year ago.",
            "external_url": "https://www.nbcnews.com/business/business-news/tesla-reports-336000-vehicle-deliveries-first-quarter-13-percent-drop-rcna199263",
            "upvotes": 1692,
            "date": "04/02/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250402-tesla-ch-0950-721f15.jpg",
            "top_comments": [
                "weirdly stock up a bit today. I guess rumor mill is saying Musk might be leaving the spotlight, but how does stock go up when sales go down??",
                "They were lying about vehicle sales in Canada and claiming fraudulent EV rebates. Which caused them to be banned from incentive programs and have been put under investigation. \n\nI wouldn't doubt if those numbers are even worse.",
                "That number is probably inflated. They have been lying about sales forever to inflate their stock price.",
                "I know their stock price is down over the last few months but how the heck is it climbing today?  Makes no sense.",
                "Those are deliveries. New orders will have tanked way worse.\n\nNot just a Musk backlash. I read a couple of years ago that they would be in trouble eventually. Cost and fit and finish issues were being tolerated when they were the only game in town but now established car manufacturers are in play and they know how to build cars right.",
                "Not enough till it goes 0",
                "Given that those are deliveries and not orders, I expect the drop in the 2nd quarter to be 50-60%. Musk doesn't care now that he has direct access to the Treasury. God only knows how much money he has stolen.\n\nEdit: Also, why is TSLA's stock going *up*‽ That makes no sense.",
                "> Investors were expecting Tesla to report deliveries of between 360,000 and 370,000 vehicles, according to StreetAccount.\n\nIt's actually even worse than it sounds because these were the most recent estimates. Three months ago the consensus estimates were 457,000. They dropped over 100K from their estimates and were *still* way too high.",
                "Now, what are the sales numbers if you ***don't*** count all the vehicles that were recently set on fire and written-off?  Or all the phantom sales?  Or the corrupt government sales?",
                "13% seems low but the reason is because it's compared to Q1 2024 sales which were not as high.\n\nIf we compare to Q4 2024 (495,570 deliveries) then it's a 32% drop!"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Kohl's changes DEI officer title, broadens supplier diversity program",
            "external_url": "https://www.reuters.com/business/retail-consumer/kohls-changes-dei-officer-title-broadens-supplier-diversity-program-2025-03-14/",
            "upvotes": 802,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Are they really just changing the name to \"inclusion and belonging\" because I have to say, if this is just a way to head fake the anti-DEI crowd it's kind of amazing.",
                "I mean that \"$60\" shirt for 10.99 was always going to be 10.99 so it's pretty on brand for them to change DEI to belonging and inclusion but keep it the same.",
                ">\"We have evolved our framework to focus on inclusion and belonging,\" said Michelle Banks, whose title changed from chief DEI officer to chief inclusion and belonging officer.\n\n\"Diversity\" is what tends to get mentioned, but it's not like Trump and MAGA cult members are fine with the E and I.",
                "ok ok ok kohl's I'll buy a shirt. I like that trick",
                "Redhats really love hating on three letter acronyms...",
                "My company just announced a similar change. Just a name rebrand with all the same groups dedicated to different categories. \nABLE - For folks with Disabilities.\nBEACON - Focus on black people in the work force and historical contributions  to the field I work in.\nPRIDE - Focuses on LGBTQAI+\n\nThese are just just a couple I can name at the top of my head, and being some what vague on purpose. I was really happy when they announced their continued commitment to these values in this political environment.",
                "Should just change it to **BEES**. **B**olstering **E**mployee **E**xcellence and **S**uccess.\n\nA diverse, inclusive, and equitable workforce is often a successful workforce. But instead of calling saying those terms outright, you just change them to what they *lead* to. You know, to throw the simple red hats off the scent.",
                "We just had a transgender remembrance day at work and we didn't die. Was amazing. Today is Holi. It's one thing celebrating having a diverse workforce. Hiding the intention from public view is an interesting strategy.",
                "My work changed DEI office to “employee engagement office”… shhh",
                "Got some cash just burning a whole in my pocket. Guess I'm going to Kohl's."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "US Supreme Court rejects medical marijuana firm's bid to avoid racketeering suit",
            "external_url": "https://www.reuters.com/legal/us-supreme-court-rejects-medical-marijuana-firms-bid-avoid-racketeering-suit-2025-04-02/",
            "upvotes": 501,
            "date": "04/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "RICO seems kind of ridiculous but companies should not be lying about the ingredients of products they sell. It’s why we have a robust regulatory system in place for this, and why it would be so devastating if said system were dismantled by a crackpot weirdo who is letting the brain worms take the wheel",
                "Does anyone on reddit read articles? The guy purchased CBD from this company, failed a drug test for THC then lost his job. ",
                "CBD products can legally contain up to 0.3% THC which is enough to cause you to fail a drug test. It’s like how Tic-Tacs can legally say they have 0 calories even though that’s not strictly factual.",
                "A little donation has proven to be the cure to this ailment…",
                "If it was a cocaine firm, donny Jr would have been all over it.",
                "They should hot box the capitol building so everyone will chill the f out.",
                "SCOTUS is permitting him to spend money to lose.",
                "Question: \"Is getting fired a business injury under RICO\".\n\nSupreme Court: Yes\n\n\nThat's it folks, everything else is people adding shit."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "NYC Mayor Eric Adams corruption case dismissed with prejudice, judge rules",
            "external_url": "https://www.cbsnews.com/newyork/news/nyc-mayor-eric-adams-corruption-case-dropped/",
            "upvotes": 8964,
            "date": "04/02/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/02/24/38534070-4ac0-48c8-98f7-131bee4a6782/thumbnail/1200x630/d6cab5ed83afe5450cd346e51971c2c0/gettyimages-2200888728.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Best system of justice money, bribes, and favors can buy",
                "Jesus, this is going to go down in the history books as one of the most corrupt cases ever and a highlight of just how bad the justice system in the US has gotten.\n\nThis is another case where the evidence is overwhelming, obvious, and blatant and he gets off scott free.",
                "Crimes are  legal now. Not that it wasn't always better for rich folks but you're getting banana republic levels of corruption now.",
                "Corruption everywhere! God bless America.",
                "Wild open air corruption",
                "To the surprise of absolutely no one",
                ">That means Adams cannot be re-tried on the same charges at a later time - a stipulation the Justice Department sought in its initial request to dismiss the case.\n\nSuch a fucking corrupt administration.",
                ">“Some will undoubtedly find today’s decision unsatisfying, wondering why, if DOJ’s ostensible reasons for dropping this case are so troubling, the Court does not simply deny the Motion to Dismiss altogether. But, as explained above, the Court cannot order DOJ to continue the prosecution, and it is aware of no authority (outside of the criminal contempt context) that would empower it, as some have urged, to appoint an independent prosecutor,” Judge Ho wrote. “Therefore, any decision by this Court to deny the Government’s Motion to Dismiss would be futile at best, because DOJ could—and, by all indications, unequivocally would—simply refuse to prosecute the case, inevitably resulting in a dismissal after seventy days for violating the Mayor’s right to a speedy trial. That route would simply postpone finality in this case to a date uncomfortably close to the June 24 mayoral primary. The public interest would not be served by such an outcome.”\n\nSo basically the judge is saying, “Yes, the reasons DOJ wanted this dismissed are bad, but I can’t force the prosecution to do their jobs, and if I dismiss with prejudice now they can’t hold these charges over the head of an elected official to manipulate them.”. These are the hard choices people have to make when the government has gone rogue and isn’t interested in prosecuting someone who, by all accounts, very obviously took bribes from a foreign government.",
                "This just sets us on a path where the president, with judicial consent, can decide himself what laws are, and are not, enforceable.",
                "The Trump admin wanted this case dismissed without prejudice, meaning that it could be brought against Adams at a later date. The request would have left the case hanging over Adams' head so that if he did not do exactly what the Trump admin asked, they could refile charges and prosecute Adams as punishment for defying the Trump admin.  It was, in every sense of the word, leverage. A quid pro quo.\n\nThe Judge dismissed the case with prejudice, meaning it cannot be resurrected no matter what happens and there is no longer this leverage hanging over Adam's head. Of course, former prosecutors in the case maintained that Adams was guilty, and given federal prosecutors win rate at trial, you would assume he would have been convicted here.  Eric Adams just hit the lottery.  A very corrupt lottery."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Girl killed by friend while playing with gun in Sacramento, sheriff says",
            "external_url": "https://www.cbsnews.com/sacramento/news/girl-killed-while-teens-play-with-gun-in-sacramento/",
            "upvotes": 450,
            "date": "04/02/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/01/cd6a9a38-d806-4e59-903b-b3126d799d12/thumbnail/1200x630/aeab7ee7d3e86e220c14694f4896ae75/gettyimages-1889004791.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "from the article:\n\n01 April 2025\n\nSACRAMENTO — A teenager who killed his friend while they were playing with a gun at a south Sacramento home over the weekend has been arrested, authorities said Tuesday:\n\n>The Sacramento County Sheriff's Office said it happened Sunday afternoon at a home on Chriswoods Court. \n\n>Several minors were located at the home during the time of the incident, but authorities said the alleged shooter was a male teen and the victim was a female teen, both 16.\n\n>Investigators learned that the male teen had brought the gun to the home. After they had been playing with the gun, the male teen had shot the female teen in the head and left the scene with the firearm before law enforcement arrived, the sheriff's office said.\n\n>The girl was declared dead at the scene by first responders.\n\n>Authorities said several other minors were detained when law enforcement arrived, as the circumstances of the shooting were still under investigation.\n\n>It was Tuesday morning in Stockton when law enforcement officials located and arrested the alleged shooter. He was booked into the Sacramento County Juvenile Hall on a murder charge, the sheriff's office said.\n\n>Prior to his arrest, investigators said it was revealed the teen had three outstanding felony warrants and had a history of arrests for weapons violations and sex crimes.\n\n>Neither of the involved individuals was identified.",
                "Playing with? Exactly what were they playing?",
                "Terrible. Go find your teenager right now and remind them if anyone they know starts flashing a gun even just to be a show off - that person is a danger and you need to gtfo of there.",
                "[deleted]",
                "They’re *16*! I don’t buy for a second it was an accident. The boy shot the girl in the head and fled the scene!",
                "if they were literal children sure but they’re 16 years old that kid most definitely intended to shoot and kill or should at least be charged with voluntary manslaughter",
                "Guns are not toys.\n\nGuns are not to be \"played\" with.\n\nTeach your children to respect firearms.",
                "[deleted]",
                "Forever making invalid the argument that \"guns don't kill people\".",
                "for a country that's so gung ho about their guns, it sure looks like they should have the least amount of guns available"
            ],
            "aggregate_sentiment": 50.0
        }
    ],
    "last_updated": "04/02/2025 20:09:29 UTC"
}