{
    "posts": [
        {
            "category": "HOT",
            "title": "The FDA approves first U.S. at-home tool as a Pap-smear alternative",
            "external_url": "https://www.npr.org/2025/05/10/nx-s1-5394446/fda-cervical-cancer-screening-at-home-tool-pap-smear",
            "upvotes": 1152,
            "date": "05/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2500x1406+0+130/resize/1400/quality/100/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4f%2F9a%2Fd177b2534555b2b79a3e860ac46f%2Fimage-1.png",
            "top_comments": [
                "This tiny spot of good news is like when it rains *very lightly* for like 6 seconds, during a raging hellfire inferno that's destroying everything around you. ",
                "*Article Text by Jennifer Ludden:* \n\nThe Food and Drug administration has approved the U.S.'s first at-home alternative to the Pap smear, a procedure generations of women have dreaded and often found painful.\n\nThe new device by Teal Health will offer a \"much preferred experience,\" the company said in its announcement, and also aims to increase screening rates by making the procedure more convenient.\n\nTraditionally, gynecologists have inserted a cold metal speculum deep into a woman's vagina to scrape cells from the cervix.\n\nThe Teal Wand — \"built with empathy,\" the company said — uses a swab to collect a vaginal sample. Women will then mail the sample to a lab that will screen for HPV (human papillomavirus), the virus that causes nearly all cervical cancers. A growing body of research has found HPV testing to be highly accurate.\n\nThe FDA approval Friday follows a U.S.-based study that found at-home screening was just as effective as that done in a doctor's office. The study also found women overwhelmingly preferred self–screening at home, and said they'd be more likely to stay up to date with cervical cancer screenings that way.\n\nEvery year, about 13,000 cases of cervical cancer are diagnosed, and more than 4,000 women die from the disease. Rates are down dramatically since Dr. Georgios Papanicolaou published a 1943 paper on how to use the Pap smear for screening, and it then became common.\n\nBut about a quarter of women in the U.S. are behind on such screenings, and medical experts say reducing that is key to the ultimate goal of eliminating cervical cancer. There's also a racial gap, with Black and Native American women far more likely to die from cervical cancer than white women. The HPV vaccine for teen and preteen girls, introduced in 2007, has also led to a global push to tackle the disease that way.\n\nAt-home cervical cancer screenings are already available in several other countries, including Australia and Sweden.\n\nTeal Health says its self-testing device will be available starting next month, in California first and then expanding. It will be by prescription, through a telehealth service, for women 25-65 years old who are \"at average risk.\" The company says it's working with insurance companies to provide coverage.",
                "Sweet fuck thank you. I had an iud put in that went terribly wrong, leading to the Dr having to caulderize my cervix. Since then, even pap smears are too much for me. I put them off as long as I can due to anxiety, clenching, and pain. I'll definitely be using this as soon as it's available.",
                "Is much rather do it myself because I can slow down or stop when I feel pain or discomfort. Someone else just rams it in there and the whole process doesn’t go fast enough so the discomfort and pain last longer. \n\nAlso, I had an inexperienced doctor react like she was revolted because she mistook what is a backed up sebaceous gland for an HPV wart. She literally jumped back from me and treated me like I was diseased. The HPV test was negative. I never went back to her and the last I heard she moved to the urgent care clinic where she belongs.",
                "So is it for vaginal samples or cervical, or both? The article flip-flops and it's not clear which it is.",
                "Canada’s had this for a while. Much better alternative.",
                "I've been avoiding my pap smear like the plague because of the gender dysphoria. Looking forward to this being available in AZ",
                "Finally!",
                "About freaking time. Next up, make contraception please!",
                "Does anyone think this will make it easier to deny us access to hospitals and OBGYN like they're doing in afghanistan?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Five fishermen who survived 55 days adrift by drinking rain and parboiling passing fish arrive in Galapagos",
            "external_url": "https://www.cnn.com/2025/05/10/americas/ecuador-fishermen-55-days-adrift-galapagos-latam-intl",
            "upvotes": 3728,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25130790691793.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "From AP:\n\n>QUITO, Ecuador (AP) — Five fishermen who spent 55 days adrift at sea arrived Saturday at a port in the Galapagos Islands after being rescued by a tuna boat, the Ecuadorian navy said on X.\n\n>The three Peruvians and two Colombians had been missing since mid-March and were found on May 7 by an Ecuadorian boat called Aldo.\n\n>The fishermen had reported damage to the boat’s alternator two days after setting sail from Pucusana Bay, to the south of Peru’s capital Lima, the navy said in a separate post on Friday.\n\n>The failure caused communication and navigation tools to malfunction, Ecuadorian navy Frigate Capt. Maria Fares told The Associated Press, adding that they had no power on the boat.\n\n>“They had no starter, lights and everything that a battery generates,” she said. To survive, they had to “take rusted water out of the engine (and) when a fish passed by, they caught it and parboiled it to eat.” Fares added that they also drank rain and sea water to survive.\n\n>The men are in stable condition and the navy said it is coordinating with local and foreign authorities to ensure their safe return to their respective countries.\n\n>Earlier this year, another Peruvian fisherman, 61-year-old Máximo Napa, spent [95 days](https://www.cnn.com/2025/03/18/americas/peruvian-fisherman-lost-at-sea-survived-intl-latam/index.html) at sea alone. He was also rescued by an Ecuadorian vessel and returned to Lima in mid-March to be reunited with his family.",
                "I see a movie where Tom Hanks plays all five of the fisherman.",
                "I feel dumb….am i supposed to know what parboiling is and how it is different from boiling?",
                "Give a man a meal and he'll eat. Teach a man to fish and he can survive for 55 days at sea.",
                "How exactly did they achieve boiling water?",
                "If those photos were taken right after rescue, those guys look great for having survived that kind of ordeal. Glad they were found safe.",
                "55 days adrift, 55 passing fish, 55 cups of rain, 100 tater tots, 155 taters",
                ">Weren't there 6 of you guys? Where did Hector go?\n\n\"We ate fish. We caught them as they passed us and we boiled them.\"\n\n>But your alternator was damaged, you didn't have any battery power, how did you boil them?\n\n\"We ate fish. We caught them as they passed us and we boiled them.\"",
                "Doesn't parboiling imply they're going to cook it further with another method afterwards?",
                "Spices are an often overlooked survival necessity."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Turkish Tufts University student back in Boston after release from Louisiana detention center",
            "external_url": "https://apnews.com/article/ozturk-tufts-mahdawi-columbia-student-detained-0067c5c43e9480fa0c3f5cbf779a0d97",
            "upvotes": 1503,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is the student that was the context of a recent [xkcd comic.](https://xkcd.com/3081/)",
                "Should never have been arrested.",
                "crazy to think that they arrested her for writing an op-ed in a campus daily that probably is only read by 600 ppl tops. She isn't a student protester, organizer or pro-Pali activist. She's a psychology grad student, not even from the Levant. This is totally Orwellian.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Judge pauses much of Trump administration’s massive downsizing of federal agencies",
            "external_url": "https://apnews.com/article/trump-mass-firings-doge-lawsuit-b41f5b43f428965fd60bc272e3854e3b",
            "upvotes": 19072,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">“But he must do so in lawful ways,” she said. “He must do so with the cooperation of Congress, the Constitution is structured that way.”\n\nThis is one of those checks-and-balances I heard so much about.\n\n>[\"I Donald John Trump do solemnly swear that I will faithfully execute the Office of President of the United States, and will to the best of my ability, preserve, protect and defend the Constitution of the United States.\"](https://youtu.be/hAJb7uTcgAw?si=h_JDb__1tQT1oLwj)\n\nI guess that means he has to do it, right?",
                "If you are willing to put thousands of Americans out of jobs suddenly and with little to no warning, you are NOT \"America First\".\n\nI give two shits whether it's govt jobs or otherwise. These are Americans. Keep them employed.",
                "How do you freeze something that happened months after the fact?",
                "What will happen next:\n\n* The Trump admin will not comply\n\n* The judge will demand to know why\n\n* The Trump admin will gaslight and lie to the judge\n\n* The judge will write a strongly worded opinion or letter\n\n* Nothing will ultimately happen",
                "We already lost 1/3 of our region at NOAA Fisheries to VERA/VSIP last month- and we ran on a skeleton crew already . shits bad, man",
                "Fuck traitor trump and his weak unamerican sheep",
                "Hard to be a shittier American than a Trump supporter these days",
                "It has nothing to do with cutting costs, and everything to do with weakening the power and oversight of the federal government so he and like-minded cronies can get away with crime and corruption.",
                "He will not comply. Asked to pause would be a better title.",
                "I feel like I’ve seen so many articles about judges putting a “pause” to things but then those things still happen…."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "India-Pakistan ceasefire appears to hold after accusations of violations",
            "external_url": "https://www.bbc.com/news/articles/cvg9d913v20o",
            "upvotes": 759,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2817/live/99e5c210-2dd9-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "Most countries do not want full scale war. There are times where they feel they need to make a show of force, and sometimes responses are necessary, but most of the time people are willing to back down. We saw the same with Israel and Iran.\n\n\nHopefully that holds here.",
                "I suppose given how close to the announcement the violations were, it was still possible to blame it on bad communications and maintain the peace. Good. Nuclear powers fighting one another isn't something we should be toying with.",
                "Cool!\n\nI’ll be back in a hour to see if this has fallen apart or not",
                "People in here seem very disappointed they can't go to war.",
                "Worldnews would have you believe war is the best possible outcome.",
                "Nothing...ever...happens.",
                "[removed]",
                "Its wild how quickly countries can agree to a ceasefire when both parties are acting in good faith.  I wish some other folks prolonging a war would follow suit.",
                "That’s because trump is such a genius.    /s",
                "Good, the excuse that a country has terrorists in it as a justification for attacking the entire country or people is so done, it's becoming the go excuse for attacking people you didn't like to start with."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Man checks out 100 books from Beachwood Library, then burns them in social media post",
            "external_url": "https://www.cleveland.com/community/2025/05/man-checks-out-100-books-from-beachwood-library-then-posts-on-social-media-video-of-those-books-burning.html?outputType=amp",
            "upvotes": 16161,
            "date": "05/10/2025",
            "thumbnail": "https://www.cleveland.com/resizer/v2/AVVKSQTABNCR3P5N6KUHGZL3WE.jpg?auth=534a7df2570bc1342c5c6565b3b848439af8474daac25ece06431a2a1bb53949&width=1280&quality=90",
            "top_comments": [
                "Charge him with destruction of public property.",
                "> The 100 books were valued at approximately $1,700. As the books were not yet overdue, the library will wait until they are overdue, then send a bill to the man.\n\nLibraries are awesome.",
                "If the library has a donation page I’ll happily donate",
                "Hopefully this results in a situation where people read copies of the burned books and donate to the library to improve its funding.\n\nEdit: According to the article, this disphit will be billed for the books once they are overdue and is banned from the library’s premises.",
                ">the man checked out 50 books on topics that included Jewish history, African-American history and LGBTQ education.\n\nGee, I wonder who he voted for.",
                "For readers, I wanna point out that today, May 10th, is the 80th anniversary of the book burnings in Nazi Germany in Berlin.\n\nCongrats, America.",
                "Now the library will buy those books again to replace them and the authors get double the income.",
                "Gotta let you guys know, beachwood is very, very Jewish.",
                "Most literate Trump supporter",
                "Burning books because you hate what they teach doesn’t make you powerful, it proves you’re scared of knowledge."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Hamas official says group holding direct talks with US in Qatar",
            "external_url": "https://www.bbc.com/news/articles/cx2q7749dxlo",
            "upvotes": 228,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/95f3/live/930a82b0-2ea0-11f0-8f57-b7237f6a66e6.jpg",
            "top_comments": [
                "Amazing what a $300M gifted private jet can do.",
                "I thought we don’t negotiate with terrorists",
                "They must have minerals....",
                "If the talks don't include the complete surrender of power of Hamas and their affiliates, then nothing will change.",
                "They won’t reach a deal. Trump wants a win and switched tracks from Ukraine to Israel/Palestine after Putin kept snubbing him.\n\nThere’s a non-insignificant chance Putin calls up Iran and tells it to tell Hamas not to accept or at least honor any deal. Putin loves humiliating his stooge in the White House.",
                "This blockade is absolutely disgusting. Anyone supporting the zionist entity is part of the problem.\n\nIf you can’t see how this is genocide, there’s no more explaining to do. These kids are STARVING. Enough with the back and forth and open the borders. What is wrong with this world!!!",
                "If this doesn't include the complete dissolution of HAMAS, then we will be in this exact same spot maybe 20 or so years down the line."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "1 dead, dozens injured in fiery tour bus collision near Los Angeles",
            "external_url": "https://abcnews.go.com/US/1-dead-dozens-injured-fiery-tour-bus-collision/story?id=121691111",
            "upvotes": 124,
            "date": "05/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/686f722f-a7b2-41f6-91a9-bce0ea5f548f/la-bus-crash-kabc-250511_1746979953427_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">The driver of the Nissan, whose name was not immediately released, died at the scene after becoming trapped in the burning vehicle, the statement said.\n\nJesus, that's a horrific way to go. Hoping they were not conscious.",
                "Article by Bill Hutchinson\n\n>At least one person was killed and 32 others were injured in a fiery collision Sunday morning between a packed tour bus and a disabled SUV stalled on a freeway in Los Angeles County, authorities said.\n\n>The collision occurred just after 5 a.m. Pacific Time on State Route 60 near the unincorporated Los Angeles County community of Hacienda Heights east of downtown Los Angeles, according to a statement from Officer Zachary Salazar, a spokesman for the California Highway Patrol.\n\n>The tour bus was carrying 63 passengers when it collided with a Nissan Pathfinder that was disabled in the westbound lanes, the CHP said in a statement. The Nissan burst into flames as a result of the collision, the statement said.\n\n>The driver of the Nissan, whose name was not immediately released, died at the scene after becoming trapped in the burning vehicle, the statement said.\n\n>The fire did not spread to the tour bus but 32 of the 63 people aboard the vehicle were taken to local hospitals for treatment of injuries, according to Salazar.\n\n>The tour bus driver, identified by the CHP as Sui Sheng Du, slammed into the rear of the disabled SUV, according to a preliminary investigation by the CHP.\n\n>\"As a result of the impact, the Nissan Pathfinder became fully engulfed in flames, trapping the occupant,\" according to the CHP statement.\n\n>Following the collision, the bus veered to the right across multiple lanes of the freeway and crashed into a raised metal and wood guardrail along the right shoulder, the CHP said.\n\n>The Los Angeles County Fire Department said two bus passengers were in critical condition and the remaining victims suffered minor to moderate injuries.\n\n>Salazar said the tour bus was heading to Koreatown in downtown Los Angeles when the crash occurred. He said the bus was coming from Morongo Valley, about 110 miles east of Los Angeles.\n\n>Images of the bus taken by ABC Los Angeles station [KABC](https://abc7.com/post/1-dead-dozens-injured-fiery-crash-between-suv-tour-bus-hacienda-heights-california-highway-patrol-says/16384161/) showed substantial front-end damage to the vehicle.\n\n>It was not immediately clear what caused the SUV to become disabled, Salazar said.\n\n>The CHP said neither alcohol nor drugs appeared to be a factor in the crash.",
                "Very odd story.  Firstly, why is a bus full of tourists heading from Moreno Valley to Downtown at 5 AM?  Secondly, the 60 being a major freeway, was the Nissan just sitting in the middle of the freeway lane or pulled over to the side, and why was the driver still in the disabled car if it was in unsafe lane?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Kentucky Derby-winning jockey suspended, fined $62,000 for striking horse too many times",
            "external_url": "https://www.nbcnews.com/news/us-news/kentucky-derby-winning-jockey-suspended-fined-rcna206039",
            "upvotes": 5146,
            "date": "05/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250510-Junior-and-Sovereignt-ch-1444-462086.jpg",
            "top_comments": [
                "*Article Text By Mirna Alsharif and Matthew Mata:*\n\nThe jockey who rode Sovereignty to victory at the Kentucky Derby last week has been fined over $60,000 for striking the horse with his riding crop too many times during the race, according to the Horseracing Integrity and Safety Authority.\n\nJunior Alvarado was found to have struck the horse with his riding crop “more than the permitted amount” during last week’s race, violating the authority’s rules, it said in a statement Saturday.\n\nA penalty was imposed against Alvarado on Friday for committing the Class 3 violation and he was hit with a fine equating to 10% of his $310,000 winnings, the statement said. The fine was then doubled “pursuant to an escalating penalty structure for repeat riding crop violations within the previous 180 days,” resulting in a $62,000 fine, according to HISA.\n\nAlvarado was found to have struck Sovereignty eight times during the Kentucky Derby, which was his second offense in 180 days, per a HISA ruling. HISA protocol allows jockeys to strike horses a maximum of six times during a race.\n\nThe jockey was also suspended for two Kentucky racing days, May 29 and 30, as a result of the violation.\n\nThe jockey and Sovereignty won the 151st running of the Kentucky Derby last Saturday at Churchill Downs.",
                ">HISA protocol allows jockeys to strike horses a maximum of six times during a race.\n\n\nAh, so that's why Epona has six carrots in Zelda games.",
                "Yea but the horse will now makenthe owners millions of dollars in breeding fees. If im the horse owner id tell ny jockey to hit the horse as much as he wants and id pay the fine. $62k probably would cover the cost of one load of semen from the horse lol.",
                "\"HISA protocol allows jockeys to strike horses a maximum of six times during a race.\" \n\nJunior Alvarado was found to have exceeded the limit by 2.\n\nSo I suggest 2 flogs for Junior, and 6 flogs for the idiotic judges who came up with this rule and now banning flogging once and for all.",
                "Hopefully the jockey has learned a valuable lesson and from now on will only strike the horse an appropriate number of times.",
                "So 6 flogs = 2 pumps.  Got it.",
                "Some states have taken whips away from jockeys. Maybe Kentucky should join them.",
                "From a [reddit comment](https://www.reddit.com/r/horseracing/comments/1khhnmf/kentucky_derbywinning_jockey_of_sovereignty_fined/mr7vjyw/) in the horse racing sub by /u/BasisTraditional6588, not sure how accurate, but potentially it’s not as bad as it looks and the whips today are different than those historically used:\n\n> They're made of a type of foam. You can whip the shit out of yourself and it isn't particularly painful, even on bare skin and in sensitive areas. The sound and the sensation are absolutely used to continue encouraging the horse to move forward. The limit was put into place to prevent an obscene amount of strikes going down the stretch. It is absolutely possible to lose track with the adrenaline of everything, especially once a jockey and horse fall into rhythm. The only type of legal whip used in US racing now is usually fiberglass wrapped in thick foam. It is designed to cause a loud sound more than cause pain.\n\n> For the record, jockeys won't make millions riding one race: they take home roughly 10% of the earnings. Jose Alvarado took home $310,000 for his effort; he acknowledges his mistake, he understands he was one strike over, and he will pay his $31,000 fine.\nUnsure if links are allowed, but this is a pretty fair assessment of the use of whips in racing.\n\n> https://lightupracing.com/why-are-whips-used-in-racing/",
                "Horse racing is a disgusting “sport” and basically just legalized animal abuse.",
                "\"Sir, you spanked your horse too many times\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Hamas says Edan Alexander, last living American hostage in Gaza, will be released in truce efforts",
            "external_url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-05-11-2025-6a562aa1c6ce81bcc9ff4649e39ab937",
            "upvotes": 78,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Strange that Qatar gives Trump a giant jet and they bring Israel to the table enough to get hostages released.",
                "I still find it incredible Trump and Biden allowed any of this.\n\nThe deal always was if you take a US citizen hostage the marines will fuck you up.\n\nAmerica couldn’t have engineered two worse Presidents if they tried."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Hamas says Edan Alexander, last living American hostage in Gaza, will be released in truce efforts",
            "external_url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-05-11-2025-6a562aa1c6ce81bcc9ff4649e39ab937",
            "upvotes": 77,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Strange that Qatar gives Trump a giant jet and they bring Israel to the table enough to get hostages released.",
                "I still find it incredible Trump and Biden allowed any of this.\n\nThe deal always was if you take a US citizen hostage the marines will fuck you up.\n\nAmerica couldn’t have engineered two worse Presidents if they tried."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Hamas official says group holding direct talks with US in Qatar",
            "external_url": "https://www.bbc.com/news/articles/cx2q7749dxlo",
            "upvotes": 236,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/95f3/live/930a82b0-2ea0-11f0-8f57-b7237f6a66e6.jpg",
            "top_comments": [
                "Amazing what a $300M gifted private jet can do.",
                "I thought we don’t negotiate with terrorists",
                "They must have minerals....",
                "If the talks don't include the complete surrender of power of Hamas and their affiliates, then nothing will change.",
                "They won’t reach a deal. Trump wants a win and switched tracks from Ukraine to Israel/Palestine after Putin kept snubbing him.\n\nThere’s a non-insignificant chance Putin calls up Iran and tells it to tell Hamas not to accept or at least honor any deal. Putin loves humiliating his stooge in the White House.",
                "This blockade is absolutely disgusting. Anyone supporting the zionist entity is part of the problem.\n\nIf you can’t see how this is genocide, there’s no more explaining to do. These kids are STARVING. Enough with the back and forth and open the borders. What is wrong with this world!!!",
                "If this doesn't include the complete dissolution of HAMAS, then we will be in this exact same spot maybe 20 or so years down the line."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "1 dead, dozens injured in fiery tour bus collision near Los Angeles",
            "external_url": "https://abcnews.go.com/US/1-dead-dozens-injured-fiery-tour-bus-collision/story?id=121691111",
            "upvotes": 124,
            "date": "05/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/686f722f-a7b2-41f6-91a9-bce0ea5f548f/la-bus-crash-kabc-250511_1746979953427_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">The driver of the Nissan, whose name was not immediately released, died at the scene after becoming trapped in the burning vehicle, the statement said.\n\nJesus, that's a horrific way to go. Hoping they were not conscious.",
                "Article by Bill Hutchinson\n\n>At least one person was killed and 32 others were injured in a fiery collision Sunday morning between a packed tour bus and a disabled SUV stalled on a freeway in Los Angeles County, authorities said.\n\n>The collision occurred just after 5 a.m. Pacific Time on State Route 60 near the unincorporated Los Angeles County community of Hacienda Heights east of downtown Los Angeles, according to a statement from Officer Zachary Salazar, a spokesman for the California Highway Patrol.\n\n>The tour bus was carrying 63 passengers when it collided with a Nissan Pathfinder that was disabled in the westbound lanes, the CHP said in a statement. The Nissan burst into flames as a result of the collision, the statement said.\n\n>The driver of the Nissan, whose name was not immediately released, died at the scene after becoming trapped in the burning vehicle, the statement said.\n\n>The fire did not spread to the tour bus but 32 of the 63 people aboard the vehicle were taken to local hospitals for treatment of injuries, according to Salazar.\n\n>The tour bus driver, identified by the CHP as Sui Sheng Du, slammed into the rear of the disabled SUV, according to a preliminary investigation by the CHP.\n\n>\"As a result of the impact, the Nissan Pathfinder became fully engulfed in flames, trapping the occupant,\" according to the CHP statement.\n\n>Following the collision, the bus veered to the right across multiple lanes of the freeway and crashed into a raised metal and wood guardrail along the right shoulder, the CHP said.\n\n>The Los Angeles County Fire Department said two bus passengers were in critical condition and the remaining victims suffered minor to moderate injuries.\n\n>Salazar said the tour bus was heading to Koreatown in downtown Los Angeles when the crash occurred. He said the bus was coming from Morongo Valley, about 110 miles east of Los Angeles.\n\n>Images of the bus taken by ABC Los Angeles station [KABC](https://abc7.com/post/1-dead-dozens-injured-fiery-crash-between-suv-tour-bus-hacienda-heights-california-highway-patrol-says/16384161/) showed substantial front-end damage to the vehicle.\n\n>It was not immediately clear what caused the SUV to become disabled, Salazar said.\n\n>The CHP said neither alcohol nor drugs appeared to be a factor in the crash.",
                "Very odd story.  Firstly, why is a bus full of tourists heading from Moreno Valley to Downtown at 5 AM?  Secondly, the 60 being a major freeway, was the Nissan just sitting in the middle of the freeway lane or pulled over to the side, and why was the driver still in the disabled car if it was in unsafe lane?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Ground delay replaces ground stop at Atlanta airport",
            "external_url": "https://www.fox5atlanta.com/news/atlanta-airport-ground-stop-runway",
            "upvotes": 62,
            "date": "05/11/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5atlanta.com/www.fox5atlanta.com/content/uploads/2025/05/1280/720/gettyimages-2162432124.jpg?ve=1&tl=1",
            "top_comments": [
                "Crap, I hope it clears up before I fly through"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "The FDA approves first U.S. at-home tool as a Pap-smear alternative",
            "external_url": "https://www.npr.org/2025/05/10/nx-s1-5394446/fda-cervical-cancer-screening-at-home-tool-pap-smear",
            "upvotes": 1154,
            "date": "05/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2500x1406+0+130/resize/1400/quality/100/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4f%2F9a%2Fd177b2534555b2b79a3e860ac46f%2Fimage-1.png",
            "top_comments": [
                "This tiny spot of good news is like when it rains *very lightly* for like 6 seconds, during a raging hellfire inferno that's destroying everything around you. ",
                "*Article Text by Jennifer Ludden:* \n\nThe Food and Drug administration has approved the U.S.'s first at-home alternative to the Pap smear, a procedure generations of women have dreaded and often found painful.\n\nThe new device by Teal Health will offer a \"much preferred experience,\" the company said in its announcement, and also aims to increase screening rates by making the procedure more convenient.\n\nTraditionally, gynecologists have inserted a cold metal speculum deep into a woman's vagina to scrape cells from the cervix.\n\nThe Teal Wand — \"built with empathy,\" the company said — uses a swab to collect a vaginal sample. Women will then mail the sample to a lab that will screen for HPV (human papillomavirus), the virus that causes nearly all cervical cancers. A growing body of research has found HPV testing to be highly accurate.\n\nThe FDA approval Friday follows a U.S.-based study that found at-home screening was just as effective as that done in a doctor's office. The study also found women overwhelmingly preferred self–screening at home, and said they'd be more likely to stay up to date with cervical cancer screenings that way.\n\nEvery year, about 13,000 cases of cervical cancer are diagnosed, and more than 4,000 women die from the disease. Rates are down dramatically since Dr. Georgios Papanicolaou published a 1943 paper on how to use the Pap smear for screening, and it then became common.\n\nBut about a quarter of women in the U.S. are behind on such screenings, and medical experts say reducing that is key to the ultimate goal of eliminating cervical cancer. There's also a racial gap, with Black and Native American women far more likely to die from cervical cancer than white women. The HPV vaccine for teen and preteen girls, introduced in 2007, has also led to a global push to tackle the disease that way.\n\nAt-home cervical cancer screenings are already available in several other countries, including Australia and Sweden.\n\nTeal Health says its self-testing device will be available starting next month, in California first and then expanding. It will be by prescription, through a telehealth service, for women 25-65 years old who are \"at average risk.\" The company says it's working with insurance companies to provide coverage.",
                "Sweet fuck thank you. I had an iud put in that went terribly wrong, leading to the Dr having to caulderize my cervix. Since then, even pap smears are too much for me. I put them off as long as I can due to anxiety, clenching, and pain. I'll definitely be using this as soon as it's available.",
                "Is much rather do it myself because I can slow down or stop when I feel pain or discomfort. Someone else just rams it in there and the whole process doesn’t go fast enough so the discomfort and pain last longer. \n\nAlso, I had an inexperienced doctor react like she was revolted because she mistook what is a backed up sebaceous gland for an HPV wart. She literally jumped back from me and treated me like I was diseased. The HPV test was negative. I never went back to her and the last I heard she moved to the urgent care clinic where she belongs.",
                "So is it for vaginal samples or cervical, or both? The article flip-flops and it's not clear which it is.",
                "Canada’s had this for a while. Much better alternative.",
                "I've been avoiding my pap smear like the plague because of the gender dysphoria. Looking forward to this being available in AZ",
                "Finally!",
                "About freaking time. Next up, make contraception please!",
                "Does anyone think this will make it easier to deny us access to hospitals and OBGYN like they're doing in afghanistan?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "India-Pakistan ceasefire appears to hold after accusations of violations",
            "external_url": "https://www.bbc.com/news/articles/cvg9d913v20o",
            "upvotes": 763,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2817/live/99e5c210-2dd9-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "Most countries do not want full scale war. There are times where they feel they need to make a show of force, and sometimes responses are necessary, but most of the time people are willing to back down. We saw the same with Israel and Iran.\n\n\nHopefully that holds here.",
                "I suppose given how close to the announcement the violations were, it was still possible to blame it on bad communications and maintain the peace. Good. Nuclear powers fighting one another isn't something we should be toying with.",
                "Cool!\n\nI’ll be back in a hour to see if this has fallen apart or not",
                "People in here seem very disappointed they can't go to war.",
                "Worldnews would have you believe war is the best possible outcome.",
                "Nothing...ever...happens.",
                "[removed]",
                "Its wild how quickly countries can agree to a ceasefire when both parties are acting in good faith.  I wish some other folks prolonging a war would follow suit.",
                "That’s because trump is such a genius.    /s",
                "Good, the excuse that a country has terrorists in it as a justification for attacking the entire country or people is so done, it's becoming the go excuse for attacking people you didn't like to start with."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Turkish Tufts University student back in Boston after release from Louisiana detention center",
            "external_url": "https://apnews.com/article/ozturk-tufts-mahdawi-columbia-student-detained-0067c5c43e9480fa0c3f5cbf779a0d97",
            "upvotes": 1505,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is the student that was the context of a recent [xkcd comic.](https://xkcd.com/3081/)",
                "Should never have been arrested.",
                "crazy to think that they arrested her for writing an op-ed in a campus daily that probably is only read by 600 ppl tops. She isn't a student protester, organizer or pro-Pali activist. She's a psychology grad student, not even from the Levant. This is totally Orwellian.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Five fishermen who survived 55 days adrift by drinking rain and parboiling passing fish arrive in Galapagos",
            "external_url": "https://www.cnn.com/2025/05/10/americas/ecuador-fishermen-55-days-adrift-galapagos-latam-intl",
            "upvotes": 3724,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25130790691793.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "From AP:\n\n>QUITO, Ecuador (AP) — Five fishermen who spent 55 days adrift at sea arrived Saturday at a port in the Galapagos Islands after being rescued by a tuna boat, the Ecuadorian navy said on X.\n\n>The three Peruvians and two Colombians had been missing since mid-March and were found on May 7 by an Ecuadorian boat called Aldo.\n\n>The fishermen had reported damage to the boat’s alternator two days after setting sail from Pucusana Bay, to the south of Peru’s capital Lima, the navy said in a separate post on Friday.\n\n>The failure caused communication and navigation tools to malfunction, Ecuadorian navy Frigate Capt. Maria Fares told The Associated Press, adding that they had no power on the boat.\n\n>“They had no starter, lights and everything that a battery generates,” she said. To survive, they had to “take rusted water out of the engine (and) when a fish passed by, they caught it and parboiled it to eat.” Fares added that they also drank rain and sea water to survive.\n\n>The men are in stable condition and the navy said it is coordinating with local and foreign authorities to ensure their safe return to their respective countries.\n\n>Earlier this year, another Peruvian fisherman, 61-year-old Máximo Napa, spent [95 days](https://www.cnn.com/2025/03/18/americas/peruvian-fisherman-lost-at-sea-survived-intl-latam/index.html) at sea alone. He was also rescued by an Ecuadorian vessel and returned to Lima in mid-March to be reunited with his family.",
                "I see a movie where Tom Hanks plays all five of the fisherman.",
                "I feel dumb….am i supposed to know what parboiling is and how it is different from boiling?",
                "Give a man a meal and he'll eat. Teach a man to fish and he can survive for 55 days at sea.",
                "How exactly did they achieve boiling water?",
                "If those photos were taken right after rescue, those guys look great for having survived that kind of ordeal. Glad they were found safe.",
                "55 days adrift, 55 passing fish, 55 cups of rain, 100 tater tots, 155 taters",
                ">Weren't there 6 of you guys? Where did Hector go?\n\n\"We ate fish. We caught them as they passed us and we boiled them.\"\n\n>But your alternator was damaged, you didn't have any battery power, how did you boil them?\n\n\"We ate fish. We caught them as they passed us and we boiled them.\"",
                "Doesn't parboiling imply they're going to cook it further with another method afterwards?",
                "Spices are an often overlooked survival necessity."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Judge pauses much of Trump administration’s massive downsizing of federal agencies",
            "external_url": "https://apnews.com/article/trump-mass-firings-doge-lawsuit-b41f5b43f428965fd60bc272e3854e3b",
            "upvotes": 19082,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">“But he must do so in lawful ways,” she said. “He must do so with the cooperation of Congress, the Constitution is structured that way.”\n\nThis is one of those checks-and-balances I heard so much about.\n\n>[\"I Donald John Trump do solemnly swear that I will faithfully execute the Office of President of the United States, and will to the best of my ability, preserve, protect and defend the Constitution of the United States.\"](https://youtu.be/hAJb7uTcgAw?si=h_JDb__1tQT1oLwj)\n\nI guess that means he has to do it, right?",
                "If you are willing to put thousands of Americans out of jobs suddenly and with little to no warning, you are NOT \"America First\".\n\nI give two shits whether it's govt jobs or otherwise. These are Americans. Keep them employed.",
                "How do you freeze something that happened months after the fact?",
                "What will happen next:\n\n* The Trump admin will not comply\n\n* The judge will demand to know why\n\n* The Trump admin will gaslight and lie to the judge\n\n* The judge will write a strongly worded opinion or letter\n\n* Nothing will ultimately happen",
                "We already lost 1/3 of our region at NOAA Fisheries to VERA/VSIP last month- and we ran on a skeleton crew already . shits bad, man",
                "Fuck traitor trump and his weak unamerican sheep",
                "Hard to be a shittier American than a Trump supporter these days",
                "It has nothing to do with cutting costs, and everything to do with weakening the power and oversight of the federal government so he and like-minded cronies can get away with crime and corruption.",
                "He will not comply. Asked to pause would be a better title.",
                "I feel like I’ve seen so many articles about judges putting a “pause” to things but then those things still happen…."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "India and Pakistan accuse each other of 'violations' after ceasefire deal",
            "external_url": "https://www.bbc.co.uk/news/articles/cvg9d913v20o",
            "upvotes": 663,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2817/live/99e5c210-2dd9-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "Surprising exactly no one",
                "So do all the bots brigading.",
                "\"In wartime, truth is so precious that she should always be attended by a bodyguard of lies.\"\n\n\n--Winston Churchill",
                "isn't it 'funny' how Trump jumped into this within days, yet he's let Russia bomb the shit out of Ukraine and basically done nothing but try to rob them",
                "These stupid, ignorant, idiotic men are exactly why we need more women in politics all over the world.",
                "They probably did 🤷‍♂️.",
                "[removed]",
                "Nobody would give a fuck if none of them had spicy bombs. This childish behavior is just annoying at this point.   \nOtherwise i would just say to just get it over with already.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "The FDA approves first U.S. at-home tool as a Pap-smear alternative",
            "external_url": "https://www.npr.org/2025/05/10/nx-s1-5394446/fda-cervical-cancer-screening-at-home-tool-pap-smear",
            "upvotes": 1159,
            "date": "05/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2500x1406+0+130/resize/1400/quality/100/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4f%2F9a%2Fd177b2534555b2b79a3e860ac46f%2Fimage-1.png",
            "top_comments": [
                "This tiny spot of good news is like when it rains *very lightly* for like 6 seconds, during a raging hellfire inferno that's destroying everything around you. ",
                "*Article Text by Jennifer Ludden:* \n\nThe Food and Drug administration has approved the U.S.'s first at-home alternative to the Pap smear, a procedure generations of women have dreaded and often found painful.\n\nThe new device by Teal Health will offer a \"much preferred experience,\" the company said in its announcement, and also aims to increase screening rates by making the procedure more convenient.\n\nTraditionally, gynecologists have inserted a cold metal speculum deep into a woman's vagina to scrape cells from the cervix.\n\nThe Teal Wand — \"built with empathy,\" the company said — uses a swab to collect a vaginal sample. Women will then mail the sample to a lab that will screen for HPV (human papillomavirus), the virus that causes nearly all cervical cancers. A growing body of research has found HPV testing to be highly accurate.\n\nThe FDA approval Friday follows a U.S.-based study that found at-home screening was just as effective as that done in a doctor's office. The study also found women overwhelmingly preferred self–screening at home, and said they'd be more likely to stay up to date with cervical cancer screenings that way.\n\nEvery year, about 13,000 cases of cervical cancer are diagnosed, and more than 4,000 women die from the disease. Rates are down dramatically since Dr. Georgios Papanicolaou published a 1943 paper on how to use the Pap smear for screening, and it then became common.\n\nBut about a quarter of women in the U.S. are behind on such screenings, and medical experts say reducing that is key to the ultimate goal of eliminating cervical cancer. There's also a racial gap, with Black and Native American women far more likely to die from cervical cancer than white women. The HPV vaccine for teen and preteen girls, introduced in 2007, has also led to a global push to tackle the disease that way.\n\nAt-home cervical cancer screenings are already available in several other countries, including Australia and Sweden.\n\nTeal Health says its self-testing device will be available starting next month, in California first and then expanding. It will be by prescription, through a telehealth service, for women 25-65 years old who are \"at average risk.\" The company says it's working with insurance companies to provide coverage.",
                "Sweet fuck thank you. I had an iud put in that went terribly wrong, leading to the Dr having to caulderize my cervix. Since then, even pap smears are too much for me. I put them off as long as I can due to anxiety, clenching, and pain. I'll definitely be using this as soon as it's available.",
                "Is much rather do it myself because I can slow down or stop when I feel pain or discomfort. Someone else just rams it in there and the whole process doesn’t go fast enough so the discomfort and pain last longer. \n\nAlso, I had an inexperienced doctor react like she was revolted because she mistook what is a backed up sebaceous gland for an HPV wart. She literally jumped back from me and treated me like I was diseased. The HPV test was negative. I never went back to her and the last I heard she moved to the urgent care clinic where she belongs.",
                "So is it for vaginal samples or cervical, or both? The article flip-flops and it's not clear which it is.",
                "Canada’s had this for a while. Much better alternative.",
                "I've been avoiding my pap smear like the plague because of the gender dysphoria. Looking forward to this being available in AZ",
                "Finally!",
                "About freaking time. Next up, make contraception please!",
                "Does anyone think this will make it easier to deny us access to hospitals and OBGYN like they're doing in afghanistan?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Turkish Tufts University student back in Boston after release from Louisiana detention center",
            "external_url": "https://apnews.com/article/ozturk-tufts-mahdawi-columbia-student-detained-0067c5c43e9480fa0c3f5cbf779a0d97",
            "upvotes": 1505,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is the student that was the context of a recent [xkcd comic.](https://xkcd.com/3081/)",
                "Should never have been arrested.",
                "crazy to think that they arrested her for writing an op-ed in a campus daily that probably is only read by 600 ppl tops. She isn't a student protester, organizer or pro-Pali activist. She's a psychology grad student, not even from the Levant. This is totally Orwellian.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Hamas official says group holding direct talks with US in Qatar",
            "external_url": "https://www.bbc.com/news/articles/cx2q7749dxlo",
            "upvotes": 232,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/95f3/live/930a82b0-2ea0-11f0-8f57-b7237f6a66e6.jpg",
            "top_comments": [
                "Amazing what a $300M gifted private jet can do.",
                "I thought we don’t negotiate with terrorists",
                "They must have minerals....",
                "If the talks don't include the complete surrender of power of Hamas and their affiliates, then nothing will change.",
                "They won’t reach a deal. Trump wants a win and switched tracks from Ukraine to Israel/Palestine after Putin kept snubbing him.\n\nThere’s a non-insignificant chance Putin calls up Iran and tells it to tell Hamas not to accept or at least honor any deal. Putin loves humiliating his stooge in the White House.",
                "This blockade is absolutely disgusting. Anyone supporting the zionist entity is part of the problem.\n\nIf you can’t see how this is genocide, there’s no more explaining to do. These kids are STARVING. Enough with the back and forth and open the borders. What is wrong with this world!!!",
                "If this doesn't include the complete dissolution of HAMAS, then we will be in this exact same spot maybe 20 or so years down the line."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "India-Pakistan ceasefire appears to hold after accusations of violations",
            "external_url": "https://www.bbc.com/news/articles/cvg9d913v20o",
            "upvotes": 762,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2817/live/99e5c210-2dd9-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "Most countries do not want full scale war. There are times where they feel they need to make a show of force, and sometimes responses are necessary, but most of the time people are willing to back down. We saw the same with Israel and Iran.\n\n\nHopefully that holds here.",
                "I suppose given how close to the announcement the violations were, it was still possible to blame it on bad communications and maintain the peace. Good. Nuclear powers fighting one another isn't something we should be toying with.",
                "Cool!\n\nI’ll be back in a hour to see if this has fallen apart or not",
                "People in here seem very disappointed they can't go to war.",
                "Worldnews would have you believe war is the best possible outcome.",
                "Nothing...ever...happens.",
                "[removed]",
                "Its wild how quickly countries can agree to a ceasefire when both parties are acting in good faith.  I wish some other folks prolonging a war would follow suit.",
                "That’s because trump is such a genius.    /s",
                "Good, the excuse that a country has terrorists in it as a justification for attacking the entire country or people is so done, it's becoming the go excuse for attacking people you didn't like to start with."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Five fishermen who survived 55 days adrift by drinking rain and parboiling passing fish arrive in Galapagos",
            "external_url": "https://www.cnn.com/2025/05/10/americas/ecuador-fishermen-55-days-adrift-galapagos-latam-intl",
            "upvotes": 3735,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25130790691793.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "From AP:\n\n>QUITO, Ecuador (AP) — Five fishermen who spent 55 days adrift at sea arrived Saturday at a port in the Galapagos Islands after being rescued by a tuna boat, the Ecuadorian navy said on X.\n\n>The three Peruvians and two Colombians had been missing since mid-March and were found on May 7 by an Ecuadorian boat called Aldo.\n\n>The fishermen had reported damage to the boat’s alternator two days after setting sail from Pucusana Bay, to the south of Peru’s capital Lima, the navy said in a separate post on Friday.\n\n>The failure caused communication and navigation tools to malfunction, Ecuadorian navy Frigate Capt. Maria Fares told The Associated Press, adding that they had no power on the boat.\n\n>“They had no starter, lights and everything that a battery generates,” she said. To survive, they had to “take rusted water out of the engine (and) when a fish passed by, they caught it and parboiled it to eat.” Fares added that they also drank rain and sea water to survive.\n\n>The men are in stable condition and the navy said it is coordinating with local and foreign authorities to ensure their safe return to their respective countries.\n\n>Earlier this year, another Peruvian fisherman, 61-year-old Máximo Napa, spent [95 days](https://www.cnn.com/2025/03/18/americas/peruvian-fisherman-lost-at-sea-survived-intl-latam/index.html) at sea alone. He was also rescued by an Ecuadorian vessel and returned to Lima in mid-March to be reunited with his family.",
                "I see a movie where Tom Hanks plays all five of the fisherman.",
                "I feel dumb….am i supposed to know what parboiling is and how it is different from boiling?",
                "Give a man a meal and he'll eat. Teach a man to fish and he can survive for 55 days at sea.",
                "How exactly did they achieve boiling water?",
                "If those photos were taken right after rescue, those guys look great for having survived that kind of ordeal. Glad they were found safe.",
                "55 days adrift, 55 passing fish, 55 cups of rain, 100 tater tots, 155 taters",
                ">Weren't there 6 of you guys? Where did Hector go?\n\n\"We ate fish. We caught them as they passed us and we boiled them.\"\n\n>But your alternator was damaged, you didn't have any battery power, how did you boil them?\n\n\"We ate fish. We caught them as they passed us and we boiled them.\"",
                "Doesn't parboiling imply they're going to cook it further with another method afterwards?",
                "Spices are an often overlooked survival necessity."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Judge pauses much of Trump administration’s massive downsizing of federal agencies",
            "external_url": "https://apnews.com/article/trump-mass-firings-doge-lawsuit-b41f5b43f428965fd60bc272e3854e3b",
            "upvotes": 19080,
            "date": "05/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">“But he must do so in lawful ways,” she said. “He must do so with the cooperation of Congress, the Constitution is structured that way.”\n\nThis is one of those checks-and-balances I heard so much about.\n\n>[\"I Donald John Trump do solemnly swear that I will faithfully execute the Office of President of the United States, and will to the best of my ability, preserve, protect and defend the Constitution of the United States.\"](https://youtu.be/hAJb7uTcgAw?si=h_JDb__1tQT1oLwj)\n\nI guess that means he has to do it, right?",
                "If you are willing to put thousands of Americans out of jobs suddenly and with little to no warning, you are NOT \"America First\".\n\nI give two shits whether it's govt jobs or otherwise. These are Americans. Keep them employed.",
                "How do you freeze something that happened months after the fact?",
                "What will happen next:\n\n* The Trump admin will not comply\n\n* The judge will demand to know why\n\n* The Trump admin will gaslight and lie to the judge\n\n* The judge will write a strongly worded opinion or letter\n\n* Nothing will ultimately happen",
                "We already lost 1/3 of our region at NOAA Fisheries to VERA/VSIP last month- and we ran on a skeleton crew already . shits bad, man",
                "Fuck traitor trump and his weak unamerican sheep",
                "Hard to be a shittier American than a Trump supporter these days",
                "It has nothing to do with cutting costs, and everything to do with weakening the power and oversight of the federal government so he and like-minded cronies can get away with crime and corruption.",
                "He will not comply. Asked to pause would be a better title.",
                "I feel like I’ve seen so many articles about judges putting a “pause” to things but then those things still happen…."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Man checks out 100 books from Beachwood Library, then burns them in social media post",
            "external_url": "https://www.cleveland.com/community/2025/05/man-checks-out-100-books-from-beachwood-library-then-posts-on-social-media-video-of-those-books-burning.html?outputType=amp",
            "upvotes": 16157,
            "date": "05/10/2025",
            "thumbnail": "https://www.cleveland.com/resizer/v2/AVVKSQTABNCR3P5N6KUHGZL3WE.jpg?auth=534a7df2570bc1342c5c6565b3b848439af8474daac25ece06431a2a1bb53949&width=1280&quality=90",
            "top_comments": [
                "Charge him with destruction of public property.",
                "> The 100 books were valued at approximately $1,700. As the books were not yet overdue, the library will wait until they are overdue, then send a bill to the man.\n\nLibraries are awesome.",
                "If the library has a donation page I’ll happily donate",
                "Hopefully this results in a situation where people read copies of the burned books and donate to the library to improve its funding.\n\nEdit: According to the article, this disphit will be billed for the books once they are overdue and is banned from the library’s premises.",
                ">the man checked out 50 books on topics that included Jewish history, African-American history and LGBTQ education.\n\nGee, I wonder who he voted for.",
                "For readers, I wanna point out that today, May 10th, is the 80th anniversary of the book burnings in Nazi Germany in Berlin.\n\nCongrats, America.",
                "Now the library will buy those books again to replace them and the authors get double the income.",
                "Gotta let you guys know, beachwood is very, very Jewish.",
                "Most literate Trump supporter",
                "Burning books because you hate what they teach doesn’t make you powerful, it proves you’re scared of knowledge."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "1 dead, dozens injured in fiery tour bus collision near Los Angeles",
            "external_url": "https://abcnews.go.com/US/1-dead-dozens-injured-fiery-tour-bus-collision/story?id=121691111",
            "upvotes": 125,
            "date": "05/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/686f722f-a7b2-41f6-91a9-bce0ea5f548f/la-bus-crash-kabc-250511_1746979953427_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">The driver of the Nissan, whose name was not immediately released, died at the scene after becoming trapped in the burning vehicle, the statement said.\n\nJesus, that's a horrific way to go. Hoping they were not conscious.",
                "Article by Bill Hutchinson\n\n>At least one person was killed and 32 others were injured in a fiery collision Sunday morning between a packed tour bus and a disabled SUV stalled on a freeway in Los Angeles County, authorities said.\n\n>The collision occurred just after 5 a.m. Pacific Time on State Route 60 near the unincorporated Los Angeles County community of Hacienda Heights east of downtown Los Angeles, according to a statement from Officer Zachary Salazar, a spokesman for the California Highway Patrol.\n\n>The tour bus was carrying 63 passengers when it collided with a Nissan Pathfinder that was disabled in the westbound lanes, the CHP said in a statement. The Nissan burst into flames as a result of the collision, the statement said.\n\n>The driver of the Nissan, whose name was not immediately released, died at the scene after becoming trapped in the burning vehicle, the statement said.\n\n>The fire did not spread to the tour bus but 32 of the 63 people aboard the vehicle were taken to local hospitals for treatment of injuries, according to Salazar.\n\n>The tour bus driver, identified by the CHP as Sui Sheng Du, slammed into the rear of the disabled SUV, according to a preliminary investigation by the CHP.\n\n>\"As a result of the impact, the Nissan Pathfinder became fully engulfed in flames, trapping the occupant,\" according to the CHP statement.\n\n>Following the collision, the bus veered to the right across multiple lanes of the freeway and crashed into a raised metal and wood guardrail along the right shoulder, the CHP said.\n\n>The Los Angeles County Fire Department said two bus passengers were in critical condition and the remaining victims suffered minor to moderate injuries.\n\n>Salazar said the tour bus was heading to Koreatown in downtown Los Angeles when the crash occurred. He said the bus was coming from Morongo Valley, about 110 miles east of Los Angeles.\n\n>Images of the bus taken by ABC Los Angeles station [KABC](https://abc7.com/post/1-dead-dozens-injured-fiery-crash-between-suv-tour-bus-hacienda-heights-california-highway-patrol-says/16384161/) showed substantial front-end damage to the vehicle.\n\n>It was not immediately clear what caused the SUV to become disabled, Salazar said.\n\n>The CHP said neither alcohol nor drugs appeared to be a factor in the crash.",
                "Very odd story.  Firstly, why is a bus full of tourists heading from Moreno Valley to Downtown at 5 AM?  Secondly, the 60 being a major freeway, was the Nissan just sitting in the middle of the freeway lane or pulled over to the side, and why was the driver still in the disabled car if it was in unsafe lane?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Kentucky Derby-winning jockey suspended, fined $62,000 for striking horse too many times",
            "external_url": "https://www.nbcnews.com/news/us-news/kentucky-derby-winning-jockey-suspended-fined-rcna206039",
            "upvotes": 5144,
            "date": "05/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250510-Junior-and-Sovereignt-ch-1444-462086.jpg",
            "top_comments": [
                "*Article Text By Mirna Alsharif and Matthew Mata:*\n\nThe jockey who rode Sovereignty to victory at the Kentucky Derby last week has been fined over $60,000 for striking the horse with his riding crop too many times during the race, according to the Horseracing Integrity and Safety Authority.\n\nJunior Alvarado was found to have struck the horse with his riding crop “more than the permitted amount” during last week’s race, violating the authority’s rules, it said in a statement Saturday.\n\nA penalty was imposed against Alvarado on Friday for committing the Class 3 violation and he was hit with a fine equating to 10% of his $310,000 winnings, the statement said. The fine was then doubled “pursuant to an escalating penalty structure for repeat riding crop violations within the previous 180 days,” resulting in a $62,000 fine, according to HISA.\n\nAlvarado was found to have struck Sovereignty eight times during the Kentucky Derby, which was his second offense in 180 days, per a HISA ruling. HISA protocol allows jockeys to strike horses a maximum of six times during a race.\n\nThe jockey was also suspended for two Kentucky racing days, May 29 and 30, as a result of the violation.\n\nThe jockey and Sovereignty won the 151st running of the Kentucky Derby last Saturday at Churchill Downs.",
                ">HISA protocol allows jockeys to strike horses a maximum of six times during a race.\n\n\nAh, so that's why Epona has six carrots in Zelda games.",
                "Yea but the horse will now makenthe owners millions of dollars in breeding fees. If im the horse owner id tell ny jockey to hit the horse as much as he wants and id pay the fine. $62k probably would cover the cost of one load of semen from the horse lol.",
                "\"HISA protocol allows jockeys to strike horses a maximum of six times during a race.\" \n\nJunior Alvarado was found to have exceeded the limit by 2.\n\nSo I suggest 2 flogs for Junior, and 6 flogs for the idiotic judges who came up with this rule and now banning flogging once and for all.",
                "Hopefully the jockey has learned a valuable lesson and from now on will only strike the horse an appropriate number of times.",
                "So 6 flogs = 2 pumps.  Got it.",
                "Some states have taken whips away from jockeys. Maybe Kentucky should join them.",
                "From a [reddit comment](https://www.reddit.com/r/horseracing/comments/1khhnmf/kentucky_derbywinning_jockey_of_sovereignty_fined/mr7vjyw/) in the horse racing sub by /u/BasisTraditional6588, not sure how accurate, but potentially it’s not as bad as it looks and the whips today are different than those historically used:\n\n> They're made of a type of foam. You can whip the shit out of yourself and it isn't particularly painful, even on bare skin and in sensitive areas. The sound and the sensation are absolutely used to continue encouraging the horse to move forward. The limit was put into place to prevent an obscene amount of strikes going down the stretch. It is absolutely possible to lose track with the adrenaline of everything, especially once a jockey and horse fall into rhythm. The only type of legal whip used in US racing now is usually fiberglass wrapped in thick foam. It is designed to cause a loud sound more than cause pain.\n\n> For the record, jockeys won't make millions riding one race: they take home roughly 10% of the earnings. Jose Alvarado took home $310,000 for his effort; he acknowledges his mistake, he understands he was one strike over, and he will pay his $31,000 fine.\nUnsure if links are allowed, but this is a pretty fair assessment of the use of whips in racing.\n\n> https://lightupracing.com/why-are-whips-used-in-racing/",
                "Horse racing is a disgusting “sport” and basically just legalized animal abuse.",
                "\"Sir, you spanked your horse too many times\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Lithium deposit valued at $1.5 trillion discovered in the U.S.",
            "external_url": "https://www.earth.com/news/volcanic-white-gold-a-lithium-deposit-valued-at-1-5-trillion-has-been-discovered-in-the-u-s/",
            "upvotes": 33214,
            "date": "05/10/2025",
            "thumbnail": "https://cff2.earth.com/uploads/2025/05/09071935/lithium-mine_McDermitt-Caldera_1-5-trillion-dollars_1m.jpg",
            "top_comments": [
                "Gorman County, Oregon.",
                "The children yearn for the mines",
                "This was discovered several years ago. It's not news.",
                "We should invade and win the hearts and minds of the people by building roads and schools.",
                "Finding the deposit is \"easy\".\n\nMining it is a little trickier.\n\nTurning it into \\_\\_usable\\_\\_ lithium. Thats the HARD part that needs a lot of infrastructure, power and skill.\n\nThere is a new one under construction in California. Its a $1.8Bln facility, owned by an Australian company. Otherwise the ore has to be export to Australia, Chile or China. The US does have some other processing capabilities, but its mostly the Aussies with the know-how (I guess it involves using shitty beer to do it? j/k). \n\nBear in mind that if its processed abroad thats 2 x shipping costs, plus hazards materials handling, plus a tariff.\n\nSo that $1.8Bln plant, even if its a smaller facility, will be really useful! But its not going to be able to handle all of it, or in a timely manner.\n\nThis is a good link for more info: [Lithium Supply Chain: Understanding the Basics | Shipping and Commodity Academy](https://shippingandcommodityacademy.com/blog/lithium-supply-chain-understanding-the-basics/) (other pages exist but they all say about the same thing. Obviously the \"US reserves\" are now slightly higher than on that page mind).",
                "There are many sites with (BIG NUMBER) valued lithium.  The problem was how much the extraction and refining cost compared to (BIG NUMBER).  It frequently translated to close to, or exceeded,  (BIG NUMBER).\n\n  \nJust like there are a number of 'rare earth mineral' deposits in the U.S....they just aren't practical to extract.",
                "Jesus that website is trash. Over half my screen was covered in undeletable ads. Couldn't even read the damn article.",
                "If you've ever been out there - it seems like nothing but desert and high desert/mountains,  but look at the area as the watershed that feeds into the Columbia river and the underground aquifers that also feed into the Columbia river and all the tributaries hence forth.\n\nThey can't just go in their and extract it if it's going to hurt the watersheds of the west.\n\nI worked near two superfund sites - I live near superfund site about 15 miles south of me.\n\nExamples:\n\nThe entire south end of Vashon Island and Ruston area (Tacoma WA metro) is contaminated with exaust tailings to the point where plants harvested there contain those chemicals like lead to this day. (There's a summer camp there that predates the smokestacks that kids roll around in the dirt right THERE.) \n\nIn Butte, Montana and subsequently a 200 mile radius and anywhere in the MT/WY/NV area there are both smokestack areas of contamination and pools of deadly chemicals leftover from the 1800s-1970s. Pools of arsenic and lead. If you've been there you know.  Cows and horses just walk around grazing in these areas.\n\nPicher, Oklahoma - \"the most toxic ghost town\" in the USA. The entire story is a trip. Silent Hill type stuff. I went to a museum exhibit on it in Norman.\n\nEdmond, OK - currently having to treat it's watershed contaminated with fracking juices - oh but they won't tell you that.  They just want to see you bougie houses and ride out the earthquakes.  (source - Geologist who works for oil company who quit over it I dated - so dubious.) \n\nQuestion is not \"We make money now\"\n\nbut \"Where will we live AFTER the mine closes and we don't make money anymore?\"\n\nExample of Lithium Extract- from source:\n\n# Brine Extraction\n\nBrine extraction is another method of extracting lithium. This method involves pumping brine from underground aquifers into evaporation ponds. The sun and wind evaporate the water, leaving behind lithium and other minerals. The following are the steps involved in brine extraction:\n\n* Drilling: Wells are drilled into the ground to access the brine.\n* Pumping: The brine is pumped to the surface and transported to the evaporation ponds.\n* Evaporation: The brine is evaporated in the ponds, leaving behind lithium and other minerals.\n* Processing: The extracted lithium is then processed to produce lithium carbonate or other lithium compounds.\n\nBrine extraction is a less costly and less energy-intensive method of extracting lithium. It is also less harmful to the environment than hard rock mining. However, it is highly dependent on weather conditions, and the process can take several months to complete.\n\nOverall, both hard rock mining and brine extraction have their advantages and disadvantages. Companies choose the method that suits their needs and resources.\n\n#",
                "For those unaware, the U.S. has lithium in a ton of places but as of now the only real site that is extracting lithium in any meaningful capacity is in Nevada. There is a site that has been identified for development in Arizona as well.\n\nBut all of that is sort of moot because right now virtually all REFINING of lithium has to go through China so absent developing that domestic refining we won’t be gaining independence any time soon.",
                "It's never the issue whether we have lithium mine or not. We always have the. It's just the environmental cost to mine and produce it."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/11/2025 20:08:49 UTC"
}