{
    "posts": [
        {
            "category": "HOT",
            "title": "US government report cited non-existent sources, academics say",
            "external_url": "https://www.bbc.com/news/articles/cdj98vrzpyvo",
            "upvotes": 3130,
            "date": "05/30/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4d9f/live/00b2ae80-3d30-11f0-b1db-7b03bfaa8894.jpg",
            "top_comments": [
                "Cause it was written by ChatGPT.",
                "Considering that they didn't just fabricate studies, but also tried to associate them with real and credible professors, scientists etc makes me think this is something they could be sued over...",
                "\"A US government report on children's health cited \"totally fabricated\" studies to back up its findings, academics wrongly listed as the authors of those studies have said.\n\n...\n\nWhite House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report\".\n\n...\n\nBut the authors of several studies cited in the report told news outlets they did not write them, and that the studies never existed.\n\nGuohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\nHe was listed as an author alongside Noah Kreski, a researcher at Columbia University, who also denied writing it, telling AFP it \"doesn't appear to be a study that exists at all.\"\n\nKatherine Keyes, an epidemiology professor who told news agency Reuters she was also wrongly named as an author, said: \"It does make me concerned given that citation practices are an important part of conducting and reporting rigorous science.\"\n\nAnother study cited about the advertising of psychotropic medications for youth was not written by the listed author, the university that employs him told AFP and Reuters.\n\n...\"",
                "Reality often sides against conservatives and right wingers. Of course, they have to make shit up.",
                "> An amended version was issued on 29 May after digital outlet NOTUS found it had used seven non-existent sources.\n> Guohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\n> White House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report.\n\nThat's not \"formatting\" seems more like deceit.   It does make all of the content questionable.",
                "“the report concluded that poor diet, environmental toxins, stress, insufficient physical activity and \"overmedicalisation\" may contribute to chronic illness among American children.”\n\nThat should lead to strengthening environmental protections, increasing spending on SNAP, and funding more public playgrounds and parks….but no…it’ll probably lead to banning vaccines and putting kids in labor camps.",
                "“formatting issues”\n\nI’m using that excuse with the IRS if they audit my taxes",
                "> White House press secretary Karoline Leavitt said there were \"formatting issues\" \n\noh yeah, I remember when I messed up formatting in my college papers and completely made up sources suddenly popped up.  I hate it when that happens.",
                "In other governments and past administrations doing something like this would be grounds for immediate forced resignation and congressional inquiry. For these guys it’s just another Tuesday. ",
                "Seems perfectly on brand"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US formally moves to dismiss prosecution against Boeing and asks judge to cancel trial over crashes",
            "external_url": "https://apnews.com/article/boeing-justice-department-max-crashes-80ffdcf649f89ee0b3de689c0cfd3079?utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Facebook&fbclid=IwZXh0bgNhZW0CMTEAAR6SIUJSqxsuZpa8pO8b2oFWu2zQCsZ8gowN25ICQVoOgcpaF7OfHKCW6hqbzw_aem_6nh1jjgENOEcIKjsIfzyxA",
            "upvotes": 3389,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's one way to build confidence in the international market,  that your product is safe and reliable. ....",
                "Looks like Boeing's [bribe](https://www.reuters.com/world/us/boeing-donating-1-million-trump-presidential-inaugural-fund-spokesperson-says-2025-01-09/) paid dividends.",
                "Typical Trump thinking:  \nIf we dismiss any prosecution - We are innocent  \nIf we stop counting the vote - We win an election  \nIf we stop testing - The virus goes away",
                "Such obvious corruption, people died and no one will be held accountable. That's the legacy of this administration.",
                "Good Ole republican party protecting corporate interests over the people who elected them.",
                "Donnie looking out for the little guy",
                "I'm glad we live in such compassionate times. Feel bad for that poor military contractor.",
                "How much is 1.1 billion to Boeing, relative to a normal person? A hundred dollars? A thousand? A decent chunk of change, maybe, but a small price to get out of a murder charge.",
                "Soo you mistakenly transpose numbers on your tax return you are screwed....giant corp fails at basic standards and compliance resulting in deaths and no further investigation or punishment needed.",
                "I'm sure this has absolutely nothing to do with that massive deal trump made with the Saudis to buy a shitload of boeing planes. None whatsoever \n\n/s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Musk’s SpaceX town in Texas warns residents they may lose right to ‘continue using’ their property",
            "external_url": "https://www.cnbc.com/2025/05/29/elon-musk-spacex-starbase-texas.html",
            "upvotes": 19810,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108152118-1748545082164-gettyimages-2214317542-MUSK_STARBASE.jpeg?v=1748545147&w=1920&h=1080",
            "top_comments": [
                "Hey look, an actual case of a foreigner taking property away from Americans.",
                "A government so small it can take your land and rights on a whim.",
                "Here’s the text of the zoning memo sent to Starbase residents:\n\nMay 21, 2025\n\nDear Starbase Property Owner/Property Occupant,\n\nNotice is hereby given that the City Commission for the City of Starbase will conduct a Public Hearing on Monday, June 23, 2025, at 9:00 a.m., at the City of Starbase temporary city hall located at 39046 LBJ Boulevard, Brownsville, TX 78521, to hear public comments, consider and act upon the adoption of a Comprehensive Zoning Ordinance and city wide Zoning Map.\n\nOur goal is to ensure that the zoning plan reflects the City’s vision for balanced growth, protecting critical economic drivers, ensuring public safety, and preserving green spaces. You are receiving this notice because you own the above listed property that will be located in the “Mixed Use District” and will be impacted if the zoning ordinance is approved. \n\nThe Mixed Use District allows for a blend of residential, office, retail, and small-scale service uses. A proposed zoning map is enclosed with this notice. You may view the draft zoning ordinance on the City’s website 72 hours prior to the above listed public hearing.\n\nThe City is required by Texas law to notify you of the following: THE CITY OF STARBASE IS HOLDING A HEARING THAT WILL DETERMINE WHETHER YOU MAY LOSE THE RIGHT TO CONTINUE USING YOUR PROPERTY FOR ITS CURRENT USE, PLEASE READ THIS NOTICE CAREFULLY. The foregoing notice is required by Texas Local Government Code section 211.006(a-1). The proposed zoning ordinance is based on current and existing uses.\n\nPlease contact City Administrator Kent Myers [email address redacted] with any questions or written comments. Your written comments must be submitted by 3:00 pm on June 22, 2025. Public comments may also be given at the above listed public hearing.\n\n \n\nBest Wishes, \n\nKent Myers\n\nCity Administrator, City of Starbase\n\n[addresses redacted]\n\ncityofstarbase-texas.com",
                "So….. years ago almost all property in Boca chica village was acquired by SpaceX in buyouts. All of the residents were bought out and left. There were a few holdouts, some of the property is uninhabited but SpaceX does not own it. They had to build the factory around a few parcels because of it. \n\nThe people that live there now are employees and their families in houses built by the company. They are also building apartment complexes down the road. \n\nI would bet this notice is a legal thing.",
                "Another day older and deeper in debt",
                "Party of small government… takes over your town and tells you the local billionaire now gets to tell you how and where to live.",
                "Are we surprised? No, not at all.",
                ">The company town includes the launch facility where SpaceX conducts test flights of its massive Starship rocket, and company-owned land covering a 1.6-square-mile area.\n\n\"Company town\" is giving me dystopic Gilded Age vibes",
                "Gods, they're even calling it a company town without a single hint of irony. This is what happens when people suppress history.",
                "Oh a billionaire and showing the value of his “network state”. At some point people will wake up and realize these billionaires are corrupt hoarders with zero benefit to society."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "France to ban smoking outdoors in most places: minister",
            "external_url": "https://www.france24.com/en/live-news/20250529-france-to-ban-smoking-outdoors-in-most-places-minister",
            "upvotes": 1046,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ah yes, the true reason for the fracture in Expedition 33",
                "This thread has more cliché French stereotyping than season two of Andor.",
                "About 5 years ago my city in Canada (Halifax) passed a law to force people to smoke only in designated areas, and everybody just ignored it. Most people have already forgotten about it, even though the law is probably still on the books. Smoking is banned on sidewalk patios though, unlike in France, and that law does get enforced.",
                "But wait how will Paris maintain its outdoor carpet of cigarette butts? Will people have to walk on bare ground like barbarians?",
                "So what is a chic-looking man in a striped shirt with a tiny mustache supposed to do while sitting at an outdoor cafe?",
                "[deleted]",
                "\"Cafe terraces will be excluded from the ban, which will also not extend to electronic cigarettes, she said\"\n\nAlright, so I still get to huff 2nd hand",
                "This sounds unenforceable.",
                "As an American who's been in Paris the last 2 weeks, it’s pretty jarring and awful to walk through constantly.",
                "Any French BBQ restaurants are about to be in a world of hurt!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Intelligence agency IT specialist charged with attempting to provide classified information to foreign government",
            "external_url": "https://abcnews.go.com/US/intelligence-agency-specialist-charged-attempting-provide-classified-information/story?id=122329650",
            "upvotes": 509,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1a21d4a9-70dd-4312-92be-aea006d7e8a5/Nathan-Laatsch-ht-gmh-250530_1748612514466_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                ">Nathan Laatsch, 28, an IT specialist with the Defense Intelligence Agency, is accused of attempting to provide classified information to a friendly foreign government, according to the Department of Justice.\n\n\"You got to watch those IT guys.\"\n\n-Source, an IT guy",
                "Didn't Donald Trump do that?",
                "If you tell your workforce they are your enemy, fire thousands of them for arbitrary reasons, clearly communicate your intent to [literally \"traumatize\" them](https://www.youtube.com/watch?v=oBH9TmeJN_M), and generally prove to them that their country does not value them and hates them, you can't be surprised when some of them decide you don't deserve their loyalty anymore.\n\nAnd don't forget the ones you fired who have very government-centric skillsets and who may not easily find jobs in the private sector still have families to feed.",
                "\"Friendly foreign government\"\n\nSo who, Saudi Arabia? We've alienated about everyone else.",
                "He should run for president",
                "Must have been the friendly foreign government part, hostiles we seem a ok with if doge is anything to go by",
                "IT specialist should have stored the info in boxes in the bathroom then invited foreign government people over.",
                "Should have joined DOGE, he would have gotten a bonus for it.",
                "Can’t get away with that shit until you’re a president protected by the republican party",
                "Should have used Signal."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Bernard Kerik, who led NYPD on 9/11 before prison and pardon, has died at 69",
            "external_url": "https://abcnews.go.com/US/wireStory/bernie-kerik-served-nypd-commissioner-911-attacks-dies-122333466",
            "upvotes": 651,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/91fde3dd-158c-4001-8caf-f1f7128b1d3a/wirestory_1ed18ffa7da87bd824dc976eabd51fbf_16x9.jpg?w=1600",
            "top_comments": [
                "Oh.  No.\n\nBack to what I was doing",
                "I remember when he withdrew his nomination for homeland security secretary. He called hiring an undocumented immigrant a \"nanny problem\". Like it wasn't his fault as a cop.",
                "This helps drain the swamp a little",
                "“Tax cheat and insurrectionist, Bernard Kerik, kicks the bucket”",
                "[removed]",
                "He's also the corrupt loser that claimed the Colorado shooter referenced the Dark Knight during his shooting. I heard a presentation from the actual prosecutor who said that was completely untrue and only made his job harder. Thanks douchebag!",
                "I know the sub rule is to keep the title as the headline, but man that headline is putting in a lot of work to try and spin him as a heroic figure first and foremost.  He was not, and was more a villain",
                "> Pleaded guilty to tax fraud\n\n\nWhy do so many cops commit tax fraud? Is tax fraud a popular thing to do in America, or is it a cop thing?",
                "No memorial for Kerik would be complete without remembering how he commandeered an apartment intended for 9/11 rescue workers and used it as a fuck pad for him and his mistress.\n\nhttps://www.smh.com.au/world/kerik-took-over-apartment-donated-to-rescue-workers-20041216-gdkbqk.html",
                "Rest in piss..\n\n\nDude a total piece of shit. Fuck him."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump tariffs reinstated by appeals court for now",
            "external_url": "https://www.cnbc.com/2025/05/29/blocked-trump-tariffs-trade-court-appeal.html",
            "upvotes": 23013,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108152225-1748555923559-gettyimages-2216368694-AFP_484227F.jpeg?v=1748556294&w=1920&h=1080",
            "top_comments": [
                "It’s on its off it’s on its off\n\n“That’s called blinking boys.”",
                "The tariffs are too impactful (in a bad way) to be ping-ponged around like this. This is embarrassing.",
                "Back and forth the pendulum swings\n\nEveryone loses but the new Kings",
                "Ah shit here we go again.",
                "According to law, there needs to be an emergency in order for the president to have the authority to issue these tariffs by executive fiat. But there was no emergency. The only “emergency” is of Trump’s own making and was caused when Trump started issuing these ridiculous and illegal tariffs in the first place. It’s a dog chasing its own tail except the dog is crazy and ends up eating itself.",
                "It’s amazing how this is used in the exact opposite way it should be used. \n\nInjunctions like this are used to stop entities from doing too much damage while the court makes a decision. Trump is the one causing damage with tariffs and stopping them was the way to prevent further damage while a decision is rendered.",
                "This ruling won't last long, but the damage sure will",
                "How about not implementing anything till it works it way through the courts this back and forth annoying.",
                "Our country is a fucking joke",
                "I’m going to set up a Siri shortcut so when I say Damage Report she reads the top 5 news headlines."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "4-year-old girl who receives medical treatment in US could die if deported, lawyer says",
            "external_url": "https://abcnews.go.com/US/4-year-girl-receiving-medical-treatment-us-die/story?id=122285755",
            "upvotes": 2541,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f56b3111-2ebe-4f83-a34b-ad223ffc18d7/Vargas-1-gty-er-250528_1748470039526_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Where are all the pro-life people now?",
                "They assume the US cares if she dies or not",
                "They already deported 2 mid cancer treatment children who were US citizens …..",
                "I think that’s the idea, isn’t it? ",
                "Man, that treatment is intense and expensive. My aunt developed SBS after having surgery for cancer, and even with insurance the medical bills put her into bankruptcy. Can't imagine how this family will manage the expense even if they get to stay here...they will be financially crippled by this. Tragic situation. The American healthcare situation is broken.",
                "Maga don’t care about children after they are born . only when they are a fetus or bag of cells. Also they don’t care about brown people.",
                "The treatment for this is expensive.\n\nWhich is exactly why Trump wants her, and her family, deported.",
                "MAGA probably filled with glee at the prospect.",
                "Eligible voters that didn’t vote for Kamala Harris allowed this to happen.",
                "I work with patients who have this same condition. This child is not the only one in the US getting these threats, unfortunately. These kids literally cannot eat or drink enough to survive and will die quickly without these infusions. In the US kids (and adults) with short bowel syndrome can receive these infusions at home and then go to school or work, generally being contributing members to their communities. In many other countries these people live at the hospital, forever. Home infusions are not an option. They cannot work. Can't go to school. Just survive. It's really fucking sad."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump officials to ask supreme court to halt ‘activist judge’s’ bid to block tariffs",
            "external_url": "https://www.theguardian.com/us-news/2025/may/28/us-court-blocks-trump-tariffs?CMP=Share_iOSApp_Other",
            "upvotes": 10582,
            "date": "05/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b8477475ba49557770f975329c1e8f10b5e979c8/0_0_6723_5377/master/6723.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2479182452a468975fff0dd62f80f715",
            "top_comments": [
                "“I need you to be activist judges to stop the activist judges”",
                "I love how they are “activist” for doing their job. It’s the TRADE court FFS 🤦‍♂️",
                "If all the president has to do is to declare that there is some dramatic emergency, and then start swinging tariffs wildly, Congress has been rendered impotent. I hope the Supreme Court justices, or at least five of them, can see that that is a terrible misreading of the clear terms of the constitution.",
                "These activist judges voted unanimously. One appointed by Obama, one Regan, and one ... you guessed it, Trump.",
                "Yes those \"activist judges\" appointed by Presidents Reagan and Trump.",
                "The activist Judge is actually 3 Judges and of those 3 judges 1 was appointed by Reagan and another one appointed by Trump himself and the rulling was unanimous so at least 2 out of the 3 judges were Appointed by conservative presidents but the moment he they rule against him their activist. \n\n  \nHmmm.",
                ">On Thursday, the Trump administration filed for “emergency relief” from the ruling “to avoid the irreparable national-security and economic harms at stake” The administration will appeal only if a federal court declines to temporarily pause the tariff ruling.\n\nOK. Define the national-security and economic harms. And be specific.",
                "“You’re supposed to always give us what we want, never ask for anything in return, and never complain, otherwise you’re hurting our feelings. Especially when you call me a taco.” Malignant narcissism has taken over our government.",
                "Why are they activist judges.  Jesus why can’t people tone down on the rhetoric.  They’re judges following the rule of law.  The congress is supposed to control taxation not the president.",
                "I like the rights adoption of the term activist judges considering the current state of the supreme court."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Harrison Ruffin Tyler, grandson of the 10th U.S. president, dies at 96",
            "external_url": "https://www.npr.org/2025/05/29/nx-s1-5415207/president-tyler-grandson-harrison-ruffin-tyler",
            "upvotes": 3792,
            "date": "05/29/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7060x3971+277+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8b%2F8a%2F4d24feaa4f7b9f6ff201049e4c4e%2Fgettyimages-1400904559.jpg",
            "top_comments": [
                ">Tyler told Virginia Tech Magazine in 2007 that he and co-founder William Simmons had three goals: \"sell a product that works, hire good employees, and take care of those employees.\" They made the company an Employee Stock Ownership Plan (ESOP) in 1989, and their employees gained controlling interest when they retired in 2000.\n\nSounds like a decent chap. Godspeed.",
                "For context: \n\n- Grandfather was John Tyler (1790-1862)\n- Father was Lyon Gardiner Tyler (1853-1935)\n- Harrison Ruffin Tyler (1928-2025)\n\nJohn had Lyon at age 63 and Lyon had Harrison at age 75. \n\nJohn had 15 kids with two different women. His first wife died in 1842 (8 kids), though she had been an invalid since 1839 after suffering a stroke, and he remarried two years later to someone 30 years younger (7 kids). \n\nLyon then had 6 kids with two different women. His first wife died in 1921 (3 kids) and he remarried two years later to someone 35 years younger (3 kids). \n\nHarrison broke the trend only having 3 kids and he didn't remarry after his wife died in 2019, although by that point he was 91 and suffering from dementia.",
                "Just so everyone is aware, because this has always been one of my favorite stories:\n\nHarrison Tyler was the last living grandson of John Tyler, the tenth President of the United States, who was President from 1841-1845.  \n\nYes, someone who was President of the United States 180 years ago had a grandson who was still alive until a few days ago. And President John Tyler was born in 1790, during George Washington's first Presidential term.\n\nHarrison's brother Lyon died just five years ago.\n\nThis has always been one of those fun facts that blew me away.  R. I. P. Harrison.",
                "So who's the oldest president with living grandchildren now? Must have jumped quite a bit.",
                "Harrison was 96, a fuckin kid",
                "Damn. Now I’m going to have to find a new Presidential fact to drop on my friends. This was always my go to.",
                "I didn't even know he was sick.",
                "Tippecanoe and Tyler....3?",
                "RIP.  Also, John Tyler was a huge asshole and was a major proponent of southern secession and the preservation of slavery.  He's the only American president to ever be buried under the flag of a nation that we were at war with (Confederate flag).  ",
                "One of the all time great history oddities! \nRIP Harrison"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Supreme Court allows Trump to revoke temporary legal status of 500,000 immigrants from 4 countries",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-trump-revoke-legal-status-500000-immigrants-rcna207271",
            "upvotes": 33,
            "date": "05/30/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-asylum-seekers-ch-1107-ef95d4.jpg",
            "top_comments": [
                "The Make America White Again party once again gets what they want",
                "Suddenly I don't have much hope the tariffs will be revoked...",
                "American citizens need to more importantly understand their president is at war with the average citizen.  Worry more about that first!\n\n\nYou cant fix this when your fat fucking piece of shit president threatens American citizens every fucking day. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Alaska man survives after being trapped face-down in creek by 700lb boulder",
            "external_url": "https://www.theguardian.com/us-news/2025/may/30/alaska-man-survives-700lb-boulder-creek?CMP=Share_iOSApp_Other",
            "upvotes": 96,
            "date": "05/30/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/65fc6dfb44d085bd6b03fb31fd014edff5fda3f4/0_0_960_768/master/960.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e9b26a43b6c9670a74563b29de9ec5d7",
            "top_comments": [
                ">Morris, 61, said he realizes he is probably the luckiest man alive. “And luckier that I have such a great wife,” he said Thursday.\n\n61, resilient, and a great wife. This guy's living!",
                "dude needs to go buy some lottery tix.",
                "A good reminder to stay on trails and *don't hike alone*.",
                "Definitely luckiest man alive. I always have this fear when I'm out hiking and fishing alone that I'll get pinned in the water by a boulder somehow.",
                "Man almost got nutty puttied 💀",
                "Whatever. I survived after being trapped face-down by your mom."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Argentine court declares mistrial over death of soccer star Maradona",
            "external_url": "https://www.abc.net.au/news/2025-05-30/mistrial-declared-in-death-of-soccer-star-maradona/105356336",
            "upvotes": 61,
            "date": "05/30/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/5ddc7453aae2006dd80f67f52ac9de96?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=437&width=862&height=485&imformat=generic",
            "top_comments": [
                "He was killed by the hand of God.",
                "Maradona would’ve loved watching Messi win the World Cup for Argentina in 2022."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Intelligence agency IT specialist charged with attempting to provide classified information to foreign government",
            "external_url": "https://abcnews.go.com/US/intelligence-agency-specialist-charged-attempting-provide-classified-information/story?id=122329650",
            "upvotes": 507,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1a21d4a9-70dd-4312-92be-aea006d7e8a5/Nathan-Laatsch-ht-gmh-250530_1748612514466_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                ">Nathan Laatsch, 28, an IT specialist with the Defense Intelligence Agency, is accused of attempting to provide classified information to a friendly foreign government, according to the Department of Justice.\n\n\"You got to watch those IT guys.\"\n\n-Source, an IT guy",
                "Didn't Donald Trump do that?",
                "If you tell your workforce they are your enemy, fire thousands of them for arbitrary reasons, clearly communicate your intent to [literally \"traumatize\" them](https://www.youtube.com/watch?v=oBH9TmeJN_M), and generally prove to them that their country does not value them and hates them, you can't be surprised when some of them decide you don't deserve their loyalty anymore.\n\nAnd don't forget the ones you fired who have very government-centric skillsets and who may not easily find jobs in the private sector still have families to feed.",
                "\"Friendly foreign government\"\n\nSo who, Saudi Arabia? We've alienated about everyone else.",
                "He should run for president",
                "Must have been the friendly foreign government part, hostiles we seem a ok with if doge is anything to go by",
                "IT specialist should have stored the info in boxes in the bathroom then invited foreign government people over.",
                "Should have joined DOGE, he would have gotten a bonus for it.",
                "Can’t get away with that shit until you’re a president protected by the republican party",
                "Should have used Signal."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US government report cited non-existent sources, academics say",
            "external_url": "https://www.bbc.com/news/articles/cdj98vrzpyvo",
            "upvotes": 3131,
            "date": "05/30/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4d9f/live/00b2ae80-3d30-11f0-b1db-7b03bfaa8894.jpg",
            "top_comments": [
                "Cause it was written by ChatGPT.",
                "Considering that they didn't just fabricate studies, but also tried to associate them with real and credible professors, scientists etc makes me think this is something they could be sued over...",
                "\"A US government report on children's health cited \"totally fabricated\" studies to back up its findings, academics wrongly listed as the authors of those studies have said.\n\n...\n\nWhite House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report\".\n\n...\n\nBut the authors of several studies cited in the report told news outlets they did not write them, and that the studies never existed.\n\nGuohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\nHe was listed as an author alongside Noah Kreski, a researcher at Columbia University, who also denied writing it, telling AFP it \"doesn't appear to be a study that exists at all.\"\n\nKatherine Keyes, an epidemiology professor who told news agency Reuters she was also wrongly named as an author, said: \"It does make me concerned given that citation practices are an important part of conducting and reporting rigorous science.\"\n\nAnother study cited about the advertising of psychotropic medications for youth was not written by the listed author, the university that employs him told AFP and Reuters.\n\n...\"",
                "Reality often sides against conservatives and right wingers. Of course, they have to make shit up.",
                "> An amended version was issued on 29 May after digital outlet NOTUS found it had used seven non-existent sources.\n> Guohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\n> White House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report.\n\nThat's not \"formatting\" seems more like deceit.   It does make all of the content questionable.",
                "“the report concluded that poor diet, environmental toxins, stress, insufficient physical activity and \"overmedicalisation\" may contribute to chronic illness among American children.”\n\nThat should lead to strengthening environmental protections, increasing spending on SNAP, and funding more public playgrounds and parks….but no…it’ll probably lead to banning vaccines and putting kids in labor camps.",
                "“formatting issues”\n\nI’m using that excuse with the IRS if they audit my taxes",
                "> White House press secretary Karoline Leavitt said there were \"formatting issues\" \n\noh yeah, I remember when I messed up formatting in my college papers and completely made up sources suddenly popped up.  I hate it when that happens.",
                "In other governments and past administrations doing something like this would be grounds for immediate forced resignation and congressional inquiry. For these guys it’s just another Tuesday. ",
                "Seems perfectly on brand"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US formally moves to dismiss prosecution against Boeing and asks judge to cancel trial over crashes",
            "external_url": "https://apnews.com/article/boeing-justice-department-max-crashes-80ffdcf649f89ee0b3de689c0cfd3079?utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Facebook&fbclid=IwZXh0bgNhZW0CMTEAAR6SIUJSqxsuZpa8pO8b2oFWu2zQCsZ8gowN25ICQVoOgcpaF7OfHKCW6hqbzw_aem_6nh1jjgENOEcIKjsIfzyxA",
            "upvotes": 3396,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's one way to build confidence in the international market,  that your product is safe and reliable. ....",
                "Looks like Boeing's [bribe](https://www.reuters.com/world/us/boeing-donating-1-million-trump-presidential-inaugural-fund-spokesperson-says-2025-01-09/) paid dividends.",
                "Typical Trump thinking:  \nIf we dismiss any prosecution - We are innocent  \nIf we stop counting the vote - We win an election  \nIf we stop testing - The virus goes away",
                "Such obvious corruption, people died and no one will be held accountable. That's the legacy of this administration.",
                "Good Ole republican party protecting corporate interests over the people who elected them.",
                "Donnie looking out for the little guy",
                "I'm glad we live in such compassionate times. Feel bad for that poor military contractor.",
                "How much is 1.1 billion to Boeing, relative to a normal person? A hundred dollars? A thousand? A decent chunk of change, maybe, but a small price to get out of a murder charge.",
                "Soo you mistakenly transpose numbers on your tax return you are screwed....giant corp fails at basic standards and compliance resulting in deaths and no further investigation or punishment needed.",
                "I'm sure this has absolutely nothing to do with that massive deal trump made with the Saudis to buy a shitload of boeing planes. None whatsoever \n\n/s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Bernard Kerik, who led NYPD on 9/11 before prison and pardon, has died at 69",
            "external_url": "https://abcnews.go.com/US/wireStory/bernie-kerik-served-nypd-commissioner-911-attacks-dies-122333466",
            "upvotes": 658,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/91fde3dd-158c-4001-8caf-f1f7128b1d3a/wirestory_1ed18ffa7da87bd824dc976eabd51fbf_16x9.jpg?w=1600",
            "top_comments": [
                "Oh.  No.\n\nBack to what I was doing",
                "I remember when he withdrew his nomination for homeland security secretary. He called hiring an undocumented immigrant a \"nanny problem\". Like it wasn't his fault as a cop.",
                "This helps drain the swamp a little",
                "“Tax cheat and insurrectionist, Bernard Kerik, kicks the bucket”",
                "[removed]",
                "He's also the corrupt loser that claimed the Colorado shooter referenced the Dark Knight during his shooting. I heard a presentation from the actual prosecutor who said that was completely untrue and only made his job harder. Thanks douchebag!",
                "I know the sub rule is to keep the title as the headline, but man that headline is putting in a lot of work to try and spin him as a heroic figure first and foremost.  He was not, and was more a villain",
                "> Pleaded guilty to tax fraud\n\n\nWhy do so many cops commit tax fraud? Is tax fraud a popular thing to do in America, or is it a cop thing?",
                "No memorial for Kerik would be complete without remembering how he commandeered an apartment intended for 9/11 rescue workers and used it as a fuck pad for him and his mistress.\n\nhttps://www.smh.com.au/world/kerik-took-over-apartment-donated-to-rescue-workers-20041216-gdkbqk.html",
                "Rest in piss..\n\n\nDude a total piece of shit. Fuck him."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "France to ban smoking outdoors in most places: minister",
            "external_url": "https://www.france24.com/en/live-news/20250529-france-to-ban-smoking-outdoors-in-most-places-minister",
            "upvotes": 1049,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ah yes, the true reason for the fracture in Expedition 33",
                "This thread has more cliché French stereotyping than season two of Andor.",
                "About 5 years ago my city in Canada (Halifax) passed a law to force people to smoke only in designated areas, and everybody just ignored it. Most people have already forgotten about it, even though the law is probably still on the books. Smoking is banned on sidewalk patios though, unlike in France, and that law does get enforced.",
                "But wait how will Paris maintain its outdoor carpet of cigarette butts? Will people have to walk on bare ground like barbarians?",
                "So what is a chic-looking man in a striped shirt with a tiny mustache supposed to do while sitting at an outdoor cafe?",
                "[deleted]",
                "\"Cafe terraces will be excluded from the ban, which will also not extend to electronic cigarettes, she said\"\n\nAlright, so I still get to huff 2nd hand",
                "This sounds unenforceable.",
                "As an American who's been in Paris the last 2 weeks, it’s pretty jarring and awful to walk through constantly.",
                "Any French BBQ restaurants are about to be in a world of hurt!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "4-year-old girl who receives medical treatment in US could die if deported, lawyer says",
            "external_url": "https://abcnews.go.com/US/4-year-girl-receiving-medical-treatment-us-die/story?id=122285755",
            "upvotes": 2542,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f56b3111-2ebe-4f83-a34b-ad223ffc18d7/Vargas-1-gty-er-250528_1748470039526_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Where are all the pro-life people now?",
                "They assume the US cares if she dies or not",
                "They already deported 2 mid cancer treatment children who were US citizens …..",
                "I think that’s the idea, isn’t it? ",
                "Man, that treatment is intense and expensive. My aunt developed SBS after having surgery for cancer, and even with insurance the medical bills put her into bankruptcy. Can't imagine how this family will manage the expense even if they get to stay here...they will be financially crippled by this. Tragic situation. The American healthcare situation is broken.",
                "Maga don’t care about children after they are born . only when they are a fetus or bag of cells. Also they don’t care about brown people.",
                "The treatment for this is expensive.\n\nWhich is exactly why Trump wants her, and her family, deported.",
                "MAGA probably filled with glee at the prospect.",
                "Eligible voters that didn’t vote for Kamala Harris allowed this to happen.",
                "I work with patients who have this same condition. This child is not the only one in the US getting these threats, unfortunately. These kids literally cannot eat or drink enough to survive and will die quickly without these infusions. In the US kids (and adults) with short bowel syndrome can receive these infusions at home and then go to school or work, generally being contributing members to their communities. In many other countries these people live at the hospital, forever. Home infusions are not an option. They cannot work. Can't go to school. Just survive. It's really fucking sad."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Police arrest 13-year-old boy following fatal stabbing east of Toronto",
            "external_url": "https://www.ctvnews.ca/toronto/local/durham/article/no-longer-a-danger-to-the-public-police-arrest-13-year-old-boy-after-senior-fatally-stabbed-in-pickering-lift-shelter-in-place-alert/",
            "upvotes": 968,
            "date": "05/30/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/V6WKAQXRPRHPBA72VK67QLZ44A.jpg?smart=true&auth=ad4582fac66436d1f824a7f70eaa5e42457660b9338b90acb199e92acca69204&width=1200&height=630",
            "top_comments": [
                "*“After a brief interaction, the suspect stabbed the female in a sadistic and cowardly, unprovoked attack that was captured on video,” he told members of the media...*\n\nA 13 year old boy killing a senior during an altercation outside her home.  All the more horrible for seeming so wildly unlikely, at least on the surface of things.",
                "For those of you who don’t know, 100s of thousands of peoples phones went off with an emergency alarm due to this. There was a risk to public safety based on the details police had. Must have been that gruesome and unprovoked…",
                "With our justice system the kid will be released before the weekend is over.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US government report cited non-existent sources, academics say",
            "external_url": "https://www.bbc.com/news/articles/cdj98vrzpyvo",
            "upvotes": 3137,
            "date": "05/30/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/4d9f/live/00b2ae80-3d30-11f0-b1db-7b03bfaa8894.jpg",
            "top_comments": [
                "Cause it was written by ChatGPT.",
                "Considering that they didn't just fabricate studies, but also tried to associate them with real and credible professors, scientists etc makes me think this is something they could be sued over...",
                "\"A US government report on children's health cited \"totally fabricated\" studies to back up its findings, academics wrongly listed as the authors of those studies have said.\n\n...\n\nWhite House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report\".\n\n...\n\nBut the authors of several studies cited in the report told news outlets they did not write them, and that the studies never existed.\n\nGuohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\nHe was listed as an author alongside Noah Kreski, a researcher at Columbia University, who also denied writing it, telling AFP it \"doesn't appear to be a study that exists at all.\"\n\nKatherine Keyes, an epidemiology professor who told news agency Reuters she was also wrongly named as an author, said: \"It does make me concerned given that citation practices are an important part of conducting and reporting rigorous science.\"\n\nAnother study cited about the advertising of psychotropic medications for youth was not written by the listed author, the university that employs him told AFP and Reuters.\n\n...\"",
                "Reality often sides against conservatives and right wingers. Of course, they have to make shit up.",
                "> An amended version was issued on 29 May after digital outlet NOTUS found it had used seven non-existent sources.\n> Guohua Li, a Columbia University professor who was named as an author of a report on the mental health of children in the pandemic, told Agence France-Presse that the reference was \"totally fabricated\" and that he does not even know the listed co-author.\n\n> White House press secretary Karoline Leavitt said there were \"formatting issues\" and the report would be updated, but it did \"not negate the substance of the report.\n\nThat's not \"formatting\" seems more like deceit.   It does make all of the content questionable.",
                "“the report concluded that poor diet, environmental toxins, stress, insufficient physical activity and \"overmedicalisation\" may contribute to chronic illness among American children.”\n\nThat should lead to strengthening environmental protections, increasing spending on SNAP, and funding more public playgrounds and parks….but no…it’ll probably lead to banning vaccines and putting kids in labor camps.",
                "“formatting issues”\n\nI’m using that excuse with the IRS if they audit my taxes",
                "> White House press secretary Karoline Leavitt said there were \"formatting issues\" \n\noh yeah, I remember when I messed up formatting in my college papers and completely made up sources suddenly popped up.  I hate it when that happens.",
                "In other governments and past administrations doing something like this would be grounds for immediate forced resignation and congressional inquiry. For these guys it’s just another Tuesday. ",
                "Seems perfectly on brand"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Intelligence agency IT specialist charged with attempting to provide classified information to foreign government",
            "external_url": "https://abcnews.go.com/US/intelligence-agency-specialist-charged-attempting-provide-classified-information/story?id=122329650",
            "upvotes": 505,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1a21d4a9-70dd-4312-92be-aea006d7e8a5/Nathan-Laatsch-ht-gmh-250530_1748612514466_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                ">Nathan Laatsch, 28, an IT specialist with the Defense Intelligence Agency, is accused of attempting to provide classified information to a friendly foreign government, according to the Department of Justice.\n\n\"You got to watch those IT guys.\"\n\n-Source, an IT guy",
                "Didn't Donald Trump do that?",
                "If you tell your workforce they are your enemy, fire thousands of them for arbitrary reasons, clearly communicate your intent to [literally \"traumatize\" them](https://www.youtube.com/watch?v=oBH9TmeJN_M), and generally prove to them that their country does not value them and hates them, you can't be surprised when some of them decide you don't deserve their loyalty anymore.\n\nAnd don't forget the ones you fired who have very government-centric skillsets and who may not easily find jobs in the private sector still have families to feed.",
                "\"Friendly foreign government\"\n\nSo who, Saudi Arabia? We've alienated about everyone else.",
                "He should run for president",
                "Must have been the friendly foreign government part, hostiles we seem a ok with if doge is anything to go by",
                "IT specialist should have stored the info in boxes in the bathroom then invited foreign government people over.",
                "Should have joined DOGE, he would have gotten a bonus for it.",
                "Can’t get away with that shit until you’re a president protected by the republican party",
                "Should have used Signal."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US formally moves to dismiss prosecution against Boeing and asks judge to cancel trial over crashes",
            "external_url": "https://apnews.com/article/boeing-justice-department-max-crashes-80ffdcf649f89ee0b3de689c0cfd3079?utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Facebook&fbclid=IwZXh0bgNhZW0CMTEAAR6SIUJSqxsuZpa8pO8b2oFWu2zQCsZ8gowN25ICQVoOgcpaF7OfHKCW6hqbzw_aem_6nh1jjgENOEcIKjsIfzyxA",
            "upvotes": 3391,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That's one way to build confidence in the international market,  that your product is safe and reliable. ....",
                "Looks like Boeing's [bribe](https://www.reuters.com/world/us/boeing-donating-1-million-trump-presidential-inaugural-fund-spokesperson-says-2025-01-09/) paid dividends.",
                "Typical Trump thinking:  \nIf we dismiss any prosecution - We are innocent  \nIf we stop counting the vote - We win an election  \nIf we stop testing - The virus goes away",
                "Such obvious corruption, people died and no one will be held accountable. That's the legacy of this administration.",
                "Good Ole republican party protecting corporate interests over the people who elected them.",
                "Donnie looking out for the little guy",
                "I'm glad we live in such compassionate times. Feel bad for that poor military contractor.",
                "How much is 1.1 billion to Boeing, relative to a normal person? A hundred dollars? A thousand? A decent chunk of change, maybe, but a small price to get out of a murder charge.",
                "Soo you mistakenly transpose numbers on your tax return you are screwed....giant corp fails at basic standards and compliance resulting in deaths and no further investigation or punishment needed.",
                "I'm sure this has absolutely nothing to do with that massive deal trump made with the Saudis to buy a shitload of boeing planes. None whatsoever \n\n/s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "France to ban smoking outdoors in most places: minister",
            "external_url": "https://www.france24.com/en/live-news/20250529-france-to-ban-smoking-outdoors-in-most-places-minister",
            "upvotes": 1049,
            "date": "05/30/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ah yes, the true reason for the fracture in Expedition 33",
                "This thread has more cliché French stereotyping than season two of Andor.",
                "About 5 years ago my city in Canada (Halifax) passed a law to force people to smoke only in designated areas, and everybody just ignored it. Most people have already forgotten about it, even though the law is probably still on the books. Smoking is banned on sidewalk patios though, unlike in France, and that law does get enforced.",
                "But wait how will Paris maintain its outdoor carpet of cigarette butts? Will people have to walk on bare ground like barbarians?",
                "So what is a chic-looking man in a striped shirt with a tiny mustache supposed to do while sitting at an outdoor cafe?",
                "[deleted]",
                "\"Cafe terraces will be excluded from the ban, which will also not extend to electronic cigarettes, she said\"\n\nAlright, so I still get to huff 2nd hand",
                "This sounds unenforceable.",
                "As an American who's been in Paris the last 2 weeks, it’s pretty jarring and awful to walk through constantly.",
                "Any French BBQ restaurants are about to be in a world of hurt!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Bernard Kerik, who led NYPD on 9/11 before prison and pardon, has died at 69",
            "external_url": "https://abcnews.go.com/US/wireStory/bernie-kerik-served-nypd-commissioner-911-attacks-dies-122333466",
            "upvotes": 654,
            "date": "05/30/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/91fde3dd-158c-4001-8caf-f1f7128b1d3a/wirestory_1ed18ffa7da87bd824dc976eabd51fbf_16x9.jpg?w=1600",
            "top_comments": [
                "Oh.  No.\n\nBack to what I was doing",
                "I remember when he withdrew his nomination for homeland security secretary. He called hiring an undocumented immigrant a \"nanny problem\". Like it wasn't his fault as a cop.",
                "This helps drain the swamp a little",
                "“Tax cheat and insurrectionist, Bernard Kerik, kicks the bucket”",
                "[removed]",
                "He's also the corrupt loser that claimed the Colorado shooter referenced the Dark Knight during his shooting. I heard a presentation from the actual prosecutor who said that was completely untrue and only made his job harder. Thanks douchebag!",
                "I know the sub rule is to keep the title as the headline, but man that headline is putting in a lot of work to try and spin him as a heroic figure first and foremost.  He was not, and was more a villain",
                "> Pleaded guilty to tax fraud\n\n\nWhy do so many cops commit tax fraud? Is tax fraud a popular thing to do in America, or is it a cop thing?",
                "No memorial for Kerik would be complete without remembering how he commandeered an apartment intended for 9/11 rescue workers and used it as a fuck pad for him and his mistress.\n\nhttps://www.smh.com.au/world/kerik-took-over-apartment-donated-to-rescue-workers-20041216-gdkbqk.html",
                "Rest in piss..\n\n\nDude a total piece of shit. Fuck him."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Musk’s SpaceX town in Texas warns residents they may lose right to ‘continue using’ their property",
            "external_url": "https://www.cnbc.com/2025/05/29/elon-musk-spacex-starbase-texas.html",
            "upvotes": 19800,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108152118-1748545082164-gettyimages-2214317542-MUSK_STARBASE.jpeg?v=1748545147&w=1920&h=1080",
            "top_comments": [
                "Hey look, an actual case of a foreigner taking property away from Americans.",
                "A government so small it can take your land and rights on a whim.",
                "Here’s the text of the zoning memo sent to Starbase residents:\n\nMay 21, 2025\n\nDear Starbase Property Owner/Property Occupant,\n\nNotice is hereby given that the City Commission for the City of Starbase will conduct a Public Hearing on Monday, June 23, 2025, at 9:00 a.m., at the City of Starbase temporary city hall located at 39046 LBJ Boulevard, Brownsville, TX 78521, to hear public comments, consider and act upon the adoption of a Comprehensive Zoning Ordinance and city wide Zoning Map.\n\nOur goal is to ensure that the zoning plan reflects the City’s vision for balanced growth, protecting critical economic drivers, ensuring public safety, and preserving green spaces. You are receiving this notice because you own the above listed property that will be located in the “Mixed Use District” and will be impacted if the zoning ordinance is approved. \n\nThe Mixed Use District allows for a blend of residential, office, retail, and small-scale service uses. A proposed zoning map is enclosed with this notice. You may view the draft zoning ordinance on the City’s website 72 hours prior to the above listed public hearing.\n\nThe City is required by Texas law to notify you of the following: THE CITY OF STARBASE IS HOLDING A HEARING THAT WILL DETERMINE WHETHER YOU MAY LOSE THE RIGHT TO CONTINUE USING YOUR PROPERTY FOR ITS CURRENT USE, PLEASE READ THIS NOTICE CAREFULLY. The foregoing notice is required by Texas Local Government Code section 211.006(a-1). The proposed zoning ordinance is based on current and existing uses.\n\nPlease contact City Administrator Kent Myers [email address redacted] with any questions or written comments. Your written comments must be submitted by 3:00 pm on June 22, 2025. Public comments may also be given at the above listed public hearing.\n\n \n\nBest Wishes, \n\nKent Myers\n\nCity Administrator, City of Starbase\n\n[addresses redacted]\n\ncityofstarbase-texas.com",
                "So….. years ago almost all property in Boca chica village was acquired by SpaceX in buyouts. All of the residents were bought out and left. There were a few holdouts, some of the property is uninhabited but SpaceX does not own it. They had to build the factory around a few parcels because of it. \n\nThe people that live there now are employees and their families in houses built by the company. They are also building apartment complexes down the road. \n\nI would bet this notice is a legal thing.",
                "Another day older and deeper in debt",
                "Party of small government… takes over your town and tells you the local billionaire now gets to tell you how and where to live.",
                "Are we surprised? No, not at all.",
                ">The company town includes the launch facility where SpaceX conducts test flights of its massive Starship rocket, and company-owned land covering a 1.6-square-mile area.\n\n\"Company town\" is giving me dystopic Gilded Age vibes",
                "Gods, they're even calling it a company town without a single hint of irony. This is what happens when people suppress history.",
                "Oh a billionaire and showing the value of his “network state”. At some point people will wake up and realize these billionaires are corrupt hoarders with zero benefit to society."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump tariffs reinstated by appeals court for now",
            "external_url": "https://www.cnbc.com/2025/05/29/blocked-trump-tariffs-trade-court-appeal.html",
            "upvotes": 23018,
            "date": "05/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108152225-1748555923559-gettyimages-2216368694-AFP_484227F.jpeg?v=1748556294&w=1920&h=1080",
            "top_comments": [
                "It’s on its off it’s on its off\n\n“That’s called blinking boys.”",
                "The tariffs are too impactful (in a bad way) to be ping-ponged around like this. This is embarrassing.",
                "Back and forth the pendulum swings\n\nEveryone loses but the new Kings",
                "Ah shit here we go again.",
                "According to law, there needs to be an emergency in order for the president to have the authority to issue these tariffs by executive fiat. But there was no emergency. The only “emergency” is of Trump’s own making and was caused when Trump started issuing these ridiculous and illegal tariffs in the first place. It’s a dog chasing its own tail except the dog is crazy and ends up eating itself.",
                "It’s amazing how this is used in the exact opposite way it should be used. \n\nInjunctions like this are used to stop entities from doing too much damage while the court makes a decision. Trump is the one causing damage with tariffs and stopping them was the way to prevent further damage while a decision is rendered.",
                "This ruling won't last long, but the damage sure will",
                "How about not implementing anything till it works it way through the courts this back and forth annoying.",
                "Our country is a fucking joke",
                "I’m going to set up a Siri shortcut so when I say Damage Report she reads the top 5 news headlines."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "4-year-old girl who receives medical treatment in US could die if deported, lawyer says",
            "external_url": "https://abcnews.go.com/US/4-year-girl-receiving-medical-treatment-us-die/story?id=122285755",
            "upvotes": 2542,
            "date": "05/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f56b3111-2ebe-4f83-a34b-ad223ffc18d7/Vargas-1-gty-er-250528_1748470039526_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Where are all the pro-life people now?",
                "They assume the US cares if she dies or not",
                "They already deported 2 mid cancer treatment children who were US citizens …..",
                "I think that’s the idea, isn’t it? ",
                "Man, that treatment is intense and expensive. My aunt developed SBS after having surgery for cancer, and even with insurance the medical bills put her into bankruptcy. Can't imagine how this family will manage the expense even if they get to stay here...they will be financially crippled by this. Tragic situation. The American healthcare situation is broken.",
                "Maga don’t care about children after they are born . only when they are a fetus or bag of cells. Also they don’t care about brown people.",
                "The treatment for this is expensive.\n\nWhich is exactly why Trump wants her, and her family, deported.",
                "MAGA probably filled with glee at the prospect.",
                "Eligible voters that didn’t vote for Kamala Harris allowed this to happen.",
                "I work with patients who have this same condition. This child is not the only one in the US getting these threats, unfortunately. These kids literally cannot eat or drink enough to survive and will die quickly without these infusions. In the US kids (and adults) with short bowel syndrome can receive these infusions at home and then go to school or work, generally being contributing members to their communities. In many other countries these people live at the hospital, forever. Home infusions are not an option. They cannot work. Can't go to school. Just survive. It's really fucking sad."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump officials to ask supreme court to halt ‘activist judge’s’ bid to block tariffs",
            "external_url": "https://www.theguardian.com/us-news/2025/may/28/us-court-blocks-trump-tariffs?CMP=Share_iOSApp_Other",
            "upvotes": 10584,
            "date": "05/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b8477475ba49557770f975329c1e8f10b5e979c8/0_0_6723_5377/master/6723.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2479182452a468975fff0dd62f80f715",
            "top_comments": [
                "“I need you to be activist judges to stop the activist judges”",
                "I love how they are “activist” for doing their job. It’s the TRADE court FFS 🤦‍♂️",
                "If all the president has to do is to declare that there is some dramatic emergency, and then start swinging tariffs wildly, Congress has been rendered impotent. I hope the Supreme Court justices, or at least five of them, can see that that is a terrible misreading of the clear terms of the constitution.",
                "These activist judges voted unanimously. One appointed by Obama, one Regan, and one ... you guessed it, Trump.",
                "Yes those \"activist judges\" appointed by Presidents Reagan and Trump.",
                "The activist Judge is actually 3 Judges and of those 3 judges 1 was appointed by Reagan and another one appointed by Trump himself and the rulling was unanimous so at least 2 out of the 3 judges were Appointed by conservative presidents but the moment he they rule against him their activist. \n\n  \nHmmm.",
                ">On Thursday, the Trump administration filed for “emergency relief” from the ruling “to avoid the irreparable national-security and economic harms at stake” The administration will appeal only if a federal court declines to temporarily pause the tariff ruling.\n\nOK. Define the national-security and economic harms. And be specific.",
                "“You’re supposed to always give us what we want, never ask for anything in return, and never complain, otherwise you’re hurting our feelings. Especially when you call me a taco.” Malignant narcissism has taken over our government.",
                "Why are they activist judges.  Jesus why can’t people tone down on the rhetoric.  They’re judges following the rule of law.  The congress is supposed to control taxation not the president.",
                "I like the rights adoption of the term activist judges considering the current state of the supreme court."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Harrison Ruffin Tyler, grandson of the 10th U.S. president, dies at 96",
            "external_url": "https://www.npr.org/2025/05/29/nx-s1-5415207/president-tyler-grandson-harrison-ruffin-tyler",
            "upvotes": 3805,
            "date": "05/29/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7060x3971+277+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8b%2F8a%2F4d24feaa4f7b9f6ff201049e4c4e%2Fgettyimages-1400904559.jpg",
            "top_comments": [
                ">Tyler told Virginia Tech Magazine in 2007 that he and co-founder William Simmons had three goals: \"sell a product that works, hire good employees, and take care of those employees.\" They made the company an Employee Stock Ownership Plan (ESOP) in 1989, and their employees gained controlling interest when they retired in 2000.\n\nSounds like a decent chap. Godspeed.",
                "For context: \n\n- Grandfather was John Tyler (1790-1862)\n- Father was Lyon Gardiner Tyler (1853-1935)\n- Harrison Ruffin Tyler (1928-2025)\n\nJohn had Lyon at age 63 and Lyon had Harrison at age 75. \n\nJohn had 15 kids with two different women. His first wife died in 1842 (8 kids), though she had been an invalid since 1839 after suffering a stroke, and he remarried two years later to someone 30 years younger (7 kids). \n\nLyon then had 6 kids with two different women. His first wife died in 1921 (3 kids) and he remarried two years later to someone 35 years younger (3 kids). \n\nHarrison broke the trend only having 3 kids and he didn't remarry after his wife died in 2019, although by that point he was 91 and suffering from dementia.",
                "Just so everyone is aware, because this has always been one of my favorite stories:\n\nHarrison Tyler was the last living grandson of John Tyler, the tenth President of the United States, who was President from 1841-1845.  \n\nYes, someone who was President of the United States 180 years ago had a grandson who was still alive until a few days ago. And President John Tyler was born in 1790, during George Washington's first Presidential term.\n\nHarrison's brother Lyon died just five years ago.\n\nThis has always been one of those fun facts that blew me away.  R. I. P. Harrison.",
                "So who's the oldest president with living grandchildren now? Must have jumped quite a bit.",
                "Harrison was 96, a fuckin kid",
                "Damn. Now I’m going to have to find a new Presidential fact to drop on my friends. This was always my go to.",
                "I didn't even know he was sick.",
                "Tippecanoe and Tyler....3?",
                "RIP.  Also, John Tyler was a huge asshole and was a major proponent of southern secession and the preservation of slavery.  He's the only American president to ever be buried under the flag of a nation that we were at war with (Confederate flag).  ",
                "One of the all time great history oddities! \nRIP Harrison"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/30/2025 16:11:05 UTC"
}