{
    "posts": [
        {
            "category": "HOT",
            "title": "US measles cases surpass 700 with outbreaks in six states.",
            "external_url": "https://apnews.com/article/measles-outbreak-texas-rfk-new-mexico-kansas-vaccine-e904ec9781f1d164c73afe4ab71774fe",
            "upvotes": 23819,
            "date": "04/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Texas, New Mexico, Indiana, Kansas, Oklahoma and Ohio",
                "measles is **very** contagious, this is only the beginning",
                "The pro-disease crowd must be thrilled.",
                "i just told a coworker about this.  a customer chimed in to say \"measles aint that bad.  you have a chance of going sterile, but that's it\".\n\ni hate this country.",
                "There are parents who are glad their children did not get vaccinated despite it leading to their child's death.  If this were to happen in a movie everyone would complain that this was too unrealistic.",
                "I'm doubtful, but I hope there's a reckoning for the antivaxxers with this ongoing.",
                "And it's only April. We'll see thousands and plenty of dead kids. Thanks propaganda factory! Thanks RFK! Thanks unhinged moms on Facebook looking for 'vaccine friendly pediatricians'!",
                "But, how many cases is normal? Here’s what the magic box says:  \n\nAs of December 31, 2024, a total of 285 measles cases were reported by 33 jurisdictions: Arizona, California, District of Columbia, Florida, Georgia, Idaho, Illinois, Indiana, Louisiana, Maryland, Massachusetts, Michigan, Minnesota, Missouri, New Hampshire, New Jersey, New Mexico, New York City, New York State, North Carolina, Ohio, Oklahoma, Oregon, Pennsylvania, South Carolina, South Dakota, Tennessee, Texas, Vermont, Virginia, Washington, Wisconsin, and West Virginia.\n\nFor the year 2025, in just 4 months we have 700 cases. Not looking good. Way to go RFK, you stupid f@ck!",
                "Measles outbreaks = making America great Again.",
                "Anti vaccine folks, wake up to science."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "RFK Jr giving families ‘false hope’ on autism, says outgoing US vaccine official",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/13/rfk-jr-peter-marks-autism",
            "upvotes": 749,
            "date": "04/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ca54fe20c7015d05332319e0899c81e5ee639e0b/0_4_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ec4c33cc8fda37717a4794f7e524fbb3",
            "top_comments": [
                "He's already given Vitamin A toxicity and a few fatalities a try with his flapping gums and measles, that same crew will blindly continue to follow him into the darkness.",
                "Any family that has one or more members with autism should know better than believe in this. Or rather, if you're dumb enough to believe this from someone like him, you deserve to be scamed for life. There's no cure for stupidity.",
                "There are way too many WORMS in that damn man’s BRAIN!!!",
                "RFK is the most dangerous byproduct of the Trump admin. This guy is single-handedly going to cause kids and people to die.",
                "So how do they explain non vaccinated children with autism? Dumbasses.",
                "Ahh yes, because a rising measles outbreak with Birdflu on the horizon, isn't important. Let's stigmatize an entire group of people by thinking this is just something you wave away with a vaccine.",
                "It’s amazing how people see autism and it’s the end of their world. They just want answers but too many are: “dammit why does my kid have to be different.” This entire anti-vax against autism was because a former playboy model turned bad actress with fake boobs married a New Kid in the Block and neither could handle having a kid with autism. Their excuse: “but no one in the family had it so there has to be a reason why they magically got it.” 🤦‍♂️",
                "... are we REALLY doing this autism shit again after Wakefield?",
                "Experts in the field should get more coverage and weightage than the foolish/selfish people with confidence who are setting the policy today.\n\nAlso, how about some accountability for his actions by RFK Jr? How much does the death of tens of children in Samoa and now some more due to his anti-vaccine stance matter to the world, to the law and to the \"tough on crime\" admin?\n\nHow can a person with so much history of his anti-vaccine stance be given the keys to the health services of a supposedly democratic country?\n\n[https://www.nbcnews.com/news/us-news/rfk-jr-samoa-measles-vaccine-crisis-rcna187787](https://www.nbcnews.com/news/us-news/rfk-jr-samoa-measles-vaccine-crisis-rcna187787)",
                "i have autism and i dont think theres anything wrong with me or that needs fixing. its like he is convinced “different” means “wrong/bad”. and that mentality seems to apply to a lot right now…"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Airstrike destroys parts of Gaza City hospital as Israel intensifies offensive",
            "external_url": "https://www.theguardian.com/world/2025/apr/13/gaza-city-hospital-hit-ahli-baptist-civil-defence-agency-israel-intensifies-military-operations-katz",
            "upvotes": 379,
            "date": "04/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ed96a102a84c234498e10dab4b6ed4e9b53be73e/39_0_1198_719/master/1198.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=632544ccd01aff72de4c28216b12cd51",
            "top_comments": [
                "I can remember when Israel used to deny attacking hospitals",
                "Fear will have people justifying anything",
                "[removed]",
                "Interesting all those \"genocide Joe\" folks are kinda silent or just not reported on anymore. Almost like they were used to depress the vote or something.",
                "Wait, I thought King Donvict brought lasting peace to the mideast like he did to Ukraine?",
                "2025 when genocide is no longer headline news and robber barons rule the Whitehouse.."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Snipers Seem At Victor Perez Protest In Pocatello",
            "external_url": "https://localnews8.com/news/local-news/2025/04/12/police-seen-with-snipers-at-victor-perez-protest/",
            "upvotes": 296,
            "date": "04/13/2025",
            "thumbnail": "https://localnews8.b-cdn.net/2025/04/thumbnail_Screenshot-2025-04-12-at-7.53.29 PM.png",
            "top_comments": [
                "damn thats scary. why tf they need snipers at a protest? seems like massive overkill and just gonna make people more angry",
                ">Police said the reason for this was the safety of the Pocatello police officers, as well as the safety of the protestors.\n\nThere was only one reason why snipers were deployed. Which one do you really believe it was.",
                "Police were supposed to de-escalate situation when 17-yo autistic boy with cerebral palsy had a knife in his backyard.  From behind a fence, they plugged him with 9 bullets within 30 secs of arriving.\n\nNOW Mayor brings in snipers to ensure \"peace\" at a protest?\n\n>The City of Pocatello continues to strongly support the constitutional right to peacefully protest. ... Our law enforcement teams are committed to protecting these rights while also responding appropriately to any potential threats that may compromise public safety.\n\nThis is how bad policing works, when the only \"threat\" to public safety is the Public Safety officers...",
                "This is proof that the FBI is monitoring your cellphone (what you're saying) and tracking location. \n\nSnowden tried to warn y'all.",
                "If cops are bringing long guns to the protests, the protesters should be armed too.",
                "Seem what? Constipated?",
                "The article states that the local police bureau got a tip from the FBI that a person who is believed to target law enforcement was in the general vicinity. Police respond by deploying protection in the form of snipers for the protesters and law enforcement. \n\nBetter to have them there and not need them, than to need them and not have them there 🤷‍♂️",
                "Looks like they were going to take some target practice!",
                "Snipers seem to what again?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Los Angeles-area residents crowdsource wildfire contamination data in battle with insurers",
            "external_url": "https://www.cbsnews.com/news/los-angeles-wildfires-insurance-smoke-damage-crowdsourcing/",
            "upvotes": 2035,
            "date": "04/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/28/b239007b-8ac6-44b1-8bae-cffc1feeb28b/thumbnail/1200x630/8308710326a932388223f628e983e4dd/matthew-craig-show-n-tell-clean.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "*Reports from other urban wildfires, in which building materials, appliances, cars and more burn at incredibly high temperatures, show increased levels of heavy metals including lead and polycyclic aromatic hydrocarbons (PAHs) such as benzene that are tied to negative health risks. But insurance companies haven't standardized testing for those contaminants.*\n\nAlso dioxins and furans from burning plastic. NYC was overwhelmed with all these toxins following 9/11, and the smoke itself took weeks to cease.",
                "It's a fricking outrage that insurance companies are denying smoke damage claims and forcing homeowners to scrape together their own testing data... like the Eaton Fire Residents United group is doing. This is a textbook example of corporate greed putting profits over people's health. Insurance policies need an overhaul, pronto.",
                "\"No help from FEMA...\". Of course, we get no help from FEMA. California is a blue state. Trump is such a vindictive prick he won't even help people that need it, because the state didn't vote for him.",
                "What the fuck is the point of paying for insurance if they're just going to deny you when you're in need?",
                "It is an issue that this is even necessary. The fact that this needs to happen just highlights the fundamental issue that insurance companies are not held to a reasonable standard and that they'll try the slimiest shit they can, relying on the damage one faces to isolate them and prevent them from fighting back. That is an issue that insurance companies have created in every sector they exist.",
                "They should base the awards based on zones not physical homes. We've been watching this unfold here in LA. You have houses with 100x the safe amount of lead, melted roof, and bubbled paint and insurance companies are offering prorated paint jobs based on the age of the house? I'd say pick another insurance company but we don't have many left here to even choose from",
                "Anyone that was in the city should basically assume they've lost ten years from their life expectancy; it would have been safer to attach an old garden hose to the tailpipe of an original Hummer and breath through that.",
                "Very poor here. If insurers have covered this as a payable event, then the claim needs to be paid. No two ways about it\n\nThe problem is next time. What insurer or reinsurer is going to want to cover property in LA from now on? The premiums will be far too expensive, so the state will have to cover it",
                "~Houses; what great investments.~\n\nPartially underground brick with sod-roofs is an actual residence that does the least amount of damage to the environment.\n\nMaking castles on sand that may or may not be covered by insurance is a poor choice of investment.\n\nEdit: don’t take this comment as “CaLiFoRnIa BaD”, I think about all the displaced people often, and it is difficult to know how they are doing because when I’ve looked all I could find were news articles about zoning and building permits.\n\nI think our society could be managed better overall, and I’ve posted before about perhaps rebuilding LA to be similar to the Jetsons. If this is outlandish, well every location/climate requires different infrastructure. A raised city might be a good thing in an area with easily persistent fire"
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "SMART Rallies as Supreme Court Blocks Return of Deported Sheet Metal Worker",
            "external_url": "https://www.achrnews.com/articles/164441-smart-rallies-as-supreme-court-blocks-return-of-deported-sheet-metal-worker",
            "upvotes": 99,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Chief Justice Roberts, writing for the majority, focused heavily on what he termed \"improper venue shopping\" by the plaintiffs, suggesting they had sought out sympathetic courts to hear their case.\n\n\nHypocritical piece of shit.",
                "This is old news at this point, right? ",
                "Oh yes, where I get my most critical information from....air conditioning, heating, and refrigeration news. The Pulitzer of hard-hitting journalism. You know you can find better sources than this one?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Man killed in 1 of 4 Thursday night Montgomery shootings identified",
            "external_url": "https://www.wsfa.com/2025/03/14/man-killed-1-4-thursday-night-montgomery-shootings-identified/",
            "upvotes": 1957,
            "date": "04/12/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/ERU4UH35UBGMPH3OCPYC36VXOA.jpg?auth=1ab795b9a7d8adeb59ca62e8446e9f1ec84546a4a840944ebe7767f5b15e5d5a&width=1200&height=600&smart=true",
            "top_comments": [
                "Police are waiting for forensic results to see if he was killed in any of the other shootings.",
                "> At least five people were shot in the Capital City in a two-hour span, including Samuel Giles, 25, of Montgomery, who died from his injuries.\n\nI feel for the people. It has to be incredibly scary to have no answers, and to wonder if this is a pattern of shootings that will continue.",
                "Montgomery resident here. Or, I was as of a few months ago. Montgomery has a serious problem with gang violence, and our dear mayor refuses to acknowledge it. You probably remember him. Steven Reed made national headlines a few years back as the first black man elected Mayor of Montgomery, once the home of the Confederacy. What they *didn’t* tell you, is that he’s the son of one of Montgomery’s most corrupt politicians in recent times. As of late, it’s clear the Apple doesn’t fall far from the questionably sourced political donations. \n\nI have it on good authority that Reed wants to make a shot at Congress, and his blatant disregard for the growing violence in his city probably won’t help him.",
                "You're not supposed to be able to do that in a small town and guns prevent gun deaths in deep red Alabama.",
                "It's deeply unsettling to hear about this string of violent events, and it's particularly troubling to think that they might *not* be related, given the lack of identified motives, I hope authorities can quickly find answers, because honestly, it's hard to believe that so much tragedy can happen without any clear connection.",
                "Just another day in the land of the freedumb.",
                "It's genuinely heartbreaking to hear about this awful chain of incidents in Montgomery, and frankly, the city needs some serious support, it's just awful., and a focus on preventing this kind of violence so everyone can feel safe, because, really, it shouldn't happen.",
                "I drove through Montgomery and got a hotel room two years ago at a decent place while traveling to FL and the lady at the hotel said I am so thankful you stopped here and not the other exit. She said it’s dangerous. She was the sweetest. You don’t know what is bad or good in cities but I picked the best exit to stop for sure.",
                "At least he didn't die on a subway",
                "[deleted]"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Victor Perez Boy shot by police declared ‘clinically braindead’; candlelight vigil to be held before life support system unplugged",
            "external_url": "https://www.eastidahonews.com/2025/04/boy-shot-by-police-declared-clinically-braindead-candlelight-vigil-to-be-held-before-life-support-system-unplugged/",
            "upvotes": 13545,
            "date": "04/12/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/eErezhosptialedit.jpg",
            "top_comments": [
                "They sure are sparse with information about what occured.",
                "This includes video of the event up until the shooting. \n\n\nhttps://www.fox10phoenix.com/news/victor-perez-pocatello-idaho-shooting-go-fund-me",
                "And this, my friends, is why you NEVER, EVER, call the police to deescalate a situation involving a disabled person.",
                "Basically cops are trained that their lives should never be put in any jeopardy. The downside is that everyone will always be in jeopardy before the police.",
                "[Don't Call the Police](https://dontcallthepolice.com)",
                "Cops are not trained to deal with people who have disabilities or are autistic.  I used to work with adults who were autistic, we had a neighbor of the group home call the cops because someone was being loud. Cops came out, they kept on yelling at him to follow orders. They were about to shoot him until we came out, a case worker and myself. Had to intervene and tell the cops he couldn't understand them; he was autistic. They arrested him; later the sheriff's dept decided it was a brilliant idea to release him in the middle of the night. No vehicle. No phone for us to track his location. He had to walk next to the highway for hours in the rain until we found him sitting down beside a street drenched in rain. There needs to be accountability and retraining for their officers. This is beyond bs.",
                "They’ve got tasers and pepper spray. Why even carry those if your first solution is the pistol.",
                "Never point a cop at anything you don't intend to kill.",
                "State sponsored murder. Calling the police on a family member suffering from a mental health crisis is a terrifying thing to do.",
                "This is how police in 3rd world countries deal with someone armed with a knife. \n\nhttps://www.youtube.com/watch?v=j_s2rZR7IkQ\n\nWhy can't our police try something else besides shooting?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Luigi Mangione defense asks judge to block death penalty in CEO slay case",
            "external_url": "https://www.cnbc.com/2025/04/11/luigi-mangione-death-penalty-brian-thompson-case.html",
            "upvotes": 50415,
            "date": "04/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108105908-17401702152025-02-21t202801z_1440528033_rc27zcal85co_rtrmadp_0_unitedhealth-ceo.jpeg?v=1740170306&w=1920&h=1080",
            "top_comments": [
                "“The Attorney General's television appearance was similar to her first two public statements\nin that she never mentioned that Mr. Mangione was **not indicted** nor that he has the presumption of innocence. \n\nShe emphasized, for the third time, that her decision to seek the death penalty was based on the President's directive, specifically that the administration will seek the death sentence \"whenever possible.\" She then invoked her personal experience, saying that she was a capital prosecutor, who tried death penalty cases and that \"If there was ever a death case, this is one.\" **The Attorney General stated during her television appearance that a reason she ordered the death sentence was because the alleged victim was a CEO. Counsel is aware of no provision in the death penalty statute or in the Department of Justice's death penalty protocol that allows for consideration of the social, economic or professional status of an alleged homicide victim in determining whether to seek the death penalty.”**\n\nI encourage everyone to read the motion, it makes some strong points.",
                "I'd publicly ask for a pardon while I was at it. Just to get it on record.",
                "Why does he need a cop breathing down his neck in every shot lmao. They just get closer and closer every time I see him it's getting a bit intimate. By the time Luigi actually receives his sentence, half the precinct is going to be on his lap.",
                "This trial is gonna be a whole media spectacle. I wonder what the reaction from the oligarchs will be if the jury refuses to convict him.",
                "But Pammy doesn’t care about the husband and father they “accidentally sent” to a brutal prison in El Salvador and refuses to get him removed.",
                "I'm still wondering how hard jury selection will be for this. It's going to be difficult considering how many people have strong opinions about the healthcare industry.",
                ">Counsel is aware of **no** provision in the death\npenalty statute or in the Department of Justice’s death penalty protocol that allows for\n**consideration of the social, economic or professional status of an alleged homicide victim in determining whether to seek the death penalty.**\n\n>Rather than relying on these reasons, **the Attorney General cited the professional status of\nthe victim as a CEO**, the fact that the previous administration had not sought the death penalty in\nfour years and that her decision to order it here was due to the **president’s policy to “Make America Safe Again.” **Also, if the death penalty was being ordered pursuant to policy instead of publicity, the** Attorney General would not have put her directive in the form of a press release followed by an Instagram post that effectively launched a new government social media account.**\n\nSome excellent points by his attorneys.",
                "When are they going to go after the people that killed the Boeing Whistleblowers?",
                "Absolutely crazy that from the start he’s been treated as guilty. What happened to due process?",
                "Didn't Trump already pardon him when he said, \"if it's good for the country, it's not illegal\"?"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Judge rules Mahmoud Khalil can be deported",
            "external_url": "https://www.npr.org/2025/04/11/nx-s1-5361208/mahmoud-khalil-deported-judge-rubio-antisemitism-immigration-court",
            "upvotes": 9200,
            "date": "04/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5760x3240+0+300/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb2%2F1f%2Fc66ce9ff42329e8acf27219cc5f7%2Fap25086587454957.jpg",
            "top_comments": [
                ">Khalil, who has a green card, is a lawful permanent resident. In ordering Khalil's deportation, Rubio relied on a rarely used federal statute from the 1950s that played a major role in shaping American immigration during the Cold War. The McCarran-Walter Act, or the Immigration Nationality Act of 1952, gives the secretary of state authority to decide that a noncitizen's presence in the United States threatens the country's foreign policy goals.\n\nJust what are America's foreign policy goals?",
                "ICE is moving people to states with friendly judges for kangaroo like courts",
                "If lawful permanent residents can be deported for exercising their first amendment rights, don't fool yourself, citizens can be next.",
                "The depressing thing is that \"deported\" now can mean sent back to your country of origin or locked up for life in a Salvadoran black site with no hope of anyone ever seeing you alive again.\n\nEdit: I still can't believe our media has played along with that abuse of language. It's not \"deporting\" someone to imprison them for life without trial in a foreign country.",
                "During the Red Scare the United States exiled such brilliant minds as native US citizen Frank Malina, one of the founders of CalTech’s Jet Propulsion Laboratory, for having ties to Communism. \n\nWe’re doing it again. ",
                "Congratulations, the first amendment and due process no longer matter in America. This is truly unbelievable that a judge would allow the SoS to violate someone’s constitutional rights so blatantly.",
                "“Criminal” migrants\n\n“Illegal” migrants\n\nPermanent residents  <- We are here\n\nNaturalized citizens\n\n“Criminal” citizens\n\n“Dissenting” citizens\n\nDemocrats\n\nAnyone who opposes Trump\n\nIf you think this isn’t the natural progression, wake the fuck up. This has happened before more than once throughout history.",
                "This is an immigration judge.  There is also a case in federal court.",
                "Louisiana judge.  They moved him there to avoid NE judges.  \n\nThis is why they grab people off the street and fly them to LA.",
                "Pretty soon nobody is gonna be allowed to hurt Israel's precious feelings without getting a boot on their neck."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "RFK Jr giving families ‘false hope’ on autism, says outgoing US vaccine official",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/13/rfk-jr-peter-marks-autism",
            "upvotes": 737,
            "date": "04/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ca54fe20c7015d05332319e0899c81e5ee639e0b/0_4_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ec4c33cc8fda37717a4794f7e524fbb3",
            "top_comments": [
                "He's already given Vitamin A toxicity and a few fatalities a try with his flapping gums and measles, that same crew will blindly continue to follow him into the darkness.",
                "Any family that has one or more members with autism should know better than believe in this. Or rather, if you're dumb enough to believe this from someone like him, you deserve to be scamed for life. There's no cure for stupidity.",
                "There are way too many WORMS in that damn man’s BRAIN!!!",
                "RFK is the most dangerous byproduct of the Trump admin. This guy is single-handedly going to cause kids and people to die.",
                "So how do they explain non vaccinated children with autism? Dumbasses.",
                "Ahh yes, because a rising measles outbreak with Birdflu on the horizon, isn't important. Let's stigmatize an entire group of people by thinking this is just something you wave away with a vaccine.",
                "It’s amazing how people see autism and it’s the end of their world. They just want answers but too many are: “dammit why does my kid have to be different.” This entire anti-vax against autism was because a former playboy model turned bad actress with fake boobs married a New Kid in the Block and neither could handle having a kid with autism. Their excuse: “but no one in the family had it so there has to be a reason why they magically got it.” 🤦‍♂️",
                "... are we REALLY doing this autism shit again after Wakefield?",
                "Experts in the field should get more coverage and weightage than the foolish/selfish people with confidence who are setting the policy today.\n\nAlso, how about some accountability for his actions by RFK Jr? How much does the death of tens of children in Samoa and now some more due to his anti-vaccine stance matter to the world, to the law and to the \"tough on crime\" admin?\n\nHow can a person with so much history of his anti-vaccine stance be given the keys to the health services of a supposedly democratic country?\n\n[https://www.nbcnews.com/news/us-news/rfk-jr-samoa-measles-vaccine-crisis-rcna187787](https://www.nbcnews.com/news/us-news/rfk-jr-samoa-measles-vaccine-crisis-rcna187787)",
                "i have autism and i dont think theres anything wrong with me or that needs fixing. its like he is convinced “different” means “wrong/bad”. and that mentality seems to apply to a lot right now…"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Snipers Seem At Victor Perez Protest In Pocatello",
            "external_url": "https://localnews8.com/news/local-news/2025/04/12/police-seen-with-snipers-at-victor-perez-protest/",
            "upvotes": 294,
            "date": "04/13/2025",
            "thumbnail": "https://localnews8.b-cdn.net/2025/04/thumbnail_Screenshot-2025-04-12-at-7.53.29 PM.png",
            "top_comments": [
                "damn thats scary. why tf they need snipers at a protest? seems like massive overkill and just gonna make people more angry",
                ">Police said the reason for this was the safety of the Pocatello police officers, as well as the safety of the protestors.\n\nThere was only one reason why snipers were deployed. Which one do you really believe it was.",
                "Police were supposed to de-escalate situation when 17-yo autistic boy with cerebral palsy had a knife in his backyard.  From behind a fence, they plugged him with 9 bullets within 30 secs of arriving.\n\nNOW Mayor brings in snipers to ensure \"peace\" at a protest?\n\n>The City of Pocatello continues to strongly support the constitutional right to peacefully protest. ... Our law enforcement teams are committed to protecting these rights while also responding appropriately to any potential threats that may compromise public safety.\n\nThis is how bad policing works, when the only \"threat\" to public safety is the Public Safety officers...",
                "This is proof that the FBI is monitoring your cellphone (what you're saying) and tracking location. \n\nSnowden tried to warn y'all.",
                "If cops are bringing long guns to the protests, the protesters should be armed too.",
                "Seem what? Constipated?",
                "The article states that the local police bureau got a tip from the FBI that a person who is believed to target law enforcement was in the general vicinity. Police respond by deploying protection in the form of snipers for the protesters and law enforcement. \n\nBetter to have them there and not need them, than to need them and not have them there 🤷‍♂️",
                "Looks like they were going to take some target practice!",
                "Snipers seem to what again?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "SMART Rallies as Supreme Court Blocks Return of Deported Sheet Metal Worker",
            "external_url": "https://www.achrnews.com/articles/164441-smart-rallies-as-supreme-court-blocks-return-of-deported-sheet-metal-worker",
            "upvotes": 97,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Chief Justice Roberts, writing for the majority, focused heavily on what he termed \"improper venue shopping\" by the plaintiffs, suggesting they had sought out sympathetic courts to hear their case.\n\n\nHypocritical piece of shit.",
                "This is old news at this point, right? ",
                "Oh yes, where I get my most critical information from....air conditioning, heating, and refrigeration news. The Pulitzer of hard-hitting journalism. You know you can find better sources than this one?"
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "NEW",
            "title": "Airstrike destroys parts of Gaza City hospital as Israel intensifies offensive",
            "external_url": "https://www.theguardian.com/world/2025/apr/13/gaza-city-hospital-hit-ahli-baptist-civil-defence-agency-israel-intensifies-military-operations-katz",
            "upvotes": 383,
            "date": "04/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ed96a102a84c234498e10dab4b6ed4e9b53be73e/39_0_1198_719/master/1198.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=632544ccd01aff72de4c28216b12cd51",
            "top_comments": [
                "I can remember when Israel used to deny attacking hospitals",
                "Fear will have people justifying anything",
                "[removed]",
                "Interesting all those \"genocide Joe\" folks are kinda silent or just not reported on anymore. Almost like they were used to depress the vote or something.",
                "Wait, I thought King Donvict brought lasting peace to the mideast like he did to Ukraine?",
                "2025 when genocide is no longer headline news and robber barons rule the Whitehouse.."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US measles cases surpass 700 with outbreaks in six states.",
            "external_url": "https://apnews.com/article/measles-outbreak-texas-rfk-new-mexico-kansas-vaccine-e904ec9781f1d164c73afe4ab71774fe",
            "upvotes": 23829,
            "date": "04/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Texas, New Mexico, Indiana, Kansas, Oklahoma and Ohio",
                "measles is **very** contagious, this is only the beginning",
                "The pro-disease crowd must be thrilled.",
                "i just told a coworker about this.  a customer chimed in to say \"measles aint that bad.  you have a chance of going sterile, but that's it\".\n\ni hate this country.",
                "There are parents who are glad their children did not get vaccinated despite it leading to their child's death.  If this were to happen in a movie everyone would complain that this was too unrealistic.",
                "I'm doubtful, but I hope there's a reckoning for the antivaxxers with this ongoing.",
                "And it's only April. We'll see thousands and plenty of dead kids. Thanks propaganda factory! Thanks RFK! Thanks unhinged moms on Facebook looking for 'vaccine friendly pediatricians'!",
                "But, how many cases is normal? Here’s what the magic box says:  \n\nAs of December 31, 2024, a total of 285 measles cases were reported by 33 jurisdictions: Arizona, California, District of Columbia, Florida, Georgia, Idaho, Illinois, Indiana, Louisiana, Maryland, Massachusetts, Michigan, Minnesota, Missouri, New Hampshire, New Jersey, New Mexico, New York City, New York State, North Carolina, Ohio, Oklahoma, Oregon, Pennsylvania, South Carolina, South Dakota, Tennessee, Texas, Vermont, Virginia, Washington, Wisconsin, and West Virginia.\n\nFor the year 2025, in just 4 months we have 700 cases. Not looking good. Way to go RFK, you stupid f@ck!",
                "Measles outbreaks = making America great Again.",
                "Anti vaccine folks, wake up to science."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Los Angeles-area residents crowdsource wildfire contamination data in battle with insurers",
            "external_url": "https://www.cbsnews.com/news/los-angeles-wildfires-insurance-smoke-damage-crowdsourcing/",
            "upvotes": 2028,
            "date": "04/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/28/b239007b-8ac6-44b1-8bae-cffc1feeb28b/thumbnail/1200x630/8308710326a932388223f628e983e4dd/matthew-craig-show-n-tell-clean.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "*Reports from other urban wildfires, in which building materials, appliances, cars and more burn at incredibly high temperatures, show increased levels of heavy metals including lead and polycyclic aromatic hydrocarbons (PAHs) such as benzene that are tied to negative health risks. But insurance companies haven't standardized testing for those contaminants.*\n\nAlso dioxins and furans from burning plastic. NYC was overwhelmed with all these toxins following 9/11, and the smoke itself took weeks to cease.",
                "It's a fricking outrage that insurance companies are denying smoke damage claims and forcing homeowners to scrape together their own testing data... like the Eaton Fire Residents United group is doing. This is a textbook example of corporate greed putting profits over people's health. Insurance policies need an overhaul, pronto.",
                "\"No help from FEMA...\". Of course, we get no help from FEMA. California is a blue state. Trump is such a vindictive prick he won't even help people that need it, because the state didn't vote for him.",
                "What the fuck is the point of paying for insurance if they're just going to deny you when you're in need?",
                "It is an issue that this is even necessary. The fact that this needs to happen just highlights the fundamental issue that insurance companies are not held to a reasonable standard and that they'll try the slimiest shit they can, relying on the damage one faces to isolate them and prevent them from fighting back. That is an issue that insurance companies have created in every sector they exist.",
                "They should base the awards based on zones not physical homes. We've been watching this unfold here in LA. You have houses with 100x the safe amount of lead, melted roof, and bubbled paint and insurance companies are offering prorated paint jobs based on the age of the house? I'd say pick another insurance company but we don't have many left here to even choose from",
                "Anyone that was in the city should basically assume they've lost ten years from their life expectancy; it would have been safer to attach an old garden hose to the tailpipe of an original Hummer and breath through that.",
                "Very poor here. If insurers have covered this as a payable event, then the claim needs to be paid. No two ways about it\n\nThe problem is next time. What insurer or reinsurer is going to want to cover property in LA from now on? The premiums will be far too expensive, so the state will have to cover it",
                "~Houses; what great investments.~\n\nPartially underground brick with sod-roofs is an actual residence that does the least amount of damage to the environment.\n\nMaking castles on sand that may or may not be covered by insurance is a poor choice of investment.\n\nEdit: don’t take this comment as “CaLiFoRnIa BaD”, I think about all the displaced people often, and it is difficult to know how they are doing because when I’ve looked all I could find were news articles about zoning and building permits.\n\nI think our society could be managed better overall, and I’ve posted before about perhaps rebuilding LA to be similar to the Jetsons. If this is outlandish, well every location/climate requires different infrastructure. A raised city might be a good thing in an area with easily persistent fire"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Man killed in 1 of 4 Thursday night Montgomery shootings identified",
            "external_url": "https://www.wsfa.com/2025/03/14/man-killed-1-4-thursday-night-montgomery-shootings-identified/",
            "upvotes": 1952,
            "date": "04/12/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/ERU4UH35UBGMPH3OCPYC36VXOA.jpg?auth=1ab795b9a7d8adeb59ca62e8446e9f1ec84546a4a840944ebe7767f5b15e5d5a&width=1200&height=600&smart=true",
            "top_comments": [
                "Police are waiting for forensic results to see if he was killed in any of the other shootings.",
                "> At least five people were shot in the Capital City in a two-hour span, including Samuel Giles, 25, of Montgomery, who died from his injuries.\n\nI feel for the people. It has to be incredibly scary to have no answers, and to wonder if this is a pattern of shootings that will continue.",
                "Montgomery resident here. Or, I was as of a few months ago. Montgomery has a serious problem with gang violence, and our dear mayor refuses to acknowledge it. You probably remember him. Steven Reed made national headlines a few years back as the first black man elected Mayor of Montgomery, once the home of the Confederacy. What they *didn’t* tell you, is that he’s the son of one of Montgomery’s most corrupt politicians in recent times. As of late, it’s clear the Apple doesn’t fall far from the questionably sourced political donations. \n\nI have it on good authority that Reed wants to make a shot at Congress, and his blatant disregard for the growing violence in his city probably won’t help him.",
                "You're not supposed to be able to do that in a small town and guns prevent gun deaths in deep red Alabama.",
                "It's deeply unsettling to hear about this string of violent events, and it's particularly troubling to think that they might *not* be related, given the lack of identified motives, I hope authorities can quickly find answers, because honestly, it's hard to believe that so much tragedy can happen without any clear connection.",
                "Just another day in the land of the freedumb.",
                "It's genuinely heartbreaking to hear about this awful chain of incidents in Montgomery, and frankly, the city needs some serious support, it's just awful., and a focus on preventing this kind of violence so everyone can feel safe, because, really, it shouldn't happen.",
                "I drove through Montgomery and got a hotel room two years ago at a decent place while traveling to FL and the lady at the hotel said I am so thankful you stopped here and not the other exit. She said it’s dangerous. She was the sweetest. You don’t know what is bad or good in cities but I picked the best exit to stop for sure.",
                "At least he didn't die on a subway",
                "[deleted]"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Victor Perez Boy shot by police declared ‘clinically braindead’; candlelight vigil to be held before life support system unplugged",
            "external_url": "https://www.eastidahonews.com/2025/04/boy-shot-by-police-declared-clinically-braindead-candlelight-vigil-to-be-held-before-life-support-system-unplugged/",
            "upvotes": 13551,
            "date": "04/12/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/eErezhosptialedit.jpg",
            "top_comments": [
                "They sure are sparse with information about what occured.",
                "This includes video of the event up until the shooting. \n\n\nhttps://www.fox10phoenix.com/news/victor-perez-pocatello-idaho-shooting-go-fund-me",
                "And this, my friends, is why you NEVER, EVER, call the police to deescalate a situation involving a disabled person.",
                "Basically cops are trained that their lives should never be put in any jeopardy. The downside is that everyone will always be in jeopardy before the police.",
                "[Don't Call the Police](https://dontcallthepolice.com)",
                "Cops are not trained to deal with people who have disabilities or are autistic.  I used to work with adults who were autistic, we had a neighbor of the group home call the cops because someone was being loud. Cops came out, they kept on yelling at him to follow orders. They were about to shoot him until we came out, a case worker and myself. Had to intervene and tell the cops he couldn't understand them; he was autistic. They arrested him; later the sheriff's dept decided it was a brilliant idea to release him in the middle of the night. No vehicle. No phone for us to track his location. He had to walk next to the highway for hours in the rain until we found him sitting down beside a street drenched in rain. There needs to be accountability and retraining for their officers. This is beyond bs.",
                "They’ve got tasers and pepper spray. Why even carry those if your first solution is the pistol.",
                "Never point a cop at anything you don't intend to kill.",
                "State sponsored murder. Calling the police on a family member suffering from a mental health crisis is a terrifying thing to do.",
                "This is how police in 3rd world countries deal with someone armed with a knife. \n\nhttps://www.youtube.com/watch?v=j_s2rZR7IkQ\n\nWhy can't our police try something else besides shooting?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Judge rules Menendez brothers resentencing bid can move forward",
            "external_url": "https://www.bbc.com/news/articles/cp8kmrg1p8go",
            "upvotes": 1008,
            "date": "04/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/ea13/live/f5ca4e00-15b7-11f0-a658-83a7b9f03655.jpg",
            "top_comments": [
                "Oh this should be interesting",
                "If the sons were right about the fathers' sexual abuse as motive for the killing,  then they served more than enough time--but then again why kill the mother too (her silence doesn't seem like a good reason for guys who were young adults around 20 years old)",
                "Lets just go straight to Trump issuing some sort of pardon and giving them a medal on the ~~used car lot~~ Rose Lawn.",
                "There's zero question about what the father did, there's already been another accuser independent of the brothers",
                "[removed]",
                "I personally just don't know how you don't let them out if Gypsy Rose was let out.",
                "Yeah no, if you’re being abused you wouldn’t say they were murdered by the mob and change the story when it’s convenient",
                "Basically it came down to the boys wanting to be rid of their parents, but to not risk losing out on their wealth and inheritance.  It appears as though they planned this murder to accomplish that - which is why it seems to have been premeditated (and why they didn’t just leave the household to stop the abuse from continuing)",
                "[deleted]",
                "I am shocked Trump hasn't pardoned Derrick Chauvin...yet."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "In One Colorado Town, People Experiencing Homelessness Can Sleep in Their Car — if They Have a Job",
            "external_url": "https://www.nytimes.com/2025/04/11/realestate/colorado-homeless-parking-lot-affordable-housing.html?unlocked_article_code=1.-04.9C5S.OB5RRj2hZlYR&smid=url-share",
            "upvotes": 1988,
            "date": "04/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Here in cars, trucks and vans, behind foggy windshields and zipped in sleeping bags, those who serve the vacationers who come to enjoy the snow tried to fall asleep on a recent night — two ski instructors, two snow plow drivers, a ski lift operator, an ice fishing guide, a dog sledding guide, the employee of a ski resort whose job includes scanning ski passes, two ER nurses who treat their injuries, a cashier at a drugstore, multiple servers at local restaurants, as well as Kristine Litchfield, who earns $24 an hour at a ski shop fitting people for their boots.\n\nThe cost of living affordability crisis is real. People demonize the homeless because it's easier than facing how easy it is to become homeless these days.",
                "Working homeless is a thing, sadly.\n\nWorst offender is Disneyland. Multi-billion dollar parent company, profitable theme parks, has workers who cannot afford a place and also has a community funded food pantry for the workers.",
                "I HATE that they harass people sleeping in their cars! Giant empty store parking lots patrolled by security and police kicking people out for what?! What are they going to do to cement?",
                "And I'm sure they provide facilities for homeless in exchange of this ridiculous arbitrary decision right?\n\nRight?",
                "It's ok to be homeless but only if you have a job is some next level dystopian bullshit",
                "Maybe this is a weird question, but if you own a parking lot, can you decide whether people can sleep in their cars in it or is there some law or regulation that supersedes property rights in many places?\n\nThe reason I ask is why would strip malls or other places with parking lots not just charge like $5 from like 9pm to 7am to sleep in your car? You aren’t making any money during those hours anyway so it’s basically found revenue. And the agreement is just that at 7am the car has to leave for the day.",
                "So if I download the Uber Driver app, does this mean I can sleep in my car at this one Colorado town?",
                "Someone should form a non-profit. And they should hire every single homeless person in town, for 1 minute a day per year.  Or, you know, more If they can find some stuff for people to do. \n\nAs I have seen mentioned many times, there is plenty of work to be done. There are just no jobs to do those things because nobody can make a profit on getting them done.",
                "Man i know this is not the point of the thread BUT i spent years trying to live out of my car in the Bay Area only to constantly be awoken by security or law enforcement at anywhere from public streets to gym, hotel, and walmart parking spaces.  I had a decent paying daytime job that I thoroughly enjoyed but i just didn’t care about spending all my income sharing a space with strangers AND this regulation would have been great then for someone like me.  Anyways after the last incidence when i had cops pointing guns at me at 4 am, i relocated to the Midwest, found a decent job, and eventually met my now wife so not all lost.",
                "This is dystopian. One billionaire could single-handedly fund enough low-income housing to fix the housing problem. \n\nOh, if the current White House occupant hadn’t doubled the cost of building anything. Now it’ll take two billionaires."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "RFK Jr giving families ‘false hope’ on autism, says outgoing US vaccine official",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/13/rfk-jr-peter-marks-autism",
            "upvotes": 737,
            "date": "04/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ca54fe20c7015d05332319e0899c81e5ee639e0b/0_4_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ec4c33cc8fda37717a4794f7e524fbb3",
            "top_comments": [
                "He's already given Vitamin A toxicity and a few fatalities a try with his flapping gums and measles, that same crew will blindly continue to follow him into the darkness.",
                "Any family that has one or more members with autism should know better than believe in this. Or rather, if you're dumb enough to believe this from someone like him, you deserve to be scamed for life. There's no cure for stupidity.",
                "There are way too many WORMS in that damn man’s BRAIN!!!",
                "RFK is the most dangerous byproduct of the Trump admin. This guy is single-handedly going to cause kids and people to die.",
                "So how do they explain non vaccinated children with autism? Dumbasses.",
                "Ahh yes, because a rising measles outbreak with Birdflu on the horizon, isn't important. Let's stigmatize an entire group of people by thinking this is just something you wave away with a vaccine.",
                "It’s amazing how people see autism and it’s the end of their world. They just want answers but too many are: “dammit why does my kid have to be different.” This entire anti-vax against autism was because a former playboy model turned bad actress with fake boobs married a New Kid in the Block and neither could handle having a kid with autism. Their excuse: “but no one in the family had it so there has to be a reason why they magically got it.” 🤦‍♂️",
                "... are we REALLY doing this autism shit again after Wakefield?",
                "Experts in the field should get more coverage and weightage than the foolish/selfish people with confidence who are setting the policy today.\n\nAlso, how about some accountability for his actions by RFK Jr? How much does the death of tens of children in Samoa and now some more due to his anti-vaccine stance matter to the world, to the law and to the \"tough on crime\" admin?\n\nHow can a person with so much history of his anti-vaccine stance be given the keys to the health services of a supposedly democratic country?\n\n[https://www.nbcnews.com/news/us-news/rfk-jr-samoa-measles-vaccine-crisis-rcna187787](https://www.nbcnews.com/news/us-news/rfk-jr-samoa-measles-vaccine-crisis-rcna187787)",
                "i have autism and i dont think theres anything wrong with me or that needs fixing. its like he is convinced “different” means “wrong/bad”. and that mentality seems to apply to a lot right now…"
            ],
            "aggregate_sentiment": 70.0
        },
        {
            "category": "RISING",
            "title": "Airstrike destroys parts of Gaza City hospital as Israel intensifies offensive",
            "external_url": "https://www.theguardian.com/world/2025/apr/13/gaza-city-hospital-hit-ahli-baptist-civil-defence-agency-israel-intensifies-military-operations-katz",
            "upvotes": 384,
            "date": "04/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ed96a102a84c234498e10dab4b6ed4e9b53be73e/39_0_1198_719/master/1198.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=632544ccd01aff72de4c28216b12cd51",
            "top_comments": [
                "I can remember when Israel used to deny attacking hospitals",
                "Fear will have people justifying anything",
                "[removed]",
                "Interesting all those \"genocide Joe\" folks are kinda silent or just not reported on anymore. Almost like they were used to depress the vote or something.",
                "Wait, I thought King Donvict brought lasting peace to the mideast like he did to Ukraine?",
                "2025 when genocide is no longer headline news and robber barons rule the Whitehouse.."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Snipers Seem At Victor Perez Protest In Pocatello",
            "external_url": "https://localnews8.com/news/local-news/2025/04/12/police-seen-with-snipers-at-victor-perez-protest/",
            "upvotes": 294,
            "date": "04/13/2025",
            "thumbnail": "https://localnews8.b-cdn.net/2025/04/thumbnail_Screenshot-2025-04-12-at-7.53.29 PM.png",
            "top_comments": [
                "damn thats scary. why tf they need snipers at a protest? seems like massive overkill and just gonna make people more angry",
                ">Police said the reason for this was the safety of the Pocatello police officers, as well as the safety of the protestors.\n\nThere was only one reason why snipers were deployed. Which one do you really believe it was.",
                "Police were supposed to de-escalate situation when 17-yo autistic boy with cerebral palsy had a knife in his backyard.  From behind a fence, they plugged him with 9 bullets within 30 secs of arriving.\n\nNOW Mayor brings in snipers to ensure \"peace\" at a protest?\n\n>The City of Pocatello continues to strongly support the constitutional right to peacefully protest. ... Our law enforcement teams are committed to protecting these rights while also responding appropriately to any potential threats that may compromise public safety.\n\nThis is how bad policing works, when the only \"threat\" to public safety is the Public Safety officers...",
                "This is proof that the FBI is monitoring your cellphone (what you're saying) and tracking location. \n\nSnowden tried to warn y'all.",
                "If cops are bringing long guns to the protests, the protesters should be armed too.",
                "Seem what? Constipated?",
                "The article states that the local police bureau got a tip from the FBI that a person who is believed to target law enforcement was in the general vicinity. Police respond by deploying protection in the form of snipers for the protesters and law enforcement. \n\nBetter to have them there and not need them, than to need them and not have them there 🤷‍♂️",
                "Looks like they were going to take some target practice!",
                "Snipers seem to what again?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "US measles cases surpass 700 with outbreaks in six states.",
            "external_url": "https://apnews.com/article/measles-outbreak-texas-rfk-new-mexico-kansas-vaccine-e904ec9781f1d164c73afe4ab71774fe",
            "upvotes": 23827,
            "date": "04/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Texas, New Mexico, Indiana, Kansas, Oklahoma and Ohio",
                "measles is **very** contagious, this is only the beginning",
                "The pro-disease crowd must be thrilled.",
                "i just told a coworker about this.  a customer chimed in to say \"measles aint that bad.  you have a chance of going sterile, but that's it\".\n\ni hate this country.",
                "There are parents who are glad their children did not get vaccinated despite it leading to their child's death.  If this were to happen in a movie everyone would complain that this was too unrealistic.",
                "I'm doubtful, but I hope there's a reckoning for the antivaxxers with this ongoing.",
                "And it's only April. We'll see thousands and plenty of dead kids. Thanks propaganda factory! Thanks RFK! Thanks unhinged moms on Facebook looking for 'vaccine friendly pediatricians'!",
                "But, how many cases is normal? Here’s what the magic box says:  \n\nAs of December 31, 2024, a total of 285 measles cases were reported by 33 jurisdictions: Arizona, California, District of Columbia, Florida, Georgia, Idaho, Illinois, Indiana, Louisiana, Maryland, Massachusetts, Michigan, Minnesota, Missouri, New Hampshire, New Jersey, New Mexico, New York City, New York State, North Carolina, Ohio, Oklahoma, Oregon, Pennsylvania, South Carolina, South Dakota, Tennessee, Texas, Vermont, Virginia, Washington, Wisconsin, and West Virginia.\n\nFor the year 2025, in just 4 months we have 700 cases. Not looking good. Way to go RFK, you stupid f@ck!",
                "Measles outbreaks = making America great Again.",
                "Anti vaccine folks, wake up to science."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Los Angeles-area residents crowdsource wildfire contamination data in battle with insurers",
            "external_url": "https://www.cbsnews.com/news/los-angeles-wildfires-insurance-smoke-damage-crowdsourcing/",
            "upvotes": 2029,
            "date": "04/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/28/b239007b-8ac6-44b1-8bae-cffc1feeb28b/thumbnail/1200x630/8308710326a932388223f628e983e4dd/matthew-craig-show-n-tell-clean.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "*Reports from other urban wildfires, in which building materials, appliances, cars and more burn at incredibly high temperatures, show increased levels of heavy metals including lead and polycyclic aromatic hydrocarbons (PAHs) such as benzene that are tied to negative health risks. But insurance companies haven't standardized testing for those contaminants.*\n\nAlso dioxins and furans from burning plastic. NYC was overwhelmed with all these toxins following 9/11, and the smoke itself took weeks to cease.",
                "It's a fricking outrage that insurance companies are denying smoke damage claims and forcing homeowners to scrape together their own testing data... like the Eaton Fire Residents United group is doing. This is a textbook example of corporate greed putting profits over people's health. Insurance policies need an overhaul, pronto.",
                "\"No help from FEMA...\". Of course, we get no help from FEMA. California is a blue state. Trump is such a vindictive prick he won't even help people that need it, because the state didn't vote for him.",
                "What the fuck is the point of paying for insurance if they're just going to deny you when you're in need?",
                "It is an issue that this is even necessary. The fact that this needs to happen just highlights the fundamental issue that insurance companies are not held to a reasonable standard and that they'll try the slimiest shit they can, relying on the damage one faces to isolate them and prevent them from fighting back. That is an issue that insurance companies have created in every sector they exist.",
                "They should base the awards based on zones not physical homes. We've been watching this unfold here in LA. You have houses with 100x the safe amount of lead, melted roof, and bubbled paint and insurance companies are offering prorated paint jobs based on the age of the house? I'd say pick another insurance company but we don't have many left here to even choose from",
                "Anyone that was in the city should basically assume they've lost ten years from their life expectancy; it would have been safer to attach an old garden hose to the tailpipe of an original Hummer and breath through that.",
                "Very poor here. If insurers have covered this as a payable event, then the claim needs to be paid. No two ways about it\n\nThe problem is next time. What insurer or reinsurer is going to want to cover property in LA from now on? The premiums will be far too expensive, so the state will have to cover it",
                "~Houses; what great investments.~\n\nPartially underground brick with sod-roofs is an actual residence that does the least amount of damage to the environment.\n\nMaking castles on sand that may or may not be covered by insurance is a poor choice of investment.\n\nEdit: don’t take this comment as “CaLiFoRnIa BaD”, I think about all the displaced people often, and it is difficult to know how they are doing because when I’ve looked all I could find were news articles about zoning and building permits.\n\nI think our society could be managed better overall, and I’ve posted before about perhaps rebuilding LA to be similar to the Jetsons. If this is outlandish, well every location/climate requires different infrastructure. A raised city might be a good thing in an area with easily persistent fire"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "SMART Rallies as Supreme Court Blocks Return of Deported Sheet Metal Worker",
            "external_url": "https://www.achrnews.com/articles/164441-smart-rallies-as-supreme-court-blocks-return-of-deported-sheet-metal-worker",
            "upvotes": 97,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Chief Justice Roberts, writing for the majority, focused heavily on what he termed \"improper venue shopping\" by the plaintiffs, suggesting they had sought out sympathetic courts to hear their case.\n\n\nHypocritical piece of shit.",
                "This is old news at this point, right? ",
                "Oh yes, where I get my most critical information from....air conditioning, heating, and refrigeration news. The Pulitzer of hard-hitting journalism. You know you can find better sources than this one?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Man killed in 1 of 4 Thursday night Montgomery shootings identified",
            "external_url": "https://www.wsfa.com/2025/03/14/man-killed-1-4-thursday-night-montgomery-shootings-identified/",
            "upvotes": 1954,
            "date": "04/12/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/ERU4UH35UBGMPH3OCPYC36VXOA.jpg?auth=1ab795b9a7d8adeb59ca62e8446e9f1ec84546a4a840944ebe7767f5b15e5d5a&width=1200&height=600&smart=true",
            "top_comments": [
                "Police are waiting for forensic results to see if he was killed in any of the other shootings.",
                "> At least five people were shot in the Capital City in a two-hour span, including Samuel Giles, 25, of Montgomery, who died from his injuries.\n\nI feel for the people. It has to be incredibly scary to have no answers, and to wonder if this is a pattern of shootings that will continue.",
                "Montgomery resident here. Or, I was as of a few months ago. Montgomery has a serious problem with gang violence, and our dear mayor refuses to acknowledge it. You probably remember him. Steven Reed made national headlines a few years back as the first black man elected Mayor of Montgomery, once the home of the Confederacy. What they *didn’t* tell you, is that he’s the son of one of Montgomery’s most corrupt politicians in recent times. As of late, it’s clear the Apple doesn’t fall far from the questionably sourced political donations. \n\nI have it on good authority that Reed wants to make a shot at Congress, and his blatant disregard for the growing violence in his city probably won’t help him.",
                "You're not supposed to be able to do that in a small town and guns prevent gun deaths in deep red Alabama.",
                "It's deeply unsettling to hear about this string of violent events, and it's particularly troubling to think that they might *not* be related, given the lack of identified motives, I hope authorities can quickly find answers, because honestly, it's hard to believe that so much tragedy can happen without any clear connection.",
                "Just another day in the land of the freedumb.",
                "It's genuinely heartbreaking to hear about this awful chain of incidents in Montgomery, and frankly, the city needs some serious support, it's just awful., and a focus on preventing this kind of violence so everyone can feel safe, because, really, it shouldn't happen.",
                "I drove through Montgomery and got a hotel room two years ago at a decent place while traveling to FL and the lady at the hotel said I am so thankful you stopped here and not the other exit. She said it’s dangerous. She was the sweetest. You don’t know what is bad or good in cities but I picked the best exit to stop for sure.",
                "At least he didn't die on a subway",
                "[deleted]"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Victor Perez Boy shot by police declared ‘clinically braindead’; candlelight vigil to be held before life support system unplugged",
            "external_url": "https://www.eastidahonews.com/2025/04/boy-shot-by-police-declared-clinically-braindead-candlelight-vigil-to-be-held-before-life-support-system-unplugged/",
            "upvotes": 13543,
            "date": "04/12/2025",
            "thumbnail": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/04/eErezhosptialedit.jpg",
            "top_comments": [
                "They sure are sparse with information about what occured.",
                "This includes video of the event up until the shooting. \n\n\nhttps://www.fox10phoenix.com/news/victor-perez-pocatello-idaho-shooting-go-fund-me",
                "And this, my friends, is why you NEVER, EVER, call the police to deescalate a situation involving a disabled person.",
                "Basically cops are trained that their lives should never be put in any jeopardy. The downside is that everyone will always be in jeopardy before the police.",
                "[Don't Call the Police](https://dontcallthepolice.com)",
                "Cops are not trained to deal with people who have disabilities or are autistic.  I used to work with adults who were autistic, we had a neighbor of the group home call the cops because someone was being loud. Cops came out, they kept on yelling at him to follow orders. They were about to shoot him until we came out, a case worker and myself. Had to intervene and tell the cops he couldn't understand them; he was autistic. They arrested him; later the sheriff's dept decided it was a brilliant idea to release him in the middle of the night. No vehicle. No phone for us to track his location. He had to walk next to the highway for hours in the rain until we found him sitting down beside a street drenched in rain. There needs to be accountability and retraining for their officers. This is beyond bs.",
                "They’ve got tasers and pepper spray. Why even carry those if your first solution is the pistol.",
                "Never point a cop at anything you don't intend to kill.",
                "State sponsored murder. Calling the police on a family member suffering from a mental health crisis is a terrifying thing to do.",
                "This is how police in 3rd world countries deal with someone armed with a knife. \n\nhttps://www.youtube.com/watch?v=j_s2rZR7IkQ\n\nWhy can't our police try something else besides shooting?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Luigi Mangione defense asks judge to block death penalty in CEO slay case",
            "external_url": "https://www.cnbc.com/2025/04/11/luigi-mangione-death-penalty-brian-thompson-case.html",
            "upvotes": 50415,
            "date": "04/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108105908-17401702152025-02-21t202801z_1440528033_rc27zcal85co_rtrmadp_0_unitedhealth-ceo.jpeg?v=1740170306&w=1920&h=1080",
            "top_comments": [
                "“The Attorney General's television appearance was similar to her first two public statements\nin that she never mentioned that Mr. Mangione was **not indicted** nor that he has the presumption of innocence. \n\nShe emphasized, for the third time, that her decision to seek the death penalty was based on the President's directive, specifically that the administration will seek the death sentence \"whenever possible.\" She then invoked her personal experience, saying that she was a capital prosecutor, who tried death penalty cases and that \"If there was ever a death case, this is one.\" **The Attorney General stated during her television appearance that a reason she ordered the death sentence was because the alleged victim was a CEO. Counsel is aware of no provision in the death penalty statute or in the Department of Justice's death penalty protocol that allows for consideration of the social, economic or professional status of an alleged homicide victim in determining whether to seek the death penalty.”**\n\nI encourage everyone to read the motion, it makes some strong points.",
                "I'd publicly ask for a pardon while I was at it. Just to get it on record.",
                "Why does he need a cop breathing down his neck in every shot lmao. They just get closer and closer every time I see him it's getting a bit intimate. By the time Luigi actually receives his sentence, half the precinct is going to be on his lap.",
                "This trial is gonna be a whole media spectacle. I wonder what the reaction from the oligarchs will be if the jury refuses to convict him.",
                "But Pammy doesn’t care about the husband and father they “accidentally sent” to a brutal prison in El Salvador and refuses to get him removed.",
                "I'm still wondering how hard jury selection will be for this. It's going to be difficult considering how many people have strong opinions about the healthcare industry.",
                ">Counsel is aware of **no** provision in the death\npenalty statute or in the Department of Justice’s death penalty protocol that allows for\n**consideration of the social, economic or professional status of an alleged homicide victim in determining whether to seek the death penalty.**\n\n>Rather than relying on these reasons, **the Attorney General cited the professional status of\nthe victim as a CEO**, the fact that the previous administration had not sought the death penalty in\nfour years and that her decision to order it here was due to the **president’s policy to “Make America Safe Again.” **Also, if the death penalty was being ordered pursuant to policy instead of publicity, the** Attorney General would not have put her directive in the form of a press release followed by an Instagram post that effectively launched a new government social media account.**\n\nSome excellent points by his attorneys.",
                "When are they going to go after the people that killed the Boeing Whistleblowers?",
                "Absolutely crazy that from the start he’s been treated as guilty. What happened to due process?",
                "Didn't Trump already pardon him when he said, \"if it's good for the country, it's not illegal\"?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Judge rules Mahmoud Khalil can be deported",
            "external_url": "https://www.npr.org/2025/04/11/nx-s1-5361208/mahmoud-khalil-deported-judge-rubio-antisemitism-immigration-court",
            "upvotes": 9200,
            "date": "04/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5760x3240+0+300/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb2%2F1f%2Fc66ce9ff42329e8acf27219cc5f7%2Fap25086587454957.jpg",
            "top_comments": [
                ">Khalil, who has a green card, is a lawful permanent resident. In ordering Khalil's deportation, Rubio relied on a rarely used federal statute from the 1950s that played a major role in shaping American immigration during the Cold War. The McCarran-Walter Act, or the Immigration Nationality Act of 1952, gives the secretary of state authority to decide that a noncitizen's presence in the United States threatens the country's foreign policy goals.\n\nJust what are America's foreign policy goals?",
                "ICE is moving people to states with friendly judges for kangaroo like courts",
                "If lawful permanent residents can be deported for exercising their first amendment rights, don't fool yourself, citizens can be next.",
                "The depressing thing is that \"deported\" now can mean sent back to your country of origin or locked up for life in a Salvadoran black site with no hope of anyone ever seeing you alive again.\n\nEdit: I still can't believe our media has played along with that abuse of language. It's not \"deporting\" someone to imprison them for life without trial in a foreign country.",
                "During the Red Scare the United States exiled such brilliant minds as native US citizen Frank Malina, one of the founders of CalTech’s Jet Propulsion Laboratory, for having ties to Communism. \n\nWe’re doing it again. ",
                "Congratulations, the first amendment and due process no longer matter in America. This is truly unbelievable that a judge would allow the SoS to violate someone’s constitutional rights so blatantly.",
                "“Criminal” migrants\n\n“Illegal” migrants\n\nPermanent residents  <- We are here\n\nNaturalized citizens\n\n“Criminal” citizens\n\n“Dissenting” citizens\n\nDemocrats\n\nAnyone who opposes Trump\n\nIf you think this isn’t the natural progression, wake the fuck up. This has happened before more than once throughout history.",
                "This is an immigration judge.  There is also a case in federal court.",
                "Louisiana judge.  They moved him there to avoid NE judges.  \n\nThis is why they grab people off the street and fly them to LA.",
                "Pretty soon nobody is gonna be allowed to hurt Israel's precious feelings without getting a boot on their neck."
            ],
            "aggregate_sentiment": 12.0
        }
    ],
    "last_updated": "04/13/2025 12:14:16 UTC"
}