{
    "posts": [
        {
            "category": "HOT",
            "title": "George Foreman: Heavyweight boxing legend dies aged 76, says family",
            "external_url": "https://www.bbc.com/news/articles/ckg8ez8201yo",
            "upvotes": 20377,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/05d5/live/82e5e820-06c3-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "R.I.P. George\n\n>George Foreman named all of his five sons \"George Edward Foreman\" as a way to create a sense of unity and shared identity within the family.\n\nThat is going to be one confusing obituary!",
                "[deleted]",
                "RIP legend. Crazy how I wasn’t even into boxing as a kid but still grew up knowing who he was.",
                "Our thoughts are with the George Foremans at this time. ",
                "That grill was so clutch in my college days",
                "That's the last of the golden era heavyweights, right? End of an era.",
                "Still set to fight Jake Paul next month.",
                "Shit. Gotta pull out my old Forman grill and sear up a chicken breast in his memory.",
                "“When we were Kings” is so good if u haven’t seen it.",
                "\"Down goes Frazier! Down goes Frazier! Down goes Frazier!\"\n\nHe won the heavyweight title in 1974 and then again in 1994."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "FBI Employees Reviewing Jeffrey Epstein Files Told to Limit Redactions",
            "external_url": "https://www.wsj.com/us-news/law/doj-jeffrey-epstein-documents-7da298dc",
            "upvotes": 675,
            "date": "03/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Only redact the victims, do not redact the perpetrators.",
                "\"Just make sure they get the ones involving person of interest number 1.\"",
                "The only thing redacted should be the names of the victims. Fuck all the pedos, enablers, and other scum that were associated with Epstein and Maxwell. And yes that means the Clinton’s as well as Trump and all his buddies.",
                "Limit them to what, those inside the current admin?",
                "Yup.  Just need to limit all redactions to removing all references to the word \"Trump.\"  Easy peasy!",
                "Damn so they are going to take out all the pages on trump? Whod guess?",
                "Time to find out he didn’t kill himself",
                "Here's hoping it's the same people that were redacting the JFK files that failed miserably in that task.",
                "why is revealing the list be “national security concerning” it’s not like it’s nuclear bomb manuals?",
                "I think there's gonna be a huge meltdown on the internet when the ultimate conclusion in the files is \"we have no reason, beyond nebulous allegations of motive, to think any third party was involved in his death.\" No one online is gonna buy that, regardless of if it was written by an earnest investigator or not.\n\nBasically, I think everyone is about to feel a serious case of angry blue balls."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "A troubling trend? 4 former and current HCSO deputies take their own lives in last 6 weeks",
            "external_url": "https://abc13.com/post/4-former-current-harris-county-sheriffs-office-deputies-take-own-lives-last-6-weeks/16060117/",
            "upvotes": 4110,
            "date": "03/22/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16060176_032025-ktrk-hcso-deputies-img.png?w=1600",
            "top_comments": [
                "Curious what’s going on in this department considering many of its officers have been involved with investigations against them for corruption and organized criminal activity within the last year or so.\n\nhttps://www.fox26houston.com/news/harding-street-raid-charges-dismissed-8-houston-police-officers.amp\n\nhttps://abc13.com/amp/houston-chronicle-unchecked-forces-harris-county-constables-accountability/14603562/",
                "Something nasty went down",
                "This stinks to high heaven. Those deaths need to be investigated by someone outside that community",
                "LA county Sheriff's 2 years ago. 4 suicides within 24. hours.https://www.google.com/amp/s/abc7.com/amp/los-angeles-county-sheriffs-department-suicide-deaths-lasd-employees/14036429/",
                "So who is investigating these \"suicides\"? it sure shouldn't be the same office where they are working.",
                "“Well, the official findings are that it definitely wasn’t one of us,”’ said an HCSO spokesperson. “Not sure we’ll ever know who did it. But we can say with certainty, none of us was involved.”",
                "#Tragic Toll: Four Harris County Officers Take Their Own Lives in Just Six Weeks\n\nQuiet grief has settled over Harris County as the community reels from the shocking loss of four current and former deputies, each taking their own life in the space of just six weeks. The most recent was Deputy Christina Kohler, a well-respected veteran whose death last week was officially ruled a suicide. She was just 37.\n\nKohler had been reported missing, sparking concern across the force. A public alert was issued and the search began. Days later, on 13 March, her body was found. The news stunned friends and colleagues. Just three days after Kohler's death, former deputy Maria Vasquez, who left the sheriff's office in December, also died by apparent suicide. Then, earlier this week, another former deputy, William Bozeman, was found dead. The pattern is as heartbreaking as it is alarming.\n\n“It caught a lot of us by surprise,” said Jose Lopez, president of the Harris County Deputies' Organisation. “One is too many. Two? Three? Yes, it's devastating.”\n\nLopez, who had known two of the fallen deputies for over twenty years, has been helping colleagues come to terms with the grief. He’s also grappling with the death of former deputy Long Nguyen, who took his own life in early February at the age of 58. For Lopez, the pain is personal. For the department, it’s a wake-up call.\n\nThere is growing concern about the toll this profession takes on those who serve. Policing is a job that deals daily with trauma, danger and confrontation. It can grind away at a person’s mental health until there is very little left to give. Dr Thomas McNeese, who heads up the Sheriff's Office Behavioural Health Division, is all too aware of the emotional weight deputies carry. His team offers peer-to-peer support and has been working since 2020 to provide help, but even he admits the past few weeks have been especially hard.\n\n“This profession takes a toll,” said McNeese. “The longer you're in it, the more it changes you.”\n\nLaw enforcement officers have long been known to suffer disproportionately from mental health issues and suicide. The nature of the work, the things they witness, the pressure to remain composed in the face of chaos, it all builds up. McNeese is urging those who are struggling to reach out, to talk, to act.\n\n“Getting help, doing something to not stay stuck, that’s important,” he said.\n\nInside the department, questions are being asked. Despite the resources already in place, Lopez wonders if it is enough. Is there more they could be doing? Is something being missed?\n\n“We can’t help but ask,” he said. “Do we need to take a different approach?”",
                "Did they all fall out of a huge window together?",
                "Harris County (Texas) Sheriff's Office, for those too lazy, but still curious.",
                "I want to say someone is covering their tracks, the guilty are taking the easy way out before the hammer falls or a little bit of both.\n\nOn the other hand, suicide is often contagious."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "OCDSB seeking court order in bid to unmask anonymous “Redditor”",
            "external_url": "https://www.cbc.ca/news/canada/ottawa/ocdsb-seeking-court-order-in-bid-to-unmask-anonymous-redditor-1.7489101",
            "upvotes": 1584,
            "date": "03/22/2025",
            "thumbnail": "https://i.cbc.ca/1.7141767.1710274888!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_1180/reddit-ipo.JPG?im=Resize%3D620",
            "top_comments": [
                "From The CBC:\n\n>The Ottawa-Carleton District School Board (OCDSB) is locked in a court battle to compel social media site Reddit to turn over identifying information of a user who it alleges has been defaming staff at a local elementary school.\n\n>The board alleges the posts about ongoing issues at Pinecrest Public School were made in an attempt to defame employees “for some unknown ulterior motive.” None of the allegations have been proven in court.\n\n>The board wants Reddit to provide any email addresses, phone numbers, location data and other identifying information about the user. In a statement, it said it was compelled by its “unwavering dedication to creating a positive and supportive environment for all members of the OCDSB community.”\n\n>Reddit argues handing over the information will create a chill among other users, explaining in its court filings that “anonymity is not just a user preference but a defining feature of Reddit’s business model and identity.”\n\n>Most of the comments in question were in response to discussions around news stories about the board and problems at specific schools. Several involved specific incidents and ongoing issues at Pinecrest Public School that have been reported in the media.\n\n>Some of the comments singled out the school’s principal and a superintendent, the board said in its court filings. Reddit’s court filings mention 51 comments by the user in 17 different conversations. \n\n>User alleged OCDSB failed to report violence, racism. According to the OCDSB, the “false and defamatory” comments began on Dec. 17, 2022. Naming individual staff members, the user accused them of failing to report incidents, stifling investigations and ignoring instances of racism.\n\n>According to the board, the comments were dishonest, disrespectful and created a toxic work environment. The anonymous user also insinuated that staff members had “acquiesced in the perpetration of racist acts at the school,” the board said.\n\n>During a lengthy Reddit thread about a high school [student who died after being stabbed in Nepean](https://www.cbc.ca/news/canada/ottawa/high-school-student-stabbed-last-week-in-nepean-dies-1.7194798) last May, the user accused an OCDSB superintendent of ignoring safety concerns in the district. In a response to another user, the individual being sought by the board described themselves as a teacher. \n\n>The board said it’s considering a defamation lawsuit against the person responsible for posting the comments. But Reddit denies OCDSB’s claim that the information is “necessary for it to determine whether to pursue a potential claim for defamation.”\n\n>OCDSB ‘vigorously defending’ employees. In response to CBC’s request for comment, OCDSB communications manager Diane Pernari said the board is committed to “vigorously defending our employees against unfounded attacks and upholding our legal and ethical obligations.”\n\n>She wrote the legal action underscores the board’s “unwavering dedication to creating a positive and supportive environment for all members of the OCDSB community.” Known as a Norwich Order, the board’s application seeks to compel a third party to provide information about alleged wrongdoing, even if the third party isn’t directly involved in the wrongdoing.\n\n>Reddit did not respond to a request for comment. Lawyers for both parties are expected to have another court date later this year. \n\n>Court to consider free speech, defamation. Ottawa-based lawyer Karin Page said the school board will have to demonstrate the user’s comments were defamatory, rather than just critical of its policies. \n\n>Page said the court will need to balance the public interest in protecting anonymous speech against the board’s need to defend itself against alleged defamation. “There’s a difference between someone just voicing their opposition to a policy or ... to the government, or to disclosing their own personal situations,” she said. “There’s a distinction between that and making defamatory statements online.”\n\n>She added the fact the comments named or identified specific individuals is concerning, as it makes it difficult for those people to defend themselves.",
                "I feel like this action by the school officials has made the \"defamatory\" comments much more widely known.\n\nAlso trying to \"unmask\" and sue a commenter on reddit makes them look even worse, somehow.",
                "This lawsuit is a joke and an example of how school boards attract some seriously ignorant people.",
                "The OCDSB certainly could defend themselves against false allegation, it doesn't take the posters identity to do it, that's a pig that wants revenge. What's worse, bad mouthing the system, or trying to identify your detractors for revenge?",
                "Sounds like they deserve all the criticism they get.",
                "This is a big test for Reddit if they will cave-in with the authoritarian school district board in Canada.\n\nGiving away user information will have bigger implication for this community. \n\nClearly, it was not defamation. OCDSB is a bully school board who doesn't care about their teachers and students.",
                "If Reddit caves to a school board what will they do when the Trump administration demands the same thing?",
                "I feel like they would be better off using the money paying court costs on solving the issue the redditor is being critical of. If there wasn't anything that warranted complaining about, the issue wouldn't have come up.\n\nAside from that tangent, I do hope reddit keeps that user anonymous. Maybe ban the user if it is determined a defamation case against them would succeed beyond reasonable doubt. Reddit giving up information to a smaller non-us court would almost certainly set a precedent of giving up any info requested by a larger government that is being overrun by Nazis. And that spooks me because that could be used for any number of things. \n\nSure, I could be worried about a slippery slope, but given it hasn't even been 2 months with Trump in office, I would like to avoid the risk over the next... 3.5 years...",
                "That’s a pretty soft reason to hand over data.",
                "Of course it’s pinecrest lmao, that school is a shit hole."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "U.S. to revoke legal status of more than a half-million migrants, urges them to self deport",
            "external_url": "https://www.cbsnews.com/news/u-s-to-revoke-legal-status-of-over-a-half-million-migrants-chnv/",
            "upvotes": 15775,
            "date": "03/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/21/f77a5737-9f4d-4bf8-8759-61e97e11ba39/thumbnail/1200x630/732b2e545fbc7cfb3cc1d7a3177155cc/gettyimages-2206282830.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "Let’s start with Elon Musk.",
                "I feel obliged to point out that Elon Musk and Melanie both worked illegally in the US and on that basis should also be deported. They are deporting folks for that offense, even many years on.",
                "\"We don't mind the ones who do it legally\"",
                "They are so shit at deporting illegal immigrants that they go to legal ones",
                "He is doing this to up the deportation numbers.  He has run out of undocumented folks.  So now he has to create some new ones by snatching documents away.\n\nThese folks have jobs.  They are paying rent and mortgages. They have started their own businesses.  They are paying taxes.  They have revitalized communities.  They are decent people just trying to live a better life here.  \n\nTrump wants to throw these people out but let white South Africans in.  The racism couldn't be any more overt.",
                "The insane thing about CHNV is that it's how most people think lawful immigration should or does work.\n\nYou needed to apply before you were in the United States, undergo a background check, and have a sponsor that will provide for your housing and care. Most people approved for CHNV aren't eligible for public assistance, either.",
                "But I thought they just hated the people here illegally? They kept saying that they were cool with immigrants as long as they do it legally. Were they just lying to mask their racism? Naw...",
                "Is Melania on that list 🤔🤔🤔🤔",
                "An article the other day noted that most of Trump’s immigration policy is currently targeting those who are here legally, but on “borrowed time” due to asylum seeking or refugee status. That is a rapid way to get numbers. The numbers from that policy, and the videos of illegal immigrants being treated inhumanly feeds his sociopath base.\n\nIt should be noted, a lot of posts have been saying, “Is this what you voted for!?” In regards to Cubans seeing Cubans being deported and such. You need to understand: This IS exactly what they voted for. Legal immigrants do not give a shit about their brethren who are not legal. All they see are “illegals” being kicked out of THEIR country that they “earned”. The fact that most MAGA folks would gladly see these same “legal” immigrants kicked out of THEIR country does not even register: Everyone thinks they are one of the “good ones” when it comes to hating immigrants.",
                "Can’t wait for more of those “my wife was here legally, got deported to Latin America, but I don’t regret my vote for Trump” videos."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Tesla trade-ins surge to record high",
            "external_url": "https://www.nwaonline.com/news/2025/mar/22/tesla-trade-ins-surge-to-record-high/?business-national",
            "upvotes": 285,
            "date": "03/22/2025",
            "thumbnail": "https://wehco.media.clients.ellingtoncms.com/imports/adg/photos/209696036_tesla-trade-in_IZYQDOMEA2SXZBCR6DJE7GDWVY_t1200.jpg?57a0c2296240c280e9492005c3cad63e7cbe80f4",
            "top_comments": [
                "Honestly, it wouldn't have been this bad had he not made those Nazi salutes at the inauguration. Were those few seconds of fame really worth it Elon? But I guess it was inevitable with someone like him.",
                "I’m sure Phony Stark will find a way to blame this on trans people",
                "Mustang Mach-E all the way!",
                "Time to trick the conservatives to go green buying all the teslas to “own the libs”",
                "Good luck selling new models now, Elmo.",
                "I’m surprised they’re taking them as trade. Seems like a losing proposition.",
                "The Tesla brand is damaged beyond repair",
                "I heard Polestar is a better car. Is this true?",
                "The lack of quality, quality control, safety, and all the less than stellar things Musk has been up to recently, I'm not really surprised. Tesla's went from over hyped and overpriced to overpriced, over hyped and dangerous.",
                "Last year there was a lot of talk about Musk becoming the first trillionaire in a few years, and now he's on the way to losing his title of richest person in the world. Dude has really damaged Tesla with his behavior."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "US to import eggs from Turkey and South Korea to ease prices",
            "external_url": "https://www.bbc.com/news/articles/c743g135vj9o",
            "upvotes": 4861,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2eb2/live/7b390f80-069b-11f0-ab19-cd63e1c90c04.jpg",
            "top_comments": [
                "That’s pretty ridiculous considering that Mexico is right next door and has absolutely no issue with any egg shortage whatsoever?",
                "By the time it gets to market here they need to rename them century eggs",
                "[removed]",
                "Because nothing does more to make something cheaper than flying it half way around the world.",
                "Shipping them halfway around the world is sure to save money",
                "No word on HOW this will help prices. But who cares it makes a nice headline. \n\n  \nOh and $400 million for farmer relief? Glad we DOGE'd all those socialist programs and cut off the entitled folks!",
                "Hehehe imagine if Americans get turkey eggs instead of eggs\n*from* Turkey because Trump can't read",
                "These eggs better not be brown eggs or they're going straight to Guantanamo Bay.",
                "worldwide logistics are good but theres no way importing eggs from halfway around the world would ever make sense",
                "I highly doubt the costs associated with importing eggs from that far away could possibly bring a dozen under $10. If only we weren’t destroying our relationships with our neighbors and closest trading partners."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Tate brothers say they have left US to return to Romania",
            "external_url": "https://www.bbc.com/news/articles/cvgw0w7147vo",
            "upvotes": 17493,
            "date": "03/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b815/live/88e93ad0-06bc-11f0-88b7-5556e7b55c5e.jpg",
            "top_comments": [
                "selfies w/ pizza box or it never happened",
                ">\"Innocent men don't run. They clear their name in court.\"\n\nThis guy literally fled to Romania to escape rape charges in the uk.\n\nWhat a fucking dog dong.",
                "And nothing of value was lost. Fuck these twats",
                "They're going back for their court appearance, which was part of the agreement to relax their travel restrictions. That said, I was half-expecting Trump to harbour them.",
                "If I never heard about the Tate brothers again it would make my life better",
                "The only place they should be going is prison. They should never have been allowed to travel here in the first place. Edit: it's also disgusting this dude still has ten MILLION Twitter followers.",
                "Remember, trump wasted time rallying to free these rapists. Time he was supposed to be spending serving the American people. Instead he was fighting for rapists.",
                "Bring back oubliettes.",
                "[removed]",
                "He seems to really take interest in Romania. Wonder if its the secret location of his missing chin."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Nasa drops plan to land first woman and first person of color on the moon",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/21/nasa-drops-plan-first-woman-moon",
            "upvotes": 1472,
            "date": "03/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/aac07bc3d883357f77e67ceb6bb53fc3c2f780a4/0_0_5000_3001/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b698ce2e793d534258c22be90188bb91",
            "top_comments": [
                "How about djt and JD become the first us president/VP to be sent to the moon?",
                "China has the opportunity to do the funniest thing here\n\n'For All Mankind' style",
                "I’m going to be honest, I don’t think they should have said that in first place. There are more than enough highly qualified women and people of color that they could have just picked and most people wouldn’t bat an eye. Explicitly stating before selecting the astronauts that they were going to choose a woman and POC leaves the wrong impression and is exactly the sort of thing that turns people off DEI.",
                "This is a poorly worded and a clickbait title. NASA did not drop the plan— they adjusted the verbiage on their website. Victor Glover and Christina Koch are still on the mission, per the last paragraph of the article. I think it is stupid to adjust the website verbiage, but it is also important to call out yellow journalism.",
                "Well since we’re joining the British Commonwealth apparently, I assume the next person on the moon will no doubt be British.",
                "....so a literal DEI moon landing? Holy shit, this timeline's hilarious!",
                "It's good to be black on the moon... One of my favourite quotes from Space Force.",
                "Let's be real, nobody is going back to the moon. Everyone will be busy spending money killing each other. 🚀",
                "Is this the extent of our space goals? Get every identity group we can to the moon?",
                "Why does their race have to be important. I’m sick of this race baiting crap. Can we go back to the 90s when it was woke to be colour blind."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Musk group offers $100 to Wisconsin voters ahead of pivotal state Supreme Court election",
            "external_url": "https://www.cnbc.com/2025/03/21/musk-group-offers-100-to-wisconsin-voters-ahead-of-pivotal-state-supreme-court-election.html",
            "upvotes": 32501,
            "date": "03/21/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108057782-1730819740490-gettyimages-2182402967-AFP_36LH6F6.jpeg?v=1730819836&w=1920&h=1080",
            "top_comments": [
                "$100 dollars in exchange for your freedom, great deal",
                "George Soros should do the exact same thing so this practice will get banned in one nanosecond.",
                "So he's offering bribes....which is illegal.",
                "Imagine if Democrats paid for votes.\n\nIt would be the end of the world with the MAGA cult. \n\nNone stop 24/7 news coverage of the end of the republic. \n\nBut when Trump and crew do it, perfectly fine.",
                "I would ask how any of this is legal, but apparently everything is legal if no one challenges you on it. He did this during the general election and got away with zero consequences. And got his guy elected. And now that they’re talking about deporting protesters, I don’t know what the fuck we’re supposed to do.",
                "Elon musk is a domestic terrorist",
                "The fact he needs to pay people for their vote suggests that the candidate he supports has no other positive qualifications and cannot win an election based on their merits.",
                "So it sounds like they're paying folks $100 to sign a petition about the upcoming election, which I'm assuming (cynically) is their way of tricking people into voting the way they want.  \n\nReminds me of that time Michael Moore put out an offer to college students that he'd buy them a clean pair of underwear if they registered to vote.  Didn't tell them how to vote, just to register.  And of course the justice system jumped on that with both feet.  Musk is going to get away with this, of course.",
                "He's such a moron. Gets all teary eyed and wondering why so many people hate him, and then he keeps doing stuff like this.\n\nZero sympathy for him.",
                "Want to do something about it and make your voice heard?\n\nCALL THE WISCONSIN ELECTIONS COMMISSION\n\n608 266 8005\n\nDemand an investigation into this and explain how disgusted you are!"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "‘Deported because of his tattoos’: has the US targeted Venezuelans for their body art? | US immigration",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/20/deported-because-of-his-tattoos-has-the-us-targeted-venezuelans-for-their-body-art",
            "upvotes": 3,
            "date": "03/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/5d0e38da975443f6f030bca9e5440fa039f4dcbe/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=62d75be9bee04789ff3ebe8d7c270948",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Tesla trade-ins surge to record high",
            "external_url": "https://www.nwaonline.com/news/2025/mar/22/tesla-trade-ins-surge-to-record-high/?business-national",
            "upvotes": 303,
            "date": "03/22/2025",
            "thumbnail": "https://wehco.media.clients.ellingtoncms.com/imports/adg/photos/209696036_tesla-trade-in_IZYQDOMEA2SXZBCR6DJE7GDWVY_t1200.jpg?57a0c2296240c280e9492005c3cad63e7cbe80f4",
            "top_comments": [
                "Honestly, it wouldn't have been this bad had he not made those Nazi salutes at the inauguration. Were those few seconds of fame really worth it Elon? But I guess it was inevitable with someone like him.",
                "I’m sure Phony Stark will find a way to blame this on trans people",
                "Mustang Mach-E all the way!",
                "Time to trick the conservatives to go green buying all the teslas to “own the libs”",
                "Good luck selling new models now, Elmo.",
                "I’m surprised they’re taking them as trade. Seems like a losing proposition.",
                "The Tesla brand is damaged beyond repair",
                "I heard Polestar is a better car. Is this true?",
                "The lack of quality, quality control, safety, and all the less than stellar things Musk has been up to recently, I'm not really surprised. Tesla's went from over hyped and overpriced to overpriced, over hyped and dangerous.",
                "Last year there was a lot of talk about Musk becoming the first trillionaire in a few years, and now he's on the way to losing his title of richest person in the world. Dude has really damaged Tesla with his behavior."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "FBI Employees Reviewing Jeffrey Epstein Files Told to Limit Redactions",
            "external_url": "https://www.wsj.com/us-news/law/doj-jeffrey-epstein-documents-7da298dc",
            "upvotes": 664,
            "date": "03/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Only redact the victims, do not redact the perpetrators.",
                "\"Just make sure they get the ones involving person of interest number 1.\"",
                "The only thing redacted should be the names of the victims. Fuck all the pedos, enablers, and other scum that were associated with Epstein and Maxwell. And yes that means the Clinton’s as well as Trump and all his buddies.",
                "Limit them to what, those inside the current admin?",
                "Yup.  Just need to limit all redactions to removing all references to the word \"Trump.\"  Easy peasy!",
                "Damn so they are going to take out all the pages on trump? Whod guess?",
                "Time to find out he didn’t kill himself",
                "Here's hoping it's the same people that were redacting the JFK files that failed miserably in that task.",
                "why is revealing the list be “national security concerning” it’s not like it’s nuclear bomb manuals?",
                "I think there's gonna be a huge meltdown on the internet when the ultimate conclusion in the files is \"we have no reason, beyond nebulous allegations of motive, to think any third party was involved in his death.\" No one online is gonna buy that, regardless of if it was written by an earnest investigator or not.\n\nBasically, I think everyone is about to feel a serious case of angry blue balls."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Pope Francis set to make his first appearance in five weeks, Vatican says",
            "external_url": "https://www.abc.net.au/news/2025-03-22/pope-francis-set-to-make-first-appearance-vatican-says/105085040",
            "upvotes": 282,
            "date": "03/22/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/10cbbeef57959dcc4580e7a5475bcc53?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=32&width=862&height=485&imformat=generic",
            "top_comments": [
                "If he sees his shadow it’s five more weeks of winter.",
                "If he looks a little like Brendan Frasier, it's just because he's been sick and you haven't seen him in a while. No need to worry.",
                "Has this guy always been so fat? I thought gluttony was a sin.",
                "Nobody cares. Fuck the pope"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "OCDSB seeking court order in bid to unmask anonymous “Redditor”",
            "external_url": "https://www.cbc.ca/news/canada/ottawa/ocdsb-seeking-court-order-in-bid-to-unmask-anonymous-redditor-1.7489101",
            "upvotes": 1589,
            "date": "03/22/2025",
            "thumbnail": "https://i.cbc.ca/1.7141767.1710274888!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_1180/reddit-ipo.JPG?im=Resize%3D620",
            "top_comments": [
                "From The CBC:\n\n>The Ottawa-Carleton District School Board (OCDSB) is locked in a court battle to compel social media site Reddit to turn over identifying information of a user who it alleges has been defaming staff at a local elementary school.\n\n>The board alleges the posts about ongoing issues at Pinecrest Public School were made in an attempt to defame employees “for some unknown ulterior motive.” None of the allegations have been proven in court.\n\n>The board wants Reddit to provide any email addresses, phone numbers, location data and other identifying information about the user. In a statement, it said it was compelled by its “unwavering dedication to creating a positive and supportive environment for all members of the OCDSB community.”\n\n>Reddit argues handing over the information will create a chill among other users, explaining in its court filings that “anonymity is not just a user preference but a defining feature of Reddit’s business model and identity.”\n\n>Most of the comments in question were in response to discussions around news stories about the board and problems at specific schools. Several involved specific incidents and ongoing issues at Pinecrest Public School that have been reported in the media.\n\n>Some of the comments singled out the school’s principal and a superintendent, the board said in its court filings. Reddit’s court filings mention 51 comments by the user in 17 different conversations. \n\n>User alleged OCDSB failed to report violence, racism. According to the OCDSB, the “false and defamatory” comments began on Dec. 17, 2022. Naming individual staff members, the user accused them of failing to report incidents, stifling investigations and ignoring instances of racism.\n\n>According to the board, the comments were dishonest, disrespectful and created a toxic work environment. The anonymous user also insinuated that staff members had “acquiesced in the perpetration of racist acts at the school,” the board said.\n\n>During a lengthy Reddit thread about a high school [student who died after being stabbed in Nepean](https://www.cbc.ca/news/canada/ottawa/high-school-student-stabbed-last-week-in-nepean-dies-1.7194798) last May, the user accused an OCDSB superintendent of ignoring safety concerns in the district. In a response to another user, the individual being sought by the board described themselves as a teacher. \n\n>The board said it’s considering a defamation lawsuit against the person responsible for posting the comments. But Reddit denies OCDSB’s claim that the information is “necessary for it to determine whether to pursue a potential claim for defamation.”\n\n>OCDSB ‘vigorously defending’ employees. In response to CBC’s request for comment, OCDSB communications manager Diane Pernari said the board is committed to “vigorously defending our employees against unfounded attacks and upholding our legal and ethical obligations.”\n\n>She wrote the legal action underscores the board’s “unwavering dedication to creating a positive and supportive environment for all members of the OCDSB community.” Known as a Norwich Order, the board’s application seeks to compel a third party to provide information about alleged wrongdoing, even if the third party isn’t directly involved in the wrongdoing.\n\n>Reddit did not respond to a request for comment. Lawyers for both parties are expected to have another court date later this year. \n\n>Court to consider free speech, defamation. Ottawa-based lawyer Karin Page said the school board will have to demonstrate the user’s comments were defamatory, rather than just critical of its policies. \n\n>Page said the court will need to balance the public interest in protecting anonymous speech against the board’s need to defend itself against alleged defamation. “There’s a difference between someone just voicing their opposition to a policy or ... to the government, or to disclosing their own personal situations,” she said. “There’s a distinction between that and making defamatory statements online.”\n\n>She added the fact the comments named or identified specific individuals is concerning, as it makes it difficult for those people to defend themselves.",
                "I feel like this action by the school officials has made the \"defamatory\" comments much more widely known.\n\nAlso trying to \"unmask\" and sue a commenter on reddit makes them look even worse, somehow.",
                "This lawsuit is a joke and an example of how school boards attract some seriously ignorant people.",
                "The OCDSB certainly could defend themselves against false allegation, it doesn't take the posters identity to do it, that's a pig that wants revenge. What's worse, bad mouthing the system, or trying to identify your detractors for revenge?",
                "Sounds like they deserve all the criticism they get.",
                "This is a big test for Reddit if they will cave-in with the authoritarian school district board in Canada.\n\nGiving away user information will have bigger implication for this community. \n\nClearly, it was not defamation. OCDSB is a bully school board who doesn't care about their teachers and students.",
                "If Reddit caves to a school board what will they do when the Trump administration demands the same thing?",
                "I feel like they would be better off using the money paying court costs on solving the issue the redditor is being critical of. If there wasn't anything that warranted complaining about, the issue wouldn't have come up.\n\nAside from that tangent, I do hope reddit keeps that user anonymous. Maybe ban the user if it is determined a defamation case against them would succeed beyond reasonable doubt. Reddit giving up information to a smaller non-us court would almost certainly set a precedent of giving up any info requested by a larger government that is being overrun by Nazis. And that spooks me because that could be used for any number of things. \n\nSure, I could be worried about a slippery slope, but given it hasn't even been 2 months with Trump in office, I would like to avoid the risk over the next... 3.5 years...",
                "That’s a pretty soft reason to hand over data.",
                "Of course it’s pinecrest lmao, that school is a shit hole."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "A troubling trend? 4 former and current HCSO deputies take their own lives in last 6 weeks",
            "external_url": "https://abc13.com/post/4-former-current-harris-county-sheriffs-office-deputies-take-own-lives-last-6-weeks/16060117/",
            "upvotes": 4111,
            "date": "03/22/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16060176_032025-ktrk-hcso-deputies-img.png?w=1600",
            "top_comments": [
                "Curious what’s going on in this department considering many of its officers have been involved with investigations against them for corruption and organized criminal activity within the last year or so.\n\nhttps://www.fox26houston.com/news/harding-street-raid-charges-dismissed-8-houston-police-officers.amp\n\nhttps://abc13.com/amp/houston-chronicle-unchecked-forces-harris-county-constables-accountability/14603562/",
                "Something nasty went down",
                "This stinks to high heaven. Those deaths need to be investigated by someone outside that community",
                "LA county Sheriff's 2 years ago. 4 suicides within 24. hours.https://www.google.com/amp/s/abc7.com/amp/los-angeles-county-sheriffs-department-suicide-deaths-lasd-employees/14036429/",
                "So who is investigating these \"suicides\"? it sure shouldn't be the same office where they are working.",
                "“Well, the official findings are that it definitely wasn’t one of us,”’ said an HCSO spokesperson. “Not sure we’ll ever know who did it. But we can say with certainty, none of us was involved.”",
                "#Tragic Toll: Four Harris County Officers Take Their Own Lives in Just Six Weeks\n\nQuiet grief has settled over Harris County as the community reels from the shocking loss of four current and former deputies, each taking their own life in the space of just six weeks. The most recent was Deputy Christina Kohler, a well-respected veteran whose death last week was officially ruled a suicide. She was just 37.\n\nKohler had been reported missing, sparking concern across the force. A public alert was issued and the search began. Days later, on 13 March, her body was found. The news stunned friends and colleagues. Just three days after Kohler's death, former deputy Maria Vasquez, who left the sheriff's office in December, also died by apparent suicide. Then, earlier this week, another former deputy, William Bozeman, was found dead. The pattern is as heartbreaking as it is alarming.\n\n“It caught a lot of us by surprise,” said Jose Lopez, president of the Harris County Deputies' Organisation. “One is too many. Two? Three? Yes, it's devastating.”\n\nLopez, who had known two of the fallen deputies for over twenty years, has been helping colleagues come to terms with the grief. He’s also grappling with the death of former deputy Long Nguyen, who took his own life in early February at the age of 58. For Lopez, the pain is personal. For the department, it’s a wake-up call.\n\nThere is growing concern about the toll this profession takes on those who serve. Policing is a job that deals daily with trauma, danger and confrontation. It can grind away at a person’s mental health until there is very little left to give. Dr Thomas McNeese, who heads up the Sheriff's Office Behavioural Health Division, is all too aware of the emotional weight deputies carry. His team offers peer-to-peer support and has been working since 2020 to provide help, but even he admits the past few weeks have been especially hard.\n\n“This profession takes a toll,” said McNeese. “The longer you're in it, the more it changes you.”\n\nLaw enforcement officers have long been known to suffer disproportionately from mental health issues and suicide. The nature of the work, the things they witness, the pressure to remain composed in the face of chaos, it all builds up. McNeese is urging those who are struggling to reach out, to talk, to act.\n\n“Getting help, doing something to not stay stuck, that’s important,” he said.\n\nInside the department, questions are being asked. Despite the resources already in place, Lopez wonders if it is enough. Is there more they could be doing? Is something being missed?\n\n“We can’t help but ask,” he said. “Do we need to take a different approach?”",
                "Did they all fall out of a huge window together?",
                "Harris County (Texas) Sheriff's Office, for those too lazy, but still curious.",
                "I want to say someone is covering their tracks, the guilty are taking the easy way out before the hammer falls or a little bit of both.\n\nOn the other hand, suicide is often contagious."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Nasa drops plan to land first woman and first person of color on the moon",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/21/nasa-drops-plan-first-woman-moon",
            "upvotes": 1473,
            "date": "03/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/aac07bc3d883357f77e67ceb6bb53fc3c2f780a4/0_0_5000_3001/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b698ce2e793d534258c22be90188bb91",
            "top_comments": [
                "How about djt and JD become the first us president/VP to be sent to the moon?",
                "China has the opportunity to do the funniest thing here\n\n'For All Mankind' style",
                "I’m going to be honest, I don’t think they should have said that in first place. There are more than enough highly qualified women and people of color that they could have just picked and most people wouldn’t bat an eye. Explicitly stating before selecting the astronauts that they were going to choose a woman and POC leaves the wrong impression and is exactly the sort of thing that turns people off DEI.",
                "This is a poorly worded and a clickbait title. NASA did not drop the plan— they adjusted the verbiage on their website. Victor Glover and Christina Koch are still on the mission, per the last paragraph of the article. I think it is stupid to adjust the website verbiage, but it is also important to call out yellow journalism.",
                "Well since we’re joining the British Commonwealth apparently, I assume the next person on the moon will no doubt be British.",
                "....so a literal DEI moon landing? Holy shit, this timeline's hilarious!",
                "It's good to be black on the moon... One of my favourite quotes from Space Force.",
                "Let's be real, nobody is going back to the moon. Everyone will be busy spending money killing each other. 🚀",
                "Is this the extent of our space goals? Get every identity group we can to the moon?",
                "Why does their race have to be important. I’m sick of this race baiting crap. Can we go back to the 90s when it was woke to be colour blind."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "13 year old boy shoots and kills 14 year old girl in Baytown just outside of Houston, Texas.",
            "external_url": "https://www.click2houston.com/news/local/2025/03/21/teenage-boy-shoots-kills-girl-at-baytown-apartment-complex-playground-following-school-bus-altercation/",
            "upvotes": 872,
            "date": "03/22/2025",
            "thumbnail": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/EE4SV5JBWNCHJDNBWSENDAHNSQ.png?_a=DATAdtfiZAA0",
            "top_comments": [
                "Over an altercation on the bus? Fuck, my kid had an altercation on the bus yesterday. I'm glad no child related to it is DEAD. I hate reading the news most days now.",
                "At the very least, an adult somewhere adjacent to that event should go to prison for making the gun available. (whether deliberately or through negligence)",
                "This is so sad. Parents should be charged for not safely securing a firearm.",
                "[removed]",
                "From a statistical perspective are shootings done by children increasing?",
                "Baytown is a rough place. Cheap developments overlap rural ghettos, overshadowed by refineries.",
                "Many countries do not rely on parent competency to keep the guns out of the hands of children. I promise everyone here that no matter how many negligent parents we lock up for life, there will always be more. Perhaps there is a more rational solution to keep guns out of the hands of children.",
                "Oh, Texas. We have tried nothing and are all out of ideas on how to solve gun issues, but we can come up with bills like the Furries Act. \n\n\nMay that poor girl rest in peace, and hopefully her family gets all of the support they need to process their grief. ",
                "Murder is murder. He should be tried as an adult",
                "I've lived in this area for several years now, and this is just so sad. A young girl is dead, and a young boy has now irrevocably changed his life and the lives of the families of these kids. We've got to pass some commonsense gun control laws in this country, though people like Ted Cruz and Greg Abbott will fight for the rights of the NRA instead of parents and children."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "George Foreman: Heavyweight boxing legend dies aged 76, says family",
            "external_url": "https://www.bbc.com/news/articles/ckg8ez8201yo",
            "upvotes": 20372,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/05d5/live/82e5e820-06c3-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "R.I.P. George\n\n>George Foreman named all of his five sons \"George Edward Foreman\" as a way to create a sense of unity and shared identity within the family.\n\nThat is going to be one confusing obituary!",
                "[deleted]",
                "RIP legend. Crazy how I wasn’t even into boxing as a kid but still grew up knowing who he was.",
                "Our thoughts are with the George Foremans at this time. ",
                "That grill was so clutch in my college days",
                "That's the last of the golden era heavyweights, right? End of an era.",
                "Still set to fight Jake Paul next month.",
                "Shit. Gotta pull out my old Forman grill and sear up a chicken breast in his memory.",
                "“When we were Kings” is so good if u haven’t seen it.",
                "\"Down goes Frazier! Down goes Frazier! Down goes Frazier!\"\n\nHe won the heavyweight title in 1974 and then again in 1994."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "US to import eggs from Turkey and South Korea to ease prices",
            "external_url": "https://www.bbc.com/news/articles/c743g135vj9o",
            "upvotes": 4863,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2eb2/live/7b390f80-069b-11f0-ab19-cd63e1c90c04.jpg",
            "top_comments": [
                "That’s pretty ridiculous considering that Mexico is right next door and has absolutely no issue with any egg shortage whatsoever?",
                "By the time it gets to market here they need to rename them century eggs",
                "[removed]",
                "Because nothing does more to make something cheaper than flying it half way around the world.",
                "Shipping them halfway around the world is sure to save money",
                "No word on HOW this will help prices. But who cares it makes a nice headline. \n\n  \nOh and $400 million for farmer relief? Glad we DOGE'd all those socialist programs and cut off the entitled folks!",
                "Hehehe imagine if Americans get turkey eggs instead of eggs\n*from* Turkey because Trump can't read",
                "These eggs better not be brown eggs or they're going straight to Guantanamo Bay.",
                "worldwide logistics are good but theres no way importing eggs from halfway around the world would ever make sense",
                "I highly doubt the costs associated with importing eggs from that far away could possibly bring a dozen under $10. If only we weren’t destroying our relationships with our neighbors and closest trading partners."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Tesla trade-ins surge to record high",
            "external_url": "https://www.nwaonline.com/news/2025/mar/22/tesla-trade-ins-surge-to-record-high/?business-national",
            "upvotes": 288,
            "date": "03/22/2025",
            "thumbnail": "https://wehco.media.clients.ellingtoncms.com/imports/adg/photos/209696036_tesla-trade-in_IZYQDOMEA2SXZBCR6DJE7GDWVY_t1200.jpg?57a0c2296240c280e9492005c3cad63e7cbe80f4",
            "top_comments": [
                "Honestly, it wouldn't have been this bad had he not made those Nazi salutes at the inauguration. Were those few seconds of fame really worth it Elon? But I guess it was inevitable with someone like him.",
                "I’m sure Phony Stark will find a way to blame this on trans people",
                "Mustang Mach-E all the way!",
                "Time to trick the conservatives to go green buying all the teslas to “own the libs”",
                "Good luck selling new models now, Elmo.",
                "I’m surprised they’re taking them as trade. Seems like a losing proposition.",
                "The Tesla brand is damaged beyond repair",
                "I heard Polestar is a better car. Is this true?",
                "The lack of quality, quality control, safety, and all the less than stellar things Musk has been up to recently, I'm not really surprised. Tesla's went from over hyped and overpriced to overpriced, over hyped and dangerous.",
                "Last year there was a lot of talk about Musk becoming the first trillionaire in a few years, and now he's on the way to losing his title of richest person in the world. Dude has really damaged Tesla with his behavior."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "FBI Employees Reviewing Jeffrey Epstein Files Told to Limit Redactions",
            "external_url": "https://www.wsj.com/us-news/law/doj-jeffrey-epstein-documents-7da298dc",
            "upvotes": 672,
            "date": "03/22/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Only redact the victims, do not redact the perpetrators.",
                "\"Just make sure they get the ones involving person of interest number 1.\"",
                "The only thing redacted should be the names of the victims. Fuck all the pedos, enablers, and other scum that were associated with Epstein and Maxwell. And yes that means the Clinton’s as well as Trump and all his buddies.",
                "Limit them to what, those inside the current admin?",
                "Yup.  Just need to limit all redactions to removing all references to the word \"Trump.\"  Easy peasy!",
                "Damn so they are going to take out all the pages on trump? Whod guess?",
                "Time to find out he didn’t kill himself",
                "Here's hoping it's the same people that were redacting the JFK files that failed miserably in that task.",
                "why is revealing the list be “national security concerning” it’s not like it’s nuclear bomb manuals?",
                "I think there's gonna be a huge meltdown on the internet when the ultimate conclusion in the files is \"we have no reason, beyond nebulous allegations of motive, to think any third party was involved in his death.\" No one online is gonna buy that, regardless of if it was written by an earnest investigator or not.\n\nBasically, I think everyone is about to feel a serious case of angry blue balls."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Pope Francis set to make his first appearance in five weeks, Vatican says",
            "external_url": "https://www.abc.net.au/news/2025-03-22/pope-francis-set-to-make-first-appearance-vatican-says/105085040",
            "upvotes": 284,
            "date": "03/22/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/10cbbeef57959dcc4580e7a5475bcc53?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=32&width=862&height=485&imformat=generic",
            "top_comments": [
                "If he sees his shadow it’s five more weeks of winter.",
                "If he looks a little like Brendan Frasier, it's just because he's been sick and you haven't seen him in a while. No need to worry.",
                "Has this guy always been so fat? I thought gluttony was a sin.",
                "Nobody cares. Fuck the pope"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "OCDSB seeking court order in bid to unmask anonymous “Redditor”",
            "external_url": "https://www.cbc.ca/news/canada/ottawa/ocdsb-seeking-court-order-in-bid-to-unmask-anonymous-redditor-1.7489101",
            "upvotes": 1591,
            "date": "03/22/2025",
            "thumbnail": "https://i.cbc.ca/1.7141767.1710274888!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_1180/reddit-ipo.JPG?im=Resize%3D620",
            "top_comments": [
                "From The CBC:\n\n>The Ottawa-Carleton District School Board (OCDSB) is locked in a court battle to compel social media site Reddit to turn over identifying information of a user who it alleges has been defaming staff at a local elementary school.\n\n>The board alleges the posts about ongoing issues at Pinecrest Public School were made in an attempt to defame employees “for some unknown ulterior motive.” None of the allegations have been proven in court.\n\n>The board wants Reddit to provide any email addresses, phone numbers, location data and other identifying information about the user. In a statement, it said it was compelled by its “unwavering dedication to creating a positive and supportive environment for all members of the OCDSB community.”\n\n>Reddit argues handing over the information will create a chill among other users, explaining in its court filings that “anonymity is not just a user preference but a defining feature of Reddit’s business model and identity.”\n\n>Most of the comments in question were in response to discussions around news stories about the board and problems at specific schools. Several involved specific incidents and ongoing issues at Pinecrest Public School that have been reported in the media.\n\n>Some of the comments singled out the school’s principal and a superintendent, the board said in its court filings. Reddit’s court filings mention 51 comments by the user in 17 different conversations. \n\n>User alleged OCDSB failed to report violence, racism. According to the OCDSB, the “false and defamatory” comments began on Dec. 17, 2022. Naming individual staff members, the user accused them of failing to report incidents, stifling investigations and ignoring instances of racism.\n\n>According to the board, the comments were dishonest, disrespectful and created a toxic work environment. The anonymous user also insinuated that staff members had “acquiesced in the perpetration of racist acts at the school,” the board said.\n\n>During a lengthy Reddit thread about a high school [student who died after being stabbed in Nepean](https://www.cbc.ca/news/canada/ottawa/high-school-student-stabbed-last-week-in-nepean-dies-1.7194798) last May, the user accused an OCDSB superintendent of ignoring safety concerns in the district. In a response to another user, the individual being sought by the board described themselves as a teacher. \n\n>The board said it’s considering a defamation lawsuit against the person responsible for posting the comments. But Reddit denies OCDSB’s claim that the information is “necessary for it to determine whether to pursue a potential claim for defamation.”\n\n>OCDSB ‘vigorously defending’ employees. In response to CBC’s request for comment, OCDSB communications manager Diane Pernari said the board is committed to “vigorously defending our employees against unfounded attacks and upholding our legal and ethical obligations.”\n\n>She wrote the legal action underscores the board’s “unwavering dedication to creating a positive and supportive environment for all members of the OCDSB community.” Known as a Norwich Order, the board’s application seeks to compel a third party to provide information about alleged wrongdoing, even if the third party isn’t directly involved in the wrongdoing.\n\n>Reddit did not respond to a request for comment. Lawyers for both parties are expected to have another court date later this year. \n\n>Court to consider free speech, defamation. Ottawa-based lawyer Karin Page said the school board will have to demonstrate the user’s comments were defamatory, rather than just critical of its policies. \n\n>Page said the court will need to balance the public interest in protecting anonymous speech against the board’s need to defend itself against alleged defamation. “There’s a difference between someone just voicing their opposition to a policy or ... to the government, or to disclosing their own personal situations,” she said. “There’s a distinction between that and making defamatory statements online.”\n\n>She added the fact the comments named or identified specific individuals is concerning, as it makes it difficult for those people to defend themselves.",
                "I feel like this action by the school officials has made the \"defamatory\" comments much more widely known.\n\nAlso trying to \"unmask\" and sue a commenter on reddit makes them look even worse, somehow.",
                "This lawsuit is a joke and an example of how school boards attract some seriously ignorant people.",
                "The OCDSB certainly could defend themselves against false allegation, it doesn't take the posters identity to do it, that's a pig that wants revenge. What's worse, bad mouthing the system, or trying to identify your detractors for revenge?",
                "Sounds like they deserve all the criticism they get.",
                "This is a big test for Reddit if they will cave-in with the authoritarian school district board in Canada.\n\nGiving away user information will have bigger implication for this community. \n\nClearly, it was not defamation. OCDSB is a bully school board who doesn't care about their teachers and students.",
                "If Reddit caves to a school board what will they do when the Trump administration demands the same thing?",
                "I feel like they would be better off using the money paying court costs on solving the issue the redditor is being critical of. If there wasn't anything that warranted complaining about, the issue wouldn't have come up.\n\nAside from that tangent, I do hope reddit keeps that user anonymous. Maybe ban the user if it is determined a defamation case against them would succeed beyond reasonable doubt. Reddit giving up information to a smaller non-us court would almost certainly set a precedent of giving up any info requested by a larger government that is being overrun by Nazis. And that spooks me because that could be used for any number of things. \n\nSure, I could be worried about a slippery slope, but given it hasn't even been 2 months with Trump in office, I would like to avoid the risk over the next... 3.5 years...",
                "That’s a pretty soft reason to hand over data.",
                "Of course it’s pinecrest lmao, that school is a shit hole."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "A troubling trend? 4 former and current HCSO deputies take their own lives in last 6 weeks",
            "external_url": "https://abc13.com/post/4-former-current-harris-county-sheriffs-office-deputies-take-own-lives-last-6-weeks/16060117/",
            "upvotes": 4111,
            "date": "03/22/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16060176_032025-ktrk-hcso-deputies-img.png?w=1600",
            "top_comments": [
                "Curious what’s going on in this department considering many of its officers have been involved with investigations against them for corruption and organized criminal activity within the last year or so.\n\nhttps://www.fox26houston.com/news/harding-street-raid-charges-dismissed-8-houston-police-officers.amp\n\nhttps://abc13.com/amp/houston-chronicle-unchecked-forces-harris-county-constables-accountability/14603562/",
                "Something nasty went down",
                "This stinks to high heaven. Those deaths need to be investigated by someone outside that community",
                "LA county Sheriff's 2 years ago. 4 suicides within 24. hours.https://www.google.com/amp/s/abc7.com/amp/los-angeles-county-sheriffs-department-suicide-deaths-lasd-employees/14036429/",
                "So who is investigating these \"suicides\"? it sure shouldn't be the same office where they are working.",
                "“Well, the official findings are that it definitely wasn’t one of us,”’ said an HCSO spokesperson. “Not sure we’ll ever know who did it. But we can say with certainty, none of us was involved.”",
                "#Tragic Toll: Four Harris County Officers Take Their Own Lives in Just Six Weeks\n\nQuiet grief has settled over Harris County as the community reels from the shocking loss of four current and former deputies, each taking their own life in the space of just six weeks. The most recent was Deputy Christina Kohler, a well-respected veteran whose death last week was officially ruled a suicide. She was just 37.\n\nKohler had been reported missing, sparking concern across the force. A public alert was issued and the search began. Days later, on 13 March, her body was found. The news stunned friends and colleagues. Just three days after Kohler's death, former deputy Maria Vasquez, who left the sheriff's office in December, also died by apparent suicide. Then, earlier this week, another former deputy, William Bozeman, was found dead. The pattern is as heartbreaking as it is alarming.\n\n“It caught a lot of us by surprise,” said Jose Lopez, president of the Harris County Deputies' Organisation. “One is too many. Two? Three? Yes, it's devastating.”\n\nLopez, who had known two of the fallen deputies for over twenty years, has been helping colleagues come to terms with the grief. He’s also grappling with the death of former deputy Long Nguyen, who took his own life in early February at the age of 58. For Lopez, the pain is personal. For the department, it’s a wake-up call.\n\nThere is growing concern about the toll this profession takes on those who serve. Policing is a job that deals daily with trauma, danger and confrontation. It can grind away at a person’s mental health until there is very little left to give. Dr Thomas McNeese, who heads up the Sheriff's Office Behavioural Health Division, is all too aware of the emotional weight deputies carry. His team offers peer-to-peer support and has been working since 2020 to provide help, but even he admits the past few weeks have been especially hard.\n\n“This profession takes a toll,” said McNeese. “The longer you're in it, the more it changes you.”\n\nLaw enforcement officers have long been known to suffer disproportionately from mental health issues and suicide. The nature of the work, the things they witness, the pressure to remain composed in the face of chaos, it all builds up. McNeese is urging those who are struggling to reach out, to talk, to act.\n\n“Getting help, doing something to not stay stuck, that’s important,” he said.\n\nInside the department, questions are being asked. Despite the resources already in place, Lopez wonders if it is enough. Is there more they could be doing? Is something being missed?\n\n“We can’t help but ask,” he said. “Do we need to take a different approach?”",
                "Did they all fall out of a huge window together?",
                "Harris County (Texas) Sheriff's Office, for those too lazy, but still curious.",
                "I want to say someone is covering their tracks, the guilty are taking the easy way out before the hammer falls or a little bit of both.\n\nOn the other hand, suicide is often contagious."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "George Foreman: Heavyweight boxing legend dies aged 76, says family",
            "external_url": "https://www.bbc.com/news/articles/ckg8ez8201yo",
            "upvotes": 20376,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/05d5/live/82e5e820-06c3-11f0-94d4-6f954f5dcfa3.jpg",
            "top_comments": [
                "R.I.P. George\n\n>George Foreman named all of his five sons \"George Edward Foreman\" as a way to create a sense of unity and shared identity within the family.\n\nThat is going to be one confusing obituary!",
                "[deleted]",
                "RIP legend. Crazy how I wasn’t even into boxing as a kid but still grew up knowing who he was.",
                "Our thoughts are with the George Foremans at this time. ",
                "That grill was so clutch in my college days",
                "That's the last of the golden era heavyweights, right? End of an era.",
                "Still set to fight Jake Paul next month.",
                "Shit. Gotta pull out my old Forman grill and sear up a chicken breast in his memory.",
                "“When we were Kings” is so good if u haven’t seen it.",
                "\"Down goes Frazier! Down goes Frazier! Down goes Frazier!\"\n\nHe won the heavyweight title in 1974 and then again in 1994."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "U.S. to revoke legal status of more than a half-million migrants, urges them to self deport",
            "external_url": "https://www.cbsnews.com/news/u-s-to-revoke-legal-status-of-over-a-half-million-migrants-chnv/",
            "upvotes": 15780,
            "date": "03/21/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/03/21/f77a5737-9f4d-4bf8-8759-61e97e11ba39/thumbnail/1200x630/732b2e545fbc7cfb3cc1d7a3177155cc/gettyimages-2206282830.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "Let’s start with Elon Musk.",
                "I feel obliged to point out that Elon Musk and Melanie both worked illegally in the US and on that basis should also be deported. They are deporting folks for that offense, even many years on.",
                "\"We don't mind the ones who do it legally\"",
                "They are so shit at deporting illegal immigrants that they go to legal ones",
                "He is doing this to up the deportation numbers.  He has run out of undocumented folks.  So now he has to create some new ones by snatching documents away.\n\nThese folks have jobs.  They are paying rent and mortgages. They have started their own businesses.  They are paying taxes.  They have revitalized communities.  They are decent people just trying to live a better life here.  \n\nTrump wants to throw these people out but let white South Africans in.  The racism couldn't be any more overt.",
                "The insane thing about CHNV is that it's how most people think lawful immigration should or does work.\n\nYou needed to apply before you were in the United States, undergo a background check, and have a sponsor that will provide for your housing and care. Most people approved for CHNV aren't eligible for public assistance, either.",
                "But I thought they just hated the people here illegally? They kept saying that they were cool with immigrants as long as they do it legally. Were they just lying to mask their racism? Naw...",
                "Is Melania on that list 🤔🤔🤔🤔",
                "An article the other day noted that most of Trump’s immigration policy is currently targeting those who are here legally, but on “borrowed time” due to asylum seeking or refugee status. That is a rapid way to get numbers. The numbers from that policy, and the videos of illegal immigrants being treated inhumanly feeds his sociopath base.\n\nIt should be noted, a lot of posts have been saying, “Is this what you voted for!?” In regards to Cubans seeing Cubans being deported and such. You need to understand: This IS exactly what they voted for. Legal immigrants do not give a shit about their brethren who are not legal. All they see are “illegals” being kicked out of THEIR country that they “earned”. The fact that most MAGA folks would gladly see these same “legal” immigrants kicked out of THEIR country does not even register: Everyone thinks they are one of the “good ones” when it comes to hating immigrants.",
                "Can’t wait for more of those “my wife was here legally, got deported to Latin America, but I don’t regret my vote for Trump” videos."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "US to import eggs from Turkey and South Korea to ease prices",
            "external_url": "https://www.bbc.com/news/articles/c743g135vj9o",
            "upvotes": 4850,
            "date": "03/22/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2eb2/live/7b390f80-069b-11f0-ab19-cd63e1c90c04.jpg",
            "top_comments": [
                "That’s pretty ridiculous considering that Mexico is right next door and has absolutely no issue with any egg shortage whatsoever?",
                "By the time it gets to market here they need to rename them century eggs",
                "[removed]",
                "Because nothing does more to make something cheaper than flying it half way around the world.",
                "Shipping them halfway around the world is sure to save money",
                "No word on HOW this will help prices. But who cares it makes a nice headline. \n\n  \nOh and $400 million for farmer relief? Glad we DOGE'd all those socialist programs and cut off the entitled folks!",
                "Hehehe imagine if Americans get turkey eggs instead of eggs\n*from* Turkey because Trump can't read",
                "These eggs better not be brown eggs or they're going straight to Guantanamo Bay.",
                "worldwide logistics are good but theres no way importing eggs from halfway around the world would ever make sense",
                "I highly doubt the costs associated with importing eggs from that far away could possibly bring a dozen under $10. If only we weren’t destroying our relationships with our neighbors and closest trading partners."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "RISING",
            "title": "Tate brothers say they have left US to return to Romania",
            "external_url": "https://www.bbc.com/news/articles/cvgw0w7147vo",
            "upvotes": 17495,
            "date": "03/21/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b815/live/88e93ad0-06bc-11f0-88b7-5556e7b55c5e.jpg",
            "top_comments": [
                "selfies w/ pizza box or it never happened",
                ">\"Innocent men don't run. They clear their name in court.\"\n\nThis guy literally fled to Romania to escape rape charges in the uk.\n\nWhat a fucking dog dong.",
                "And nothing of value was lost. Fuck these twats",
                "They're going back for their court appearance, which was part of the agreement to relax their travel restrictions. That said, I was half-expecting Trump to harbour them.",
                "If I never heard about the Tate brothers again it would make my life better",
                "The only place they should be going is prison. They should never have been allowed to travel here in the first place. Edit: it's also disgusting this dude still has ten MILLION Twitter followers.",
                "Remember, trump wasted time rallying to free these rapists. Time he was supposed to be spending serving the American people. Instead he was fighting for rapists.",
                "Bring back oubliettes.",
                "[removed]",
                "He seems to really take interest in Romania. Wonder if its the secret location of his missing chin."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Nasa drops plan to land first woman and first person of color on the moon",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/21/nasa-drops-plan-first-woman-moon",
            "upvotes": 1473,
            "date": "03/22/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/aac07bc3d883357f77e67ceb6bb53fc3c2f780a4/0_0_5000_3001/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b698ce2e793d534258c22be90188bb91",
            "top_comments": [
                "How about djt and JD become the first us president/VP to be sent to the moon?",
                "China has the opportunity to do the funniest thing here\n\n'For All Mankind' style",
                "I’m going to be honest, I don’t think they should have said that in first place. There are more than enough highly qualified women and people of color that they could have just picked and most people wouldn’t bat an eye. Explicitly stating before selecting the astronauts that they were going to choose a woman and POC leaves the wrong impression and is exactly the sort of thing that turns people off DEI.",
                "This is a poorly worded and a clickbait title. NASA did not drop the plan— they adjusted the verbiage on their website. Victor Glover and Christina Koch are still on the mission, per the last paragraph of the article. I think it is stupid to adjust the website verbiage, but it is also important to call out yellow journalism.",
                "Well since we’re joining the British Commonwealth apparently, I assume the next person on the moon will no doubt be British.",
                "....so a literal DEI moon landing? Holy shit, this timeline's hilarious!",
                "It's good to be black on the moon... One of my favourite quotes from Space Force.",
                "Let's be real, nobody is going back to the moon. Everyone will be busy spending money killing each other. 🚀",
                "Is this the extent of our space goals? Get every identity group we can to the moon?",
                "Why does their race have to be important. I’m sick of this race baiting crap. Can we go back to the 90s when it was woke to be colour blind."
            ],
            "aggregate_sentiment": 28.0
        }
    ],
    "last_updated": "03/22/2025 16:08:45 UTC"
}