{
    "posts": [
        {
            "category": "HOT",
            "title": "Man allegedly hid marijuana in Easter eggs across the city, posted clues to social media",
            "external_url": "https://local12.com/news/offbeat/easter-egg-marijuana-scavenger-hunt-hints-online-eggs-weed-pot-facebook-social-media-hint-picture-pictures-hid-hidden-police-search-investigation-five-drug-drugs-narcotics-dealer-selling-sell-park-parks-city-around-across?fbclid=IwZXh0bgNhZW0CMTEAAR4yYc8DWrYX0bIgzKbIsg1XPl84PybdrKUGKvLNoCTot1cmS4UyJ6dUCqDB9A_aem_x9AL9gaNBCFh-kY10ab7kw",
            "upvotes": 22322,
            "date": "04/27/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/1920/986/center/90/34125fb8-3b75-40d0-b8b0-d1f0e60e0986-weedscavengerhunt.png",
            "top_comments": [
                "When Easter lands on 4/20, this man had a calling and knew what to do.",
                "Paranoid people have been getting it wrong. There aren't any drugs in the Halloween candy, they're in the Easter eggs!",
                "God forbid men have hobbies.",
                "Where was he when I was a teen?",
                "One of the weed shops near me does this, but they hide plastic eggs with tickets redeemable for prerolls and such at their store.  Seems like a slightly less questionable way to go about it.",
                "The riddler if he was cool",
                "Give this man a key the city",
                "We've got pedophiles and fascists running our country right now, and *this* is what our judicial system is punishing? \n\nFuck that.",
                "Bro was tripping posting on FB in TX..should have just put the clues on r/treecaching...",
                "Unrelated question for Catholics: How do I nominate someone for sainthood?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Circumcision at NYC hospital almost made baby bleed to death, parents say",
            "external_url": "https://www.cbsnews.com/newyork/news/baby-nearly-bled-to-death-circumcision-parents-say/",
            "upvotes": 15417,
            "date": "04/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/25/2607bc07-2da0-4f95-a5be-c67a4b41f989/thumbnail/1200x630/0790313b56ce710814d12de467b8523d/bisram-5p-pkg-alleged-b-wcbsdpf9-hi-res-still-00-00-5619.jpg?v=8e9dede207b29c97b32974c53e32aabc",
            "top_comments": [
                "For those who haven't read the article, child was born with heart condition. After receiving a stent, hospital asked parents if they wanted to go ahead of circ. According to parents, hospital did not warn them about increased risks of surgery in an infant with a heart condition. \n\nAnd on a personal note, I was shocked by how much pressure the docs and nurses put on us after our son was born.  Not-so-subtle but still indirect \"Are you sure?\" and ongoing discussion after we indicated \"no.\"",
                "I was born 3 months premature and my parents waited until I was around age 6 until I got circumcised. Went in for an arm surgery only to wake up with also a burning and painful peepee. Them and the doctor kept it secret from me.",
                "I have a friend who was always posting anti-circumcision stuff on her FB (this was several years ago). At first, I can’t lie, I thought it was a little weird that she was so anti, but I would always look at what she posted, and over time, I realized just how fucked up it is, and I’m with her. They should not be doing this period, much less to newborns.",
                "I'm a nurse in critical care, and have seem some truly horrific things. The only thing that ever made me feel light-headed, like I might vomit or faint, was seeing an infant circumcision during my OB rotation in school. The way that little baby screamed... Absolutely horrifying. There is no good reason for this to be a commonplace practice",
                "We could eradicate breast cancer if we did preventative mastectomies on every woman. We don't alter their secondary sexual characteristics to prevent terminal illness, altering a boy's to prevent UTIs is insane.",
                "I know someone who had to take their baby back to the hospital to have more silver nitrate applied to their infant son’s incision because it was bleeding too much still after the procedure. I just could never subject my newborn child to that kind of pain. Men are born with foreskins. All of them, with few exceptions. It’s never made any sense to me why something someone is born with and is completely normal should be removed. They serve a purpose.",
                "Elective plastic surgery within days of birth is wild.",
                "Forcing male cosmetic surgery on an infant \\*should\\* be illegal, just how it is for females. We just aren't ready for that talk as a society yet, which disappoints me considerably.",
                "Genital mutilation should be illegal",
                "Maybe don’t elect to  mutilate your newborns genitalia"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "The FBI mistakenly raided their Atlanta home. Now the Supreme Court will hear their lawsuit",
            "external_url": "https://apnews.com/article/georgia-fbi-raid-supreme-court-lawsuit-9cb55aa6f45bbf02c29d84363c7c9e6f",
            "upvotes": 7723,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Oops wrong house, oops wrong house, oops wrong house, oops wrong house, oops wrong house”\n\n“Well this neighborhood is clean I really thought we would find something too”",
                "Allowing a GPS device to take you to the wrong address isn't an honest mistake. It's gross incompetence that is extraordinarily easy to avoid.\n\n\nA life and death situation and this stupid motherfuckering agent popped info into the GPS and was off to adventure time.\n\n\nNo checking Google maps or street views. No driving by the place before hand. No use of additional GPS devices by other agents involved. Nothing. Squat. Nada.\n\n\nPure laziness and idiocy that you'd hope would mean immediate handing in of any badges, and a national Do Not Hire flag for the entire team responsible.\n\n\nBut nope.",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions\n\nCorrect me if I'm wrong but isn't second-guessing law enforcement decisions like, at least 60% of a courts job",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions.\n\nI would think any patently wrong decision should absolutely be “second guessed”. Something precious has been taken from the victims, and whether or not the officers should be personally held accountable for their inarguably sloppy work, the government should absolutely provide some reasonable measure of restitution including physical damage and the opportunity for psychological counseling.",
                "So shouldn’t be long before the Supreme Court rules it’s okay to violate the 4th amendment as long as the officers were just trying their darnedest and didn’t mean to.",
                "I was kinda on the FBI's side at first, because early in the article they said they had reason to believe they had the correct house. \n\nThen they said they relied on GPS to find the house. JFC. Who hasn't been taken astray by that? Use your fvcking eyeballs to confirm. Don't cops usually do some sort of pre-raid surveillance? I can understand getting bad info and then building a case on that, might have honestly led them to a mistake... but relying on GPS is completely inexcusable here, IMO. \n\nI hope they win millions.",
                "I wonder how the Supreme Court will defy precedent to allow cops to do this more in the future. \n\nHearing their absurd justifications is always entertaining in a macabre.",
                "I executed tons of search warrants in my career. Never hit the wrong house.  This isn’t a mistake. It’s laziness and incompetence of the highest order.",
                "\"LOL, get fucked peasants.\"\n\n\\-SCOTUS to plaintiffs, 2025.",
                "> 'The courts shouldn't second guess law enforcement decisions'.\n\nThe entire point of the courts is to second guess law enforcement decisions."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Over 100 immigrants arrested in raid on underground Colorado nightclub where active-duty military members worked, feds say",
            "external_url": "https://www.cnn.com/2025/04/27/us/colorado-springs-ice-raid-club/index.html",
            "upvotes": 3489,
            "date": "04/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21577267-1883-9550000000002-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“Sir they’ve found the USAF Officer’s Lounge”",
                "According to the article, TdA, MS-13, AND the Hells Angels all go illegal night clubbing together. Maybe we can all learn something about tolerance and cooperation.\n\n“authorities documented drug trafficking, prostitution, and the presence of members from the Venezuelan gang Tren de Aragua, MS-13, and the Hells Angels, according to Pullen [head of Rocky Mountain DEA.]”",
                "I’m not just going to take their word for it that they’re immigrants",
                "Attorney General Pamela Bondi [posted on X ](https://x.com/AGPamBondi/status/1916515090418839624)that two people had been arrested on outstanding warrants during the raid.\n\n“Trump’s directive to make America safe again is achieving results!”\n\nIt looks more like Trump's employees, aka the military, are running crime rings to me instead. That isn't surprising considering the pay rate of the military.",
                "Colorado Springs, a deeply military city in Colorado, has heaps of MS-13 and Tren de Aragua AND Hells Angels all doing a bunch of drugs together. They put aside all their differences for a fun night out once in a while. Seems legit.",
                "A 100 immigrants?  All in one place?  Wild.  Like absolutely wild.  So wild I can't even believe it.",
                "Maybe it's just me, but I don't trust the current government's judgement on identifying gang members. For example, members of Tren de Aragua don't have gang identifying tattoos according to experts and yet they said a gay barber with two crown tattoos on his wrists, with mom and dad written beneath them, was a terrorist. They then sent him away for the rest of his life to a foreign dictator's slave labor camp. It just doesn't really add up.",
                "On the subject of active duty military personnel, since ICE seems to be looking for any excuse to deport both documented and undocumented  immigrants, regardless of criminal records, I wonder how this effects active military personnel who aren’t U.S. citizens, but still have green cards. Again, having legal status here doesn’t seem to make much difference.",
                "So basically ICE raided a nightclub, declared everyone inside terrorists and held active US military personnel at gunpoint",
                "340,000,000 people in the USA. 1,800,000 are incarcerated in the USA. I don’t feel especially safer because 100 illegal immigrants were arrested in a Colorado Springs Rave club. And what a surprise, they also found drugs. And one of Pete’s favorite, from what I’m hearing. Oh yeah, and guns, in this country!  What a shock!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "3 children who are US citizens — including one with cancer — deported with their mothers, lawyers and advocacy groups say",
            "external_url": "https://edition.cnn.com/2025/04/27/us/children-us-citizens-deported-honduras/index.html",
            "upvotes": 1086,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25021729089144.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I do not understand these american headlines, \"US citizens\" are deported? Deported where if they are US CITIZENS? English is not my first language, so am I just dumb? Or?",
                "Not deported. Kicked out illegally",
                "> “If ICE can do this to these mothers and these children, if ICE can do this to students on college campuses … none of us are safe from this kind of lawlessness,” she said.\n\nUnchecked power WILL come to bite us in the ass later",
                "\"The father then moved to give provisional custody of his two daughters to his sister-in-law, a US citizen who lives in Baton Rouge, and the mandate was notarized in Louisiana, the documents say.\"\n\nIs the father himself not a us citizen? If he is then why try to pass guardianship to his sister in law?",
                "Likely he’s getting the info from m the federal Medicaid registrar",
                "The children weren't deported. The mother was and she brought her kids with her. Should the US forcefully keep the child behind, separate them from their mother, and put them with child services? No. That would be cruel. If the mother wants to take her kids, she is allowed to.",
                "Its a jarring headline, I get that, but in all honesty people do come here while they are pregnant in order to have a so called \"anchor baby\" with the mindset that even if they are here illegally their child is a US citizen and as their parent they themselves will be safe from deportation. It cannot continue like this. It's being exploited. You need to come into the country legally. End of story."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Journalists defend press freedom at muted White House correspondents’ dinner",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/27/white-house-correspondents-dinner",
            "upvotes": 16446,
            "date": "04/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3de87fcc8d0cd3ef43ea4e8bb3da63b41e4e45e1/0_273_8192_4918/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1439bd4aace8f904e33aee094e5efa24",
            "top_comments": [
                "I like how they cancelled the comedian and totally capitulated to Trump, just to not have him or anyone from the administration show up anyway. Sums up a lot",
                "These fuckers cancelled the comedian because they were worried about offending Trump. I won't even get into the decades of \"Both Sides Equally At Fault\" coverage that's played a material role in how the current state of affairs was arrived at. Absolutely fuck off and be better, THEN pat yourselves on the back.",
                "The media's been bothsidesing and sanewashing Trump for so long and now they wanna prate about press freedom as the monster they helped create openly cracks down on 1A rights. What a pack of useless fools, but I guess we get what we ask for.\n\nAmerica wanted to believe both sides were the same so they didn't have to pay attention and they paid people like this to tell them that, now here we are.",
                ">Journalists rallied in defence of press freedom on Saturday, insisting they “are not the enemy of the people” at [a Washington media gala](https://www.c-span.org/program/public-affairs-event/white-house-correspondents-association-dinner/658807) snubbed by Donald Trump.\n\nIt's weird the press has to make a point of not being the enemy of the people, and doubly bizarre considering who is doing the accusing.",
                "Journalists cover politics like it's red team vs blue team when the reality is Project 2025 vs the Constitution.",
                ">Alex Thompson of Axios, who won an award for coverage of Biden, silenced a room that was otherwise buzzing all night when he called out the media for failing to adequately investigate Biden’s mental acuity. The issue blew up when the 81-year-old gave a disastrous debate performance four months before the election.\n\n\nI think it's wild that this person thinks the mess up was that we just weren't hard enough on the Biden administration. Yeah, he fucked up immeasurably in how he fumbled the end of his term. Granted. The problem is not that the media didn't talk enough about Biden being old. That was literally everywhere.\n\n\nWe have a GOP that has been barreling towards authoritarianism for decades, and our media institutions have treated them as either rational thought leaders or loveable joksters while they've  torn down our communities and sold us off to wealthy donors.\n\n\nThese people sitting in their fancy ballroom and speaking to nobody but themselves is the perfect metaphor for the current value of our media institutions.",
                ">The WHCA had invited [then cancelled](https://www.theguardian.com/us-news/2025/mar/30/white-house-correspondents-dinner-cancels-comedian-appearance) comedian Amber Ruffin after she referred to the Trump administration as “kind of a bunch of murderers” and asserted that “nobody wants” Trump to attend the dinner.\n\nAh yes, the WHCA, the bastion of free speech and openness to hearing all voices",
                "The Press continues to feed the Trump beast. He spouts nonsense non-stop. Nothing makes sense. He says everything under the sun and they hang on every word. Why? Because it is so crazy it sells their news for them. Not a one has stopped featuring Frumpy’s every word because it enriches them. They could singularly focus on the deaths from loss of reproductive rights, the deportation of Americans, the breaking of supply chains, while leaving Frumpy to fulminate. The Press gave up on it’s constitutional responsibilities and now they complain? Fuck ‘em.",
                "Part of the issue is us the consumer. We need to be active & skeptical in the news we absorb. We need to question and research the information we believe, but that would take critical thinking skills. We do not we don’t teach that in the US.",
                "Corporate owned 'journalism' has been a massive failure. The owners have too many skeletons in their closet (how many have been to Epstein's island? We'll never know...) and too much power and wealth to lose to let their properties *actually* ever tell the full truth about anything. It hasn't been a 'free press' in a long time. \n\nNot for profit journalism must emerge from the ashes quickly. It's already happening a bit, but must accelerate if we are going to survive Trump 2.0."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "North Korea confirms troop deployment to Russia, hails 'heroes'",
            "external_url": "https://www.reuters.com/world/north-korea-confirms-troop-deployment-russia-first-time-kcna-report-2025-04-27/",
            "upvotes": 1564,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So, from my understanding the US is still Officially at war with North Korea, so now that North Korea has announced this officially, any US Citizen providing aid or Comfort to Russia while North Korea troops are in the field would technically be committing Treason.",
                "*You are all heroes! Now go heroically and pointlessly die so I can order another gold toilet!*",
                "You know you're the bad guy when N. Korea's got your back.",
                "*In the fall, Ukraine, the US and South Korea all said that North Korea, which previously had supplied weapons to Moscow, had deployed 10,000-12,000 of its troops to Russia to fight in Kursk.*\n\nA confirmation/admission of much earlier N. Korea's troop contribution to the Russian cause.",
                "They are comfortable saying this now as Russia and North Korea are buddies with Trump but enemies of America.",
                "Heroes who shat themselves and fired on their own squad when encountering drones.",
                "r/movingtonorthkorea assured me that north Korean soldiers in Ukraine were fake news though...",
                "Explains Trump's \"magical\" 180 this weekend",
                "At this point even if North Korea and a few other African countries declare war on Ukraine the west would still be making an assessment about it - whether they should be sending troops lol",
                "Putin said he wants peace, why would he do that?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Ex-New Mexico judge arrested in case involving man suspected of being a Venezuelan gang member",
            "external_url": "https://apnews.com/article/new-mexico-judge-arrested-venezuelan-gang-gun-360d4ec8ba6676fbf33abcb606c3f104",
            "upvotes": 2033,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the article: \"A former New Mexico judge has been arrested on an evidence tampering charge for allegedly destroying a phone belonging to a tenant who is accused of keeping guns at the property and suspected of being a member of a Venezuelan criminal gang.\n\nFederal authorities said in court records that former Doña Ana County Magistrate Judge Jose Luis “Joel” Cano, who was arrested Thursday, told investigators that he believed photos or videos on the device would reflect negatively on the tenant and threw away what remained of it five weeks ago after smashing it with a hammer.\n\nCano resigned last month after the state Judicial Standards Commission sought to suspend him, saying he was accused of letting three members of the Venezuelan gang Tren de Aragua live on his property in Las Cruces and have access to firearms.\"",
                "This sounds ridiculous.",
                "The narrative being presented in the article doesn't make a lot of sense to me.\n\nSo far as I'm aware there's nothing inherently illegal about shooting guns and alleged \"evidence tampering phone destruction\" seems very temporally disconnected from the other events.",
                "I dont understand how one can tamper with evidence if an investigation hasn't been formally announced or if the phone owner is not under indictment?\n\nHowever, basic legal principles doesn't seem to apply anymore when discussing the actions of these federal agencies. \n\nHowever, if he told investigators (why would he do so?) that he purposefully destroyed evidence pertaining to criminal conduct, that could be criminal misconduct I think or at the very least judicial misconduct. \n\nBut of course, being a judge and all, why would you even allow yourself to answer any questions about these people at all. Just keep your mouth shut or have a lawyer talk for you. \n\nAlso, the gun thing seems irrelevant. Unless these people are convicted felons, I dont think its illegal to give them access to firearms. Its kind of weird, but I suppose not illegal.   \n  \nI don't know, seems like a weird story but its interesting.",
                "Maybe its true but its probably not. They make fools of the public every day. You can’t believe anything the trump and his doj puts out there. They’ve routinely lied to federal judges under penalty of perjury. They will say anything at any time without regards to truth.",
                "In a court filing, Cano denied the U.S. government’s characterization of the men as gang members, saying each of them were subjected to “thorough and rigorous” proceedings with Immigration and Customs Enforcement agents when they entered the country. He said the first time he heard that they may have gang ties was the morning federal agents raided their home took the men into custody.\n\nCano said he and his wife, Nancy Cano allowed the men to stay in their spare studio apartment in April 2024. He said they told the couple that they requested asylum upon entering the U.S. in 2023, were processed by immigration officials and were then released with court dates for their requests. Cano said the men showed paperwork to back up their stories.",
                "It's not evidence tampering unless they knew there was an investigation or they knew one was going to be started.\n\n\n§ 11.440 Tampering with or fabricating physical evidence.\n\nA person commits a misdemeanor if, believing that an official proceeding or investigation is pending or about to be instituted, he or she:",
                "If everyone is a gang member, no one is.",
                "When even a former judge is accused of shielding tenants tied to a gang and destroying evidence, it raises serious questions, not just about the individuals, but about how overwhelmed or inconsistent our immigration and vetting systems have become. It's a reminder: due process matters, but so does accountability — for everyone, no matter their role",
                "It is an open attack on the judiciary."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Local Social Security offices face staffing shortages, delays due to federal budget cuts",
            "external_url": "https://cbs6albany.com/news/local/local-social-security-offices-face-staffing-shortages-delays-due-to-federal-budget-cuts",
            "upvotes": 3903,
            "date": "04/27/2025",
            "thumbnail": "https://cbs6albany.com/resources/media2/16x9/6187/986/0x323/90/bbb6c68e-dc7b-4336-b82d-0f8551aa3928-AP25045062103614.jpg",
            "top_comments": [
                "1. Cut funding for public programs that help people\n\n2. They get worse due to budget cuts\n\n3. Use the lack of productivity you directly caused as evidence of social safety nets being worthless\n\n4. Repeat",
                "Working as intended....smh",
                "But they said the cuts would have no effect on benefits.",
                "How many social security recipients voted for this?\n\nMeanwhile the laughing black lady wanted to expand Medicare to cover in-home care for our elderly.\n\nOopsie poopsie, hope y’all enjoy eating cat food.",
                "How does trump still have such a high approval rating?! It makes no goddamn sense.  His administration has just been a wildfire of awfulness through this country",
                "Both of my parents just retired. I’m the only family member left in the same area. \n\nI have a strong feeling this is going to make *my* life as difficult as it will theirs, as I do my best to handle their administrative stuff, since they’ve, uh, slowed down quite a bit. (It’s hard to accept when you see your parents reeeaaally start to age and not be able to do as much.) \n\nI’ve been thinking about this frequently since they first announced rural offices would be closing; we’re in a rural area, and access to stuff like this is already very limited.",
                "Social Security is advertising for jobs in my area. I just don't know who would leave a steady job to go work for the feds right now.",
                "Social security receiving Trump supporters. Why did Biden and the Deml do this. ",
                "Friendly reminder that Elon Musk is a traitorous Nazi. And we aren’t going to forget that now that he’s hiding back in the shadows.",
                "Starting to think \"America First!\" was a veiled threat that nobody understood."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "HOT",
            "title": "Multiple deaths in Vancouver street festival Van attack",
            "external_url": "https://www.cbc.ca/news/canada/british-columbia/vehicle-hits-crowd-filipino-festival-lapu-lapu-day-block-party-1.7519778",
            "upvotes": 19810,
            "date": "04/27/2025",
            "thumbnail": "https://i.cbc.ca/1.7519787.1745806308!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/lapu-lapu-police.jpg?im=Resize%3D620",
            "top_comments": [
                "In the pinned Vancouver thread it says that 40 people were struck. ",
                "From the police: A 30-year-old Vancouver man was arrested at the scene after driving into a crowd, killing at least 8 people, around 8:14 PM local time.",
                "We’re going to have to start putting balustrades and bollards everywhere now",
                "Vancouver hasn't had anything quite like this happen before. \n\nI think we all felt really safe + immune here, BC is such a chill place. This is horrifying.",
                "Just watched a video where they have the dude against a fence. Asian guy, doesn't seem older than 30. He was just standing there and said \"I'm sorry\" very annoyingly when being yelled at. Really can't tell what's an accident and what's intentional these days...",
                "[removed]",
                "We live in Hawai'i and my aunt flew to Vancouver last week to visit her relatives. She just contacted my mom saying she and her sister's family just witnessed this tragedy and they are currently reeling. We pray for all the victims and cannot believe something violent such as this would happen to Vancouver.",
                "This reminds me to the times when every city used to put giant pots in walking places so this kind of thing could be \"prevented\". I think it was at those times when terrorism was all time high after 11S.\n\nSad :(",
                "Local police confirmed suspect is known to them but not entirely known to what degree. Some families have yet to be contacted so details will be held out of respect. There should be another briefing Sunday morning. It’s current 1:47AM here in Vancouver",
                "I just saw a video of the aftermath on Twitter, and counted at least 7 bodies. Jesus fucking Christ. This is gonna be really really fucking bad. Fuck. It was a street festival. People should always return home safely from a street festival. Unfathomable."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "3 children who are US citizens — including one with cancer — deported with their mothers, lawyers and advocacy groups say",
            "external_url": "https://edition.cnn.com/2025/04/27/us/children-us-citizens-deported-honduras/index.html",
            "upvotes": 1103,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25021729089144.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I do not understand these american headlines, \"US citizens\" are deported? Deported where if they are US CITIZENS? English is not my first language, so am I just dumb? Or?",
                "Not deported. Kicked out illegally",
                "> “If ICE can do this to these mothers and these children, if ICE can do this to students on college campuses … none of us are safe from this kind of lawlessness,” she said.\n\nUnchecked power WILL come to bite us in the ass later",
                "\"The father then moved to give provisional custody of his two daughters to his sister-in-law, a US citizen who lives in Baton Rouge, and the mandate was notarized in Louisiana, the documents say.\"\n\nIs the father himself not a us citizen? If he is then why try to pass guardianship to his sister in law?",
                "Likely he’s getting the info from m the federal Medicaid registrar",
                "The children weren't deported. The mother was and she brought her kids with her. Should the US forcefully keep the child behind, separate them from their mother, and put them with child services? No. That would be cruel. If the mother wants to take her kids, she is allowed to.",
                "Its a jarring headline, I get that, but in all honesty people do come here while they are pregnant in order to have a so called \"anchor baby\" with the mindset that even if they are here illegally their child is a US citizen and as their parent they themselves will be safe from deportation. It cannot continue like this. It's being exploited. You need to come into the country legally. End of story."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Suspect charged with murder over Vancouver Filipino festival car ramming, police say victims were aged five to 65",
            "external_url": "https://www.cnn.com/2025/04/27/americas/canada-car-ramming-filipino-festival-intl-hnk/index.html",
            "upvotes": 167,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-27t060646z-1584350354-rc256eaf4qtw-rtrmadp-3-canada-vancouver-street-festival-crash.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "What a disgusting human …what is wrong with this world"
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "NEW",
            "title": "North Korea confirms troop deployment to Russia, hails 'heroes'",
            "external_url": "https://www.reuters.com/world/north-korea-confirms-troop-deployment-russia-first-time-kcna-report-2025-04-27/",
            "upvotes": 1570,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So, from my understanding the US is still Officially at war with North Korea, so now that North Korea has announced this officially, any US Citizen providing aid or Comfort to Russia while North Korea troops are in the field would technically be committing Treason.",
                "*You are all heroes! Now go heroically and pointlessly die so I can order another gold toilet!*",
                "You know you're the bad guy when N. Korea's got your back.",
                "*In the fall, Ukraine, the US and South Korea all said that North Korea, which previously had supplied weapons to Moscow, had deployed 10,000-12,000 of its troops to Russia to fight in Kursk.*\n\nA confirmation/admission of much earlier N. Korea's troop contribution to the Russian cause.",
                "They are comfortable saying this now as Russia and North Korea are buddies with Trump but enemies of America.",
                "Heroes who shat themselves and fired on their own squad when encountering drones.",
                "r/movingtonorthkorea assured me that north Korean soldiers in Ukraine were fake news though...",
                "Explains Trump's \"magical\" 180 this weekend",
                "At this point even if North Korea and a few other African countries declare war on Ukraine the west would still be making an assessment about it - whether they should be sending troops lol",
                "Putin said he wants peace, why would he do that?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Over 100 immigrants arrested in raid on underground Colorado nightclub where active-duty military members worked, feds say",
            "external_url": "https://www.cnn.com/2025/04/27/us/colorado-springs-ice-raid-club/index.html",
            "upvotes": 3479,
            "date": "04/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21577267-1883-9550000000002-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“Sir they’ve found the USAF Officer’s Lounge”",
                "According to the article, TdA, MS-13, AND the Hells Angels all go illegal night clubbing together. Maybe we can all learn something about tolerance and cooperation.\n\n“authorities documented drug trafficking, prostitution, and the presence of members from the Venezuelan gang Tren de Aragua, MS-13, and the Hells Angels, according to Pullen [head of Rocky Mountain DEA.]”",
                "I’m not just going to take their word for it that they’re immigrants",
                "Attorney General Pamela Bondi [posted on X ](https://x.com/AGPamBondi/status/1916515090418839624)that two people had been arrested on outstanding warrants during the raid.\n\n“Trump’s directive to make America safe again is achieving results!”\n\nIt looks more like Trump's employees, aka the military, are running crime rings to me instead. That isn't surprising considering the pay rate of the military.",
                "Colorado Springs, a deeply military city in Colorado, has heaps of MS-13 and Tren de Aragua AND Hells Angels all doing a bunch of drugs together. They put aside all their differences for a fun night out once in a while. Seems legit.",
                "A 100 immigrants?  All in one place?  Wild.  Like absolutely wild.  So wild I can't even believe it.",
                "Maybe it's just me, but I don't trust the current government's judgement on identifying gang members. For example, members of Tren de Aragua don't have gang identifying tattoos according to experts and yet they said a gay barber with two crown tattoos on his wrists, with mom and dad written beneath them, was a terrorist. They then sent him away for the rest of his life to a foreign dictator's slave labor camp. It just doesn't really add up.",
                "On the subject of active duty military personnel, since ICE seems to be looking for any excuse to deport both documented and undocumented  immigrants, regardless of criminal records, I wonder how this effects active military personnel who aren’t U.S. citizens, but still have green cards. Again, having legal status here doesn’t seem to make much difference.",
                "So basically ICE raided a nightclub, declared everyone inside terrorists and held active US military personnel at gunpoint",
                "340,000,000 people in the USA. 1,800,000 are incarcerated in the USA. I don’t feel especially safer because 100 illegal immigrants were arrested in a Colorado Springs Rave club. And what a surprise, they also found drugs. And one of Pete’s favorite, from what I’m hearing. Oh yeah, and guns, in this country!  What a shock!"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Man allegedly hid marijuana in Easter eggs across the city, posted clues to social media",
            "external_url": "https://local12.com/news/offbeat/easter-egg-marijuana-scavenger-hunt-hints-online-eggs-weed-pot-facebook-social-media-hint-picture-pictures-hid-hidden-police-search-investigation-five-drug-drugs-narcotics-dealer-selling-sell-park-parks-city-around-across?fbclid=IwZXh0bgNhZW0CMTEAAR4yYc8DWrYX0bIgzKbIsg1XPl84PybdrKUGKvLNoCTot1cmS4UyJ6dUCqDB9A_aem_x9AL9gaNBCFh-kY10ab7kw",
            "upvotes": 22323,
            "date": "04/27/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/1920/986/center/90/34125fb8-3b75-40d0-b8b0-d1f0e60e0986-weedscavengerhunt.png",
            "top_comments": [
                "When Easter lands on 4/20, this man had a calling and knew what to do.",
                "Paranoid people have been getting it wrong. There aren't any drugs in the Halloween candy, they're in the Easter eggs!",
                "God forbid men have hobbies.",
                "Where was he when I was a teen?",
                "One of the weed shops near me does this, but they hide plastic eggs with tickets redeemable for prerolls and such at their store.  Seems like a slightly less questionable way to go about it.",
                "The riddler if he was cool",
                "Give this man a key the city",
                "We've got pedophiles and fascists running our country right now, and *this* is what our judicial system is punishing? \n\nFuck that.",
                "Bro was tripping posting on FB in TX..should have just put the clues on r/treecaching...",
                "Unrelated question for Catholics: How do I nominate someone for sainthood?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "The FBI mistakenly raided their Atlanta home. Now the Supreme Court will hear their lawsuit",
            "external_url": "https://apnews.com/article/georgia-fbi-raid-supreme-court-lawsuit-9cb55aa6f45bbf02c29d84363c7c9e6f",
            "upvotes": 7726,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Oops wrong house, oops wrong house, oops wrong house, oops wrong house, oops wrong house”\n\n“Well this neighborhood is clean I really thought we would find something too”",
                "Allowing a GPS device to take you to the wrong address isn't an honest mistake. It's gross incompetence that is extraordinarily easy to avoid.\n\n\nA life and death situation and this stupid motherfuckering agent popped info into the GPS and was off to adventure time.\n\n\nNo checking Google maps or street views. No driving by the place before hand. No use of additional GPS devices by other agents involved. Nothing. Squat. Nada.\n\n\nPure laziness and idiocy that you'd hope would mean immediate handing in of any badges, and a national Do Not Hire flag for the entire team responsible.\n\n\nBut nope.",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions\n\nCorrect me if I'm wrong but isn't second-guessing law enforcement decisions like, at least 60% of a courts job",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions.\n\nI would think any patently wrong decision should absolutely be “second guessed”. Something precious has been taken from the victims, and whether or not the officers should be personally held accountable for their inarguably sloppy work, the government should absolutely provide some reasonable measure of restitution including physical damage and the opportunity for psychological counseling.",
                "So shouldn’t be long before the Supreme Court rules it’s okay to violate the 4th amendment as long as the officers were just trying their darnedest and didn’t mean to.",
                "I was kinda on the FBI's side at first, because early in the article they said they had reason to believe they had the correct house. \n\nThen they said they relied on GPS to find the house. JFC. Who hasn't been taken astray by that? Use your fvcking eyeballs to confirm. Don't cops usually do some sort of pre-raid surveillance? I can understand getting bad info and then building a case on that, might have honestly led them to a mistake... but relying on GPS is completely inexcusable here, IMO. \n\nI hope they win millions.",
                "I wonder how the Supreme Court will defy precedent to allow cops to do this more in the future. \n\nHearing their absurd justifications is always entertaining in a macabre.",
                "I executed tons of search warrants in my career. Never hit the wrong house.  This isn’t a mistake. It’s laziness and incompetence of the highest order.",
                "\"LOL, get fucked peasants.\"\n\n\\-SCOTUS to plaintiffs, 2025.",
                "> 'The courts shouldn't second guess law enforcement decisions'.\n\nThe entire point of the courts is to second guess law enforcement decisions."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "11 injured, 1 dead after shooting on North Ocean Blvd, SLED investigating: MBPD",
            "external_url": "https://wpde.com/news/local/police-investigating-after-shooting-incident-on-north-ocean-blvd-in-myrtle-beach",
            "upvotes": 839,
            "date": "04/27/2025",
            "thumbnail": "https://wpde.com/resources/media2/16x9/800/986/1x9/90/6953005f-244f-4ed6-9f99-651908232175-Image.jpg",
            "top_comments": [
                "*“Our officer saw what happened, and when he saw that an altercation was taking place and a gun was being shot, the officer responded very quickly and in my opinion, saved lives,” she said. “Last night could have been so much worse.”*\n\nAnd thus opens the tourist season in Myrtle Beach.",
                "“MYRTLE BEACH, S.C. (WPDE) — As of Sunday morning, 11 people are injured and one is dead after a shooting along the 900 block of North Ocean Boulevard on Saturday night, according to The Myrtle Beach Police Department.”",
                "Well, this would have not been known had it not been posted in this subreddit.\n\nJFC, if I had the ability to move out of this hellhole of a country, I would be more than happy to.",
                "If only there was some way to help prevent this. Damn.",
                "So just another day in America then? \n\nWe are so fucking stupid. Weapons in abundance but no help to be found for the downtrodden.",
                "No mention of whether the person the officer shot was the one doing the shooting, eh?",
                "[deleted]"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Circumcision at NYC hospital almost made baby bleed to death, parents say",
            "external_url": "https://www.cbsnews.com/newyork/news/baby-nearly-bled-to-death-circumcision-parents-say/",
            "upvotes": 15419,
            "date": "04/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/25/2607bc07-2da0-4f95-a5be-c67a4b41f989/thumbnail/1200x630/0790313b56ce710814d12de467b8523d/bisram-5p-pkg-alleged-b-wcbsdpf9-hi-res-still-00-00-5619.jpg?v=8e9dede207b29c97b32974c53e32aabc",
            "top_comments": [
                "For those who haven't read the article, child was born with heart condition. After receiving a stent, hospital asked parents if they wanted to go ahead of circ. According to parents, hospital did not warn them about increased risks of surgery in an infant with a heart condition. \n\nAnd on a personal note, I was shocked by how much pressure the docs and nurses put on us after our son was born.  Not-so-subtle but still indirect \"Are you sure?\" and ongoing discussion after we indicated \"no.\"",
                "I was born 3 months premature and my parents waited until I was around age 6 until I got circumcised. Went in for an arm surgery only to wake up with also a burning and painful peepee. Them and the doctor kept it secret from me.",
                "I have a friend who was always posting anti-circumcision stuff on her FB (this was several years ago). At first, I can’t lie, I thought it was a little weird that she was so anti, but I would always look at what she posted, and over time, I realized just how fucked up it is, and I’m with her. They should not be doing this period, much less to newborns.",
                "I'm a nurse in critical care, and have seem some truly horrific things. The only thing that ever made me feel light-headed, like I might vomit or faint, was seeing an infant circumcision during my OB rotation in school. The way that little baby screamed... Absolutely horrifying. There is no good reason for this to be a commonplace practice",
                "We could eradicate breast cancer if we did preventative mastectomies on every woman. We don't alter their secondary sexual characteristics to prevent terminal illness, altering a boy's to prevent UTIs is insane.",
                "I know someone who had to take their baby back to the hospital to have more silver nitrate applied to their infant son’s incision because it was bleeding too much still after the procedure. I just could never subject my newborn child to that kind of pain. Men are born with foreskins. All of them, with few exceptions. It’s never made any sense to me why something someone is born with and is completely normal should be removed. They serve a purpose.",
                "Elective plastic surgery within days of birth is wild.",
                "Forcing male cosmetic surgery on an infant \\*should\\* be illegal, just how it is for females. We just aren't ready for that talk as a society yet, which disappoints me considerably.",
                "Genital mutilation should be illegal",
                "Maybe don’t elect to  mutilate your newborns genitalia"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Ex-New Mexico judge arrested in case involving man suspected of being a Venezuelan gang member",
            "external_url": "https://apnews.com/article/new-mexico-judge-arrested-venezuelan-gang-gun-360d4ec8ba6676fbf33abcb606c3f104",
            "upvotes": 2038,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the article: \"A former New Mexico judge has been arrested on an evidence tampering charge for allegedly destroying a phone belonging to a tenant who is accused of keeping guns at the property and suspected of being a member of a Venezuelan criminal gang.\n\nFederal authorities said in court records that former Doña Ana County Magistrate Judge Jose Luis “Joel” Cano, who was arrested Thursday, told investigators that he believed photos or videos on the device would reflect negatively on the tenant and threw away what remained of it five weeks ago after smashing it with a hammer.\n\nCano resigned last month after the state Judicial Standards Commission sought to suspend him, saying he was accused of letting three members of the Venezuelan gang Tren de Aragua live on his property in Las Cruces and have access to firearms.\"",
                "This sounds ridiculous.",
                "The narrative being presented in the article doesn't make a lot of sense to me.\n\nSo far as I'm aware there's nothing inherently illegal about shooting guns and alleged \"evidence tampering phone destruction\" seems very temporally disconnected from the other events.",
                "I dont understand how one can tamper with evidence if an investigation hasn't been formally announced or if the phone owner is not under indictment?\n\nHowever, basic legal principles doesn't seem to apply anymore when discussing the actions of these federal agencies. \n\nHowever, if he told investigators (why would he do so?) that he purposefully destroyed evidence pertaining to criminal conduct, that could be criminal misconduct I think or at the very least judicial misconduct. \n\nBut of course, being a judge and all, why would you even allow yourself to answer any questions about these people at all. Just keep your mouth shut or have a lawyer talk for you. \n\nAlso, the gun thing seems irrelevant. Unless these people are convicted felons, I dont think its illegal to give them access to firearms. Its kind of weird, but I suppose not illegal.   \n  \nI don't know, seems like a weird story but its interesting.",
                "Maybe its true but its probably not. They make fools of the public every day. You can’t believe anything the trump and his doj puts out there. They’ve routinely lied to federal judges under penalty of perjury. They will say anything at any time without regards to truth.",
                "In a court filing, Cano denied the U.S. government’s characterization of the men as gang members, saying each of them were subjected to “thorough and rigorous” proceedings with Immigration and Customs Enforcement agents when they entered the country. He said the first time he heard that they may have gang ties was the morning federal agents raided their home took the men into custody.\n\nCano said he and his wife, Nancy Cano allowed the men to stay in their spare studio apartment in April 2024. He said they told the couple that they requested asylum upon entering the U.S. in 2023, were processed by immigration officials and were then released with court dates for their requests. Cano said the men showed paperwork to back up their stories.",
                "It's not evidence tampering unless they knew there was an investigation or they knew one was going to be started.\n\n\n§ 11.440 Tampering with or fabricating physical evidence.\n\nA person commits a misdemeanor if, believing that an official proceeding or investigation is pending or about to be instituted, he or she:",
                "If everyone is a gang member, no one is.",
                "When even a former judge is accused of shielding tenants tied to a gang and destroying evidence, it raises serious questions, not just about the individuals, but about how overwhelmed or inconsistent our immigration and vetting systems have become. It's a reminder: due process matters, but so does accountability — for everyone, no matter their role",
                "It is an open attack on the judiciary."
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "NEW",
            "title": "Journalists defend press freedom at muted White House correspondents’ dinner",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/27/white-house-correspondents-dinner",
            "upvotes": 16447,
            "date": "04/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3de87fcc8d0cd3ef43ea4e8bb3da63b41e4e45e1/0_273_8192_4918/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1439bd4aace8f904e33aee094e5efa24",
            "top_comments": [
                "I like how they cancelled the comedian and totally capitulated to Trump, just to not have him or anyone from the administration show up anyway. Sums up a lot",
                "These fuckers cancelled the comedian because they were worried about offending Trump. I won't even get into the decades of \"Both Sides Equally At Fault\" coverage that's played a material role in how the current state of affairs was arrived at. Absolutely fuck off and be better, THEN pat yourselves on the back.",
                "The media's been bothsidesing and sanewashing Trump for so long and now they wanna prate about press freedom as the monster they helped create openly cracks down on 1A rights. What a pack of useless fools, but I guess we get what we ask for.\n\nAmerica wanted to believe both sides were the same so they didn't have to pay attention and they paid people like this to tell them that, now here we are.",
                ">Journalists rallied in defence of press freedom on Saturday, insisting they “are not the enemy of the people” at [a Washington media gala](https://www.c-span.org/program/public-affairs-event/white-house-correspondents-association-dinner/658807) snubbed by Donald Trump.\n\nIt's weird the press has to make a point of not being the enemy of the people, and doubly bizarre considering who is doing the accusing.",
                "Journalists cover politics like it's red team vs blue team when the reality is Project 2025 vs the Constitution.",
                ">Alex Thompson of Axios, who won an award for coverage of Biden, silenced a room that was otherwise buzzing all night when he called out the media for failing to adequately investigate Biden’s mental acuity. The issue blew up when the 81-year-old gave a disastrous debate performance four months before the election.\n\n\nI think it's wild that this person thinks the mess up was that we just weren't hard enough on the Biden administration. Yeah, he fucked up immeasurably in how he fumbled the end of his term. Granted. The problem is not that the media didn't talk enough about Biden being old. That was literally everywhere.\n\n\nWe have a GOP that has been barreling towards authoritarianism for decades, and our media institutions have treated them as either rational thought leaders or loveable joksters while they've  torn down our communities and sold us off to wealthy donors.\n\n\nThese people sitting in their fancy ballroom and speaking to nobody but themselves is the perfect metaphor for the current value of our media institutions.",
                ">The WHCA had invited [then cancelled](https://www.theguardian.com/us-news/2025/mar/30/white-house-correspondents-dinner-cancels-comedian-appearance) comedian Amber Ruffin after she referred to the Trump administration as “kind of a bunch of murderers” and asserted that “nobody wants” Trump to attend the dinner.\n\nAh yes, the WHCA, the bastion of free speech and openness to hearing all voices",
                "The Press continues to feed the Trump beast. He spouts nonsense non-stop. Nothing makes sense. He says everything under the sun and they hang on every word. Why? Because it is so crazy it sells their news for them. Not a one has stopped featuring Frumpy’s every word because it enriches them. They could singularly focus on the deaths from loss of reproductive rights, the deportation of Americans, the breaking of supply chains, while leaving Frumpy to fulminate. The Press gave up on it’s constitutional responsibilities and now they complain? Fuck ‘em.",
                "Part of the issue is us the consumer. We need to be active & skeptical in the news we absorb. We need to question and research the information we believe, but that would take critical thinking skills. We do not we don’t teach that in the US.",
                "Corporate owned 'journalism' has been a massive failure. The owners have too many skeletons in their closet (how many have been to Epstein's island? We'll never know...) and too much power and wealth to lose to let their properties *actually* ever tell the full truth about anything. It hasn't been a 'free press' in a long time. \n\nNot for profit journalism must emerge from the ashes quickly. It's already happening a bit, but must accelerate if we are going to survive Trump 2.0."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "3 children who are US citizens — including one with cancer — deported with their mothers, lawyers and advocacy groups say",
            "external_url": "https://edition.cnn.com/2025/04/27/us/children-us-citizens-deported-honduras/index.html",
            "upvotes": 1102,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25021729089144.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I do not understand these american headlines, \"US citizens\" are deported? Deported where if they are US CITIZENS? English is not my first language, so am I just dumb? Or?",
                "Not deported. Kicked out illegally",
                "> “If ICE can do this to these mothers and these children, if ICE can do this to students on college campuses … none of us are safe from this kind of lawlessness,” she said.\n\nUnchecked power WILL come to bite us in the ass later",
                "\"The father then moved to give provisional custody of his two daughters to his sister-in-law, a US citizen who lives in Baton Rouge, and the mandate was notarized in Louisiana, the documents say.\"\n\nIs the father himself not a us citizen? If he is then why try to pass guardianship to his sister in law?",
                "Likely he’s getting the info from m the federal Medicaid registrar",
                "The children weren't deported. The mother was and she brought her kids with her. Should the US forcefully keep the child behind, separate them from their mother, and put them with child services? No. That would be cruel. If the mother wants to take her kids, she is allowed to.",
                "Its a jarring headline, I get that, but in all honesty people do come here while they are pregnant in order to have a so called \"anchor baby\" with the mindset that even if they are here illegally their child is a US citizen and as their parent they themselves will be safe from deportation. It cannot continue like this. It's being exploited. You need to come into the country legally. End of story."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "North Korea confirms troop deployment to Russia, hails 'heroes'",
            "external_url": "https://www.reuters.com/world/north-korea-confirms-troop-deployment-russia-first-time-kcna-report-2025-04-27/",
            "upvotes": 1573,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So, from my understanding the US is still Officially at war with North Korea, so now that North Korea has announced this officially, any US Citizen providing aid or Comfort to Russia while North Korea troops are in the field would technically be committing Treason.",
                "*You are all heroes! Now go heroically and pointlessly die so I can order another gold toilet!*",
                "You know you're the bad guy when N. Korea's got your back.",
                "*In the fall, Ukraine, the US and South Korea all said that North Korea, which previously had supplied weapons to Moscow, had deployed 10,000-12,000 of its troops to Russia to fight in Kursk.*\n\nA confirmation/admission of much earlier N. Korea's troop contribution to the Russian cause.",
                "They are comfortable saying this now as Russia and North Korea are buddies with Trump but enemies of America.",
                "Heroes who shat themselves and fired on their own squad when encountering drones.",
                "r/movingtonorthkorea assured me that north Korean soldiers in Ukraine were fake news though...",
                "Explains Trump's \"magical\" 180 this weekend",
                "At this point even if North Korea and a few other African countries declare war on Ukraine the west would still be making an assessment about it - whether they should be sending troops lol",
                "Putin said he wants peace, why would he do that?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "The FBI mistakenly raided their Atlanta home. Now the Supreme Court will hear their lawsuit",
            "external_url": "https://apnews.com/article/georgia-fbi-raid-supreme-court-lawsuit-9cb55aa6f45bbf02c29d84363c7c9e6f",
            "upvotes": 7719,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Oops wrong house, oops wrong house, oops wrong house, oops wrong house, oops wrong house”\n\n“Well this neighborhood is clean I really thought we would find something too”",
                "Allowing a GPS device to take you to the wrong address isn't an honest mistake. It's gross incompetence that is extraordinarily easy to avoid.\n\n\nA life and death situation and this stupid motherfuckering agent popped info into the GPS and was off to adventure time.\n\n\nNo checking Google maps or street views. No driving by the place before hand. No use of additional GPS devices by other agents involved. Nothing. Squat. Nada.\n\n\nPure laziness and idiocy that you'd hope would mean immediate handing in of any badges, and a national Do Not Hire flag for the entire team responsible.\n\n\nBut nope.",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions\n\nCorrect me if I'm wrong but isn't second-guessing law enforcement decisions like, at least 60% of a courts job",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions.\n\nI would think any patently wrong decision should absolutely be “second guessed”. Something precious has been taken from the victims, and whether or not the officers should be personally held accountable for their inarguably sloppy work, the government should absolutely provide some reasonable measure of restitution including physical damage and the opportunity for psychological counseling.",
                "So shouldn’t be long before the Supreme Court rules it’s okay to violate the 4th amendment as long as the officers were just trying their darnedest and didn’t mean to.",
                "I was kinda on the FBI's side at first, because early in the article they said they had reason to believe they had the correct house. \n\nThen they said they relied on GPS to find the house. JFC. Who hasn't been taken astray by that? Use your fvcking eyeballs to confirm. Don't cops usually do some sort of pre-raid surveillance? I can understand getting bad info and then building a case on that, might have honestly led them to a mistake... but relying on GPS is completely inexcusable here, IMO. \n\nI hope they win millions.",
                "I wonder how the Supreme Court will defy precedent to allow cops to do this more in the future. \n\nHearing their absurd justifications is always entertaining in a macabre.",
                "I executed tons of search warrants in my career. Never hit the wrong house.  This isn’t a mistake. It’s laziness and incompetence of the highest order.",
                "\"LOL, get fucked peasants.\"\n\n\\-SCOTUS to plaintiffs, 2025.",
                "> 'The courts shouldn't second guess law enforcement decisions'.\n\nThe entire point of the courts is to second guess law enforcement decisions."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Over 100 immigrants arrested in raid on underground Colorado nightclub where active-duty military members worked, feds say",
            "external_url": "https://www.cnn.com/2025/04/27/us/colorado-springs-ice-raid-club/index.html",
            "upvotes": 3482,
            "date": "04/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21577267-1883-9550000000002-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "“Sir they’ve found the USAF Officer’s Lounge”",
                "According to the article, TdA, MS-13, AND the Hells Angels all go illegal night clubbing together. Maybe we can all learn something about tolerance and cooperation.\n\n“authorities documented drug trafficking, prostitution, and the presence of members from the Venezuelan gang Tren de Aragua, MS-13, and the Hells Angels, according to Pullen [head of Rocky Mountain DEA.]”",
                "I’m not just going to take their word for it that they’re immigrants",
                "Attorney General Pamela Bondi [posted on X ](https://x.com/AGPamBondi/status/1916515090418839624)that two people had been arrested on outstanding warrants during the raid.\n\n“Trump’s directive to make America safe again is achieving results!”\n\nIt looks more like Trump's employees, aka the military, are running crime rings to me instead. That isn't surprising considering the pay rate of the military.",
                "Colorado Springs, a deeply military city in Colorado, has heaps of MS-13 and Tren de Aragua AND Hells Angels all doing a bunch of drugs together. They put aside all their differences for a fun night out once in a while. Seems legit.",
                "A 100 immigrants?  All in one place?  Wild.  Like absolutely wild.  So wild I can't even believe it.",
                "Maybe it's just me, but I don't trust the current government's judgement on identifying gang members. For example, members of Tren de Aragua don't have gang identifying tattoos according to experts and yet they said a gay barber with two crown tattoos on his wrists, with mom and dad written beneath them, was a terrorist. They then sent him away for the rest of his life to a foreign dictator's slave labor camp. It just doesn't really add up.",
                "On the subject of active duty military personnel, since ICE seems to be looking for any excuse to deport both documented and undocumented  immigrants, regardless of criminal records, I wonder how this effects active military personnel who aren’t U.S. citizens, but still have green cards. Again, having legal status here doesn’t seem to make much difference.",
                "So basically ICE raided a nightclub, declared everyone inside terrorists and held active US military personnel at gunpoint",
                "340,000,000 people in the USA. 1,800,000 are incarcerated in the USA. I don’t feel especially safer because 100 illegal immigrants were arrested in a Colorado Springs Rave club. And what a surprise, they also found drugs. And one of Pete’s favorite, from what I’m hearing. Oh yeah, and guns, in this country!  What a shock!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Man allegedly hid marijuana in Easter eggs across the city, posted clues to social media",
            "external_url": "https://local12.com/news/offbeat/easter-egg-marijuana-scavenger-hunt-hints-online-eggs-weed-pot-facebook-social-media-hint-picture-pictures-hid-hidden-police-search-investigation-five-drug-drugs-narcotics-dealer-selling-sell-park-parks-city-around-across?fbclid=IwZXh0bgNhZW0CMTEAAR4yYc8DWrYX0bIgzKbIsg1XPl84PybdrKUGKvLNoCTot1cmS4UyJ6dUCqDB9A_aem_x9AL9gaNBCFh-kY10ab7kw",
            "upvotes": 22319,
            "date": "04/27/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/1920/986/center/90/34125fb8-3b75-40d0-b8b0-d1f0e60e0986-weedscavengerhunt.png",
            "top_comments": [
                "When Easter lands on 4/20, this man had a calling and knew what to do.",
                "Paranoid people have been getting it wrong. There aren't any drugs in the Halloween candy, they're in the Easter eggs!",
                "God forbid men have hobbies.",
                "Where was he when I was a teen?",
                "One of the weed shops near me does this, but they hide plastic eggs with tickets redeemable for prerolls and such at their store.  Seems like a slightly less questionable way to go about it.",
                "The riddler if he was cool",
                "Give this man a key the city",
                "We've got pedophiles and fascists running our country right now, and *this* is what our judicial system is punishing? \n\nFuck that.",
                "Bro was tripping posting on FB in TX..should have just put the clues on r/treecaching...",
                "Unrelated question for Catholics: How do I nominate someone for sainthood?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "11 injured, 1 dead after shooting on North Ocean Blvd, SLED investigating: MBPD",
            "external_url": "https://wpde.com/news/local/police-investigating-after-shooting-incident-on-north-ocean-blvd-in-myrtle-beach",
            "upvotes": 838,
            "date": "04/27/2025",
            "thumbnail": "https://wpde.com/resources/media2/16x9/800/986/1x9/90/6953005f-244f-4ed6-9f99-651908232175-Image.jpg",
            "top_comments": [
                "*“Our officer saw what happened, and when he saw that an altercation was taking place and a gun was being shot, the officer responded very quickly and in my opinion, saved lives,” she said. “Last night could have been so much worse.”*\n\nAnd thus opens the tourist season in Myrtle Beach.",
                "“MYRTLE BEACH, S.C. (WPDE) — As of Sunday morning, 11 people are injured and one is dead after a shooting along the 900 block of North Ocean Boulevard on Saturday night, according to The Myrtle Beach Police Department.”",
                "Well, this would have not been known had it not been posted in this subreddit.\n\nJFC, if I had the ability to move out of this hellhole of a country, I would be more than happy to.",
                "If only there was some way to help prevent this. Damn.",
                "So just another day in America then? \n\nWe are so fucking stupid. Weapons in abundance but no help to be found for the downtrodden.",
                "No mention of whether the person the officer shot was the one doing the shooting, eh?",
                "[deleted]"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Circumcision at NYC hospital almost made baby bleed to death, parents say",
            "external_url": "https://www.cbsnews.com/newyork/news/baby-nearly-bled-to-death-circumcision-parents-say/",
            "upvotes": 15425,
            "date": "04/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/25/2607bc07-2da0-4f95-a5be-c67a4b41f989/thumbnail/1200x630/0790313b56ce710814d12de467b8523d/bisram-5p-pkg-alleged-b-wcbsdpf9-hi-res-still-00-00-5619.jpg?v=8e9dede207b29c97b32974c53e32aabc",
            "top_comments": [
                "For those who haven't read the article, child was born with heart condition. After receiving a stent, hospital asked parents if they wanted to go ahead of circ. According to parents, hospital did not warn them about increased risks of surgery in an infant with a heart condition. \n\nAnd on a personal note, I was shocked by how much pressure the docs and nurses put on us after our son was born.  Not-so-subtle but still indirect \"Are you sure?\" and ongoing discussion after we indicated \"no.\"",
                "I was born 3 months premature and my parents waited until I was around age 6 until I got circumcised. Went in for an arm surgery only to wake up with also a burning and painful peepee. Them and the doctor kept it secret from me.",
                "I have a friend who was always posting anti-circumcision stuff on her FB (this was several years ago). At first, I can’t lie, I thought it was a little weird that she was so anti, but I would always look at what she posted, and over time, I realized just how fucked up it is, and I’m with her. They should not be doing this period, much less to newborns.",
                "I'm a nurse in critical care, and have seem some truly horrific things. The only thing that ever made me feel light-headed, like I might vomit or faint, was seeing an infant circumcision during my OB rotation in school. The way that little baby screamed... Absolutely horrifying. There is no good reason for this to be a commonplace practice",
                "We could eradicate breast cancer if we did preventative mastectomies on every woman. We don't alter their secondary sexual characteristics to prevent terminal illness, altering a boy's to prevent UTIs is insane.",
                "I know someone who had to take their baby back to the hospital to have more silver nitrate applied to their infant son’s incision because it was bleeding too much still after the procedure. I just could never subject my newborn child to that kind of pain. Men are born with foreskins. All of them, with few exceptions. It’s never made any sense to me why something someone is born with and is completely normal should be removed. They serve a purpose.",
                "Elective plastic surgery within days of birth is wild.",
                "Forcing male cosmetic surgery on an infant \\*should\\* be illegal, just how it is for females. We just aren't ready for that talk as a society yet, which disappoints me considerably.",
                "Genital mutilation should be illegal",
                "Maybe don’t elect to  mutilate your newborns genitalia"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Journalists defend press freedom at muted White House correspondents’ dinner",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/27/white-house-correspondents-dinner",
            "upvotes": 16449,
            "date": "04/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3de87fcc8d0cd3ef43ea4e8bb3da63b41e4e45e1/0_273_8192_4918/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1439bd4aace8f904e33aee094e5efa24",
            "top_comments": [
                "I like how they cancelled the comedian and totally capitulated to Trump, just to not have him or anyone from the administration show up anyway. Sums up a lot",
                "These fuckers cancelled the comedian because they were worried about offending Trump. I won't even get into the decades of \"Both Sides Equally At Fault\" coverage that's played a material role in how the current state of affairs was arrived at. Absolutely fuck off and be better, THEN pat yourselves on the back.",
                "The media's been bothsidesing and sanewashing Trump for so long and now they wanna prate about press freedom as the monster they helped create openly cracks down on 1A rights. What a pack of useless fools, but I guess we get what we ask for.\n\nAmerica wanted to believe both sides were the same so they didn't have to pay attention and they paid people like this to tell them that, now here we are.",
                ">Journalists rallied in defence of press freedom on Saturday, insisting they “are not the enemy of the people” at [a Washington media gala](https://www.c-span.org/program/public-affairs-event/white-house-correspondents-association-dinner/658807) snubbed by Donald Trump.\n\nIt's weird the press has to make a point of not being the enemy of the people, and doubly bizarre considering who is doing the accusing.",
                "Journalists cover politics like it's red team vs blue team when the reality is Project 2025 vs the Constitution.",
                ">Alex Thompson of Axios, who won an award for coverage of Biden, silenced a room that was otherwise buzzing all night when he called out the media for failing to adequately investigate Biden’s mental acuity. The issue blew up when the 81-year-old gave a disastrous debate performance four months before the election.\n\n\nI think it's wild that this person thinks the mess up was that we just weren't hard enough on the Biden administration. Yeah, he fucked up immeasurably in how he fumbled the end of his term. Granted. The problem is not that the media didn't talk enough about Biden being old. That was literally everywhere.\n\n\nWe have a GOP that has been barreling towards authoritarianism for decades, and our media institutions have treated them as either rational thought leaders or loveable joksters while they've  torn down our communities and sold us off to wealthy donors.\n\n\nThese people sitting in their fancy ballroom and speaking to nobody but themselves is the perfect metaphor for the current value of our media institutions.",
                ">The WHCA had invited [then cancelled](https://www.theguardian.com/us-news/2025/mar/30/white-house-correspondents-dinner-cancels-comedian-appearance) comedian Amber Ruffin after she referred to the Trump administration as “kind of a bunch of murderers” and asserted that “nobody wants” Trump to attend the dinner.\n\nAh yes, the WHCA, the bastion of free speech and openness to hearing all voices",
                "The Press continues to feed the Trump beast. He spouts nonsense non-stop. Nothing makes sense. He says everything under the sun and they hang on every word. Why? Because it is so crazy it sells their news for them. Not a one has stopped featuring Frumpy’s every word because it enriches them. They could singularly focus on the deaths from loss of reproductive rights, the deportation of Americans, the breaking of supply chains, while leaving Frumpy to fulminate. The Press gave up on it’s constitutional responsibilities and now they complain? Fuck ‘em.",
                "Part of the issue is us the consumer. We need to be active & skeptical in the news we absorb. We need to question and research the information we believe, but that would take critical thinking skills. We do not we don’t teach that in the US.",
                "Corporate owned 'journalism' has been a massive failure. The owners have too many skeletons in their closet (how many have been to Epstein's island? We'll never know...) and too much power and wealth to lose to let their properties *actually* ever tell the full truth about anything. It hasn't been a 'free press' in a long time. \n\nNot for profit journalism must emerge from the ashes quickly. It's already happening a bit, but must accelerate if we are going to survive Trump 2.0."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Ex-New Mexico judge arrested in case involving man suspected of being a Venezuelan gang member",
            "external_url": "https://apnews.com/article/new-mexico-judge-arrested-venezuelan-gang-gun-360d4ec8ba6676fbf33abcb606c3f104",
            "upvotes": 2035,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the article: \"A former New Mexico judge has been arrested on an evidence tampering charge for allegedly destroying a phone belonging to a tenant who is accused of keeping guns at the property and suspected of being a member of a Venezuelan criminal gang.\n\nFederal authorities said in court records that former Doña Ana County Magistrate Judge Jose Luis “Joel” Cano, who was arrested Thursday, told investigators that he believed photos or videos on the device would reflect negatively on the tenant and threw away what remained of it five weeks ago after smashing it with a hammer.\n\nCano resigned last month after the state Judicial Standards Commission sought to suspend him, saying he was accused of letting three members of the Venezuelan gang Tren de Aragua live on his property in Las Cruces and have access to firearms.\"",
                "This sounds ridiculous.",
                "The narrative being presented in the article doesn't make a lot of sense to me.\n\nSo far as I'm aware there's nothing inherently illegal about shooting guns and alleged \"evidence tampering phone destruction\" seems very temporally disconnected from the other events.",
                "I dont understand how one can tamper with evidence if an investigation hasn't been formally announced or if the phone owner is not under indictment?\n\nHowever, basic legal principles doesn't seem to apply anymore when discussing the actions of these federal agencies. \n\nHowever, if he told investigators (why would he do so?) that he purposefully destroyed evidence pertaining to criminal conduct, that could be criminal misconduct I think or at the very least judicial misconduct. \n\nBut of course, being a judge and all, why would you even allow yourself to answer any questions about these people at all. Just keep your mouth shut or have a lawyer talk for you. \n\nAlso, the gun thing seems irrelevant. Unless these people are convicted felons, I dont think its illegal to give them access to firearms. Its kind of weird, but I suppose not illegal.   \n  \nI don't know, seems like a weird story but its interesting.",
                "Maybe its true but its probably not. They make fools of the public every day. You can’t believe anything the trump and his doj puts out there. They’ve routinely lied to federal judges under penalty of perjury. They will say anything at any time without regards to truth.",
                "In a court filing, Cano denied the U.S. government’s characterization of the men as gang members, saying each of them were subjected to “thorough and rigorous” proceedings with Immigration and Customs Enforcement agents when they entered the country. He said the first time he heard that they may have gang ties was the morning federal agents raided their home took the men into custody.\n\nCano said he and his wife, Nancy Cano allowed the men to stay in their spare studio apartment in April 2024. He said they told the couple that they requested asylum upon entering the U.S. in 2023, were processed by immigration officials and were then released with court dates for their requests. Cano said the men showed paperwork to back up their stories.",
                "It's not evidence tampering unless they knew there was an investigation or they knew one was going to be started.\n\n\n§ 11.440 Tampering with or fabricating physical evidence.\n\nA person commits a misdemeanor if, believing that an official proceeding or investigation is pending or about to be instituted, he or she:",
                "If everyone is a gang member, no one is.",
                "When even a former judge is accused of shielding tenants tied to a gang and destroying evidence, it raises serious questions, not just about the individuals, but about how overwhelmed or inconsistent our immigration and vetting systems have become. It's a reminder: due process matters, but so does accountability — for everyone, no matter their role",
                "It is an open attack on the judiciary."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Local Social Security offices face staffing shortages, delays due to federal budget cuts",
            "external_url": "https://cbs6albany.com/news/local/local-social-security-offices-face-staffing-shortages-delays-due-to-federal-budget-cuts",
            "upvotes": 3908,
            "date": "04/27/2025",
            "thumbnail": "https://cbs6albany.com/resources/media2/16x9/6187/986/0x323/90/bbb6c68e-dc7b-4336-b82d-0f8551aa3928-AP25045062103614.jpg",
            "top_comments": [
                "1. Cut funding for public programs that help people\n\n2. They get worse due to budget cuts\n\n3. Use the lack of productivity you directly caused as evidence of social safety nets being worthless\n\n4. Repeat",
                "Working as intended....smh",
                "But they said the cuts would have no effect on benefits.",
                "How many social security recipients voted for this?\n\nMeanwhile the laughing black lady wanted to expand Medicare to cover in-home care for our elderly.\n\nOopsie poopsie, hope y’all enjoy eating cat food.",
                "How does trump still have such a high approval rating?! It makes no goddamn sense.  His administration has just been a wildfire of awfulness through this country",
                "Both of my parents just retired. I’m the only family member left in the same area. \n\nI have a strong feeling this is going to make *my* life as difficult as it will theirs, as I do my best to handle their administrative stuff, since they’ve, uh, slowed down quite a bit. (It’s hard to accept when you see your parents reeeaaally start to age and not be able to do as much.) \n\nI’ve been thinking about this frequently since they first announced rural offices would be closing; we’re in a rural area, and access to stuff like this is already very limited.",
                "Social Security is advertising for jobs in my area. I just don't know who would leave a steady job to go work for the feds right now.",
                "Social security receiving Trump supporters. Why did Biden and the Deml do this. ",
                "Friendly reminder that Elon Musk is a traitorous Nazi. And we aren’t going to forget that now that he’s hiding back in the shadows.",
                "Starting to think \"America First!\" was a veiled threat that nobody understood."
            ],
            "aggregate_sentiment": 18.0
        }
    ],
    "last_updated": "04/28/2025 04:12:25 UTC"
}