{
    "posts": [
        {
            "category": "HOT",
            "title": "DOGE employees gain accounts on classified networks holding nuclear secrets",
            "external_url": "https://www.npr.org/2025/04/28/nx-s1-5378684/doge-energy-department-nuclear-secrets-access",
            "upvotes": 3535,
            "date": "04/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2400x1350+0+181/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff7%2F4e%2F1cc1562d471699f983bee6280ccf%2F49640296323-792e9026c5-o.jpg",
            "top_comments": [
                "Remember when the consequence for this was being sent to Federal, pound-you-in-the-ass Prison.\n\nSucks that we elected a convict who is so weak he cannot even prevent the crimes going on right under his nose.",
                "Just a reminder that the person ultimately responsible here is not Musk - it's Trump.\n\nIt's through Musk's 250 million to Trump, executive powers, and bullying congress - that DOGE happened.\n\nBOTH are responsible for the fiasco. Don't even get me started on the literal AI powered privacy-raping nightmare they are building in Memphis called Colossus - built on our stolen private data.",
                "Not great.\n\n> Luke Farritor, a 23-year-old former SpaceX intern and Adam Ramada, a Miami-based venture capitalist, have had accounts on the computer systems for at least two weeks, according to the sources who also have access to the networks. Prior to their work at DOGE, neither Farritor nor Ramada appear to have had experience with either nuclear weapons or handling classified information.",
                "\"Russia gains accounts on classified networks holding nuclear secrets\"",
                "Someone is giving them access to all of these systems. Like they can’t just gain access. Someone is giving it to them.",
                "\"It was Elon's thing. I never knew about it.\"\n\n-DJT at the onset of global thermonuclear war",
                "Well it won't be long until these aren't secrets anymore I'm sure.",
                "~~DOGE employees~~ **Russia** gains accounts on classified networks holding nuclear secrets",
                "I love the part where known drug users get to keep their security clearances when anyone working for a 3 letter agency or the military would be kicked out/fired and lose theirs.",
                "I swear Musk would fire a nuke just see what happens."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Military incursion imminent according to Pakistan",
            "external_url": "https://www.reuters.com/world/pakistan-defence-minister-says-military-incursion-by-india-is-imminent-2025-04-28/",
            "upvotes": 5352,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Asif said Pakistan was on high alert and that it would only use its arsenal of nuclear weapons if \"there is a direct threat to our existence\"\n\nI was not expecting them to talk about the possibility of using them, thats even more terrifying",
                "The headline has been updated for clarity:\n\n>Pakistan defence minister says military incursion **by India** is imminent\n\n(just in case anyone thought the Pakistan defence minister was announcing attack plans)",
                "Hopefully it'll be just some isolated border skirmish but we have no idea how wide a flashpoint can spread at this point. I'm actually more concerned about the water rights fight. That one can be an existential battle and with nukes on both sides, it's going to be a nail biter.",
                "There is no two countries more prepared to not nuke each other.",
                "This decade fucking sucks.",
                "Who would have thought this would happen.  2025 is definitely going into the history book as a very effed up year and we are only in april.",
                "Here's hoping it stays contained and remains conventional.",
                "Will nothing happen again?",
                "Now if this escalates into a full blown conflict that's really going to put a dent in Apple's plans to shift it's iPhone manufacturing to India.",
                "I'm so tired of witnessing historical events. Can we please just chill the fuck out?!?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Mob chased Brooklyn woman after mistaking her for protester at speech by Israeli security minister",
            "external_url": "https://apnews.com/article/itamar-bengvir-brooklyn-mob-woman-chased-090da170e8800307c54e2520320f6a2c",
            "upvotes": 17053,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Absolutely nuts \n\n> NEW YORK (AP) — A Brooklyn woman said she feared for her life as she was chased, kicked, spit at and pelted with objects by a mob of Orthodox Jewish men who mistook her as a participant in a protest against Israel’s far-right security minister.\n\n-\n\n> The woman, a neighborhood resident in her 30s, told The Associated Press she learned of the protest after hearing police helicopters over her apartment. She walked over to investigate around 10:30 p.m. but by then the protest had mostly disbursed. Not wanting to be filmed, she covered her face with a scarf.\n\n>“As soon as I pulled up my scarf, a group of 100 men came over immediately and encircled me,” said the woman, who spoke to the AP on the condition of anonymity because she feared for her safety.\n\n>‘I had nowhere to go’\n\n>“They were shouting at me, threatening to rape me, chanting ‘death to Arabs.’ I thought the police would protect me from the mob, but they did nothing to intervene,” she said.\n\n>As the chants grew in intensity, a lone police officer tried to escort her to safety. They were followed for blocks by hundreds of men and boys jeering in Hebrew and English.\n\n>Video shows two of the men kicking her in the back, another hurling a traffic cone into her head and a fourth pushing a trash can into her.\n\n>“This is America,” one of the men can be heard saying. “We got Israel. We got an Army now.”\n\n>At one point, she and the police officer were nearly cornered against a building, the video shows.\n\n>“I felt sheer terror,” the woman recalled. “I realized at that point that I couldn’t lead this mob of men to my home. I had nowhere to go. I didn’t know what to do. I was just terrified.”",
                "Remember that time in LA on miami beach with the shooting when both thought the other side were palestinians",
                "Ah yes, the pro-first amendment right of...harassing a lady because of racism",
                "Not a single arrest has been made as far as I know. This country is a fucking shithole.",
                "They saw a lone woman and zeroed in on her. Shows them for what they are...women hating bastards.\n\nFortunately that cop did what he should do, protected her. Shame there weren't other cops to assist.",
                "Holy shit after all of that she was just an innocent bystander? Imagine if that cop wasn’t there.",
                "Now picture that happening the other way around. You´d never hear the end of it, and dozens of people would have been arrested by now.",
                "The fuck is going on over there?? \n\nIf jail time isn't in all their futures then something is deeply wrong.",
                "Remember when a violent pro-Israeli mob attacked UCLA student protesters with weapons, tear gas and fireworks while police just stood back for hours?  Nothing happened then either... well, Biden condemned the pro-Palestinian protesters the following day but that was it.\n\nIt's absolutely nuts how biased this shit is. If the roles were reversed, it would be called domestic terrorism and the national guard would be activated.",
                "What they engaged in is unequivocally terrorism. Mob behavior has no place in a civilized society."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "All Joann Fabric and Craft store locations to close by end of May",
            "external_url": "https://www.live5news.com/2025/04/28/all-joann-fabric-craft-store-locations-close-by-end-may/",
            "upvotes": 2787,
            "date": "04/28/2025",
            "thumbnail": "https://gray-wcsc-prod.gtv-cdn.com/resizer/v2/XK46E4Z7JZE4ZKDB3NCY4BZIZA.jpg?auth=9d580f4daf716e14a5c7f9f6fbe3aaa51561aba9e16d90e63e3dcde6b189560f&width=1200&height=600&smart=true",
            "top_comments": [
                "Private equity ruins yet another business.",
                "Bye Joann's, you were my go to fabric and notions store. Now where am I supposed to go?",
                "Man, I used to enjoy going there with my mom.",
                "When billionaires destroy to create monopoly everything comes from Amazon.",
                "Reading they got Toys R Us’ed. Bought specifically so they can be bankrupted and their assets sold off.",
                "Their going out of business prices were worse then some stores normal prices",
                "My wife was waiting for prices to go down on sewing patterns at our local store. Patterns were listed at $20 to $30 each, and then they were brought down to about $10 each. She felt that that was still too high considering that the store was shutting down. And so she waited to see if they would bring it down further. \n\nInstead, the store dumped all the patterns into a recycling bin.\n\nI am sure that they were contractually obligated to do this. This was not a case of the store just being spiteful or wasteful.",
                "Private equity firms are fucking monsters.",
                "Are there any craft stores that aren’t super Christian now?",
                "What did that bitch do with all the money I gave her?!???? I’m so sad"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Fired Disney employee gets 3 years in prison for hacking and changing menus",
            "external_url": "https://www.ctvnews.ca/world/article/fired-disney-employee-gets-3-years-in-prison-for-hacking-and-changing-menus/",
            "upvotes": 2599,
            "date": "04/28/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/QPQ5PUNPPREEVD2MOCJTUA6D3I.JPG?smart=true&auth=89fb147e1a6f29198705ff74a468e89e29a1845510f4182eddfe4bd610a9777d&width=1200&height=630",
            "top_comments": [
                ">Scheuer hacked into Disney’s menu creation servers multiple times to manipulate and disrupt the menus, such as changing prices and adding profane language. He then made changes to the menus that “threatened public health and safety,” the complaint said, including altering allergen information to indicate certain menu items with peanuts were peanut-free, posing a fatal risk to individuals with peanut allergies.\n\nThis dude sounds like a massive edgelord.",
                "I thought that 3 years was probably way out of proportion to what was done. Then I saw that they were removing allergen information, which could potentially kill people. So yeah, fuck this guy.",
                "The price changing & general digital vandalism doesn’t seem that bad, but changing the allergens is just cruel (and certainly prison-worthy)",
                "Fucking with the megacorp, bring it on.\n\nFucking with the small people who need their jobs there, massive shit move.\n\nAltering allergen information that could cost people their lives, fuck that guy.",
                "Buzzed for Lightyears Grain Alcohol Cocktail.\n\n  \nBut seriously, don't ever screw around with allergens - dead kids don't wash away, ever.",
                "He could've killed someone with the allergen stunt. Give him ten years",
                "I thought this was gonna be a prank, but the guy altered allergen information, specifically marking items as peanut free that weren't. This is serious stuff.\n\nPlus aggravated identity theft?\n\nThis guy is dangerous.",
                "What did they hope to gain from this?",
                "Given the size of the disney restaurant traffic, it is almost for sure that he would have killed someone just based on peanut allergy alone.\n\nHe is lucky that no one is hurt (because disney stopped this in time) and they did not charge him with attempted murder.",
                "I've never considered giving someone pain of inconvenience by making intentionally false login attempts on their accounts.\n\nLook, I'm normally not that kind of person, but once in a while something comes up and that might be the exact level of petty I need."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "Temu customers in the U.S. hit with steep import charges due to tariffs",
            "external_url": "https://www.nbcnews.com/business/business-news/temu-adds-import-charge-to-orders-trump-tariffs-how-much-rcna203279",
            "upvotes": 1726,
            "date": "04/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250428-temu-app-se-927a-8efad9.jpg",
            "top_comments": [
                "[It's almost like the thing everyone predicted would happen, happened exactly as predicted.](https://www.washingtonpost.com/business/2023/08/22/trump-trade-tariffs/)",
                "This is unironically going to be where the most impact is for a lot of the MAGA types. My most die hard Trumpist family members all buy their shit off Temu.",
                "I wonder if the tariff tax is happening on SHEIN too? That’ll ruffle some feathers",
                "Showing it as an additional line item instead of a price increase is perfect. Shows the consumer WHY it's more expensive and avoids the reality that anyone who increases their price will not lower it if the tariffs are canceled. Inflation will get really bad if retailers just roll the tariff into the retail price.",
                "Between temu, shein and others, so may youtube channels are suddenly fucked.",
                "You shouldn't be buying cheap garbage from Temu anyway.  Now you can buy expensive garbage from Temu to pay for billionaire's tax cuts.  Thanks Trump?",
                "It's ok. They tell me that the tariff revenue rolling in from products people can no longer afford to buy will replace the income tax",
                "\"Shop like a billionaire\" suddenly got a whole different meaning.",
                "good.... so much of their products are simply disposable trash. I'm not anti-consumerist but shein & temu just encourage binge shopping, which is ultimately harmful for the environment. I remember seeing a documentary short where they show shiploads of used discarded fast fashion from the US & Canada being delivered to African cities, most of which just gets sent to landfills or burned.",
                "Just to clarify, who is responsible for paying the tariff again?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "ICE: ‘First-of-its-kind’ operation with local law enforcement leads to nearly 800 immigrant arrests in Florida | CNN",
            "external_url": "https://www.cnn.com/2025/04/27/us/ice-operation-first-of-its-kind-florida-hnk/index.html",
            "upvotes": 956,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gpd8gotx0aapnmi.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Were any of them citizens or otherwise illegally arrested? Are they going to get treated to full, legal due process?",
                "I'm sure that includes the CEO's in chicken plants or wherever else who hire them, right? Right?",
                "That's a lot, did they raid Mar-a-Lago or something?",
                "Ever read Ordinary Men: Reserve Police Battalion 101 and the Final Solution in Poland  by Christopher Browning?\n\n>\n\n>*Ordinary Men* is the true story of Reserve Police Battalion 101 of the German Order Police, which was responsible for mass shootings as well as round-ups of Jewish people for deportation to Nazi death camps in Poland in 1942. Browning argues that most of the men of  RPB 101 were not fanatical Nazis but, rather, ordinary middle-aged, working-class men who committed these atrocities out of a mixture of motives, including the group dynamics of conformity, deference to authority, role adaptation, and the altering of moral norms to justify their actions. Very quickly three groups emerged within the battalion: a core of eager killers, a plurality who carried out their duties reliably but without initiative, and a small minority who evaded participation in the acts of killing without diminishing the murderous efficiency of the battalion whatsoever.\n\n>While this book discusses a specific Reserve Unit during WWII, the general argument Browning makes is that most people succumb to the pressures of a group setting and commit actions they would never do of their own volition.  \n\n>*Ordinary Men* is a powerful, chilling, and important work with themes and arguments that continue to resonate today. \n\n\n\n\n\n\n\nToday, Orpo must stand for Orlando Police",
                "When we get to the end of this, and the vast majority of the illegal immigrants have been found, and none of the problems the US is facing have been fixed\n\nWhat then?\n\nWill they realize that corporate and individual greed is damning america much more significantly than any immigration issues\n\nOr will they then turn to immigrant citizens and blame them. How many taxpayers need to be victimized before it starts to click that the corporate tax evasion is the bigger drain on society",
                "Even putting aside how gross and immoral Trump’s immigration policies are, this is also evidence as to why it’s ineffective on top of it. One of the reasons he’s been targeting asylum seekers, Visa holders and students is that they’re the easiest ones to track. Even with everyone working together to grab undocumented immigrants, 800 is the best they can do because it’s so much more logistically difficult to find and target them.",
                "Ah yes the naked partisanship of it all. Under Biden, Ronald DeDipshit illegally used state taxpayer funds to traffic humans across state borders to 'own the libs' instead of do anything like work with Biden's ICE to detain such migrants and process them under the law for release, now they're acting as an extension of the Trump federal government, with DeDipshit making it perfectly clear in his socials the reason for the cooperation is partisan favor.",
                "Bolstering stats before the 100th day in office tomorrow",
                "With numbers that high, and in Florida, it’s hard to believe that Melania didn’t get picked up too.",
                "First of its kind in that they just rounded up random people regardless of legal standing or citizenship"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "3 children who are US citizens — including one with cancer — deported with their mothers, lawyers and advocacy groups say",
            "external_url": "https://edition.cnn.com/2025/04/27/us/children-us-citizens-deported-honduras/index.html",
            "upvotes": 21881,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25021729089144.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I do not understand these american headlines, \"US citizens\" are deported? Deported where if they are US CITIZENS? English is not my first language, so am I just dumb? Or?",
                "So I got a question. If the parents aren’t citizens and get deported are they just supposed to leave the kids here? Or do they get deported with the parents.",
                "\"The father then moved to give provisional custody of his two daughters to his sister-in-law, a US citizen who lives in Baton Rouge, and the mandate was notarized in Louisiana, the documents say.\"\n\nIs the father himself not a us citizen? If he is then why try to pass guardianship to his sister in law?",
                "> “If ICE can do this to these mothers and these children, if ICE can do this to students on college campuses … none of us are safe from this kind of lawlessness,” she said.\n\nUnchecked power WILL come to bite us in the ass later",
                "Remember this when they're asking for mercy",
                "Atleast they sent them with their mothers unlike last time where they just took them away and then didn't even keep track after deporting the parents. They argued in court against providing children with soap and toothpaste. Evil.",
                "Not deported. Kicked out illegally",
                "Everyone involved in deporting a small child who has stage 4 cancer…good luck with the karma that’s going to inevitably smack your ass down.",
                "I have watched this show before. It doesn't end well.",
                "“I think I’ve seen this film before, and I didn’t like the ending”"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Final autopsy results on Gene Hackman and his wife, Betsy Arakawa, reveal complex health issues",
            "external_url": "https://www.theguardian.com/film/2025/apr/28/gene-hackman-betsy-arakawa-final-autopsy-results-complex-health-issues",
            "upvotes": 705,
            "date": "04/28/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6867ae97d295517c95c9356f3e449292ddd146c2/0_129_1442_865/master/1442.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b23f6ffddf97fab838e068e65ad596f2",
            "top_comments": [
                "The idea that he does not realize she has died because of his dementia breaks my heart",
                "*Further police investigations of their grounds discovered widespread evidence of rodent infestation. Meanwhile, recently released body cam footage of the local police department’s first visit to the property suggested the couple may have struggled to keep their home under control, while a discarded plaster indicated Arakawa might have been bitten by a rodent.*\n\nThis is surprising, given their fame and financial status. I also wonder why Arakawa, given her role as Gene's medical aid, didn't call 911 when she was very sick, knowing that Gene couldn't function without her.",
                "This story is heartbreaking.",
                "I find [this article ](https://theonion.com/even-investigators-not-sure-why-they-keep-releasing-details-of-gene-hackmans-death/) more  relevant every time more information is released.",
                "The fact that I got an Orkin Pest Control ad in the middle of the comments section is fucking gross.",
                "This is the worst story.",
                "Really tragic story.\n\nI still surprises me that they didn't have *someone* checking in on them for an entire week, though, whether kids or an assistant or a visiting healthcare service.\n\nAs a single, child free guy with heart problems, dying at home alone and not being discovered for days is such a big fear. My sister-in-law and I text every day and she's got my permission to call in a wellness check if I ever go more than 8 daytime hours without responding.",
                "You would think with Hackman being such a big star they would have had caregivers in place. Or at least someone checking up on them.",
                "Revealing a complex web of conspiracy theories from the brightest minds of Facebook",
                "Nobody plans for dementia. My elderly neighbor scared my husband to death when he found her on our front porch staring through the window in the early days of the COVID lockdown. She thought her husband, who had dementia, was trying to kill her and she “escaped” through a window and crawled through the snow to our home. When I first met them a couple of years earlier they were articulate and friendly folks who seemed wealthy and I might add somewhat narcissistic. \n\nThe smell of their house was nauseating. Their dog was a filthy matted mess who looked more like a rescue off of the streets. He had pooped and peed all over the house and there were mouse droppings in their fridge. It was heart breaking and made me realize that we have to plan early before oor minds and bodies leave us in a vulnerable position. "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Large parts of Spain and Portugal hit by power outage",
            "external_url": "https://news.sky.com/story/large-parts-of-spain-and-portugal-hit-by-power-outage-13357374",
            "upvotes": 2644,
            "date": "04/28/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-madrid-outage-power_6899771.jpg?20250428130329",
            "top_comments": [
                "I confirm from Spain that light and Internet is coming back. It was great going back to 1900 xD",
                "I knew something was up when 10 out of 16 people in my online lobby simultaneously had a disconnect and didn't come back",
                "In Portugal at least it’s the entire country (continental) as far as it’s being reported. All major cities all out of power. Cell service was out for 10min after the outage but it’s back now, even if a bit iffy. \nI’ve read a lot of conflicting reports, some say it’s also affecting Germany, France, Poland and Greece.. but can’t find anything from those countrie’s press to confirm it\n\nEdit: Euronews confirming parts of France also affected.\n\nEdit2: Portuguese governament considers the possibility of it being a result of a cyberattack\n\nEdit3: No reports from Germany, Poland or Greece as previously stated. For some reason Portuguese media insisted on that but backtracked now.\n\nEdit4: islands were not affected\n\nEdit5: Portuguese islands not affected but Tenerife seems to have had issues per reports\n\nEdit6: pretty surreal to be completely out of power for 7 hours straight now. Cell service seems to be reestablishing steadily now after a few hours with no service with most operators. Some small parts of the country seem to have energy restored, essential services too. Fingers crossed!",
                "At the Lisbon airport and power appears to have come back on now. Although rental car kiosks are still offline.",
                "Hopefully the backup generators kicked in quickly in hospitals. Probably scary anyway - hopefully all backup systems were/are properly maintained.",
                "If that was a cyber attack, it would make it a frightening test run.",
                "Portugal is on total blackout. How is Spain and other countries?",
                "What caused that terrible incident?",
                "I’m in Valencia and power has been restored. It’s been down since about noon. They are bringing cities up slowly.",
                "Just highlights our worrying over reliance on such a fragile system, hope shit gets sorted ASAP! 🙏🏼"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Spain declares state of emergency after nationwide power blackout",
            "external_url": "https://www.reuters.com/world/europe/spain-declares-state-emergency-after-nationwide-power-blackout-2025-04-28/",
            "upvotes": 7,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Former Memphis officers were frustrated when they fatally beat Tyre Nichols, prosecutor says",
            "external_url": "https://www.opb.org/article/2025/04/28/former-memphis-officers-were-frustrated-when-they-fatally-beat-tyre-nichols-prosecutor-says/",
            "upvotes": 87,
            "date": "04/28/2025",
            "thumbnail": "https://opb-opb-prod.cdn.arcpublishing.com/resizer/v2/KH54EQNJC5E27HBRQKYL6WPASU.jpg?auth=a4e81017406253e04b2234a8c6c9b38e405214dfc24809544f1a8ef092453fb9&width=1200&height=675&smart=true",
            "top_comments": [
                "Oh, like you've never been upset and beaten a man to death with your coworkers. Get over yourselves.",
                "Okay. Cool. Sure I can accept that.\n\n.. It's not an excuse for murder though, so they still need to be found guilty and sentenced *like any other murderer who murdered.*",
                ">He said the officers had a duty to stop the beating but none of them did so. They were “overcome by the moment,” the prosecutor said.\n\nAh, yes. The \"overcome by the moment\" defense. The successor to the \"boy will be boys\" defense.",
                "Poor babies, murder is ok then.",
                "Oh wow yeah, we all kinda forgot about this.\n\nI wonder why.",
                ">**Hagerman said Nichols was being held by his arms by two of the officers as he was punched and kicked and hit with a police baton**. After the beating, as a severely injured Nichols sat on the ground, officers failed to tell medical personnel that Nichols had been hit in the head, the prosecutor said.\n\n>“**Nobody is going to call them monsters**,” Hagerman said. “It doesn’t take monsters to kill a man.”\n\nNo... that sounds like monsters to me.",
                "I'm frustrated but if I beat a cop to death, I go to prison",
                "I’ve been potty training my toddler for months, I’m frustrated every damn day. Nearly in tears on some. I scream into my pillow when I need to. What I don’t do is beat anyone because of it. I have emotional regulation and don’t let my frustrations boil over to violence. I’m the authority figure in this situation and my job is to peacefully navigate it, even when that feels very difficult.",
                "*Police Videos showed officers pepper-spraying Nichols and hitting him with a Taser before he ran away from the traffic stop on Jan. 7, 2023. The five officers, who are all Black, chased Nichols and caught him just steps from his home, and then beat him as he called out for his mother. The video showed the officers milling about, talking and laughing as Nichols struggled.*\n\nMaybe unnerved by Nichols' flight, but as guilty as guilt.",
                "I mean, when I get frustrated I just have a beer and play some BG3 or something, but I guess that works too."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "ICE: ‘First-of-its-kind’ operation with local law enforcement leads to nearly 800 immigrant arrests in Florida | CNN",
            "external_url": "https://www.cnn.com/2025/04/27/us/ice-operation-first-of-its-kind-florida-hnk/index.html",
            "upvotes": 971,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gpd8gotx0aapnmi.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Were any of them citizens or otherwise illegally arrested? Are they going to get treated to full, legal due process?",
                "I'm sure that includes the CEO's in chicken plants or wherever else who hire them, right? Right?",
                "That's a lot, did they raid Mar-a-Lago or something?",
                "Ever read Ordinary Men: Reserve Police Battalion 101 and the Final Solution in Poland  by Christopher Browning?\n\n>\n\n>*Ordinary Men* is the true story of Reserve Police Battalion 101 of the German Order Police, which was responsible for mass shootings as well as round-ups of Jewish people for deportation to Nazi death camps in Poland in 1942. Browning argues that most of the men of  RPB 101 were not fanatical Nazis but, rather, ordinary middle-aged, working-class men who committed these atrocities out of a mixture of motives, including the group dynamics of conformity, deference to authority, role adaptation, and the altering of moral norms to justify their actions. Very quickly three groups emerged within the battalion: a core of eager killers, a plurality who carried out their duties reliably but without initiative, and a small minority who evaded participation in the acts of killing without diminishing the murderous efficiency of the battalion whatsoever.\n\n>While this book discusses a specific Reserve Unit during WWII, the general argument Browning makes is that most people succumb to the pressures of a group setting and commit actions they would never do of their own volition.  \n\n>*Ordinary Men* is a powerful, chilling, and important work with themes and arguments that continue to resonate today. \n\n\n\n\n\n\n\nToday, Orpo must stand for Orlando Police",
                "When we get to the end of this, and the vast majority of the illegal immigrants have been found, and none of the problems the US is facing have been fixed\n\nWhat then?\n\nWill they realize that corporate and individual greed is damning america much more significantly than any immigration issues\n\nOr will they then turn to immigrant citizens and blame them. How many taxpayers need to be victimized before it starts to click that the corporate tax evasion is the bigger drain on society",
                "Even putting aside how gross and immoral Trump’s immigration policies are, this is also evidence as to why it’s ineffective on top of it. One of the reasons he’s been targeting asylum seekers, Visa holders and students is that they’re the easiest ones to track. Even with everyone working together to grab undocumented immigrants, 800 is the best they can do because it’s so much more logistically difficult to find and target them.",
                "Ah yes the naked partisanship of it all. Under Biden, Ronald DeDipshit illegally used state taxpayer funds to traffic humans across state borders to 'own the libs' instead of do anything like work with Biden's ICE to detain such migrants and process them under the law for release, now they're acting as an extension of the Trump federal government, with DeDipshit making it perfectly clear in his socials the reason for the cooperation is partisan favor.",
                "Bolstering stats before the 100th day in office tomorrow",
                "With numbers that high, and in Florida, it’s hard to believe that Melania didn’t get picked up too.",
                "First of its kind in that they just rounded up random people regardless of legal standing or citizenship"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Final autopsy results on Gene Hackman and his wife, Betsy Arakawa, reveal complex health issues",
            "external_url": "https://www.theguardian.com/film/2025/apr/28/gene-hackman-betsy-arakawa-final-autopsy-results-complex-health-issues",
            "upvotes": 704,
            "date": "04/28/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6867ae97d295517c95c9356f3e449292ddd146c2/0_129_1442_865/master/1442.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b23f6ffddf97fab838e068e65ad596f2",
            "top_comments": [
                "The idea that he does not realize she has died because of his dementia breaks my heart",
                "*Further police investigations of their grounds discovered widespread evidence of rodent infestation. Meanwhile, recently released body cam footage of the local police department’s first visit to the property suggested the couple may have struggled to keep their home under control, while a discarded plaster indicated Arakawa might have been bitten by a rodent.*\n\nThis is surprising, given their fame and financial status. I also wonder why Arakawa, given her role as Gene's medical aid, didn't call 911 when she was very sick, knowing that Gene couldn't function without her.",
                "This story is heartbreaking.",
                "I find [this article ](https://theonion.com/even-investigators-not-sure-why-they-keep-releasing-details-of-gene-hackmans-death/) more  relevant every time more information is released.",
                "The fact that I got an Orkin Pest Control ad in the middle of the comments section is fucking gross.",
                "This is the worst story.",
                "Really tragic story.\n\nI still surprises me that they didn't have *someone* checking in on them for an entire week, though, whether kids or an assistant or a visiting healthcare service.\n\nAs a single, child free guy with heart problems, dying at home alone and not being discovered for days is such a big fear. My sister-in-law and I text every day and she's got my permission to call in a wellness check if I ever go more than 8 daytime hours without responding.",
                "You would think with Hackman being such a big star they would have had caregivers in place. Or at least someone checking up on them.",
                "Revealing a complex web of conspiracy theories from the brightest minds of Facebook",
                "Nobody plans for dementia. My elderly neighbor scared my husband to death when he found her on our front porch staring through the window in the early days of the COVID lockdown. She thought her husband, who had dementia, was trying to kill her and she “escaped” through a window and crawled through the snow to our home. When I first met them a couple of years earlier they were articulate and friendly folks who seemed wealthy and I might add somewhat narcissistic. \n\nThe smell of their house was nauseating. Their dog was a filthy matted mess who looked more like a rescue off of the streets. He had pooped and peed all over the house and there were mouse droppings in their fridge. It was heart breaking and made me realize that we have to plan early before oor minds and bodies leave us in a vulnerable position. "
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "DOGE employees gain accounts on classified networks holding nuclear secrets",
            "external_url": "https://www.npr.org/2025/04/28/nx-s1-5378684/doge-energy-department-nuclear-secrets-access",
            "upvotes": 3540,
            "date": "04/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2400x1350+0+181/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff7%2F4e%2F1cc1562d471699f983bee6280ccf%2F49640296323-792e9026c5-o.jpg",
            "top_comments": [
                "Remember when the consequence for this was being sent to Federal, pound-you-in-the-ass Prison.\n\nSucks that we elected a convict who is so weak he cannot even prevent the crimes going on right under his nose.",
                "Just a reminder that the person ultimately responsible here is not Musk - it's Trump.\n\nIt's through Musk's 250 million to Trump, executive powers, and bullying congress - that DOGE happened.\n\nBOTH are responsible for the fiasco. Don't even get me started on the literal AI powered privacy-raping nightmare they are building in Memphis called Colossus - built on our stolen private data.",
                "Not great.\n\n> Luke Farritor, a 23-year-old former SpaceX intern and Adam Ramada, a Miami-based venture capitalist, have had accounts on the computer systems for at least two weeks, according to the sources who also have access to the networks. Prior to their work at DOGE, neither Farritor nor Ramada appear to have had experience with either nuclear weapons or handling classified information.",
                "\"Russia gains accounts on classified networks holding nuclear secrets\"",
                "Someone is giving them access to all of these systems. Like they can’t just gain access. Someone is giving it to them.",
                "\"It was Elon's thing. I never knew about it.\"\n\n-DJT at the onset of global thermonuclear war",
                "Well it won't be long until these aren't secrets anymore I'm sure.",
                "~~DOGE employees~~ **Russia** gains accounts on classified networks holding nuclear secrets",
                "I love the part where known drug users get to keep their security clearances when anyone working for a 3 letter agency or the military would be kicked out/fired and lose theirs.",
                "I swear Musk would fire a nuke just see what happens."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Temu customers in the U.S. hit with steep import charges due to tariffs",
            "external_url": "https://www.nbcnews.com/business/business-news/temu-adds-import-charge-to-orders-trump-tariffs-how-much-rcna203279",
            "upvotes": 1727,
            "date": "04/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250428-temu-app-se-927a-8efad9.jpg",
            "top_comments": [
                "[It's almost like the thing everyone predicted would happen, happened exactly as predicted.](https://www.washingtonpost.com/business/2023/08/22/trump-trade-tariffs/)",
                "This is unironically going to be where the most impact is for a lot of the MAGA types. My most die hard Trumpist family members all buy their shit off Temu.",
                "I wonder if the tariff tax is happening on SHEIN too? That’ll ruffle some feathers",
                "Showing it as an additional line item instead of a price increase is perfect. Shows the consumer WHY it's more expensive and avoids the reality that anyone who increases their price will not lower it if the tariffs are canceled. Inflation will get really bad if retailers just roll the tariff into the retail price.",
                "Between temu, shein and others, so may youtube channels are suddenly fucked.",
                "You shouldn't be buying cheap garbage from Temu anyway.  Now you can buy expensive garbage from Temu to pay for billionaire's tax cuts.  Thanks Trump?",
                "It's ok. They tell me that the tariff revenue rolling in from products people can no longer afford to buy will replace the income tax",
                "\"Shop like a billionaire\" suddenly got a whole different meaning.",
                "good.... so much of their products are simply disposable trash. I'm not anti-consumerist but shein & temu just encourage binge shopping, which is ultimately harmful for the environment. I remember seeing a documentary short where they show shiploads of used discarded fast fashion from the US & Canada being delivered to African cities, most of which just gets sent to landfills or burned.",
                "Just to clarify, who is responsible for paying the tariff again?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Fired Disney employee gets 3 years in prison for hacking and changing menus",
            "external_url": "https://www.ctvnews.ca/world/article/fired-disney-employee-gets-3-years-in-prison-for-hacking-and-changing-menus/",
            "upvotes": 2601,
            "date": "04/28/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/QPQ5PUNPPREEVD2MOCJTUA6D3I.JPG?smart=true&auth=89fb147e1a6f29198705ff74a468e89e29a1845510f4182eddfe4bd610a9777d&width=1200&height=630",
            "top_comments": [
                ">Scheuer hacked into Disney’s menu creation servers multiple times to manipulate and disrupt the menus, such as changing prices and adding profane language. He then made changes to the menus that “threatened public health and safety,” the complaint said, including altering allergen information to indicate certain menu items with peanuts were peanut-free, posing a fatal risk to individuals with peanut allergies.\n\nThis dude sounds like a massive edgelord.",
                "I thought that 3 years was probably way out of proportion to what was done. Then I saw that they were removing allergen information, which could potentially kill people. So yeah, fuck this guy.",
                "The price changing & general digital vandalism doesn’t seem that bad, but changing the allergens is just cruel (and certainly prison-worthy)",
                "Fucking with the megacorp, bring it on.\n\nFucking with the small people who need their jobs there, massive shit move.\n\nAltering allergen information that could cost people their lives, fuck that guy.",
                "Buzzed for Lightyears Grain Alcohol Cocktail.\n\n  \nBut seriously, don't ever screw around with allergens - dead kids don't wash away, ever.",
                "He could've killed someone with the allergen stunt. Give him ten years",
                "I thought this was gonna be a prank, but the guy altered allergen information, specifically marking items as peanut free that weren't. This is serious stuff.\n\nPlus aggravated identity theft?\n\nThis guy is dangerous.",
                "What did they hope to gain from this?",
                "Given the size of the disney restaurant traffic, it is almost for sure that he would have killed someone just based on peanut allergy alone.\n\nHe is lucky that no one is hurt (because disney stopped this in time) and they did not charge him with attempted murder.",
                "I've never considered giving someone pain of inconvenience by making intentionally false login attempts on their accounts.\n\nLook, I'm normally not that kind of person, but once in a while something comes up and that might be the exact level of petty I need."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "All Joann Fabric and Craft store locations to close by end of May",
            "external_url": "https://www.live5news.com/2025/04/28/all-joann-fabric-craft-store-locations-close-by-end-may/",
            "upvotes": 2784,
            "date": "04/28/2025",
            "thumbnail": "https://gray-wcsc-prod.gtv-cdn.com/resizer/v2/XK46E4Z7JZE4ZKDB3NCY4BZIZA.jpg?auth=9d580f4daf716e14a5c7f9f6fbe3aaa51561aba9e16d90e63e3dcde6b189560f&width=1200&height=600&smart=true",
            "top_comments": [
                "Private equity ruins yet another business.",
                "Bye Joann's, you were my go to fabric and notions store. Now where am I supposed to go?",
                "Man, I used to enjoy going there with my mom.",
                "When billionaires destroy to create monopoly everything comes from Amazon.",
                "Reading they got Toys R Us’ed. Bought specifically so they can be bankrupted and their assets sold off.",
                "Their going out of business prices were worse then some stores normal prices",
                "My wife was waiting for prices to go down on sewing patterns at our local store. Patterns were listed at $20 to $30 each, and then they were brought down to about $10 each. She felt that that was still too high considering that the store was shutting down. And so she waited to see if they would bring it down further. \n\nInstead, the store dumped all the patterns into a recycling bin.\n\nI am sure that they were contractually obligated to do this. This was not a case of the store just being spiteful or wasteful.",
                "Private equity firms are fucking monsters.",
                "Are there any craft stores that aren’t super Christian now?",
                "What did that bitch do with all the money I gave her?!???? I’m so sad"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Military incursion imminent according to Pakistan",
            "external_url": "https://www.reuters.com/world/pakistan-defence-minister-says-military-incursion-by-india-is-imminent-2025-04-28/",
            "upvotes": 5362,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Asif said Pakistan was on high alert and that it would only use its arsenal of nuclear weapons if \"there is a direct threat to our existence\"\n\nI was not expecting them to talk about the possibility of using them, thats even more terrifying",
                "The headline has been updated for clarity:\n\n>Pakistan defence minister says military incursion **by India** is imminent\n\n(just in case anyone thought the Pakistan defence minister was announcing attack plans)",
                "Hopefully it'll be just some isolated border skirmish but we have no idea how wide a flashpoint can spread at this point. I'm actually more concerned about the water rights fight. That one can be an existential battle and with nukes on both sides, it's going to be a nail biter.",
                "There is no two countries more prepared to not nuke each other.",
                "This decade fucking sucks.",
                "Who would have thought this would happen.  2025 is definitely going into the history book as a very effed up year and we are only in april.",
                "Here's hoping it stays contained and remains conventional.",
                "Will nothing happen again?",
                "Now if this escalates into a full blown conflict that's really going to put a dent in Apple's plans to shift it's iPhone manufacturing to India.",
                "I'm so tired of witnessing historical events. Can we please just chill the fuck out?!?"
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "NEW",
            "title": "1 dead in mass casualty event after boat crashes into Clearwater Ferry in Florida",
            "external_url": "https://abcnews.go.com/US/1-dead-mass-casualty-event-after-boat-crashes/story?id=121228624",
            "upvotes": 851,
            "date": "04/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/51ad0ff9-c73e-4df1-b8bd-c88816e7c300/ferry-crash-mo_1745854564230_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">\"The boat that fled the scene has been identified by another law enforcement agency,\" Clearwater PD said. However, further details about the second vessel involved in the incident have not yet been made available.\n\nFled the scene? I've never heard of a nautical hit and run outside of combat. Hope they catch them.",
                "Casualty means injuries and deaths.",
                "A \"mass casualty\" declaration is directed towards your local resources,  as a warning to get ready to receive a bunch of injured people just in case there are some, rather than a measure of the actual events.",
                "This post is becoming an ego mass casualty event.",
                "Not trying to start something, just an actual question. How is 1 dead considered a mass casualty?",
                "Sorry to nit pick, but is it a “mass casualty “ if only one person dies?",
                "Even though I know what casualty means I feel like news sources should never use that term again considering the easily confused meaning. Just say “X injured” or “Y dead”.",
                "How can it be mass casualty and 1 person dead?",
                "Let's all take back the word casualty to mean only deaths.",
                "[deleted]"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "DOGE employees gain accounts on classified networks holding nuclear secrets",
            "external_url": "https://www.npr.org/2025/04/28/nx-s1-5378684/doge-energy-department-nuclear-secrets-access",
            "upvotes": 3556,
            "date": "04/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2400x1350+0+181/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff7%2F4e%2F1cc1562d471699f983bee6280ccf%2F49640296323-792e9026c5-o.jpg",
            "top_comments": [
                "Remember when the consequence for this was being sent to Federal, pound-you-in-the-ass Prison.\n\nSucks that we elected a convict who is so weak he cannot even prevent the crimes going on right under his nose.",
                "Just a reminder that the person ultimately responsible here is not Musk - it's Trump.\n\nIt's through Musk's 250 million to Trump, executive powers, and bullying congress - that DOGE happened.\n\nBOTH are responsible for the fiasco. Don't even get me started on the literal AI powered privacy-raping nightmare they are building in Memphis called Colossus - built on our stolen private data.",
                "Not great.\n\n> Luke Farritor, a 23-year-old former SpaceX intern and Adam Ramada, a Miami-based venture capitalist, have had accounts on the computer systems for at least two weeks, according to the sources who also have access to the networks. Prior to their work at DOGE, neither Farritor nor Ramada appear to have had experience with either nuclear weapons or handling classified information.",
                "\"Russia gains accounts on classified networks holding nuclear secrets\"",
                "Someone is giving them access to all of these systems. Like they can’t just gain access. Someone is giving it to them.",
                "\"It was Elon's thing. I never knew about it.\"\n\n-DJT at the onset of global thermonuclear war",
                "Well it won't be long until these aren't secrets anymore I'm sure.",
                "~~DOGE employees~~ **Russia** gains accounts on classified networks holding nuclear secrets",
                "I love the part where known drug users get to keep their security clearances when anyone working for a 3 letter agency or the military would be kicked out/fired and lose theirs.",
                "I swear Musk would fire a nuke just see what happens."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "ICE: ‘First-of-its-kind’ operation with local law enforcement leads to nearly 800 immigrant arrests in Florida | CNN",
            "external_url": "https://www.cnn.com/2025/04/27/us/ice-operation-first-of-its-kind-florida-hnk/index.html",
            "upvotes": 967,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gpd8gotx0aapnmi.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Were any of them citizens or otherwise illegally arrested? Are they going to get treated to full, legal due process?",
                "I'm sure that includes the CEO's in chicken plants or wherever else who hire them, right? Right?",
                "That's a lot, did they raid Mar-a-Lago or something?",
                "Ever read Ordinary Men: Reserve Police Battalion 101 and the Final Solution in Poland  by Christopher Browning?\n\n>\n\n>*Ordinary Men* is the true story of Reserve Police Battalion 101 of the German Order Police, which was responsible for mass shootings as well as round-ups of Jewish people for deportation to Nazi death camps in Poland in 1942. Browning argues that most of the men of  RPB 101 were not fanatical Nazis but, rather, ordinary middle-aged, working-class men who committed these atrocities out of a mixture of motives, including the group dynamics of conformity, deference to authority, role adaptation, and the altering of moral norms to justify their actions. Very quickly three groups emerged within the battalion: a core of eager killers, a plurality who carried out their duties reliably but without initiative, and a small minority who evaded participation in the acts of killing without diminishing the murderous efficiency of the battalion whatsoever.\n\n>While this book discusses a specific Reserve Unit during WWII, the general argument Browning makes is that most people succumb to the pressures of a group setting and commit actions they would never do of their own volition.  \n\n>*Ordinary Men* is a powerful, chilling, and important work with themes and arguments that continue to resonate today. \n\n\n\n\n\n\n\nToday, Orpo must stand for Orlando Police",
                "When we get to the end of this, and the vast majority of the illegal immigrants have been found, and none of the problems the US is facing have been fixed\n\nWhat then?\n\nWill they realize that corporate and individual greed is damning america much more significantly than any immigration issues\n\nOr will they then turn to immigrant citizens and blame them. How many taxpayers need to be victimized before it starts to click that the corporate tax evasion is the bigger drain on society",
                "Even putting aside how gross and immoral Trump’s immigration policies are, this is also evidence as to why it’s ineffective on top of it. One of the reasons he’s been targeting asylum seekers, Visa holders and students is that they’re the easiest ones to track. Even with everyone working together to grab undocumented immigrants, 800 is the best they can do because it’s so much more logistically difficult to find and target them.",
                "Ah yes the naked partisanship of it all. Under Biden, Ronald DeDipshit illegally used state taxpayer funds to traffic humans across state borders to 'own the libs' instead of do anything like work with Biden's ICE to detain such migrants and process them under the law for release, now they're acting as an extension of the Trump federal government, with DeDipshit making it perfectly clear in his socials the reason for the cooperation is partisan favor.",
                "Bolstering stats before the 100th day in office tomorrow",
                "With numbers that high, and in Florida, it’s hard to believe that Melania didn’t get picked up too.",
                "First of its kind in that they just rounded up random people regardless of legal standing or citizenship"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Temu customers in the U.S. hit with steep import charges due to tariffs",
            "external_url": "https://www.nbcnews.com/business/business-news/temu-adds-import-charge-to-orders-trump-tariffs-how-much-rcna203279",
            "upvotes": 1731,
            "date": "04/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250428-temu-app-se-927a-8efad9.jpg",
            "top_comments": [
                "[It's almost like the thing everyone predicted would happen, happened exactly as predicted.](https://www.washingtonpost.com/business/2023/08/22/trump-trade-tariffs/)",
                "This is unironically going to be where the most impact is for a lot of the MAGA types. My most die hard Trumpist family members all buy their shit off Temu.",
                "I wonder if the tariff tax is happening on SHEIN too? That’ll ruffle some feathers",
                "Showing it as an additional line item instead of a price increase is perfect. Shows the consumer WHY it's more expensive and avoids the reality that anyone who increases their price will not lower it if the tariffs are canceled. Inflation will get really bad if retailers just roll the tariff into the retail price.",
                "Between temu, shein and others, so may youtube channels are suddenly fucked.",
                "You shouldn't be buying cheap garbage from Temu anyway.  Now you can buy expensive garbage from Temu to pay for billionaire's tax cuts.  Thanks Trump?",
                "It's ok. They tell me that the tariff revenue rolling in from products people can no longer afford to buy will replace the income tax",
                "\"Shop like a billionaire\" suddenly got a whole different meaning.",
                "good.... so much of their products are simply disposable trash. I'm not anti-consumerist but shein & temu just encourage binge shopping, which is ultimately harmful for the environment. I remember seeing a documentary short where they show shiploads of used discarded fast fashion from the US & Canada being delivered to African cities, most of which just gets sent to landfills or burned.",
                "Just to clarify, who is responsible for paying the tariff again?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "All Joann Fabric and Craft store locations to close by end of May",
            "external_url": "https://www.live5news.com/2025/04/28/all-joann-fabric-craft-store-locations-close-by-end-may/",
            "upvotes": 2788,
            "date": "04/28/2025",
            "thumbnail": "https://gray-wcsc-prod.gtv-cdn.com/resizer/v2/XK46E4Z7JZE4ZKDB3NCY4BZIZA.jpg?auth=9d580f4daf716e14a5c7f9f6fbe3aaa51561aba9e16d90e63e3dcde6b189560f&width=1200&height=600&smart=true",
            "top_comments": [
                "Private equity ruins yet another business.",
                "Bye Joann's, you were my go to fabric and notions store. Now where am I supposed to go?",
                "Man, I used to enjoy going there with my mom.",
                "When billionaires destroy to create monopoly everything comes from Amazon.",
                "Reading they got Toys R Us’ed. Bought specifically so they can be bankrupted and their assets sold off.",
                "Their going out of business prices were worse then some stores normal prices",
                "My wife was waiting for prices to go down on sewing patterns at our local store. Patterns were listed at $20 to $30 each, and then they were brought down to about $10 each. She felt that that was still too high considering that the store was shutting down. And so she waited to see if they would bring it down further. \n\nInstead, the store dumped all the patterns into a recycling bin.\n\nI am sure that they were contractually obligated to do this. This was not a case of the store just being spiteful or wasteful.",
                "Private equity firms are fucking monsters.",
                "Are there any craft stores that aren’t super Christian now?",
                "What did that bitch do with all the money I gave her?!???? I’m so sad"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Fired Disney employee gets 3 years in prison for hacking and changing menus",
            "external_url": "https://www.ctvnews.ca/world/article/fired-disney-employee-gets-3-years-in-prison-for-hacking-and-changing-menus/",
            "upvotes": 2602,
            "date": "04/28/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/QPQ5PUNPPREEVD2MOCJTUA6D3I.JPG?smart=true&auth=89fb147e1a6f29198705ff74a468e89e29a1845510f4182eddfe4bd610a9777d&width=1200&height=630",
            "top_comments": [
                ">Scheuer hacked into Disney’s menu creation servers multiple times to manipulate and disrupt the menus, such as changing prices and adding profane language. He then made changes to the menus that “threatened public health and safety,” the complaint said, including altering allergen information to indicate certain menu items with peanuts were peanut-free, posing a fatal risk to individuals with peanut allergies.\n\nThis dude sounds like a massive edgelord.",
                "I thought that 3 years was probably way out of proportion to what was done. Then I saw that they were removing allergen information, which could potentially kill people. So yeah, fuck this guy.",
                "The price changing & general digital vandalism doesn’t seem that bad, but changing the allergens is just cruel (and certainly prison-worthy)",
                "Fucking with the megacorp, bring it on.\n\nFucking with the small people who need their jobs there, massive shit move.\n\nAltering allergen information that could cost people their lives, fuck that guy.",
                "Buzzed for Lightyears Grain Alcohol Cocktail.\n\n  \nBut seriously, don't ever screw around with allergens - dead kids don't wash away, ever.",
                "He could've killed someone with the allergen stunt. Give him ten years",
                "I thought this was gonna be a prank, but the guy altered allergen information, specifically marking items as peanut free that weren't. This is serious stuff.\n\nPlus aggravated identity theft?\n\nThis guy is dangerous.",
                "What did they hope to gain from this?",
                "Given the size of the disney restaurant traffic, it is almost for sure that he would have killed someone just based on peanut allergy alone.\n\nHe is lucky that no one is hurt (because disney stopped this in time) and they did not charge him with attempted murder.",
                "I've never considered giving someone pain of inconvenience by making intentionally false login attempts on their accounts.\n\nLook, I'm normally not that kind of person, but once in a while something comes up and that might be the exact level of petty I need."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Military incursion imminent according to Pakistan",
            "external_url": "https://www.reuters.com/world/pakistan-defence-minister-says-military-incursion-by-india-is-imminent-2025-04-28/",
            "upvotes": 5358,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Asif said Pakistan was on high alert and that it would only use its arsenal of nuclear weapons if \"there is a direct threat to our existence\"\n\nI was not expecting them to talk about the possibility of using them, thats even more terrifying",
                "The headline has been updated for clarity:\n\n>Pakistan defence minister says military incursion **by India** is imminent\n\n(just in case anyone thought the Pakistan defence minister was announcing attack plans)",
                "Hopefully it'll be just some isolated border skirmish but we have no idea how wide a flashpoint can spread at this point. I'm actually more concerned about the water rights fight. That one can be an existential battle and with nukes on both sides, it's going to be a nail biter.",
                "There is no two countries more prepared to not nuke each other.",
                "This decade fucking sucks.",
                "Who would have thought this would happen.  2025 is definitely going into the history book as a very effed up year and we are only in april.",
                "Here's hoping it stays contained and remains conventional.",
                "Will nothing happen again?",
                "Now if this escalates into a full blown conflict that's really going to put a dent in Apple's plans to shift it's iPhone manufacturing to India.",
                "I'm so tired of witnessing historical events. Can we please just chill the fuck out?!?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Final autopsy results on Gene Hackman and his wife, Betsy Arakawa, reveal complex health issues",
            "external_url": "https://www.theguardian.com/film/2025/apr/28/gene-hackman-betsy-arakawa-final-autopsy-results-complex-health-issues",
            "upvotes": 702,
            "date": "04/28/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6867ae97d295517c95c9356f3e449292ddd146c2/0_129_1442_865/master/1442.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b23f6ffddf97fab838e068e65ad596f2",
            "top_comments": [
                "The idea that he does not realize she has died because of his dementia breaks my heart",
                "*Further police investigations of their grounds discovered widespread evidence of rodent infestation. Meanwhile, recently released body cam footage of the local police department’s first visit to the property suggested the couple may have struggled to keep their home under control, while a discarded plaster indicated Arakawa might have been bitten by a rodent.*\n\nThis is surprising, given their fame and financial status. I also wonder why Arakawa, given her role as Gene's medical aid, didn't call 911 when she was very sick, knowing that Gene couldn't function without her.",
                "This story is heartbreaking.",
                "I find [this article ](https://theonion.com/even-investigators-not-sure-why-they-keep-releasing-details-of-gene-hackmans-death/) more  relevant every time more information is released.",
                "The fact that I got an Orkin Pest Control ad in the middle of the comments section is fucking gross.",
                "This is the worst story.",
                "Really tragic story.\n\nI still surprises me that they didn't have *someone* checking in on them for an entire week, though, whether kids or an assistant or a visiting healthcare service.\n\nAs a single, child free guy with heart problems, dying at home alone and not being discovered for days is such a big fear. My sister-in-law and I text every day and she's got my permission to call in a wellness check if I ever go more than 8 daytime hours without responding.",
                "You would think with Hackman being such a big star they would have had caregivers in place. Or at least someone checking up on them.",
                "Revealing a complex web of conspiracy theories from the brightest minds of Facebook",
                "Nobody plans for dementia. My elderly neighbor scared my husband to death when he found her on our front porch staring through the window in the early days of the COVID lockdown. She thought her husband, who had dementia, was trying to kill her and she “escaped” through a window and crawled through the snow to our home. When I first met them a couple of years earlier they were articulate and friendly folks who seemed wealthy and I might add somewhat narcissistic. \n\nThe smell of their house was nauseating. Their dog was a filthy matted mess who looked more like a rescue off of the streets. He had pooped and peed all over the house and there were mouse droppings in their fridge. It was heart breaking and made me realize that we have to plan early before oor minds and bodies leave us in a vulnerable position. "
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "[CNN] Conclave to elect Pope Francis’ successor set to start on May 7, Vatican source says",
            "external_url": "https://www.cnn.com/2025/04/28/europe/conclave-start-date-intl/index.html",
            "upvotes": 1112,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-28t101618z-1483844028-rc2w6ea31ehm-rtrmadp-3-pope-succession-cardinals.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "*NFL Draft tone plays*\n\n“With the first pick of the 2025 Papal Draft, the Vatican picks…Shadeur Sanders!”",
                "Which country does Ralph Fiennes represent? 🤔 ",
                "Mel Kiper gonna Ave another meltdown ?",
                "As with US jury duty there will be some guys stretching it out solely for the free lunches.",
                "It’s a shame this isn’t televised.  Make it like Eurovision",
                "Do they use Highlander rules? Is Vance going to be pope now?",
                "Bong rips shall ensue. Hence the smoke.",
                "How does one drink for this? Is it like the Kentucky Derby where we all make hats?",
                "Has anyone swept the premises for Ewan McGregor?",
                "What if Jesus returns during the interpapal period? Are we screwed?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Large parts of Spain and Portugal hit by power outage",
            "external_url": "https://news.sky.com/story/large-parts-of-spain-and-portugal-hit-by-power-outage-13357374",
            "upvotes": 2642,
            "date": "04/28/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-madrid-outage-power_6899771.jpg?20250428130329",
            "top_comments": [
                "I confirm from Spain that light and Internet is coming back. It was great going back to 1900 xD",
                "I knew something was up when 10 out of 16 people in my online lobby simultaneously had a disconnect and didn't come back",
                "In Portugal at least it’s the entire country (continental) as far as it’s being reported. All major cities all out of power. Cell service was out for 10min after the outage but it’s back now, even if a bit iffy. \nI’ve read a lot of conflicting reports, some say it’s also affecting Germany, France, Poland and Greece.. but can’t find anything from those countrie’s press to confirm it\n\nEdit: Euronews confirming parts of France also affected.\n\nEdit2: Portuguese governament considers the possibility of it being a result of a cyberattack\n\nEdit3: No reports from Germany, Poland or Greece as previously stated. For some reason Portuguese media insisted on that but backtracked now.\n\nEdit4: islands were not affected\n\nEdit5: Portuguese islands not affected but Tenerife seems to have had issues per reports\n\nEdit6: pretty surreal to be completely out of power for 7 hours straight now. Cell service seems to be reestablishing steadily now after a few hours with no service with most operators. Some small parts of the country seem to have energy restored, essential services too. Fingers crossed!",
                "At the Lisbon airport and power appears to have come back on now. Although rental car kiosks are still offline.",
                "Hopefully the backup generators kicked in quickly in hospitals. Probably scary anyway - hopefully all backup systems were/are properly maintained.",
                "If that was a cyber attack, it would make it a frightening test run.",
                "Portugal is on total blackout. How is Spain and other countries?",
                "What caused that terrible incident?",
                "I’m in Valencia and power has been restored. It’s been down since about noon. They are bringing cities up slowly.",
                "Just highlights our worrying over reliance on such a fragile system, hope shit gets sorted ASAP! 🙏🏼"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "1 dead in mass casualty event after boat crashes into Clearwater Ferry in Florida",
            "external_url": "https://abcnews.go.com/US/1-dead-mass-casualty-event-after-boat-crashes/story?id=121228624",
            "upvotes": 851,
            "date": "04/28/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/51ad0ff9-c73e-4df1-b8bd-c88816e7c300/ferry-crash-mo_1745854564230_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">\"The boat that fled the scene has been identified by another law enforcement agency,\" Clearwater PD said. However, further details about the second vessel involved in the incident have not yet been made available.\n\nFled the scene? I've never heard of a nautical hit and run outside of combat. Hope they catch them.",
                "Casualty means injuries and deaths.",
                "A \"mass casualty\" declaration is directed towards your local resources,  as a warning to get ready to receive a bunch of injured people just in case there are some, rather than a measure of the actual events.",
                "This post is becoming an ego mass casualty event.",
                "Not trying to start something, just an actual question. How is 1 dead considered a mass casualty?",
                "Sorry to nit pick, but is it a “mass casualty “ if only one person dies?",
                "Even though I know what casualty means I feel like news sources should never use that term again considering the easily confused meaning. Just say “X injured” or “Y dead”.",
                "How can it be mass casualty and 1 person dead?",
                "Let's all take back the word casualty to mean only deaths.",
                "[deleted]"
            ],
            "aggregate_sentiment": 28.0
        }
    ],
    "last_updated": "04/28/2025 20:09:56 UTC"
}