{
    "posts": [
        {
            "category": "HOT",
            "title": "US Supreme Court orders temporary halt to deportations of Venezuelan migrants",
            "external_url": "https://www.reuters.com/world/us/venezuelan-migrants-told-imminent-deportation-under-us-wartime-law-2025-04-18/",
            "upvotes": 5293,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What are the consequences if this order is also ignored by the administration? Haven’t they been pathologically ignoring Supreme Court orders on this subject?",
                "If Trump ignores this order and the courts fail to hold his administration in contempt, the Supreme Court will have effectively lost its authority. The principle of equal but separate powers, a cornerstone of our democracy, will be dismantled.",
                "I disagree with some of the other comments here. This is the first ruling that has teeth and draws a line in the sand.\n\nThe last ruling was weakly worded, Administration will \"facilitate\" return.\n\nThis is definitive, and very, very clear.\n\n\"The Government is directed not to remove any member of the putative class of detainees from the United States until further order of this Court,\".\n\nIf the administration defies this order there is NO question about a constitutional crisis. This will one way or another cause things to come to a head.\n\nThis administration has pushed and pushed, however I think their card blanche is wearing off, and they know it. As the walked back tariffs on most of the world, and backed down from confrontations with Harvard and other Universities. Behind the scenes there is push back from the wealthy who ordered one brand of order, and got another.\n\nThey were pushing to get certain things done, and now their unified front of support is seeing cracks.\n\nI am not saying what will happen, I am saying this is pushing the line very far for some of their constitutionalist supporters and companies, that depend on the rule of law to be upheld at least at the supreme court level, even if it is bad law.",
                "This order has teeth. Very good.  Clear line in the sand.\n\nWhat I think it’s the most interesting is the time. It’s 1am on the east coast when this dropped.",
                "Thomas and Alito dissent, of course.",
                "In the middle of the night. 45 isn't going to sleep well",
                "I feel everyone is slowly realizing (which I don’t know why it has taken them so long) that if you give Trump an inch, he’ll go a mile. You have to hold firm like Harvard and now the admin is backing off of that.",
                "Of course, the c*m stains Alito and Thomas dissented.",
                "Rubber meets the road now. ",
                "Of course, Thomas and Alito dissented"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "U.S. citizen says he and his wife detained without explanation after returning from Canada",
            "external_url": "https://www.ctvnews.ca/world/article/us-citizen-says-he-and-his-wife-detained-without-explanation-after-returning-from-canada/",
            "upvotes": 15599,
            "date": "04/19/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/P25HUZOKRZAMBNG5SN3V2AA57A.jpg?smart=true&auth=aa97d049d762c0d808c2910dedf26093f2375f0a00803330ff58d783d270d319&width=1200&height=630",
            "top_comments": [
                "Sadly this is probably the explanation:\n\n“Atallah, who is originally from Lebanon”",
                "> \"I really thought things would change after this administration, when we have Mr. Trump in office, things would change to the better,\" Atallah said.\n\nWas what he said a few days ago when explaining how he was shocked by his treatment. Don't be shocked when you vote for leopards, and then they eat your face.",
                "Just as a reminder to everyone, if you are a citizen of the United States, you cannot be denied entry at the border once you have shown proof of such. You are, legally, guaranteed that right. You can of course be detained after admission, but then standard warrant rules and such apply.\n\nIn other words, what this article describes was completely illegal. I know I know, take a number, but still. Important to call it out.",
                "In a prior story about this guy, he mentioned that he expected things to improve under President Trump. Reap what you sow, buddy. \n https://www.nbcboston.com/news/politics/treated-like-a-criminal-us-citizen-says-he-was-detained-returning-from-canada/3686188/",
                "Bachir Atallah\n\ni think we found the explanation.",
                "\"While detained, Atallah said he gave CBP agents the passcode to his phone after they asked for it.\"\n\nYou should never give up your phone's passcode. Moreover, if you believe your iPhone is going to be taken away from you, click the lock button five times or hold the lock + volume up buttons down for a few seconds; this brings up the \"slide to power off\" screen but more importantly it disables biometrics (Face ID / Touch ID) until you enter the passcode once, so whoever takes the phone from you can't then unlock it by just holding it up to your face. (Try it now so you see how it works before you need it. You can cancel out of the power off screen.)\n\nPolice will ask for your passcode so they can fish for evidence of illegal activity, snoop around your private photos and posts, get a list of your friends on social media, install stuff on your phone, or make a copy of its contents. Just like nothing you say to a cop will talk him out of arresting you, giving a cop your phone's passcode isn't going to let him look through your phone and then decide to release you.",
                "Not a fan of this new America",
                "All of this is unsettling. I'm a dual Canadian/American living in the US. I'm a middle-aged white dude so you'd think I'd be okay. But, not necessarily. I got grilled totally unnecessarily (coming back into the US) last October with a rented car. The US agent was just a total jerk to me, and that's the truth. And that was in October. That feels like a different lifetime.\n\nI think my next trip back to Canada will be in the air. I'm just about done with land borders. It used to be it was an after thought to pass through a land border.  Not anymore. I completely empathize with anyone who isn't white crossing the border these days. I mean I'm nervous myself. I can't even imagine how scared they must be.\n\nAll of this is so ridiculous. I didn't vote for Trump and I knew it would be a shit show if he got elected. But. this is 1000x worse than I had feared. And I am predicting it gets way way worse yet.",
                "Don't hear a lot of John Smith's being sent into \"routine\" secondary screening",
                ">When reached by phone on Friday, Atallah said he was in Lebanon visiting family. He told CNN after his and wife’s treatment last week, he’s worried about returning to the U.S.\n\n>“I hope they don’t retaliate because I’m speaking out,” Atallah said.\n\n  \nReally worried for this guy. CBP has become so evil. Threatening a man by grabbing at your gun because he asked why he's being detained? what the fuck?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Undocumented Immigrant Faces Decades In Prison After Breaking ICE Officer's Nose During Arrest",
            "external_url": "https://www.latintimes.com/undocumented-immigrant-faces-decades-prison-after-breaking-ice-officers-nose-during-arrest-581132",
            "upvotes": 16410,
            "date": "04/18/2025",
            "thumbnail": "https://d.latintimes.com/en/full/568935/mass-teen-01292025-1.jpg",
            "top_comments": [
                "The headline says undocumented, the caption under the photo says legal U.S. status, and the article says he was here unlawfully. \n\nI know I’m not the brightest bulb in the box but which is it lol?",
                "If someone in an unmarked car, with plain clothes, attempts to abduct me under any circumstances I should have the right to defend myself. This is ridiculous",
                "I mean, how long until one of these ICE officers is shot in self defense? They’re showing up masked with no credentials. Any weirdo that wants to cosplay and harass their immigrant neighbors can buy patches and vests off the internet.",
                "Better than going to el Salvador",
                "Were they plain clothes officers in unmarked vehicles? If yes why is it a crime to fight back? They could be imposters trying to kidnap you. The terrorists want you to let your guard down so they can kidnap you in an unmarked vehicle and behead you.",
                "The ICE agent is angling to retire early on a disability pension.",
                "This is like the three strikes laws, it basically corners people so they have nothing to lose. If somebody knows they are going to Cecot, or Gitmo they are going to respond with violence.",
                "I mean, so far if you get as far as El Salvador, you’re not coming back, so why not start blastin’? \n\nThey grab you if you’re documented, undocumented, legal, naturalized, or a citizen. They grab you if they can’t find the guy they’re looking for. They refuse all attempts to get you back. They commit constant slander, claiming you’re Tren de Aragua, or MS-13 when they forget how to pronounce Tren de Aragua. \n\nAnd I have a history of dealing with ICE at the women’s shelter I worked at for years. They would threaten to arrest and rape the case workers who wouldn’t let them in. Fuck them.",
                "I can’t help but notice that the picture for the article isn’t of the ICE agent whose nose got broken.",
                "> U.S. Attorney Alina Habba in the aforementioned statement. “Those who choose to attack and assault law enforcement will continue to be met with swift and severe punishment.”\n\nBullshit. Only the people you don’t like will be punished. The ones that support you get pardoned for attacking and assaulting law enforcement."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Judge blocks administration from deporting noncitizens to 3rd countries without due process",
            "external_url": "https://abcnews.go.com/US/judge-blocks-administration-deporting-noncitizens-3rd-countries-due/story?id=120951918",
            "upvotes": 57951,
            "date": "04/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0c049aa4-fe66-4160-9209-c2f35277f952/donald-trump-1-ap-gmh-250418_1744979483649_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The courts should block the payments from the administration to the countries taking these people and they won't take them anymore.",
                "I want to know how this would be enforced\n\nBecause currently I am not seeing an active and useful enforcement vehicle of any kind in play\n\nHe’s not gonna be impeached bc republicans dont care\n\nHe’s still got massive approval among republican voters \n\nIce agents aren’t exactly gonna go for civil disobedience\n\nAnd anyone charged with a crime can be pardoned by trump and he also cannot be charged with a crime apparently\n\nSo what is the barrier here other than like decorum?",
                "And who gonna stop them from ignoring this judge? \n\nFascists only play by their own rules.",
                "**It isn't a deportation; it is an extrajudicial rendition to a 3rd party dictatorship for indefinite incarceration in cruel and unusual conditions without any recourse nor due process for the accused (All at the behest of the Executive Branch and continually paid for by the U.S. taxpayer).**\n\nCalling it a \"deportation\" is like calling attempted murder, a friendly tussle.\n\nSupporting deportations and thinking the deportations are justified, doesn't require you to agree with turning a deportation order into life imprisonment in a dictatorship, paid for with your tax dollars.\n\n>\"Defendants argue that the United States may send a deportable alien to a country not of their origin, not where an immigration judge has ordered, where they may be immediately tortured and killed, without providing that person any opportunity to tell the deporting authorities that they face grave danger or death because of such a deportation,\" Judge Murphy wrote.\n\n\\---\n\nThese aren't a deportation in any traditional sense of the word and we should not call nor acknowledge them using \"deportation.\"\n\nIt wasn't removal from the country. It was U.S. law enforcement physically handing over two hundred plus people in custody (often with a questionable basis) over to El Salvador's law enforcement to throw them in a dictator's prison camp without trial, due process, or any legal recourse, all paid for by the U.S. taxpayer.\n\nThat is what we call an extraordinary rendition, or state-sponsored kidnapping, paid for by the U.S. taxpayer.\n\nCalling it a deportation buries the lead and plays into the alt-right/this administrations' narrative. Likewise it makes it harder to explain the problem here, as it phrases the complaint as against people being sent back to their country of origin.\n\nTo be clear we aren't deporting people from the country; we are using U.S. taxpayer dollars to pay a dictator to imprison and disappear hundreds (so far) of foreign nationals from 3rd party countries at the behest of the U.S. executive branch.\n\n(Not that there are no problems with the deportations/process in general, but that is much harder to communicate.)",
                "Yeah, because that's stopped them so far.",
                "There's literally videos of people breaking into homes without a warrant. This is WAYYYYYY past a court ruling. Without ENFORCEMENT, our institutions are USELESS.",
                "Uh huh. Now fucking enforce it.",
                "The fifth amendment says no person shall be deprived of life, liberty, or property without due process of law.\n\nNot citizen. PERSON.",
                "\"All nine sitting justices of the Supreme Court of the United States, the Assistant Solicitor General of the United States, Congress, common sense, basic decency, and this Court all disagree [with the Trump admin].\"    \n\nU.S. District Judge Brian Murphy when issuing an injunction barring the administration from deporting non citizens to a country that is not their origin.   \n\nThat bit about common sense and basic decency is so true.",
                "OK, but what then?\n\nDon't get me wrong, this needs to stop, but the Trump regime seems to ignore court orders with impunity."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "US senator returns from El Salvador trip, says Abrego Garcia case is about far more than one man",
            "external_url": "https://apnews.com/article/van-hollen-abrego-garcia-el-salvador-deportation-53c7c2dc95486f5f0c4afd96dc0fb01c",
            "upvotes": 4446,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*More Democratic lawmakers have said they will fly to El Salvador to push for Abrego Garcia’s release, but the partisan pressure has yielded no results. President Donald Trump and El Salvador’s president, Nayib Bukele, have only dug in on keeping him out of the United States*\n\nT's game plan is undoubtedly to drive this case back to this Supreme Court--which will be duly pressured to reverse its original decision.",
                "\"That stance remained even after the U.S. Supreme Court called on the administration to [facilitate his return](https://apnews.com/article/supreme-court-maryland-deportation-trump-9f46dd62890befdc321ed1ab56107470).\"\n\nWow ... the supreme court did NOT \"called on\". The supreme court issued an ORDER.",
                "Why does a Republican administration so desperately need some war to fight? Can’t we just *help out citizens and residents* by doing normal shit!?!?",
                "Trump's move to being a dictator is in full view of everybody. Which Republicans will stand up when the country needs them? I won't hold my breath.",
                "Of course it's not.\n\nIt's about honoring due process in the US.\n\nWithout due process we're just Russia with extra steps.",
                "It’s for every American citizen.",
                "Just a reminder….. Most NAZI concentration camps were not actually located in Germany.",
                "Whoever is holding up the sign in the back that says \"This is what leadership looks like\" has it completely right.",
                "This is the case that decides whether you fall into dictatorship yet.",
                "I am proud of my state today."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "White House changes COVID.gov web page to page supporting lab leak theory",
            "external_url": "https://abcnews.go.com/Health/white-house-covid-web-page-page-supporting-lab/story?id=120956514",
            "upvotes": 5770,
            "date": "04/19/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f304a57c-6502-4e33-98bf-ac81930f3a40/lab-1-ht-er-250418_1745003468373_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                "Site looks like a junior high web design project",
                "What in the megalomania is that webpage header? A picture of Trump photoshopped to look thinner walking out of the words “lab leak” and a swirly signature font to write “covid 19.” This has to be AI graphic design",
                "All else aside, who the hell designed that header graphic?",
                "I’m not even opposed to the Lab Leak theory and think it’s an entirely possible, or even probable, cause of COVID.\n\nBut the presentation of this information is not dissimilar to crackhead conspiracy. Horribly unprofessional page and incredibly divisive. \n\nThey don’t know how to implement unifying (and ultimately patriotic) policy and it’s frightening",
                ">The White House has redirected [COVID.gov](http://COVID.gov) to a new landing page called \"Lab Leak: True Origins of COVID-19,\" which makes a five-point argument for the theory that COVID-19 originated from a mistaken lab leak in Wuhan, China. \n\n>The new site appears to use theories from the final report of the Republican-led Select Subcommittee on the Coronavirus Pandemic, released in December 2024. There has never been a consensus or a \"smoking gun\" to explain what started the pandemic. \n\n>The [COVID.gov](http://COVID.gov) page, as recently as last week, listed resources for testing, treatment, and vaccination against COVID-19, as well as information for Long COVID.\n\n>The five pieces of evidence put forth by the White House for the theory include the following assertions: that the \"virus possesses a biological characteristic that is *not found in nature*,\" that data shows all cases \"stem from *a single introduction into humans*,\" that \"*Wuhan is home to China's foremost SARS research lab*,\" that researchers at that research lab \"were *sick with COVID-like symptoms* in the fall of 2019,\" and that \"if there was evidence of a natural origin it would have *already surfaced.*\"\n\n>The page includes claims that government officials, including former NIAID Director Dr. Anthony Fauci, helped edit and then amplify a research paper on the origins of COVID-19 published in 2020 that supported natural origin theory.\n\nTrump attacking Fauci is nothing new, but there's a concerted effort to make definitive statements based on circumstantial evidence",
                "[Whitehouse.gov](http://Whitehouse.gov) is a satire site now",
                "I love how the white house webpage lays it all out as if he wasn't president during most of what's mentioned. - Also, why the hell is \"Covid-19\" written in script like the cover of a romance novel?",
                "Help me understand what is the government gaining with this change?\n\n\nI get that they're all for chaos and believe in the unproven things but besides appealing to their voters, what is this adding to the conversation? ",
                "This is the longest Black Mirror episode ever. Where’s the remote?",
                "The icing on the cake is that his dumb face still has to be on the page. The guy absolutely cannot stop himself from making everything about him and seeking adulation. Amazing to watch the destruction of the American experiment all because Fred Trump couldn’t hug his kids and tell them they had value outside of how much money they make."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "US Supreme Court halts deportation of Venezuelans under wartime-era law",
            "external_url": "https://www.bbc.com/news/articles/czd3rdjn81lo",
            "upvotes": 1052,
            "date": "04/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2d86/live/a2b3c120-1cf5-11f0-bead-17ff6258b15e.jpg",
            "top_comments": [
                "Thomas and Alito dissented.  I'm shocked.😒",
                "They issued an unequivocally clear ruling.  It’ll remain to be seen whether or not that ruling results in the current administration adhering to said ruling.  All evidence points to them playing stupid games and keeping doing what they have been doing, undermining the constitution.  What possible consequences can come from the Trump administration breaching this ruling, especially if Congress refuses to act?  Does this mean the US effectively becomes a dictatorship?",
                "Alleged Venezuelean. They didn't get their due process right? Or are we skipping the whole innocent until proven guilty.",
                "It is pretty telling when a stacked SCOTUS with Trump yes men can't brings themselves to fall in line to this insanity",
                "The Supreme Court and the intelligence community both sent strong signals undermining Trump’s ammunition to declare martial law.",
                "Yeah, well. The courts can't enforce anything",
                "Don't worry we'll keep appealing it and loading planes of innocent people out of the country. Remember we're all about \"Optics\", showing planes deporting innocent people and then sending our Republicons down to El Salvador to cosplay and pose in front of the same hell hole prison while swearing allegiance to Der Fuhrer...while we continue to fleece the government. We're consolidating power and daring the courts to stop us.",
                "Doesn't this order only prevent them from being deported to a \"third country\", but they could still be deported to their country of origin?\n\nOr is there so much bullshit being shot around that people, like me apparently, are going to lose some of this stuff in the noise, and this is actually them fully blocking deportations?\n\nEdit: Ah, I see now. Boasberg denied the bid, but it was taken up to the Supreme Court. Well, let's hope they don't just keep them held indefinitely in those ~~concentration camps~~ \"immigration detention centers\" Trump, et al, want built.",
                "Mutiny of the supreme court?",
                "The order that Trump used to trap these men shouldn't have been made from Day 1. Knowing that it was used three times before now, DURING WAR TIME, got me thinking that Trump has overstepped boundaries FAR too many times."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Man arrested by ICE in Massachusetts can't be moved without notice, judge rules",
            "external_url": "https://www.cbsnews.com/boston/news/new-bedford-ice-arrest-window-smashed/",
            "upvotes": 8414,
            "date": "04/18/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/15/3197e503-3de1-4513-b220-c0bde5145fce/thumbnail/1200x630/e43e0759fd51e42734c4b0d0afb4ed94/ice2.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Headline tomorrow\n\nMan arrested by ICE in Massachusetts moved without notice",
                "Aaaaand he’s (probably) been moved.",
                "People meme, but every single order like this still matters. They are still feigning innocence precisely because they don't have full support for extrajudicial action.",
                "ICE: \\*Sends him to El Salvadorian Death Camp\\* \"What are you gonna do about it, huh?\"",
                "Judges should start holding the ICE officers themselves in contempt. Throw a few of them in jail and see what happens.",
                "Okay so here me out\n\nExercise that 2A right and dress appropriately for every occasion should you have to defend yourself or\n\nBe carted off to CECOT in El Salvador, the human hen house, never to be seen again\n\nWhat a brilliant plan, the conservatives will have everyone carrying, not just them",
                "Please remember, this is the same administration that requested that the court take a recess on deciding whether to deport 239 people, and while the court was in recess, rushed those planes into the air, so they would be over international waters by the time recess was over, and then when the judge demanded that those planes stay on the ground, they said they could no longer do anything because they were already over international waters, and the judge's bench orders no longer had legal standing in international airspace.",
                "Can we start figuring out who these agents are? They deserve to have their names be public.",
                "Is one allowed to defend themselves if any entity attempts to arrest them without due cause or a warrant?",
                "These guys are Nazis.  Done sugar coating things.  These are the lunatic rejects who couldn’t get hired at a legitimate law enforcement agency (not that those are much better)."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "“Decades behind bars for Tesla vandalizers”, Says Pam Bondi",
            "external_url": "https://www.bbc.com/news/articles/c204yvv1eexo.amp",
            "upvotes": 2819,
            "date": "04/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b3f0/live/e816b740-05f3-11f0-9b8b-6f7f9efe4b54.png",
            "top_comments": [
                "The US doesn't have any laws that would allow \"decades behind bars\" for vandalism. So they'll have to prosecute it under some law not usually used for vandalism cases if that's their goal. And when they do they'll likely lose.\n\nAnd if they don't lose, that's going to send a pretty horrible message about rape, armed robbery, and all the other crimes that get punished less harshly than that. \n\nDon't get me wrong, vandalism is actually bad.  But there's no justification for punishing vandalism against Tesla motorcars more harshly than other vandalism.",
                "And what’s the going rate for rape these days, 3-5 years if any? Ah but surely property crime is domestic terrorism and deserves 20 years. What a fucking joke.",
                "And what is she saying about the kid that killed 2 in FL?",
                "Silly rabbit, you need to be found guilty of 34 felonies if you want to avoid prison.",
                "She refused to call the guy who set Joshua Shapiro's house on fire in the middle of the night by throwing moltov cocktails in it a domestic terrorist when asked point blank. Pam Bondi can go fuck herself.",
                "Pam Bondi accepted a bribe from Trump to not prosecute Trump University. How many years did she serve behind bars for that corruption?",
                "They care more about people torching teslas than mass shooters. What a backwards way of thinking. I can’t wait until the day this is over and we never have to worry about trump or his lackeys threatening, bullying, and killing people. That will be the best day in all of American history.",
                "Gonna be completely honest, I truthfully don’t give a shit about people vandalizing Teslas when they blanket pardoned the January 6th terrorists. Free game, baby.",
                "But free the J6’rs and pay them for their time incarcerated",
                "And yet breaking into the Capitol and trying to kidnap the Vice President while chanting, “Hang Mike Pence” with a gallows constructed outside is pardonable.\n\nI can’t wait to wake up from this fucking fever dream."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Video shows doctor with measles treating kids. RFK Jr later praised him as an ‘extraordinary’ healer",
            "external_url": "https://apnews.com/article/texas-measles-outbreak-rfk-jr-ben-edwards-2dd7c79d47c64ad2e6d4a4ac3c87ec1f",
            "upvotes": 347,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Spreading Nurgle’s gifts, the highest praise in RFK’s eyes.",
                "That's way past malpractice, that's reckless endangerment.\n\nEven for Texas that's cold.",
                "Go full heroic medicine. Quit washing your hands, walk around covered in blood. Kill everyone proving a contrarian point.",
                "RFK jr. Is the worm in americas brain. ",
                "Insane, let’s continue to spread measles while treating kids, the fact that his behavior is praised is insane, like things aren’t bad enough",
                "Measles is one of the most infectious diseases in the history of the world so a trained doctor should know how stupid this move is. He probably spread it to dozens of people.",
                "I remember as a kid in highschool we learned about the guy who figured out washing your hands between medical operations drastically reduced the mortality for patients. He was mocked and discredited at the time. \n\nI remember thinking how ridiculous it was that people were so shortsighted despite there being clear evidence there and thinking I'm glad that I live in a modern society. It's a shame how far some people have fallen now I'm an adult.",
                "Are we playing Typhoid Mary again?",
                "Dr Hurd Mentality has entered the chat.",
                "Sigh. My brain autocorrected this to \"video shows doctor treating kids with measles\" and thought the surprising part was that RFK was actually showing respect for science based medicine. Well, turns out, that *would* have been more surprising."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Anxiety on US college campuses as foreign students deported",
            "external_url": "https://www.bbc.com/news/articles/c20xq5nd8jeo",
            "upvotes": 59,
            "date": "04/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b21a/live/723549e0-1ca2-11f0-a455-cf1d5f751d2f.jpg",
            "top_comments": [
                "Everyone should be worried. ICE can and has detained both legal and illegals with and without criminal histories. \n\nIt’s even being enforced at my work place. We are required to report certain children (ages 10-17) to ICE. I will definitely be remembering this shit when it comes time to vote.",
                "You don’t have to break laws to lose your visa anymore — you just have to express the wrong opinion.",
                "Hopefully, this will engage them enough to pay attention to politics. An if, if there happens to be midterms,  they will vote, like they never voted before, and turn the tide for the better."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Video shows doctor with measles treating kids. RFK Jr later praised him as an ‘extraordinary’ healer",
            "external_url": "https://apnews.com/article/texas-measles-outbreak-rfk-jr-ben-edwards-2dd7c79d47c64ad2e6d4a4ac3c87ec1f",
            "upvotes": 340,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Spreading Nurgle’s gifts, the highest praise in RFK’s eyes.",
                "That's way past malpractice, that's reckless endangerment.\n\nEven for Texas that's cold.",
                "Go full heroic medicine. Quit washing your hands, walk around covered in blood. Kill everyone proving a contrarian point.",
                "RFK jr. Is the worm in americas brain. ",
                "Insane, let’s continue to spread measles while treating kids, the fact that his behavior is praised is insane, like things aren’t bad enough",
                "Measles is one of the most infectious diseases in the history of the world so a trained doctor should know how stupid this move is. He probably spread it to dozens of people.",
                "I remember as a kid in highschool we learned about the guy who figured out washing your hands between medical operations drastically reduced the mortality for patients. He was mocked and discredited at the time. \n\nI remember thinking how ridiculous it was that people were so shortsighted despite there being clear evidence there and thinking I'm glad that I live in a modern society. It's a shame how far some people have fallen now I'm an adult.",
                "Are we playing Typhoid Mary again?",
                "Dr Hurd Mentality has entered the chat.",
                "Sigh. My brain autocorrected this to \"video shows doctor treating kids with measles\" and thought the surprising part was that RFK was actually showing respect for science based medicine. Well, turns out, that *would* have been more surprising."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Deadly E. coli outbreak went unpublicized by FDA despite affecting 15 states",
            "external_url": "https://www.fox5atlanta.com/news/deadly-e-coli-outbreak-went-unpublicized-fda-despite-affecting-15-states-report",
            "upvotes": 24,
            "date": "04/18/2025",
            "thumbnail": "https://images.foxtv.com/static.livenowfox.com/www.livenowfox.com/content/uploads/2025/04/1280/720/romaine-lettuce.jpg?ve=1&tl=1",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Supreme Court blocks, for now, new deportations under 18th century wartime law",
            "external_url": "https://apnews.com/article/aclu-trump-deport-venezuelans-supreme-court-5d85ffec44fca7c267315b34cec9ddb2",
            "upvotes": 23,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Iran, U.S. to hold talks in Rome in bid to reach nuclear deal",
            "external_url": "https://www.thehindu.com/news/international/iran-us-nuclear-deal-talk-second-round-rome-updates/article69467231.ece",
            "upvotes": 21,
            "date": "04/19/2025",
            "thumbnail": "https://th-i.thgim.com/public/incoming/z082t3/article69467237.ece/alternates/LANDSCAPE_1200/2025-04-18T113509Z_964560688_RC2B0EAR4BOX_RTRMADP_3_IRAN-NUCLEAR-RUSSIA.JPG",
            "top_comments": [
                "We did have a deal with Iran, but Trump threw it away 8 years ago because he’s an orange 🤡",
                "For a president who doesn't negotiate with terrorist, he certainly has a way of recognizing North Korea, Russia, and now Iran.",
                "They’ll reach a deal equivalent or, most likely, worse than the one he ripped up and claim a win.",
                "How long till Trump finds out this one is hard too, and walks away?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "US Supreme Court halts deportation of Venezuelans under wartime-era law",
            "external_url": "https://www.bbc.com/news/articles/czd3rdjn81lo",
            "upvotes": 1052,
            "date": "04/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2d86/live/a2b3c120-1cf5-11f0-bead-17ff6258b15e.jpg",
            "top_comments": [
                "Thomas and Alito dissented.  I'm shocked.😒",
                "They issued an unequivocally clear ruling.  It’ll remain to be seen whether or not that ruling results in the current administration adhering to said ruling.  All evidence points to them playing stupid games and keeping doing what they have been doing, undermining the constitution.  What possible consequences can come from the Trump administration breaching this ruling, especially if Congress refuses to act?  Does this mean the US effectively becomes a dictatorship?",
                "Alleged Venezuelean. They didn't get their due process right? Or are we skipping the whole innocent until proven guilty.",
                "It is pretty telling when a stacked SCOTUS with Trump yes men can't brings themselves to fall in line to this insanity",
                "The Supreme Court and the intelligence community both sent strong signals undermining Trump’s ammunition to declare martial law.",
                "Yeah, well. The courts can't enforce anything",
                "Don't worry we'll keep appealing it and loading planes of innocent people out of the country. Remember we're all about \"Optics\", showing planes deporting innocent people and then sending our Republicons down to El Salvador to cosplay and pose in front of the same hell hole prison while swearing allegiance to Der Fuhrer...while we continue to fleece the government. We're consolidating power and daring the courts to stop us.",
                "Doesn't this order only prevent them from being deported to a \"third country\", but they could still be deported to their country of origin?\n\nOr is there so much bullshit being shot around that people, like me apparently, are going to lose some of this stuff in the noise, and this is actually them fully blocking deportations?\n\nEdit: Ah, I see now. Boasberg denied the bid, but it was taken up to the Supreme Court. Well, let's hope they don't just keep them held indefinitely in those ~~concentration camps~~ \"immigration detention centers\" Trump, et al, want built.",
                "Mutiny of the supreme court?",
                "The order that Trump used to trap these men shouldn't have been made from Day 1. Knowing that it was used three times before now, DURING WAR TIME, got me thinking that Trump has overstepped boundaries FAR too many times."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Families displaced after fatal house explosion",
            "external_url": "https://www.bbc.com/news/articles/cx27n8g70deo",
            "upvotes": 33,
            "date": "04/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/faa7/live/9f0459c0-1bad-11f0-986e-ef151aa9adb2.png",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US Supreme Court orders temporary halt to deportations of Venezuelan migrants",
            "external_url": "https://www.reuters.com/world/us/venezuelan-migrants-told-imminent-deportation-under-us-wartime-law-2025-04-18/",
            "upvotes": 5292,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What are the consequences if this order is also ignored by the administration? Haven’t they been pathologically ignoring Supreme Court orders on this subject?",
                "If Trump ignores this order and the courts fail to hold his administration in contempt, the Supreme Court will have effectively lost its authority. The principle of equal but separate powers, a cornerstone of our democracy, will be dismantled.",
                "I disagree with some of the other comments here. This is the first ruling that has teeth and draws a line in the sand.\n\nThe last ruling was weakly worded, Administration will \"facilitate\" return.\n\nThis is definitive, and very, very clear.\n\n\"The Government is directed not to remove any member of the putative class of detainees from the United States until further order of this Court,\".\n\nIf the administration defies this order there is NO question about a constitutional crisis. This will one way or another cause things to come to a head.\n\nThis administration has pushed and pushed, however I think their card blanche is wearing off, and they know it. As the walked back tariffs on most of the world, and backed down from confrontations with Harvard and other Universities. Behind the scenes there is push back from the wealthy who ordered one brand of order, and got another.\n\nThey were pushing to get certain things done, and now their unified front of support is seeing cracks.\n\nI am not saying what will happen, I am saying this is pushing the line very far for some of their constitutionalist supporters and companies, that depend on the rule of law to be upheld at least at the supreme court level, even if it is bad law.",
                "This order has teeth. Very good.  Clear line in the sand.\n\nWhat I think it’s the most interesting is the time. It’s 1am on the east coast when this dropped.",
                "Thomas and Alito dissent, of course.",
                "In the middle of the night. 45 isn't going to sleep well",
                "I feel everyone is slowly realizing (which I don’t know why it has taken them so long) that if you give Trump an inch, he’ll go a mile. You have to hold firm like Harvard and now the admin is backing off of that.",
                "Of course, the c*m stains Alito and Thomas dissented.",
                "Rubber meets the road now. ",
                "Of course, Thomas and Alito dissented"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Toothpaste widely contaminated with lead and other metals, US research finds",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/17/toothpaste-lead-heavy-metals?CMP=Share_iOSApp_Other",
            "upvotes": 0,
            "date": "04/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/fa093e1da0f9c7e61c7610c698762497026ae1f1/0_183_4287_2572/master/4287.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=794e77b59c00f8ff511e1d7f0c3fb1a8",
            "top_comments": [
                "Check the sourcing. It's not a great or reputable scientific journal. It was paid for by a company that is selling their own brand of toothpaste. The Guardian should've disclosed the commercial conflict of interest in the text of the story.",
                "Oh, \"Lead Safe Mama\" is the source and considered US research? Wtf is even happening right now? How did we fall so far, so fast?",
                "Lead is everywhere, it’s in the soil, it’s in our vegetables. Just the presence of lead in minute but detectable amounts really isn’t news.\n\n> The FDA’s current lead limit for fluoride-free toothpastes is 10,000 ppb, and 20,000 ppb for fluoride toothpastes. None exceeded the FDA limits.\n\nThe real story is if those thresholds are reasonable or if the Washington state threshold of 1,000 ppb is more appropriate.",
                "So what you’re saying is brushing your teeth is metal? Brutal!",
                "I implore everyone to take a look at Lead Safe Mama's website and take in the influx of ads and fear campaigns to push her own products and affiliate links. \n\nThis is the same person that maintains RICE is full of dangerous amounts of lead and cadmium and shouldn't be consumed.\n\nThese results are being intentionally misrepresented and this person should not be considered a reliable source by any measure.",
                "Truthfully, this isn’t going to change my use of toothpaste. Basically every product has been villainized at this point. As a consumer, I’m exhausted. All this shit is also so seeped in fake wellness altruism, wellness industry scams, and misinformation about modern medicine and longevity science.",
                "So, basically every consumer good is contaminated with heavy metals or plastic, covered in plastic, or off gasses toxic fumes? I've seen dozens of similar articles over the last month saying something else is toxic. \n\nJust yesterday I read one saying that mattresses off gas toxic shit. This morning I learned most receipts are toxic to handle over long periods.",
                "I'm a dentist...great more shit to deal with",
                "Yall mofos better not even think about becoming anti-paste, I draw the line at bad breath",
                "Read this as I was brushing my teeth, wonderful"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "“Decades behind bars for Tesla vandalizers”, Says Pam Bondi",
            "external_url": "https://www.bbc.com/news/articles/c204yvv1eexo.amp",
            "upvotes": 2814,
            "date": "04/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b3f0/live/e816b740-05f3-11f0-9b8b-6f7f9efe4b54.png",
            "top_comments": [
                "The US doesn't have any laws that would allow \"decades behind bars\" for vandalism. So they'll have to prosecute it under some law not usually used for vandalism cases if that's their goal. And when they do they'll likely lose.\n\nAnd if they don't lose, that's going to send a pretty horrible message about rape, armed robbery, and all the other crimes that get punished less harshly than that. \n\nDon't get me wrong, vandalism is actually bad.  But there's no justification for punishing vandalism against Tesla motorcars more harshly than other vandalism.",
                "And what’s the going rate for rape these days, 3-5 years if any? Ah but surely property crime is domestic terrorism and deserves 20 years. What a fucking joke.",
                "And what is she saying about the kid that killed 2 in FL?",
                "Silly rabbit, you need to be found guilty of 34 felonies if you want to avoid prison.",
                "She refused to call the guy who set Joshua Shapiro's house on fire in the middle of the night by throwing moltov cocktails in it a domestic terrorist when asked point blank. Pam Bondi can go fuck herself.",
                "Pam Bondi accepted a bribe from Trump to not prosecute Trump University. How many years did she serve behind bars for that corruption?",
                "They care more about people torching teslas than mass shooters. What a backwards way of thinking. I can’t wait until the day this is over and we never have to worry about trump or his lackeys threatening, bullying, and killing people. That will be the best day in all of American history.",
                "Gonna be completely honest, I truthfully don’t give a shit about people vandalizing Teslas when they blanket pardoned the January 6th terrorists. Free game, baby.",
                "But free the J6’rs and pay them for their time incarcerated",
                "And yet breaking into the Capitol and trying to kidnap the Vice President while chanting, “Hang Mike Pence” with a gallows constructed outside is pardonable.\n\nI can’t wait to wake up from this fucking fever dream."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Video shows doctor with measles treating kids. RFK Jr later praised him as an ‘extraordinary’ healer",
            "external_url": "https://apnews.com/article/texas-measles-outbreak-rfk-jr-ben-edwards-2dd7c79d47c64ad2e6d4a4ac3c87ec1f",
            "upvotes": 339,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Spreading Nurgle’s gifts, the highest praise in RFK’s eyes.",
                "That's way past malpractice, that's reckless endangerment.\n\nEven for Texas that's cold.",
                "Go full heroic medicine. Quit washing your hands, walk around covered in blood. Kill everyone proving a contrarian point.",
                "RFK jr. Is the worm in americas brain. ",
                "Insane, let’s continue to spread measles while treating kids, the fact that his behavior is praised is insane, like things aren’t bad enough",
                "Measles is one of the most infectious diseases in the history of the world so a trained doctor should know how stupid this move is. He probably spread it to dozens of people.",
                "I remember as a kid in highschool we learned about the guy who figured out washing your hands between medical operations drastically reduced the mortality for patients. He was mocked and discredited at the time. \n\nI remember thinking how ridiculous it was that people were so shortsighted despite there being clear evidence there and thinking I'm glad that I live in a modern society. It's a shame how far some people have fallen now I'm an adult.",
                "Are we playing Typhoid Mary again?",
                "Dr Hurd Mentality has entered the chat.",
                "Sigh. My brain autocorrected this to \"video shows doctor treating kids with measles\" and thought the surprising part was that RFK was actually showing respect for science based medicine. Well, turns out, that *would* have been more surprising."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "US Supreme Court halts deportation of Venezuelans under wartime-era law",
            "external_url": "https://www.bbc.com/news/articles/czd3rdjn81lo",
            "upvotes": 1051,
            "date": "04/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2d86/live/a2b3c120-1cf5-11f0-bead-17ff6258b15e.jpg",
            "top_comments": [
                "Thomas and Alito dissented.  I'm shocked.😒",
                "They issued an unequivocally clear ruling.  It’ll remain to be seen whether or not that ruling results in the current administration adhering to said ruling.  All evidence points to them playing stupid games and keeping doing what they have been doing, undermining the constitution.  What possible consequences can come from the Trump administration breaching this ruling, especially if Congress refuses to act?  Does this mean the US effectively becomes a dictatorship?",
                "Alleged Venezuelean. They didn't get their due process right? Or are we skipping the whole innocent until proven guilty.",
                "It is pretty telling when a stacked SCOTUS with Trump yes men can't brings themselves to fall in line to this insanity",
                "The Supreme Court and the intelligence community both sent strong signals undermining Trump’s ammunition to declare martial law.",
                "Yeah, well. The courts can't enforce anything",
                "Don't worry we'll keep appealing it and loading planes of innocent people out of the country. Remember we're all about \"Optics\", showing planes deporting innocent people and then sending our Republicons down to El Salvador to cosplay and pose in front of the same hell hole prison while swearing allegiance to Der Fuhrer...while we continue to fleece the government. We're consolidating power and daring the courts to stop us.",
                "Doesn't this order only prevent them from being deported to a \"third country\", but they could still be deported to their country of origin?\n\nOr is there so much bullshit being shot around that people, like me apparently, are going to lose some of this stuff in the noise, and this is actually them fully blocking deportations?\n\nEdit: Ah, I see now. Boasberg denied the bid, but it was taken up to the Supreme Court. Well, let's hope they don't just keep them held indefinitely in those ~~concentration camps~~ \"immigration detention centers\" Trump, et al, want built.",
                "Mutiny of the supreme court?",
                "The order that Trump used to trap these men shouldn't have been made from Day 1. Knowing that it was used three times before now, DURING WAR TIME, got me thinking that Trump has overstepped boundaries FAR too many times."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US Supreme Court orders temporary halt to deportations of Venezuelan migrants",
            "external_url": "https://www.reuters.com/world/us/venezuelan-migrants-told-imminent-deportation-under-us-wartime-law-2025-04-18/",
            "upvotes": 5293,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What are the consequences if this order is also ignored by the administration? Haven’t they been pathologically ignoring Supreme Court orders on this subject?",
                "If Trump ignores this order and the courts fail to hold his administration in contempt, the Supreme Court will have effectively lost its authority. The principle of equal but separate powers, a cornerstone of our democracy, will be dismantled.",
                "I disagree with some of the other comments here. This is the first ruling that has teeth and draws a line in the sand.\n\nThe last ruling was weakly worded, Administration will \"facilitate\" return.\n\nThis is definitive, and very, very clear.\n\n\"The Government is directed not to remove any member of the putative class of detainees from the United States until further order of this Court,\".\n\nIf the administration defies this order there is NO question about a constitutional crisis. This will one way or another cause things to come to a head.\n\nThis administration has pushed and pushed, however I think their card blanche is wearing off, and they know it. As the walked back tariffs on most of the world, and backed down from confrontations with Harvard and other Universities. Behind the scenes there is push back from the wealthy who ordered one brand of order, and got another.\n\nThey were pushing to get certain things done, and now their unified front of support is seeing cracks.\n\nI am not saying what will happen, I am saying this is pushing the line very far for some of their constitutionalist supporters and companies, that depend on the rule of law to be upheld at least at the supreme court level, even if it is bad law.",
                "This order has teeth. Very good.  Clear line in the sand.\n\nWhat I think it’s the most interesting is the time. It’s 1am on the east coast when this dropped.",
                "Thomas and Alito dissent, of course.",
                "In the middle of the night. 45 isn't going to sleep well",
                "I feel everyone is slowly realizing (which I don’t know why it has taken them so long) that if you give Trump an inch, he’ll go a mile. You have to hold firm like Harvard and now the admin is backing off of that.",
                "Of course, the c*m stains Alito and Thomas dissented.",
                "Rubber meets the road now. ",
                "Of course, Thomas and Alito dissented"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "US senator returns from El Salvador trip, says Abrego Garcia case is about far more than one man",
            "external_url": "https://apnews.com/article/van-hollen-abrego-garcia-el-salvador-deportation-53c7c2dc95486f5f0c4afd96dc0fb01c",
            "upvotes": 4447,
            "date": "04/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*More Democratic lawmakers have said they will fly to El Salvador to push for Abrego Garcia’s release, but the partisan pressure has yielded no results. President Donald Trump and El Salvador’s president, Nayib Bukele, have only dug in on keeping him out of the United States*\n\nT's game plan is undoubtedly to drive this case back to this Supreme Court--which will be duly pressured to reverse its original decision.",
                "\"That stance remained even after the U.S. Supreme Court called on the administration to [facilitate his return](https://apnews.com/article/supreme-court-maryland-deportation-trump-9f46dd62890befdc321ed1ab56107470).\"\n\nWow ... the supreme court did NOT \"called on\". The supreme court issued an ORDER.",
                "Why does a Republican administration so desperately need some war to fight? Can’t we just *help out citizens and residents* by doing normal shit!?!?",
                "Trump's move to being a dictator is in full view of everybody. Which Republicans will stand up when the country needs them? I won't hold my breath.",
                "Of course it's not.\n\nIt's about honoring due process in the US.\n\nWithout due process we're just Russia with extra steps.",
                "It’s for every American citizen.",
                "Just a reminder….. Most NAZI concentration camps were not actually located in Germany.",
                "Whoever is holding up the sign in the back that says \"This is what leadership looks like\" has it completely right.",
                "This is the case that decides whether you fall into dictatorship yet.",
                "I am proud of my state today."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Russia sentences 19-year-old woman to nearly three years in a penal colony after poetic anti-war protest | CNN",
            "external_url": "https://www.cnn.com/2025/04/18/europe/darya-kozyreva-russia-penal-colony-war-protest-intl-latam/index.html",
            "upvotes": 1611,
            "date": "04/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-04-18t133533z-372888836-rc2a0eak3wdb-rtrmadp-3-ukraine-crisis-russia-court.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Coming soon to a state near you.",
                "Our administration wouldn't recognize poetry if it slapped them across the face, so we should be safe.",
                "*Oh bury me, then rise ye up\nAnd break your heavy chains\nAnd water with the tyrants’ blood \nThe freedom you have gained,*\n\n\nBrave woman, standing on principle. If everyone, or even just enough people, were like her, tyranny would be impossible.",
                "Trump: Write that down! Write that down!",
                "I hope I have her character once things get that bad here",
                "If anybody doesn't think the same thing can happen here in the US under the Trump administration they are kidding themselves.",
                "Sebastian Gorka wants the same for Americans in America.",
                "How long until Amerika starts to do the same under the despot tRump?",
                "Well now they've brought more attention to her poem.",
                "I can only have the deepest respect and admiration for brave people like her, and the many others who put their own interests aside to stand against injustice.\n\nFrom the article:\nDarya Kozyreva was arrested on February 24, 2024, after she glued a verse by Ukrainian poet Taras Shevchenko onto his monument in St Petersburg, according to OVD-Info, an independent Russian human rights group."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "U.S. citizen says he and his wife detained without explanation after returning from Canada",
            "external_url": "https://www.ctvnews.ca/world/article/us-citizen-says-he-and-his-wife-detained-without-explanation-after-returning-from-canada/",
            "upvotes": 15602,
            "date": "04/19/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/P25HUZOKRZAMBNG5SN3V2AA57A.jpg?smart=true&auth=aa97d049d762c0d808c2910dedf26093f2375f0a00803330ff58d783d270d319&width=1200&height=630",
            "top_comments": [
                "Sadly this is probably the explanation:\n\n“Atallah, who is originally from Lebanon”",
                "> \"I really thought things would change after this administration, when we have Mr. Trump in office, things would change to the better,\" Atallah said.\n\nWas what he said a few days ago when explaining how he was shocked by his treatment. Don't be shocked when you vote for leopards, and then they eat your face.",
                "Just as a reminder to everyone, if you are a citizen of the United States, you cannot be denied entry at the border once you have shown proof of such. You are, legally, guaranteed that right. You can of course be detained after admission, but then standard warrant rules and such apply.\n\nIn other words, what this article describes was completely illegal. I know I know, take a number, but still. Important to call it out.",
                "In a prior story about this guy, he mentioned that he expected things to improve under President Trump. Reap what you sow, buddy. \n https://www.nbcboston.com/news/politics/treated-like-a-criminal-us-citizen-says-he-was-detained-returning-from-canada/3686188/",
                "Bachir Atallah\n\ni think we found the explanation.",
                "\"While detained, Atallah said he gave CBP agents the passcode to his phone after they asked for it.\"\n\nYou should never give up your phone's passcode. Moreover, if you believe your iPhone is going to be taken away from you, click the lock button five times or hold the lock + volume up buttons down for a few seconds; this brings up the \"slide to power off\" screen but more importantly it disables biometrics (Face ID / Touch ID) until you enter the passcode once, so whoever takes the phone from you can't then unlock it by just holding it up to your face. (Try it now so you see how it works before you need it. You can cancel out of the power off screen.)\n\nPolice will ask for your passcode so they can fish for evidence of illegal activity, snoop around your private photos and posts, get a list of your friends on social media, install stuff on your phone, or make a copy of its contents. Just like nothing you say to a cop will talk him out of arresting you, giving a cop your phone's passcode isn't going to let him look through your phone and then decide to release you.",
                "Not a fan of this new America",
                "All of this is unsettling. I'm a dual Canadian/American living in the US. I'm a middle-aged white dude so you'd think I'd be okay. But, not necessarily. I got grilled totally unnecessarily (coming back into the US) last October with a rented car. The US agent was just a total jerk to me, and that's the truth. And that was in October. That feels like a different lifetime.\n\nI think my next trip back to Canada will be in the air. I'm just about done with land borders. It used to be it was an after thought to pass through a land border.  Not anymore. I completely empathize with anyone who isn't white crossing the border these days. I mean I'm nervous myself. I can't even imagine how scared they must be.\n\nAll of this is so ridiculous. I didn't vote for Trump and I knew it would be a shit show if he got elected. But. this is 1000x worse than I had feared. And I am predicting it gets way way worse yet.",
                "Don't hear a lot of John Smith's being sent into \"routine\" secondary screening",
                ">When reached by phone on Friday, Atallah said he was in Lebanon visiting family. He told CNN after his and wife’s treatment last week, he’s worried about returning to the U.S.\n\n>“I hope they don’t retaliate because I’m speaking out,” Atallah said.\n\n  \nReally worried for this guy. CBP has become so evil. Threatening a man by grabbing at your gun because he asked why he's being detained? what the fuck?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "“Decades behind bars for Tesla vandalizers”, Says Pam Bondi",
            "external_url": "https://www.bbc.com/news/articles/c204yvv1eexo.amp",
            "upvotes": 2819,
            "date": "04/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b3f0/live/e816b740-05f3-11f0-9b8b-6f7f9efe4b54.png",
            "top_comments": [
                "The US doesn't have any laws that would allow \"decades behind bars\" for vandalism. So they'll have to prosecute it under some law not usually used for vandalism cases if that's their goal. And when they do they'll likely lose.\n\nAnd if they don't lose, that's going to send a pretty horrible message about rape, armed robbery, and all the other crimes that get punished less harshly than that. \n\nDon't get me wrong, vandalism is actually bad.  But there's no justification for punishing vandalism against Tesla motorcars more harshly than other vandalism.",
                "And what’s the going rate for rape these days, 3-5 years if any? Ah but surely property crime is domestic terrorism and deserves 20 years. What a fucking joke.",
                "And what is she saying about the kid that killed 2 in FL?",
                "Silly rabbit, you need to be found guilty of 34 felonies if you want to avoid prison.",
                "She refused to call the guy who set Joshua Shapiro's house on fire in the middle of the night by throwing moltov cocktails in it a domestic terrorist when asked point blank. Pam Bondi can go fuck herself.",
                "Pam Bondi accepted a bribe from Trump to not prosecute Trump University. How many years did she serve behind bars for that corruption?",
                "They care more about people torching teslas than mass shooters. What a backwards way of thinking. I can’t wait until the day this is over and we never have to worry about trump or his lackeys threatening, bullying, and killing people. That will be the best day in all of American history.",
                "Gonna be completely honest, I truthfully don’t give a shit about people vandalizing Teslas when they blanket pardoned the January 6th terrorists. Free game, baby.",
                "But free the J6’rs and pay them for their time incarcerated",
                "And yet breaking into the Capitol and trying to kidnap the Vice President while chanting, “Hang Mike Pence” with a gallows constructed outside is pardonable.\n\nI can’t wait to wake up from this fucking fever dream."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Undocumented Immigrant Faces Decades In Prison After Breaking ICE Officer's Nose During Arrest",
            "external_url": "https://www.latintimes.com/undocumented-immigrant-faces-decades-prison-after-breaking-ice-officers-nose-during-arrest-581132",
            "upvotes": 16411,
            "date": "04/18/2025",
            "thumbnail": "https://d.latintimes.com/en/full/568935/mass-teen-01292025-1.jpg",
            "top_comments": [
                "The headline says undocumented, the caption under the photo says legal U.S. status, and the article says he was here unlawfully. \n\nI know I’m not the brightest bulb in the box but which is it lol?",
                "If someone in an unmarked car, with plain clothes, attempts to abduct me under any circumstances I should have the right to defend myself. This is ridiculous",
                "I mean, how long until one of these ICE officers is shot in self defense? They’re showing up masked with no credentials. Any weirdo that wants to cosplay and harass their immigrant neighbors can buy patches and vests off the internet.",
                "Better than going to el Salvador",
                "Were they plain clothes officers in unmarked vehicles? If yes why is it a crime to fight back? They could be imposters trying to kidnap you. The terrorists want you to let your guard down so they can kidnap you in an unmarked vehicle and behead you.",
                "The ICE agent is angling to retire early on a disability pension.",
                "This is like the three strikes laws, it basically corners people so they have nothing to lose. If somebody knows they are going to Cecot, or Gitmo they are going to respond with violence.",
                "I mean, so far if you get as far as El Salvador, you’re not coming back, so why not start blastin’? \n\nThey grab you if you’re documented, undocumented, legal, naturalized, or a citizen. They grab you if they can’t find the guy they’re looking for. They refuse all attempts to get you back. They commit constant slander, claiming you’re Tren de Aragua, or MS-13 when they forget how to pronounce Tren de Aragua. \n\nAnd I have a history of dealing with ICE at the women’s shelter I worked at for years. They would threaten to arrest and rape the case workers who wouldn’t let them in. Fuck them.",
                "I can’t help but notice that the picture for the article isn’t of the ICE agent whose nose got broken.",
                "> U.S. Attorney Alina Habba in the aforementioned statement. “Those who choose to attack and assault law enforcement will continue to be met with swift and severe punishment.”\n\nBullshit. Only the people you don’t like will be punished. The ones that support you get pardoned for attacking and assaulting law enforcement."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Judge blocks administration from deporting noncitizens to 3rd countries without due process",
            "external_url": "https://abcnews.go.com/US/judge-blocks-administration-deporting-noncitizens-3rd-countries-due/story?id=120951918",
            "upvotes": 57960,
            "date": "04/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0c049aa4-fe66-4160-9209-c2f35277f952/donald-trump-1-ap-gmh-250418_1744979483649_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The courts should block the payments from the administration to the countries taking these people and they won't take them anymore.",
                "I want to know how this would be enforced\n\nBecause currently I am not seeing an active and useful enforcement vehicle of any kind in play\n\nHe’s not gonna be impeached bc republicans dont care\n\nHe’s still got massive approval among republican voters \n\nIce agents aren’t exactly gonna go for civil disobedience\n\nAnd anyone charged with a crime can be pardoned by trump and he also cannot be charged with a crime apparently\n\nSo what is the barrier here other than like decorum?",
                "And who gonna stop them from ignoring this judge? \n\nFascists only play by their own rules.",
                "**It isn't a deportation; it is an extrajudicial rendition to a 3rd party dictatorship for indefinite incarceration in cruel and unusual conditions without any recourse nor due process for the accused (All at the behest of the Executive Branch and continually paid for by the U.S. taxpayer).**\n\nCalling it a \"deportation\" is like calling attempted murder, a friendly tussle.\n\nSupporting deportations and thinking the deportations are justified, doesn't require you to agree with turning a deportation order into life imprisonment in a dictatorship, paid for with your tax dollars.\n\n>\"Defendants argue that the United States may send a deportable alien to a country not of their origin, not where an immigration judge has ordered, where they may be immediately tortured and killed, without providing that person any opportunity to tell the deporting authorities that they face grave danger or death because of such a deportation,\" Judge Murphy wrote.\n\n\\---\n\nThese aren't a deportation in any traditional sense of the word and we should not call nor acknowledge them using \"deportation.\"\n\nIt wasn't removal from the country. It was U.S. law enforcement physically handing over two hundred plus people in custody (often with a questionable basis) over to El Salvador's law enforcement to throw them in a dictator's prison camp without trial, due process, or any legal recourse, all paid for by the U.S. taxpayer.\n\nThat is what we call an extraordinary rendition, or state-sponsored kidnapping, paid for by the U.S. taxpayer.\n\nCalling it a deportation buries the lead and plays into the alt-right/this administrations' narrative. Likewise it makes it harder to explain the problem here, as it phrases the complaint as against people being sent back to their country of origin.\n\nTo be clear we aren't deporting people from the country; we are using U.S. taxpayer dollars to pay a dictator to imprison and disappear hundreds (so far) of foreign nationals from 3rd party countries at the behest of the U.S. executive branch.\n\n(Not that there are no problems with the deportations/process in general, but that is much harder to communicate.)",
                "Yeah, because that's stopped them so far.",
                "There's literally videos of people breaking into homes without a warrant. This is WAYYYYYY past a court ruling. Without ENFORCEMENT, our institutions are USELESS.",
                "Uh huh. Now fucking enforce it.",
                "The fifth amendment says no person shall be deprived of life, liberty, or property without due process of law.\n\nNot citizen. PERSON.",
                "\"All nine sitting justices of the Supreme Court of the United States, the Assistant Solicitor General of the United States, Congress, common sense, basic decency, and this Court all disagree [with the Trump admin].\"    \n\nU.S. District Judge Brian Murphy when issuing an injunction barring the administration from deporting non citizens to a country that is not their origin.   \n\nThat bit about common sense and basic decency is so true.",
                "OK, but what then?\n\nDon't get me wrong, this needs to stop, but the Trump regime seems to ignore court orders with impunity."
            ],
            "aggregate_sentiment": 87.0
        },
        {
            "category": "RISING",
            "title": "White House changes COVID.gov web page to page supporting lab leak theory",
            "external_url": "https://abcnews.go.com/Health/white-house-covid-web-page-page-supporting-lab/story?id=120956514",
            "upvotes": 5774,
            "date": "04/19/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f304a57c-6502-4e33-98bf-ac81930f3a40/lab-1-ht-er-250418_1745003468373_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                "Site looks like a junior high web design project",
                "What in the megalomania is that webpage header? A picture of Trump photoshopped to look thinner walking out of the words “lab leak” and a swirly signature font to write “covid 19.” This has to be AI graphic design",
                "All else aside, who the hell designed that header graphic?",
                "I’m not even opposed to the Lab Leak theory and think it’s an entirely possible, or even probable, cause of COVID.\n\nBut the presentation of this information is not dissimilar to crackhead conspiracy. Horribly unprofessional page and incredibly divisive. \n\nThey don’t know how to implement unifying (and ultimately patriotic) policy and it’s frightening",
                ">The White House has redirected [COVID.gov](http://COVID.gov) to a new landing page called \"Lab Leak: True Origins of COVID-19,\" which makes a five-point argument for the theory that COVID-19 originated from a mistaken lab leak in Wuhan, China. \n\n>The new site appears to use theories from the final report of the Republican-led Select Subcommittee on the Coronavirus Pandemic, released in December 2024. There has never been a consensus or a \"smoking gun\" to explain what started the pandemic. \n\n>The [COVID.gov](http://COVID.gov) page, as recently as last week, listed resources for testing, treatment, and vaccination against COVID-19, as well as information for Long COVID.\n\n>The five pieces of evidence put forth by the White House for the theory include the following assertions: that the \"virus possesses a biological characteristic that is *not found in nature*,\" that data shows all cases \"stem from *a single introduction into humans*,\" that \"*Wuhan is home to China's foremost SARS research lab*,\" that researchers at that research lab \"were *sick with COVID-like symptoms* in the fall of 2019,\" and that \"if there was evidence of a natural origin it would have *already surfaced.*\"\n\n>The page includes claims that government officials, including former NIAID Director Dr. Anthony Fauci, helped edit and then amplify a research paper on the origins of COVID-19 published in 2020 that supported natural origin theory.\n\nTrump attacking Fauci is nothing new, but there's a concerted effort to make definitive statements based on circumstantial evidence",
                "[Whitehouse.gov](http://Whitehouse.gov) is a satire site now",
                "I love how the white house webpage lays it all out as if he wasn't president during most of what's mentioned. - Also, why the hell is \"Covid-19\" written in script like the cover of a romance novel?",
                "Help me understand what is the government gaining with this change?\n\n\nI get that they're all for chaos and believe in the unproven things but besides appealing to their voters, what is this adding to the conversation? ",
                "This is the longest Black Mirror episode ever. Where’s the remote?",
                "The icing on the cake is that his dumb face still has to be on the page. The guy absolutely cannot stop himself from making everything about him and seeking adulation. Amazing to watch the destruction of the American experiment all because Fred Trump couldn’t hug his kids and tell them they had value outside of how much money they make."
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "04/19/2025 12:13:35 UTC"
}