{
    "posts": [
        {
            "category": "HOT",
            "title": "US judge says deportations to South Sudan likely violate court order",
            "external_url": "https://www.reuters.com/world/immigrant-rights-advocates-claim-us-violated-court-order-by-deporting-migrants-2025-05-20/",
            "upvotes": 9014,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sick and tired of judges stating that their orders are being violated and doing nothing more than politely asking for more information. \n\nLock someone up for contempt or STFU already",
                "Until there are consequences, Trump will continue violating the law at his pleasure.\n\n\nAnd there will be no consequences.",
                "Always “likely” or “alleged” or “potentially”.  Right up until the end",
                "We need to come up with a new term for this.\n\nWhen I read \"deport,\" I think of a person being returned to their home country so they can resume their old life... not sent into the middle of a civil war 7000 miles away from anyone they know.",
                "*The US government's travel advisory states \"do not travel to South Sudan due to crime, kidnapping, and armed conflict\".*\n\nOf those immigrants send there, none are from S. Sudan, so obviously this is some illegal retribution.",
                "\"The President of the United States is illegally deporting people to a dangerous country with an active travel advisory issued directly from the US State Department due to possibility of armed conflict and civil unrest\"\n\nFixed that for you, fucking idiots at Reuters.",
                "“The court has no army”",
                "Why the fuck is it always “likely” and “possibly” and “potentially” when this guy does something? Fucking journos.",
                "And so what? Not like anyone is going to do anything about it",
                "The Trump administration will just claim the courts said they couldn't send people to El Salvador they didn't say anything about Sudan."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "New Trump vaccine policy limits access to COVID shots",
            "external_url": "https://apnews.com/article/vaccines-fda-kennedy-covid-shots-rfk-trump-bb4de15b6ff955d6cd0b406aaec3cdc5",
            "upvotes": 13888,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Amazing how quickly we went from \"if you want the shot get it, but don't force it on me\" to preventing everyone from getting it.",
                "What happened to this shit being between me and my doctor?\n\nOh. Right. You can't be a republican without the homicidal hypocrisy.",
                "Vaccine tourism coming soon.",
                "[From the NY Times article:](https://www.nytimes.com/2025/05/20/health/fda-covid-vaccines.html?unlocked_article_code=1.Ik8.7u6N.KYhtZby1oZKJ&smid=url-share)\n\n> Some experts said the new criteria go too far, erecting barriers for people who will want the shots.\n\n> “This is overly restrictive and will deny many people who want to be vaccinated a vaccine,” Dr. Anna Durbin, director of the Center for Immunization Research at Johns Hopkins University, said in an email.\n\n> The changes do “not make sense from a public health perspective,” she said.\n\n> Some experts said that while they agreed with aspects of the new rationale, the new restrictions would unnecessarily limit access for healthy Americans who may be at high risk because of their occupation or for other reasons.\n\n> This “doesn’t preserve people’s choice to get vaccinated,” she added.\n\nI understand that a large swath of the population was angry that (they believed) they were forced into receiving a vaccine they didn't want in order to reduce risk for transmission of a disease they didn't believe in. As a result, we now have a party in charge who is making it so that others can't get vaccines *even by their own choice.* Whenever people say that both sides are the same, I just shake my head.",
                "He'll never ever be man enough to admit he was wrong.",
                "There it is. The first step to actively impede vaccination. It will get worse from here.",
                "Republicans in 2021- “ No one should be forced to get a vaccine they don’t want. Medical freedom!”\n\nRepublicans in 2025- “We’re going to prohibit everyone from getting immunization and medical care even if they want or need it”",
                "He and RFK Jr cry that people should have a choice to get the vaccine or not.  Then they proceed to take away the choice for people who want it.",
                "This is what happens when you sell healthcare head jobs for elections.",
                "\"Don't take medical advice from me\" -RFK\n\n\"Actually, you can't get a shot even if you want it\" -Also RFK"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Reddit bans an anti-natalist group after Palm Springs explosion",
            "external_url": "https://www.nbcnews.com/tech/internet/reddit-bans-anti-natalists-palm-springs-explosion-rcna207677",
            "upvotes": 1467,
            "date": "05/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-palm-springs-fertility-clinic-ew-1108a-96a0f2.jpg",
            "top_comments": [
                "First time hearing of this sub.",
                ">On Monday, a Reddit spokesperson confirmed to NBC News that it had banned the r/Efilism subreddit after the explosion, which killed the suspect and injured four other people. Other anti-natalist subreddits remain on the platform.\n\nIf there's one thing Reddit wants to avoid, it's to be a staging platform for violence.",
                "I used to like lurking in that sub from time to time to remind myself what _bad_ weird looks like.",
                "I’ve never heard of anti natalists. I assume they’re the opposite of the “pro birth” crowd?",
                "If that is the case, they need to go back to any coverage of True Detective Season 1 and much of Rust's dialogue, because Pizzolato lifted his philosophy from Thomas Ligotti in his [*The Conspiracy Against the Human Race*](https://en.wikipedia.org/wiki/The_Conspiracy_Against_the_Human_Race).",
                "> Reddit said the community was banned because of the platform’s rules forbidding the promotion of self-harm.\n\nSo did that sub promote suicide? Using the wayback machine it looks like a kinda depressing sub, but none of the content looks like it promotes self harm. Seems like a philosophical sub for a bunch of negative, pessimistic, and sometiems depressed folks.\n\nNot sure I understand shutting it down, especially if there's no direct connection to the bomber.\n\nIt says writings by the bomber were being shared on the sub, but that's sadly predictable, and should be counteracted with responsible moderation. If it wasn't being moderated, sure, ban it. But it seems like they didn't even bother to give it a chance.\n\nWhatever though. Reddit is a for-profit endeavor now, and the days of a commitment to free thought are long gone anyways. So be it.",
                "All those extreme 'anti X' subs are so cringe. Fuckcars, petfree, childfree, etc..., they're the biggest toxic circlejerk places imaginable.",
                "Reddit can created a shit ton of domestic terrorist this year",
                "How about some more bans for the subs of people supporting exile to South Sudan?\n\n\nOh, silly me for even asking.",
                "Didn't know that nihilism was still a thing!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "George Wendt, actor who played Norm on ‘Cheers,’ dead at 76",
            "external_url": "https://www.cnn.com/2025/05/20/entertainment/george-wendt-death",
            "upvotes": 3745,
            "date": "05/20/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-138362751.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Daaaaaaaaaaaaa Bears.\n\n\nR.I.P. You comedic legend.",
                "The hunter finally caught up to the buffalo.\n\nSee you at the bar, Norm. 🍻",
                "Hard to believe he was just 35 when Cheers started...",
                "For everyone's enjoyment: https://www.youtube.com/watch?v=VXED2AVlbR0",
                "Damn.  One of my best days working i ever had was behind the bar in a pub in the UK. I looked up at the gent sitting at the end of the bar. Couldn't believe that I got to serve a beer to 'Norm'. It felt surreal. He was such a nice guy, happy to chat the day away. Rest easy big fella.",
                "No more underwear made of milk bones.\n\nRIP Norm.",
                "“It’s a dog eat dog world, Sammy; and I’m wearing milkbone underwear.” -Norm",
                "I can see him at the pearly gates: \"NORRRRM! How's life treating you?\"\n\n\n\"Well, I'm kind of done with it now...\"",
                "Want a beer Mr Peterson?\n\nIsn't it a little early Woody?\n\nFor a beer?\n\nNo, stupid questions.",
                "RIP to a legend.\n\nFinally can change out of those Milk Bone shorts."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Moody's downgrades JPM, BofA and Wells Fargo after US credit rating cut",
            "external_url": "https://www.reuters.com/markets/us/moodys-downgrades-jpm-bofa-wells-fargo-after-us-credit-rating-cut-2025-05-19/?utm_campaign=trueAnthem%3A+Trending+Content&utm_medium=trueAnthem&utm_source=facebook&fbclid=IwZXh0bgNhZW0CMTEAAR59mJW6zI2u7jNd2y5tL39fxMlgIz-5b7zIAHx0J_eEF0F5jvs-BtDUbbg6bw_aem_rJwFnuJFTA03uOf1EQ-XsA&sfnsn=mo",
            "upvotes": 19007,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "When Moody's finally starts downgrading private equity firms and their bundled garbage, then you'll know the music is about to stop. They have to give time for the people up top to get a chair",
                "Well that’s another +500 for the DOW!",
                "Surprised trump hasn’t called moodys a socialist, Marxist, anti-Christian, anti-American organization",
                "I’ve said it here before and I’ll say it again. After the Wells Fargo creating unwanted accounts for the customers years ago, I still can’t wrap my head around anyone trusting them with their money.",
                "Trump bailouts are incoming. Dont worry, Republicans will blame Democrats for inflation after they spend like maniacs to clean up their reckless policy.",
                "And here goes the domino of sovereign credit rating to corporates. The end of it are rate hikes and defaults for the consumers recalled credits and collapsing leverage structures. \n\nThis is going to be bad. Americans think tariffs are a problem? This can snowball in months into sovereign default.",
                "If they finally downgraded that means the situation is much worse than they are letting on. \n\nEveryone goes to work, everyone sees the corruption there. Its worse in banks. Best of luck.",
                "Oh that is why Buffet dropped 100% of all Citigroup stocks. The US banking sector might have some trouble in coming days.",
                "Can someone ELI5 what this means for regular people? Sounds bad but I don't actually understand the implications.",
                "People need to know the fiscal responsible party did this.\n\nYou know the party of [starve the beast](https://en.wikipedia.org/wiki/Starve_the_beast)\n\nWhere they run up the deficit and debt, to get people more accepting of cuts to medicaid and SS which they want to force a dem president to cut\n\nWe had a 300 billion dollar surplus, and even without SS it was a surplus. Bush turned it into a 1.2 trillion dollar deficit, by 3 rounds of tax cuts and not paying for a damn thing.\n\n[Republican Sen. Orrin Hatch, following several decades on Capitol Hill, told The Associated Press in 2009 that “it was standard practice not to pay for things” during the Bush/Cheney era — as if the entirety of the GOP simply forgot its fiscal principles for eight consecutive years.](https://www.msnbc.com/rachel-maddow-show/maddowblog/republicans-are-no-longer-credible-balanced-budgets-rcna69034)\n\nbut even with all that the [CBO in 2006 under a FULLY REPUBLICAN GOV, said the surpluses would come back even with the wars and crap, as soon as the bush tax cuts expired.](https://www.cbo.gov/sites/default/files/110th-congress-2007-2008/reports/08-23-update07_0.pdf)\n\nthe republicans held UE extensions hostage under Obama, until he agreed to make most the bush deficit causing tax cuts perm.\n\nnow our debt has risen so much our yearly interest payments are more than our military budget.\n\nevery single solitary reduce the debt meeting between the parties always ended because the right say, absolutely zero tax hikes.\n\nUnder obama they got the sequester, which bush own treasury sect would say we would need because of the tax cuts and not paying for shit.. and chenney said \"deficits dont matter\" we got 1.5 trillion in military cuts over 10 years and 1.5 trillion in spending for the poor cuts, and then the republikans undid the military cuts like everyone knew they would.\n\nonly 3 times in history did our rating go down, and make our DEBT COST MORE.. and every time it was republican fault.\n\nwe could have surpluses again, a rainy day fund for bad times and a top ratings again, if people would just stop electing republicans."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "New salmonella outbreak tied to same Florida grower with tainted cucumbers last year",
            "external_url": "https://apnews.com/article/salmonella-cucumbers-bedner-growers-254618f4ce92fa421a5b8e2187ec267d",
            "upvotes": 2408,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If corporations are people, what do we do to people that routinely poison people?",
                "As of May 19, the salmonella outbreak linked to cucumbers has sickened 26 people in the following 15 states:\n\n* Alabama\n* California\n* Colorado\n* Florida\n* Illinois\n* Kansas\n* Kentucky\n* Michigan\n* North Carolina\n* New York\n* Ohio\n* Pennsylvania\n* South Carolina\n* Tennessee\n* Virginia ",
                "sure wish that the FDA had a robust testing and tracking department",
                ">The cucumbers were sold to restaurants, stores and food service distributors between April 29 and May 19 and may still be within their shelf life this week. Illnesses were reported between April 2 and April 28, according to the U.S. Centers for Disease Control and Prevention.\n\nIt's crazy this warning got out. Considering the [Trump administration has stalled in posting food safety warnings](https://www.nbcnews.com/health/health-news/fda-stalls-posting-food-safety-warning-letters-staff-cuts-rcna204879).",
                "TLDR : the grower is Bedner's Farms of Boynton Beach, Florida... actually in unincorporated Palm Beach County just west of SR 7/ US 441 between Atlantic and Boynton Beach Boulevard. A likely contaminant is either undertreated waste water or sludge from residential recycled water treatment which is applied to the crops to water and/or fertilize them and things went south.",
                "We really dodged that government efficiency didn’t we?",
                "Living in NY we rely on imported food during the cold months.\n\nI, and many others I know, actively avoid Florida produce, it's always poor tasting and low quality.\n\nI gladly will pay for better quality from anywhere else.\n\nAnd all their citrus is green these days.",
                "Damn! I have a cucumber I haven't eaten yet in my refrigerator.\n\nGuess it's going in the garbage.",
                "Good news! By tis time next year they'll have this solved, since they won't be able to tell you WHERE it came from thanks to destructive cuts to the programs that monitor food saftey! i didn't say the good news was for us.",
                "Waiting for RFK Jr to suggest the solution is to stop testing sick people for salmonella."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US must keep control of migrants sent to South Sudan in case removals were unlawful, judge rules",
            "external_url": "https://apnews.com/article/deportation-immigration-south-sudan-department-of-homeland-security-300e8c704402e2cb3c920d251b7fa876",
            "upvotes": 460,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sudan WTF is going on? Our country is lost.",
                "Imagine living your life like back in August just chilling and now you’re in South Sudan because of an election",
                "They're just going to ignore this ruling, again.",
                "Pretty sure that is human trafficking which is already unlawful.\n\nSo... Good job judge?",
                "Hmmm when was the last time any of these rulings were followed or enforced. They're just words now.",
                "Our country is being run by amoral idiots.",
                "Ok but they won't and nothing will come of it",
                "In case? So we're entertaining the idea that forcefully sending Americans to South Sudan is fine?",
                "How is it possible to trust Trump to do anything?",
                "I'm sorry but WTF am I reading here?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Passenger jet aborted takeoff to avoid LaGuardia runway collision",
            "external_url": "https://www.nbcnewyork.com/news/local/passenger-jet-abort-takeoff-avoid-runway-collision-laguardia-airport/6270373/",
            "upvotes": 4686,
            "date": "05/20/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/05/GettyImages-1239716051.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Federal officials are investigating why two planes got dangerously close on a runway at New York's LaGuardia Airport earlier this month despite the airport being equipped with an advanced surface radar system that's designed to help prevent such close calls.\n\nBoth the Federal Aviation Administration and the National Transportation Safety Board said Monday that they are investigating the May 6 incident when a Republic Airways jet had to abort takeoff and slam to a stop because a United Airlines plane was still taxiing across the runway.\n\n**In audio from the tower that ABC obtained from the website** [**www.LiveATC.net**](https://www.liveatc.net/)**, the air traffic control said to the pilot of the Republic Airways jet: “Sorry, I thought United had cleared well before that.”...**",
                "I am a stupid person. \n\nAre these kinds of instances actually occurring more often as a result of the actions of this current administration? Or, has it been “status quo”, i.e., these things happen on a “consistent basis” and we are just receiving a hell of a lot more press on it now?\n\nAgain, I am a stupid person. Thank you for patience.",
                "Pilot who saved the day must have been listening to Evanescence.",
                "Here is audio from ATC: https://www.youtube.com/watch?v=xXnmd8p2oO4\n\nThis was a dumb move by ATC.  ATC transferred United to the ground frequency, who had them taxi down a runway.  United missed a sharp turn they would have had to make and spent extra time on the runway. The Tower then cleared the other aircraft to take off on that runway, not realizing United missed the turn and was still on the runway.  \n\nThe simple solution is that Tower should always control the runway.  Ground can do the taxiways, but having 2 people clear people into the same space is stupid.",
                "It always surprised me that LaGuardia wasn’t the NYC airport completely melting down. I have never had a positive experience flying in or out of that airport",
                "Are we just seeing more news of near collisions and accidents or are the incidents actually up since the cuts?",
                "Those DOGE cuts and layoffs are really saving a lot of money. What could possibly go wrong.",
                "I was flying into LaGuardia once and we had to do a sudden abort because a plane was on the runway… that shit was scary!  Earlier that day on our departure the takeoff was aborted just before we lifted off.  They slammed the breaks going over 100 mph.  That was wild and it kinda hurt.",
                "I am starting to think that DEI is literally what was keeping plains in the air",
                "something something Biden's prostate, Obama's tan suit,  George Soros. \n\n/s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Personal secretary and adviser to Mexico City's mayor killed in attack",
            "external_url": "https://apnews.com/article/mexico-sheinbaum-cartel-attack-97b8c6ce26ce5b7212bba49bcdd03c9f",
            "upvotes": 2843,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If only you could nuke the cartel specifically.   Mexico is such a beautiful place, hate that they make it worse.",
                "Things are worse that what the government media tells you here.",
                "I remember when AMLO when on 60 minutes last year and said there was no cartel problem in Mexico and that the USA has a more of a gang problem lmao. Just waiting for tom Clancy’s Clear and Present Danger to become real life Mexican lore",
                "That site is cancer.  There were so many ads I couldn't read anything.",
                "Seriously, we should be extending SOME sort of assistance to Mexico to deal with their crime problems.  There has to be something we can do that isn't \"hi we are going to invade your country with our military and kill your bad guys\" but also isn't \"lol not our problem\"",
                ">Homicides were up slightly in Mexico’s capital during the first quarter of this year compared with the same period last year.\n\nSuch a meaningless fact to throw in a story about a targeted murder.",
                "This yet another example that points to the fact that the US does not have an immigration issue.\n\nNorth America has a humanitarian crisis.  Fix the Cartel problem and so many issues would go away.",
                "The only thing that could take on the cartels is the global oil industry.",
                "Terrible news, my thoughts are with their family and everyone affected by this tragedy.",
                "It’s insane how they’ve allowed thugs to control the country."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "EU, Britain go ahead with new Russia sanctions without waiting for Trump",
            "external_url": "https://www.reuters.com/world/europe/eu-adopts-new-sanctions-against-russia-kallas-says-2025-05-20/",
            "upvotes": 2661,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I remember when someone said they could stop this war on day one",
                "They’ll be waiting til the sun goes supernova",
                "The US is no longer the leader of the free world. I’m not sure what it is now but it’s definitely not that.",
                "Trump has to get permission from Putin before he acts on anything.",
                "Trump the Manchild will throw a temper tantrum. I see eu and uk tariffs soon .",
                "Trump’s team is busy doing an analysis of whether the sanctions will affect his personal assets.",
                "Europe is going to have to do a lot of things without waiting for Trump",
                "I still find it amazing that Republicans want to stay with Trump and his culture war even if they all wind up as Kings of the ashes, instead of moving away from him for the sake of a functioning country. ",
                "If we (the US) impose retaliatory points on the EU that will be the end of the North America in the Western World as we descend into further chaos.",
                "That's smart, everything considered."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US must keep control of migrants sent to South Sudan in case removals were unlawful, judge rules",
            "external_url": "https://apnews.com/article/deportation-immigration-south-sudan-department-of-homeland-security-300e8c704402e2cb3c920d251b7fa876",
            "upvotes": 461,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sudan WTF is going on? Our country is lost.",
                "Imagine living your life like back in August just chilling and now you’re in South Sudan because of an election",
                "They're just going to ignore this ruling, again.",
                "Pretty sure that is human trafficking which is already unlawful.\n\nSo... Good job judge?",
                "Hmmm when was the last time any of these rulings were followed or enforced. They're just words now.",
                "Our country is being run by amoral idiots.",
                "Ok but they won't and nothing will come of it",
                "In case? So we're entertaining the idea that forcefully sending Americans to South Sudan is fine?",
                "How is it possible to trust Trump to do anything?",
                "I'm sorry but WTF am I reading here?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Hamilton man charged with sexually assaulting unsuspecting women as police look for more victims",
            "external_url": "https://www.cbc.ca/news/canada/hamilton/sexual-assault-charge-1.7539235",
            "upvotes": 157,
            "date": "05/21/2025",
            "thumbnail": "https://i.cbc.ca/1.7476226.1746120341!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_1180/hamilton-police-car.jpeg?im=Resize%3D620",
            "top_comments": [
                "Weird that the CBC didn't mention that he was caught because of good journalism by CTV. \n\n\nThey went undercover for W5 and that documentary will be released May 31st. \n\nhttps://www.ctvnews.ca/canada/article/canadian-man-at-centre-of-widescale-w5-sexual-assault-investigation-arrested-and-charged/",
                "[Canadian at centre of W5 sexual assault investigation arrested, charged](https://www.ctvnews.ca/canada/article/canadian-man-at-centre-of-widescale-w5-sexual-assault-investigation-arrested-and-charged/)",
                "The internet really enables some of the darkest corners of humanity. This is sickening",
                "Not the point, but does \"suffered an amputation\" means he is missing his hand? Is that the right way to phrase it? I've never thought about it.",
                "What do these two headlines have to do with each other?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Reddit bans an anti-natalist group after Palm Springs explosion",
            "external_url": "https://www.nbcnews.com/tech/internet/reddit-bans-anti-natalists-palm-springs-explosion-rcna207677",
            "upvotes": 1468,
            "date": "05/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-palm-springs-fertility-clinic-ew-1108a-96a0f2.jpg",
            "top_comments": [
                "First time hearing of this sub.",
                ">On Monday, a Reddit spokesperson confirmed to NBC News that it had banned the r/Efilism subreddit after the explosion, which killed the suspect and injured four other people. Other anti-natalist subreddits remain on the platform.\n\nIf there's one thing Reddit wants to avoid, it's to be a staging platform for violence.",
                "I used to like lurking in that sub from time to time to remind myself what _bad_ weird looks like.",
                "I’ve never heard of anti natalists. I assume they’re the opposite of the “pro birth” crowd?",
                "If that is the case, they need to go back to any coverage of True Detective Season 1 and much of Rust's dialogue, because Pizzolato lifted his philosophy from Thomas Ligotti in his [*The Conspiracy Against the Human Race*](https://en.wikipedia.org/wiki/The_Conspiracy_Against_the_Human_Race).",
                "> Reddit said the community was banned because of the platform’s rules forbidding the promotion of self-harm.\n\nSo did that sub promote suicide? Using the wayback machine it looks like a kinda depressing sub, but none of the content looks like it promotes self harm. Seems like a philosophical sub for a bunch of negative, pessimistic, and sometiems depressed folks.\n\nNot sure I understand shutting it down, especially if there's no direct connection to the bomber.\n\nIt says writings by the bomber were being shared on the sub, but that's sadly predictable, and should be counteracted with responsible moderation. If it wasn't being moderated, sure, ban it. But it seems like they didn't even bother to give it a chance.\n\nWhatever though. Reddit is a for-profit endeavor now, and the days of a commitment to free thought are long gone anyways. So be it.",
                "All those extreme 'anti X' subs are so cringe. Fuckcars, petfree, childfree, etc..., they're the biggest toxic circlejerk places imaginable.",
                "Reddit can created a shit ton of domestic terrorist this year",
                "How about some more bans for the subs of people supporting exile to South Sudan?\n\n\nOh, silly me for even asking.",
                "Didn't know that nihilism was still a thing!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "UN agency, Rohingya refugees allege Indian authorities cast dozens of them into the sea near Myanmar",
            "external_url": "https://apnews.com/article/india-rohingya-refugees-deportation-e724b7a9949192a5383f84eb98377026",
            "upvotes": 200,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> The Office of the U.N. High Commissioner for Human Rights, in a statement on Thursday, said at least 40 Rohingya refugees were detained in New Delhi and cast into the sea by the Indian navy near the maritime border with Myanmar. The refugees — **including children, women and older people** — swam ashore, but their whereabouts in Myanmar remain unknown, the agency said.\n\nSuch cruelty, fuck",
                "At first I was like... Maybe they got dropped off by the shore, but then:\n\n\"detained in New Delhi and cast into the sea by the Indian navy near the maritime border with Myanmar\"\n\nMaritime border sounds like It'd be a bit farther out. Anyone have an idea how far out to sea these folks were allegedly dumped?\n\nApparently, they were given flotation devices and told to fuck off towards shore, but Myanmar is where they were, allegedly, being genocided so... Out of the frying pan and into the fire?\n\nWhat a situation.",
                "Man the American administration is going to be so mad they didn't do this first.",
                "It's fake news, first ran by maktoob media then picked up by these idiots. It's a way to create pressure on government to stop deportations which are happening right now."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US judge says deportations to South Sudan likely violate court order",
            "external_url": "https://www.reuters.com/world/immigrant-rights-advocates-claim-us-violated-court-order-by-deporting-migrants-2025-05-20/",
            "upvotes": 9011,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sick and tired of judges stating that their orders are being violated and doing nothing more than politely asking for more information. \n\nLock someone up for contempt or STFU already",
                "Until there are consequences, Trump will continue violating the law at his pleasure.\n\n\nAnd there will be no consequences.",
                "Always “likely” or “alleged” or “potentially”.  Right up until the end",
                "We need to come up with a new term for this.\n\nWhen I read \"deport,\" I think of a person being returned to their home country so they can resume their old life... not sent into the middle of a civil war 7000 miles away from anyone they know.",
                "*The US government's travel advisory states \"do not travel to South Sudan due to crime, kidnapping, and armed conflict\".*\n\nOf those immigrants send there, none are from S. Sudan, so obviously this is some illegal retribution.",
                "\"The President of the United States is illegally deporting people to a dangerous country with an active travel advisory issued directly from the US State Department due to possibility of armed conflict and civil unrest\"\n\nFixed that for you, fucking idiots at Reuters.",
                "“The court has no army”",
                "Why the fuck is it always “likely” and “possibly” and “potentially” when this guy does something? Fucking journos.",
                "And so what? Not like anyone is going to do anything about it",
                "The Trump administration will just claim the courts said they couldn't send people to El Salvador they didn't say anything about Sudan."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "First US utility seeks permit for a small nuclear reactor",
            "external_url": "https://apnews.com/article/new-nuclear-reactors-tennessee-valley-authority-da3b72b3305982f2596ba6daef2d9ae8",
            "upvotes": 553,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "nuclear has come a long way and without a breakthrough elsewhere it remains an important stepping stone to more sustainable power. Glad to see this step being taken",
                "Need more of these small reactors that can now be used by \"old\" uranium. that we could no longer use at one point due to technology no allowing it.",
                "I'm so glad the protective regulations of nuclear power are so well and strong, epa has never been better. Now no company is going to abuse and remove necessary systems to save fractions of a cent!\n\nOh right.",
                "Eh, unless 200 orders for these are coming in, nuclear  dead. I like nuclear. But from an economic standpoint it's dead. For the time it takes to install, you can build a wind farm and start generating revenue from the day you connect the first wind turbine. Same for solar nuclear though, it's gonna take 5 years even for a SMR to get it turned on, if you're lucky. And with the first one off the line, we're more likely to see the f47 take flight than this thing to turn on. \n\n\nNow as for all the idiots who want to mention safety, light water SMRs have been operating  for decades aboard US Naval ships and subs, without a single accident for 70 years. There's no industrial safety record in any industry that even approaches it. There's a few things about light water reactors that actually make them safer, though not as uranium efficient as their larger counterparts, much like how a campfire is much safer and easier to manage than a bonfire, you're just heating a smaller space. \n\n\nAbout the only thing the NRC is built to handle regulation wise is a light water reactor. The science has practically been solved for decades and grad students can build validated working models that run on laptops these days.",
                "I’m glad to see TVA take the lead here. I worked I. Their nuke plants in the early 90’s. Interestingly they were started via a federal jobs/rural electrification program",
                "I don’t usually like privatization, but I’m glad to see that nuclear energy is finally gaining traction. We need to start funding science again so we can work on nuclear fusion and all this other stuff.",
                "I’m still waiting for my Mr Fusion from 2015!",
                "The modern safety standards for small modular reactors don't exist. These SMRs are not currently powering cities anywhere in the US. Afaik There are no real world examples to look to in terms of what is safe/works and what doesn't when these SMRs are live, patched into the grid. SMR developers want to regulate as they innovate.\n\nThese same companies and states that want nuclear, like Utah, are suing the NRC to allow SMRs to be regulated by each state independently in order to create a competitive regulatory environment in the hopes of speeding up the process by which modern safety standards can be made. \n\nWhile speeding up innovation to outcompete foreign development is a good goal, speeding up regulation by regulating as you go may result in increased risk.\n\nhttps://www.wired.com/story/nrc-lawsuit-nuclear-energy-reactor-smr-regulation-regulatory-commission/",
                "This is prob a little off topic but in the Fallout universe the companies who handle the nuclear power almost always dispose of the waste in the most shady and comically dangerous ways possible to save a buck wherever they can and I feel like that's just gonna be a reality now. lol.",
                "ANd in a few decades we'll read something like https://www.printweek.com/content/news/kodak-park-was-home-to-secret-nuclear-reactor along the lines of \"found a forgotten nuclear reactor in the basement of <obscure little regional utility>\" because everybody and his dog who can't weven guarantee to exist long enough to take out the trash will start building them. Without even having the cash to clean it up if nothing unplanned happens.\n\nHave you ever read the story of the Soviet Union's nuclear lighthouses (\"nuclear batteries\", my ass -- unless someone wanted to make glow-in-the-dark Duracell rabbits)? This happens when an economy on the way down plays with this kind of stuff."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "George Wendt, actor who played Norm on ‘Cheers,’ dead at 76",
            "external_url": "https://www.cnn.com/2025/05/20/entertainment/george-wendt-death",
            "upvotes": 3750,
            "date": "05/20/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-138362751.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Daaaaaaaaaaaaa Bears.\n\n\nR.I.P. You comedic legend.",
                "The hunter finally caught up to the buffalo.\n\nSee you at the bar, Norm. 🍻",
                "Hard to believe he was just 35 when Cheers started...",
                "For everyone's enjoyment: https://www.youtube.com/watch?v=VXED2AVlbR0",
                "Damn.  One of my best days working i ever had was behind the bar in a pub in the UK. I looked up at the gent sitting at the end of the bar. Couldn't believe that I got to serve a beer to 'Norm'. It felt surreal. He was such a nice guy, happy to chat the day away. Rest easy big fella.",
                "No more underwear made of milk bones.\n\nRIP Norm.",
                "“It’s a dog eat dog world, Sammy; and I’m wearing milkbone underwear.” -Norm",
                "I can see him at the pearly gates: \"NORRRRM! How's life treating you?\"\n\n\n\"Well, I'm kind of done with it now...\"",
                "Want a beer Mr Peterson?\n\nIsn't it a little early Woody?\n\nFor a beer?\n\nNo, stupid questions.",
                "RIP to a legend.\n\nFinally can change out of those Milk Bone shorts."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "New salmonella outbreak tied to same Florida grower with tainted cucumbers last year",
            "external_url": "https://apnews.com/article/salmonella-cucumbers-bedner-growers-254618f4ce92fa421a5b8e2187ec267d",
            "upvotes": 2403,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If corporations are people, what do we do to people that routinely poison people?",
                "As of May 19, the salmonella outbreak linked to cucumbers has sickened 26 people in the following 15 states:\n\n* Alabama\n* California\n* Colorado\n* Florida\n* Illinois\n* Kansas\n* Kentucky\n* Michigan\n* North Carolina\n* New York\n* Ohio\n* Pennsylvania\n* South Carolina\n* Tennessee\n* Virginia ",
                "sure wish that the FDA had a robust testing and tracking department",
                ">The cucumbers were sold to restaurants, stores and food service distributors between April 29 and May 19 and may still be within their shelf life this week. Illnesses were reported between April 2 and April 28, according to the U.S. Centers for Disease Control and Prevention.\n\nIt's crazy this warning got out. Considering the [Trump administration has stalled in posting food safety warnings](https://www.nbcnews.com/health/health-news/fda-stalls-posting-food-safety-warning-letters-staff-cuts-rcna204879).",
                "TLDR : the grower is Bedner's Farms of Boynton Beach, Florida... actually in unincorporated Palm Beach County just west of SR 7/ US 441 between Atlantic and Boynton Beach Boulevard. A likely contaminant is either undertreated waste water or sludge from residential recycled water treatment which is applied to the crops to water and/or fertilize them and things went south.",
                "We really dodged that government efficiency didn’t we?",
                "Living in NY we rely on imported food during the cold months.\n\nI, and many others I know, actively avoid Florida produce, it's always poor tasting and low quality.\n\nI gladly will pay for better quality from anywhere else.\n\nAnd all their citrus is green these days.",
                "Damn! I have a cucumber I haven't eaten yet in my refrigerator.\n\nGuess it's going in the garbage.",
                "Good news! By tis time next year they'll have this solved, since they won't be able to tell you WHERE it came from thanks to destructive cuts to the programs that monitor food saftey! i didn't say the good news was for us.",
                "Waiting for RFK Jr to suggest the solution is to stop testing sick people for salmonella."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "New Trump vaccine policy limits access to COVID shots",
            "external_url": "https://apnews.com/article/vaccines-fda-kennedy-covid-shots-rfk-trump-bb4de15b6ff955d6cd0b406aaec3cdc5",
            "upvotes": 13894,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Amazing how quickly we went from \"if you want the shot get it, but don't force it on me\" to preventing everyone from getting it.",
                "What happened to this shit being between me and my doctor?\n\nOh. Right. You can't be a republican without the homicidal hypocrisy.",
                "Vaccine tourism coming soon.",
                "[From the NY Times article:](https://www.nytimes.com/2025/05/20/health/fda-covid-vaccines.html?unlocked_article_code=1.Ik8.7u6N.KYhtZby1oZKJ&smid=url-share)\n\n> Some experts said the new criteria go too far, erecting barriers for people who will want the shots.\n\n> “This is overly restrictive and will deny many people who want to be vaccinated a vaccine,” Dr. Anna Durbin, director of the Center for Immunization Research at Johns Hopkins University, said in an email.\n\n> The changes do “not make sense from a public health perspective,” she said.\n\n> Some experts said that while they agreed with aspects of the new rationale, the new restrictions would unnecessarily limit access for healthy Americans who may be at high risk because of their occupation or for other reasons.\n\n> This “doesn’t preserve people’s choice to get vaccinated,” she added.\n\nI understand that a large swath of the population was angry that (they believed) they were forced into receiving a vaccine they didn't want in order to reduce risk for transmission of a disease they didn't believe in. As a result, we now have a party in charge who is making it so that others can't get vaccines *even by their own choice.* Whenever people say that both sides are the same, I just shake my head.",
                "He'll never ever be man enough to admit he was wrong.",
                "There it is. The first step to actively impede vaccination. It will get worse from here.",
                "Republicans in 2021- “ No one should be forced to get a vaccine they don’t want. Medical freedom!”\n\nRepublicans in 2025- “We’re going to prohibit everyone from getting immunization and medical care even if they want or need it”",
                "He and RFK Jr cry that people should have a choice to get the vaccine or not.  Then they proceed to take away the choice for people who want it.",
                "This is what happens when you sell healthcare head jobs for elections.",
                "\"Don't take medical advice from me\" -RFK\n\n\"Actually, you can't get a shot even if you want it\" -Also RFK"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Maintenance worker says inmate threatened to shank him if he didn't assist in New Orleans jail break",
            "external_url": "https://apnews.com/article/new-orleans-jail-escape-inmates-arrest-45f2a4be028254cc2587f50deb9af44d",
            "upvotes": 768,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\\*Since the escape, Hutson has pointed to long-standing deficiencies such as [faulty locks](https://apnews.com/article/jail-louisiana-escape-lock-2b2c8ae12a1e114823af8edf6467b911) and staffing shortages. **But a growing number of state and local officials have said blame for the escape rests squarely on her for failing her responsibility to keep inmates locked up.\\***\n\nNot absolving the City or Parish of any blame here but I'm willing to bet that the state shares a significant porton of the blame. The state is willing to close rural hospitals and under-fund schools in order to keep that public safety budget nice and fat, but its not like that money goes to actually making the jails and prisons here less shit. Louisiana runs on the Good Ole Boys system.",
                "I'm just saying, if we're giving the maintenance guy the benefit of the doubt, if he was being threatened and he didn't think reporting it to the prison management team was going to get him anywhere, the breakout is on prison management.\n\n\nEdit:  Obviously homeboy needed to report that shit as soon as possible.",
                ">It’s almost impossible, not completely, but almost impossible for anybody to get out of this facility without help,” she said of the Orleans Justice Center, a correctional facility where 1,400 people are being held.  \n\nSounds like cope to me. 😆",
                "Did you even say shank you once in this meeting?",
                "Even the prison’s here are just dilapidated pieces of crap.",
                "who knew building cheap jails and not bothering to properly maintain them would lead to escapes?",
                "English is not my first language, so can somebody please enlighten me: Do you get shivved with a shank or shanked with a shiv?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US must keep control of migrants sent to South Sudan in case removals were unlawful, judge rules",
            "external_url": "https://apnews.com/article/deportation-immigration-south-sudan-department-of-homeland-security-300e8c704402e2cb3c920d251b7fa876",
            "upvotes": 459,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sudan WTF is going on? Our country is lost.",
                "Imagine living your life like back in August just chilling and now you’re in South Sudan because of an election",
                "They're just going to ignore this ruling, again.",
                "Pretty sure that is human trafficking which is already unlawful.\n\nSo... Good job judge?",
                "Hmmm when was the last time any of these rulings were followed or enforced. They're just words now.",
                "Our country is being run by amoral idiots.",
                "Ok but they won't and nothing will come of it",
                "In case? So we're entertaining the idea that forcefully sending Americans to South Sudan is fine?",
                "How is it possible to trust Trump to do anything?",
                "I'm sorry but WTF am I reading here?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Reddit bans an anti-natalist group after Palm Springs explosion",
            "external_url": "https://www.nbcnews.com/tech/internet/reddit-bans-anti-natalists-palm-springs-explosion-rcna207677",
            "upvotes": 1465,
            "date": "05/21/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-palm-springs-fertility-clinic-ew-1108a-96a0f2.jpg",
            "top_comments": [
                "First time hearing of this sub.",
                ">On Monday, a Reddit spokesperson confirmed to NBC News that it had banned the r/Efilism subreddit after the explosion, which killed the suspect and injured four other people. Other anti-natalist subreddits remain on the platform.\n\nIf there's one thing Reddit wants to avoid, it's to be a staging platform for violence.",
                "I used to like lurking in that sub from time to time to remind myself what _bad_ weird looks like.",
                "I’ve never heard of anti natalists. I assume they’re the opposite of the “pro birth” crowd?",
                "If that is the case, they need to go back to any coverage of True Detective Season 1 and much of Rust's dialogue, because Pizzolato lifted his philosophy from Thomas Ligotti in his [*The Conspiracy Against the Human Race*](https://en.wikipedia.org/wiki/The_Conspiracy_Against_the_Human_Race).",
                "> Reddit said the community was banned because of the platform’s rules forbidding the promotion of self-harm.\n\nSo did that sub promote suicide? Using the wayback machine it looks like a kinda depressing sub, but none of the content looks like it promotes self harm. Seems like a philosophical sub for a bunch of negative, pessimistic, and sometiems depressed folks.\n\nNot sure I understand shutting it down, especially if there's no direct connection to the bomber.\n\nIt says writings by the bomber were being shared on the sub, but that's sadly predictable, and should be counteracted with responsible moderation. If it wasn't being moderated, sure, ban it. But it seems like they didn't even bother to give it a chance.\n\nWhatever though. Reddit is a for-profit endeavor now, and the days of a commitment to free thought are long gone anyways. So be it.",
                "All those extreme 'anti X' subs are so cringe. Fuckcars, petfree, childfree, etc..., they're the biggest toxic circlejerk places imaginable.",
                "Reddit can created a shit ton of domestic terrorist this year",
                "How about some more bans for the subs of people supporting exile to South Sudan?\n\n\nOh, silly me for even asking.",
                "Didn't know that nihilism was still a thing!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US judge says deportations to South Sudan likely violate court order",
            "external_url": "https://www.reuters.com/world/immigrant-rights-advocates-claim-us-violated-court-order-by-deporting-migrants-2025-05-20/",
            "upvotes": 9005,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sick and tired of judges stating that their orders are being violated and doing nothing more than politely asking for more information. \n\nLock someone up for contempt or STFU already",
                "Until there are consequences, Trump will continue violating the law at his pleasure.\n\n\nAnd there will be no consequences.",
                "Always “likely” or “alleged” or “potentially”.  Right up until the end",
                "We need to come up with a new term for this.\n\nWhen I read \"deport,\" I think of a person being returned to their home country so they can resume their old life... not sent into the middle of a civil war 7000 miles away from anyone they know.",
                "*The US government's travel advisory states \"do not travel to South Sudan due to crime, kidnapping, and armed conflict\".*\n\nOf those immigrants send there, none are from S. Sudan, so obviously this is some illegal retribution.",
                "\"The President of the United States is illegally deporting people to a dangerous country with an active travel advisory issued directly from the US State Department due to possibility of armed conflict and civil unrest\"\n\nFixed that for you, fucking idiots at Reuters.",
                "“The court has no army”",
                "Why the fuck is it always “likely” and “possibly” and “potentially” when this guy does something? Fucking journos.",
                "And so what? Not like anyone is going to do anything about it",
                "The Trump administration will just claim the courts said they couldn't send people to El Salvador they didn't say anything about Sudan."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "UN agency, Rohingya refugees allege Indian authorities cast dozens of them into the sea near Myanmar",
            "external_url": "https://apnews.com/article/india-rohingya-refugees-deportation-e724b7a9949192a5383f84eb98377026",
            "upvotes": 200,
            "date": "05/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> The Office of the U.N. High Commissioner for Human Rights, in a statement on Thursday, said at least 40 Rohingya refugees were detained in New Delhi and cast into the sea by the Indian navy near the maritime border with Myanmar. The refugees — **including children, women and older people** — swam ashore, but their whereabouts in Myanmar remain unknown, the agency said.\n\nSuch cruelty, fuck",
                "At first I was like... Maybe they got dropped off by the shore, but then:\n\n\"detained in New Delhi and cast into the sea by the Indian navy near the maritime border with Myanmar\"\n\nMaritime border sounds like It'd be a bit farther out. Anyone have an idea how far out to sea these folks were allegedly dumped?\n\nApparently, they were given flotation devices and told to fuck off towards shore, but Myanmar is where they were, allegedly, being genocided so... Out of the frying pan and into the fire?\n\nWhat a situation.",
                "Man the American administration is going to be so mad they didn't do this first.",
                "It's fake news, first ran by maktoob media then picked up by these idiots. It's a way to create pressure on government to stop deportations which are happening right now."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "New salmonella outbreak tied to same Florida grower with tainted cucumbers last year",
            "external_url": "https://apnews.com/article/salmonella-cucumbers-bedner-growers-254618f4ce92fa421a5b8e2187ec267d",
            "upvotes": 2408,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If corporations are people, what do we do to people that routinely poison people?",
                "As of May 19, the salmonella outbreak linked to cucumbers has sickened 26 people in the following 15 states:\n\n* Alabama\n* California\n* Colorado\n* Florida\n* Illinois\n* Kansas\n* Kentucky\n* Michigan\n* North Carolina\n* New York\n* Ohio\n* Pennsylvania\n* South Carolina\n* Tennessee\n* Virginia ",
                "sure wish that the FDA had a robust testing and tracking department",
                ">The cucumbers were sold to restaurants, stores and food service distributors between April 29 and May 19 and may still be within their shelf life this week. Illnesses were reported between April 2 and April 28, according to the U.S. Centers for Disease Control and Prevention.\n\nIt's crazy this warning got out. Considering the [Trump administration has stalled in posting food safety warnings](https://www.nbcnews.com/health/health-news/fda-stalls-posting-food-safety-warning-letters-staff-cuts-rcna204879).",
                "TLDR : the grower is Bedner's Farms of Boynton Beach, Florida... actually in unincorporated Palm Beach County just west of SR 7/ US 441 between Atlantic and Boynton Beach Boulevard. A likely contaminant is either undertreated waste water or sludge from residential recycled water treatment which is applied to the crops to water and/or fertilize them and things went south.",
                "We really dodged that government efficiency didn’t we?",
                "Living in NY we rely on imported food during the cold months.\n\nI, and many others I know, actively avoid Florida produce, it's always poor tasting and low quality.\n\nI gladly will pay for better quality from anywhere else.\n\nAnd all their citrus is green these days.",
                "Damn! I have a cucumber I haven't eaten yet in my refrigerator.\n\nGuess it's going in the garbage.",
                "Good news! By tis time next year they'll have this solved, since they won't be able to tell you WHERE it came from thanks to destructive cuts to the programs that monitor food saftey! i didn't say the good news was for us.",
                "Waiting for RFK Jr to suggest the solution is to stop testing sick people for salmonella."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "George Wendt, actor who played Norm on ‘Cheers,’ dead at 76",
            "external_url": "https://www.cnn.com/2025/05/20/entertainment/george-wendt-death",
            "upvotes": 3747,
            "date": "05/20/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-138362751.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Daaaaaaaaaaaaa Bears.\n\n\nR.I.P. You comedic legend.",
                "The hunter finally caught up to the buffalo.\n\nSee you at the bar, Norm. 🍻",
                "Hard to believe he was just 35 when Cheers started...",
                "For everyone's enjoyment: https://www.youtube.com/watch?v=VXED2AVlbR0",
                "Damn.  One of my best days working i ever had was behind the bar in a pub in the UK. I looked up at the gent sitting at the end of the bar. Couldn't believe that I got to serve a beer to 'Norm'. It felt surreal. He was such a nice guy, happy to chat the day away. Rest easy big fella.",
                "No more underwear made of milk bones.\n\nRIP Norm.",
                "“It’s a dog eat dog world, Sammy; and I’m wearing milkbone underwear.” -Norm",
                "I can see him at the pearly gates: \"NORRRRM! How's life treating you?\"\n\n\n\"Well, I'm kind of done with it now...\"",
                "Want a beer Mr Peterson?\n\nIsn't it a little early Woody?\n\nFor a beer?\n\nNo, stupid questions.",
                "RIP to a legend.\n\nFinally can change out of those Milk Bone shorts."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "First US utility seeks permit for a small nuclear reactor",
            "external_url": "https://apnews.com/article/new-nuclear-reactors-tennessee-valley-authority-da3b72b3305982f2596ba6daef2d9ae8",
            "upvotes": 556,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "nuclear has come a long way and without a breakthrough elsewhere it remains an important stepping stone to more sustainable power. Glad to see this step being taken",
                "Need more of these small reactors that can now be used by \"old\" uranium. that we could no longer use at one point due to technology no allowing it.",
                "I'm so glad the protective regulations of nuclear power are so well and strong, epa has never been better. Now no company is going to abuse and remove necessary systems to save fractions of a cent!\n\nOh right.",
                "Eh, unless 200 orders for these are coming in, nuclear  dead. I like nuclear. But from an economic standpoint it's dead. For the time it takes to install, you can build a wind farm and start generating revenue from the day you connect the first wind turbine. Same for solar nuclear though, it's gonna take 5 years even for a SMR to get it turned on, if you're lucky. And with the first one off the line, we're more likely to see the f47 take flight than this thing to turn on. \n\n\nNow as for all the idiots who want to mention safety, light water SMRs have been operating  for decades aboard US Naval ships and subs, without a single accident for 70 years. There's no industrial safety record in any industry that even approaches it. There's a few things about light water reactors that actually make them safer, though not as uranium efficient as their larger counterparts, much like how a campfire is much safer and easier to manage than a bonfire, you're just heating a smaller space. \n\n\nAbout the only thing the NRC is built to handle regulation wise is a light water reactor. The science has practically been solved for decades and grad students can build validated working models that run on laptops these days.",
                "I’m glad to see TVA take the lead here. I worked I. Their nuke plants in the early 90’s. Interestingly they were started via a federal jobs/rural electrification program",
                "I don’t usually like privatization, but I’m glad to see that nuclear energy is finally gaining traction. We need to start funding science again so we can work on nuclear fusion and all this other stuff.",
                "I’m still waiting for my Mr Fusion from 2015!",
                "The modern safety standards for small modular reactors don't exist. These SMRs are not currently powering cities anywhere in the US. Afaik There are no real world examples to look to in terms of what is safe/works and what doesn't when these SMRs are live, patched into the grid. SMR developers want to regulate as they innovate.\n\nThese same companies and states that want nuclear, like Utah, are suing the NRC to allow SMRs to be regulated by each state independently in order to create a competitive regulatory environment in the hopes of speeding up the process by which modern safety standards can be made. \n\nWhile speeding up innovation to outcompete foreign development is a good goal, speeding up regulation by regulating as you go may result in increased risk.\n\nhttps://www.wired.com/story/nrc-lawsuit-nuclear-energy-reactor-smr-regulation-regulatory-commission/",
                "This is prob a little off topic but in the Fallout universe the companies who handle the nuclear power almost always dispose of the waste in the most shady and comically dangerous ways possible to save a buck wherever they can and I feel like that's just gonna be a reality now. lol.",
                "ANd in a few decades we'll read something like https://www.printweek.com/content/news/kodak-park-was-home-to-secret-nuclear-reactor along the lines of \"found a forgotten nuclear reactor in the basement of <obscure little regional utility>\" because everybody and his dog who can't weven guarantee to exist long enough to take out the trash will start building them. Without even having the cash to clean it up if nothing unplanned happens.\n\nHave you ever read the story of the Soviet Union's nuclear lighthouses (\"nuclear batteries\", my ass -- unless someone wanted to make glow-in-the-dark Duracell rabbits)? This happens when an economy on the way down plays with this kind of stuff."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Personal secretary and adviser to Mexico City's mayor killed in attack",
            "external_url": "https://apnews.com/article/mexico-sheinbaum-cartel-attack-97b8c6ce26ce5b7212bba49bcdd03c9f",
            "upvotes": 2836,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "If only you could nuke the cartel specifically.   Mexico is such a beautiful place, hate that they make it worse.",
                "Things are worse that what the government media tells you here.",
                "I remember when AMLO when on 60 minutes last year and said there was no cartel problem in Mexico and that the USA has a more of a gang problem lmao. Just waiting for tom Clancy’s Clear and Present Danger to become real life Mexican lore",
                "That site is cancer.  There were so many ads I couldn't read anything.",
                "Seriously, we should be extending SOME sort of assistance to Mexico to deal with their crime problems.  There has to be something we can do that isn't \"hi we are going to invade your country with our military and kill your bad guys\" but also isn't \"lol not our problem\"",
                ">Homicides were up slightly in Mexico’s capital during the first quarter of this year compared with the same period last year.\n\nSuch a meaningless fact to throw in a story about a targeted murder.",
                "This yet another example that points to the fact that the US does not have an immigration issue.\n\nNorth America has a humanitarian crisis.  Fix the Cartel problem and so many issues would go away.",
                "The only thing that could take on the cartels is the global oil industry.",
                "Terrible news, my thoughts are with their family and everyone affected by this tragedy.",
                "It’s insane how they’ve allowed thugs to control the country."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "New Trump vaccine policy limits access to COVID shots",
            "external_url": "https://apnews.com/article/vaccines-fda-kennedy-covid-shots-rfk-trump-bb4de15b6ff955d6cd0b406aaec3cdc5",
            "upvotes": 13895,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Amazing how quickly we went from \"if you want the shot get it, but don't force it on me\" to preventing everyone from getting it.",
                "What happened to this shit being between me and my doctor?\n\nOh. Right. You can't be a republican without the homicidal hypocrisy.",
                "Vaccine tourism coming soon.",
                "[From the NY Times article:](https://www.nytimes.com/2025/05/20/health/fda-covid-vaccines.html?unlocked_article_code=1.Ik8.7u6N.KYhtZby1oZKJ&smid=url-share)\n\n> Some experts said the new criteria go too far, erecting barriers for people who will want the shots.\n\n> “This is overly restrictive and will deny many people who want to be vaccinated a vaccine,” Dr. Anna Durbin, director of the Center for Immunization Research at Johns Hopkins University, said in an email.\n\n> The changes do “not make sense from a public health perspective,” she said.\n\n> Some experts said that while they agreed with aspects of the new rationale, the new restrictions would unnecessarily limit access for healthy Americans who may be at high risk because of their occupation or for other reasons.\n\n> This “doesn’t preserve people’s choice to get vaccinated,” she added.\n\nI understand that a large swath of the population was angry that (they believed) they were forced into receiving a vaccine they didn't want in order to reduce risk for transmission of a disease they didn't believe in. As a result, we now have a party in charge who is making it so that others can't get vaccines *even by their own choice.* Whenever people say that both sides are the same, I just shake my head.",
                "He'll never ever be man enough to admit he was wrong.",
                "There it is. The first step to actively impede vaccination. It will get worse from here.",
                "Republicans in 2021- “ No one should be forced to get a vaccine they don’t want. Medical freedom!”\n\nRepublicans in 2025- “We’re going to prohibit everyone from getting immunization and medical care even if they want or need it”",
                "He and RFK Jr cry that people should have a choice to get the vaccine or not.  Then they proceed to take away the choice for people who want it.",
                "This is what happens when you sell healthcare head jobs for elections.",
                "\"Don't take medical advice from me\" -RFK\n\n\"Actually, you can't get a shot even if you want it\" -Also RFK"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Maintenance worker says inmate threatened to shank him if he didn't assist in New Orleans jail break",
            "external_url": "https://apnews.com/article/new-orleans-jail-escape-inmates-arrest-45f2a4be028254cc2587f50deb9af44d",
            "upvotes": 767,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\\*Since the escape, Hutson has pointed to long-standing deficiencies such as [faulty locks](https://apnews.com/article/jail-louisiana-escape-lock-2b2c8ae12a1e114823af8edf6467b911) and staffing shortages. **But a growing number of state and local officials have said blame for the escape rests squarely on her for failing her responsibility to keep inmates locked up.\\***\n\nNot absolving the City or Parish of any blame here but I'm willing to bet that the state shares a significant porton of the blame. The state is willing to close rural hospitals and under-fund schools in order to keep that public safety budget nice and fat, but its not like that money goes to actually making the jails and prisons here less shit. Louisiana runs on the Good Ole Boys system.",
                "I'm just saying, if we're giving the maintenance guy the benefit of the doubt, if he was being threatened and he didn't think reporting it to the prison management team was going to get him anywhere, the breakout is on prison management.\n\n\nEdit:  Obviously homeboy needed to report that shit as soon as possible.",
                ">It’s almost impossible, not completely, but almost impossible for anybody to get out of this facility without help,” she said of the Orleans Justice Center, a correctional facility where 1,400 people are being held.  \n\nSounds like cope to me. 😆",
                "Did you even say shank you once in this meeting?",
                "Even the prison’s here are just dilapidated pieces of crap.",
                "who knew building cheap jails and not bothering to properly maintain them would lead to escapes?",
                "English is not my first language, so can somebody please enlighten me: Do you get shivved with a shank or shanked with a shiv?"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/21/2025 04:13:05 UTC"
}