{
    "posts": [
        {
            "category": "HOT",
            "title": "US ‘deletes evidence’ of Russia’s kidnap of thousands of Ukrainian children",
            "external_url": "https://www.independent.co.uk/news/world/europe/trump-ukraine-children-russia-war-kidnapping-evidence-b2717730.html",
            "upvotes": 24489,
            "date": "03/19/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/18/13/58/SEI244319340.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "Great. Our actions are now complicity.",
                "Just a reminder that Trump pardoned more known pedophiles than any other US President in history",
                "Summary:\n\nThe US State Department allegedly deleted evidence collected by Yale University’s Humanitarian Research Lab, which was tracking Russian war crimes, including the abduction of 35,000 Ukrainian children. The deletion has hindered efforts to rescue the children and prosecute those responsible, including Russian President Vladimir Putin. The Yale project, funded by the US government until last month, monitored 116 sites in Russia using satellite imagery and other surveillance tools.\n\nSources suggest the deletion may have been accidental or intentional, raising potential legal risks for the Trump administration under international war crimes laws. The lost data was also being shared with the EU for its own investigations. The destruction of evidence not only affects legal cases but also complicates ongoing rescue missions.\n\nThe Yale project played a key role in gathering evidence that contributed to six ICC indictments, including against Putin and his commissioner for children’s rights. Russia has been accused of forcibly transferring Ukrainian children, issuing Russian passports in occupied areas, and erasing Ukrainian identity. The loss of the secure “Caesar” database has been described as a violation of the Geneva Convention, which prohibits destroying war crimes evidence. The US State Department has yet to respond.",
                "Greenlighting child abductions. \n\nFeeling free and brave yet, republicans?",
                "Not super familiar with International wartime law... but isn't covering up a war crime a war crime?",
                "Trumps fan boys been real quiet recently haven't they.\nMust be tiring having to generate excuses for things like this around 10 times a day at the moment.",
                "This is disgusting and heartbreaking and I hope every single person that voted for Trump has this shoved in their face. You are part of the reason this war criminal gets to continue to tear families apart and these children, THESE CHILDREN, may never see their families again.",
                "i really hope some kind of back up  have been sent to partners outside us",
                "MAGA are pro rape, molestation and trafficking.",
                "The party of family values, everyone."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Ben & Jerry's claims Unilever ousted its boss over political activism",
            "external_url": "https://www.bbc.com/news/articles/ckg8pk9rpx4o",
            "upvotes": 20390,
            "date": "03/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d7be/live/d33cbd20-0485-11f0-9776-23d43d9c7fe7.jpg",
            "top_comments": [
                "It doesn’t look like this has gone through yet according to the article. Guess we will see what the independent board decides.",
                "Back in the 80s, Ben & Jerry’s had a corporate 5 - 1 plan.  The highest paid employee (including CEO) could make no more than 5 times the salary of the lowest paid employee.",
                "“Mr Stever has been with Ben & Jerry’s since joining the firm in 1988 as a tour guide. He was appointed chief executive in 2023.”\n\nHoly shit this rules.",
                "Buy an activism by design brand then fire the activists. Sounds about right.",
                "Sounds like the parent company violated the agreements they had with Ben and Jerry’s. It’s always been a politically active brand. ",
                "Did they really think selling their brand to a corporation would end any other way?",
                "\"It comes a month after the ice cream company accused Unilever of demanding that it stops publicly criticising US [Supreme Leader] Donald Trump.\" \n\nWell... you know what to do.\n\n https://en.m.wikipedia.org/wiki/List_of_Unilever_brands",
                "B+J is a very good example of why a company shouldn't go public.",
                "Stop letting billionaires buy your companies if you don’t want them to control your companies",
                "The Americone Dream is over."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "‘I escaped one gulag only to end up in another’: Russian asylum seekers face Ice detention in the US",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/i-escaped-one-gulag-only-to-end-up-in-another-russian-asylum-seekers-face-ice-detention-in-the-us",
            "upvotes": 3268,
            "date": "03/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d3986542f93dd806c8f7ce93c79795eb3114ad7/793_97_3207_1925/master/3207.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2a0101e0828ed798db1717bf821bbab6",
            "top_comments": [
                "I found the article and this quote interesting, did not know this fact!\n\n>For years, Russians have been among the top [five](https://tracreports.org/reports/751/) nationalities granted asylum (in the USA).\n\nI know my state has a pretty large population of Russian immigrants (I think I saw some stat that said it was the third most common native language behind English and Spanish) but IIRC most of them date from the late 80s/90s.",
                ">For years, he criticized Putin’s regime on Facebook, and he was detained twice at protests\n\nWell I guess now he knows why America shoved him into a Gulag.",
                "This reminds me of the guy who was in Hiroshima when the US dropped the bomb on it and he survived. He then fought his way through to Nagasaki where he had family. After days of walking he arrived in Nagasaki just in time to have the second nuclear bomb dropped on his head. He also survived the second one.\n\nNow I'm conflicted. Is he the luckiest guy to ever live or the unluckiest?",
                "This has been going on for  a while, I recall reading a story at least 25 years ago about a Scottish citizen who overstayed his tourist visa by a few days and ended up in an immigration detention center for several months.",
                "Welcome to murica comrade, meet the new boss, same as old boss, enjoy your stay.",
                "Probably should have tried an actual functioning democracy.",
                "Land of the free home of the brave?",
                "Well, it was a cretinous idea to have picked the US to begin with\n\n“Land of the free and brave” AH please.",
                "They should have went to a free country.",
                "Why are Russians being accepted at all?"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "HOT",
            "title": "Large police presence near CIA headquarters",
            "external_url": "https://www.fox5dc.com/news/large-police-presence-near-cia-headquarters-police.amp",
            "upvotes": 2347,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“FAIRFAX COUNTY, Va. - A barricade incident at CIA headquarters in McLean, VA has prompted a large police presence in the area. \n\nWhat we know:\nThere appears to be a SWAT team, Arlington County, and Fairfax County officials on the scene gearing up, along with other officials gearing down. A bomb squad also appears to be on the scene as well, it is unconfirmed if there is a bomb in the area. \n\nAccording to Fairfax County police, Dolley Madison Blvd is shut down in both directions between Georgetown Park and Savile Lane because of a barricade incident.“",
                ">FAIRFAX COUNTY, Va. (WJLA) — A person was making threats at the gate of the CIA headquarters Wednesday morning, CIA officials confirmed to ABC News.\n\n>Officials said that a man pulled out a handgun and pointed it at CIA headquarters in McLean, Virginia. No shots have been fired and no injuries were reported, according to a law enforcement official.\n\nhttps://wjla.com/news/local/cia-headquarters-threats-police-presence-bomb-squad-team-fairfax-county-police-mclean-safety-public-government-trump-administration#",
                "Jesus Christ it’s Jason Bourne",
                "I suspect a lot of the response is nothing to do with the actual situation. There is a plan for incidents at CIA HQ and it's designed to deal with major incidents, but the rule is that if there's an incident, you follow the plan.",
                "I said from the beginning, the STUPIDEST thing they did with DOGE was to send them in there terminating and ticking off CIA and FBI organizations.  They'll get the same effect US CPA got by disbanding Saddam's Sunni elite guards.\n\nNot to mention ... they had NO IDEA WHAT THEY WERE DOING:\n\n“Why are American taxpayer dollars being spent to maintain empty buildings?” a 2024 post from the official Doge account reads.  \n\nLATER HEADLINE: ‘Secret CIA base mistakenly exposed in Doge government building sell-off’\n\n[https://www.yahoo.com/news/secret-cia-mistakenly-exposed-doge-205439724.html](https://www.yahoo.com/news/secret-cia-mistakenly-exposed-doge-205439724.html)",
                "Decent info here https://www.ffxnow.com/2025/03/19/developing-police-respond-to-cia-hq-in-mclean-for-barricade-incident/",
                "I don't know.  Perhaps Hegseth had a bit too many last night, still half in the bag, and, instead of heading to the Pentagon, was rushing to work thinking he was CIA director this morning.",
                "[deleted]",
                "Looks like an individual is having a mental health crisis.",
                "Was it DOGE? Would be amusing if it was."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "NYC man who ‘sextorted' girl, created child pornography gets life in prison",
            "external_url": "https://www.nbcphiladelphia.com/news/local/zachary-williams-life-sentence-child-pornography-new-york-jersey-hotel/4137842/",
            "upvotes": 1276,
            "date": "03/19/2025",
            "thumbnail": "https://media.nbcphiladelphia.com/2024/10/GettyImages-536042165.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Why is \"Man who raped, extorted 13-year old gets life in prison\" such a hard headline to write?",
                "Now do the Tate brothers ",
                "It still feels like it isn’t enough.",
                "Serves him right, and when the inmates find out what he's done, he's likely gonna be toast",
                "Soon to be pardoned by trump.",
                "how on earth did a 13-year-old kid get to the hotel by themselves without their parents knowing?\n\nI never understand how these things still happen with the amount of stranger danger kids are taught, how hard it is to get around a town if you don't drive, etc.",
                "Should have run for president",
                "He would've been fine if only he was Republican.",
                "Good Good Good \n\n\nThis happened to me on a massive scale and still is to some extent. ",
                "Cool. Now do the GOP. And the Catholic church."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Ukraine to compile list of energy sites Russia must stop attacking, Zelensky says",
            "external_url": "https://kyivindependent.com/ukraine-to-create-list-of-energy-infrastructure-civilian-sites-russia-must-cease-attacking-zelensky-says/",
            "upvotes": 850,
            "date": "03/19/2025",
            "thumbnail": "https://assets.kyivindependent.com/content/images/2023/02/gettyimages-1247442902-1677276960d6gz6.jpg",
            "top_comments": [
                "Which will promptly be attacked.",
                "Couldn’t they just say stop attacking ALL of the energy sites? 🤷‍♂️",
                "Such a weird surreal war \n\nTalking about it like it’s a Queensbury Rules boxing match. \n\n(But. It isn’t really. Not at all in fact).",
                "It would be interesting for Ukraine to seed a few random fields into the list, just to see how Ruzzia treats them. Something like:\n\n**Critical Site #536**: Super-expensive Hydrocarbon de-trymehyficationism plant [which is actually a derelict scrap yard]",
                "The powerful democratic assistance of the United States, at your service. “Please don’t attack us at A, B, and C.”",
                "This is a line in the sand. It’s a way for Ukraine to say “See, Russia was told not to attack these in a cease fire and they didn’t comply.”  It’s about pointing out Trump’s inability to control Russia.",
                "\"Ah, a list of targets\" -Putin probably",
                "How about stop attacking all energy sites?",
                "Sounds like that would be a target list.",
                "Reverse psychology, maybe? Kind of like how the UK incurred Hitler's wrath during the Blitz which tricked him into refocusing his bombing efforts away from airbases and onto civilian targets."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Hungary bans LGBTQ+ Pride marches",
            "external_url": "https://www.bbc.co.uk/news/articles/c5y0zrg9kpno",
            "upvotes": 822,
            "date": "03/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b138/live/7d758200-04da-11f0-a805-7522e84d4840.jpg",
            "top_comments": [
                "The biggest problem under the slogen of “save the children, ban the Pride” they restricted the freedom of assembly law. So Orbán could ban any assembly, march or protest in the country without control.",
                "Looks like pride is a protest again, friends.",
                "Coming to America Soon™️",
                "Republicans LOVE Orban.  Turning America into Hungary or Russia is their objective.",
                ">[First they came](https://encyclopedia.ushmm.org/content/en/article/martin-niemoeller-first-they-came-for-the-socialists)  for the socialists, and I did not speak out—because I was not a socialist.\n\n>Then they came for the trade unionists, and I did not speak out—because I was not a trade unionist.\n\n>Then they came for the Jews, and I did not speak out—because I was not a Jew.\n\n>Then they came for me—and there was no one left to speak for me.\n\n—Martin Niemöller",
                "Yeah cause cost of living and grocery prices aren’t a a thing. It’s all the gays fault guys!! What is wrong with everyone?!",
                "Coming to the US shortly…",
                "Guess it's time to march even harder then.",
                "Just change the name to LGBTQ+ humility walk.",
                "I don’t get these bans, if they’re peaceful and children friendly who gives a shit. Leave people alone."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "Hollywood director Carl Erik Rinsch charged with defrauding Netflix out of $11 million",
            "external_url": "https://www.cbsnews.com/news/netflix-fraud-charges-carl-erik-rinsch/",
            "upvotes": 2060,
            "date": "03/19/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/18/3245de75-577f-40d9-a141-ffee6cf17fe9/thumbnail/1200x630/83d8aafda39da35c6132ecc39d4aa57f/gettyimages-489721890.jpg?v=765ef194a4bf4701e45ec9d5712af42f",
            "top_comments": [
                "> From there, Rinsch spent about $10 million on personal expenses and luxury items in a spending spree that, according to prosecutors, included about $1.8 million on credit card bills; **$1 million on lawyers to sue Netflix for more money;** $3.7 million on furniture and antiques; $2.4 million for five Rolls-Royces and one Ferrari; and $652,000 on watches and clothes.   \n   \n   \nNow that’s audacious.",
                "> A Hollywood writer-director was arrested Tuesday on charges that he swindled $11 million from Netflix for a sci-fi show that never aired, instead steering the cash toward cryptocurrency investments and a series of lavish purchases that included a fleet of Rolls-Royces and a Ferrari.\n\n> Carl Erik Rinsch, perhaps best known for directing the film \"47 Ronin,\" has been charged with wire fraud and money laundering over what federal prosecutors allege was a scheme to defraud the streaming giant. [...]\n\n> Prosecutors said Netflix had initially paid about $44 million to purchase an unfinished show called \"White Horse\" from Rinsch, but eventually doled out another $11 million after he said he needed the additional cash to complete the show.\n\n> Rather than using the extra money to wrap up production, Rinsch quietly transferred the money to a personal brokerage account, where he made a series of failed investments that lost about half of the $11 million in two months, according to prosecutors.\n\nMakes massive investments with other people's money, loses money. Gambles in crypto, makes some profit, proceeds to buy luxury goods instead of paying his debts.\n\nThis man would be welcome on r/wallstreetbets.",
                ">A Hollywood writer-director was arrested Tuesday on charges that he swindled $11 million from Netflix for a sci-fi show that never aired, instead steering the cash toward cryptocurrency investments and a series of lavish purchases that included a fleet of Rolls-Royces and a Ferrari.\n\nA fleet? Who needs a fleet of Rolls-Royces?",
                "Hulu has acquired the rights to his story and will be releasing a limited series next year",
                "Bizarre \n\nHe was making millions legitimately.\n\nNow he’ll never work again and will be financially ruined.\n\nNetflix are clearly vulnerable to fraud and will want to make an example. Civil suits to follow!",
                "Never trust a guy with a ponytail.\n\n  \n*puts hair under a cap*",
                "Can't wait for the Netflix movie about this.",
                "This is straight up mental illness.",
                "He was just using some good old-fashioned Hollywood accounting.",
                "This guy’s Wikipedia page is a trip."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Nicholas Prosper: Teenager who murdered mother and siblings and planned school massacre jailed for at least 49 years",
            "external_url": "https://news.sky.com/story/teenager-who-murdered-family-and-planned-school-massacre-jailed-for-at-least-49-years-13331045",
            "upvotes": 921,
            "date": "03/19/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-nicholas-prosper-mugshot_6861312.jpg?20250319132034",
            "top_comments": [
                "> Mrs Justice Cheema-Grubb said Prosper had not hated his mother or siblings and had \"had a good life with them\", but that his intention had been to kill them in their sleep and rape his sister.\nEach victim suffered the anguish of anticipating or being aware of the deaths of others,\" she said.\n\nHis siblings were 16 and 13. I cannot imagine the terror and betrayal his mother and siblings felt in their last moments. Hopefully they do not let him out at the minimum term, he should be jailed for as long as possible.",
                "Jesus... And it wasn't even some like traumatized bullying victim type, or like unable to grasp the consequences... The guy just thought it'd be awesome to massacre elementary school students and murder and uh... Sexually assault his family.\n\nGood riddance.",
                "The murders were in Luton, England, on 13 September 2024. I am surprised the trial was over so quickly, even with a confession.",
                "I mean he will never be released but should have been a whole life order. Why give someone even a slither of chance of doing it in his twilight hours.",
                "I don’t understand sentencing over there. I understand that they have strict human rights laws that affect life sentences but 3 people? Almost his entire family? He should never be released.",
                "The more I read about this the worse it gets...",
                "That's it? Put him away for much much longer",
                "Why is this not a life sentence?",
                "This is behavior of a disturbed individual. I highly doubt there were no signs of mental unwellness prior to the event. These crimes are always an escalation of behaviors.",
                "Anyone ever tell him his glasses are too small for his head?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Social Security Administration to require in-person identity checks for new and existing recipients",
            "external_url": "https://apnews.com/article/social-security-fraud-waste-doge-elon-musk-212e3089951f731fd3f83443e104b315?utm_source=copy&utm_medium=share",
            "upvotes": 9724,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The waiting room is going to look like it did Beetlejuice.",
                "Didn’t they just close a bunch of SS offices?",
                "Now is the time to establish an identity on MySSA.gov\n\nEveryone who has ever worked in the US should do that. You should be checking on your SSA earnings regularly long before you retire. Especially to make sure your employer is paying into it.\n\nEdit: it also detects identity theft of your SSN. If someone is using your SSN the contributions will show up.\n\nEdit2: the website is only open during their business hours.\n\nEdit3: try https://www.ssa.gov/prepare/plan-retirement",
                "What are they gonna do for survivor beneficiaries? Have an 8 year old drag their parent’s body across the floor?",
                "Wow.\n\n  \nIt is already a hassle enough if you're in a decent sized metro area. Now imagine being in rural Nebraska and having to go identify in person at the SSA office...",
                "I waited on a call for 3 hours the other day to be told I had to go to the social security office in person and present some info to get an update, when I went to the office I was told I had to have an appointment and to call the same number I had the other day and there was no walk in appointments.. tried calling and they weren’t letting people sit on hold and to just call back later.. so I got no appointment.. this is going to be a shit show",
                "Ahh yes the old and disabled population, known for their high mobility and driving skills.\n\nFuck this country.",
                "WAKE UP.  while they cant slash the money going to your pockets directly yet, they are intentionally making things inaccessible and difficult for the people. Imagine the elders that have no internet, no reliable transportation, rely on physical mail. This is inhumane, almost like they wanna cull the people receiving entitled benefits. Except this is death by a thousand cuts. Sickening.",
                "Fucking over the core GOP constituency. That’s a bold strategy. Let’s see how it plays out for them.",
                "So they want a person who might be hospitalized to go to the social security administration to get their checks.  \n\nHe is like:  since they won’t let me end social security, I will make it impossible for people to get their checks."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "A teenager who was planning a mass shooting at his old primary school has been jailed for life with a minimum term of 49 years for murdering his family.",
            "external_url": "https://news.sky.com/story/nicholas-prosper-teenager-who-murdered-mother-and-siblings-jailed-for-at-least-49-years-13331045",
            "upvotes": 2,
            "date": "03/19/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-nicholas-prosper-mugshot_6861312.jpg?20250319132034",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Commerce Secretary Howard Lutnick Disbands PPAC and TPAC",
            "external_url": "https://ipwatchdog.com/2025/03/18/secretary-lutnick-disbands-ppac-tpac/id=187394/",
            "upvotes": 4,
            "date": "03/19/2025",
            "thumbnail": "https://ipwatchdog.com/wp-content/uploads/2025/03/Howard-Lutnick-500.jpeg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Turkish authorities have detained the mayor of Istanbul, just days before he was due to be selected as a presidential candidate.",
            "external_url": "https://www.bbc.com/news/articles/c5yren8mxp8o.amp",
            "upvotes": 2,
            "date": "03/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/497f/live/7169b080-04bc-11f0-97d3-37df2b293ed1.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump fires both Democratic commissioners at FTC",
            "external_url": "https://www.reuters.com/world/us/trump-fires-both-democratic-commissioners-ftc-sources-say-2025-03-18/",
            "upvotes": 21,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Dictator just doing dictator things, nothing to be alarmed of"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Amtrak CEO Stephen Gardner resigns effective today \"to ensure that Amtrak continues to enjoy the full faith and confidence of this administration.\"",
            "external_url": "https://www.cnn.com/2025/03/19/business/amtrak-ceo-steps-down?cid=external-feeds_iluminar_google",
            "upvotes": 9,
            "date": "03/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1496428067.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Great, I've got a ticket for a trip in a couple of months. I should probably start planning for alternative transportation in case they blow shit up.",
                "“I think we should privatize anything that can be privatized, just so you’ve got a feedback loop for improvement, is what happens when something’s privatized,”  - Musk\n\nWhat he really means is that we need more avenues for the rich to get richer and the poor to get poorer. This is how the country gets better right? After all, we have many examples of services being privatized and then improving greatly... /s"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Germany updates US travel advice after citizens detained",
            "external_url": "https://www.reuters.com/world/europe/germany-updates-us-travel-advice-after-citizens-detained-2025-03-19/",
            "upvotes": 45,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Basically if you want to risk being detained with no due process most likely tortured and mistreated. Travel to the US.  WOW what a self own down there in the US of A",
                "No way will I go to the US in the near future",
                "Danke USA ! \nYou have nothing to offer anyway - our Euros are going somewhere else. \nLet us know when you discover democracy and stop being in 1933.",
                "“Don’t. Go. To. America.”\n\nYes. That’s all. \n\nJust fucking avoid it.  \n\nHow long?\n\nTen years minimum.",
                "We'll get like North Korea or Afghanistan or Russia. No reasonable Westerner will visit.",
                "So long Pax Americana….",
                "Trump is really brilliant. The U.S. tourism market is worth 2.36 trillion dollars annually. \n\n  \nDoes making america great again include decimating its global lead in tourism revenue?",
                "So many expat desires suddenly..."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "The EU wants to break its security dependency on the US and buy more European weapons",
            "external_url": "https://apnews.com/article/eu-defense-us-ukraine-industry-ammunition-weapons-ea03077814f9113b548d7281f32a11b5",
            "upvotes": 154,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Lockheed Martin and Raytheon have got to be frothing at the mouth about this.",
                "\"Shop smart, shop Euro-Mart, for all your ballistic needs.\"",
                "I bet the defense contractors really love hearing that.",
                "It really is the end of US hegemony, this is a fascinating time. As the economy crumbles and global influence wanes, the military discrepancy is all the US has left to set itself apart.",
                "The golden age of America is here!",
                "Probably for their own good honestly."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "NEW",
            "title": "Israel launches new 'limited ground invasion' of Gaza amid deadly bombardment",
            "external_url": "https://news.sky.com/story/israel-launches-new-limited-ground-invasion-of-gaza-amid-deadly-bombardment-13332072",
            "upvotes": 151,
            "date": "03/19/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-israel-gaza_6861473.jpg?20250319181111",
            "top_comments": [
                "It’s always ‘limited’ and ‘temporary’ until it becomes unlimited and permanent. Netanyahu is a liar, a psychopath and a war criminal.",
                "Limited to 500square KM and they’ll only attack things that are mammals",
                "Just constant good news lately huh? Its crazy that its 2025 and we still cant figure shit out",
                "Does the limited part mean they only kill kids?",
                "Oh look, Israel and Russia employing the same techniques.",
                "Israel is a terrorist state. And the biggest Hamas recruiter in the world.",
                "Israel has to get rid of any possible resistance before they can “relocate” all Gazans.",
                "It's almost like we all would have been better off with the guy (or his VP) who wanted to stop the war and bring home the hostages, and did.  And not the guy that wants to bulldoze Gaza for hotels and beach front property.",
                "I think in my lifetime I’ll see someone use a nuclear weapon against Israel. And everyone will wonder why",
                "Very good! Time to get the hamas scum"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Fed holds interest rates steady, still sees two cuts coming this year",
            "external_url": "https://www.cnbc.com/2025/03/19/fed-rate-decision-march-2025.html",
            "upvotes": 167,
            "date": "03/19/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118548-17424111102025-03-19t185641z_1495103926_rc2igdadxwbh_rtrmadp_0_usa-economy-fed.jpeg?v=1742411251&w=1920&h=1080",
            "top_comments": [
                "Powell trying to keep DOGE from firing him by predicting 2 rate cuts this year.  No way that happens unless Trump does a 180 on tariffs in the next month or so.",
                "Welp, we're definitely getting the economy 1/3 of the country voted for. Congrats, I guess?",
                "Going with tradingeconomics estimation of US economy in 2024 of 28T, less than one quarter of trump costed US around 112B USD in lower economic growth. Let's see if he can improve this number.",
                "Oh, and my favorite thing:\n\nFED:\n\n\\-inflation will increase\n\n\\-growth will be slower\n\n\\-for now we keep doing what we told we will do\n\n\\-more members of board are actually expecting that we may need to slow down interst rate cuts.\n\nMarkets: \"You mentioned rate cuts? That's all I needed to hear, fam\".\n\nStocks go brrrrrrrr...."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Ukraine to compile list of energy sites Russia must stop attacking, Zelensky says",
            "external_url": "https://kyivindependent.com/ukraine-to-create-list-of-energy-infrastructure-civilian-sites-russia-must-cease-attacking-zelensky-says/",
            "upvotes": 853,
            "date": "03/19/2025",
            "thumbnail": "https://assets.kyivindependent.com/content/images/2023/02/gettyimages-1247442902-1677276960d6gz6.jpg",
            "top_comments": [
                "Which will promptly be attacked.",
                "Couldn’t they just say stop attacking ALL of the energy sites? 🤷‍♂️",
                "Such a weird surreal war \n\nTalking about it like it’s a Queensbury Rules boxing match. \n\n(But. It isn’t really. Not at all in fact).",
                "It would be interesting for Ukraine to seed a few random fields into the list, just to see how Ruzzia treats them. Something like:\n\n**Critical Site #536**: Super-expensive Hydrocarbon de-trymehyficationism plant [which is actually a derelict scrap yard]",
                "The powerful democratic assistance of the United States, at your service. “Please don’t attack us at A, B, and C.”",
                "This is a line in the sand. It’s a way for Ukraine to say “See, Russia was told not to attack these in a cease fire and they didn’t comply.”  It’s about pointing out Trump’s inability to control Russia.",
                "\"Ah, a list of targets\" -Putin probably",
                "How about stop attacking all energy sites?",
                "Sounds like that would be a target list.",
                "Reverse psychology, maybe? Kind of like how the UK incurred Hitler's wrath during the Blitz which tricked him into refocusing his bombing efforts away from airbases and onto civilian targets."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "‘I escaped one gulag only to end up in another’: Russian asylum seekers face Ice detention in the US",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/17/i-escaped-one-gulag-only-to-end-up-in-another-russian-asylum-seekers-face-ice-detention-in-the-us",
            "upvotes": 3276,
            "date": "03/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/7d3986542f93dd806c8f7ce93c79795eb3114ad7/793_97_3207_1925/master/3207.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2a0101e0828ed798db1717bf821bbab6",
            "top_comments": [
                "I found the article and this quote interesting, did not know this fact!\n\n>For years, Russians have been among the top [five](https://tracreports.org/reports/751/) nationalities granted asylum (in the USA).\n\nI know my state has a pretty large population of Russian immigrants (I think I saw some stat that said it was the third most common native language behind English and Spanish) but IIRC most of them date from the late 80s/90s.",
                ">For years, he criticized Putin’s regime on Facebook, and he was detained twice at protests\n\nWell I guess now he knows why America shoved him into a Gulag.",
                "This reminds me of the guy who was in Hiroshima when the US dropped the bomb on it and he survived. He then fought his way through to Nagasaki where he had family. After days of walking he arrived in Nagasaki just in time to have the second nuclear bomb dropped on his head. He also survived the second one.\n\nNow I'm conflicted. Is he the luckiest guy to ever live or the unluckiest?",
                "This has been going on for  a while, I recall reading a story at least 25 years ago about a Scottish citizen who overstayed his tourist visa by a few days and ended up in an immigration detention center for several months.",
                "Welcome to murica comrade, meet the new boss, same as old boss, enjoy your stay.",
                "Probably should have tried an actual functioning democracy.",
                "Land of the free home of the brave?",
                "Well, it was a cretinous idea to have picked the US to begin with\n\n“Land of the free and brave” AH please.",
                "They should have went to a free country.",
                "Why are Russians being accepted at all?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Ukraine to compile list of energy sites Russia must stop attacking, Zelensky says",
            "external_url": "https://kyivindependent.com/ukraine-to-create-list-of-energy-infrastructure-civilian-sites-russia-must-cease-attacking-zelensky-says/",
            "upvotes": 853,
            "date": "03/19/2025",
            "thumbnail": "https://assets.kyivindependent.com/content/images/2023/02/gettyimages-1247442902-1677276960d6gz6.jpg",
            "top_comments": [
                "Which will promptly be attacked.",
                "Couldn’t they just say stop attacking ALL of the energy sites? 🤷‍♂️",
                "Such a weird surreal war \n\nTalking about it like it’s a Queensbury Rules boxing match. \n\n(But. It isn’t really. Not at all in fact).",
                "It would be interesting for Ukraine to seed a few random fields into the list, just to see how Ruzzia treats them. Something like:\n\n**Critical Site #536**: Super-expensive Hydrocarbon de-trymehyficationism plant [which is actually a derelict scrap yard]",
                "The powerful democratic assistance of the United States, at your service. “Please don’t attack us at A, B, and C.”",
                "This is a line in the sand. It’s a way for Ukraine to say “See, Russia was told not to attack these in a cease fire and they didn’t comply.”  It’s about pointing out Trump’s inability to control Russia.",
                "\"Ah, a list of targets\" -Putin probably",
                "How about stop attacking all energy sites?",
                "Sounds like that would be a target list.",
                "Reverse psychology, maybe? Kind of like how the UK incurred Hitler's wrath during the Blitz which tricked him into refocusing his bombing efforts away from airbases and onto civilian targets."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Hungary bans LGBTQ+ Pride marches",
            "external_url": "https://www.bbc.co.uk/news/articles/c5y0zrg9kpno",
            "upvotes": 821,
            "date": "03/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b138/live/7d758200-04da-11f0-a805-7522e84d4840.jpg",
            "top_comments": [
                "The biggest problem under the slogen of “save the children, ban the Pride” they restricted the freedom of assembly law. So Orbán could ban any assembly, march or protest in the country without control.",
                "Looks like pride is a protest again, friends.",
                "Coming to America Soon™️",
                "Republicans LOVE Orban.  Turning America into Hungary or Russia is their objective.",
                ">[First they came](https://encyclopedia.ushmm.org/content/en/article/martin-niemoeller-first-they-came-for-the-socialists)  for the socialists, and I did not speak out—because I was not a socialist.\n\n>Then they came for the trade unionists, and I did not speak out—because I was not a trade unionist.\n\n>Then they came for the Jews, and I did not speak out—because I was not a Jew.\n\n>Then they came for me—and there was no one left to speak for me.\n\n—Martin Niemöller",
                "Yeah cause cost of living and grocery prices aren’t a a thing. It’s all the gays fault guys!! What is wrong with everyone?!",
                "Coming to the US shortly…",
                "Guess it's time to march even harder then.",
                "Just change the name to LGBTQ+ humility walk.",
                "I don’t get these bans, if they’re peaceful and children friendly who gives a shit. Leave people alone."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "NYC man who ‘sextorted' girl, created child pornography gets life in prison",
            "external_url": "https://www.nbcphiladelphia.com/news/local/zachary-williams-life-sentence-child-pornography-new-york-jersey-hotel/4137842/",
            "upvotes": 1268,
            "date": "03/19/2025",
            "thumbnail": "https://media.nbcphiladelphia.com/2024/10/GettyImages-536042165.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "Why is \"Man who raped, extorted 13-year old gets life in prison\" such a hard headline to write?",
                "Now do the Tate brothers ",
                "It still feels like it isn’t enough.",
                "Serves him right, and when the inmates find out what he's done, he's likely gonna be toast",
                "Soon to be pardoned by trump.",
                "how on earth did a 13-year-old kid get to the hotel by themselves without their parents knowing?\n\nI never understand how these things still happen with the amount of stranger danger kids are taught, how hard it is to get around a town if you don't drive, etc.",
                "Should have run for president",
                "He would've been fine if only he was Republican.",
                "Good Good Good \n\n\nThis happened to me on a massive scale and still is to some extent. ",
                "Cool. Now do the GOP. And the Catholic church."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "US ‘deletes evidence’ of Russia’s kidnap of thousands of Ukrainian children",
            "external_url": "https://www.independent.co.uk/news/world/europe/trump-ukraine-children-russia-war-kidnapping-evidence-b2717730.html",
            "upvotes": 24491,
            "date": "03/19/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/18/13/58/SEI244319340.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "Great. Our actions are now complicity.",
                "Just a reminder that Trump pardoned more known pedophiles than any other US President in history",
                "Summary:\n\nThe US State Department allegedly deleted evidence collected by Yale University’s Humanitarian Research Lab, which was tracking Russian war crimes, including the abduction of 35,000 Ukrainian children. The deletion has hindered efforts to rescue the children and prosecute those responsible, including Russian President Vladimir Putin. The Yale project, funded by the US government until last month, monitored 116 sites in Russia using satellite imagery and other surveillance tools.\n\nSources suggest the deletion may have been accidental or intentional, raising potential legal risks for the Trump administration under international war crimes laws. The lost data was also being shared with the EU for its own investigations. The destruction of evidence not only affects legal cases but also complicates ongoing rescue missions.\n\nThe Yale project played a key role in gathering evidence that contributed to six ICC indictments, including against Putin and his commissioner for children’s rights. Russia has been accused of forcibly transferring Ukrainian children, issuing Russian passports in occupied areas, and erasing Ukrainian identity. The loss of the secure “Caesar” database has been described as a violation of the Geneva Convention, which prohibits destroying war crimes evidence. The US State Department has yet to respond.",
                "Greenlighting child abductions. \n\nFeeling free and brave yet, republicans?",
                "Not super familiar with International wartime law... but isn't covering up a war crime a war crime?",
                "Trumps fan boys been real quiet recently haven't they.\nMust be tiring having to generate excuses for things like this around 10 times a day at the moment.",
                "This is disgusting and heartbreaking and I hope every single person that voted for Trump has this shoved in their face. You are part of the reason this war criminal gets to continue to tear families apart and these children, THESE CHILDREN, may never see their families again.",
                "i really hope some kind of back up  have been sent to partners outside us",
                "MAGA are pro rape, molestation and trafficking.",
                "The party of family values, everyone."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Large police presence near CIA headquarters",
            "external_url": "https://www.fox5dc.com/news/large-police-presence-near-cia-headquarters-police.amp",
            "upvotes": 2357,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“FAIRFAX COUNTY, Va. - A barricade incident at CIA headquarters in McLean, VA has prompted a large police presence in the area. \n\nWhat we know:\nThere appears to be a SWAT team, Arlington County, and Fairfax County officials on the scene gearing up, along with other officials gearing down. A bomb squad also appears to be on the scene as well, it is unconfirmed if there is a bomb in the area. \n\nAccording to Fairfax County police, Dolley Madison Blvd is shut down in both directions between Georgetown Park and Savile Lane because of a barricade incident.“",
                ">FAIRFAX COUNTY, Va. (WJLA) — A person was making threats at the gate of the CIA headquarters Wednesday morning, CIA officials confirmed to ABC News.\n\n>Officials said that a man pulled out a handgun and pointed it at CIA headquarters in McLean, Virginia. No shots have been fired and no injuries were reported, according to a law enforcement official.\n\nhttps://wjla.com/news/local/cia-headquarters-threats-police-presence-bomb-squad-team-fairfax-county-police-mclean-safety-public-government-trump-administration#",
                "Jesus Christ it’s Jason Bourne",
                "I suspect a lot of the response is nothing to do with the actual situation. There is a plan for incidents at CIA HQ and it's designed to deal with major incidents, but the rule is that if there's an incident, you follow the plan.",
                "I said from the beginning, the STUPIDEST thing they did with DOGE was to send them in there terminating and ticking off CIA and FBI organizations.  They'll get the same effect US CPA got by disbanding Saddam's Sunni elite guards.\n\nNot to mention ... they had NO IDEA WHAT THEY WERE DOING:\n\n“Why are American taxpayer dollars being spent to maintain empty buildings?” a 2024 post from the official Doge account reads.  \n\nLATER HEADLINE: ‘Secret CIA base mistakenly exposed in Doge government building sell-off’\n\n[https://www.yahoo.com/news/secret-cia-mistakenly-exposed-doge-205439724.html](https://www.yahoo.com/news/secret-cia-mistakenly-exposed-doge-205439724.html)",
                "Decent info here https://www.ffxnow.com/2025/03/19/developing-police-respond-to-cia-hq-in-mclean-for-barricade-incident/",
                "I don't know.  Perhaps Hegseth had a bit too many last night, still half in the bag, and, instead of heading to the Pentagon, was rushing to work thinking he was CIA director this morning.",
                "[deleted]",
                "Looks like an individual is having a mental health crisis.",
                "Was it DOGE? Would be amusing if it was."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "Russia and Ukraine report air attacks after Putin-Trump call",
            "external_url": "https://www.reuters.com/world/europe/russia-ukraine-trade-accusations-infrastructure-attacks-after-putin-trump-call-2025-03-19/",
            "upvotes": 386,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "But it was probably a big beautiful call, so that's all that;s important right?\n\n>  \n“They’re dying, Russians and Ukrainians. I want them to stop dying. And I’ll have that done — I’ll have that done in 24 hours.”\n\n* Donald Trump, At a CNN town hall in May 2023",
                "It was a phone sex call nothing more",
                "Trump will do nothing useful. Vance and Trump with their ambushes and slimy lies taken from Putin are figuratively wanking over the bodies of dead Ukrainian women and children while screaming at them it was all their fault. So, yeah, America’s fascist leaders don’t care anything about any republic and are visibly on a campaign of atrocities to force NATO to expel the US so we can attack Canada and Greenland with less resistance. Trump is best off with a stronger and more belligerent Russia menacing NATO and he and Putin know it.",
                "This will be blamed on Zelensky, somehow.",
                "Zelenskyy warned Trump that Russia probably won't keep a ceasefire because they've broken them before. Imagine my surprise that Russia didn't want or honor a ceasefire.\n\nThey accused Zelenskyy of wanting \"endless war\" but it seems your buddy Putin is the one that wants that.",
                "This is better than the time he went to congress to get some GOP votes for something and some of them switched sides to join Dems",
                "The pilots were over international waters probably.",
                "But did Putin say thank you!?!",
                "Only nobody ever said they are going to stop all air attacks?"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Nicholas Prosper: Teenager who murdered mother and siblings and planned school massacre jailed for at least 49 years",
            "external_url": "https://news.sky.com/story/teenager-who-murdered-family-and-planned-school-massacre-jailed-for-at-least-49-years-13331045",
            "upvotes": 922,
            "date": "03/19/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-nicholas-prosper-mugshot_6861312.jpg?20250319132034",
            "top_comments": [
                "> Mrs Justice Cheema-Grubb said Prosper had not hated his mother or siblings and had \"had a good life with them\", but that his intention had been to kill them in their sleep and rape his sister.\nEach victim suffered the anguish of anticipating or being aware of the deaths of others,\" she said.\n\nHis siblings were 16 and 13. I cannot imagine the terror and betrayal his mother and siblings felt in their last moments. Hopefully they do not let him out at the minimum term, he should be jailed for as long as possible.",
                "Jesus... And it wasn't even some like traumatized bullying victim type, or like unable to grasp the consequences... The guy just thought it'd be awesome to massacre elementary school students and murder and uh... Sexually assault his family.\n\nGood riddance.",
                "The murders were in Luton, England, on 13 September 2024. I am surprised the trial was over so quickly, even with a confession.",
                "I mean he will never be released but should have been a whole life order. Why give someone even a slither of chance of doing it in his twilight hours.",
                "I don’t understand sentencing over there. I understand that they have strict human rights laws that affect life sentences but 3 people? Almost his entire family? He should never be released.",
                "The more I read about this the worse it gets...",
                "That's it? Put him away for much much longer",
                "Why is this not a life sentence?",
                "This is behavior of a disturbed individual. I highly doubt there were no signs of mental unwellness prior to the event. These crimes are always an escalation of behaviors.",
                "Anyone ever tell him his glasses are too small for his head?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Google agrees to pay $28m in racial bias lawsuit",
            "external_url": "https://www.bbc.com/news/articles/c39v2ykwgdno",
            "upvotes": 820,
            "date": "03/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/fb5e/live/e2abefa0-047c-11f0-92d6-f71a165fc0b6.jpg",
            "top_comments": [
                "From the article: \"The practice of basing starting pay and job level on prior salaries reinforced historical race and ethnicity-based disparities, according to Ms Cantu's lawyers.\"\n\nWouldn't that mean Google inherited the employee's last employer's valuation of them as human resources?",
                "So, 0.01% of their annual revenue. Thatll teach em",
                "$4200, way to stick it to em. Lawyers are the real winners",
                "I'm surprised they settled. Google would likely prevail on the merits of the case, because they definitely don't discriminate pay based on race.\n\n*Especially* in the past decade, when they've gotten extremely rigid and formulaic about standardizing pay. Google has extremely tight pay bands and its comp structure targets is extremely formulaic, depending almost entirely location (targetting something like the 90th percentile of total comp amongst peer companies in a given location => SF Bay Area / NYC have a higher premium than say, somewhere in the midwest US) and level. Crucially, those formulas don't include anything about race.\n\nThe targets are so formulaic and standardized such that when you reach the cap for your level / location, you won't get any more yearly merit increases even if you performance would otherwise merit it. The only thing you can do once you cap out is hope the target for your pay band moves up, e.g., due to that \"90th percentile among peers in your local market\" metric going up b/c of inflation or pay competition among local employers.\n\nWhat is true and what's likley happening, since the suit is about \"starting pay\" is probably a few counfounding variables. While your band is fixed by level and locatiohn, your starting place in your band can vary depending on your negotiations—did you have competing offers, how strong were they, what was your hiring committee rating (hire / strong hire), did you even attempt to negotiate, etc.?\n\nSo I could see variability in *starting pay* due to confounding variables like working in lower cost of living areas, not negotiating as strongly, not having as many or high competing offers, lower hire rating, etc. But that's all about negotiations and interview performance. Definitely not due to race.",
                "[removed]",
                "Whichever lawyer convinced her this piece of shit had any legs to stand on in court is absolutely swimming in cash right now. Everyone else, not so much.",
                "Sounds like they need some DEI initiatives....",
                "equivalent to a parking ticket",
                "Managers or HR departments negotiating starting salaries with good intent to then find that some minorities are underpaid is not surprising at all. You can say \"we don't do that\" in your defense, and you can really mean it, but when the data says you do it, then you do it.\n\nThis is a good example of what we mean when we say \"Systematic Racism\", this it not Google being racist but they are perpetuating a problem, and this is exactly why the \"Equality\" part of DEI work inside large enterprises that track these kind of disparities and try to fix them are so important to help undo these inequalities for future generations.",
                "Always being who you know not what you know ."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Ben & Jerry's claims Unilever ousted its boss over political activism",
            "external_url": "https://www.bbc.com/news/articles/ckg8pk9rpx4o",
            "upvotes": 20400,
            "date": "03/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d7be/live/d33cbd20-0485-11f0-9776-23d43d9c7fe7.jpg",
            "top_comments": [
                "It doesn’t look like this has gone through yet according to the article. Guess we will see what the independent board decides.",
                "Back in the 80s, Ben & Jerry’s had a corporate 5 - 1 plan.  The highest paid employee (including CEO) could make no more than 5 times the salary of the lowest paid employee.",
                "“Mr Stever has been with Ben & Jerry’s since joining the firm in 1988 as a tour guide. He was appointed chief executive in 2023.”\n\nHoly shit this rules.",
                "Buy an activism by design brand then fire the activists. Sounds about right.",
                "Sounds like the parent company violated the agreements they had with Ben and Jerry’s. It’s always been a politically active brand. ",
                "Did they really think selling their brand to a corporation would end any other way?",
                "\"It comes a month after the ice cream company accused Unilever of demanding that it stops publicly criticising US [Supreme Leader] Donald Trump.\" \n\nWell... you know what to do.\n\n https://en.m.wikipedia.org/wiki/List_of_Unilever_brands",
                "B+J is a very good example of why a company shouldn't go public.",
                "Stop letting billionaires buy your companies if you don’t want them to control your companies",
                "The Americone Dream is over."
            ],
            "aggregate_sentiment": 45.0
        }
    ],
    "last_updated": "03/19/2025 20:09:27 UTC"
}