{
    "posts": [
        {
            "category": "HOT",
            "title": "Stocks fall as Trump warns of US economy trade war 'transition'",
            "external_url": "https://www.bbc.co.uk/news/articles/cz61nn99eg1o",
            "upvotes": 17570,
            "date": "03/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7d16/live/091cf470-fdc2-11ef-8869-3b46261c581e.jpg",
            "top_comments": [
                "President of “No Wars” begins his second term by starting a Trade War. More news at 11",
                "Trump, contrary to polls, is very bad for our economy.",
                "Tesla down 15% today alone is crazy. Wipes out every gain they made from November.",
                "the great businessman who had 6 bankruptcies ladies and gentlemen.  🎩 ",
                "Transition TO WHAT?   Financial ruin, destroyed partnerships, vaporized supply chains, never retiring, and blown investments?\n\nThis guy is the dumbest sack of Matlock reruns I have ever seen.",
                "just to be clear, when Biden left office we had +2.3% GDP growth. Trump has been in office less than two months and we are now projected to have -2.8%. in TWO FUCKING MONTHS he destroyed 5% GDP. fuck you if you voted for this fascist dictator.",
                "Already tired of all this … winning?",
                "We've almost given up 6 months of stock growth. The stock market isn't the economy, but when stocks slump, the real economy slumps.",
                "In case anyone is wondering where we've been and where we're going, here's a handy guide.\n\n1. The tariffs are great for the economy\n2. The tariffs are great for the economy, but it will take time to see\n3. The tariffs will be good overall for America, but the economy will \"transition\" **<-- (you are here)**\n4. This is a market correction, not a recession\n5. Not *all* experts agree that we're in stagflation\n6. This depression is all because of the Biden/Obama tariffs which I, Donald Trump, will now end!",
                "Thought he was against transitioning"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "HOT",
            "title": "Washington Post editor resigns after accusing CEO of killing column",
            "external_url": "https://www.nbcnews.com/news/us-news/washington-post-editor-ruth-marcus-resigns-accusing-ceo-killing-column-rcna195634",
            "upvotes": 16987,
            "date": "03/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-10/241025-the-washington-post-newspaper-building-ew-1249p-551ccb.jpg",
            "top_comments": [
                "“Will’s decision to not run the column that I wrote respectfully dissenting from Jeff’s edict — something that I have not experienced in almost two decades of column-writing — underscores that the traditional freedom of columnists to select topics they wish to address and say what they think has been dangerously eroded,” Marcus wrote in her resignation, according to The New York Times.",
                "If I've said it once, I've said it a thousand times. \n\nThe true value of owning a newspaper is controlling the narrative and silencing opposition.\n\nIt doesn't matter to Jeff Bezos how many subscribers or ad clicks he has. He can *lose* money on the newspaper and it's still more valuable than not owning it. This way, he gets to drive a specific narrative specific to his own agenda while attaching a (formerly) prestigious publication to it. \n\nHe doesn't care about journalism. He cares about his money and power.\n\nThe days of legacy Journalism are over.",
                ">Bezos, the Amazon founder who purchased the venerable publication in 2013, told the staff last month that the opinion section would take a radical turn by \"writing every day in support and defense” of “personal liberties and free markets.\"\n\n\"From now on you'll print *my* opinion - daily\" - American oligarch and owner of the Washington Post",
                "People need to cancel, there is no way one can trust anything from the Washington post now",
                "I regret that I HAD only one Washington Post subscription to cancel for my country.",
                "Nothing to see here, just the conservative billionaires who control the media killing anything that doesn't support their narratives.",
                "If only there was a way to cancel my subscription multiple times. ",
                ">Democracy Dies In Darkness\n\nIt used to be a warning, but it's become just a description...",
                "WaPo bent the knee. Bezo wants in on the new robber baron era",
                "WP credibility shot to pieces ."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Secretary of State Rubio says purge of USAID programs complete, with 83% of agency's programs gone",
            "external_url": "https://apnews.com/article/trump-musk-rubio-usaid-foreign-aid-bf442d62af67918a6fc5eee839074601",
            "upvotes": 13793,
            "date": "03/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So where's all the extra money going?",
                "well surely with 83% being gone, we'll get some fraud arrests any day now...",
                "How is that fucking legal? The founds were approved by congress",
                "So we killed soft power infrastructure in Africa while China is building ports and making new trade deals there. \n\n\nWhat is the end goal here? Sounds more like make China great again. ",
                "This election is destroying my faith in American democracy. If the winning party can destroy so many government institutions in the first three months of their term, it is not a stable system.",
                "So, hey, maybe it doesn't matter, but, you know, it's not actually legal for the Secretary of State to get up one day and say 83% of what a government department does is not going to get done anymore because he (or Elon) doesn't feel like it should be done.",
                ">\"Welp, Jesus did say we'd always have poor people.\"\n\n>-Some conservative, misinterpreting yet another passage in the Bible.",
                "What's the goal? To be North Korea? To have zero allies?",
                "They won't be forgiven for this.  Those programs were approved by congress.  They are violating the constitution and they need to be impeached now and sent to gitmo for the rest of their miserable lives.",
                "They do this creating a vacuum. Who is going to fill it. Guess the Russian and Chinese. American good will and influence years building are gone."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "3-year-old boy covered in bruises dies after being dumped outside Brooklyn hospital: sources",
            "external_url": "https://www.nbcnewyork.com/brooklyn/brooklyn-baby-dead-outside-hospital/6179120/",
            "upvotes": 3923,
            "date": "03/10/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/03/bk_hospital.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "That’s horrible poor little guy",
                "Remember when a CEO got shot and the entire NYPD was immediately tasked with tracking down the killer? \n\nI wonder if this child will get the same effort.",
                "Poor little angel. \n\nStuff like this makes me hope there is an after life so there are still kind, nurturing moments for him. I can’t imagine the fear he felt, and who knows for how long.\n\nI hope they find whoever did this.",
                "[removed]",
                "wtf is wrong with people\n\nThat’s horrific \n\nNo child deserves that",
                "Oh fuck that’s depressing. R.I.P. little one.",
                "JFC... it's like we are living in medieval times still.",
                "[removed]",
                "\"Your table for two is reserved in Hell.\"",
                "As someone that has a 3 year old - fuck those people! Disgusting assholes. People that torture and abuse children should be sentenced to death and die in agony and fear. The same fear that they caused those poor children, who were looking to them to be protected."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Social media platform X down again for thousands of users, Downdetector shows",
            "external_url": "https://www.reuters.com/technology/social-media-platform-x-down-thousands-users-downdetector-shows-2025-03-10/",
            "upvotes": 4958,
            "date": "03/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "elon needs to reply to a email stating 5 things he did to strengthen Xitters infrastructure",
                "Twitter is down, Space X rockets are exploding, Tesla is completely tanking.  We need to find the guy who runs these places he is perfect for government work.",
                "Remember when Twitter was so reliable that most other online services used it to report their outages?",
                "Nobody decent should even notice",
                "Fucking leave that platform,",
                "Bots “arguing” with other bots, who cares?",
                "Now we just need his Ketamine dealer to do us a solid.",
                "Oh no, what a tragedy.",
                "[Bluesky](https://bsky.app) is up, if anyone wants an alternative.",
                "Didn't have this problem with DEI.  Just saying."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "China strikes back at Trump tariffs with 15% levies targeting US farmers",
            "external_url": "https://apnews.com/article/china-tariffs-trump-agriculture-farms-midwest-247a85e2cf5b1fd54de4afbf2a30de64",
            "upvotes": 2350,
            "date": "03/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "U.S. farmers keep on winning",
                "Get the farm bail out money ready to go. While everyone else suffers this stupid trade war they will get bailed out even though the majority of them voted for this mess.",
                "“i VoTeD fOr PeAcE & PrOsPeRiTY”",
                "Who could have seen this coming?\n\n[Us. We saw it coming.](https://www.bbc.com/news/business-51025464)",
                "Speed run recession any % run.",
                "Come on you lazy US farmers, Just sell your soy to Americans. Tell them RFK says it causes weight loss or something.",
                "This and If they have to pay more for Canadian potash US farmers are in for a really tough year.",
                "You would think a farmer would understand the phrase “you reap what you sow” but not in America",
                "Hopefully the hick fucks will learn, but I'm sure they'll blame Mexicans and trans folks before voting down ballot for Rs again",
                "I do not feel bad for the Wisconsin farmers that voted for this shit."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Emails Show Mahmoud Khalil Asked Columbia for Protection a Day Before He Was Detained",
            "external_url": "https://zeteo.com/p/scoop-emails-show-mahmoud-khalil-ask-columbia-protection-ice",
            "upvotes": 977,
            "date": "03/10/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F11df1967-ef4f-4356-987a-ea127068b8b2_2346x1565.jpeg",
            "top_comments": [
                "If he’s actually deported, it’s the beginning of the end for free speech in America. A legal resident being jettisoned from the country for dissenting views is what a dictatorship does, not the United States. I’m ashamed to be an American right now.",
                "Blatantly unconstitutional arrest.  What “support” for terrorism???  This is just arbitrary and vague reasoning so republicans can call anything they don’t agree with “supporting terrorism”.  \n\n*STEP UP JUDICIARY AND BLOCK THIS!*",
                "Your free speech is dying, America. And it feels like the majority is applauding it.",
                "If you’re a liberal who is giddy that someone who is vocally pro-Palestine is getting deported under Trump, I have really bad news about who you would have been in 1930’s Germany.",
                "I don't get it if he was a green card holder what were the grounds for arresting him? Pure hatred?",
                ">\"Finally, on Monday, President Donald Trump celebrated the arrest of Mahmoud Khalil, calling him, without providing evidence, \"a Radical Foreign Pro-Hamas Student.”\n\n\n>\"This is the first arrest of many to come,” Trump added.\"\n\n\nJudges, be brave. It's going to be a bumpy ride. ",
                "This is fucked up and should be absolutely denounced, condemned, and publicly shit on by every news outlet. \n\nI think a lot of people who yell \"Hell yeah, brotha!\" right now, might be surprised about the circumstances they will find themselves in maybe 6 months down the road, if this actually goes through. \n\nMaybe they can read a book, or watch a YouTube video, and learn about the Third Reich and how well things turned out for a lot of Nazi supporters who thought their compliance and Jew-hate kept them safe.",
                "Man clear cut violates school policy, asks for amnesty from said school.\n\nShocked by the outcome.\n\nI don’t like Trump’s tactics here but I’m also tired that clearly broke both school policy and frequently the law seem to act like they have special rights no one else does as long as it’s tied to speech.",
                "Is he actually a student at Columbia? What sort of protection would the university be able to offer?",
                "Remember, dissent is antisemitic!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Man shot by dog in Frayser, police say",
            "external_url": "https://www.fox13memphis.com/news/man-shot-by-dog-in-frayser-police-say/article_87c5ad76-fdb3-11ef-842e-073ff59d8916.html",
            "upvotes": 922,
            "date": "03/10/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/fox13memphis.com/content/tncms/assets/v3/editorial/f/83/f83761a0-9ae0-5da3-898b-874511939e2b/67ceef64c262c.image.png?crop=1273%2C668%2C0%2C21&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "Ain’t no law that says a dog can’t own a gun",
                "A Dog Took My Face and Gave Me a Better Face to Change the World: The Celeste Cunningham Story",
                "Man Kristi Noem is shook right now",
                ">The man told officers that he was with a woman in bed when his dog jumped up, got his paw stuck in the trigger, ended up hitting the trigger and he was grazed by the bullet in his left thigh\n\nWas he spooning the gun or something? Fully loaded, safety off? Tf?",
                "She left the scene with the gun, but the dog did it? Sure thing.",
                "“Hey honey, have you seen my gun?”\n\n“Hmm, last time I saw it the dog had it.”",
                "dawg, you just shot me",
                "Guns don't kill people, dogs with guns do.",
                "[Ginger no!](https://youtu.be/HGpI72vIeJ8?si=ZCaMXFAXR1R-Z7Py)",
                "The only thing that could have stopped it was a good dog with a gun, advocates say.  /s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Panama releases dozens of detained deportees from U.S. into limbo following human rights criticism",
            "external_url": "https://www.nbcnews.com/world/latin-america/panama-releases-dozens-detained-deportees-us-limbo-human-rights-critic-rcna195526",
            "upvotes": 549,
            "date": "03/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250309-panama-migrants-vl-1034a-daf9a6.jpg",
            "top_comments": [
                "Time to leave X. Musk is out of control",
                "All I can say is that ketamine *will* exacerbate *psychotic* symptoms in predisposed patients.",
                "I guess the ovens weren't ready yet.",
                "Trump and his minions going to The Hague, keeps me going.",
                "What I do not understand is why did Panama strip them of their phones when they entered the camps.  They want them out of the country but they simultaneously removed the ability to make the arrangements."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Video of Indianapolis ICE arrest captures agents dragging men out of their vehicle",
            "external_url": "https://www.indystar.com/story/news/crime/2025/03/07/indianapolis-ice-custom-enforcement-arrest-honduras-men-clay-marion-county-west/81982680007/",
            "upvotes": 6096,
            "date": "03/10/2025",
            "thumbnail": "https://www.indystar.com/gcdn/authoring/authoring-images/2025/03/07/PIND/81983693007-ice-video-screenshot.PNG?crop=650,366,x0,y159&width=650&height=366&format=pjpg&auto=webp",
            "top_comments": [
                "How come the cops aren't yanking the business owner out of their car for hiring (allegedly) undocumented labor?\n\nThe whole anti-immigration posture is such a stupid charade.",
                "Wait. When did this country suspend constitution and allow warrantless search and seizure without probable cause?",
                "man, if i saw someone dressed like that, looking like that, I would assume that it was someone cosplaying as a cop harassing/attacking someone and would try to defend them.",
                "Pressure is on from President Trump to meet the quotas, he's not happy with his numbers falling behind his predecessors. He already forced the acting head to step down.\n\nThe result will be violations of civil rights.",
                "Trumps Gestapo is being built.",
                "And what’s the RAP on these two that got them pulled out of their car Felony-stop style by DHS, ATF and presumably turned over to ICE? The article states it was DHS and ATF effecting the arrest, not ICE then one of the two men was transferred to an immigration holding facility for deportation while the other was released. \nAs someone who works in a law enforcement agency, this level of force rarely ever even comes out for career gang members unless there is a warrant for homicide or a violent offense. This is an incredible amount of enforcement force and resources for “no reason” so it’s quite suspicious to say the least. Note the article says there is no public record attached to the stop, does not say the man eligible for deportation did not have warrants or serious convictions .",
                "What a bunch of racist fuckwad redneck wannabe cops.",
                "It's a shame that stories like this are buried under the avalanche of Trump's buffoonery.",
                "If you work for ICE and you’re doing this, it’s because you’re a nazi now",
                "Working to provide for his handicapped, 3-year old daughter. These are some sick fucks."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Texas bill would make identifying as transgender a felony punishable by jail",
            "external_url": "https://www.nbcnews.com/nbc-out/rcna195642",
            "upvotes": 64,
            "date": "03/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-09/230901-texas-state-capitol-mn-1450-c8edd9.jpg",
            "top_comments": [
                "Yeah, because who cares about measles and a crashing economy? This is clearly the real problem",
                "How much *hate* does your voter base have to have in their bodies where you feel comfortable as a legislator to introduce this shit?",
                "wtf lol, the republicans love causing social crisis. 15 years ago is was gay rights, everyone decided they didn't care, so now it's trans rights.",
                "Sounds like another unconstitutional law from right-wing religious whacko legislators.  Too bad constitutional rule of law is hanging by a thread in our broken country….",
                "The land of the free and the home of the brave.",
                "How the fuck would you even enforce that?",
                "How do they not realize that they're the baddies?",
                "This is what personal freedom looks like, apparently.",
                "Idk why anyone still lives in this backwards state.",
                "I'm no lawyer, but that sounds like a freedom of speech violation"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Suspected cause of Long Island wildfires was a resident making s'mores: Police",
            "external_url": "https://abcnews.go.com/US/long-island-new-york-wildfires-suspected-cause/story?id=119629135",
            "upvotes": 116,
            "date": "03/10/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a1199ed2-c98f-4c94-bf61-f8cd85fa6154/li-fire-gty-bh-250310_1741616267303_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Suffolk County Police Commissioner Kevin Catalina said the \"operating theory\" is that a fire was started at about 9:30 a.m. ET Saturday when a resident used cardboard to start a fire to make s'mores, *a confection that includes toasted marshmallows and chocolate sandwiched between graham crackers.*\n\nI got to appreciate how the article took the time to dispassionately describe what a s'more is.",
                "At least it wasn't something dumb, like a gender reveal party.",
                ">Catalina said the department has 25 arson investigators probing the blaze to determine the exact cause of the fire, but added, \"So far, our investigation is pointing strongly toward an accidental origin for Saturday's fires.\"\n\nThey need a new category. Maybe the intent wasn't to start a forest fire, but \"accidental\" is a strong word for someone intentionally starting a fire in their backyard in dry, windy conditions. \n\nIt's not like someone's phone battery blew up, or they were jumping their car and the contacts sparked or something. *Those* are accidental.",
                "He has dishonored his marshmallow.",
                "Who is making and eating s'mores at 9:30 in the morning?",
                "Cardboard? Not even a proper little fire?\n\nGet a butane torch you guys. Or put a marshmallow on a fork and hold it over the toaster slot. Stove burner. Not hard!",
                "That explains all the commotion I heard Saturday with fire dept .. I live in Eastport..it was windy on Saturday ..I’ll have to ask my neighbor about it\n\n\nLmfao the picture caption is technically incorrect.. while it is in the town of south Hampton , that pic is between exit 61 and 63 sunrise highway which is considered Eastport west Hampton .. south Hampton is about 25 minutes east",
                "Called “party foul” back in my day"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Emails Show Mahmoud Khalil Asked Columbia for Protection a Day Before He Was Detained",
            "external_url": "https://zeteo.com/p/scoop-emails-show-mahmoud-khalil-ask-columbia-protection-ice",
            "upvotes": 971,
            "date": "03/10/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F11df1967-ef4f-4356-987a-ea127068b8b2_2346x1565.jpeg",
            "top_comments": [
                "If he’s actually deported, it’s the beginning of the end for free speech in America. A legal resident being jettisoned from the country for dissenting views is what a dictatorship does, not the United States. I’m ashamed to be an American right now.",
                "Blatantly unconstitutional arrest.  What “support” for terrorism???  This is just arbitrary and vague reasoning so republicans can call anything they don’t agree with “supporting terrorism”.  \n\n*STEP UP JUDICIARY AND BLOCK THIS!*",
                "Your free speech is dying, America. And it feels like the majority is applauding it.",
                "If you’re a liberal who is giddy that someone who is vocally pro-Palestine is getting deported under Trump, I have really bad news about who you would have been in 1930’s Germany.",
                "I don't get it if he was a green card holder what were the grounds for arresting him? Pure hatred?",
                ">\"Finally, on Monday, President Donald Trump celebrated the arrest of Mahmoud Khalil, calling him, without providing evidence, \"a Radical Foreign Pro-Hamas Student.”\n\n\n>\"This is the first arrest of many to come,” Trump added.\"\n\n\nJudges, be brave. It's going to be a bumpy ride. ",
                "This is fucked up and should be absolutely denounced, condemned, and publicly shit on by every news outlet. \n\nI think a lot of people who yell \"Hell yeah, brotha!\" right now, might be surprised about the circumstances they will find themselves in maybe 6 months down the road, if this actually goes through. \n\nMaybe they can read a book, or watch a YouTube video, and learn about the Third Reich and how well things turned out for a lot of Nazi supporters who thought their compliance and Jew-hate kept them safe.",
                "Man clear cut violates school policy, asks for amnesty from said school.\n\nShocked by the outcome.\n\nI don’t like Trump’s tactics here but I’m also tired that clearly broke both school policy and frequently the law seem to act like they have special rights no one else does as long as it’s tied to speech.",
                "Is he actually a student at Columbia? What sort of protection would the university be able to offer?",
                "Remember, dissent is antisemitic!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Stocks fall as Trump warns of US economy trade war 'transition'",
            "external_url": "https://www.bbc.co.uk/news/articles/cz61nn99eg1o",
            "upvotes": 17573,
            "date": "03/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7d16/live/091cf470-fdc2-11ef-8869-3b46261c581e.jpg",
            "top_comments": [
                "President of “No Wars” begins his second term by starting a Trade War. More news at 11",
                "Trump, contrary to polls, is very bad for our economy.",
                "Tesla down 15% today alone is crazy. Wipes out every gain they made from November.",
                "the great businessman who had 6 bankruptcies ladies and gentlemen.  🎩 ",
                "Transition TO WHAT?   Financial ruin, destroyed partnerships, vaporized supply chains, never retiring, and blown investments?\n\nThis guy is the dumbest sack of Matlock reruns I have ever seen.",
                "just to be clear, when Biden left office we had +2.3% GDP growth. Trump has been in office less than two months and we are now projected to have -2.8%. in TWO FUCKING MONTHS he destroyed 5% GDP. fuck you if you voted for this fascist dictator.",
                "Already tired of all this … winning?",
                "We've almost given up 6 months of stock growth. The stock market isn't the economy, but when stocks slump, the real economy slumps.",
                "In case anyone is wondering where we've been and where we're going, here's a handy guide.\n\n1. The tariffs are great for the economy\n2. The tariffs are great for the economy, but it will take time to see\n3. The tariffs will be good overall for America, but the economy will \"transition\" **<-- (you are here)**\n4. This is a market correction, not a recession\n5. Not *all* experts agree that we're in stagflation\n6. This depression is all because of the Biden/Obama tariffs which I, Donald Trump, will now end!",
                "Thought he was against transitioning"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Panama releases dozens of detained deportees from U.S. into limbo following human rights criticism",
            "external_url": "https://www.nbcnews.com/world/latin-america/panama-releases-dozens-detained-deportees-us-limbo-human-rights-critic-rcna195526",
            "upvotes": 548,
            "date": "03/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250309-panama-migrants-vl-1034a-daf9a6.jpg",
            "top_comments": [
                "Time to leave X. Musk is out of control",
                "All I can say is that ketamine *will* exacerbate *psychotic* symptoms in predisposed patients.",
                "I guess the ovens weren't ready yet.",
                "Trump and his minions going to The Hague, keeps me going.",
                "What I do not understand is why did Panama strip them of their phones when they entered the camps.  They want them out of the country but they simultaneously removed the ability to make the arrangements."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "China strikes back at Trump tariffs with 15% levies targeting US farmers",
            "external_url": "https://apnews.com/article/china-tariffs-trump-agriculture-farms-midwest-247a85e2cf5b1fd54de4afbf2a30de64",
            "upvotes": 2347,
            "date": "03/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "U.S. farmers keep on winning",
                "Get the farm bail out money ready to go. While everyone else suffers this stupid trade war they will get bailed out even though the majority of them voted for this mess.",
                "“i VoTeD fOr PeAcE & PrOsPeRiTY”",
                "Who could have seen this coming?\n\n[Us. We saw it coming.](https://www.bbc.com/news/business-51025464)",
                "Speed run recession any % run.",
                "Come on you lazy US farmers, Just sell your soy to Americans. Tell them RFK says it causes weight loss or something.",
                "This and If they have to pay more for Canadian potash US farmers are in for a really tough year.",
                "You would think a farmer would understand the phrase “you reap what you sow” but not in America",
                "Hopefully the hick fucks will learn, but I'm sure they'll blame Mexicans and trans folks before voting down ballot for Rs again",
                "I do not feel bad for the Wisconsin farmers that voted for this shit."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Crews accounted for after tanker and ship collide",
            "external_url": "https://www.bbc.com/news/articles/c9q4129reqgo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
            "upvotes": 196,
            "date": "03/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/152d/live/6bfe7e80-fdc5-11ef-a8b1-950887ddc6e5.jpg",
            "top_comments": [
                "Many years ago, a ship carrying red paint crashed into a ship carrying purple paint\n\nBoth crews were marooned.",
                "They said: “The Marine Accident Investigation Branch has deployed a team to Grimsby following the collision of the Portuguese registered container ship Solong and the US registered oil tanker Stena Immaculate which collided in the North Sea this morning.",
                "Career sailor (25 years) and spent a significant amount of time in the North Sea. The weather and sea state out there can get *rough* and it’s a high traffic area. I’m not trying to say it’s normal for this to happen, but it’s definitely different than two ships out in the open ocean.",
                "Good thing is the crew is safe, bad thing is we don't know till what extent will it damage the marine life/ecosystem.",
                "Apparently one crew member is missing.",
                "Did not a single crew member read “How to Avoid Huge Ships”? Seems like some mandatory reading could have helped avoid this whole thing."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "3-year-old boy covered in bruises dies after being dumped outside Brooklyn hospital: sources",
            "external_url": "https://www.nbcnewyork.com/brooklyn/brooklyn-baby-dead-outside-hospital/6179120/",
            "upvotes": 3912,
            "date": "03/10/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/03/bk_hospital.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "That’s horrible poor little guy",
                "Remember when a CEO got shot and the entire NYPD was immediately tasked with tracking down the killer? \n\nI wonder if this child will get the same effort.",
                "Poor little angel. \n\nStuff like this makes me hope there is an after life so there are still kind, nurturing moments for him. I can’t imagine the fear he felt, and who knows for how long.\n\nI hope they find whoever did this.",
                "[removed]",
                "wtf is wrong with people\n\nThat’s horrific \n\nNo child deserves that",
                "Oh fuck that’s depressing. R.I.P. little one.",
                "JFC... it's like we are living in medieval times still.",
                "[removed]",
                "\"Your table for two is reserved in Hell.\"",
                "As someone that has a 3 year old - fuck those people! Disgusting assholes. People that torture and abuse children should be sentenced to death and die in agony and fear. The same fear that they caused those poor children, who were looking to them to be protected."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Washington Post editor resigns after accusing CEO of killing column",
            "external_url": "https://www.nbcnews.com/news/us-news/washington-post-editor-ruth-marcus-resigns-accusing-ceo-killing-column-rcna195634",
            "upvotes": 16977,
            "date": "03/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-10/241025-the-washington-post-newspaper-building-ew-1249p-551ccb.jpg",
            "top_comments": [
                "“Will’s decision to not run the column that I wrote respectfully dissenting from Jeff’s edict — something that I have not experienced in almost two decades of column-writing — underscores that the traditional freedom of columnists to select topics they wish to address and say what they think has been dangerously eroded,” Marcus wrote in her resignation, according to The New York Times.",
                "If I've said it once, I've said it a thousand times. \n\nThe true value of owning a newspaper is controlling the narrative and silencing opposition.\n\nIt doesn't matter to Jeff Bezos how many subscribers or ad clicks he has. He can *lose* money on the newspaper and it's still more valuable than not owning it. This way, he gets to drive a specific narrative specific to his own agenda while attaching a (formerly) prestigious publication to it. \n\nHe doesn't care about journalism. He cares about his money and power.\n\nThe days of legacy Journalism are over.",
                ">Bezos, the Amazon founder who purchased the venerable publication in 2013, told the staff last month that the opinion section would take a radical turn by \"writing every day in support and defense” of “personal liberties and free markets.\"\n\n\"From now on you'll print *my* opinion - daily\" - American oligarch and owner of the Washington Post",
                "People need to cancel, there is no way one can trust anything from the Washington post now",
                "I regret that I HAD only one Washington Post subscription to cancel for my country.",
                "Nothing to see here, just the conservative billionaires who control the media killing anything that doesn't support their narratives.",
                "If only there was a way to cancel my subscription multiple times. ",
                ">Democracy Dies In Darkness\n\nIt used to be a warning, but it's become just a description...",
                "WaPo bent the knee. Bezo wants in on the new robber baron era",
                "WP credibility shot to pieces ."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Man sentenced to 6 years in prison for gold bar scam that targeted Highlands Ranch woman",
            "external_url": "https://www.denver7.com/news/front-range/highlands-ranch/man-sentenced-to-6-years-in-prison-for-gold-bar-scam-that-targeted-highlands-ranch-woman",
            "upvotes": 294,
            "date": "03/10/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/27f6476/2147483647/strip/true/crop/2540x1334+0+27/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F0a%2F2f%2F7ff64186405ca1c7984ae62b32ef%2Fgold-bars.png",
            "top_comments": [
                ">The 23rd Judicial District Attorney's Office said Noble later handed over the two gold bars to Sagar Patel, 27, who was pretending to be an undercover agent. During the handoff, Noble recorded Patel's license plate office and turned it over to the Douglas County Sheriff's Office, leading to his arrest.\n\nGood for her for recording the license plate. Please check in on your family members. At least the ones you like. Make sure they're not getting scammed by strangers or family.\n\nTIPS: \n\n>The Denver Police Department offered these tips to keep yourself safe from scams:\n\n>* Block unwanted calls or text messages\n>* Don’t give personal or financial information over the phone or computer unless you initiated the communication with an entity you know and trust\n>* Slow down. Don’t give in to pressure to act immediately.\n>* Scammers like to be paid in cryptocurrency, gift card, or through peer-to-peer payment services. Never pay people you don’t know by those payment methods\n>* Scammers use technology to mask or spoof their telephone numbers. Caller ID can no longer be relied upon\n>* Law enforcement will never contact you and demand money",
                "This POS tried to boo-hoo his way into a shorter sentence. Let's give credit to Judge Victoria Klingensmith for the maximum sentence of 6 years in prison. Patel is also in the US illegally and ICE put a retainer on him so he'll get deported after he completes his sentence.",
                "The only legal way to obtain gold bars is through your job by being bribed as a Supreme Court justice",
                "[deleted]"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Emails Show Mahmoud Khalil Asked Columbia for Protection a Day Before He Was Detained",
            "external_url": "https://zeteo.com/p/scoop-emails-show-mahmoud-khalil-ask-columbia-protection-ice",
            "upvotes": 963,
            "date": "03/10/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F11df1967-ef4f-4356-987a-ea127068b8b2_2346x1565.jpeg",
            "top_comments": [
                "If he’s actually deported, it’s the beginning of the end for free speech in America. A legal resident being jettisoned from the country for dissenting views is what a dictatorship does, not the United States. I’m ashamed to be an American right now.",
                "Blatantly unconstitutional arrest.  What “support” for terrorism???  This is just arbitrary and vague reasoning so republicans can call anything they don’t agree with “supporting terrorism”.  \n\n*STEP UP JUDICIARY AND BLOCK THIS!*",
                "Your free speech is dying, America. And it feels like the majority is applauding it.",
                "If you’re a liberal who is giddy that someone who is vocally pro-Palestine is getting deported under Trump, I have really bad news about who you would have been in 1930’s Germany.",
                "I don't get it if he was a green card holder what were the grounds for arresting him? Pure hatred?",
                ">\"Finally, on Monday, President Donald Trump celebrated the arrest of Mahmoud Khalil, calling him, without providing evidence, \"a Radical Foreign Pro-Hamas Student.”\n\n\n>\"This is the first arrest of many to come,” Trump added.\"\n\n\nJudges, be brave. It's going to be a bumpy ride. ",
                "This is fucked up and should be absolutely denounced, condemned, and publicly shit on by every news outlet. \n\nI think a lot of people who yell \"Hell yeah, brotha!\" right now, might be surprised about the circumstances they will find themselves in maybe 6 months down the road, if this actually goes through. \n\nMaybe they can read a book, or watch a YouTube video, and learn about the Third Reich and how well things turned out for a lot of Nazi supporters who thought their compliance and Jew-hate kept them safe.",
                "His story is already false, based on what I know. He says that he was wrongfully denied access to campus recently, having finished in December, not currently being enrolled in classes. Same, and I also cannot get on campus. I’m not Palestinian - I’m just not an enrolled student. That is how it works. \n\nI don’t understand why he is asking Columbia to help when he no longer attends Columbia. \n\nAnd I keep reading that he has a green card, but I have also read that he has a student visa. If his program is over and he’s in a student visa, then he can’t stay. Now - I don’t know which one is true. But I KNOW that he’s pretending to be a victim regarding access to campus, so I don’t trust the rest of it either. I’m white and American and uninvolved in protests and I can’t get in.",
                "Man clear cut violates school policy, asks for amnesty from said school.\n\nShocked by the outcome.\n\nI don’t like Trump’s tactics here but I’m also tired that clearly broke both school policy and frequently the law seem to act like they have special rights no one else does as long as it’s tied to speech.",
                "Is he actually a student at Columbia? What sort of protection would the university be able to offer?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "China strikes back at Trump tariffs with 15% levies targeting US farmers",
            "external_url": "https://apnews.com/article/china-tariffs-trump-agriculture-farms-midwest-247a85e2cf5b1fd54de4afbf2a30de64",
            "upvotes": 2348,
            "date": "03/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "U.S. farmers keep on winning",
                "Get the farm bail out money ready to go. While everyone else suffers this stupid trade war they will get bailed out even though the majority of them voted for this mess.",
                "“i VoTeD fOr PeAcE & PrOsPeRiTY”",
                "Who could have seen this coming?\n\n[Us. We saw it coming.](https://www.bbc.com/news/business-51025464)",
                "Speed run recession any % run.",
                "Come on you lazy US farmers, Just sell your soy to Americans. Tell them RFK says it causes weight loss or something.",
                "This and If they have to pay more for Canadian potash US farmers are in for a really tough year.",
                "You would think a farmer would understand the phrase “you reap what you sow” but not in America",
                "Hopefully the hick fucks will learn, but I'm sure they'll blame Mexicans and trans folks before voting down ballot for Rs again",
                "I do not feel bad for the Wisconsin farmers that voted for this shit."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Panama releases dozens of detained deportees from U.S. into limbo following human rights criticism",
            "external_url": "https://www.nbcnews.com/world/latin-america/panama-releases-dozens-detained-deportees-us-limbo-human-rights-critic-rcna195526",
            "upvotes": 553,
            "date": "03/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250309-panama-migrants-vl-1034a-daf9a6.jpg",
            "top_comments": [
                "Time to leave X. Musk is out of control",
                "All I can say is that ketamine *will* exacerbate *psychotic* symptoms in predisposed patients.",
                "I guess the ovens weren't ready yet.",
                "Trump and his minions going to The Hague, keeps me going.",
                "What I do not understand is why did Panama strip them of their phones when they entered the camps.  They want them out of the country but they simultaneously removed the ability to make the arrangements."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Stocks fall as Trump warns of US economy trade war 'transition'",
            "external_url": "https://www.bbc.co.uk/news/articles/cz61nn99eg1o",
            "upvotes": 17594,
            "date": "03/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7d16/live/091cf470-fdc2-11ef-8869-3b46261c581e.jpg",
            "top_comments": [
                "President of “No Wars” begins his second term by starting a Trade War. More news at 11",
                "Trump, contrary to polls, is very bad for our economy.",
                "Tesla down 15% today alone is crazy. Wipes out every gain they made from November.",
                "the great businessman who had 6 bankruptcies ladies and gentlemen.  🎩 ",
                "Transition TO WHAT?   Financial ruin, destroyed partnerships, vaporized supply chains, never retiring, and blown investments?\n\nThis guy is the dumbest sack of Matlock reruns I have ever seen.",
                "just to be clear, when Biden left office we had +2.3% GDP growth. Trump has been in office less than two months and we are now projected to have -2.8%. in TWO FUCKING MONTHS he destroyed 5% GDP. fuck you if you voted for this fascist dictator.",
                "Already tired of all this … winning?",
                "We've almost given up 6 months of stock growth. The stock market isn't the economy, but when stocks slump, the real economy slumps.",
                "In case anyone is wondering where we've been and where we're going, here's a handy guide.\n\n1. The tariffs are great for the economy\n2. The tariffs are great for the economy, but it will take time to see\n3. The tariffs will be good overall for America, but the economy will \"transition\" **<-- (you are here)**\n4. This is a market correction, not a recession\n5. Not *all* experts agree that we're in stagflation\n6. This depression is all because of the Biden/Obama tariffs which I, Donald Trump, will now end!",
                "Thought he was against transitioning"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Washington Post editor resigns after accusing CEO of killing column",
            "external_url": "https://www.nbcnews.com/news/us-news/washington-post-editor-ruth-marcus-resigns-accusing-ceo-killing-column-rcna195634",
            "upvotes": 16988,
            "date": "03/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-10/241025-the-washington-post-newspaper-building-ew-1249p-551ccb.jpg",
            "top_comments": [
                "“Will’s decision to not run the column that I wrote respectfully dissenting from Jeff’s edict — something that I have not experienced in almost two decades of column-writing — underscores that the traditional freedom of columnists to select topics they wish to address and say what they think has been dangerously eroded,” Marcus wrote in her resignation, according to The New York Times.",
                "If I've said it once, I've said it a thousand times. \n\nThe true value of owning a newspaper is controlling the narrative and silencing opposition.\n\nIt doesn't matter to Jeff Bezos how many subscribers or ad clicks he has. He can *lose* money on the newspaper and it's still more valuable than not owning it. This way, he gets to drive a specific narrative specific to his own agenda while attaching a (formerly) prestigious publication to it. \n\nHe doesn't care about journalism. He cares about his money and power.\n\nThe days of legacy Journalism are over.",
                ">Bezos, the Amazon founder who purchased the venerable publication in 2013, told the staff last month that the opinion section would take a radical turn by \"writing every day in support and defense” of “personal liberties and free markets.\"\n\n\"From now on you'll print *my* opinion - daily\" - American oligarch and owner of the Washington Post",
                "People need to cancel, there is no way one can trust anything from the Washington post now",
                "I regret that I HAD only one Washington Post subscription to cancel for my country.",
                "Nothing to see here, just the conservative billionaires who control the media killing anything that doesn't support their narratives.",
                "If only there was a way to cancel my subscription multiple times. ",
                ">Democracy Dies In Darkness\n\nIt used to be a warning, but it's become just a description...",
                "WaPo bent the knee. Bezo wants in on the new robber baron era",
                "WP credibility shot to pieces ."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "3-year-old boy covered in bruises dies after being dumped outside Brooklyn hospital: sources",
            "external_url": "https://www.nbcnewyork.com/brooklyn/brooklyn-baby-dead-outside-hospital/6179120/",
            "upvotes": 3916,
            "date": "03/10/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/03/bk_hospital.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "That’s horrible poor little guy",
                "Remember when a CEO got shot and the entire NYPD was immediately tasked with tracking down the killer? \n\nI wonder if this child will get the same effort.",
                "Poor little angel. \n\nStuff like this makes me hope there is an after life so there are still kind, nurturing moments for him. I can’t imagine the fear he felt, and who knows for how long.\n\nI hope they find whoever did this.",
                "[removed]",
                "wtf is wrong with people\n\nThat’s horrific \n\nNo child deserves that",
                "Oh fuck that’s depressing. R.I.P. little one.",
                "JFC... it's like we are living in medieval times still.",
                "[removed]",
                "\"Your table for two is reserved in Hell.\"",
                "As someone that has a 3 year old - fuck those people! Disgusting assholes. People that torture and abuse children should be sentenced to death and die in agony and fear. The same fear that they caused those poor children, who were looking to them to be protected."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Social media platform X down again for thousands of users, Downdetector shows",
            "external_url": "https://www.reuters.com/technology/social-media-platform-x-down-thousands-users-downdetector-shows-2025-03-10/",
            "upvotes": 4954,
            "date": "03/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "elon needs to reply to a email stating 5 things he did to strengthen Xitters infrastructure",
                "Twitter is down, Space X rockets are exploding, Tesla is completely tanking.  We need to find the guy who runs these places he is perfect for government work.",
                "Remember when Twitter was so reliable that most other online services used it to report their outages?",
                "Nobody decent should even notice",
                "Fucking leave that platform,",
                "Bots “arguing” with other bots, who cares?",
                "Now we just need his Ketamine dealer to do us a solid.",
                "Oh no, what a tragedy.",
                "[Bluesky](https://bsky.app) is up, if anyone wants an alternative.",
                "Didn't have this problem with DEI.  Just saying."
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "RISING",
            "title": "Secretary of State Rubio says purge of USAID programs complete, with 83% of agency's programs gone",
            "external_url": "https://apnews.com/article/trump-musk-rubio-usaid-foreign-aid-bf442d62af67918a6fc5eee839074601",
            "upvotes": 13789,
            "date": "03/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So where's all the extra money going?",
                "well surely with 83% being gone, we'll get some fraud arrests any day now...",
                "How is that fucking legal? The founds were approved by congress",
                "So we killed soft power infrastructure in Africa while China is building ports and making new trade deals there. \n\n\nWhat is the end goal here? Sounds more like make China great again. ",
                "This election is destroying my faith in American democracy. If the winning party can destroy so many government institutions in the first three months of their term, it is not a stable system.",
                "So, hey, maybe it doesn't matter, but, you know, it's not actually legal for the Secretary of State to get up one day and say 83% of what a government department does is not going to get done anymore because he (or Elon) doesn't feel like it should be done.",
                ">\"Welp, Jesus did say we'd always have poor people.\"\n\n>-Some conservative, misinterpreting yet another passage in the Bible.",
                "What's the goal? To be North Korea? To have zero allies?",
                "They won't be forgiven for this.  Those programs were approved by congress.  They are violating the constitution and they need to be impeached now and sent to gitmo for the rest of their miserable lives.",
                "They do this creating a vacuum. Who is going to fill it. Guess the Russian and Chinese. American good will and influence years building are gone."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Man sentenced to 6 years in prison for gold bar scam that targeted Highlands Ranch woman",
            "external_url": "https://www.denver7.com/news/front-range/highlands-ranch/man-sentenced-to-6-years-in-prison-for-gold-bar-scam-that-targeted-highlands-ranch-woman",
            "upvotes": 298,
            "date": "03/10/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/27f6476/2147483647/strip/true/crop/2540x1334+0+27/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F0a%2F2f%2F7ff64186405ca1c7984ae62b32ef%2Fgold-bars.png",
            "top_comments": [
                ">The 23rd Judicial District Attorney's Office said Noble later handed over the two gold bars to Sagar Patel, 27, who was pretending to be an undercover agent. During the handoff, Noble recorded Patel's license plate office and turned it over to the Douglas County Sheriff's Office, leading to his arrest.\n\nGood for her for recording the license plate. Please check in on your family members. At least the ones you like. Make sure they're not getting scammed by strangers or family.\n\nTIPS: \n\n>The Denver Police Department offered these tips to keep yourself safe from scams:\n\n>* Block unwanted calls or text messages\n>* Don’t give personal or financial information over the phone or computer unless you initiated the communication with an entity you know and trust\n>* Slow down. Don’t give in to pressure to act immediately.\n>* Scammers like to be paid in cryptocurrency, gift card, or through peer-to-peer payment services. Never pay people you don’t know by those payment methods\n>* Scammers use technology to mask or spoof their telephone numbers. Caller ID can no longer be relied upon\n>* Law enforcement will never contact you and demand money",
                "This POS tried to boo-hoo his way into a shorter sentence. Let's give credit to Judge Victoria Klingensmith for the maximum sentence of 6 years in prison. Patel is also in the US illegally and ICE put a retainer on him so he'll get deported after he completes his sentence.",
                "The only legal way to obtain gold bars is through your job by being bribed as a Supreme Court justice",
                "[deleted]"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Crews accounted for after tanker and ship collide",
            "external_url": "https://www.bbc.com/news/articles/c9q4129reqgo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
            "upvotes": 198,
            "date": "03/10/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/152d/live/6bfe7e80-fdc5-11ef-a8b1-950887ddc6e5.jpg",
            "top_comments": [
                "Many years ago, a ship carrying red paint crashed into a ship carrying purple paint\n\nBoth crews were marooned.",
                "They said: “The Marine Accident Investigation Branch has deployed a team to Grimsby following the collision of the Portuguese registered container ship Solong and the US registered oil tanker Stena Immaculate which collided in the North Sea this morning.",
                "Career sailor (25 years) and spent a significant amount of time in the North Sea. The weather and sea state out there can get *rough* and it’s a high traffic area. I’m not trying to say it’s normal for this to happen, but it’s definitely different than two ships out in the open ocean.",
                "Good thing is the crew is safe, bad thing is we don't know till what extent will it damage the marine life/ecosystem.",
                "Apparently one crew member is missing.",
                "Did not a single crew member read “How to Avoid Huge Ships”? Seems like some mandatory reading could have helped avoid this whole thing."
            ],
            "aggregate_sentiment": 45.0
        }
    ],
    "last_updated": "03/10/2025 21:47:25 UTC"
}