{
    "posts": [
        {
            "category": "HOT",
            "title": "Pete Hegseth had an unsecured internet line set up in his office to connect to Signal, AP sources say",
            "external_url": "https://www.ctvnews.ca/world/article/pete-hegseth-had-an-unsecured-internet-line-set-up-in-his-office-to-connect-to-signal-ap-sources-say/",
            "upvotes": 16041,
            "date": "04/25/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/4YEWSMJAY45CNMAAARZCB6XHPQ.jpg?smart=true&auth=334b1defe62b2a369ef8b3cd017a963865ba09c3918db0420f3c9cfb5b8aa9d9&width=1200&height=630",
            "top_comments": [
                "“U.S. Defense Secretary Pete Hegseth had an internet connection that bypassed the Pentagon’s security protocols set up in his office to use the Signal messaging app on a personal computer, two people familiar with the line told The Associated Press.\n\nThe existence of the unsecured internet connection is the latest revelation about Hegseth’s use of the unclassified app and raises the possibility that sensitive defense information could have been put at risk of potential hacking or surveillance.”",
                "What’s this fuckers obsession with signal?",
                "He has also been having a mental breakdown on television, he needs to be removed from his position as soon as possible. He is a danger to the safety of the United States. ",
                "So he's just trying to hide some illegal shit at this point.",
                "....which synced to his phone though Bluetooth or WiFi. \n\nThe most powerful military leader -has an open internet computer, inside his office, that synced to his phone app everytime he sat down.",
                "But, Hillary’s emails..",
                "I mean, just out of curiosity, how do you get an insecure line added in the pentagon? Did they call up and have their ISP drill a new line in? I feel like someone somewhere had to say “yah we can’t really approve this”. It’s not like he dragged a cable through the building himself.",
                "i miss having a government made of even 50% competent upper management",
                "I don’t like irony after all",
                "He drunk and on grinder.  In his office"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Feds accidentally publish secret plan to kill NYC congestion pricing",
            "external_url": "https://gothamist.com/news/feds-accidentally-publish-secret-plan-to-kill-nyc-congestion-pricing",
            "upvotes": 34933,
            "date": "04/24/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350872/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                ">The internal 11-page letter, sent from attorneys in the Southern District of New York to a lawyer for the federal transportation department, was taken down less than an hour after it was erroneously put online.\n\nUh…you can’t put the toothpaste back in the tube.",
                "States' rights, except for those we do not like, amirite?",
                "Anyone know how to be deleted from Signal group chat, I keep getting added",
                "The one good thing about this administration is they are so unbelievably incompetent.    \n\nImagine the damage they were just as sinister AND competent.",
                "I had to double take that it didn't say congressman.",
                "I knew all about this.Someone named Pete texted me about this yesterday! I don’t know how I got on that text chain but I think the poster is pretty tipsy;)",
                "Trump's whole argument is BS.  He only cares about congestion pricing because he wants to hurt a blue state.   If Trump really thinks tolling interstate highways is illegal then what about Florida, New Jersey and Texas collecting a combined $5,000,000,000 annually in \"unfair\" tolls on interstate highways that we paid to build with tax dollars?   The Pennsylvania Turnpike was built and paid for 50 years ago and they still keep collecting those tolls.",
                "Fitting for an administration that destroys everything and accomplishes nothing.",
                "Their administration is so chaotic and unorganized that they can’t keep anything a secret it seems",
                "I'd love to say this is shockingly incompetent, but it's just par for the course at this point. Thankfully their stupidity undercuts the effectiveness of their authoritarianism a bit."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Trump pardons Nevada politician who paid for her plastic surgery with funds to honor a slain officer",
            "external_url": "https://apnews.com/article/trump-pardon-michele-fiore-nevada-fraud-cf56ef8b302b8111e47cf52d5a606d19",
            "upvotes": 2880,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Fiore, who does not have a law degree, was [appointed as a judge](https://apnews.com/article/politics-las-vegas-nevada-73278936d0baa571db1174aaf275d4c2) in deep-red Nye County in 2022 shortly after she lost her campaign for state treasurer.\n\nShe was elected last June to complete the unexpired term of a judge who died but had been suspended without pay amid her legal troubles. Pahrump is an hour’s drive west of Las Vegas.\n\nIn her statement Thursday, Fiore also said she plans to return to the bench next week.\"\n\n\n\nwhy indeed",
                "At first I was like \"Why would he pardon her\".. but then..\n\n> President Donald Trump has pardoned a Nevada Republican politician who was awaiting sentencing on federal charges that she used money",
                "A scumbag pardoning a scumbag.",
                "Of course he did, he stole funds from a veteran’s charity",
                "Republicans do their thing",
                "The silence from the right speaks for itself",
                "All the best people. 🙄\n\nLike, when is it enough?",
                "Yup, sounds about right.",
                "She’s had plastic surgery and still looks like that?",
                "Crime is legal. Steal from rich people. Literally just take their shit."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Rwandan genocide leader living in exclusive New York enclave arrested for alleged immigration violations",
            "external_url": "https://abcnews.go.com/US/rwandan-genocide-leader-living-exclusive-new-york-enclave/story?id=121129509",
            "upvotes": 6956,
            "date": "04/24/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/59336e57-c4d5-4d4b-aec4-bd40aaea3d1e/doj-seal-gty-jef-250424_1745512986238_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "That's exactly the sort of visa fraud that we want the government to look into.",
                "NYT did an [article](https://www.nytimes.com/2006/05/14/nyregion/nyregionspecial2/14libee.html) on him in 2006 without knowing who he really was",
                "He’s lived here for over two decades, financed how?",
                "Finally, the Trump admin arrests someone for immigration related fraud that deserves to be arrested and deported.",
                "Why do I get the feeling this one isn’t going to El Salvador…",
                "*“As alleged, Nsabumukunzi repeatedly lied to conceal his involvement in the horrific Rwandan genocide while seeking to become a lawful permanent resident and citizen of the United States,” said United States Attorney John Durham.*\n\nHe's facing a 30 year sentence, which in no way matches his crimes.  He is not, in any normal sense of the word, an immigrant.",
                "Looks like ICE needed some good press.",
                "While I wish his ass would go to a gulag in El Salvador’s, they should deport him back to Rwanda ",
                "I am really skeptical the feds *just* found out about this after all this bad press for ICE lately. It seems like there were sooooo many opportunities to learn this over the last 20 years. I wonder if he’s been an informant or there was some other reason they let him stay. And ICE needed some story to put them back in America’s good graces and went after the guy they knew was here and decided no one would care if this guy is deported (I certainly wouldn’t, provided due process happens).",
                "I think we can all agree this is the kinda dude that deserves to get shipped back"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Detention officers arrested after retired K9 found dead",
            "external_url": "https://www.kait8.com/2025/04/24/detention-officers-arrested-after-retired-k9-found-dead/",
            "upvotes": 2062,
            "date": "04/24/2025",
            "thumbnail": "https://gray-kait-prod.gtv-cdn.com/resizer/v2/GHXBEQPYIRAMBJGXFNXBUG5NF4.jpg?auth=a092eeb0f687d1cdbabc799010f306b2b3a63dac66fb81e1b40cef0f0b00022b&width=1200&height=600&smart=true",
            "top_comments": [
                "I know we shouldn’t judge a book by its cover, but JFC. They look like two guys who would be arrested for killing a dog.",
                "Oh, poor little boy. He died in his little house. Likely the only place he felt safe. Just looking for a tiny bit of love.\n\nIf I have only one wish it's for you Bane. May you live on in the eternal meadow. Where it is always the most beautiful day.",
                "The dog staved to death lovked in a outdoor kennel with no food or water. He was dead at least a week",
                "I always wonder what happens to retired police dogs. And while they are working- are they actually shown love? If they are retired, why not keep them?",
                "Can anyone explain how if a suspect harms a K9 while they're on duty, they get charged with all the same crimes as they would if it was a human officer but when they're retired they lose all of that status? I know it wouldn't be murder charges but couldn't they charge the people with negligent homicide of a police officer so they get more harsh sentencing or does that not apply for retirees or off duty police? Just wondering",
                "It takes a real special kind of awful to mistreat animals.\n\nGonna hug my little dude a little tighter tonight because I'm thankful for every day I have with him.",
                "Between this and the post (about the scoliosis alligator) where someone mentioned a lion cub with a broken back left behind by its pack and desperately trying to crawl after them, I think I've had just about enough internet for today.",
                "They should be charged with killing an officer.  That's what any other civi who kills a police dog gets charged with.  Idc if he was retired.  ",
                "I'm not sure why the k9 handler let his son have the retired k9 officer, but I hope he has some remorse over that. Going to be you being neglected next. Poor dog. Locking up animals in small places and letting them starve to death through complete neglect has got to be some red flag for absolute fucking human garbage. Throw him in the trash.",
                ">\"According to court documents, the sheriff’s office received an anonymous tip that retired K9 Bane “was being neglected and abused” by Huffstetler.\n\n>“The tip stated **Bane was living outside with no food, water, or shade,**” Sergeant Ashten Jackson stated in the affidavit.  \n...  \n“Detectives located K9 Bane deceased in a plastic dog house inside the outdoor kennel,” Jackson stated. “K9 Bane appears to have been deceased for a substantial amount of time.”"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Exclusive: US Justice Dept grant cuts valued at $811 million, people and records say",
            "external_url": "https://www.reuters.com/world/us/us-justice-dept-grant-cuts-valued-811-million-people-familiar-say-2025-04-24/",
            "upvotes": 1307,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So Republicans just defunded police?",
                "reduced funding for police training? yeah... that'll sure end well.",
                "New training manual by trump = shoot first question later. Class dismiss!\n\nFucking stop going to malagua definitely cut spending.",
                "And all that money funneled into Musk and the oligarchs.",
                "For my people out there who don't click links:\n\n  \n*WASHINGTON, April 24 (Reuters) - The U.S. Justice Department is terminating $811 million in grants, including some impacting victim service programs ranging from trauma centers and sign language interpretation and police training, according to internal documents and two sources.The 365 competitive grants being terminated were valued at $811 million when awarded, a total reported exclusively by Reuters. These grants are typically paid out over three years, though it remains unclear how much money was left unspent at the time of the cuts.The cuts affect awards managed by the Office of Justice Programs. As a measure of scope, the office received approval to award roughly $3 billion in total competitive grants in the 2024 fiscal year.The Justice Department declined to comment.President Donald Trump's administration is engaged in a wide-ranging campaign to slash the federal government that is taking particular aim at policies he opposes, including those that promote diversity, equity and inclusion and refugee resettlement. Accounts from federal workers and experts depict the effort as chaotic at times, with agencies in some cases laying off workers that they then need to rehire.The Justice Department told Reuters on Wednesday it was discerning in how it selected which grants to cut, with Attorney General Pam Bondi saying it would \"continue to ensure that services for victims are not impacted.\"Following a Reuters report on funding cuts to a program for pet-friendly domestic violence shelters, the department restored aid for some recipients. These included one of the only Connecticut providers accepting pets across all its shelters, along with a service provider in Maryland.\"Attorney General Bondi personally extends her appreciation to the Maryland Network Against Domestic Violence for its steadfast commitment to domestic violence survivors and the professionals who support them,\" wrote Deputy Assistant Attorney General Maureen Henneberg in an email seen by Reuters that was sent on Wednesday night to the group, rescinding the termination of the grant.A review of the cuts to grant programs from the Office for Victims of Crime shows that many provided a mix of direct and indirect assistance for domestic violence and trafficking victims.*\n\n*Activating Change, a nonprofit that supports domestic violence victims with disabilities, lost five federal grants totaling more than $2 million, said Executive Director Nancy* [*Smith.One*](http://Smith.One) *of those paid for American Sign Language interpretation services for domestic violence victims, while another trains police on how to investigate trafficking crimes against people with disabilities.Another recipient that lost funding is the Central Iowa Trauma Recovery Center, which received support from Republican Senator Charles Grassley.Other canceled grants funded programs from criminal justice research, to efforts to help reduce recidivism and support people after they are finished serving prison terms.Of the $811 million in total cuts, about $71 million comes from grants offered by the Office for Victims of Crime, according to a spreadsheet of the grants seen by Reuters.DOJ cut roughly $535 million to programs from the Bureau of Justice Assistance, which funds programs to support many local police departments and correctional facilities, the data shows.The federal agency cut about $136 million from the Office of Juvenile Justice and Delinquency Prevention, and terminated nearly $59 million in research grants funded by the National Institute of Justice.*",
                "How does this make us great?",
                "Idiotcracy at its finest",
                "Honestly, if it means these gestapo 2.0 bastards breaking down dorm rooms to arrest pro Palestinian protesters without a warrant can do their job less efficiently, than I'm all for it.\n\nSadly it reads like they're cutting the few good things that are done by these departments.",
                "Remember the first 250ish years of the country when Congress controller spending?",
                "Which is a rounding error in americas budget.  Not even a billi"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Texas creates its own DOGE in attempt to make the state more business-friendly",
            "external_url": "https://www.keranews.org/texas-news/2025-04-24/texas-creates-its-own-doge-in-attempt-to-make-the-state-more-business-friendly",
            "upvotes": 7349,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What is it going to cut?  Republicans in Texas have been in charge of the budgetfor decades.",
                "Isn't Texas one of those states that's been controlled by republicans for decades? ",
                "Gross. Texas proving once again that it's a total shithole",
                "The irony of signing a bill for \"government efficiency\", while using dozens of different pens to hand off as souvenirs for your corporate masters",
                "Texas can't even keep their power grid functioning 🙄 cuts to spending should be the last thing on their mind",
                "Business friendly = human miserable",
                "Is business friendly the impression they got from this? Wow",
                "So you have a federal level DOGE and a state level DOGE? That sounds like inefficiency to me, one of them will have to go.",
                "If Texas gets any more business friendly, they will have slavery.",
                "So let's talk this thru, with beef as an example:\n \nThe state that produces more beef than anywhere else is going to cut regulations on businesses, giving free rein to bad actors.\n\nThey will also eliminate (I'm assuming) any current protections they have for immigrant workers, as they turn said workers over to ICE for deportation driving even legal workers out of the state. \n\nAt the same time, the FDA will no longer be performing quality checks, and will be understaffed to respond to incidents. \n\nAlso, the CDC and other health agencies have been effectively muzzled on what they can share with each other or the public.\n\n**In conclusion**: Texas is inviting cattle ranchers and slaughterhouse operators to build or expand, with little to no regulation. Cattle will be kept and fed less safely. Slaughterhouses and beef packaging plants will be understaffed. There will be no government oversight to ensure meat is not spoiled when packaged or stored unsafely. When inevitable outbreaks occur, recalls will be less likely. Then the FDA and the CDC cannot tell consumers about the danger if there is an outbreak, anyway. Widespread illness and death occur.  BUT, at least business owners and politicians made more money. And I become a vegetarian."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "After a scathing rebuke, judge grants DOJ an extension in deportation case",
            "external_url": "https://www.npr.org/2025/04/23/nx-s1-5373746/federal-judge-blasts-trump-stonewalling-deportation-case",
            "upvotes": 2307,
            "date": "04/24/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fae%2Fda%2F3d30708646a89f452f8371e3de32%2Fgettyimages-2210399552.jpg",
            "top_comments": [
                "To be clear, the lawyers representing Abrego Garcia *also* signed off on this pause. We don't know *what* the deal is, but the Trump administration floating something that apparently offered the possibility of resolution. We'll see what ultimately happens, but I don't think this is actually *bad* news, per se.",
                "Yeah, sounds about right. Absolutely worthless.",
                ">\"Defendants have failed to respond in good faith, and their refusal to do so can only be viewed as willful and intentional noncompliance,\" Xinis wrote.\n\n>\"That ends now,\" Judge Xinis declared as she rejected the administration's arguments so far as \"specious\" and condemned their \"mischaracterization\" of the Supreme Court's directive to facilitate Abrego Garcia's return to the U.S.\n\nJudge Xinis should have clarified, \"That ends...in another week\". What a joke.",
                "Because people are reading the headline and nothing more, she gave them a week because KILMAR'S ATTORNEYS AGREED TO IT. The government's attorneys filed something under seal, Kilmar's attorney replied to it, and then both sides agreed to push back the deadline a week.",
                "A delay for what? We have Congress people going there. We have the creepy President of El Salvador coming here. We have Trump making many statements about how he refuses to comply with the Supreme Court. Do we just not care that democracy is dying? The man that our government said was mistakenly sent there, paid for by the US to be kidnapped and jailed in that country, could be back here tonight.",
                "Soooo, “That ends now” meant…what, exactly?\n\nFor fuck sake - either just let this man turn into Hitler reincarnate or don’t. But fucking pick a lane. Let me know what I’m dealing with already. These repeated facades of holding these mother fuckers to account is exhausting and deflating. What the fuck else do they need to show you? These fascists have so little regard for the law and the constitution that they would wipe their asses with Xinis’s robe if given the chance. \n\nBut sure - go ahead and give them another week after demanding that “this ends now”.  Jesus Christ…",
                "There’s a special place in hell for Trump and his enablers.",
                "DT: \"Let's just stall.\"\n\nSC: \"We don't have to make a determination and just let it float in legal limbo.\"",
                "Justice delayed is now par for the course",
                "And still nothing happens."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Maryland judge orders return of Venezuelan asylum seeker deported to El Salvador | CNN Politics",
            "external_url": "https://www.cnn.com/2025/04/24/politics/maryland-judge-return-venezuelan-asylum-seeker/index.html",
            "upvotes": 1950,
            "date": "04/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/08-04-2025-03-16t233141z-1466303683-rc25edablquk-rtrmadp-3-usa-trump-migration-el-salvador-jpg.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Yes. Due process for every last person that we've sent. Every single human that we've deported there is protected under the constitution and the day we stop defending that is the day that we all surrender our own constitutional rights.",
                "Add it to the list of shit they'll ignore because who's gonna do anything about it?",
                "Donald Trump thinks that asylum means \"insane asylum\" and that's why he says it all the time. I really do believe this.",
                "But have we looked at his tattoos. According to our gov, tattoos are the fundamental principle of fairness.",
                "Trump: No, thanks for the suggestion though.",
                "Order schmorder, you have no power over the king.\n\nI HATE this timeline.",
                "It's easy to forget but we sent a man with no due process, who was ordered to be PROTECTED by our courts... to a death camp.\n\nThe foundations of everything are fucked if the laws don't prevail.",
                "> The Trump administration, according to the order, has argued Cristian’s deportation did not violate the settlement, asserting “his designation as an alien enemy pursuant to the AEA results in him ceasing to be a member” of the class action. The government invoked the Alien Enemies Act, an 18th-century wartime authority, on March 15 to deport alleged members of Tren de Aragua, a Venezuelan gang Trump accuses of “perpetrating an invasion of and predatory incursion into the United States.”\nA sworn declaration from Robert Cerna, the ICE acting Field Office Director for Enforcement and Removal Operations, said Cristian had been arrested in Texas in January.\n“On January 6, 2025, (‘Cristian’) was convicted in the 482nd District Court at Harris County, Texas, for the offense of possession of cocaine,” Cerna stated in the filing. Cerna added that Immigration and Customs Enforcement determined Cristian was subject to removal following the invocation of the AEA.\n\nSo he was deported to El Salvador when he was from Venezuela. Against orders of a legal settlement that gave him protection. To be placed in CECOT, but the only detailed claim against him is he had cocaine. Are we going to be arresting every college kid who does cocaine and tossing them in a US Supermax without due process? Due process must be upheld for all, or it is too easy for our government to incarcerate anyone on a whim.",
                "Well, didn't the supreme court also order the return of the one wrongfully sent to El Salvador a while ago. Does anyone really believe that will happen?\n\nThe constitution crisis is here now. When an order of the supreme court is ignored, the house of cards is going to come crashing down because the only thing holding up our constitution is the belief that it should be. There is no real power being allocated to the judicial.",
                "Can we use names. Whats this person's name?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Judge rules federal government owes nearly $28 million to North Dakota for pipeline protests",
            "external_url": "https://www.nbcnews.com/news/us-news/judge-rules-federal-government-owes-nearly-28-million-north-dakota-pip-rcna202738",
            "upvotes": 3802,
            "date": "04/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-dakota-access-pipeline-mb-0909-90917d.jpg",
            "top_comments": [
                ">The sometimes-chaotic demonstrations drew international attention for the Standing Rock Sioux Tribe’s opposition to the pipeline’s Missouri River crossing upstream of the tribe’s reservation. The tribe has long opposed the pipeline, fearing an oil spill polluting its water supply.\n\nAnd sure enough [the pipeline ruptured spilling 3,500 gallons of oil a couple weeks ago](https://www.kvrr.com/2025/04/08/update-3500-barrels-of-oil-spilled-after-keystone-pipeline-rupture-near-fort-ransom/) but good news for the cops who policed the protests I guess",
                "“federal government owes state government millions for doing the violent suppression for them”",
                "Dude they were using private security to set dogs on Native Americans. How fucked up is that. Those dogs weren’t even real cops.",
                "Wow this is so corrupt it's ridiculous. Suing the government to pay the state for illegally using state law enforcement to break up a protest against a private company.",
                "Why isn’t the company paying for this? Maybe if there was an actual economic impact to using your money and influence to lobby for projects in your favor. We’d see corporations less likely to engage in this kind of hell or high water engagement of local communities.",
                "Which political party was in power in Feb 2017 when the protests were over  and it came time to pay up? What a mystery.",
                "We’ve learned judges’ ruling are all toothless",
                "This right here.\n\nThis.\n\nThis is sinclairs jungle. ",
                "Can't sue the government unless the government lets you.",
                "Will the Trump administration pay it or will he just bitch and moan about how he wasn't president at the time?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Man Suspected of Cutting Down Multiple Trees In Los Angeles Charged with Vandalism",
            "external_url": "https://mynewsla.com/crime/2025/04/24/man-suspected-of-cutting-down-multiple-trees-charged-with-vandalism-4/",
            "upvotes": 6,
            "date": "04/25/2025",
            "thumbnail": "https://i0.wp.com/mynewsla.com/wp-content/uploads/2021/10/MNLA-Facebook.jpg?fit=640%2C360&ssl=1",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Tensions escalate between India and Pakistan following attack in disputed Kashmir",
            "external_url": "https://abcnews.go.com/International/wireStory/tensions-escalate-india-pakistan-deadly-attack-disputed-kashmir-121114021",
            "upvotes": 6,
            "date": "04/25/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/715ee881-98ee-453c-9a18-3aa855f979bc/wirestory_242c7a600a51793f5484e4f620402fdd_16x9.jpg?w=1600",
            "top_comments": [
                "Maybe Trump can bring Peace here too since he’s doing such a good job on Ukraine & the economy."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Trump pardons Nevada politician who paid for her plastic surgery with funds to honor a slain officer",
            "external_url": "https://apnews.com/article/trump-pardon-michele-fiore-nevada-fraud-cf56ef8b302b8111e47cf52d5a606d19",
            "upvotes": 2884,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Fiore, who does not have a law degree, was [appointed as a judge](https://apnews.com/article/politics-las-vegas-nevada-73278936d0baa571db1174aaf275d4c2) in deep-red Nye County in 2022 shortly after she lost her campaign for state treasurer.\n\nShe was elected last June to complete the unexpired term of a judge who died but had been suspended without pay amid her legal troubles. Pahrump is an hour’s drive west of Las Vegas.\n\nIn her statement Thursday, Fiore also said she plans to return to the bench next week.\"\n\n\n\nwhy indeed",
                "At first I was like \"Why would he pardon her\".. but then..\n\n> President Donald Trump has pardoned a Nevada Republican politician who was awaiting sentencing on federal charges that she used money",
                "A scumbag pardoning a scumbag.",
                "Of course he did, he stole funds from a veteran’s charity",
                "Republicans do their thing",
                "The silence from the right speaks for itself",
                "All the best people. 🙄\n\nLike, when is it enough?",
                "Yup, sounds about right.",
                "She’s had plastic surgery and still looks like that?",
                "Crime is legal. Steal from rich people. Literally just take their shit."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Pete Hegseth had an unsecured internet line set up in his office to connect to Signal, AP sources say",
            "external_url": "https://www.ctvnews.ca/world/article/pete-hegseth-had-an-unsecured-internet-line-set-up-in-his-office-to-connect-to-signal-ap-sources-say/",
            "upvotes": 16035,
            "date": "04/25/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/4YEWSMJAY45CNMAAARZCB6XHPQ.jpg?smart=true&auth=334b1defe62b2a369ef8b3cd017a963865ba09c3918db0420f3c9cfb5b8aa9d9&width=1200&height=630",
            "top_comments": [
                "“U.S. Defense Secretary Pete Hegseth had an internet connection that bypassed the Pentagon’s security protocols set up in his office to use the Signal messaging app on a personal computer, two people familiar with the line told The Associated Press.\n\nThe existence of the unsecured internet connection is the latest revelation about Hegseth’s use of the unclassified app and raises the possibility that sensitive defense information could have been put at risk of potential hacking or surveillance.”",
                "What’s this fuckers obsession with signal?",
                "He has also been having a mental breakdown on television, he needs to be removed from his position as soon as possible. He is a danger to the safety of the United States. ",
                "So he's just trying to hide some illegal shit at this point.",
                "....which synced to his phone though Bluetooth or WiFi. \n\nThe most powerful military leader -has an open internet computer, inside his office, that synced to his phone app everytime he sat down.",
                "But, Hillary’s emails..",
                "I mean, just out of curiosity, how do you get an insecure line added in the pentagon? Did they call up and have their ISP drill a new line in? I feel like someone somewhere had to say “yah we can’t really approve this”. It’s not like he dragged a cable through the building himself.",
                "i miss having a government made of even 50% competent upper management",
                "I don’t like irony after all",
                "He drunk and on grinder.  In his office"
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "NEW",
            "title": "Detention officers arrested after retired K9 found dead",
            "external_url": "https://www.kait8.com/2025/04/24/detention-officers-arrested-after-retired-k9-found-dead/",
            "upvotes": 2072,
            "date": "04/24/2025",
            "thumbnail": "https://gray-kait-prod.gtv-cdn.com/resizer/v2/GHXBEQPYIRAMBJGXFNXBUG5NF4.jpg?auth=a092eeb0f687d1cdbabc799010f306b2b3a63dac66fb81e1b40cef0f0b00022b&width=1200&height=600&smart=true",
            "top_comments": [
                "I know we shouldn’t judge a book by its cover, but JFC. They look like two guys who would be arrested for killing a dog.",
                "Oh, poor little boy. He died in his little house. Likely the only place he felt safe. Just looking for a tiny bit of love.\n\nIf I have only one wish it's for you Bane. May you live on in the eternal meadow. Where it is always the most beautiful day.",
                "The dog staved to death lovked in a outdoor kennel with no food or water. He was dead at least a week",
                "I always wonder what happens to retired police dogs. And while they are working- are they actually shown love? If they are retired, why not keep them?",
                "Can anyone explain how if a suspect harms a K9 while they're on duty, they get charged with all the same crimes as they would if it was a human officer but when they're retired they lose all of that status? I know it wouldn't be murder charges but couldn't they charge the people with negligent homicide of a police officer so they get more harsh sentencing or does that not apply for retirees or off duty police? Just wondering",
                "It takes a real special kind of awful to mistreat animals.\n\nGonna hug my little dude a little tighter tonight because I'm thankful for every day I have with him.",
                "Between this and the post (about the scoliosis alligator) where someone mentioned a lion cub with a broken back left behind by its pack and desperately trying to crawl after them, I think I've had just about enough internet for today.",
                "They should be charged with killing an officer.  That's what any other civi who kills a police dog gets charged with.  Idc if he was retired.  ",
                "I'm not sure why the k9 handler let his son have the retired k9 officer, but I hope he has some remorse over that. Going to be you being neglected next. Poor dog. Locking up animals in small places and letting them starve to death through complete neglect has got to be some red flag for absolute fucking human garbage. Throw him in the trash.",
                ">\"According to court documents, the sheriff’s office received an anonymous tip that retired K9 Bane “was being neglected and abused” by Huffstetler.\n\n>“The tip stated **Bane was living outside with no food, water, or shade,**” Sergeant Ashten Jackson stated in the affidavit.  \n...  \n“Detectives located K9 Bane deceased in a plastic dog house inside the outdoor kennel,” Jackson stated. “K9 Bane appears to have been deceased for a substantial amount of time.”"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Exclusive: US Justice Dept grant cuts valued at $811 million, people and records say",
            "external_url": "https://www.reuters.com/world/us/us-justice-dept-grant-cuts-valued-811-million-people-familiar-say-2025-04-24/",
            "upvotes": 1302,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So Republicans just defunded police?",
                "reduced funding for police training? yeah... that'll sure end well.",
                "New training manual by trump = shoot first question later. Class dismiss!\n\nFucking stop going to malagua definitely cut spending.",
                "And all that money funneled into Musk and the oligarchs.",
                "For my people out there who don't click links:\n\n  \n*WASHINGTON, April 24 (Reuters) - The U.S. Justice Department is terminating $811 million in grants, including some impacting victim service programs ranging from trauma centers and sign language interpretation and police training, according to internal documents and two sources.The 365 competitive grants being terminated were valued at $811 million when awarded, a total reported exclusively by Reuters. These grants are typically paid out over three years, though it remains unclear how much money was left unspent at the time of the cuts.The cuts affect awards managed by the Office of Justice Programs. As a measure of scope, the office received approval to award roughly $3 billion in total competitive grants in the 2024 fiscal year.The Justice Department declined to comment.President Donald Trump's administration is engaged in a wide-ranging campaign to slash the federal government that is taking particular aim at policies he opposes, including those that promote diversity, equity and inclusion and refugee resettlement. Accounts from federal workers and experts depict the effort as chaotic at times, with agencies in some cases laying off workers that they then need to rehire.The Justice Department told Reuters on Wednesday it was discerning in how it selected which grants to cut, with Attorney General Pam Bondi saying it would \"continue to ensure that services for victims are not impacted.\"Following a Reuters report on funding cuts to a program for pet-friendly domestic violence shelters, the department restored aid for some recipients. These included one of the only Connecticut providers accepting pets across all its shelters, along with a service provider in Maryland.\"Attorney General Bondi personally extends her appreciation to the Maryland Network Against Domestic Violence for its steadfast commitment to domestic violence survivors and the professionals who support them,\" wrote Deputy Assistant Attorney General Maureen Henneberg in an email seen by Reuters that was sent on Wednesday night to the group, rescinding the termination of the grant.A review of the cuts to grant programs from the Office for Victims of Crime shows that many provided a mix of direct and indirect assistance for domestic violence and trafficking victims.*\n\n*Activating Change, a nonprofit that supports domestic violence victims with disabilities, lost five federal grants totaling more than $2 million, said Executive Director Nancy* [*Smith.One*](http://Smith.One) *of those paid for American Sign Language interpretation services for domestic violence victims, while another trains police on how to investigate trafficking crimes against people with disabilities.Another recipient that lost funding is the Central Iowa Trauma Recovery Center, which received support from Republican Senator Charles Grassley.Other canceled grants funded programs from criminal justice research, to efforts to help reduce recidivism and support people after they are finished serving prison terms.Of the $811 million in total cuts, about $71 million comes from grants offered by the Office for Victims of Crime, according to a spreadsheet of the grants seen by Reuters.DOJ cut roughly $535 million to programs from the Bureau of Justice Assistance, which funds programs to support many local police departments and correctional facilities, the data shows.The federal agency cut about $136 million from the Office of Juvenile Justice and Delinquency Prevention, and terminated nearly $59 million in research grants funded by the National Institute of Justice.*",
                "How does this make us great?",
                "Idiotcracy at its finest",
                "Honestly, if it means these gestapo 2.0 bastards breaking down dorm rooms to arrest pro Palestinian protesters without a warrant can do their job less efficiently, than I'm all for it.\n\nSadly it reads like they're cutting the few good things that are done by these departments.",
                "Remember the first 250ish years of the country when Congress controller spending?",
                "Which is a rounding error in americas budget.  Not even a billi"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Rwandan genocide leader living in exclusive New York enclave arrested for alleged immigration violations",
            "external_url": "https://abcnews.go.com/US/rwandan-genocide-leader-living-exclusive-new-york-enclave/story?id=121129509",
            "upvotes": 6957,
            "date": "04/24/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/59336e57-c4d5-4d4b-aec4-bd40aaea3d1e/doj-seal-gty-jef-250424_1745512986238_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "That's exactly the sort of visa fraud that we want the government to look into.",
                "NYT did an [article](https://www.nytimes.com/2006/05/14/nyregion/nyregionspecial2/14libee.html) on him in 2006 without knowing who he really was",
                "He’s lived here for over two decades, financed how?",
                "Finally, the Trump admin arrests someone for immigration related fraud that deserves to be arrested and deported.",
                "Why do I get the feeling this one isn’t going to El Salvador…",
                "*“As alleged, Nsabumukunzi repeatedly lied to conceal his involvement in the horrific Rwandan genocide while seeking to become a lawful permanent resident and citizen of the United States,” said United States Attorney John Durham.*\n\nHe's facing a 30 year sentence, which in no way matches his crimes.  He is not, in any normal sense of the word, an immigrant.",
                "Looks like ICE needed some good press.",
                "While I wish his ass would go to a gulag in El Salvador’s, they should deport him back to Rwanda ",
                "I am really skeptical the feds *just* found out about this after all this bad press for ICE lately. It seems like there were sooooo many opportunities to learn this over the last 20 years. I wonder if he’s been an informant or there was some other reason they let him stay. And ICE needed some story to put them back in America’s good graces and went after the guy they knew was here and decided no one would care if this guy is deported (I certainly wouldn’t, provided due process happens).",
                "I think we can all agree this is the kinda dude that deserves to get shipped back"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Feds accidentally publish secret plan to kill NYC congestion pricing",
            "external_url": "https://gothamist.com/news/feds-accidentally-publish-secret-plan-to-kill-nyc-congestion-pricing",
            "upvotes": 34950,
            "date": "04/24/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350872/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                ">The internal 11-page letter, sent from attorneys in the Southern District of New York to a lawyer for the federal transportation department, was taken down less than an hour after it was erroneously put online.\n\nUh…you can’t put the toothpaste back in the tube.",
                "States' rights, except for those we do not like, amirite?",
                "Anyone know how to be deleted from Signal group chat, I keep getting added",
                "The one good thing about this administration is they are so unbelievably incompetent.    \n\nImagine the damage they were just as sinister AND competent.",
                "I had to double take that it didn't say congressman.",
                "I knew all about this.Someone named Pete texted me about this yesterday! I don’t know how I got on that text chain but I think the poster is pretty tipsy;)",
                "Trump's whole argument is BS.  He only cares about congestion pricing because he wants to hurt a blue state.   If Trump really thinks tolling interstate highways is illegal then what about Florida, New Jersey and Texas collecting a combined $5,000,000,000 annually in \"unfair\" tolls on interstate highways that we paid to build with tax dollars?   The Pennsylvania Turnpike was built and paid for 50 years ago and they still keep collecting those tolls.",
                "Fitting for an administration that destroys everything and accomplishes nothing.",
                "Their administration is so chaotic and unorganized that they can’t keep anything a secret it seems",
                "I'd love to say this is shockingly incompetent, but it's just par for the course at this point. Thankfully their stupidity undercuts the effectiveness of their authoritarianism a bit."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Man charged with arson after authorities say he sparked New Jersey Pine Barrens fire",
            "external_url": "https://apnews.com/article/new-jersey-wildfire-smoke-ny-air-quality-67b146ae19bef2cb111d7efc3d0b563d",
            "upvotes": 677,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Obviously not an interior decorator.",
                "It always amazes me that authorities are able to find people who start forest fires. Seems like it would be very hard to do.",
                "tldr: it wasn't on purpose. dude had a bon fire and didn't extinguish it all the way before leaving. Fire flared back up and started to spread through the woods.",
                "If we held people financially accountable for this stuff (when it’s accidental but preventable and causes massive damage like this) I bet people would be a lot more careful. This is clearly accidental but from idiocy. Who the heck just walks away from a bonfire? It’s one thing if it’s your little patio thing that’s well contained and dying out. It’s another when you’re burning piles of rubbish in your yard",
                "One of the issues that is missed by the news media is that this and many other ecosystems are supposed to burn regularly. I could write an essay on this, but the NJ Pine Barrens, just like the rest of the Atlantic Coast Pine Barrens, is a fire-dependent ecosystem. Plants and animals that live in this ecosystem rely on fire to maintain the habitat that they need to reproduce and thrive. Many require open habitat, like NJ's state reptile, the Bog Turtle. This species is also on the Endangered Species List and is considered Critically Endangered globally. \n\nThe issue is, like many of the other fire-dependent ecosystems in the world, people built structures in them and then repressed the fire that was integral to the ecosystem. It wasn't until the 1990s and early 2000s that we realized how important fire is for ecosystems like this. But now they have a ton of fuel for fires, and they can easily catch on fire and rapidly spread. It's technically a natural and important part of the ecosystem, it's just we don't like when structures and timber trees burn.",
                "Isn't that where the goodfellas buried the bodies back in the day?\n\nhttps://www.nytimes.com/1973/02/05/archives/mob-favors-pinelands-for-burials.html",
                "I wonder if Pauli's Russian made it out.",
                "I hope so, I’ll never get that shoe back now!",
                "Trying to smoke that Russian mob guy out. He’s still out there.",
                "He was trying to smoke out the Jersey Devil and prove that it's real once and for all. In all seriousness though, fuck that guy with a million fines and life in jail with the Jersey Devil as his cellmate. "
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "After a scathing rebuke, judge grants DOJ an extension in deportation case",
            "external_url": "https://www.npr.org/2025/04/23/nx-s1-5373746/federal-judge-blasts-trump-stonewalling-deportation-case",
            "upvotes": 2306,
            "date": "04/24/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fae%2Fda%2F3d30708646a89f452f8371e3de32%2Fgettyimages-2210399552.jpg",
            "top_comments": [
                "To be clear, the lawyers representing Abrego Garcia *also* signed off on this pause. We don't know *what* the deal is, but the Trump administration floating something that apparently offered the possibility of resolution. We'll see what ultimately happens, but I don't think this is actually *bad* news, per se.",
                "Yeah, sounds about right. Absolutely worthless.",
                ">\"Defendants have failed to respond in good faith, and their refusal to do so can only be viewed as willful and intentional noncompliance,\" Xinis wrote.\n\n>\"That ends now,\" Judge Xinis declared as she rejected the administration's arguments so far as \"specious\" and condemned their \"mischaracterization\" of the Supreme Court's directive to facilitate Abrego Garcia's return to the U.S.\n\nJudge Xinis should have clarified, \"That ends...in another week\". What a joke.",
                "Because people are reading the headline and nothing more, she gave them a week because KILMAR'S ATTORNEYS AGREED TO IT. The government's attorneys filed something under seal, Kilmar's attorney replied to it, and then both sides agreed to push back the deadline a week.",
                "A delay for what? We have Congress people going there. We have the creepy President of El Salvador coming here. We have Trump making many statements about how he refuses to comply with the Supreme Court. Do we just not care that democracy is dying? The man that our government said was mistakenly sent there, paid for by the US to be kidnapped and jailed in that country, could be back here tonight.",
                "Soooo, “That ends now” meant…what, exactly?\n\nFor fuck sake - either just let this man turn into Hitler reincarnate or don’t. But fucking pick a lane. Let me know what I’m dealing with already. These repeated facades of holding these mother fuckers to account is exhausting and deflating. What the fuck else do they need to show you? These fascists have so little regard for the law and the constitution that they would wipe their asses with Xinis’s robe if given the chance. \n\nBut sure - go ahead and give them another week after demanding that “this ends now”.  Jesus Christ…",
                "There’s a special place in hell for Trump and his enablers.",
                "DT: \"Let's just stall.\"\n\nSC: \"We don't have to make a determination and just let it float in legal limbo.\"",
                "Justice delayed is now par for the course",
                "And still nothing happens."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Trump pardons Nevada politician who paid for her plastic surgery with funds to honor a slain officer",
            "external_url": "https://apnews.com/article/trump-pardon-michele-fiore-nevada-fraud-cf56ef8b302b8111e47cf52d5a606d19",
            "upvotes": 2882,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Fiore, who does not have a law degree, was [appointed as a judge](https://apnews.com/article/politics-las-vegas-nevada-73278936d0baa571db1174aaf275d4c2) in deep-red Nye County in 2022 shortly after she lost her campaign for state treasurer.\n\nShe was elected last June to complete the unexpired term of a judge who died but had been suspended without pay amid her legal troubles. Pahrump is an hour’s drive west of Las Vegas.\n\nIn her statement Thursday, Fiore also said she plans to return to the bench next week.\"\n\n\n\nwhy indeed",
                "At first I was like \"Why would he pardon her\".. but then..\n\n> President Donald Trump has pardoned a Nevada Republican politician who was awaiting sentencing on federal charges that she used money",
                "A scumbag pardoning a scumbag.",
                "Of course he did, he stole funds from a veteran’s charity",
                "Republicans do their thing",
                "The silence from the right speaks for itself",
                "All the best people. 🙄\n\nLike, when is it enough?",
                "Yup, sounds about right.",
                "She’s had plastic surgery and still looks like that?",
                "Crime is legal. Steal from rich people. Literally just take their shit."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Pete Hegseth had an unsecured internet line set up in his office to connect to Signal, AP sources say",
            "external_url": "https://www.ctvnews.ca/world/article/pete-hegseth-had-an-unsecured-internet-line-set-up-in-his-office-to-connect-to-signal-ap-sources-say/",
            "upvotes": 16017,
            "date": "04/25/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/4YEWSMJAY45CNMAAARZCB6XHPQ.jpg?smart=true&auth=334b1defe62b2a369ef8b3cd017a963865ba09c3918db0420f3c9cfb5b8aa9d9&width=1200&height=630",
            "top_comments": [
                "“U.S. Defense Secretary Pete Hegseth had an internet connection that bypassed the Pentagon’s security protocols set up in his office to use the Signal messaging app on a personal computer, two people familiar with the line told The Associated Press.\n\nThe existence of the unsecured internet connection is the latest revelation about Hegseth’s use of the unclassified app and raises the possibility that sensitive defense information could have been put at risk of potential hacking or surveillance.”",
                "What’s this fuckers obsession with signal?",
                "He has also been having a mental breakdown on television, he needs to be removed from his position as soon as possible. He is a danger to the safety of the United States. ",
                "So he's just trying to hide some illegal shit at this point.",
                "....which synced to his phone though Bluetooth or WiFi. \n\nThe most powerful military leader -has an open internet computer, inside his office, that synced to his phone app everytime he sat down.",
                "But, Hillary’s emails..",
                "I mean, just out of curiosity, how do you get an insecure line added in the pentagon? Did they call up and have their ISP drill a new line in? I feel like someone somewhere had to say “yah we can’t really approve this”. It’s not like he dragged a cable through the building himself.",
                "i miss having a government made of even 50% competent upper management",
                "I don’t like irony after all",
                "He drunk and on grinder.  In his office"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Detention officers arrested after retired K9 found dead",
            "external_url": "https://www.kait8.com/2025/04/24/detention-officers-arrested-after-retired-k9-found-dead/",
            "upvotes": 2067,
            "date": "04/24/2025",
            "thumbnail": "https://gray-kait-prod.gtv-cdn.com/resizer/v2/GHXBEQPYIRAMBJGXFNXBUG5NF4.jpg?auth=a092eeb0f687d1cdbabc799010f306b2b3a63dac66fb81e1b40cef0f0b00022b&width=1200&height=600&smart=true",
            "top_comments": [
                "I know we shouldn’t judge a book by its cover, but JFC. They look like two guys who would be arrested for killing a dog.",
                "Oh, poor little boy. He died in his little house. Likely the only place he felt safe. Just looking for a tiny bit of love.\n\nIf I have only one wish it's for you Bane. May you live on in the eternal meadow. Where it is always the most beautiful day.",
                "The dog staved to death lovked in a outdoor kennel with no food or water. He was dead at least a week",
                "I always wonder what happens to retired police dogs. And while they are working- are they actually shown love? If they are retired, why not keep them?",
                "Can anyone explain how if a suspect harms a K9 while they're on duty, they get charged with all the same crimes as they would if it was a human officer but when they're retired they lose all of that status? I know it wouldn't be murder charges but couldn't they charge the people with negligent homicide of a police officer so they get more harsh sentencing or does that not apply for retirees or off duty police? Just wondering",
                "It takes a real special kind of awful to mistreat animals.\n\nGonna hug my little dude a little tighter tonight because I'm thankful for every day I have with him.",
                "Between this and the post (about the scoliosis alligator) where someone mentioned a lion cub with a broken back left behind by its pack and desperately trying to crawl after them, I think I've had just about enough internet for today.",
                "They should be charged with killing an officer.  That's what any other civi who kills a police dog gets charged with.  Idc if he was retired.  ",
                "I'm not sure why the k9 handler let his son have the retired k9 officer, but I hope he has some remorse over that. Going to be you being neglected next. Poor dog. Locking up animals in small places and letting them starve to death through complete neglect has got to be some red flag for absolute fucking human garbage. Throw him in the trash.",
                ">\"According to court documents, the sheriff’s office received an anonymous tip that retired K9 Bane “was being neglected and abused” by Huffstetler.\n\n>“The tip stated **Bane was living outside with no food, water, or shade,**” Sergeant Ashten Jackson stated in the affidavit.  \n...  \n“Detectives located K9 Bane deceased in a plastic dog house inside the outdoor kennel,” Jackson stated. “K9 Bane appears to have been deceased for a substantial amount of time.”"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Exclusive: US Justice Dept grant cuts valued at $811 million, people and records say",
            "external_url": "https://www.reuters.com/world/us/us-justice-dept-grant-cuts-valued-811-million-people-familiar-say-2025-04-24/",
            "upvotes": 1301,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So Republicans just defunded police?",
                "reduced funding for police training? yeah... that'll sure end well.",
                "New training manual by trump = shoot first question later. Class dismiss!\n\nFucking stop going to malagua definitely cut spending.",
                "And all that money funneled into Musk and the oligarchs.",
                "For my people out there who don't click links:\n\n  \n*WASHINGTON, April 24 (Reuters) - The U.S. Justice Department is terminating $811 million in grants, including some impacting victim service programs ranging from trauma centers and sign language interpretation and police training, according to internal documents and two sources.The 365 competitive grants being terminated were valued at $811 million when awarded, a total reported exclusively by Reuters. These grants are typically paid out over three years, though it remains unclear how much money was left unspent at the time of the cuts.The cuts affect awards managed by the Office of Justice Programs. As a measure of scope, the office received approval to award roughly $3 billion in total competitive grants in the 2024 fiscal year.The Justice Department declined to comment.President Donald Trump's administration is engaged in a wide-ranging campaign to slash the federal government that is taking particular aim at policies he opposes, including those that promote diversity, equity and inclusion and refugee resettlement. Accounts from federal workers and experts depict the effort as chaotic at times, with agencies in some cases laying off workers that they then need to rehire.The Justice Department told Reuters on Wednesday it was discerning in how it selected which grants to cut, with Attorney General Pam Bondi saying it would \"continue to ensure that services for victims are not impacted.\"Following a Reuters report on funding cuts to a program for pet-friendly domestic violence shelters, the department restored aid for some recipients. These included one of the only Connecticut providers accepting pets across all its shelters, along with a service provider in Maryland.\"Attorney General Bondi personally extends her appreciation to the Maryland Network Against Domestic Violence for its steadfast commitment to domestic violence survivors and the professionals who support them,\" wrote Deputy Assistant Attorney General Maureen Henneberg in an email seen by Reuters that was sent on Wednesday night to the group, rescinding the termination of the grant.A review of the cuts to grant programs from the Office for Victims of Crime shows that many provided a mix of direct and indirect assistance for domestic violence and trafficking victims.*\n\n*Activating Change, a nonprofit that supports domestic violence victims with disabilities, lost five federal grants totaling more than $2 million, said Executive Director Nancy* [*Smith.One*](http://Smith.One) *of those paid for American Sign Language interpretation services for domestic violence victims, while another trains police on how to investigate trafficking crimes against people with disabilities.Another recipient that lost funding is the Central Iowa Trauma Recovery Center, which received support from Republican Senator Charles Grassley.Other canceled grants funded programs from criminal justice research, to efforts to help reduce recidivism and support people after they are finished serving prison terms.Of the $811 million in total cuts, about $71 million comes from grants offered by the Office for Victims of Crime, according to a spreadsheet of the grants seen by Reuters.DOJ cut roughly $535 million to programs from the Bureau of Justice Assistance, which funds programs to support many local police departments and correctional facilities, the data shows.The federal agency cut about $136 million from the Office of Juvenile Justice and Delinquency Prevention, and terminated nearly $59 million in research grants funded by the National Institute of Justice.*",
                "How does this make us great?",
                "Idiotcracy at its finest",
                "Honestly, if it means these gestapo 2.0 bastards breaking down dorm rooms to arrest pro Palestinian protesters without a warrant can do their job less efficiently, than I'm all for it.\n\nSadly it reads like they're cutting the few good things that are done by these departments.",
                "Remember the first 250ish years of the country when Congress controller spending?",
                "Which is a rounding error in americas budget.  Not even a billi"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Rwandan genocide leader living in exclusive New York enclave arrested for alleged immigration violations",
            "external_url": "https://abcnews.go.com/US/rwandan-genocide-leader-living-exclusive-new-york-enclave/story?id=121129509",
            "upvotes": 6955,
            "date": "04/24/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/59336e57-c4d5-4d4b-aec4-bd40aaea3d1e/doj-seal-gty-jef-250424_1745512986238_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "That's exactly the sort of visa fraud that we want the government to look into.",
                "NYT did an [article](https://www.nytimes.com/2006/05/14/nyregion/nyregionspecial2/14libee.html) on him in 2006 without knowing who he really was",
                "He’s lived here for over two decades, financed how?",
                "Finally, the Trump admin arrests someone for immigration related fraud that deserves to be arrested and deported.",
                "Why do I get the feeling this one isn’t going to El Salvador…",
                "*“As alleged, Nsabumukunzi repeatedly lied to conceal his involvement in the horrific Rwandan genocide while seeking to become a lawful permanent resident and citizen of the United States,” said United States Attorney John Durham.*\n\nHe's facing a 30 year sentence, which in no way matches his crimes.  He is not, in any normal sense of the word, an immigrant.",
                "Looks like ICE needed some good press.",
                "While I wish his ass would go to a gulag in El Salvador’s, they should deport him back to Rwanda ",
                "I am really skeptical the feds *just* found out about this after all this bad press for ICE lately. It seems like there were sooooo many opportunities to learn this over the last 20 years. I wonder if he’s been an informant or there was some other reason they let him stay. And ICE needed some story to put them back in America’s good graces and went after the guy they knew was here and decided no one would care if this guy is deported (I certainly wouldn’t, provided due process happens).",
                "I think we can all agree this is the kinda dude that deserves to get shipped back"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Man charged with arson after authorities say he sparked New Jersey Pine Barrens fire",
            "external_url": "https://apnews.com/article/new-jersey-wildfire-smoke-ny-air-quality-67b146ae19bef2cb111d7efc3d0b563d",
            "upvotes": 680,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Obviously not an interior decorator.",
                "It always amazes me that authorities are able to find people who start forest fires. Seems like it would be very hard to do.",
                "tldr: it wasn't on purpose. dude had a bon fire and didn't extinguish it all the way before leaving. Fire flared back up and started to spread through the woods.",
                "If we held people financially accountable for this stuff (when it’s accidental but preventable and causes massive damage like this) I bet people would be a lot more careful. This is clearly accidental but from idiocy. Who the heck just walks away from a bonfire? It’s one thing if it’s your little patio thing that’s well contained and dying out. It’s another when you’re burning piles of rubbish in your yard",
                "One of the issues that is missed by the news media is that this and many other ecosystems are supposed to burn regularly. I could write an essay on this, but the NJ Pine Barrens, just like the rest of the Atlantic Coast Pine Barrens, is a fire-dependent ecosystem. Plants and animals that live in this ecosystem rely on fire to maintain the habitat that they need to reproduce and thrive. Many require open habitat, like NJ's state reptile, the Bog Turtle. This species is also on the Endangered Species List and is considered Critically Endangered globally. \n\nThe issue is, like many of the other fire-dependent ecosystems in the world, people built structures in them and then repressed the fire that was integral to the ecosystem. It wasn't until the 1990s and early 2000s that we realized how important fire is for ecosystems like this. But now they have a ton of fuel for fires, and they can easily catch on fire and rapidly spread. It's technically a natural and important part of the ecosystem, it's just we don't like when structures and timber trees burn.",
                "Isn't that where the goodfellas buried the bodies back in the day?\n\nhttps://www.nytimes.com/1973/02/05/archives/mob-favors-pinelands-for-burials.html",
                "I wonder if Pauli's Russian made it out.",
                "I hope so, I’ll never get that shoe back now!",
                "Trying to smoke that Russian mob guy out. He’s still out there.",
                "He was trying to smoke out the Jersey Devil and prove that it's real once and for all. In all seriousness though, fuck that guy with a million fines and life in jail with the Jersey Devil as his cellmate. "
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "After a scathing rebuke, judge grants DOJ an extension in deportation case",
            "external_url": "https://www.npr.org/2025/04/23/nx-s1-5373746/federal-judge-blasts-trump-stonewalling-deportation-case",
            "upvotes": 2307,
            "date": "04/24/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fae%2Fda%2F3d30708646a89f452f8371e3de32%2Fgettyimages-2210399552.jpg",
            "top_comments": [
                "To be clear, the lawyers representing Abrego Garcia *also* signed off on this pause. We don't know *what* the deal is, but the Trump administration floating something that apparently offered the possibility of resolution. We'll see what ultimately happens, but I don't think this is actually *bad* news, per se.",
                "Yeah, sounds about right. Absolutely worthless.",
                ">\"Defendants have failed to respond in good faith, and their refusal to do so can only be viewed as willful and intentional noncompliance,\" Xinis wrote.\n\n>\"That ends now,\" Judge Xinis declared as she rejected the administration's arguments so far as \"specious\" and condemned their \"mischaracterization\" of the Supreme Court's directive to facilitate Abrego Garcia's return to the U.S.\n\nJudge Xinis should have clarified, \"That ends...in another week\". What a joke.",
                "Because people are reading the headline and nothing more, she gave them a week because KILMAR'S ATTORNEYS AGREED TO IT. The government's attorneys filed something under seal, Kilmar's attorney replied to it, and then both sides agreed to push back the deadline a week.",
                "A delay for what? We have Congress people going there. We have the creepy President of El Salvador coming here. We have Trump making many statements about how he refuses to comply with the Supreme Court. Do we just not care that democracy is dying? The man that our government said was mistakenly sent there, paid for by the US to be kidnapped and jailed in that country, could be back here tonight.",
                "Soooo, “That ends now” meant…what, exactly?\n\nFor fuck sake - either just let this man turn into Hitler reincarnate or don’t. But fucking pick a lane. Let me know what I’m dealing with already. These repeated facades of holding these mother fuckers to account is exhausting and deflating. What the fuck else do they need to show you? These fascists have so little regard for the law and the constitution that they would wipe their asses with Xinis’s robe if given the chance. \n\nBut sure - go ahead and give them another week after demanding that “this ends now”.  Jesus Christ…",
                "There’s a special place in hell for Trump and his enablers.",
                "DT: \"Let's just stall.\"\n\nSC: \"We don't have to make a determination and just let it float in legal limbo.\"",
                "Justice delayed is now par for the course",
                "And still nothing happens."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Feds accidentally publish secret plan to kill NYC congestion pricing",
            "external_url": "https://gothamist.com/news/feds-accidentally-publish-secret-plan-to-kill-nyc-congestion-pricing",
            "upvotes": 34939,
            "date": "04/24/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350872/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                ">The internal 11-page letter, sent from attorneys in the Southern District of New York to a lawyer for the federal transportation department, was taken down less than an hour after it was erroneously put online.\n\nUh…you can’t put the toothpaste back in the tube.",
                "States' rights, except for those we do not like, amirite?",
                "Anyone know how to be deleted from Signal group chat, I keep getting added",
                "The one good thing about this administration is they are so unbelievably incompetent.    \n\nImagine the damage they were just as sinister AND competent.",
                "I had to double take that it didn't say congressman.",
                "I knew all about this.Someone named Pete texted me about this yesterday! I don’t know how I got on that text chain but I think the poster is pretty tipsy;)",
                "Trump's whole argument is BS.  He only cares about congestion pricing because he wants to hurt a blue state.   If Trump really thinks tolling interstate highways is illegal then what about Florida, New Jersey and Texas collecting a combined $5,000,000,000 annually in \"unfair\" tolls on interstate highways that we paid to build with tax dollars?   The Pennsylvania Turnpike was built and paid for 50 years ago and they still keep collecting those tolls.",
                "Fitting for an administration that destroys everything and accomplishes nothing.",
                "Their administration is so chaotic and unorganized that they can’t keep anything a secret it seems",
                "I'd love to say this is shockingly incompetent, but it's just par for the course at this point. Thankfully their stupidity undercuts the effectiveness of their authoritarianism a bit."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Texas creates its own DOGE in attempt to make the state more business-friendly",
            "external_url": "https://www.keranews.org/texas-news/2025-04-24/texas-creates-its-own-doge-in-attempt-to-make-the-state-more-business-friendly",
            "upvotes": 7340,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What is it going to cut?  Republicans in Texas have been in charge of the budgetfor decades.",
                "Isn't Texas one of those states that's been controlled by republicans for decades? ",
                "Gross. Texas proving once again that it's a total shithole",
                "The irony of signing a bill for \"government efficiency\", while using dozens of different pens to hand off as souvenirs for your corporate masters",
                "Texas can't even keep their power grid functioning 🙄 cuts to spending should be the last thing on their mind",
                "Business friendly = human miserable",
                "Is business friendly the impression they got from this? Wow",
                "So you have a federal level DOGE and a state level DOGE? That sounds like inefficiency to me, one of them will have to go.",
                "If Texas gets any more business friendly, they will have slavery.",
                "So let's talk this thru, with beef as an example:\n \nThe state that produces more beef than anywhere else is going to cut regulations on businesses, giving free rein to bad actors.\n\nThey will also eliminate (I'm assuming) any current protections they have for immigrant workers, as they turn said workers over to ICE for deportation driving even legal workers out of the state. \n\nAt the same time, the FDA will no longer be performing quality checks, and will be understaffed to respond to incidents. \n\nAlso, the CDC and other health agencies have been effectively muzzled on what they can share with each other or the public.\n\n**In conclusion**: Texas is inviting cattle ranchers and slaughterhouse operators to build or expand, with little to no regulation. Cattle will be kept and fed less safely. Slaughterhouses and beef packaging plants will be understaffed. There will be no government oversight to ensure meat is not spoiled when packaged or stored unsafely. When inevitable outbreaks occur, recalls will be less likely. Then the FDA and the CDC cannot tell consumers about the danger if there is an outbreak, anyway. Widespread illness and death occur.  BUT, at least business owners and politicians made more money. And I become a vegetarian."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "RISING",
            "title": "Maryland judge orders return of Venezuelan asylum seeker deported to El Salvador | CNN Politics",
            "external_url": "https://www.cnn.com/2025/04/24/politics/maryland-judge-return-venezuelan-asylum-seeker/index.html",
            "upvotes": 1953,
            "date": "04/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/08-04-2025-03-16t233141z-1466303683-rc25edablquk-rtrmadp-3-usa-trump-migration-el-salvador-jpg.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Yes. Due process for every last person that we've sent. Every single human that we've deported there is protected under the constitution and the day we stop defending that is the day that we all surrender our own constitutional rights.",
                "Add it to the list of shit they'll ignore because who's gonna do anything about it?",
                "Donald Trump thinks that asylum means \"insane asylum\" and that's why he says it all the time. I really do believe this.",
                "But have we looked at his tattoos. According to our gov, tattoos are the fundamental principle of fairness.",
                "Trump: No, thanks for the suggestion though.",
                "Order schmorder, you have no power over the king.\n\nI HATE this timeline.",
                "It's easy to forget but we sent a man with no due process, who was ordered to be PROTECTED by our courts... to a death camp.\n\nThe foundations of everything are fucked if the laws don't prevail.",
                "> The Trump administration, according to the order, has argued Cristian’s deportation did not violate the settlement, asserting “his designation as an alien enemy pursuant to the AEA results in him ceasing to be a member” of the class action. The government invoked the Alien Enemies Act, an 18th-century wartime authority, on March 15 to deport alleged members of Tren de Aragua, a Venezuelan gang Trump accuses of “perpetrating an invasion of and predatory incursion into the United States.”\nA sworn declaration from Robert Cerna, the ICE acting Field Office Director for Enforcement and Removal Operations, said Cristian had been arrested in Texas in January.\n“On January 6, 2025, (‘Cristian’) was convicted in the 482nd District Court at Harris County, Texas, for the offense of possession of cocaine,” Cerna stated in the filing. Cerna added that Immigration and Customs Enforcement determined Cristian was subject to removal following the invocation of the AEA.\n\nSo he was deported to El Salvador when he was from Venezuela. Against orders of a legal settlement that gave him protection. To be placed in CECOT, but the only detailed claim against him is he had cocaine. Are we going to be arresting every college kid who does cocaine and tossing them in a US Supermax without due process? Due process must be upheld for all, or it is too easy for our government to incarcerate anyone on a whim.",
                "Well, didn't the supreme court also order the return of the one wrongfully sent to El Salvador a while ago. Does anyone really believe that will happen?\n\nThe constitution crisis is here now. When an order of the supreme court is ignored, the house of cards is going to come crashing down because the only thing holding up our constitution is the belief that it should be. There is no real power being allocated to the judicial.",
                "Can we use names. Whats this person's name?"
            ],
            "aggregate_sentiment": 50.0
        }
    ],
    "last_updated": "04/25/2025 04:11:11 UTC"
}