{
    "posts": [
        {
            "category": "HOT",
            "title": "Tesla recalls most Cybertrucks due to trim detaching from vehicle",
            "external_url": "https://www.reuters.com/business/autos-transportation/tesla-recall-over-46000-cybertrucks-nhtsa-says-2025-03-20/",
            "upvotes": 15212,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It should be noted that this vehicle had the most Elon involvement than any other Tesla. The CyberTruck was supposed to be his crowning achievement, his coup d’ grace, his ultimate vision realized 😂😂",
                "The build quality is a joke on these things. Europe was right not to let them on the road.",
                "Unhinged you might say\n\nConcerning",
                "\"Tesla accounts for a large portion of recalled vehicles in the U.S. In 2024, Tesla topped the list for U.S. recalls with its vehicles accounting for 5.1 million call-backs, according to recall management firm BizzyCar. However, most issues for the brand's cars were usually resolved with over-the-air software updates.\" (probably from this article, took it from yahoo version).\n\n  \nThey are going AAA games company route of selling bugged unfinished product and patching it up as it goes. While selling cars.",
                "“Trim?” \n\nI saw a couple of pictures of whole panels.",
                "There's a cyber truck in my town, and I was just commenting to my wife on a walk last night that it looked like it was getting more wavy and wrinkly over time.... Glue failure would do that. \n\nHysterically poorly engineered.",
                "While they're at the dealership just keep 'em and cash out the owners. Do them all a favour.",
                "Plastic molding as an inner frame? \n\nWire steering will fail next. \n\n\nThis manchild nazi is a moron. \n\nThe engineers on this tried to tell the mentally challenged \nStock market cheat to make a stable frame....apparently it cost too much. Elon was banking on the revenue as pocket cash....looks like he's a moron...\nAgain...",
                "Musk sends DOGE to tear down vehicle safety standards in 3... 2... 1...",
                "Elon's become unglued since he made Trump his bestie."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Finland is again ranked the happiest country in the world. The US falls to its lowest-ever position",
            "external_url": "https://apnews.com/article/world-happiness-report-ranking-finland-afghanistan-us-b41c1712448762d98fe9e4f80233c15f",
            "upvotes": 16123,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Finnish people have a lot of trust in their government and other public institutions, and trust in their communities in general. They provide access to strong public services like healthcare and education. Finland has a stable economy. And they value work-life balance, comfort, and well-being. It has been this way for a long time. It seems clear that other counties should follow suit",
                "Beyond the actual rankings, there's some good insights here, about what makes for a happy society:\n\n>**Researchers say that beyond health and wealth, some factors that influence happiness sound deceptively simple: sharing meals with others, having somebody to count on for social support, and household size**. In Mexico and Europe, for example, a household size of four to five people predicts the highest levels of happiness, the study said.\n\n>**Believing in the kindness of others is also much more closely tied to happiness than previously thought**, according to the latest findings.\n\n>As an example, the report suggests that **people who believe that others are willing to return their lost wallet is a strong predictor of the overall happiness of a population**.\n\n>Nordic nations rank among the top places for expected and actual return of lost wallets, the study found.\n\n>Overall, researchers said **global evidence on the perceived and actual return of lost wallets shows that people are much too pessimistic about the kindness of their communities compared to reality** — actual rates of wallet return are around twice as high as people expect.\n\n>...\n\n>Experts in economics, psychology, sociology and beyond then seek to explain the variations across countries and over time using factors such as **GDP per capita, healthy life expectancy, having someone to count on, a sense of freedom, generosity and perceptions of corruption**.\n\nIt's a good reminder that a sense of community, personal relationships, and social solidarity add real value to people's lives.\n\nI think that sometimes gets missed, when changes in society are evaluated almost solely by their implications for economics and efficiency.  Those are important too, but they're not everything.",
                "Frankly, the end of the article scares me more than the ranking itself:\n\n\n>In a concerning development, the study said 19% of young adults across the world reported in 2023 that they have no one they could count on for social support. That is a 39% increase compared to 2006.\n\n\nWe already have one generation of people who are effectively islands unto themselves. The fact that the next generation is already starting off alone isn't going to bode well.\n\n\nAlso, Mexico being in #10 despite some of the horiffic things that happen there should raise some alarm bells on how the United States functions as a society. If you're less happy than the country below you that has active cartels with clandestine body disposal facilities, then you have a problem.",
                "Finland Finland finlaaaaaand. That is the country for me",
                "Position  24.  Saved you a click",
                "As a born Finnish (around middle-age) this seems weird because I don't think we're \"happy\" as the word suggests. I think we are \"content\". We got everything quite stable, it's safe, quiet and not a ton of people everywhere. We got nature everywhere, we got our little houses and apartment buildings and we got hobbies.\n\nLavishing life-style, kitted out mansions and supercars have never been hip here. \n\nSure sometimes it's boring as hell, but it's stable and you don't have to fear dropping onto nothing if shit gets difficult/you get sick (unless you purposefully fuck up time after time).",
                "I was told we were going to be great.",
                "The Netherlands no. 5; it's always Scandinavian countries and The Netherlands in the top 10. I wonder why.",
                "Finland: Universal healthcare, work-life balance, and trust in government.   \nThe US: Unlimited breadsticks if you ask nicely.",
                "Direct Link to the report: https://worldhappiness.report/ed/2025/"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Lawmaker convicted of child sex crime had history of exploiting vulnerable boys, prosecutor alleges",
            "external_url": "https://www.kvrr.com/2025/03/20/lawmaker-convicted-of-child-sex-crime-had-history-of-exploiting-vulnerable-boys-prosecutor-alleges/",
            "upvotes": 1817,
            "date": "03/20/2025",
            "thumbnail": "https://www.kvrr.com/content/uploads/2024/08/g/s/holmberg-ray-080824.png",
            "top_comments": [
                "Republican anti-abortion activist Howard Scott Heldreth is a convicted child rapist in Florida.\n\nRepublican County Commissioner David Swartz pleaded guilty to molesting two girls under the age of 11 and was sentenced to 8 years in prison.\n\nRepublican judge Mark Pazuhanich pleaded no contest to fondling a 10-year old girl and was sentenced to 10 years probation.\n\nRepublican anti-abortion activist Nicholas Morency pleaded guilty to possessing child pornography on his computer and offering a bounty to anybody who murders an abortion doctor.\n\nRepublican legislator Edison Misla Aldarondo was sentenced to 10 years in prison for raping his daughter between the ages of 9 and 17.\n\nRepublican Mayor Philip Giordano is serving a 37-year sentence in federal prison for sexually abusing 8- and 10-year old girls.\n\nRepublican campaign consultant Tom Shortridge was sentenced to three years probation for taking nude photographs of a 15-year old girl.\n\nRepublican racist pedophile and United States Senator Strom Thurmond had sex with a 15-year old black girl which produced a child.\n\nRepublican pastor Mike Hintz, whom George W. Bush commended during the 2004 presidential campaign, surrendered to police after admitting to a sexual affair with a female juvenile.\n\nRepublican legislator Peter Dibble pleaded no contest to having an inappropriate relationship with a 13-year-old girl.\n\nRepublican activist Lawrence E. King, Jr. organized child sex parties at the White House during the 1980s.\n\nRepublican lobbyist Craig J. Spence organized child sex parties at the White House during the 1980s.\n\nRepublican Congressman Donald “Buz” Lukens was found guilty of having sex with a female minor and sentenced to one month in jail.\n\nRepublican fundraiser Richard A. Delgaudio was found guilty of child porn charges and paying two teenage girls to pose for sexual photos.\n\nRepublican activist Mark A. Grethen convicted on six counts of sex crimes involving children.\n\nRepublican activist Randal David Ankeney pleaded guilty to attempted sexual assault on a child.\n\nRepublican Congressman Dan Crane had sex with a female minor working as a congressional page.\n\nRepublican activist and Christian Coalition leader Beverly Russell admitted to an incestuous relationship with his step daughter.\n\nRepublican congressman and anti-gay activist Robert Bauman was charged with having sex with a 16-year-old boy he picked up at a gay bar.\n\nRepublican Committee Chairman Jeffrey Patti was arrested for distributing a video clip of a 5-year-old girl being raped.\n\nRepublican activist Marty Glickman (a.k.a. “Republican Marty”), was taken into custody by Florida police on four counts of unlawful sexual activity with an underage girl and one count of delivering the drug LSD.\n\nRepublican legislative aide Howard L. Brooks was charged with molesting a 12-year old boy and possession of child pornography.\n\nRepublican Senate candidate John Hathaway was accused of having sex with his 12-year old baby sitter and withdrew his candidacy after the allegations were reported in the media.\n\nRepublican preacher Stephen White, who demanded a return to traditional values, was sentenced to jail after offering $20 to a 14-year-old boy for permission to perform oral sex on him.\n\nRepublican talk show host Jon Matthews pleaded guilty to exposing his genitals to an 11 year old girl.\n\nRepublican anti-gay activist Earl “Butch” Kimmerling was sentenced to 40 years in prison for molesting an 8-year old girl after he attempted to stop a gay couple from adopting her.\n\nRepublican Party leader Paul Ingram pleaded guilty to six counts of raping his daughters and served 14 years in federal prison.\n\nRepublican election board official Kevin Coan was sentenced to two years probation for soliciting sex over the internet from a 14-year old girl.\n\nRepublican politician Andrew Buhr was charged with two counts of first degree sodomy with a 13-year old boy.\n\nRepublican politician Keith Westmoreland was arrested on seven felony counts of lewd and lascivious exhibition to girls under the age of 16 (i.e. exposing himself to children).\n\nRepublican anti-abortion activist John Allen Burt was charged with sexual misconduct involving a 15-year old girl.\n\nRepublican County Councilman Keola Childs pleaded guilty to molesting a male child.\n\nRepublican activist John Butler was charged with criminal sexual assault on a teenage girl.\n\nRepublican candidate Richard Gardner admitted to molesting his two daughters.\n\nRepublican Councilman and former Marine Jack W. Gardner was convicted of molesting a 13-year old girl.\n\nRepublican County Commissioner Merrill Robert Barter pleaded guilty to unlawful sexual contact and assault on a teenage boy.\n\nRepublican City Councilman Fred C. Smeltzer, Jr. pleaded no contest to raping a 15 year-old girl and served 6-months in prison.\n\nRepublican activist Parker J. Bena pleaded guilty to possession of child pornography on his home computer and was sentenced to 30 months in federal prison and fined $18,000.\n\nRepublican parole board officer and former Colorado state representative, Larry Jack Schwarz, was fired after child pornography was found in his possession.\n\nRepublican strategist and Citadel Military College graduate Robin Vanderwall was convicted in Virginia on five counts of soliciting sex from boys and girls over the internet.\n\nRepublican city councilman Mark Harris, who is described as a “good military man” and “church goer,” was convicted of repeatedly having sex with an 11-year-old girl and sentenced to 12 years in prison.\n\nRepublican businessman Jon Grunseth withdrew his candidacy for Minnesota governor after allegations surfaced that he went swimming in the nude with four underage girls, including his daughter.\n\nRepublican director of the “Young Republican Federation” Nicholas Elizondo molested his 6-year old daughter and was sentenced to six years in prison.\n\nRepublican benefactor of conservative Christian groups, Richard A. Dasen Sr., was charged with rape for allegedly paying a 15-year old girl for sex. Dasen, 62, who is married with grown children and several grandchildren, has allegedly told police that over the past decade he paid more than $1 million to have sex with a large number of young women\n\nDennis Hastert served as Republican Speaker of the House (so, 3rd in line for the Presidency) for all 8 years of W. Bush’s two terms. He also sexually molested at least 5 boys when he was a HS wrestling coach, all of them underage with the youngest victim being 14. The victims only finally saw justice when Hastert was caught by the FBI trying to falsify payments for hush money.\n\nDonald Trump walked into Miss Teen USA change rooms with girls as young as 14 changing. 26 women have spoken publicly about Trump’s pattern of sexual assualt. In 2023, he was found legally liable for the rape of E. Jean Carroll by unanimous jury\n\nAnton “Tony” Lazzaro, a former Republican donor and political strategist from Minnesota, was convicted in March 2023 on federal charges of sex trafficking minors. He was found guilty of conspiring to recruit and pay teenage girls, aged 15 and 16, for sex between May and December 2020. In August 2023, Lazzaro was sentenced to 21 years in prison for these offenses.\n\nPrior to his arrest, Lazzaro was a prominent figure in Minnesota Republican circles, donating over $270,000 to various Republican campaigns and political committees. His indictment led to significant turmoil within the Minnesota Republican Party, culminating in the resignation of then-party chair Jennifer",
                "> Holmberg, 81, a Republican from Grand Forks, served in the North Dakota Legislature for 45 years, resigning in 2022.\nHe was linked to the investigation of Nicholas Morgan-Derosier of Grand Forks, who, in May, was sentenced to 40 years in prison on child pornography charges.\nDuring a plea hearing, Holmberg maintained he broke no laws in the Czech Republic, referring to the age of sexual consent in that country. He said he liked getting massages and they sometimes included sexual contact.\n\nThis man seriously tried to argue that he had sex with children, but he shouldn't be charged because he did it in a country with a lower age of consent? That's when you know someone is an absolutely sick pos. Zero shame for his actions, just hating that he's been caught.",
                "On brand and not surprising",
                "r/StillNotADragQueen\n\nshould just be renamed\n\nr/YepAnotherRepublicanChildMolester",
                "Republicans are trying to normalize pedophilia",
                "I read it all, yep it was a republican. Why can’t they just go pick lady bugs off Lyndsey graham and leave the teenage boys alone. ",
                "It’s always *exactly* who you’d suspect, and STILL not a drag queen.",
                "Title correction: \"**Republican** lawmaker convicted of child sex crime had history of exploiting vulnerable boys, prosecutor alleges\"",
                "as per usual, not a drag queen or a trans person, just your garden variety predator, an old white republican man. i'll just assume he's also the american variety of \"christian\".",
                "Trump has all the best Child Porn Addicts.  Only the best for him and his government."
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "HOT",
            "title": "‘Don’t call it zombie deer disease’: scientists warn of ‘global crisis’ as infections spread across the US",
            "external_url": "https://www.theguardian.com/environment/2025/mar/20/chronic-wasting-disease-spread-zombie-deer-global-us-aoe",
            "upvotes": 1014,
            "date": "03/20/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/cfd667d2f38456d67610e38b7ae3b796533e5195/510_466_2304_1382/master/2304.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5be82800bc08bf2ee01c20875ed46949",
            "top_comments": [
                "Prion diseases are terrifying.",
                "When the best case scenario is making it harder to find deer and elk to hunt and the worst case is a cross infection that leads to a human disaster that might be unprecedented, its terrifying to think of these warnings coming during a time when our national leadership has a track record of ignoring potential disease disaster and then mismanaging response to lead to nearly a million deaths.",
                "RFK just needs for this to keep going so he can find an immune deer.",
                "US: No. \n\n*Fires scientists* \n\nCNN headline: \"Zombie Deer Disease runs rampant amongst deer.\" \n\nFOX headline: \"Biden responsible for mysterious deaths.\"",
                "My shitty representative, Pat Curry of Texas-56, just submitted a bill in Texas to dismantle the Texas Parks and Wildlife Department which houses the Game Wardens of the state. He spews out the typical republican word bullshit about waste and taking their budget and resources and putting them to better use.\n\nBut in reality, the Wardens and another regulatory body under the TPWD made a pretty big bust on some deer breeders in the state last year. The info on arrests has been withheld for bullshit reasons but Pat Curry let the cat out of the bag when he emailed a response to a constituent telling him to withdraw the bill. He specifically mentions Deer Breeding as a reason why he submitted the bill.\n\nSo either he has an breeding operation that was dinged from the recent bust or family/friend/donor runs a breeding operation and they cried to their politician friend to remove even more regulations.\n\nRemember, always follow the money.",
                "\"symptoms include ... a lack of fear of people\"\n\ndid not have deerpocalypse on my 2025 bingo card",
                "Call it what it is. CWD chronic wasting disease",
                "Great timing to withdraw from the WHO and gut science and environment surveillance",
                "Zombie Deer Disease can be cured with bleach up the bumhole.",
                "Using alarmist language to describe a disease like this is good actually."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "HOT",
            "title": "French Scientist Reportedly Denied U.S. Entry Due to Trump Criticism",
            "external_url": "https://newrepublic.com/post/192946/french-scientist-denied-us-entry-trump-criticism",
            "upvotes": 33204,
            "date": "03/19/2025",
            "thumbnail": "https://images.newrepublic.com/df32fc6dfc42d5dcddd8933438d7a9a07f5c533f.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
            "top_comments": [
                "Horrifying\n\n>The French newspaper Le Monde reports that on March 9, a space researcher was randomly selected upon arrival in Houston for a search, and CBP found messages criticizing the Trump administration’s treatment of scientists, which, according to the agency, “conveyed hatred of Trump & could be qualified as terrorism.”\n\nI guess around half of america are  terrorists now, according to whoever said that.",
                "So much for freedom of speech.",
                "Good thing he got to back to France and not deported to a concentration camp.",
                "Places people don’t want to go because they’re afraid of being jailed or deported for no reason:\n\n- Russia\n- North Korea\n- Iran\n- USA\n\nCongrats. Too much freedom I guess. ",
                "What a complete shit show.",
                "”hatred of Trump & could be qualified as terrorism”. So I guess no one is going to be let into the USA anymore?",
                "Anyone that thinks this person is just gonna go willingly after his term is up has another thing coming.",
                "I’ve never seen a country shoot itself in the foot to this degree in such a short span of time. Good luck attracting anyone other than MAGA style idiots at this point.",
                "USA is now just a fat North Korea",
                "Yamtits is the biggest man baby in the world with Elon a close second. It's amazing to me that bloated sack of monkey crap is actually president."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "'Out of control' Tesla ploughs into pedestrians on busy London street injuring seven",
            "external_url": "https://www.lbc.co.uk/crime/tesla-crowd-london-stepney-green-east-end/",
            "upvotes": 12575,
            "date": "03/19/2025",
            "thumbnail": "https://images.lbc.co.uk/images/711463?width=692&crop=16_9&signature=2K0o7cbWGdo3vMUBKWoPQ0n4Qm0=",
            "top_comments": [
                "They're sick of being burned , they are revolting!",
                "Out of the way, citizen. Cities are for autonomous vehicles to drive through.",
                "Musk is going to claim this Tesla was hacked by Ukraine.",
                "Tessler. It's all computer.",
                "Oh oh they’re fighting back",
                "I do think its hilarious that Trump has ordered Musk and Boeing to hastily build him 2 new airforce ones. Teslas are garbage and Boeing is killing whistle-blowers on how faulty their shit is.",
                "This will make the stock price go up somehow.",
                "So is this Counter Terrorism? Donald?",
                "Maybe the Tesla felt threatened",
                "Lidar is an hoax said the \"genius\"!"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Five years after Breonna Taylor’s killing, police reform in Louisville still incomplete",
            "external_url": "https://www.lpm.org/news/2025-03-13/five-years-after-breonna-taylors-killing-police-reform-in-louisville-still-incomplete",
            "upvotes": 578,
            "date": "03/20/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/833b2e0/2147483647/strip/true/crop/3840x2016+0+272/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9e%2F02%2F63eab85349a78908e1668922e81f%2Fimg-0554.jpg",
            "top_comments": [
                "They’re too busy harassing homeless pregnant women. 🙄",
                "What else is there to do besides kill civilians? You're gonna make their job so boring.",
                "I am so shocked by this…..",
                "People will just start reforming them manually if nothing happens.",
                "No one needs police.  Just let people do what they want."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Georgetown professor detained by federal immigration officials &#x2d; WTOP News",
            "external_url": "https://wtop.com/dc/2025/03/georgetown-u-professor-detained-by-federal-immigration-officials-lawsuit-says/",
            "upvotes": 617,
            "date": "03/20/2025",
            "thumbnail": "https://wtop.com/wp-content/uploads/2022/01/GettyImages-1236982823-scaled-e1643594830754.jpg",
            "top_comments": [
                "People are going to say this is justified because of an alleged tie of him promoting Hamas propaganda but if true, how can you support the gov response? It’s like if I jaywalked, the gov can then send masked goons, whisk me at night, and disappear me to another location because I technically did something wrong or perceived as wrong. Also, the next move for the gov here is to then focus on Americans that are born here and stifle their free speech which we see happening on college campuses.",
                "Freedom of speech only exist if you say things they agree with. Pretty soon you could be in trouble for supporting Canada, transgender etc.",
                "The US has gone full Nazi.",
                "It's getting scarier by the day, don't let yourself think anybody is immune or off limits..",
                "From article:\n\n“But there’s another wrinkle here, which is that his wife, who is a U.S. citizen, appears to be the daughter of someone who served as a senior political adviser to the Hamas leadership. It’s not clear at the moment if he’s still in that capacity or served in that capacity in the past.\n\nSo there’s at least a semi-indirect family connection. We’ve seen a statement from DHS that alleges that Suri has “close connections to a known or suspected terrorist who is a senior adviser to Hamas.” And I think that is referring to his father-in-law. ”\n\nLooks like it could be more than freedom of speech. Also if his wife is US citizen he should be able to get a green card.",
                "> Tricia McLaughlin, a spokesperson for the Department of Homeland Security, said in a post on X that Suri was “actively spreading Hamas propaganda and promoting antisemitism on social media.”\n\nIANAL so someone please correct me if this is wrong, but isn’t this protected speech under the first amendment?",
                "Fuck your shithole country",
                ">Suri was “actively spreading Hamas propaganda and promoting antisemitism on social media.”\n\n\nFair process and trial.\n\n\nAmerica gotta extirpate these terrorist advocates and racists."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Trump fires both Democratic commissioners at FTC",
            "external_url": "https://www.reuters.com/world/us/trump-fires-both-democratic-commissioners-ftc-sources-say-2025-03-18/",
            "upvotes": 18981,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So Biden was for some reason unable to fire FTC chairs but all of a sudden Trump is able to. Interesting.",
                "Everyday is another outrage. Another law violated. And Congress just sits there like meek little sheepdogs. At this point, they all need to go",
                "Trump *illegally* fires both Democratic commissioners at FTC. \n\nFucking complicit media.",
                "If it's removing fraud and corruption and waste why is it only democrats?",
                "He said he’d only be a dictator on day one, wait, did Big Mac lie to us? ",
                "Dictator just doing dictator things, nothing to be alarmed of",
                "what's the consequence if we just ignore him the way he ignores the law? they could say \"oh no im still employed here, he has not fired me because he cannot fire me\" and what would be the functional difference?",
                "\"Illegally gutting the Commission will empower fraudsters and monopolists, and consumers will pay the price,\"\n\nWell we can see his motivation, Mr Mango \"The grift\" Mussolini.",
                "Why are thy listening to Trump? If he isn’t legally able to fire them, why not force him to take it to SCOTUS and stay at their post?",
                "Trump considers every Democrat an enemy and that's why so many families don't talk anymore."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "USDA cancels $1 billion in funding for schools and food banks slated for local farmers, ranchers and producers",
            "external_url": "http://www.cbsnews.com/news/usda-cancels-local-food-purchasing-food-banks-school-meals/",
            "upvotes": 7514,
            "date": "03/19/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/06/13/292c1ec7-31fc-447f-b459-5881c78671b3/thumbnail/1200x630/c42b2f227f9eb0f3da4219bb77f49fee/gettyimages-1243012161.jpg?v=765ef194a4bf4701e45ec9d5712af42f",
            "top_comments": [
                "I’m sure this will help the country.",
                "So we're ~~dropping~~  giving10 billion to farmers for assistance, but dropping money that helps farmers feed our children? What the fuck.\n\n[https://www.usda.gov/about-usda/news/press-releases/2025/03/18/usda-expediting-10-billion-direct-economic-assistance-agricultural-producers](https://www.usda.gov/about-usda/news/press-releases/2025/03/18/usda-expediting-10-billion-direct-economic-assistance-agricultural-producers)",
                "> \"Unlike the Biden Administration, which funneled billions in [Commodity Credit Corporation] funds into short-term programs with no plan for longevity, USDA is prioritizing stable, proven solutions that deliver lasting impact,\"\n\nThe Biden admin actually implemented plans to help the American people.\n\nThe Trump admin either destroys these programs with no alternative plan to action, or a plan to divert funds to personally enrich themselves and their wealthy friends.\n\nNot loudly broadcasting the accomplishments of the Biden admin is one of many misteps the Dems made, because the more programs the Trump admin destroys, the more clear it becomes just how much good Biden actually did.",
                "The Republican party hate the American people and get off by harming us.",
                "Trump voters just keep on winning.",
                "So, tariffs are supposed to encourage domestic production, but he's also slashing everything that actually makes domestic production possible.\n\nWe're going to envy the generation that lived thru the Great Depression because of this imbecile.",
                "If only they would’ve released a manual explaining step by step what their plan was. At least give folk a heads up ya’ know.",
                "Depriving food from children. That is America becoming great again",
                "Thats Donnie, Making America great. Those farmers, yeah they dont matter. Hope the Farmers knew better than to vote for that asshole.",
                "Why is school lunch not a thing? Does the government hate our kids that much?"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "‘Don’t call it zombie deer disease’: scientists warn of ‘global crisis’ as infections spread across the US",
            "external_url": "https://www.theguardian.com/environment/2025/mar/20/chronic-wasting-disease-spread-zombie-deer-global-us-aoe",
            "upvotes": 1015,
            "date": "03/20/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/cfd667d2f38456d67610e38b7ae3b796533e5195/510_466_2304_1382/master/2304.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5be82800bc08bf2ee01c20875ed46949",
            "top_comments": [
                "Prion diseases are terrifying.",
                "When the best case scenario is making it harder to find deer and elk to hunt and the worst case is a cross infection that leads to a human disaster that might be unprecedented, its terrifying to think of these warnings coming during a time when our national leadership has a track record of ignoring potential disease disaster and then mismanaging response to lead to nearly a million deaths.",
                "RFK just needs for this to keep going so he can find an immune deer.",
                "US: No. \n\n*Fires scientists* \n\nCNN headline: \"Zombie Deer Disease runs rampant amongst deer.\" \n\nFOX headline: \"Biden responsible for mysterious deaths.\"",
                "My shitty representative, Pat Curry of Texas-56, just submitted a bill in Texas to dismantle the Texas Parks and Wildlife Department which houses the Game Wardens of the state. He spews out the typical republican word bullshit about waste and taking their budget and resources and putting them to better use.\n\nBut in reality, the Wardens and another regulatory body under the TPWD made a pretty big bust on some deer breeders in the state last year. The info on arrests has been withheld for bullshit reasons but Pat Curry let the cat out of the bag when he emailed a response to a constituent telling him to withdraw the bill. He specifically mentions Deer Breeding as a reason why he submitted the bill.\n\nSo either he has an breeding operation that was dinged from the recent bust or family/friend/donor runs a breeding operation and they cried to their politician friend to remove even more regulations.\n\nRemember, always follow the money.",
                "\"symptoms include ... a lack of fear of people\"\n\ndid not have deerpocalypse on my 2025 bingo card",
                "Call it what it is. CWD chronic wasting disease",
                "Great timing to withdraw from the WHO and gut science and environment surveillance",
                "Zombie Deer Disease can be cured with bleach up the bumhole.",
                "Using alarmist language to describe a disease like this is good actually."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "NEW",
            "title": "Jury awards $6 million to widow of Laguna Woods blind man killed by OC sheriff deputies",
            "external_url": "https://www.cbsnews.com/losangeles/news/jury-awards-6-million-to-widow-of-laguna-woods-man-killed-by-oc-sheriff-deputies/",
            "upvotes": 171,
            "date": "03/20/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/19/f63be757-ef30-4219-b270-c20ce119256a/thumbnail/1200x630/6b5ec1034866d29146378ee45df6e7ea/screenshot-2025-03-19-133705.png?v=765ef194a4bf4701e45ec9d5712af42f",
            "top_comments": [
                "Sherrif deputies in Orange County believed a visually impaired man with a white and red cane and dark glasses was pretending to be blind.",
                "Don't worry I am sure the officers will be fine and can shoot more unarmed people shortly. /s",
                "In Arvada Colorado the cops are so corrupt they run their own mafia. \n\nKckpd got caught trafficking underage girls, but they were headed for Colorado and Colorado didn’t get caught",
                "And Starbucks gave the guy whose nuts allegedly got disfigured from hot tea a whopping $30 million.. must’ve been forever traumatizing to have your partner shot dead in front of you like that",
                "Can we get a national *Do Not Hire* list for shitty and dumb cops already? I don’t like the fact some shitty cop from San Antonio who fed a homeless man an actual shit sandwich can move to a small town closer to me and still wear a badge.",
                "Blind and bipolar sounds so difficult. Just lashing out in darkness."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Greenpeace ordered to pay more than $660 million over Dakota Access Pipeline protests",
            "external_url": "https://www.cnbc.com/2025/03/20/greenpeace-ordered-to-pay-660-million-over-dakota-access-protests.html",
            "upvotes": 24,
            "date": "03/20/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118758-1742441547972-gettyimages-2179624409-HL_EBIYICK_2553172.jpeg?v=1742443355&w=1920&h=1080",
            "top_comments": [
                "Just dissolve the company and open a new one called Greenpiece, if scummy corporations can do it so can the ones fighting scummy corporations."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Exclusive: US suspends some efforts to counter Russian sabotage as Trump moves closer to Putin",
            "external_url": "https://www.reuters.com/world/us-suspends-some-efforts-counter-russian-sabotage-trump-moves-closer-putin-2025-03-19/",
            "upvotes": 96,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "SEC drops case against crypto firm with ties to Trump, CEO says",
            "external_url": "https://abcnews.go.com/US/sec-drops-case-crypto-firm-ties-trump-ceo/story?id=119963257",
            "upvotes": 433,
            "date": "03/20/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/88d6eb42-3a82-4195-9843-94d0552a8534/Garlinghouse-gty-er-250319_1742416559959_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "It’s all for sale now. It doesn’t matter what you do, just whether you can buy your way out of it from the Trump administration.",
                "Wow, must be a coincidence? Right?",
                "Blatant corruption. What a sad state they’re turning this country into.",
                "“Nothing to see here, move along.”  SEC",
                "Biff is king and corruption runs rampant in this timeline.",
                "Open corruption in every nook and cranny.",
                " Thank god. It only took 4 years..",
                "To be fair they also have ties to Kamala Harris but she lost so no one cares."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Elon Musk's X sues India over 'unlawful' censorship via Sahyog Portal and IT Act",
            "external_url": "https://desifounder.com/d/News/comments/76/Elon_Musks_X_sues_India_over_unlawful_censorship_via_Sahyog",
            "upvotes": 301,
            "date": "03/20/2025",
            "thumbnail": "https://i.desifounder.com/desifounder-default.png",
            "top_comments": [
                "Going from being known as the \"richest man in the world\" to being the \"most hated man in the world\" must be an experience.",
                "Is it unlawful in india tho? I have a feeling that once again he thinks that american laws apply even when operating abroad...",
                "Meanwhile Musk has no problem with his own censorship or censorship in China, Russia, Saudi Arabia, and countless other countries.",
                "He will throw his toys out of the pram and try to get Trump to tariff them.",
                "im just gonna assume this is some far right shit in india.",
                "Wonder how Musk feels about government following laws. Perhaps India is borrowing from the Trump playbook where laws are more of a guideline than actual rules or laws.",
                "So what I'm reading is Trump is going to put Tariffs on India soon?",
                "Didn’t he already fuck with the Indian government a few years back censoring the main dudes rivals?",
                "Good luck suing India",
                "Tariffs against India incoming in 3..2.."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Five years after Breonna Taylor’s killing, police reform in Louisville still incomplete",
            "external_url": "https://www.lpm.org/news/2025-03-13/five-years-after-breonna-taylors-killing-police-reform-in-louisville-still-incomplete",
            "upvotes": 579,
            "date": "03/20/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/833b2e0/2147483647/strip/true/crop/3840x2016+0+272/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9e%2F02%2F63eab85349a78908e1668922e81f%2Fimg-0554.jpg",
            "top_comments": [
                "They’re too busy harassing homeless pregnant women. 🙄",
                "What else is there to do besides kill civilians? You're gonna make their job so boring.",
                "I am so shocked by this…..",
                "People will just start reforming them manually if nothing happens.",
                "No one needs police.  Just let people do what they want."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Tesla recalls most Cybertrucks due to trim detaching from vehicle",
            "external_url": "https://www.reuters.com/business/autos-transportation/tesla-recall-over-46000-cybertrucks-nhtsa-says-2025-03-20/",
            "upvotes": 15211,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It should be noted that this vehicle had the most Elon involvement than any other Tesla. The CyberTruck was supposed to be his crowning achievement, his coup d’ grace, his ultimate vision realized 😂😂",
                "The build quality is a joke on these things. Europe was right not to let them on the road.",
                "Unhinged you might say\n\nConcerning",
                "\"Tesla accounts for a large portion of recalled vehicles in the U.S. In 2024, Tesla topped the list for U.S. recalls with its vehicles accounting for 5.1 million call-backs, according to recall management firm BizzyCar. However, most issues for the brand's cars were usually resolved with over-the-air software updates.\" (probably from this article, took it from yahoo version).\n\n  \nThey are going AAA games company route of selling bugged unfinished product and patching it up as it goes. While selling cars.",
                "“Trim?” \n\nI saw a couple of pictures of whole panels.",
                "There's a cyber truck in my town, and I was just commenting to my wife on a walk last night that it looked like it was getting more wavy and wrinkly over time.... Glue failure would do that. \n\nHysterically poorly engineered.",
                "While they're at the dealership just keep 'em and cash out the owners. Do them all a favour.",
                "Plastic molding as an inner frame? \n\nWire steering will fail next. \n\n\nThis manchild nazi is a moron. \n\nThe engineers on this tried to tell the mentally challenged \nStock market cheat to make a stable frame....apparently it cost too much. Elon was banking on the revenue as pocket cash....looks like he's a moron...\nAgain...",
                "Musk sends DOGE to tear down vehicle safety standards in 3... 2... 1...",
                "Elon's become unglued since he made Trump his bestie."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Lawmaker convicted of child sex crime had history of exploiting vulnerable boys, prosecutor alleges",
            "external_url": "https://www.kvrr.com/2025/03/20/lawmaker-convicted-of-child-sex-crime-had-history-of-exploiting-vulnerable-boys-prosecutor-alleges/",
            "upvotes": 1809,
            "date": "03/20/2025",
            "thumbnail": "https://www.kvrr.com/content/uploads/2024/08/g/s/holmberg-ray-080824.png",
            "top_comments": [
                "Republican anti-abortion activist Howard Scott Heldreth is a convicted child rapist in Florida.\n\nRepublican County Commissioner David Swartz pleaded guilty to molesting two girls under the age of 11 and was sentenced to 8 years in prison.\n\nRepublican judge Mark Pazuhanich pleaded no contest to fondling a 10-year old girl and was sentenced to 10 years probation.\n\nRepublican anti-abortion activist Nicholas Morency pleaded guilty to possessing child pornography on his computer and offering a bounty to anybody who murders an abortion doctor.\n\nRepublican legislator Edison Misla Aldarondo was sentenced to 10 years in prison for raping his daughter between the ages of 9 and 17.\n\nRepublican Mayor Philip Giordano is serving a 37-year sentence in federal prison for sexually abusing 8- and 10-year old girls.\n\nRepublican campaign consultant Tom Shortridge was sentenced to three years probation for taking nude photographs of a 15-year old girl.\n\nRepublican racist pedophile and United States Senator Strom Thurmond had sex with a 15-year old black girl which produced a child.\n\nRepublican pastor Mike Hintz, whom George W. Bush commended during the 2004 presidential campaign, surrendered to police after admitting to a sexual affair with a female juvenile.\n\nRepublican legislator Peter Dibble pleaded no contest to having an inappropriate relationship with a 13-year-old girl.\n\nRepublican activist Lawrence E. King, Jr. organized child sex parties at the White House during the 1980s.\n\nRepublican lobbyist Craig J. Spence organized child sex parties at the White House during the 1980s.\n\nRepublican Congressman Donald “Buz” Lukens was found guilty of having sex with a female minor and sentenced to one month in jail.\n\nRepublican fundraiser Richard A. Delgaudio was found guilty of child porn charges and paying two teenage girls to pose for sexual photos.\n\nRepublican activist Mark A. Grethen convicted on six counts of sex crimes involving children.\n\nRepublican activist Randal David Ankeney pleaded guilty to attempted sexual assault on a child.\n\nRepublican Congressman Dan Crane had sex with a female minor working as a congressional page.\n\nRepublican activist and Christian Coalition leader Beverly Russell admitted to an incestuous relationship with his step daughter.\n\nRepublican congressman and anti-gay activist Robert Bauman was charged with having sex with a 16-year-old boy he picked up at a gay bar.\n\nRepublican Committee Chairman Jeffrey Patti was arrested for distributing a video clip of a 5-year-old girl being raped.\n\nRepublican activist Marty Glickman (a.k.a. “Republican Marty”), was taken into custody by Florida police on four counts of unlawful sexual activity with an underage girl and one count of delivering the drug LSD.\n\nRepublican legislative aide Howard L. Brooks was charged with molesting a 12-year old boy and possession of child pornography.\n\nRepublican Senate candidate John Hathaway was accused of having sex with his 12-year old baby sitter and withdrew his candidacy after the allegations were reported in the media.\n\nRepublican preacher Stephen White, who demanded a return to traditional values, was sentenced to jail after offering $20 to a 14-year-old boy for permission to perform oral sex on him.\n\nRepublican talk show host Jon Matthews pleaded guilty to exposing his genitals to an 11 year old girl.\n\nRepublican anti-gay activist Earl “Butch” Kimmerling was sentenced to 40 years in prison for molesting an 8-year old girl after he attempted to stop a gay couple from adopting her.\n\nRepublican Party leader Paul Ingram pleaded guilty to six counts of raping his daughters and served 14 years in federal prison.\n\nRepublican election board official Kevin Coan was sentenced to two years probation for soliciting sex over the internet from a 14-year old girl.\n\nRepublican politician Andrew Buhr was charged with two counts of first degree sodomy with a 13-year old boy.\n\nRepublican politician Keith Westmoreland was arrested on seven felony counts of lewd and lascivious exhibition to girls under the age of 16 (i.e. exposing himself to children).\n\nRepublican anti-abortion activist John Allen Burt was charged with sexual misconduct involving a 15-year old girl.\n\nRepublican County Councilman Keola Childs pleaded guilty to molesting a male child.\n\nRepublican activist John Butler was charged with criminal sexual assault on a teenage girl.\n\nRepublican candidate Richard Gardner admitted to molesting his two daughters.\n\nRepublican Councilman and former Marine Jack W. Gardner was convicted of molesting a 13-year old girl.\n\nRepublican County Commissioner Merrill Robert Barter pleaded guilty to unlawful sexual contact and assault on a teenage boy.\n\nRepublican City Councilman Fred C. Smeltzer, Jr. pleaded no contest to raping a 15 year-old girl and served 6-months in prison.\n\nRepublican activist Parker J. Bena pleaded guilty to possession of child pornography on his home computer and was sentenced to 30 months in federal prison and fined $18,000.\n\nRepublican parole board officer and former Colorado state representative, Larry Jack Schwarz, was fired after child pornography was found in his possession.\n\nRepublican strategist and Citadel Military College graduate Robin Vanderwall was convicted in Virginia on five counts of soliciting sex from boys and girls over the internet.\n\nRepublican city councilman Mark Harris, who is described as a “good military man” and “church goer,” was convicted of repeatedly having sex with an 11-year-old girl and sentenced to 12 years in prison.\n\nRepublican businessman Jon Grunseth withdrew his candidacy for Minnesota governor after allegations surfaced that he went swimming in the nude with four underage girls, including his daughter.\n\nRepublican director of the “Young Republican Federation” Nicholas Elizondo molested his 6-year old daughter and was sentenced to six years in prison.\n\nRepublican benefactor of conservative Christian groups, Richard A. Dasen Sr., was charged with rape for allegedly paying a 15-year old girl for sex. Dasen, 62, who is married with grown children and several grandchildren, has allegedly told police that over the past decade he paid more than $1 million to have sex with a large number of young women\n\nDennis Hastert served as Republican Speaker of the House (so, 3rd in line for the Presidency) for all 8 years of W. Bush’s two terms. He also sexually molested at least 5 boys when he was a HS wrestling coach, all of them underage with the youngest victim being 14. The victims only finally saw justice when Hastert was caught by the FBI trying to falsify payments for hush money.\n\nDonald Trump walked into Miss Teen USA change rooms with girls as young as 14 changing. 26 women have spoken publicly about Trump’s pattern of sexual assualt. In 2023, he was found legally liable for the rape of E. Jean Carroll by unanimous jury\n\nAnton “Tony” Lazzaro, a former Republican donor and political strategist from Minnesota, was convicted in March 2023 on federal charges of sex trafficking minors. He was found guilty of conspiring to recruit and pay teenage girls, aged 15 and 16, for sex between May and December 2020. In August 2023, Lazzaro was sentenced to 21 years in prison for these offenses.\n\nPrior to his arrest, Lazzaro was a prominent figure in Minnesota Republican circles, donating over $270,000 to various Republican campaigns and political committees. His indictment led to significant turmoil within the Minnesota Republican Party, culminating in the resignation of then-party chair Jennifer",
                "> Holmberg, 81, a Republican from Grand Forks, served in the North Dakota Legislature for 45 years, resigning in 2022.\nHe was linked to the investigation of Nicholas Morgan-Derosier of Grand Forks, who, in May, was sentenced to 40 years in prison on child pornography charges.\nDuring a plea hearing, Holmberg maintained he broke no laws in the Czech Republic, referring to the age of sexual consent in that country. He said he liked getting massages and they sometimes included sexual contact.\n\nThis man seriously tried to argue that he had sex with children, but he shouldn't be charged because he did it in a country with a lower age of consent? That's when you know someone is an absolutely sick pos. Zero shame for his actions, just hating that he's been caught.",
                "On brand and not surprising",
                "r/StillNotADragQueen\n\nshould just be renamed\n\nr/YepAnotherRepublicanChildMolester",
                "Republicans are trying to normalize pedophilia",
                "I read it all, yep it was a republican. Why can’t they just go pick lady bugs off Lyndsey graham and leave the teenage boys alone. ",
                "It’s always *exactly* who you’d suspect, and STILL not a drag queen.",
                "Title correction: \"**Republican** lawmaker convicted of child sex crime had history of exploiting vulnerable boys, prosecutor alleges\"",
                "as per usual, not a drag queen or a trans person, just your garden variety predator, an old white republican man. i'll just assume he's also the american variety of \"christian\".",
                "Trump has all the best Child Porn Addicts.  Only the best for him and his government."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Iconic F1 team owner Eddie Jordan passes away aged 76",
            "external_url": "https://www.formula1.com/en/latest/article/iconic-f1-team-owner-eddie-jordan-passes-away-aged-76.4szaKJ44LVwhZsJtPmC2OT",
            "upvotes": 78,
            "date": "03/20/2025",
            "thumbnail": "https://media.formula1.com/image/upload/f_auto/q_auto/v1742460366/fom-website/2025/Miscellaneous/jordan-header.png",
            "top_comments": [
                "RIP Eddie...was an absolute legend"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "Five years after Breonna Taylor’s killing, police reform in Louisville still incomplete",
            "external_url": "https://www.lpm.org/news/2025-03-13/five-years-after-breonna-taylors-killing-police-reform-in-louisville-still-incomplete",
            "upvotes": 579,
            "date": "03/20/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/833b2e0/2147483647/strip/true/crop/3840x2016+0+272/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9e%2F02%2F63eab85349a78908e1668922e81f%2Fimg-0554.jpg",
            "top_comments": [
                "They’re too busy harassing homeless pregnant women. 🙄",
                "What else is there to do besides kill civilians? You're gonna make their job so boring.",
                "I am so shocked by this…..",
                "People will just start reforming them manually if nothing happens.",
                "No one needs police.  Just let people do what they want."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Lawmaker convicted of child sex crime had history of exploiting vulnerable boys, prosecutor alleges",
            "external_url": "https://www.kvrr.com/2025/03/20/lawmaker-convicted-of-child-sex-crime-had-history-of-exploiting-vulnerable-boys-prosecutor-alleges/",
            "upvotes": 1804,
            "date": "03/20/2025",
            "thumbnail": "https://www.kvrr.com/content/uploads/2024/08/g/s/holmberg-ray-080824.png",
            "top_comments": [
                "Republican anti-abortion activist Howard Scott Heldreth is a convicted child rapist in Florida.\n\nRepublican County Commissioner David Swartz pleaded guilty to molesting two girls under the age of 11 and was sentenced to 8 years in prison.\n\nRepublican judge Mark Pazuhanich pleaded no contest to fondling a 10-year old girl and was sentenced to 10 years probation.\n\nRepublican anti-abortion activist Nicholas Morency pleaded guilty to possessing child pornography on his computer and offering a bounty to anybody who murders an abortion doctor.\n\nRepublican legislator Edison Misla Aldarondo was sentenced to 10 years in prison for raping his daughter between the ages of 9 and 17.\n\nRepublican Mayor Philip Giordano is serving a 37-year sentence in federal prison for sexually abusing 8- and 10-year old girls.\n\nRepublican campaign consultant Tom Shortridge was sentenced to three years probation for taking nude photographs of a 15-year old girl.\n\nRepublican racist pedophile and United States Senator Strom Thurmond had sex with a 15-year old black girl which produced a child.\n\nRepublican pastor Mike Hintz, whom George W. Bush commended during the 2004 presidential campaign, surrendered to police after admitting to a sexual affair with a female juvenile.\n\nRepublican legislator Peter Dibble pleaded no contest to having an inappropriate relationship with a 13-year-old girl.\n\nRepublican activist Lawrence E. King, Jr. organized child sex parties at the White House during the 1980s.\n\nRepublican lobbyist Craig J. Spence organized child sex parties at the White House during the 1980s.\n\nRepublican Congressman Donald “Buz” Lukens was found guilty of having sex with a female minor and sentenced to one month in jail.\n\nRepublican fundraiser Richard A. Delgaudio was found guilty of child porn charges and paying two teenage girls to pose for sexual photos.\n\nRepublican activist Mark A. Grethen convicted on six counts of sex crimes involving children.\n\nRepublican activist Randal David Ankeney pleaded guilty to attempted sexual assault on a child.\n\nRepublican Congressman Dan Crane had sex with a female minor working as a congressional page.\n\nRepublican activist and Christian Coalition leader Beverly Russell admitted to an incestuous relationship with his step daughter.\n\nRepublican congressman and anti-gay activist Robert Bauman was charged with having sex with a 16-year-old boy he picked up at a gay bar.\n\nRepublican Committee Chairman Jeffrey Patti was arrested for distributing a video clip of a 5-year-old girl being raped.\n\nRepublican activist Marty Glickman (a.k.a. “Republican Marty”), was taken into custody by Florida police on four counts of unlawful sexual activity with an underage girl and one count of delivering the drug LSD.\n\nRepublican legislative aide Howard L. Brooks was charged with molesting a 12-year old boy and possession of child pornography.\n\nRepublican Senate candidate John Hathaway was accused of having sex with his 12-year old baby sitter and withdrew his candidacy after the allegations were reported in the media.\n\nRepublican preacher Stephen White, who demanded a return to traditional values, was sentenced to jail after offering $20 to a 14-year-old boy for permission to perform oral sex on him.\n\nRepublican talk show host Jon Matthews pleaded guilty to exposing his genitals to an 11 year old girl.\n\nRepublican anti-gay activist Earl “Butch” Kimmerling was sentenced to 40 years in prison for molesting an 8-year old girl after he attempted to stop a gay couple from adopting her.\n\nRepublican Party leader Paul Ingram pleaded guilty to six counts of raping his daughters and served 14 years in federal prison.\n\nRepublican election board official Kevin Coan was sentenced to two years probation for soliciting sex over the internet from a 14-year old girl.\n\nRepublican politician Andrew Buhr was charged with two counts of first degree sodomy with a 13-year old boy.\n\nRepublican politician Keith Westmoreland was arrested on seven felony counts of lewd and lascivious exhibition to girls under the age of 16 (i.e. exposing himself to children).\n\nRepublican anti-abortion activist John Allen Burt was charged with sexual misconduct involving a 15-year old girl.\n\nRepublican County Councilman Keola Childs pleaded guilty to molesting a male child.\n\nRepublican activist John Butler was charged with criminal sexual assault on a teenage girl.\n\nRepublican candidate Richard Gardner admitted to molesting his two daughters.\n\nRepublican Councilman and former Marine Jack W. Gardner was convicted of molesting a 13-year old girl.\n\nRepublican County Commissioner Merrill Robert Barter pleaded guilty to unlawful sexual contact and assault on a teenage boy.\n\nRepublican City Councilman Fred C. Smeltzer, Jr. pleaded no contest to raping a 15 year-old girl and served 6-months in prison.\n\nRepublican activist Parker J. Bena pleaded guilty to possession of child pornography on his home computer and was sentenced to 30 months in federal prison and fined $18,000.\n\nRepublican parole board officer and former Colorado state representative, Larry Jack Schwarz, was fired after child pornography was found in his possession.\n\nRepublican strategist and Citadel Military College graduate Robin Vanderwall was convicted in Virginia on five counts of soliciting sex from boys and girls over the internet.\n\nRepublican city councilman Mark Harris, who is described as a “good military man” and “church goer,” was convicted of repeatedly having sex with an 11-year-old girl and sentenced to 12 years in prison.\n\nRepublican businessman Jon Grunseth withdrew his candidacy for Minnesota governor after allegations surfaced that he went swimming in the nude with four underage girls, including his daughter.\n\nRepublican director of the “Young Republican Federation” Nicholas Elizondo molested his 6-year old daughter and was sentenced to six years in prison.\n\nRepublican benefactor of conservative Christian groups, Richard A. Dasen Sr., was charged with rape for allegedly paying a 15-year old girl for sex. Dasen, 62, who is married with grown children and several grandchildren, has allegedly told police that over the past decade he paid more than $1 million to have sex with a large number of young women\n\nDennis Hastert served as Republican Speaker of the House (so, 3rd in line for the Presidency) for all 8 years of W. Bush’s two terms. He also sexually molested at least 5 boys when he was a HS wrestling coach, all of them underage with the youngest victim being 14. The victims only finally saw justice when Hastert was caught by the FBI trying to falsify payments for hush money.\n\nDonald Trump walked into Miss Teen USA change rooms with girls as young as 14 changing. 26 women have spoken publicly about Trump’s pattern of sexual assualt. In 2023, he was found legally liable for the rape of E. Jean Carroll by unanimous jury\n\nAnton “Tony” Lazzaro, a former Republican donor and political strategist from Minnesota, was convicted in March 2023 on federal charges of sex trafficking minors. He was found guilty of conspiring to recruit and pay teenage girls, aged 15 and 16, for sex between May and December 2020. In August 2023, Lazzaro was sentenced to 21 years in prison for these offenses.\n\nPrior to his arrest, Lazzaro was a prominent figure in Minnesota Republican circles, donating over $270,000 to various Republican campaigns and political committees. His indictment led to significant turmoil within the Minnesota Republican Party, culminating in the resignation of then-party chair Jennifer",
                "> Holmberg, 81, a Republican from Grand Forks, served in the North Dakota Legislature for 45 years, resigning in 2022.\nHe was linked to the investigation of Nicholas Morgan-Derosier of Grand Forks, who, in May, was sentenced to 40 years in prison on child pornography charges.\nDuring a plea hearing, Holmberg maintained he broke no laws in the Czech Republic, referring to the age of sexual consent in that country. He said he liked getting massages and they sometimes included sexual contact.\n\nThis man seriously tried to argue that he had sex with children, but he shouldn't be charged because he did it in a country with a lower age of consent? That's when you know someone is an absolutely sick pos. Zero shame for his actions, just hating that he's been caught.",
                "On brand and not surprising",
                "r/StillNotADragQueen\n\nshould just be renamed\n\nr/YepAnotherRepublicanChildMolester",
                "Republicans are trying to normalize pedophilia",
                "I read it all, yep it was a republican. Why can’t they just go pick lady bugs off Lyndsey graham and leave the teenage boys alone. ",
                "It’s always *exactly* who you’d suspect, and STILL not a drag queen.",
                "Title correction: \"**Republican** lawmaker convicted of child sex crime had history of exploiting vulnerable boys, prosecutor alleges\"",
                "as per usual, not a drag queen or a trans person, just your garden variety predator, an old white republican man. i'll just assume he's also the american variety of \"christian\".",
                "Trump has all the best Child Porn Addicts.  Only the best for him and his government."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Tesla recalls most Cybertrucks due to trim detaching from vehicle",
            "external_url": "https://www.reuters.com/business/autos-transportation/tesla-recall-over-46000-cybertrucks-nhtsa-says-2025-03-20/",
            "upvotes": 15210,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It should be noted that this vehicle had the most Elon involvement than any other Tesla. The CyberTruck was supposed to be his crowning achievement, his coup d’ grace, his ultimate vision realized 😂😂",
                "The build quality is a joke on these things. Europe was right not to let them on the road.",
                "Unhinged you might say\n\nConcerning",
                "\"Tesla accounts for a large portion of recalled vehicles in the U.S. In 2024, Tesla topped the list for U.S. recalls with its vehicles accounting for 5.1 million call-backs, according to recall management firm BizzyCar. However, most issues for the brand's cars were usually resolved with over-the-air software updates.\" (probably from this article, took it from yahoo version).\n\n  \nThey are going AAA games company route of selling bugged unfinished product and patching it up as it goes. While selling cars.",
                "“Trim?” \n\nI saw a couple of pictures of whole panels.",
                "There's a cyber truck in my town, and I was just commenting to my wife on a walk last night that it looked like it was getting more wavy and wrinkly over time.... Glue failure would do that. \n\nHysterically poorly engineered.",
                "While they're at the dealership just keep 'em and cash out the owners. Do them all a favour.",
                "Plastic molding as an inner frame? \n\nWire steering will fail next. \n\n\nThis manchild nazi is a moron. \n\nThe engineers on this tried to tell the mentally challenged \nStock market cheat to make a stable frame....apparently it cost too much. Elon was banking on the revenue as pocket cash....looks like he's a moron...\nAgain...",
                "Musk sends DOGE to tear down vehicle safety standards in 3... 2... 1...",
                "Elon's become unglued since he made Trump his bestie."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "‘Don’t call it zombie deer disease’: scientists warn of ‘global crisis’ as infections spread across the US",
            "external_url": "https://www.theguardian.com/environment/2025/mar/20/chronic-wasting-disease-spread-zombie-deer-global-us-aoe",
            "upvotes": 1019,
            "date": "03/20/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/cfd667d2f38456d67610e38b7ae3b796533e5195/510_466_2304_1382/master/2304.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5be82800bc08bf2ee01c20875ed46949",
            "top_comments": [
                "Prion diseases are terrifying.",
                "When the best case scenario is making it harder to find deer and elk to hunt and the worst case is a cross infection that leads to a human disaster that might be unprecedented, its terrifying to think of these warnings coming during a time when our national leadership has a track record of ignoring potential disease disaster and then mismanaging response to lead to nearly a million deaths.",
                "RFK just needs for this to keep going so he can find an immune deer.",
                "US: No. \n\n*Fires scientists* \n\nCNN headline: \"Zombie Deer Disease runs rampant amongst deer.\" \n\nFOX headline: \"Biden responsible for mysterious deaths.\"",
                "My shitty representative, Pat Curry of Texas-56, just submitted a bill in Texas to dismantle the Texas Parks and Wildlife Department which houses the Game Wardens of the state. He spews out the typical republican word bullshit about waste and taking their budget and resources and putting them to better use.\n\nBut in reality, the Wardens and another regulatory body under the TPWD made a pretty big bust on some deer breeders in the state last year. The info on arrests has been withheld for bullshit reasons but Pat Curry let the cat out of the bag when he emailed a response to a constituent telling him to withdraw the bill. He specifically mentions Deer Breeding as a reason why he submitted the bill.\n\nSo either he has an breeding operation that was dinged from the recent bust or family/friend/donor runs a breeding operation and they cried to their politician friend to remove even more regulations.\n\nRemember, always follow the money.",
                "\"symptoms include ... a lack of fear of people\"\n\ndid not have deerpocalypse on my 2025 bingo card",
                "Call it what it is. CWD chronic wasting disease",
                "Great timing to withdraw from the WHO and gut science and environment surveillance",
                "Zombie Deer Disease can be cured with bleach up the bumhole.",
                "Using alarmist language to describe a disease like this is good actually."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Finland is again ranked the happiest country in the world. The US falls to its lowest-ever position",
            "external_url": "https://apnews.com/article/world-happiness-report-ranking-finland-afghanistan-us-b41c1712448762d98fe9e4f80233c15f",
            "upvotes": 16134,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Finnish people have a lot of trust in their government and other public institutions, and trust in their communities in general. They provide access to strong public services like healthcare and education. Finland has a stable economy. And they value work-life balance, comfort, and well-being. It has been this way for a long time. It seems clear that other counties should follow suit",
                "Beyond the actual rankings, there's some good insights here, about what makes for a happy society:\n\n>**Researchers say that beyond health and wealth, some factors that influence happiness sound deceptively simple: sharing meals with others, having somebody to count on for social support, and household size**. In Mexico and Europe, for example, a household size of four to five people predicts the highest levels of happiness, the study said.\n\n>**Believing in the kindness of others is also much more closely tied to happiness than previously thought**, according to the latest findings.\n\n>As an example, the report suggests that **people who believe that others are willing to return their lost wallet is a strong predictor of the overall happiness of a population**.\n\n>Nordic nations rank among the top places for expected and actual return of lost wallets, the study found.\n\n>Overall, researchers said **global evidence on the perceived and actual return of lost wallets shows that people are much too pessimistic about the kindness of their communities compared to reality** — actual rates of wallet return are around twice as high as people expect.\n\n>...\n\n>Experts in economics, psychology, sociology and beyond then seek to explain the variations across countries and over time using factors such as **GDP per capita, healthy life expectancy, having someone to count on, a sense of freedom, generosity and perceptions of corruption**.\n\nIt's a good reminder that a sense of community, personal relationships, and social solidarity add real value to people's lives.\n\nI think that sometimes gets missed, when changes in society are evaluated almost solely by their implications for economics and efficiency.  Those are important too, but they're not everything.",
                "Frankly, the end of the article scares me more than the ranking itself:\n\n\n>In a concerning development, the study said 19% of young adults across the world reported in 2023 that they have no one they could count on for social support. That is a 39% increase compared to 2006.\n\n\nWe already have one generation of people who are effectively islands unto themselves. The fact that the next generation is already starting off alone isn't going to bode well.\n\n\nAlso, Mexico being in #10 despite some of the horiffic things that happen there should raise some alarm bells on how the United States functions as a society. If you're less happy than the country below you that has active cartels with clandestine body disposal facilities, then you have a problem.",
                "Finland Finland finlaaaaaand. That is the country for me",
                "Position  24.  Saved you a click",
                "As a born Finnish (around middle-age) this seems weird because I don't think we're \"happy\" as the word suggests. I think we are \"content\". We got everything quite stable, it's safe, quiet and not a ton of people everywhere. We got nature everywhere, we got our little houses and apartment buildings and we got hobbies.\n\nLavishing life-style, kitted out mansions and supercars have never been hip here. \n\nSure sometimes it's boring as hell, but it's stable and you don't have to fear dropping onto nothing if shit gets difficult/you get sick (unless you purposefully fuck up time after time).",
                "I was told we were going to be great.",
                "The Netherlands no. 5; it's always Scandinavian countries and The Netherlands in the top 10. I wonder why.",
                "Finland: Universal healthcare, work-life balance, and trust in government.   \nThe US: Unlimited breadsticks if you ask nicely.",
                "Direct Link to the report: https://worldhappiness.report/ed/2025/"
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "RISING",
            "title": "SEC drops case against crypto firm with ties to Trump, CEO says",
            "external_url": "https://abcnews.go.com/US/sec-drops-case-crypto-firm-ties-trump-ceo/story?id=119963257",
            "upvotes": 430,
            "date": "03/20/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/88d6eb42-3a82-4195-9843-94d0552a8534/Garlinghouse-gty-er-250319_1742416559959_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "It’s all for sale now. It doesn’t matter what you do, just whether you can buy your way out of it from the Trump administration.",
                "Wow, must be a coincidence? Right?",
                "Blatant corruption. What a sad state they’re turning this country into.",
                "“Nothing to see here, move along.”  SEC",
                "Biff is king and corruption runs rampant in this timeline.",
                "Open corruption in every nook and cranny.",
                " Thank god. It only took 4 years..",
                "To be fair they also have ties to Kamala Harris but she lost so no one cares."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Georgetown professor detained by federal immigration officials &#x2d; WTOP News",
            "external_url": "https://wtop.com/dc/2025/03/georgetown-u-professor-detained-by-federal-immigration-officials-lawsuit-says/",
            "upvotes": 620,
            "date": "03/20/2025",
            "thumbnail": "https://wtop.com/wp-content/uploads/2022/01/GettyImages-1236982823-scaled-e1643594830754.jpg",
            "top_comments": [
                "People are going to say this is justified because of an alleged tie of him promoting Hamas propaganda but if true, how can you support the gov response? It’s like if I jaywalked, the gov can then send masked goons, whisk me at night, and disappear me to another location because I technically did something wrong or perceived as wrong. Also, the next move for the gov here is to then focus on Americans that are born here and stifle their free speech which we see happening on college campuses.",
                "Freedom of speech only exist if you say things they agree with. Pretty soon you could be in trouble for supporting Canada, transgender etc.",
                "The US has gone full Nazi.",
                "It's getting scarier by the day, don't let yourself think anybody is immune or off limits..",
                "From article:\n\n“But there’s another wrinkle here, which is that his wife, who is a U.S. citizen, appears to be the daughter of someone who served as a senior political adviser to the Hamas leadership. It’s not clear at the moment if he’s still in that capacity or served in that capacity in the past.\n\nSo there’s at least a semi-indirect family connection. We’ve seen a statement from DHS that alleges that Suri has “close connections to a known or suspected terrorist who is a senior adviser to Hamas.” And I think that is referring to his father-in-law. ”\n\nLooks like it could be more than freedom of speech. Also if his wife is US citizen he should be able to get a green card.",
                "> Tricia McLaughlin, a spokesperson for the Department of Homeland Security, said in a post on X that Suri was “actively spreading Hamas propaganda and promoting antisemitism on social media.”\n\nIANAL so someone please correct me if this is wrong, but isn’t this protected speech under the first amendment?",
                "Fuck your shithole country",
                ">Suri was “actively spreading Hamas propaganda and promoting antisemitism on social media.”\n\n\nFair process and trial.\n\n\nAmerica gotta extirpate these terrorist advocates and racists."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk's X sues India over 'unlawful' censorship via Sahyog Portal and IT Act",
            "external_url": "https://desifounder.com/d/News/comments/76/Elon_Musks_X_sues_India_over_unlawful_censorship_via_Sahyog",
            "upvotes": 304,
            "date": "03/20/2025",
            "thumbnail": "https://i.desifounder.com/desifounder-default.png",
            "top_comments": [
                "Going from being known as the \"richest man in the world\" to being the \"most hated man in the world\" must be an experience.",
                "Is it unlawful in india tho? I have a feeling that once again he thinks that american laws apply even when operating abroad...",
                "Meanwhile Musk has no problem with his own censorship or censorship in China, Russia, Saudi Arabia, and countless other countries.",
                "He will throw his toys out of the pram and try to get Trump to tariff them.",
                "im just gonna assume this is some far right shit in india.",
                "Wonder how Musk feels about government following laws. Perhaps India is borrowing from the Trump playbook where laws are more of a guideline than actual rules or laws.",
                "So what I'm reading is Trump is going to put Tariffs on India soon?",
                "Didn’t he already fuck with the Indian government a few years back censoring the main dudes rivals?",
                "Good luck suing India",
                "Tariffs against India incoming in 3..2.."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Israeli strikes across Gaza hit multiple homes, killing at least 58 Palestinians, medics say",
            "external_url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-03-20-2025-36c07d3dc7c03f66f86f44409d504d43?utm_source=copy&utm_medium=share",
            "upvotes": 409,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I want to draw attention to something important that I think a lot of people gloss over in discussion of Israel's military campaign in Gaza - *combat zones*.\n\nThe associated press recently [put out this map](https://i.imgur.com/Rym5mqu.jpeg), an estimation of the boundaries of the IDF's so called combat zones - invisible lines which the Israeli military draws and declares anyone within as a valid military target by virtue of their presence.\n\nAs you can see by the map, these \"combat zones\" are typically very broad, and also aren't actually well defined. Despite this, the IDF uses their existence to justify civilian casualties by asserting that anyone present in them *must* be Hamas or someone trying to martyr themselves. In case it wasn't obvious, these combat zones often cover neighborhoods home to tens of thousands of people. \n\nImagine if - for instance, the Peoples Liberation Army decided that actually the entirety of Harlem was a combat region (without even making that information available to New Yorkers beforehand) and killed anyone present. I don't think many would regard this as much more than the wanton murder of civilians.\n\nAnd I am not being hyperbolic about these killings - take for instance the case of two elderly Palestinian civilians who were killed as reported originally by [HaMakom](https://www.ha-makom.co.il/1057919-2/) (in Hebrew) and can be read about in English [here](https://euromedmonitor.org/en/article/6621/Euro-Med-Monitor-reveals-details-of-Israeli-army%E2%80%99s-execution-of-elderly-Palestinian-couple-after-it-used-them-as-human-shields) or [here](https://www.haaretz.com/israel-news/2025-02-16/ty-article/idf-reportedly-used-elderly-gazan-as-human-shield-tied-explosive-around-his-neck/00000195-0e56-d1b4-a7fd-cf7742bf0000). Essentially, IDF forces abducted an elderly Palestinian man and forced him to enter suspected booby-trapped buildings (as part of the alleged ***Mosquito Protocol***). Eventually, he and his wife were released; however, the IDF unit that abducted them did not inform the other units operating in the area that they had done so, so shortly after their release, **the 80 year old man and his wife were shot dead by Israeli forces operating in the area**.\n\nAnother report by [Haaertz](https://www.haaretz.com/israel-news/2024-12-18/ty-article-magazine/.premium/idf-soldiers-expose-arbitrary-killings-and-rampant-lawlessness-in-gazas-netzarim-corridor/00000193-da7f-de86-a9f3-fefff2e50000) focuses on the Netzarim corridor, one of the most infamous examples of these kill zones. I will leave you with the following quotes from soldiers:\n\n>*Every woman is a scout, or a man in disguise ... Anyone on a bicycle could be killed, claiming cyclists were terrorists*\n\n...\n\n>\"After shootings, bodies are not collected, attracting packs of dogs who come to eat them.\"\n\n...\n\n>\"One time, guards spotted someone approaching from the south. We responded as if it was a large militant raid. We took positions and just opened fire.\n\n>I'm talking about dozens of bullets, maybe more. For about a minute or two, we just kept shooting at the body. People around me were shooting and laughing.\"\n\n>When they approached the body, the soldier said they discovered that the person they had just gunned down was \"just a boy, maybe 16 (years old).\"\n\n>The battalion commander responded: \"Anyone crossing the line is a terrorist, no exceptions, no civilians. Everyone's a terrorist.\"\n\n...\n\n>\"The sight haunts me,\" said the soldier in his account in the report. Three of the Palestinians were killed in the barrage, while the survived with his hands in the air.\n\n>\"We put him in a cage set up near our position, stripped off his clothes, and left him there,\" the soldier recounts.\n\n>\"Soldiers passing by spat on him. It was disgusting. Finally, a military interrogator came, questioned him briefly while holding a gun to his head, then ordered his release.\"\n\nPerhaps these soldiers are lying. Perhaps the fact that their stories of indiscriminate killing seemingly independently cooberate one another, and reports from [doctors](https://www.nytimes.com/interactive/2024/10/09/opinion/gaza-doctor-interviews.html), [humanitarian organizations](https://www.amnesty.org/en/latest/news/2024/12/amnesty-international-concludes-israel-is-committing-genocide-against-palestinians-in-gaza/), the [UN](https://www.ohchr.org/sites/default/files/documents/countries/opt/20241106-Gaza-Update-Report-OPT.pdf), and the [ICC](https://www.icc-cpi.int/news/statement-icc-prosecutor-karim-aa-khan-kc-applications-arrest-warrants-situation-state) is merely a coincidence. I certainly do not *want* these reports to be true - *it would be preferable to imagine this as some grand antisemetic conspiracy* rather than think that reports like that of:\n\n>\"\tOne Division 99 reservist recalled watching a video feed from a drone showing \"an adult with two children crossing the forbidden line.\" \n\n>\"We had them under complete surveillance with the drone and weapons aimed at them—they couldn't do anything,\" he said. **\"Suddenly we heard a massive explosion. A combat helicopter had fired a missile at them.** Who thinks it's legitimate to fire a missile at children? And with a helicopter? This is pure evil.\" \n\n...are real. But I find evidence that this is an elaborate hoax to be lacking.\n\nI find it disturbing that so few people seem to be aware of these reports - neighborhoods and their residents being so casually designated for termination - dozens of *Bucha*s happening with the West's enthusiastic support, and I hope that having read these accounts you understand why some people find Israel's military operations in Gaza objectionable.",
                ">More than 400 Palestinians were killed on Tuesday alone, mostly women and children, according to Gaza’s Health Ministry. There have been no reports of Hamas firing rockets or carrying out other attacks.\n\n\nRight wingers will self-destruct and take these innocent people with them. Do not tolerate conservatives.",
                "Are we allowed to call it genocide yet without being harassed?",
                ">More than 400 Palestinians were killed on Tuesday alone, mostly women and children, according to Gaza’s Health Ministry. There have been no reports of Hamas firing rockets or carrying out other attacks.\n\nTo the trolls that follow me around like hyenas down-voting anything I say denouncing violence: Have at it! ☺️"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "French Scientist Reportedly Denied U.S. Entry Due to Trump Criticism",
            "external_url": "https://newrepublic.com/post/192946/french-scientist-denied-us-entry-trump-criticism",
            "upvotes": 33204,
            "date": "03/19/2025",
            "thumbnail": "https://images.newrepublic.com/df32fc6dfc42d5dcddd8933438d7a9a07f5c533f.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
            "top_comments": [
                "Horrifying\n\n>The French newspaper Le Monde reports that on March 9, a space researcher was randomly selected upon arrival in Houston for a search, and CBP found messages criticizing the Trump administration’s treatment of scientists, which, according to the agency, “conveyed hatred of Trump & could be qualified as terrorism.”\n\nI guess around half of america are  terrorists now, according to whoever said that.",
                "So much for freedom of speech.",
                "Good thing he got to back to France and not deported to a concentration camp.",
                "Places people don’t want to go because they’re afraid of being jailed or deported for no reason:\n\n- Russia\n- North Korea\n- Iran\n- USA\n\nCongrats. Too much freedom I guess. ",
                "What a complete shit show.",
                "”hatred of Trump & could be qualified as terrorism”. So I guess no one is going to be let into the USA anymore?",
                "Anyone that thinks this person is just gonna go willingly after his term is up has another thing coming.",
                "I’ve never seen a country shoot itself in the foot to this degree in such a short span of time. Good luck attracting anyone other than MAGA style idiots at this point.",
                "USA is now just a fat North Korea",
                "Yamtits is the biggest man baby in the world with Elon a close second. It's amazing to me that bloated sack of monkey crap is actually president."
            ],
            "aggregate_sentiment": 12.0
        }
    ],
    "last_updated": "03/20/2025 16:10:52 UTC"
}