{
    "posts": [
        {
            "category": "HOT",
            "title": "Department of Education lays off nearly 50% of its workforce",
            "external_url": "https://abcnews.go.com/US/department-education-faces-50-layoffs-after-closure-notice/story?id=119690524&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 17263,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/63d5aa42-9003-48c5-b937-5f4e3fa8c88f/dept-education-1-epa-gmh-250311_1741707004175_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Woman who's never worked in education and enrolled her own kids in private schools has strong feelings on how little funding should go to programs helping special needs students.",
                "As a disabled person that benefited from DoE policy to get my high school and college diplomas I worry for the younger generation that will lose access.",
                "Everything Trump is doing weakens America, and hurts Americans.",
                "\"Six communications offices are going to be consolidated, they explained, and leases will end in major cities including San Francisco, New York, Cleveland, Boston, Chicago and Dallas.\"\n\nSeem a little targeted to anyone else?",
                "This is the kind of thing that should set off alarm bells, but somehow it just feels like another day in the slow dismantling of public services. Cutting nearly half a department overnight, with barely a warning, is not streamlining, it is sabotage. Even if you believe the Department of Education is bloated, you do not fix a system by gutting it in a way that leaves staff terrified and scrambling. \n\nPeople do not work well under fear, and a government that rules through uncertainty is more interested in control than competence. The bigger question is what comes next. If this is just the warm-up act for dismantling the department altogether, what does that mean for the millions of students and families who rely on federal education programmes? Anyone cheering this move might want to ask themselves whether they trust their local politicians to handle education funding fairly and effectively because that is where this is headed.",
                "2024 Election exit data polling shows the higher level of education someone achieves, the more likely they are to vote Democratic. Those without a college degree are most likely to vote Republican\n\n[Source](https://www.nbcnews.com/politics/2024-elections/exit-polls)\n\nIf you check this [source](https://en.wikipedia.org/wiki/List_of_U.S._states_and_territories_by_educational_attainment) and sort by states based on percent of people who have a bachelors or higher, the top 10 are blue states and the bottom ten are red states.\n\nTrump said \"I love the uneducated\" because they are his base. Attacks on education are purposeful.",
                "I hate how the worst possible news reports don't even get a sigh out of me anymore. Not that I'm accepting this as normal, but at this point my reaction to this headline is just 'of course it is'.",
                "Being in college right now is weird. Not a lot of political discussions allowed/welcome in the classrooms. Instead of organizing (maybe out of fear) everyone is in self preservation mode due to midterms. This news doesn’t make it easy to lock in on my own studying.",
                "So this means that I don’t owe any of my student loans and they’re all forgiven since no one is gonna keep a check on them? if only",
                "I didn’t realize the Ed Dept was that small, less than 4,000 people? You always hear about how the DoD is 1.3 million civilians and the VA is 435,000. But the entire Ed Dept is 4,000 people? TIL."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Musk launches appeal to restore $56 billion Tesla payday",
            "external_url": "https://www.reuters.com/business/autos-transportation/musk-launches-appeal-restore-56-billion-tesla-payday-2025-03-11/",
            "upvotes": 14264,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They should ask him to name 5 things he did for the company last week.",
                "\"I would like you to pay me 56 billion dollars while I am actively tanking the company's value\" is an interesting pitch ...",
                "> Musk has said that he wants a greater stake in Tesla or he might develop products outside of the company.   \n   \nAh yes, threatening your own company.",
                "Hey guys I’m gonna need that money before I completely destroy the brand with my evil actions",
                "Has he seen the stock price?",
                "I highly doubt shareholders would support him now if they were to vote on it again. He's lost the shareholders billions.",
                "He should not buy a Tesla unless it’s in Canada and he buys two a minute",
                "Elon, do you little salute again, maybe that will fix things",
                "He admitted that while running Doge, he is running his companies with \"great difficulty\"\n\nWhy would shareholders reward a CEO who is having \"great difficulty\" running their company?",
                "Who would ever think that acting like a nazi oligarch openly on the world stage would put off your customer base of environmentally conscious middle class liberals? "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "US to immediately restore intelligence sharing and 'security assistance' to Ukraine",
            "external_url": "https://www.bbc.com/news/live/c51ypekv9xwt",
            "upvotes": 21238,
            "date": "03/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c309/live/60583a00-fec2-11ef-b50e-9d086302645f.jpg",
            "top_comments": [
                ">Marco Rubio is asked if they are accepting any good-will gestures from Russia or if there is a deadline.\n\n\n>Rubio says \"Ukraine is ready to stop shooting and start talking.\"\n\n\n>He reiterates that he hopes Russia will say yes to the ceasefire, but if they say no \"then we'll unfortunately know what the impediment is to peace here\".\n\n\nIf you didn't already know that the impediment to peace is the guy who started the invasion............",
                "Forgot to add asterisk*, *with terms and conditions applied.*",
                "So he basically got hundreds of Ukrainians killed for nothing",
                "[removed]",
                "I don't believe it and any \"assistance\" will likely help Russia.",
                "I feel like Trump is running this country like a 13 yr old. He hates you today and likes you the next. Nobody signed up for this shitty roller coaster ride.",
                "So the deal with the Russians was that Trump would pause intelligence sharing to give them an advantage in Kursk? Well done, Trump!",
                "I would not be trusting any US intel if I was Ukraine ",
                "Oh, is he thankful enough now? Was his shirt nicer? Did X have hiccups for reasons other than Ukraine?\n\nWe’ll see in 3 days when the administration throws them under the bus again.",
                "I wouldn't trust the Trump regime to give usable Intel anymore. I would expect them to give our allies shoddy/wrong Intel in the hopes of sabotaging their efforts. I would also expect the Trump terrorists to give our Allies information to Putin as soon as they get it. Republicans cannot be trusted in this world because of the evil they inflict on humanity."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Trump backs off doubling Canadian steel and aluminum tariffs after Ontario suspends electricity surcharge",
            "external_url": "https://www.cbsnews.com/news/trump-tariffs-canada-steel-aluminum/",
            "upvotes": 4207,
            "date": "03/11/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/11/d3dc91bb-a425-42cb-9d30-0ff10eafaa14/thumbnail/1200x630g2/b57462378b668dd5d145a85b2e321fc0/gettyimages-2203227046.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "This is the most farcical trade war ever.",
                "I swear to God this is exhausting. It makes me wish we were back in the pandemic years so I can just make sourdough and not have to hear the word tariff 50x a day.",
                "So he's not running America so much like ***a*** business, as he is running America like [*his* business](https://www.americanbanker.com/news/banking-on-the-donald).",
                "They suspended the surcharge as good faith for the meeting this Thursday. That was not a win for the orange bastard.",
                "His decision making is child-like. Impulsive, personal, ad hoc, transactional. He is a bully who has been handed the reigns of government.",
                "\"Speak loudly and carry a small dick.\" --The Trump Doctrine ",
                "Consistently inconsistent",
                "Sundowning embarrassment",
                "Why the fuck is canada backing off",
                "At least until tomorrow. When he wakes up in his shit filled diaper and decides to tariff  something else because he’s mad."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Trump has instructed to raise Canadian tariffs on aluminum and steel to 50%",
            "external_url": "https://www.theguardian.com/us-news/live/2025/mar/11/donald-trump-latest-us-politics-news-live?CMP=share_btn_url&page=with%3Ablock-67d042cb8f087aea3a248e0d#block-67d042cb8f087aea3a248e0d",
            "upvotes": 38137,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/0b0825591c1024786d86f2885a2b0b687e566fbd/0_431_7276_4368/master/7276.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=d469fea090bd2490dd7093a76c2aa525",
            "top_comments": [
                "Sounds like it gonna be another great day on the Stock Market!!!",
                "I like how he keeps bringing up the dairy one. Negotiated BY HIM, and it only kicks in at a level that has NEVER been met. Those tariffs have never been charged.",
                "\"Trump said he would “permanently shut down the automobile manufacturing business in Canada” if the country did not end unspecified tariffs it had placed on US goods:\"\n\nEverything in thr market could be appeased if this moron backs down. \n\nAnd yet, he continues to double down on tariffs. \n\nThis is madness",
                "It's wild. We were so scared of the first set of tariffs, now I'm just like \"I'm tired boss\" and keep scrolling. Honestly his inability to take a measured approach to anything makes me think it'll sputter out quickly, he'll claim victory and forget tariffs are a thing by summer. Wishful thinking, I know.",
                "“He would see the entire world burn just to be the king of ashes”",
                "Apparently Trump wanted more chaos and uncertainty today. He and his administration have been trying to do at least one ill intentioned thing per day so far.",
                "Maybe instead of tariffs, we could properly tax billionaires 🤷🏻‍♂️",
                "Last time he did this, during Trump 1.0, aluminum plants in Kentucky closed, leading to higher unemployment. That county was devastated. Congratulations, Trump, and Trump voters!!!",
                "My MAGA buddy who owns a metal building construction business is about to find out",
                "Looks like Ontario might be shutting off electricity completely. Fuck Trump"
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "HOT",
            "title": "Fear of flying is pushing ticket sales down in the wake of multiple crashes, airlines say",
            "external_url": "https://www.cnn.com/2025/03/11/business/passengers-air-travel-crashes-fear/index.html",
            "upvotes": 8568,
            "date": "03/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2199796404.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Let's offset this by charging for luggage.\n\n \\- Southwest Airlines",
                "Misleading headlines it's not so much \"fear of flying\" as it is \"safety concerns after whistleblowers and deregulation and several accidents\"",
                "Elon Musk only flies on Air Force 1 lately.  Must be a sign.",
                " Without proper oversight, it is not the Fear of flying but the fear of crashing. Why would people travel with all the fear and uncertainty in the Russian Vassal State of the USA.",
                "With the government cutting a large amount of the people who service the air traffic equipment and knowing the fact that they were already pretty thin in that area, I'm probably not going to fly for a long while myself.",
                "make trains great again :) i seriously wish USA would build a massive highspeed rail system",
                "Yup, I canceled a flight this month after my brother's girlfriend almost died in that recent near miss where Southwest pilot pulled up just in time to avoid a taxiing idiot. Not gonna be a statistic for these assholes.",
                "I think it's more people not traveling because of economic reasons...",
                "It seems completely rational with the dangerous cuts to the FAA.",
                "I just had to decide whether to to make a 7.5 hour drive or fly. I chose to drive thinking of Elon's FAA cuts. Fuck those DOGE assholes."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "West Texas measles outbreak spreads into Oklahoma",
            "external_url": "https://www.nbcnews.com/health/health-news/west-texas-measles-outbreak-spreads-oklahoma-rcna195858",
            "upvotes": 764,
            "date": "03/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250311-measles-ch-1302-700353.jpg",
            "top_comments": [
                "Goddamn you, you goddamn idiots.",
                "Very sad and preventable. \n\nEven if you survive, you can still end up with scarring on your lungs and all sorts of other complications years down the line. ",
                "Don't worry, brain worm boy has a crack solution.\n\nAnd yes that is 100% /s.",
                "Team Measles is on a tear 😕",
                "God sends another plague on Trump's America because Evangelicals didn't get the point the first time.",
                "This is not going away by itself now, even if you vaccinate like crazy",
                "Scary time to be pregnant, thankfully my baby will be out soon. My dad was made deaf from his mom having measles while pregnant.",
                "Oklahoma??? You mean:\n\n- 44th in Education?\n- 49th in Healthcare?\n- 44th in Life Quality?\n- 50th in Test Scores?\n- top ten worst in poverty?\n\nThat Oklahoma? Boy, am I shocked!",
                "Anti-vaxxers are all fucking idiots. I can tell you from experience that there is absolutely nothing you can say to get them to see sense. I have an aunt who is anti-vax, and she always says in the face of facts, \"agree to disagree.\" I'm not sure that they'd change their stance even if one of their kids died. \n\nIt's not fair for the kids, since they didn't exactly choose to be born to total morons. Although unfortunately, the apple doesn't always fall far from the tree. My aunt had two daughters, and my cousins are as vapid as their mother. One of my cousins also has two daughters, and they're also not vaccinated. I just hope that they grow up to be better than their mom and grandma. The whole family is just lucky that they've only encountered mild cases of measles, and they're super lucky that we've managed to eliminate more serious illnesses such as polio and smallpox before my cousins were even born. The former is still out there in the world. It may be unlikely for it to come back to the US, but it isn't impossible.",
                "Man, I hope that shit doesn't mutate into a variant that ignores the vaccines we got as kids."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Ontario’s Ford suspends U.S. electric surcharge, says Lutnick agrees to trade talks",
            "external_url": "https://www.cnbc.com/2025/03/11/ontarios-ford-suspends-us-electric-surcharge-says-lutnick-agrees-to-trade-talks.html",
            "upvotes": 2941,
            "date": "03/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108096026-17385018682025-01-31t194302z_882276599_rc25lca555hn_rtrmadp_0_usa-trump-canada-tariffs.jpeg?v=1741720657&w=1920&h=1080",
            "top_comments": [
                "Does anyone else have a headache?",
                "I seen swings sets with less back and forth",
                "I still think it's time to invest in solar and batteries for my house.",
                "I'm seeing some very interesting headlines and reports from Americans to try and control the narrative like this from NBC - [Canada backs down from 25% electricity surcharge after Trump threats](https://www.nbcnews.com/business/economy/trump-canada-doubles-tariffs-national-emergency-electricity-rcna195810)\n\n As a Canadian, let's set the record straight.\n\nWhat really happened was that Canada made Trump blink first. Premier Ford and other Canadian leaders from coast to coast to coast have always asserted that they're willing to negotiate with America. It was America that continued to refuse to negotiate until Canada finally placed reciprocal tariffs and export taxes. \n\nTrump blinked. But American media would have you believe that Canada capitulated. Elbows up! 🇨🇦",
                "Pretty sure it’ll be back to tariffs and trade wars by the end of the week.",
                "I’m so tired of this shit show. Everyone who voted for Trump for economic reasons look real stupid right now",
                "We don't want a trade war, as nice as it would be to stick it to him. If they're willing to negotiate then we should try to avoid this as much as possible.\n\nBut our electricity surcharge can be reinstated at any time. If they try and do what they did to Zelenskyy, don't be surprised to see the surcharge back.",
                "I’m fucking tired of all the big talk and no one actually having the balls to do anything. Fucking EXHAUSTED ",
                "Did he not just say on TV all over the place that the tariffs would stay until the US removes its tariffs on Canadian products period.\nFord just did the same thing President Krasnov has been doing 😵‍💫",
                "It is the same fucking political pissing contest we have witnessed in the past 8 years in the US between R's and D's. Now it is being spread to the rest of the world. This shit is so exhausting and every single politician involved should be embarrassed.  I can tell ya one thing if I did my job as shitty as they do I would have been fired on the 2nd day."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Seven men arrested in Japan for raping daughters, sharing footage in chat group.",
            "external_url": "https://www.straitstimes.com/asia/east-asia/seven-men-arrested-in-japan-for-raping-daughters-sharing-footage-in-chat-group",
            "upvotes": 9073,
            "date": "03/11/2025",
            "thumbnail": "https://cassette.sphdigital.com.sg/image/straitstimes/cbb298abcce5ca7335e17c5dc6540bd83acce49d9a88a567e58400a2045ea275",
            "top_comments": [
                "Investigative sources revealed that the seven men, aged in their 30s to 50s and living in Aichi Prefecture and elsewhere, stand accused of penetrative sexual assault as well as violations of anti-child prostitution and anti-child pornography laws. Four of the men allegedly filmed the scenes of them sexually assaulting their biological or foster daughters, aged between 6 and 14 at the time, and shared the footage within a social media group, while the other three owned obscene images of underage individuals.\n\nIn the messaging app used by the group, there were comments reading, \"I've trained her since she was 3,\" \"Just telling her, 'If you tell your mom, you wouldn't be able to be with your dad. Can you keep a secret?' worked for me,\" and, \"Because my wife is away on a trip.\" The prefectural police believe that the men continued to sexually abuse their own daughters and others on a regular basis.\n\nIn November last year, one of the men was arrested on suspicion of penetrative sexual assault of an underage person, and a probe of his mobile phone revealed that the group was sharing obscene videos.\n\nIt is thought that the group, comprised of men fond of incest with minors, started exchanging information in around December 2023. The seven suspects came to know each other through another online website, and one of them managed the chat group in question. The police suspect that several other men had joined the group, and are continuing to investigate the case.",
                "I cannot even imagine the lifetime of trauma these girls will battle. They deserve the best care and support for the rest of their lives.  I'm not sure what kind of sentencing the Japanese legal system has, but I hope these men rot in prison. I hope every day until the end of their days is full of misery.",
                "These guys raped their own daughters regularly, youngest girl was six years old.  \nFilmed it and then circulate/share within their own chat group with other men/fathers.   \nHow muthaf\\*\\*king sick can one be to come up with such stuff!",
                "adblocker blocks the whole entire website. like, nothing at all shows up and the block counter just goes and goes",
                "Well that's enough reddit for today. ",
                "Just looked at the charges for stuff like this in Japan and got pissed off at how light of a sentence they could get",
                "How do all these sick fucks manage to find and enable each other? Death feels like too easy of a punishment for these degenerates.",
                "this is making me so distraught. like holy fuck i am heartbroken and angered for the victims. they’re just children, and their “fathers”, that are supposed to support and protect them, took so much away from them for the “fathers’” own benefits.",
                "I lived in Japan over a decade and I tell people it's awesome, unless you're a girl / woman / female. Then I get down voted. \n\nI'm a guy who heard from every female friend that they've been groped on trains, including foreign friends who have barely been living there. \n\nKind of like TV shows have that cliche episode every year, having a coworker come into work crying from being groped became normal with every new coworker. \n\n\nThis is evil as fuck, and it's just a bit of the iceburg tip surfacing. ",
                "Fucking disgusting. Damn. Poor little souls."
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "HOT",
            "title": "Texas measles cases grow to 223, mostly among children and teens",
            "external_url": "https://abcnews.go.com/Health/texas-measles-cases-latest/story?id=119663844",
            "upvotes": 4730,
            "date": "03/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/aebbd8d7-5e11-4f76-ba61-175fae71c515/measles-lubbock-01-gty-jef-250311_1741706139050_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Child abuse in the land of \"pro life\"...",
                "Can you imagine how PISSED these kids are going to be at their parents when they grow old enough to recognize that a terrible childhood illness was completely avoidable?",
                "Goddamn I hate the anti vaccine cult.",
                "Im sorry to the children caught in this stupidity. \n\nYou deserve better",
                "Because the adults are all vaccinated as they grew up in the U.S. when we still generally agreed it was a good idea. Because it is.",
                "Thankfully this is what convinced my wife's ex to finally give permission to vaccinate their kids (since in our state both parties have to sign off on it). \n\nMy heart goes out the kids who suffer and face a lifetime of potential health issues from this disease - but fuck the parents, fuck RFK Jr, fuck that \"Autism is caused by vaccines\" British asshole (who was running a grift to get people to pay for **his** vaccines), and anyone else who puts their high school graduation \"research\" against a proven history of vaccines saving millions of lives.",
                "This is because they aren't vaccinated. Poor children have to face this for no good",
                "Oh well.  At least eggs are chea... Or my retirement is grea... I mean we are in good standing world wid... \n\nAt least they will die for freedom.",
                "Red state oWniNg tHe LiBs!!. Ok well, have fun with your new little hobby I guess.",
                "These kids might end up with a lot of complications in 7 - 10 years. \n\nBlindness, lung scarring, suppressed immune system, seizures and brain damage in rare cases."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "West Texas measles outbreak spreads into Oklahoma",
            "external_url": "https://www.nbcnews.com/health/health-news/west-texas-measles-outbreak-spreads-oklahoma-rcna195858",
            "upvotes": 768,
            "date": "03/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250311-measles-ch-1302-700353.jpg",
            "top_comments": [
                "Goddamn you, you goddamn idiots.",
                "Very sad and preventable. \n\nEven if you survive, you can still end up with scarring on your lungs and all sorts of other complications years down the line. ",
                "Don't worry, brain worm boy has a crack solution.\n\nAnd yes that is 100% /s.",
                "Team Measles is on a tear 😕",
                "God sends another plague on Trump's America because Evangelicals didn't get the point the first time.",
                "This is not going away by itself now, even if you vaccinate like crazy",
                "Scary time to be pregnant, thankfully my baby will be out soon. My dad was made deaf from his mom having measles while pregnant.",
                "Oklahoma??? You mean:\n\n- 44th in Education?\n- 49th in Healthcare?\n- 44th in Life Quality?\n- 50th in Test Scores?\n- top ten worst in poverty?\n\nThat Oklahoma? Boy, am I shocked!",
                "Anti-vaxxers are all fucking idiots. I can tell you from experience that there is absolutely nothing you can say to get them to see sense. I have an aunt who is anti-vax, and she always says in the face of facts, \"agree to disagree.\" I'm not sure that they'd change their stance even if one of their kids died. \n\nIt's not fair for the kids, since they didn't exactly choose to be born to total morons. Although unfortunately, the apple doesn't always fall far from the tree. My aunt had two daughters, and my cousins are as vapid as their mother. One of my cousins also has two daughters, and they're also not vaccinated. I just hope that they grow up to be better than their mom and grandma. The whole family is just lucky that they've only encountered mild cases of measles, and they're super lucky that we've managed to eliminate more serious illnesses such as polio and smallpox before my cousins were even born. The former is still out there in the world. It may be unlikely for it to come back to the US, but it isn't impossible.",
                "Man, I hope that shit doesn't mutate into a variant that ignores the vaccines we got as kids."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Department of Education lays off nearly 50% of its workforce",
            "external_url": "https://abcnews.go.com/US/department-education-faces-50-layoffs-after-closure-notice/story?id=119690524&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 17274,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/63d5aa42-9003-48c5-b937-5f4e3fa8c88f/dept-education-1-epa-gmh-250311_1741707004175_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Woman who's never worked in education and enrolled her own kids in private schools has strong feelings on how little funding should go to programs helping special needs students.",
                "As a disabled person that benefited from DoE policy to get my high school and college diplomas I worry for the younger generation that will lose access.",
                "Everything Trump is doing weakens America, and hurts Americans.",
                "\"Six communications offices are going to be consolidated, they explained, and leases will end in major cities including San Francisco, New York, Cleveland, Boston, Chicago and Dallas.\"\n\nSeem a little targeted to anyone else?",
                "This is the kind of thing that should set off alarm bells, but somehow it just feels like another day in the slow dismantling of public services. Cutting nearly half a department overnight, with barely a warning, is not streamlining, it is sabotage. Even if you believe the Department of Education is bloated, you do not fix a system by gutting it in a way that leaves staff terrified and scrambling. \n\nPeople do not work well under fear, and a government that rules through uncertainty is more interested in control than competence. The bigger question is what comes next. If this is just the warm-up act for dismantling the department altogether, what does that mean for the millions of students and families who rely on federal education programmes? Anyone cheering this move might want to ask themselves whether they trust their local politicians to handle education funding fairly and effectively because that is where this is headed.",
                "2024 Election exit data polling shows the higher level of education someone achieves, the more likely they are to vote Democratic. Those without a college degree are most likely to vote Republican\n\n[Source](https://www.nbcnews.com/politics/2024-elections/exit-polls)\n\nIf you check this [source](https://en.wikipedia.org/wiki/List_of_U.S._states_and_territories_by_educational_attainment) and sort by states based on percent of people who have a bachelors or higher, the top 10 are blue states and the bottom ten are red states.\n\nTrump said \"I love the uneducated\" because they are his base. Attacks on education are purposeful.",
                "I hate how the worst possible news reports don't even get a sigh out of me anymore. Not that I'm accepting this as normal, but at this point my reaction to this headline is just 'of course it is'.",
                "Being in college right now is weird. Not a lot of political discussions allowed/welcome in the classrooms. Instead of organizing (maybe out of fear) everyone is in self preservation mode due to midterms. This news doesn’t make it easy to lock in on my own studying.",
                "So this means that I don’t owe any of my student loans and they’re all forgiven since no one is gonna keep a check on them? if only",
                "I didn’t realize the Ed Dept was that small, less than 4,000 people? You always hear about how the DoD is 1.3 million civilians and the VA is 435,000. But the entire Ed Dept is 4,000 people? TIL."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Woman pleads guilty in cross-burning hoax during Colorado Springs mayoral campaign",
            "external_url": "https://apnews.com/article/cross-burning-hoax-colorado-springs-black-mayor-41837df8bd251ef5eedf819acc00d696",
            "upvotes": 155,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "'It was just a prank bro.' \n\nHilarious.",
                "> Prosecutors say that after staging the cross burning, a photo and video of it were sent to media and civic organizations making it seem like an attack on Mobolade. [the mayoral candidate]\n\n> According to the plea agreement, the conspiracy’s goal was to interfere in the campaign of Mobolade’s opponent and create the belief that Mobolade was being discouraged from running because of his race. West was dependent on one of the other three people charged, Derrick Bernard, for employment and housing and agreed to participate to curry favor with him, the document said.\n\n> Lawyers for Bernard and the third person charged, Ashley Blackcloud, said in court filings that the government’s evidence shows they were trying to help Mobolade win by generating outrage. They argued that the actions were a kind of political theater, which they say is free speech protected by the First Amendment.\n\n*sigh* \n\nWe all know racism exists in this country, nobody has to pull stunts like this to make it look worse than it is.\n\nArmchair lawyers, what do you think of the \"Free Speech\" defense?",
                "The springs keeping it classy as always",
                "A cross-burning hoax sounds like an excellent use of people's time.",
                "So many of these things end up being hoaxes."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Musk launches appeal to restore $56 billion Tesla payday",
            "external_url": "https://www.reuters.com/business/autos-transportation/musk-launches-appeal-restore-56-billion-tesla-payday-2025-03-11/",
            "upvotes": 14264,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They should ask him to name 5 things he did for the company last week.",
                "\"I would like you to pay me 56 billion dollars while I am actively tanking the company's value\" is an interesting pitch ...",
                "> Musk has said that he wants a greater stake in Tesla or he might develop products outside of the company.   \n   \nAh yes, threatening your own company.",
                "Hey guys I’m gonna need that money before I completely destroy the brand with my evil actions",
                "Has he seen the stock price?",
                "I highly doubt shareholders would support him now if they were to vote on it again. He's lost the shareholders billions.",
                "He should not buy a Tesla unless it’s in Canada and he buys two a minute",
                "Elon, do you little salute again, maybe that will fix things",
                "He admitted that while running Doge, he is running his companies with \"great difficulty\"\n\nWhy would shareholders reward a CEO who is having \"great difficulty\" running their company?",
                "Who would ever think that acting like a nazi oligarch openly on the world stage would put off your customer base of environmentally conscious middle class liberals? "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Scholars stranded in America and abroad amid funding freeze of State Department programs",
            "external_url": "https://apnews.com/article/fulbright-scholars-stipends-frozen-indefinitely-9da042b5e0bda70fb1c76105564c71f4",
            "upvotes": 474,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In less than eight-weeks, Trump has destroyed everything we've fought and died for since the founding of our nation. It's never going to be the same again.",
                "> “It was very scary, I would say, not just because I am lost in another country,” she said. “We don’t know if we will ever get another stipend here, and if they have enough money to buy our tickets home. So there are a lot of things that are not clear and not certain.”\n\n“If these do-gooder scholars are so good and so smart, why are they stranded in bumfuckistan?”\n\n- MAGA, as they cut the legs from underneath aid workers",
                "Why would any country trust us ever again? All that's left to use us, manipulate us. But never trust.",
                "Many young scholars from all over the world apply for and receive Fulbright Scholarships.  They are often totally dependent on the scholarship money for food, rent, etc.  Cut off means stranded.  These students are usually the cream of the cream who could never study or travel abroad without this kind of support. Shame on US!",
                "Scholars? Now you know why the Orange sexual predator loves uneducated people. ",
                "WHOOPS!  It's the Dogebags NOT BATTING A THOUSAND again.  Hurry!  The Republicans are lined up to high-five you.  Dick."
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "NEW",
            "title": "Trump backs off doubling Canadian steel and aluminum tariffs after Ontario suspends electricity surcharge",
            "external_url": "https://www.cbsnews.com/news/trump-tariffs-canada-steel-aluminum/",
            "upvotes": 4207,
            "date": "03/11/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/11/d3dc91bb-a425-42cb-9d30-0ff10eafaa14/thumbnail/1200x630g2/b57462378b668dd5d145a85b2e321fc0/gettyimages-2203227046.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "This is the most farcical trade war ever.",
                "I swear to God this is exhausting. It makes me wish we were back in the pandemic years so I can just make sourdough and not have to hear the word tariff 50x a day.",
                "So he's not running America so much like ***a*** business, as he is running America like [*his* business](https://www.americanbanker.com/news/banking-on-the-donald).",
                "They suspended the surcharge as good faith for the meeting this Thursday. That was not a win for the orange bastard.",
                "His decision making is child-like. Impulsive, personal, ad hoc, transactional. He is a bully who has been handed the reigns of government.",
                "\"Speak loudly and carry a small dick.\" --The Trump Doctrine ",
                "Consistently inconsistent",
                "Sundowning embarrassment",
                "Why the fuck is canada backing off",
                "At least until tomorrow. When he wakes up in his shit filled diaper and decides to tariff  something else because he’s mad."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "NEW",
            "title": "Ontario’s Ford suspends U.S. electric surcharge, says Lutnick agrees to trade talks",
            "external_url": "https://www.cnbc.com/2025/03/11/ontarios-ford-suspends-us-electric-surcharge-says-lutnick-agrees-to-trade-talks.html",
            "upvotes": 2950,
            "date": "03/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108096026-17385018682025-01-31t194302z_882276599_rc25lca555hn_rtrmadp_0_usa-trump-canada-tariffs.jpeg?v=1741720657&w=1920&h=1080",
            "top_comments": [
                "Does anyone else have a headache?",
                "I seen swings sets with less back and forth",
                "I still think it's time to invest in solar and batteries for my house.",
                "I'm seeing some very interesting headlines and reports from Americans to try and control the narrative like this from NBC - [Canada backs down from 25% electricity surcharge after Trump threats](https://www.nbcnews.com/business/economy/trump-canada-doubles-tariffs-national-emergency-electricity-rcna195810)\n\n As a Canadian, let's set the record straight.\n\nWhat really happened was that Canada made Trump blink first. Premier Ford and other Canadian leaders from coast to coast to coast have always asserted that they're willing to negotiate with America. It was America that continued to refuse to negotiate until Canada finally placed reciprocal tariffs and export taxes. \n\nTrump blinked. But American media would have you believe that Canada capitulated. Elbows up! 🇨🇦",
                "Pretty sure it’ll be back to tariffs and trade wars by the end of the week.",
                "I’m so tired of this shit show. Everyone who voted for Trump for economic reasons look real stupid right now",
                "We don't want a trade war, as nice as it would be to stick it to him. If they're willing to negotiate then we should try to avoid this as much as possible.\n\nBut our electricity surcharge can be reinstated at any time. If they try and do what they did to Zelenskyy, don't be surprised to see the surcharge back.",
                "I’m fucking tired of all the big talk and no one actually having the balls to do anything. Fucking EXHAUSTED ",
                "Did he not just say on TV all over the place that the tariffs would stay until the US removes its tariffs on Canadian products period.\nFord just did the same thing President Krasnov has been doing 😵‍💫",
                "It is the same fucking political pissing contest we have witnessed in the past 8 years in the US between R's and D's. Now it is being spread to the rest of the world. This shit is so exhausting and every single politician involved should be embarrassed.  I can tell ya one thing if I did my job as shitty as they do I would have been fired on the 2nd day."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "DOJ official says she was fired after opposing the restoration of Mel Gibson's gun rights",
            "external_url": "https://www.nbcnews.com/politics/justice-department/doj-official-says-was-fired-opposing-restoration-mel-gibsons-gun-right-rcna195287",
            "upvotes": 1987,
            "date": "03/11/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250310-mel-gibson-2017-ac-1159p-48e9a8.jpg",
            "top_comments": [
                "Mel Gibson ruined Mel Gibson movies for me, the cunt",
                "This is also the administration that is going after colleges for supposed anti-semitism",
                "Trump is weaponizing government power and having a persons livelihood taken away to give guns back to a piece of shit racist that 100% committed domestic violence…\n\nMel Gibson beat the shit out of his ex and her young daughter. There are photos, voice recordings, broken teeth, and massive bruises to prove it.\n\nAll that said Mel Gibson is also a total racist that hates people of color and especially Jews. \n\nHere’s a great quote/excerpt from a voicemail he left his ex btw.\n\n“You go out in public and it’s a f***ing embarrassment to me. You look like a f***ing b**** on heat and if you get raped by a pack of n***ers it will be your fault.”",
                "A raging alcoholic with a gun.\n\n\nGod bless America ",
                "Well that’s extremely concerning and fucked up. They specifically stated that their superior had mentioned Mel Gibson was friends with Trump and that’s why this is happening. \n\nAbsolutely fucked up beyond belief.",
                "Mel Gibson is a fucking whacko. ",
                "Is Mel Gibson going to kill somebody?",
                "Mel Gibson should be banned from polite society. I’ll never forget the recordings with his girlfriend. Some media tried to paint him as a victim, too.",
                "So much for Trump trying to fight “antisemitism”",
                "Having a personal relationship with a 34 times convicted criminal, who defrauded a childrens cancer charity and brags about sexually assaulting women should be a sufficient basis to deny the recommendation "
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "NEW",
            "title": "USDA cuts more than $1bn in local food purchases for schools, food banks",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/11/usda-cuts-food-banks-schools",
            "upvotes": 2964,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f7d65400d1ba74235801ee05719cb624494f599d/0_433_7726_4638/master/7726.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4ffb661736c0d25470ff69c089150c88",
            "top_comments": [
                "Because the kids aren't the priority anymore. Duh!",
                "What's that quote I see going around, \"Republicans will deny food for 100 people out of concern 1 may not actually need it.\"",
                "Remember that the food being purchased isn't some foreign food. It's US food that was being purchased. US farmers/ranchers/etc will lose income over this.",
                "From the article:\n\n\nMillions of children could lose free school meals as food costs rise, warns School Nutrition Association president\n\n\nAbout $660m of those funds were contained in the Local Food for Schools Cooperative Agreement Program, which provided funds to schools and child care facilities but is now being eliminated.\n\n\nMeanwhile, short-staffed school nutrition teams, striving to improve menus and expand scratch-cooking, would be saddled with time-consuming and costly paperwork created by new government inefficiencies.”",
                "I just saw this. Feeding kids is \"woke\" now\n\n\nhttps://www.reddit.com/r/facepalm/comments/1i88jud/woke_is_giving_food_to_low_income_people/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button",
                "So, it’s now “Farmers, nevermind…we were kidding. No fun for you” or anyone else. ",
                "Every day I am more horrified than the day before. Half of me wants to stop being on the Internet outright, and the other half wants to keep reading to know what hell I need to prepare for.",
                "And that money is going back to tax payers?\n\nOh wait, the GOP plans on adding $4 trillion more to the debt to pay for tax cuts for those making over $350K a year. \n\nWhy do millionaires and billionaires need these handouts, but school kids do not??",
                "This isn't just for the children, \n\nThese programs are also an important subsidy for US food producers. Just what they need now that everybody is putting tariffs against American goods.",
                "Are we great again yet?"
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "NEW",
            "title": "Tornado crosses over local TV station in Central Florida during a live broadcast",
            "external_url": "https://www.denver7.com/weather/tornado-crosses-over-local-tv-station-in-central-florida-during-a-live-broadcast",
            "upvotes": 110,
            "date": "03/11/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/61ce8ca/2147483647/strip/true/crop/2098x1101+0+165/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fbe%2F59%2Febdd8e534cbaa4c2341fb24dc9d5%2Fscreenshot-2025-03-11-at-9-07-17-am.png",
            "top_comments": [
                "EF2 hit Orlando. No injuries were reported at the station. Some nearby homes were damaged.",
                "How perfect that it's a Fox affiliate. \n\nI grew up in tornado country, and to this day I remember one of the tornado safety videos they made us watch in grade school. Some guy has a camcorder and is filming as his entire family stands in front of a glass sliding door looking out onto a lake. You can see the tornado only a few houses down, and the guy just calmly says, \"There goes Bob's boat!\" Still cracks me up all these years later.",
                "Even the weather hates florida's guts.",
                "Somehow I read that as Toronto and was impressed",
                "Let me guess-- it took the community totally by surprise, but this is now being used to demonstrate we don't actually need a weather service."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "West Texas measles outbreak spreads into Oklahoma",
            "external_url": "https://www.nbcnews.com/health/health-news/west-texas-measles-outbreak-spreads-oklahoma-rcna195858",
            "upvotes": 763,
            "date": "03/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250311-measles-ch-1302-700353.jpg",
            "top_comments": [
                "Goddamn you, you goddamn idiots.",
                "Very sad and preventable. \n\nEven if you survive, you can still end up with scarring on your lungs and all sorts of other complications years down the line. ",
                "Don't worry, brain worm boy has a crack solution.\n\nAnd yes that is 100% /s.",
                "Team Measles is on a tear 😕",
                "God sends another plague on Trump's America because Evangelicals didn't get the point the first time.",
                "This is not going away by itself now, even if you vaccinate like crazy",
                "Scary time to be pregnant, thankfully my baby will be out soon. My dad was made deaf from his mom having measles while pregnant.",
                "Oklahoma??? You mean:\n\n- 44th in Education?\n- 49th in Healthcare?\n- 44th in Life Quality?\n- 50th in Test Scores?\n- top ten worst in poverty?\n\nThat Oklahoma? Boy, am I shocked!",
                "Anti-vaxxers are all fucking idiots. I can tell you from experience that there is absolutely nothing you can say to get them to see sense. I have an aunt who is anti-vax, and she always says in the face of facts, \"agree to disagree.\" I'm not sure that they'd change their stance even if one of their kids died. \n\nIt's not fair for the kids, since they didn't exactly choose to be born to total morons. Although unfortunately, the apple doesn't always fall far from the tree. My aunt had two daughters, and my cousins are as vapid as their mother. One of my cousins also has two daughters, and they're also not vaccinated. I just hope that they grow up to be better than their mom and grandma. The whole family is just lucky that they've only encountered mild cases of measles, and they're super lucky that we've managed to eliminate more serious illnesses such as polio and smallpox before my cousins were even born. The former is still out there in the world. It may be unlikely for it to come back to the US, but it isn't impossible.",
                "Man, I hope that shit doesn't mutate into a variant that ignores the vaccines we got as kids."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Department of Education lays off nearly 50% of its workforce",
            "external_url": "https://abcnews.go.com/US/department-education-faces-50-layoffs-after-closure-notice/story?id=119690524&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 17277,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/63d5aa42-9003-48c5-b937-5f4e3fa8c88f/dept-education-1-epa-gmh-250311_1741707004175_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Woman who's never worked in education and enrolled her own kids in private schools has strong feelings on how little funding should go to programs helping special needs students.",
                "As a disabled person that benefited from DoE policy to get my high school and college diplomas I worry for the younger generation that will lose access.",
                "Everything Trump is doing weakens America, and hurts Americans.",
                "\"Six communications offices are going to be consolidated, they explained, and leases will end in major cities including San Francisco, New York, Cleveland, Boston, Chicago and Dallas.\"\n\nSeem a little targeted to anyone else?",
                "This is the kind of thing that should set off alarm bells, but somehow it just feels like another day in the slow dismantling of public services. Cutting nearly half a department overnight, with barely a warning, is not streamlining, it is sabotage. Even if you believe the Department of Education is bloated, you do not fix a system by gutting it in a way that leaves staff terrified and scrambling. \n\nPeople do not work well under fear, and a government that rules through uncertainty is more interested in control than competence. The bigger question is what comes next. If this is just the warm-up act for dismantling the department altogether, what does that mean for the millions of students and families who rely on federal education programmes? Anyone cheering this move might want to ask themselves whether they trust their local politicians to handle education funding fairly and effectively because that is where this is headed.",
                "2024 Election exit data polling shows the higher level of education someone achieves, the more likely they are to vote Democratic. Those without a college degree are most likely to vote Republican\n\n[Source](https://www.nbcnews.com/politics/2024-elections/exit-polls)\n\nIf you check this [source](https://en.wikipedia.org/wiki/List_of_U.S._states_and_territories_by_educational_attainment) and sort by states based on percent of people who have a bachelors or higher, the top 10 are blue states and the bottom ten are red states.\n\nTrump said \"I love the uneducated\" because they are his base. Attacks on education are purposeful.",
                "I hate how the worst possible news reports don't even get a sigh out of me anymore. Not that I'm accepting this as normal, but at this point my reaction to this headline is just 'of course it is'.",
                "Being in college right now is weird. Not a lot of political discussions allowed/welcome in the classrooms. Instead of organizing (maybe out of fear) everyone is in self preservation mode due to midterms. This news doesn’t make it easy to lock in on my own studying.",
                "So this means that I don’t owe any of my student loans and they’re all forgiven since no one is gonna keep a check on them? if only",
                "I didn’t realize the Ed Dept was that small, less than 4,000 people? You always hear about how the DoD is 1.3 million civilians and the VA is 435,000. But the entire Ed Dept is 4,000 people? TIL."
            ],
            "aggregate_sentiment": 26.0
        },
        {
            "category": "RISING",
            "title": "Trump backs off doubling Canadian steel and aluminum tariffs after Ontario suspends electricity surcharge",
            "external_url": "https://www.cbsnews.com/news/trump-tariffs-canada-steel-aluminum/",
            "upvotes": 4208,
            "date": "03/11/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/11/d3dc91bb-a425-42cb-9d30-0ff10eafaa14/thumbnail/1200x630g2/b57462378b668dd5d145a85b2e321fc0/gettyimages-2203227046.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "This is the most farcical trade war ever.",
                "I swear to God this is exhausting. It makes me wish we were back in the pandemic years so I can just make sourdough and not have to hear the word tariff 50x a day.",
                "So he's not running America so much like ***a*** business, as he is running America like [*his* business](https://www.americanbanker.com/news/banking-on-the-donald).",
                "They suspended the surcharge as good faith for the meeting this Thursday. That was not a win for the orange bastard.",
                "His decision making is child-like. Impulsive, personal, ad hoc, transactional. He is a bully who has been handed the reigns of government.",
                "\"Speak loudly and carry a small dick.\" --The Trump Doctrine ",
                "Consistently inconsistent",
                "Sundowning embarrassment",
                "Why the fuck is canada backing off",
                "At least until tomorrow. When he wakes up in his shit filled diaper and decides to tariff  something else because he’s mad."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Scholars stranded in America and abroad amid funding freeze of State Department programs",
            "external_url": "https://apnews.com/article/fulbright-scholars-stipends-frozen-indefinitely-9da042b5e0bda70fb1c76105564c71f4",
            "upvotes": 475,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In less than eight-weeks, Trump has destroyed everything we've fought and died for since the founding of our nation. It's never going to be the same again.",
                "> “It was very scary, I would say, not just because I am lost in another country,” she said. “We don’t know if we will ever get another stipend here, and if they have enough money to buy our tickets home. So there are a lot of things that are not clear and not certain.”\n\n“If these do-gooder scholars are so good and so smart, why are they stranded in bumfuckistan?”\n\n- MAGA, as they cut the legs from underneath aid workers",
                "Why would any country trust us ever again? All that's left to use us, manipulate us. But never trust.",
                "Many young scholars from all over the world apply for and receive Fulbright Scholarships.  They are often totally dependent on the scholarship money for food, rent, etc.  Cut off means stranded.  These students are usually the cream of the cream who could never study or travel abroad without this kind of support. Shame on US!",
                "Scholars? Now you know why the Orange sexual predator loves uneducated people. ",
                "WHOOPS!  It's the Dogebags NOT BATTING A THOUSAND again.  Hurry!  The Republicans are lined up to high-five you.  Dick."
            ],
            "aggregate_sentiment": 10.0
        },
        {
            "category": "RISING",
            "title": "DOJ official says she was fired after opposing the restoration of Mel Gibson's gun rights",
            "external_url": "https://www.nbcnews.com/politics/justice-department/doj-official-says-was-fired-opposing-restoration-mel-gibsons-gun-right-rcna195287",
            "upvotes": 1986,
            "date": "03/11/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250310-mel-gibson-2017-ac-1159p-48e9a8.jpg",
            "top_comments": [
                "Mel Gibson ruined Mel Gibson movies for me, the cunt",
                "This is also the administration that is going after colleges for supposed anti-semitism",
                "Trump is weaponizing government power and having a persons livelihood taken away to give guns back to a piece of shit racist that 100% committed domestic violence…\n\nMel Gibson beat the shit out of his ex and her young daughter. There are photos, voice recordings, broken teeth, and massive bruises to prove it.\n\nAll that said Mel Gibson is also a total racist that hates people of color and especially Jews. \n\nHere’s a great quote/excerpt from a voicemail he left his ex btw.\n\n“You go out in public and it’s a f***ing embarrassment to me. You look like a f***ing b**** on heat and if you get raped by a pack of n***ers it will be your fault.”",
                "A raging alcoholic with a gun.\n\n\nGod bless America ",
                "Well that’s extremely concerning and fucked up. They specifically stated that their superior had mentioned Mel Gibson was friends with Trump and that’s why this is happening. \n\nAbsolutely fucked up beyond belief.",
                "Mel Gibson is a fucking whacko. ",
                "Is Mel Gibson going to kill somebody?",
                "Mel Gibson should be banned from polite society. I’ll never forget the recordings with his girlfriend. Some media tried to paint him as a victim, too.",
                "So much for Trump trying to fight “antisemitism”",
                "Having a personal relationship with a 34 times convicted criminal, who defrauded a childrens cancer charity and brags about sexually assaulting women should be a sufficient basis to deny the recommendation "
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "USDA cuts more than $1bn in local food purchases for schools, food banks",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/11/usda-cuts-food-banks-schools",
            "upvotes": 2966,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f7d65400d1ba74235801ee05719cb624494f599d/0_433_7726_4638/master/7726.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4ffb661736c0d25470ff69c089150c88",
            "top_comments": [
                "Because the kids aren't the priority anymore. Duh!",
                "What's that quote I see going around, \"Republicans will deny food for 100 people out of concern 1 may not actually need it.\"",
                "Remember that the food being purchased isn't some foreign food. It's US food that was being purchased. US farmers/ranchers/etc will lose income over this.",
                "From the article:\n\n\nMillions of children could lose free school meals as food costs rise, warns School Nutrition Association president\n\n\nAbout $660m of those funds were contained in the Local Food for Schools Cooperative Agreement Program, which provided funds to schools and child care facilities but is now being eliminated.\n\n\nMeanwhile, short-staffed school nutrition teams, striving to improve menus and expand scratch-cooking, would be saddled with time-consuming and costly paperwork created by new government inefficiencies.”",
                "I just saw this. Feeding kids is \"woke\" now\n\n\nhttps://www.reddit.com/r/facepalm/comments/1i88jud/woke_is_giving_food_to_low_income_people/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button",
                "So, it’s now “Farmers, nevermind…we were kidding. No fun for you” or anyone else. ",
                "Every day I am more horrified than the day before. Half of me wants to stop being on the Internet outright, and the other half wants to keep reading to know what hell I need to prepare for.",
                "And that money is going back to tax payers?\n\nOh wait, the GOP plans on adding $4 trillion more to the debt to pay for tax cuts for those making over $350K a year. \n\nWhy do millionaires and billionaires need these handouts, but school kids do not??",
                "This isn't just for the children, \n\nThese programs are also an important subsidy for US food producers. Just what they need now that everybody is putting tariffs against American goods.",
                "Are we great again yet?"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Musk launches appeal to restore $56 billion Tesla payday",
            "external_url": "https://www.reuters.com/business/autos-transportation/musk-launches-appeal-restore-56-billion-tesla-payday-2025-03-11/",
            "upvotes": 14270,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They should ask him to name 5 things he did for the company last week.",
                "\"I would like you to pay me 56 billion dollars while I am actively tanking the company's value\" is an interesting pitch ...",
                "> Musk has said that he wants a greater stake in Tesla or he might develop products outside of the company.   \n   \nAh yes, threatening your own company.",
                "Hey guys I’m gonna need that money before I completely destroy the brand with my evil actions",
                "Has he seen the stock price?",
                "I highly doubt shareholders would support him now if they were to vote on it again. He's lost the shareholders billions.",
                "He should not buy a Tesla unless it’s in Canada and he buys two a minute",
                "Elon, do you little salute again, maybe that will fix things",
                "He admitted that while running Doge, he is running his companies with \"great difficulty\"\n\nWhy would shareholders reward a CEO who is having \"great difficulty\" running their company?",
                "Who would ever think that acting like a nazi oligarch openly on the world stage would put off your customer base of environmentally conscious middle class liberals? "
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "RISING",
            "title": "Jury awards $120 million to two men wrongfully convicted of 2003 murder",
            "external_url": "https://www.cbsnews.com/chicago/news/wrongful-conviction-verdict-jury-120-million-john-fulton-anthony-mitchell/",
            "upvotes": 1082,
            "date": "03/11/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/11/73a21bee-9577-4457-8634-883a83f21fbd/thumbnail/1200x630/bc133372ad8a38311f08b0446e79eacb/screenshot-2025-03-11-095924.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "thats paid for with tax dollars. when civilians get sued, their own wages and/or property(s) are subject to  payment. why do civilians also have to pay for police fuck ups?",
                "Statement that supposedly pro law and order people love to make mockly: \"There are no guilty people in prison\".\n\n\nSo much of the Innocence Projects has shown that there are a lot of innocent people in prison. ",
                "They really need to start connecting these payments to the pension funds of both police and local prosecutions: Perhaps there'd be far less coercion and tampering with evidence if there actually existed some consequences for doing so.",
                "If y’all are interested, a person who was on the jury for this case did an AMA a little while ago on r/ama",
                "*John Fulton and Anthony Mitchell both spent more than 16 years in prison before their convictions were overturned in 2019, and prosecutors wound up dropping all charges against them in the murder of 18-year-old Christopher Collazo.*\n\nWhat happened in 2003 was not racist enough; now the city of Chicago is appealing the Federal Courts finding of 120m award for the mistaken convictions/imprisonment",
                "they are in their early 30s now. Hope they can enjoy the rest of their lives in peace",
                "Dont spend it all in one place",
                "Tbh for that amount in 20 years, lock me up please "
            ],
            "aggregate_sentiment": 25.0
        },
        {
            "category": "RISING",
            "title": "US to immediately restore intelligence sharing and 'security assistance' to Ukraine",
            "external_url": "https://www.bbc.com/news/live/c51ypekv9xwt",
            "upvotes": 21238,
            "date": "03/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c309/live/60583a00-fec2-11ef-b50e-9d086302645f.jpg",
            "top_comments": [
                ">Marco Rubio is asked if they are accepting any good-will gestures from Russia or if there is a deadline.\n\n\n>Rubio says \"Ukraine is ready to stop shooting and start talking.\"\n\n\n>He reiterates that he hopes Russia will say yes to the ceasefire, but if they say no \"then we'll unfortunately know what the impediment is to peace here\".\n\n\nIf you didn't already know that the impediment to peace is the guy who started the invasion............",
                "Forgot to add asterisk*, *with terms and conditions applied.*",
                "So he basically got hundreds of Ukrainians killed for nothing",
                "[removed]",
                "I don't believe it and any \"assistance\" will likely help Russia.",
                "I feel like Trump is running this country like a 13 yr old. He hates you today and likes you the next. Nobody signed up for this shitty roller coaster ride.",
                "So the deal with the Russians was that Trump would pause intelligence sharing to give them an advantage in Kursk? Well done, Trump!",
                "I would not be trusting any US intel if I was Ukraine ",
                "Oh, is he thankful enough now? Was his shirt nicer? Did X have hiccups for reasons other than Ukraine?\n\nWe’ll see in 3 days when the administration throws them under the bus again.",
                "I wouldn't trust the Trump regime to give usable Intel anymore. I would expect them to give our allies shoddy/wrong Intel in the hopes of sabotaging their efforts. I would also expect the Trump terrorists to give our Allies information to Putin as soon as they get it. Republicans cannot be trusted in this world because of the evil they inflict on humanity."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Ontario’s Ford suspends U.S. electric surcharge, says Lutnick agrees to trade talks",
            "external_url": "https://www.cnbc.com/2025/03/11/ontarios-ford-suspends-us-electric-surcharge-says-lutnick-agrees-to-trade-talks.html",
            "upvotes": 2946,
            "date": "03/11/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108096026-17385018682025-01-31t194302z_882276599_rc25lca555hn_rtrmadp_0_usa-trump-canada-tariffs.jpeg?v=1741720657&w=1920&h=1080",
            "top_comments": [
                "Does anyone else have a headache?",
                "I seen swings sets with less back and forth",
                "I still think it's time to invest in solar and batteries for my house.",
                "I'm seeing some very interesting headlines and reports from Americans to try and control the narrative like this from NBC - [Canada backs down from 25% electricity surcharge after Trump threats](https://www.nbcnews.com/business/economy/trump-canada-doubles-tariffs-national-emergency-electricity-rcna195810)\n\n As a Canadian, let's set the record straight.\n\nWhat really happened was that Canada made Trump blink first. Premier Ford and other Canadian leaders from coast to coast to coast have always asserted that they're willing to negotiate with America. It was America that continued to refuse to negotiate until Canada finally placed reciprocal tariffs and export taxes. \n\nTrump blinked. But American media would have you believe that Canada capitulated. Elbows up! 🇨🇦",
                "Pretty sure it’ll be back to tariffs and trade wars by the end of the week.",
                "I’m so tired of this shit show. Everyone who voted for Trump for economic reasons look real stupid right now",
                "We don't want a trade war, as nice as it would be to stick it to him. If they're willing to negotiate then we should try to avoid this as much as possible.\n\nBut our electricity surcharge can be reinstated at any time. If they try and do what they did to Zelenskyy, don't be surprised to see the surcharge back.",
                "I’m fucking tired of all the big talk and no one actually having the balls to do anything. Fucking EXHAUSTED ",
                "Did he not just say on TV all over the place that the tariffs would stay until the US removes its tariffs on Canadian products period.\nFord just did the same thing President Krasnov has been doing 😵‍💫",
                "It is the same fucking political pissing contest we have witnessed in the past 8 years in the US between R's and D's. Now it is being spread to the rest of the world. This shit is so exhausting and every single politician involved should be embarrassed.  I can tell ya one thing if I did my job as shitty as they do I would have been fired on the 2nd day."
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "03/12/2025 04:26:48 UTC"
}