{
    "posts": [
        {
            "category": "HOT",
            "title": "Tornado warnings delayed because of DOGE cuts",
            "external_url": "https://www.mesoscalenews.com/p/tornado-warnings-delayed-because",
            "upvotes": 22722,
            "date": "05/19/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbf1204d0-dd21-493d-b55a-0394aebc6880_1800x2250.jpeg",
            "top_comments": [
                "But think of the money nobody saved.",
                "Watched a YouTuber stream these and he questioned at times why tornado warnings were not being issued…oof.",
                "It’s worse than just warnings (which is awful to be clear). \n\n[Weather balloon cuts](https://www.axios.com/2025/03/21/nws-layoffs-cuts-weather-balloons-forecasts) are also ongoing. \n\nWhat do weather balloons do? They give critical live data as they ascend through the atmosphere. What does that tell us, why should I care what the wind speed or temperature is 18,000 feet up? \n\nBecause that feeds *directly* into weather models that are used to predict these kinds of events. \n\nSo they’re *literally* making our forecasts harder and shittier.",
                "And I had someone telling today “There’s an app! And it’s automatically updated you don’t need those employees! The people who died just didn’t check the app!”",
                "That's just good business right there! The national weather service costs every taxpayer roughly $4 a year. Thanks to the heroes at DOGE, that number will surely come down to something more palatable, and all it's costing us are people's lives and livelihoods! Truly the art of the deal!\n\n/s in case it wasn't obvious",
                "That's the point. Reduce the trust people have in national services so they practically *beg* them to be privatized.\n\nAlso, NOAA had the nerve to call trump out over the hurricane. And that's some shit he just won't let stand.",
                "Reminder that part of P2025 was making the weather information that the government provides for free privatized. They want that information to be provided to companies for free so those companies can turn around and offer it as a paid service. \n\nPeople would not receive alerts for dangerous weather anymore unless they paid for it.",
                "Trump's American Bloodbath is underway.",
                "27 lives that may have been saved if they had more warning.",
                "**Key facts before the politics start flying:**\n\n* **What happened** – A nocturnal tornado outbreak late 17 May killed at least 27 people across Kentucky and Missouri (18 of them in Laurel County, KY). Radar‐based debris signatures appeared before midnight, but the first *official* warnings for parts of the path weren’t pushed until minutes after circulation was already on the ground.\n\n* **Why the gap matters** – For night-time storms you’re asleep until a phone alert blares. Even a 5- to 10-minute lag can be the difference between getting to a basement and dying in bed.\n\n* **Staffing reality** – The Jackson, KY forecast office that covers Laurel County has been running 31 % below its authorised staffing since DOGE-mandated cuts early this year. The overnight forecaster position—whose only job is to watch radar while everyone else sleeps—was eliminated in April. Nearly half of NWS offices now have 20 %+ vacancy rates, according to an Associated Press analysis.\n\n* **Warnings on the night** – Because the office can’t staff 24/7 anymore, an on-call meteorologist had to remote-log-in when rotation ramped up. That start-up window accounts for the delay you see in the warning logs.\n\n* **Experts warned this would happen** – Meteorologists and the employees’ union flagged the risk in February; The NY Times, PBS, and WaPo all ran pieces in the past month on how the same budget axe was forcing eight forecast offices—including Jackson—to drop round-the-clock coverage.\n\n**TL;DR**\n\nThe science isn’t broken; the funding pipeline is. Cut the people who keep eyes on radar at 11 p.m. and you buy tragedy at midnight."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Biden diagnosed with ‘aggressive form’ of prostate cancer",
            "external_url": "https://www.cnn.com/2025/05/18/politics/joe-biden-prostate-cancer",
            "upvotes": 49975,
            "date": "05/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2193208062.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Former US president Joe Biden has been diagnosed with prostate cancer, a statement from his office said on Sunday.\n\n>Biden, 82, was diagnosed on Friday after he saw a doctor last week for urinary symptoms.\n\n>The cancer is characterised by a Gleason score of 9 with metastasis to the bone, his office said, meaning it is a more aggressive form of the disease.\n\n>Biden and his family are said to be reviewing treatment options, the statement said. The former president's office added that the cancer is hormone-sensitive, meaning it can likely be managed.\n\n>This is a developing story.\n\n>This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version.\n\n/saved you a click. Sad news.",
                "As someone who has had a father and a grandfather who were both diagnosed with early onset prostate cancer, my heart goes out to Biden and his family. A Gleason 9 score with bone involvement is not good news. \n\nProstate cancer typically is very slow growing and easily catchable in the early stages. However, every now and then there are some really nasty aggressive forms. Unfortunately, it sounds like the former president might be dealing with the latter. I’ll be praying for him.",
                "‪Fuck prostate cancer. Lost my dad and so many other family members to it. Regardless of your politics, don’t wish cancer on anyone. Prayers up Mr. President. ‬ may we one day have a cure for this awful disease.",
                "Biden has viewed cancer as one of the most important changes he can make in his position for the past decade. His experience with losing Beau clearly made it a health policy focus, and it’s reflected in the research programs he helped establish and re-establish through the Cancer Moonshot effort. \n\nI hope he has the opportunity to benefit from the care he helped enable.",
                "Fuck cancer.  I lost my mom to it and I would give my own life to have taken away the pain and degeneration she faced in her final year.  \n\nI hope for the best for Biden and his treatment, and my heart goes out to the whole Biden family.",
                "Seems like the writing’s on the wall and wish we could skip the shitshow that’ll inevitably ensue",
                "I'm still recovering from having my prostate removed last Wednesday, due to prostate cancer with the score of Gleason 7.  I'm still in that awful period where I have to wear a catheter. I just got the pathology results that showed the surgeon got it all and hopefully there  should be none remaining in the body. Best day of my life. Biden's Gleason 9 is a pretty poor diagnosis. I wish him well and a positive result.",
                "That’s rough. Absolutely fuck cancer.",
                "The hate on FoxNews page is absolutely horrible.\n\nThe nicest comment was something along the lines of, \"horrible president, don't wish this on him, but he might deserve it.\"\n\nThe fuck is wrong with these people.",
                "How long until Trump says something awful about it?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Primary school evacuated after student brings in a grenade for show and tell",
            "external_url": "https://www.the-independent.com/news/uk/home-news/grenade-osmaston-school-evacuation-derbyshire-b2752851.html",
            "upvotes": 3753,
            "date": "05/19/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/17/10/00/iStock-1018660080.jpeg?trim=83,0,83,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                ">“It was quite an eventful assembly,” said Mrs Hart. “It was going fine and there was a boy who brought an old bullet case in, which I knew about, but then his friend produced a hand grenade from his pocket. That, I was not expecting.”\n\nPoor kid who brought in the bullet case must have been feeling so good thinking, *\"What a badass I am\"* before his friend followed it up with the grenade. Crushing.",
                "Brick where did you get a hand grenade?",
                "Someone in my class brought one in in middle school. It was defused but a real grenade. The teacher played a prank by rolling into the other classroom right up to the other teachers feet. Everyone laughed and I went home that day. This was pre-9/11 or columbine.",
                "Better to learn now than on the streets",
                "I remember bringing in a Hamilton Model 27 .22 caliber boys rifle to school for my son to use for a show and tell.\n\nI called the principal to see if I needed to case it up when I brought it in, and he said, \"Nope, just stop at the office.\"\n\n1990, obviously. \n\nFast forward to now, his autistic son made a comment about shooting  an Uzi and now has to be searched every morning before school, while escorted by his father.\n\nI get it, but he has trouble sometimes with impulsive talk.\n\nHe is 11, and I feel bad for him.",
                "Article completely left the most important part out: Did he count to three, no more, no less?",
                "I almost did this as a kid. It was a much simpler time back then.",
                "Say what you will but if the goal of show and tell is to share your story then I'd say this kid blew the assignment out of the water. I'm honored and confused to learn about his family's heirloom grenade.",
                "I remember when one of my redneck school mates opened his locker and a bunch of 22. Rounds fell out. This was way before shootings were prevalent. Back in the day high school kids could bring their hunting rifles if they kept them locked in their cars.",
                "My dad was the town GP and did a lot of housecalls. According to staff at the local clinic, he was the first and last person a lot of people in town ever saw. \n\nHe had a box in the garage filled with all kind of stuff that he'd taken out of his medicine bag. Expired medicine, gadgets gifted by medical reps, equipment he didn't need at the moment, you name it.\n\nAs a kid, the box fascinated me. One morning, I remembered that I needed to bring something to school for show-and-tell and decided to take something from the box. Without telling my parents.\n\nMom was called in to come get the speculum I'd chosen. Dad found it hilarious. Mom was not impressed. \n\n(We'd later raid his bag and use the surgical tubing in our slingshots. We could shoot a glass marble through an empty oil can with those. It's a miracle we didn't maim anyone. )"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "South Florida woman facing $1.8 million ICE fine speaks out: \"Please have mercy\" - CBS Miami",
            "external_url": "https://www.cbsnews.com/miami/news/south-florida-woman-facing-1-8-million-immigration-fine-speaks-out-please-have-mercy/",
            "upvotes": 644,
            "date": "05/19/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/17/2d9b8a3e-78b0-411e-8576-4a4074697124/thumbnail/1200x630/ed232a3a2a15950b21749c2bd81d68b5/1800-ivan-miami-springs-ice-fine-pkg-5-16-25.jpg?v=6df9366690ed146f169dd0670c453f91",
            "top_comments": [
                "1.8 million? \n\nHow is that not a cruel and unusual fine?",
                "[removed]",
                "People like this are the vast majority of those trump wants to deport.  Decent human beings raising a family and contributing more to America than the entire trump family ever could. \n\nYes, he'll deport a few criminals.  He'll also deport citizens he'll claim are criminals.  In the long run he'll end up losing what greatness America ever had.",
                "She looks like one of those drug cartel, murdering, rapist, worst of the worst types we got invaded by for sure. /s",
                "She had a deportation order from 2005. 2005! What the hell is she still doing here?\n\nWhy do we just send people a note saying “alright, you have to leave” and just not follow through for 20 years?",
                "Biden and the Democrats should’ve done more to prepare for these types of attacks on immigrants. The thing is, democrats aren’t tough enough to fight back against republicans. As history shows, liberals do not effectively combat fascism because they themselves are comfortable with the status quo. They constantly accept concessions.\n\nEven now, democrats aren’t fighting back.",
                "She must’ve been out here selling ice cubes like they were diamonds."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Oklahoma high schools to teach 2020 election conspiracy theories as fact",
            "external_url": "https://www.theguardian.com/us-news/2025/may/17/oklahoma-high-schools-election-conspiracy-theories",
            "upvotes": 35269,
            "date": "05/18/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/16b2b84aeae19cad575afd8829f50cd8f82c7f2d/271_0_3118_2494/master/3118.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=968bba047d85bc933cf6b80361ca1617",
            "top_comments": [
                "Their idea is to radicalize an entire generation.",
                "Big move from the “schools are indoctrinating our kids!” crowd",
                "they have to defend their position, ranked - 49th out of 50.  another sickening waste.",
                "Reminds me of a college course I took, where a segment of that class covered \"Unlearning what I learned in school.\" And it was things like, the truth about Christopher Columbus.\n\nThese Oklahoma kids are going to need a whole semester dedicated to \"Unlearning what I learned in school.\" Going line by line of everything they learned and how it was debunked.\n\nIronically, MAGA will cry \"indoctrination\" but that's exactly what is going on in high school. Indoctrinating kids with a history of debunked theories taught as historical facts. Why? Because this guy wants to promote himself in the MAGA circle. Get to a higher level of the MAGA grift.",
                "They've been writing their own history based on their 'alternative facts' this whole time. It is wild watching the victors revise and rewrite history in real time to suit their twisted agenda.\n\nThe kids already can't read as it is. This isn't the first bullshit Oklahoma wants to ram into children's minds. They're on about creationism and the ten commandments there, too. No wonder their education consistently ranks at or near the bottom of nearly every single metric conducted by nearly every single study.",
                "From the state that tried to require the Trump bible in every school?  Shouldn’t shock anyone.  Crazy and infuriating time period we live in.",
                "Colleges shouldn’t accept their diplomas.",
                ">As part of his revisions, Walters also proposed removing education about Black Lives Matter and George Floyd’s murder, Tulsa’s NBC affiliate KJRH\n\nI hate this timeline",
                "I can’t imagine being so butthurt about a politician, one who couldn’t care less about Oklahoma, losing an election that it would ever even occur to me to make up a rigged election story, much less mandate the fantasy into educational curriculum. MAGA insecurity is a hell of a drug.",
                "Ranked #49/50 for a reason!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "FBI says suspect in US fertility clinic blast had 'nihilistic ideations'",
            "external_url": "https://www.bbc.com/news/articles/c787j90wp6po",
            "upvotes": 6941,
            "date": "05/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3c77/live/d21852f0-33fc-11f0-9fcc-0f444dbba5ff.jpg",
            "top_comments": [
                "> The FBI said they believe he is the sole fatality in the incident.\n\n\nGreat news.",
                "We believe in nothing, Lebowski. Nothing. And tomorrow we come back and we cut off your chonson",
                "[removed]",
                "Based on what I’ve read, he was allegedly an antinatalist, so this will be a very different scenario from what a lot were first hypothesizing.",
                "Not sure they understand the words they're using there.\n\nA nihilist wouldn't be all that concerned with whether or not people have kids since nothing matters anyway",
                "“the suspect used a 2010 silver Ford Fusion sedan”\n\nIt was a fusion bomb!",
                "[removed]",
                "Man looking at these comments I would assume most of these are bots but even bots aren’t this stupid.",
                "This aggression will not stand.",
                "Call it what it is, a terrorist attack. Not a blast."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "7 escaped New Orleans jail inmates still at large as search enters third day",
            "external_url": "https://www.cbsnews.com/news/new-orleans-inmates-escape-update/",
            "upvotes": 2284,
            "date": "05/18/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/18/003c47cd-37f8-4812-b3e3-a6142740696a/thumbnail/1200x630/cea96c2976cdaa498e8a9fae08680039/image.png?v=6df9366690ed146f169dd0670c453f91",
            "top_comments": [
                "Update:\n\nhttps://www.wdsu.com/article/new-orleans-jail-inmate-escape-lockdown/64793237\n\nhttps://kpel965.com/louisiana-authorities-under-fire-orleans-parish-jail-escape/\n\nSheriff Susan Hutson believes those who escaped received help from individuals inside the Orleans Parish Sheriff’s Office. Hutson said the inmates would have needed a tool that they couldn't access to dig the hole in the wall of the cell.",
                "Have they tried looking outside the prison yet?",
                "How dumb do you have to be to go out in public after an escape? And not only in public but the tourist hotspot in your area?? \n\nAt least hide out at a home somewhere for a few months till the trail goes cold!",
                "Most recent video showing two of them wearing new clothes.\n\nhttps://www.wdsu.com/article/new-video-two-escaped-inmates-in-french-quarter/64805151",
                "I wonder what their crimes were?",
                "“Do not seek the treasure!”",
                "Yeah they ran through the briars and they ran through the brambles\nAnd they ran through the bushes where a rabbit couldn't go\nThey ran so fast that the hounds couldn't catch'em\nOn down the Mississippi to the Gulf of MEXICO",
                "I give it a 0% chance that this goes into June",
                "Here, a video with pictures of all of them plus description of the felonies.\n\nhttps://youtu.be/TBc9qc67Ngs?si=x1Goa4MPoM_tiWdp",
                "Louisiana State Police Supt. Col. Robert Hodges said authorities have “actionable intelligence” on all seven fugitives, who may be getting help on the outside from others."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Guy Bartkus, law enforcement sources name ‘pro-mortalist’ as suspect in Palm Springs IVF clinic explosion",
            "external_url": "https://www.the-independent.com/news/world/americas/crime/guy-bartkus-palm-springs-fertility-clinic-b2753287.html",
            "upvotes": 3535,
            "date": "05/18/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/18/18/55/Guy-Butkus.jpeg?trim=508,0,227,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "So not anti-abortion, just anti-birth in general?  Makes more sense why an IVF center was targeted but it makes it all most messed up.  He is against bringing people into the world against their will but seems okay in sending people back against their will.",
                "“Pro-mortalist”\n\n*blows himself up*\n\nOk buddy",
                "> Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nWhen you fall for the propaganda too hard.",
                "Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nIn addition to his writings, Bartkus also recorded a 30-minute audio clip describing his motives.\n\n“I figured I would just make a recording explaining why I’ve decided to bomb an IVF building, or clinic. Basically, it just comes down to I’m angry that I exist and that, you know, nobody got my consent to bring me here,” he said in the recording.\n\nHe must have been an absolute joy to live with. Essentially it sounds like he was suicidal, and also incredibly resentful and selfish. \"I don't want to exist, so other people can't exist,.either\"? \n\n None of us gave consent to be here.   Not a single one.",
                "This honestly sounds like suicide but with more steps. What happened to crazy people like this doing death by police?",
                "“Guy Bartkus” exactly the name one would have when doing what he did.",
                "[removed]",
                "[removed]",
                "Average r/efilism poster.",
                "I'm just gonna say it; this guy was an absolute moron."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Man handed suspended sentence over role in Blenheim Palace £4.8m gold toilet heist",
            "external_url": "https://www.theguardian.com/uk-news/2025/may/19/blenheim-palace-gold-toilet-heist-man-sentenced",
            "upvotes": 41,
            "date": "05/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8423dc512f2967ec57a909ab79467ba723007bcc/0_890_2449_1960/master/2449.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f5a2e942aa5fb324f4f20fddc36f689e",
            "top_comments": [
                "Stole the wrong golden toilet.",
                "The other two guys who are awaiting trial really flushed their lives down the toilet.",
                "Disappointed to learn the culprits name isn’t Max Flush. :/",
                "glad to see the suspect is no longer on the loos."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump cuts to National Weather Service leave Kentucky offices understaffed",
            "external_url": "https://www.kentucky.com/news/politics-government/article306549111.html",
            "upvotes": 16072,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Shit like this is going to keep happening, too. Fuckin sucks, man.",
                "Well, if it isn't the predictable result of the actions taken since 47 took office.",
                "Can confirm,  we had a tornado touch down 5 miles away and received no alerts. We were watching the news but our area had major outages and a phone alert could have been the difference for some people seeking shelter.",
                "\"More than 600 National Weather Service staff out of more than 4,200 were fired or took early retirement since January, according to Fahy. That’s the same number of people who left the service over a 15-year period from 2010 to early January, Fahy said.\"\n\n\"Tornado-spawning storms leave 25 dead in 2 states and swaths of destruction across central US\"\n\nPeople are dead due to the NOAA cuts of the Trump admin. Disgusting",
                "That’s one way to stop the democrats weather machine.",
                "\"On election night, Kentucky voted Republican for former president Donald Trump by a wide margin for the third time in a row, with him winning the state by 30.53%, a considerable increase from his 25.94% victory in 2020 and to a lesser extent his 29.84% victory in 2016.\"",
                "So... we are cutting essential personnel so that the President can have a nice big military parade and billionaires can get another tax cut\n\ncool, cool",
                "lmao just wait until hurricane season rolls around, it’s gonna get real bad.",
                "A LOT of residents in red states have no idea that so much of what seems like basic services have been funded by federal money coming directly from blue states. They are the \"welfare queens\" they complain about and they always have been. They're like house cats. They have a mistaken idea that they're fiercely independent, while being completely dependent on a complex system they neither appreciate nor understand.",
                "Kentucky here. We got a warning - finally - through somebody making a facebook post nearby that a tornado had touched down. Then we lost power, so anyone not USING FACEBOOK on their PHONES had no idea."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Man handed suspended sentence over role in Blenheim Palace £4.8m gold toilet heist",
            "external_url": "https://www.theguardian.com/uk-news/2025/may/19/blenheim-palace-gold-toilet-heist-man-sentenced",
            "upvotes": 41,
            "date": "05/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8423dc512f2967ec57a909ab79467ba723007bcc/0_890_2449_1960/master/2449.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f5a2e942aa5fb324f4f20fddc36f689e",
            "top_comments": [
                "Stole the wrong golden toilet.",
                "The other two guys who are awaiting trial really flushed their lives down the toilet.",
                "Disappointed to learn the culprits name isn’t Max Flush. :/",
                "glad to see the suspect is no longer on the loos."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "South Florida woman facing $1.8 million ICE fine speaks out: \"Please have mercy\" - CBS Miami",
            "external_url": "https://www.cbsnews.com/miami/news/south-florida-woman-facing-1-8-million-immigration-fine-speaks-out-please-have-mercy/",
            "upvotes": 646,
            "date": "05/19/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/17/2d9b8a3e-78b0-411e-8576-4a4074697124/thumbnail/1200x630/ed232a3a2a15950b21749c2bd81d68b5/1800-ivan-miami-springs-ice-fine-pkg-5-16-25.jpg?v=6df9366690ed146f169dd0670c453f91",
            "top_comments": [
                "1.8 million? \n\nHow is that not a cruel and unusual fine?",
                "[removed]",
                "People like this are the vast majority of those trump wants to deport.  Decent human beings raising a family and contributing more to America than the entire trump family ever could. \n\nYes, he'll deport a few criminals.  He'll also deport citizens he'll claim are criminals.  In the long run he'll end up losing what greatness America ever had.",
                "She looks like one of those drug cartel, murdering, rapist, worst of the worst types we got invaded by for sure. /s",
                "She had a deportation order from 2005. 2005! What the hell is she still doing here?\n\nWhy do we just send people a note saying “alright, you have to leave” and just not follow through for 20 years?",
                "Biden and the Democrats should’ve done more to prepare for these types of attacks on immigrants. The thing is, democrats aren’t tough enough to fight back against republicans. As history shows, liberals do not effectively combat fascism because they themselves are comfortable with the status quo. They constantly accept concessions.\n\nEven now, democrats aren’t fighting back.",
                "She must’ve been out here selling ice cubes like they were diamonds."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Tornado warnings delayed because of DOGE cuts",
            "external_url": "https://www.mesoscalenews.com/p/tornado-warnings-delayed-because",
            "upvotes": 22743,
            "date": "05/19/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbf1204d0-dd21-493d-b55a-0394aebc6880_1800x2250.jpeg",
            "top_comments": [
                "But think of the money nobody saved.",
                "Watched a YouTuber stream these and he questioned at times why tornado warnings were not being issued…oof.",
                "It’s worse than just warnings (which is awful to be clear). \n\n[Weather balloon cuts](https://www.axios.com/2025/03/21/nws-layoffs-cuts-weather-balloons-forecasts) are also ongoing. \n\nWhat do weather balloons do? They give critical live data as they ascend through the atmosphere. What does that tell us, why should I care what the wind speed or temperature is 18,000 feet up? \n\nBecause that feeds *directly* into weather models that are used to predict these kinds of events. \n\nSo they’re *literally* making our forecasts harder and shittier.",
                "And I had someone telling today “There’s an app! And it’s automatically updated you don’t need those employees! The people who died just didn’t check the app!”",
                "That's just good business right there! The national weather service costs every taxpayer roughly $4 a year. Thanks to the heroes at DOGE, that number will surely come down to something more palatable, and all it's costing us are people's lives and livelihoods! Truly the art of the deal!\n\n/s in case it wasn't obvious",
                "That's the point. Reduce the trust people have in national services so they practically *beg* them to be privatized.\n\nAlso, NOAA had the nerve to call trump out over the hurricane. And that's some shit he just won't let stand.",
                "Reminder that part of P2025 was making the weather information that the government provides for free privatized. They want that information to be provided to companies for free so those companies can turn around and offer it as a paid service. \n\nPeople would not receive alerts for dangerous weather anymore unless they paid for it.",
                "Trump's American Bloodbath is underway.",
                "27 lives that may have been saved if they had more warning.",
                "**Key facts before the politics start flying:**\n\n* **What happened** – A nocturnal tornado outbreak late 17 May killed at least 27 people across Kentucky and Missouri (18 of them in Laurel County, KY). Radar‐based debris signatures appeared before midnight, but the first *official* warnings for parts of the path weren’t pushed until minutes after circulation was already on the ground.\n\n* **Why the gap matters** – For night-time storms you’re asleep until a phone alert blares. Even a 5- to 10-minute lag can be the difference between getting to a basement and dying in bed.\n\n* **Staffing reality** – The Jackson, KY forecast office that covers Laurel County has been running 31 % below its authorised staffing since DOGE-mandated cuts early this year. The overnight forecaster position—whose only job is to watch radar while everyone else sleeps—was eliminated in April. Nearly half of NWS offices now have 20 %+ vacancy rates, according to an Associated Press analysis.\n\n* **Warnings on the night** – Because the office can’t staff 24/7 anymore, an on-call meteorologist had to remote-log-in when rotation ramped up. That start-up window accounts for the delay you see in the warning logs.\n\n* **Experts warned this would happen** – Meteorologists and the employees’ union flagged the risk in February; The NY Times, PBS, and WaPo all ran pieces in the past month on how the same budget axe was forcing eight forecast offices—including Jackson—to drop round-the-clock coverage.\n\n**TL;DR**\n\nThe science isn’t broken; the funding pipeline is. Cut the people who keep eyes on radar at 11 p.m. and you buy tragedy at midnight."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Primary school evacuated after student brings in a grenade for show and tell",
            "external_url": "https://www.the-independent.com/news/uk/home-news/grenade-osmaston-school-evacuation-derbyshire-b2752851.html",
            "upvotes": 3757,
            "date": "05/19/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/17/10/00/iStock-1018660080.jpeg?trim=83,0,83,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                ">“It was quite an eventful assembly,” said Mrs Hart. “It was going fine and there was a boy who brought an old bullet case in, which I knew about, but then his friend produced a hand grenade from his pocket. That, I was not expecting.”\n\nPoor kid who brought in the bullet case must have been feeling so good thinking, *\"What a badass I am\"* before his friend followed it up with the grenade. Crushing.",
                "Brick where did you get a hand grenade?",
                "Someone in my class brought one in in middle school. It was defused but a real grenade. The teacher played a prank by rolling into the other classroom right up to the other teachers feet. Everyone laughed and I went home that day. This was pre-9/11 or columbine.",
                "Better to learn now than on the streets",
                "I remember bringing in a Hamilton Model 27 .22 caliber boys rifle to school for my son to use for a show and tell.\n\nI called the principal to see if I needed to case it up when I brought it in, and he said, \"Nope, just stop at the office.\"\n\n1990, obviously. \n\nFast forward to now, his autistic son made a comment about shooting  an Uzi and now has to be searched every morning before school, while escorted by his father.\n\nI get it, but he has trouble sometimes with impulsive talk.\n\nHe is 11, and I feel bad for him.",
                "Article completely left the most important part out: Did he count to three, no more, no less?",
                "I almost did this as a kid. It was a much simpler time back then.",
                "Say what you will but if the goal of show and tell is to share your story then I'd say this kid blew the assignment out of the water. I'm honored and confused to learn about his family's heirloom grenade.",
                "I remember when one of my redneck school mates opened his locker and a bunch of 22. Rounds fell out. This was way before shootings were prevalent. Back in the day high school kids could bring their hunting rifles if they kept them locked in their cars.",
                "My dad was the town GP and did a lot of housecalls. According to staff at the local clinic, he was the first and last person a lot of people in town ever saw. \n\nHe had a box in the garage filled with all kind of stuff that he'd taken out of his medicine bag. Expired medicine, gadgets gifted by medical reps, equipment he didn't need at the moment, you name it.\n\nAs a kid, the box fascinated me. One morning, I remembered that I needed to bring something to school for show-and-tell and decided to take something from the box. Without telling my parents.\n\nMom was called in to come get the speculum I'd chosen. Dad found it hilarious. Mom was not impressed. \n\n(We'd later raid his bag and use the surgical tubing in our slingshots. We could shoot a glass marble through an empty oil can with those. It's a miracle we didn't maim anyone. )"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "7 escaped New Orleans jail inmates still at large as search enters third day",
            "external_url": "https://www.cbsnews.com/news/new-orleans-inmates-escape-update/",
            "upvotes": 2285,
            "date": "05/18/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/18/003c47cd-37f8-4812-b3e3-a6142740696a/thumbnail/1200x630/cea96c2976cdaa498e8a9fae08680039/image.png?v=6df9366690ed146f169dd0670c453f91",
            "top_comments": [
                "Update:\n\nhttps://www.wdsu.com/article/new-orleans-jail-inmate-escape-lockdown/64793237\n\nhttps://kpel965.com/louisiana-authorities-under-fire-orleans-parish-jail-escape/\n\nSheriff Susan Hutson believes those who escaped received help from individuals inside the Orleans Parish Sheriff’s Office. Hutson said the inmates would have needed a tool that they couldn't access to dig the hole in the wall of the cell.",
                "Have they tried looking outside the prison yet?",
                "How dumb do you have to be to go out in public after an escape? And not only in public but the tourist hotspot in your area?? \n\nAt least hide out at a home somewhere for a few months till the trail goes cold!",
                "Most recent video showing two of them wearing new clothes.\n\nhttps://www.wdsu.com/article/new-video-two-escaped-inmates-in-french-quarter/64805151",
                "I wonder what their crimes were?",
                "“Do not seek the treasure!”",
                "Yeah they ran through the briars and they ran through the brambles\nAnd they ran through the bushes where a rabbit couldn't go\nThey ran so fast that the hounds couldn't catch'em\nOn down the Mississippi to the Gulf of MEXICO",
                "I give it a 0% chance that this goes into June",
                "Here, a video with pictures of all of them plus description of the felonies.\n\nhttps://youtu.be/TBc9qc67Ngs?si=x1Goa4MPoM_tiWdp",
                "Louisiana State Police Supt. Col. Robert Hodges said authorities have “actionable intelligence” on all seven fugitives, who may be getting help on the outside from others."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "'He wanted a boy': Man sentenced for murdering pregnant wife, stabbing daughters",
            "external_url": "https://abc3340.com/news/nation-world/he-wanted-boy-man-sentenced-murdering-pregnant-wife-stabbing-daughters-murder-homicide-killed-stab-weapon-knife-violent-delaware-county-new-york-drew-garnier-attacked-assaulted-police-investigation-no-contact-order-horrific-crime-cincinnati",
            "upvotes": 3132,
            "date": "05/18/2025",
            "thumbnail": "https://abc3340.com/resources/media2/16x9/847/986/0x1/90/88fe00ed-7dfd-4d39-99ec-5995d74bb33c-BADDADFRDONETHISTIME.PNG",
            "top_comments": [
                ">Samantha Garnier was airlifted to a hospital, where she was pronounced dead. The daughters were treated for stab wounds and later recovered.\n\n>During Drew Garnier's sentencing on Thursday, Samantha Garnier's father addressed the court.\n\n>\"He had wanted a boy,\" said Samantha Garnier's father.\n\n>He added that the daughters who survived were traumatized by the crime.\n\n>\"I am their father now. I will protect them,\" said Samantha Garnier's father.\n\n>Drew Garnier requested contact with his daughters while serving his sentence, but Delaware County District Attorney Shawn Smith objected, seeking no-contact orders. Judge John Hubbard agreed, issuing stay-away orders until 2056, though he noted the girls could choose to contact their father if they wished.\n\n>Drew Garnier reportedly refused to sign the orders.\n\n\nThese people live in a different reality. Why would you ever think you should see your daughters again after you tried to murder them?",
                "He blamed his wife because HIS XX-focused sperm were superior",
                "30 years prison + 15 years probation.  Saved you a click.",
                "You know what’s crazy? There is almost nothing you can’t do with a daughter that you can do with a son. Throw a ball? Wear the color blue? Play in the mud? Teach music? Build a birdhouse? Work on a car? Ride four wheelers? Wear pants? I know it’s a shock but girls can do ALL THOSE THINGS.",
                "[removed]",
                "Man, some couples desperately wish for baby and they never get such opportunity.  This AH killed his pregnant wife because she \"failed\" to have boy.\n\nAnd yet, he only received 30-year sentencing plus 15 year probations instead of receiving at least life with no parole sentence.\n\nA slap on wrist punishment.",
                "I wanted a girl. I have 5 boys.  I still have 5 boys.  Not that complicated.",
                "That is just idiotic in addition to being evil. Never heard of a divorce? You can always walk out and be a deadbeat without killing anyone.",
                "Clear case of femicide.",
                "*Drew Garnier requested contact with his daughters while serving his sentence, but Delaware County District Attorney Shawn Smith objected, seeking no-contact orders. Judge John Hubbard agreed, issuing stay-away orders until 2056, though he noted the girls could choose to contact their father if they wished.*\n\n*Drew Garnier reportedly refused to sign the orders.*\n\nHe wants his daughters, aged 6 and 9 at the time, to visit him in jail? Even though he stabbed them and murdered their mother? \n\nSo many things wrong with this."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Biden diagnosed with ‘aggressive form’ of prostate cancer",
            "external_url": "https://www.cnn.com/2025/05/18/politics/joe-biden-prostate-cancer",
            "upvotes": 49976,
            "date": "05/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2193208062.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Former US president Joe Biden has been diagnosed with prostate cancer, a statement from his office said on Sunday.\n\n>Biden, 82, was diagnosed on Friday after he saw a doctor last week for urinary symptoms.\n\n>The cancer is characterised by a Gleason score of 9 with metastasis to the bone, his office said, meaning it is a more aggressive form of the disease.\n\n>Biden and his family are said to be reviewing treatment options, the statement said. The former president's office added that the cancer is hormone-sensitive, meaning it can likely be managed.\n\n>This is a developing story.\n\n>This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version.\n\n/saved you a click. Sad news.",
                "As someone who has had a father and a grandfather who were both diagnosed with early onset prostate cancer, my heart goes out to Biden and his family. A Gleason 9 score with bone involvement is not good news. \n\nProstate cancer typically is very slow growing and easily catchable in the early stages. However, every now and then there are some really nasty aggressive forms. Unfortunately, it sounds like the former president might be dealing with the latter. I’ll be praying for him.",
                "‪Fuck prostate cancer. Lost my dad and so many other family members to it. Regardless of your politics, don’t wish cancer on anyone. Prayers up Mr. President. ‬ may we one day have a cure for this awful disease.",
                "Biden has viewed cancer as one of the most important changes he can make in his position for the past decade. His experience with losing Beau clearly made it a health policy focus, and it’s reflected in the research programs he helped establish and re-establish through the Cancer Moonshot effort. \n\nI hope he has the opportunity to benefit from the care he helped enable.",
                "Fuck cancer.  I lost my mom to it and I would give my own life to have taken away the pain and degeneration she faced in her final year.  \n\nI hope for the best for Biden and his treatment, and my heart goes out to the whole Biden family.",
                "Seems like the writing’s on the wall and wish we could skip the shitshow that’ll inevitably ensue",
                "I'm still recovering from having my prostate removed last Wednesday, due to prostate cancer with the score of Gleason 7.  I'm still in that awful period where I have to wear a catheter. I just got the pathology results that showed the surgeon got it all and hopefully there  should be none remaining in the body. Best day of my life. Biden's Gleason 9 is a pretty poor diagnosis. I wish him well and a positive result.",
                "That’s rough. Absolutely fuck cancer.",
                "The hate on FoxNews page is absolutely horrible.\n\nThe nicest comment was something along the lines of, \"horrible president, don't wish this on him, but he might deserve it.\"\n\nThe fuck is wrong with these people.",
                "How long until Trump says something awful about it?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "FBI says suspect in US fertility clinic blast had 'nihilistic ideations'",
            "external_url": "https://www.bbc.com/news/articles/c787j90wp6po",
            "upvotes": 6938,
            "date": "05/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3c77/live/d21852f0-33fc-11f0-9fcc-0f444dbba5ff.jpg",
            "top_comments": [
                "> The FBI said they believe he is the sole fatality in the incident.\n\n\nGreat news.",
                "We believe in nothing, Lebowski. Nothing. And tomorrow we come back and we cut off your chonson",
                "[removed]",
                "Based on what I’ve read, he was allegedly an antinatalist, so this will be a very different scenario from what a lot were first hypothesizing.",
                "Not sure they understand the words they're using there.\n\nA nihilist wouldn't be all that concerned with whether or not people have kids since nothing matters anyway",
                "“the suspect used a 2010 silver Ford Fusion sedan”\n\nIt was a fusion bomb!",
                "[removed]",
                "Man looking at these comments I would assume most of these are bots but even bots aren’t this stupid.",
                "This aggression will not stand.",
                "Call it what it is, a terrorist attack. Not a blast."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Guy Bartkus, law enforcement sources name ‘pro-mortalist’ as suspect in Palm Springs IVF clinic explosion",
            "external_url": "https://www.the-independent.com/news/world/americas/crime/guy-bartkus-palm-springs-fertility-clinic-b2753287.html",
            "upvotes": 3534,
            "date": "05/18/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/18/18/55/Guy-Butkus.jpeg?trim=508,0,227,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "So not anti-abortion, just anti-birth in general?  Makes more sense why an IVF center was targeted but it makes it all most messed up.  He is against bringing people into the world against their will but seems okay in sending people back against their will.",
                "“Pro-mortalist”\n\n*blows himself up*\n\nOk buddy",
                "> Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nWhen you fall for the propaganda too hard.",
                "Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nIn addition to his writings, Bartkus also recorded a 30-minute audio clip describing his motives.\n\n“I figured I would just make a recording explaining why I’ve decided to bomb an IVF building, or clinic. Basically, it just comes down to I’m angry that I exist and that, you know, nobody got my consent to bring me here,” he said in the recording.\n\nHe must have been an absolute joy to live with. Essentially it sounds like he was suicidal, and also incredibly resentful and selfish. \"I don't want to exist, so other people can't exist,.either\"? \n\n None of us gave consent to be here.   Not a single one.",
                "This honestly sounds like suicide but with more steps. What happened to crazy people like this doing death by police?",
                "“Guy Bartkus” exactly the name one would have when doing what he did.",
                "[removed]",
                "[removed]",
                "Average r/efilism poster.",
                "I'm just gonna say it; this guy was an absolute moron."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Oklahoma high schools to teach 2020 election conspiracy theories as fact",
            "external_url": "https://www.theguardian.com/us-news/2025/may/17/oklahoma-high-schools-election-conspiracy-theories",
            "upvotes": 35275,
            "date": "05/18/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/16b2b84aeae19cad575afd8829f50cd8f82c7f2d/271_0_3118_2494/master/3118.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=968bba047d85bc933cf6b80361ca1617",
            "top_comments": [
                "Their idea is to radicalize an entire generation.",
                "Big move from the “schools are indoctrinating our kids!” crowd",
                "they have to defend their position, ranked - 49th out of 50.  another sickening waste.",
                "Reminds me of a college course I took, where a segment of that class covered \"Unlearning what I learned in school.\" And it was things like, the truth about Christopher Columbus.\n\nThese Oklahoma kids are going to need a whole semester dedicated to \"Unlearning what I learned in school.\" Going line by line of everything they learned and how it was debunked.\n\nIronically, MAGA will cry \"indoctrination\" but that's exactly what is going on in high school. Indoctrinating kids with a history of debunked theories taught as historical facts. Why? Because this guy wants to promote himself in the MAGA circle. Get to a higher level of the MAGA grift.",
                "They've been writing their own history based on their 'alternative facts' this whole time. It is wild watching the victors revise and rewrite history in real time to suit their twisted agenda.\n\nThe kids already can't read as it is. This isn't the first bullshit Oklahoma wants to ram into children's minds. They're on about creationism and the ten commandments there, too. No wonder their education consistently ranks at or near the bottom of nearly every single metric conducted by nearly every single study.",
                "From the state that tried to require the Trump bible in every school?  Shouldn’t shock anyone.  Crazy and infuriating time period we live in.",
                "Colleges shouldn’t accept their diplomas.",
                ">As part of his revisions, Walters also proposed removing education about Black Lives Matter and George Floyd’s murder, Tulsa’s NBC affiliate KJRH\n\nI hate this timeline",
                "I can’t imagine being so butthurt about a politician, one who couldn’t care less about Oklahoma, losing an election that it would ever even occur to me to make up a rigged election story, much less mandate the fantasy into educational curriculum. MAGA insecurity is a hell of a drug.",
                "Ranked #49/50 for a reason!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "South Florida woman facing $1.8 million ICE fine speaks out: \"Please have mercy\" - CBS Miami",
            "external_url": "https://www.cbsnews.com/miami/news/south-florida-woman-facing-1-8-million-immigration-fine-speaks-out-please-have-mercy/",
            "upvotes": 644,
            "date": "05/19/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/17/2d9b8a3e-78b0-411e-8576-4a4074697124/thumbnail/1200x630/ed232a3a2a15950b21749c2bd81d68b5/1800-ivan-miami-springs-ice-fine-pkg-5-16-25.jpg?v=6df9366690ed146f169dd0670c453f91",
            "top_comments": [
                "1.8 million? \n\nHow is that not a cruel and unusual fine?",
                "[removed]",
                "People like this are the vast majority of those trump wants to deport.  Decent human beings raising a family and contributing more to America than the entire trump family ever could. \n\nYes, he'll deport a few criminals.  He'll also deport citizens he'll claim are criminals.  In the long run he'll end up losing what greatness America ever had.",
                "She looks like one of those drug cartel, murdering, rapist, worst of the worst types we got invaded by for sure. /s",
                "She had a deportation order from 2005. 2005! What the hell is she still doing here?\n\nWhy do we just send people a note saying “alright, you have to leave” and just not follow through for 20 years?",
                "Biden and the Democrats should’ve done more to prepare for these types of attacks on immigrants. The thing is, democrats aren’t tough enough to fight back against republicans. As history shows, liberals do not effectively combat fascism because they themselves are comfortable with the status quo. They constantly accept concessions.\n\nEven now, democrats aren’t fighting back.",
                "She must’ve been out here selling ice cubes like they were diamonds."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Tornado warnings delayed because of DOGE cuts",
            "external_url": "https://www.mesoscalenews.com/p/tornado-warnings-delayed-because",
            "upvotes": 22737,
            "date": "05/19/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbf1204d0-dd21-493d-b55a-0394aebc6880_1800x2250.jpeg",
            "top_comments": [
                "But think of the money nobody saved.",
                "Watched a YouTuber stream these and he questioned at times why tornado warnings were not being issued…oof.",
                "It’s worse than just warnings (which is awful to be clear). \n\n[Weather balloon cuts](https://www.axios.com/2025/03/21/nws-layoffs-cuts-weather-balloons-forecasts) are also ongoing. \n\nWhat do weather balloons do? They give critical live data as they ascend through the atmosphere. What does that tell us, why should I care what the wind speed or temperature is 18,000 feet up? \n\nBecause that feeds *directly* into weather models that are used to predict these kinds of events. \n\nSo they’re *literally* making our forecasts harder and shittier.",
                "And I had someone telling today “There’s an app! And it’s automatically updated you don’t need those employees! The people who died just didn’t check the app!”",
                "That's just good business right there! The national weather service costs every taxpayer roughly $4 a year. Thanks to the heroes at DOGE, that number will surely come down to something more palatable, and all it's costing us are people's lives and livelihoods! Truly the art of the deal!\n\n/s in case it wasn't obvious",
                "That's the point. Reduce the trust people have in national services so they practically *beg* them to be privatized.\n\nAlso, NOAA had the nerve to call trump out over the hurricane. And that's some shit he just won't let stand.",
                "Reminder that part of P2025 was making the weather information that the government provides for free privatized. They want that information to be provided to companies for free so those companies can turn around and offer it as a paid service. \n\nPeople would not receive alerts for dangerous weather anymore unless they paid for it.",
                "Trump's American Bloodbath is underway.",
                "27 lives that may have been saved if they had more warning.",
                "**Key facts before the politics start flying:**\n\n* **What happened** – A nocturnal tornado outbreak late 17 May killed at least 27 people across Kentucky and Missouri (18 of them in Laurel County, KY). Radar‐based debris signatures appeared before midnight, but the first *official* warnings for parts of the path weren’t pushed until minutes after circulation was already on the ground.\n\n* **Why the gap matters** – For night-time storms you’re asleep until a phone alert blares. Even a 5- to 10-minute lag can be the difference between getting to a basement and dying in bed.\n\n* **Staffing reality** – The Jackson, KY forecast office that covers Laurel County has been running 31 % below its authorised staffing since DOGE-mandated cuts early this year. The overnight forecaster position—whose only job is to watch radar while everyone else sleeps—was eliminated in April. Nearly half of NWS offices now have 20 %+ vacancy rates, according to an Associated Press analysis.\n\n* **Warnings on the night** – Because the office can’t staff 24/7 anymore, an on-call meteorologist had to remote-log-in when rotation ramped up. That start-up window accounts for the delay you see in the warning logs.\n\n* **Experts warned this would happen** – Meteorologists and the employees’ union flagged the risk in February; The NY Times, PBS, and WaPo all ran pieces in the past month on how the same budget axe was forcing eight forecast offices—including Jackson—to drop round-the-clock coverage.\n\n**TL;DR**\n\nThe science isn’t broken; the funding pipeline is. Cut the people who keep eyes on radar at 11 p.m. and you buy tragedy at midnight."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Biden diagnosed with ‘aggressive form’ of prostate cancer",
            "external_url": "https://www.cnn.com/2025/05/18/politics/joe-biden-prostate-cancer",
            "upvotes": 49978,
            "date": "05/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2193208062.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Former US president Joe Biden has been diagnosed with prostate cancer, a statement from his office said on Sunday.\n\n>Biden, 82, was diagnosed on Friday after he saw a doctor last week for urinary symptoms.\n\n>The cancer is characterised by a Gleason score of 9 with metastasis to the bone, his office said, meaning it is a more aggressive form of the disease.\n\n>Biden and his family are said to be reviewing treatment options, the statement said. The former president's office added that the cancer is hormone-sensitive, meaning it can likely be managed.\n\n>This is a developing story.\n\n>This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version.\n\n/saved you a click. Sad news.",
                "As someone who has had a father and a grandfather who were both diagnosed with early onset prostate cancer, my heart goes out to Biden and his family. A Gleason 9 score with bone involvement is not good news. \n\nProstate cancer typically is very slow growing and easily catchable in the early stages. However, every now and then there are some really nasty aggressive forms. Unfortunately, it sounds like the former president might be dealing with the latter. I’ll be praying for him.",
                "‪Fuck prostate cancer. Lost my dad and so many other family members to it. Regardless of your politics, don’t wish cancer on anyone. Prayers up Mr. President. ‬ may we one day have a cure for this awful disease.",
                "Biden has viewed cancer as one of the most important changes he can make in his position for the past decade. His experience with losing Beau clearly made it a health policy focus, and it’s reflected in the research programs he helped establish and re-establish through the Cancer Moonshot effort. \n\nI hope he has the opportunity to benefit from the care he helped enable.",
                "Fuck cancer.  I lost my mom to it and I would give my own life to have taken away the pain and degeneration she faced in her final year.  \n\nI hope for the best for Biden and his treatment, and my heart goes out to the whole Biden family.",
                "Seems like the writing’s on the wall and wish we could skip the shitshow that’ll inevitably ensue",
                "I'm still recovering from having my prostate removed last Wednesday, due to prostate cancer with the score of Gleason 7.  I'm still in that awful period where I have to wear a catheter. I just got the pathology results that showed the surgeon got it all and hopefully there  should be none remaining in the body. Best day of my life. Biden's Gleason 9 is a pretty poor diagnosis. I wish him well and a positive result.",
                "That’s rough. Absolutely fuck cancer.",
                "The hate on FoxNews page is absolutely horrible.\n\nThe nicest comment was something along the lines of, \"horrible president, don't wish this on him, but he might deserve it.\"\n\nThe fuck is wrong with these people.",
                "How long until Trump says something awful about it?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Primary school evacuated after student brings in a grenade for show and tell",
            "external_url": "https://www.the-independent.com/news/uk/home-news/grenade-osmaston-school-evacuation-derbyshire-b2752851.html",
            "upvotes": 3752,
            "date": "05/19/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/17/10/00/iStock-1018660080.jpeg?trim=83,0,83,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                ">“It was quite an eventful assembly,” said Mrs Hart. “It was going fine and there was a boy who brought an old bullet case in, which I knew about, but then his friend produced a hand grenade from his pocket. That, I was not expecting.”\n\nPoor kid who brought in the bullet case must have been feeling so good thinking, *\"What a badass I am\"* before his friend followed it up with the grenade. Crushing.",
                "Brick where did you get a hand grenade?",
                "Someone in my class brought one in in middle school. It was defused but a real grenade. The teacher played a prank by rolling into the other classroom right up to the other teachers feet. Everyone laughed and I went home that day. This was pre-9/11 or columbine.",
                "Better to learn now than on the streets",
                "I remember bringing in a Hamilton Model 27 .22 caliber boys rifle to school for my son to use for a show and tell.\n\nI called the principal to see if I needed to case it up when I brought it in, and he said, \"Nope, just stop at the office.\"\n\n1990, obviously. \n\nFast forward to now, his autistic son made a comment about shooting  an Uzi and now has to be searched every morning before school, while escorted by his father.\n\nI get it, but he has trouble sometimes with impulsive talk.\n\nHe is 11, and I feel bad for him.",
                "Article completely left the most important part out: Did he count to three, no more, no less?",
                "I almost did this as a kid. It was a much simpler time back then.",
                "Say what you will but if the goal of show and tell is to share your story then I'd say this kid blew the assignment out of the water. I'm honored and confused to learn about his family's heirloom grenade.",
                "I remember when one of my redneck school mates opened his locker and a bunch of 22. Rounds fell out. This was way before shootings were prevalent. Back in the day high school kids could bring their hunting rifles if they kept them locked in their cars.",
                "My dad was the town GP and did a lot of housecalls. According to staff at the local clinic, he was the first and last person a lot of people in town ever saw. \n\nHe had a box in the garage filled with all kind of stuff that he'd taken out of his medicine bag. Expired medicine, gadgets gifted by medical reps, equipment he didn't need at the moment, you name it.\n\nAs a kid, the box fascinated me. One morning, I remembered that I needed to bring something to school for show-and-tell and decided to take something from the box. Without telling my parents.\n\nMom was called in to come get the speculum I'd chosen. Dad found it hilarious. Mom was not impressed. \n\n(We'd later raid his bag and use the surgical tubing in our slingshots. We could shoot a glass marble through an empty oil can with those. It's a miracle we didn't maim anyone. )"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Oklahoma high schools to teach 2020 election conspiracy theories as fact",
            "external_url": "https://www.theguardian.com/us-news/2025/may/17/oklahoma-high-schools-election-conspiracy-theories",
            "upvotes": 35273,
            "date": "05/18/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/16b2b84aeae19cad575afd8829f50cd8f82c7f2d/271_0_3118_2494/master/3118.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=968bba047d85bc933cf6b80361ca1617",
            "top_comments": [
                "Their idea is to radicalize an entire generation.",
                "Big move from the “schools are indoctrinating our kids!” crowd",
                "they have to defend their position, ranked - 49th out of 50.  another sickening waste.",
                "Reminds me of a college course I took, where a segment of that class covered \"Unlearning what I learned in school.\" And it was things like, the truth about Christopher Columbus.\n\nThese Oklahoma kids are going to need a whole semester dedicated to \"Unlearning what I learned in school.\" Going line by line of everything they learned and how it was debunked.\n\nIronically, MAGA will cry \"indoctrination\" but that's exactly what is going on in high school. Indoctrinating kids with a history of debunked theories taught as historical facts. Why? Because this guy wants to promote himself in the MAGA circle. Get to a higher level of the MAGA grift.",
                "They've been writing their own history based on their 'alternative facts' this whole time. It is wild watching the victors revise and rewrite history in real time to suit their twisted agenda.\n\nThe kids already can't read as it is. This isn't the first bullshit Oklahoma wants to ram into children's minds. They're on about creationism and the ten commandments there, too. No wonder their education consistently ranks at or near the bottom of nearly every single metric conducted by nearly every single study.",
                "From the state that tried to require the Trump bible in every school?  Shouldn’t shock anyone.  Crazy and infuriating time period we live in.",
                "Colleges shouldn’t accept their diplomas.",
                ">As part of his revisions, Walters also proposed removing education about Black Lives Matter and George Floyd’s murder, Tulsa’s NBC affiliate KJRH\n\nI hate this timeline",
                "I can’t imagine being so butthurt about a politician, one who couldn’t care less about Oklahoma, losing an election that it would ever even occur to me to make up a rigged election story, much less mandate the fantasy into educational curriculum. MAGA insecurity is a hell of a drug.",
                "Ranked #49/50 for a reason!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "FBI says suspect in US fertility clinic blast had 'nihilistic ideations'",
            "external_url": "https://www.bbc.com/news/articles/c787j90wp6po",
            "upvotes": 6941,
            "date": "05/18/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/3c77/live/d21852f0-33fc-11f0-9fcc-0f444dbba5ff.jpg",
            "top_comments": [
                "> The FBI said they believe he is the sole fatality in the incident.\n\n\nGreat news.",
                "We believe in nothing, Lebowski. Nothing. And tomorrow we come back and we cut off your chonson",
                "[removed]",
                "Based on what I’ve read, he was allegedly an antinatalist, so this will be a very different scenario from what a lot were first hypothesizing.",
                "Not sure they understand the words they're using there.\n\nA nihilist wouldn't be all that concerned with whether or not people have kids since nothing matters anyway",
                "“the suspect used a 2010 silver Ford Fusion sedan”\n\nIt was a fusion bomb!",
                "[removed]",
                "Man looking at these comments I would assume most of these are bots but even bots aren’t this stupid.",
                "This aggression will not stand.",
                "Call it what it is, a terrorist attack. Not a blast."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "7 escaped New Orleans jail inmates still at large as search enters third day",
            "external_url": "https://www.cbsnews.com/news/new-orleans-inmates-escape-update/",
            "upvotes": 2289,
            "date": "05/18/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/18/003c47cd-37f8-4812-b3e3-a6142740696a/thumbnail/1200x630/cea96c2976cdaa498e8a9fae08680039/image.png?v=6df9366690ed146f169dd0670c453f91",
            "top_comments": [
                "Update:\n\nhttps://www.wdsu.com/article/new-orleans-jail-inmate-escape-lockdown/64793237\n\nhttps://kpel965.com/louisiana-authorities-under-fire-orleans-parish-jail-escape/\n\nSheriff Susan Hutson believes those who escaped received help from individuals inside the Orleans Parish Sheriff’s Office. Hutson said the inmates would have needed a tool that they couldn't access to dig the hole in the wall of the cell.",
                "Have they tried looking outside the prison yet?",
                "How dumb do you have to be to go out in public after an escape? And not only in public but the tourist hotspot in your area?? \n\nAt least hide out at a home somewhere for a few months till the trail goes cold!",
                "Most recent video showing two of them wearing new clothes.\n\nhttps://www.wdsu.com/article/new-video-two-escaped-inmates-in-french-quarter/64805151",
                "I wonder what their crimes were?",
                "“Do not seek the treasure!”",
                "Yeah they ran through the briars and they ran through the brambles\nAnd they ran through the bushes where a rabbit couldn't go\nThey ran so fast that the hounds couldn't catch'em\nOn down the Mississippi to the Gulf of MEXICO",
                "I give it a 0% chance that this goes into June",
                "Here, a video with pictures of all of them plus description of the felonies.\n\nhttps://youtu.be/TBc9qc67Ngs?si=x1Goa4MPoM_tiWdp",
                "Louisiana State Police Supt. Col. Robert Hodges said authorities have “actionable intelligence” on all seven fugitives, who may be getting help on the outside from others."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Guy Bartkus, law enforcement sources name ‘pro-mortalist’ as suspect in Palm Springs IVF clinic explosion",
            "external_url": "https://www.the-independent.com/news/world/americas/crime/guy-bartkus-palm-springs-fertility-clinic-b2753287.html",
            "upvotes": 3539,
            "date": "05/18/2025",
            "thumbnail": "https://static.the-independent.com/2025/05/18/18/55/Guy-Butkus.jpeg?trim=508,0,227,0&width=1200&height=800&crop=1200:800",
            "top_comments": [
                "So not anti-abortion, just anti-birth in general?  Makes more sense why an IVF center was targeted but it makes it all most messed up.  He is against bringing people into the world against their will but seems okay in sending people back against their will.",
                "“Pro-mortalist”\n\n*blows himself up*\n\nOk buddy",
                "> Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nWhen you fall for the propaganda too hard.",
                "Bartkus allegedly stated in writings and recordings that he was a “pro-mortalist.” In one writing, Bartkus described being a “pro-mortalist” as someone who intends to bring about their own death as soon as possible in order “to prevent your future suffering, and, more importantly, the suffering your existence will cause to all the other sentient beings.”\n\nIn addition to his writings, Bartkus also recorded a 30-minute audio clip describing his motives.\n\n“I figured I would just make a recording explaining why I’ve decided to bomb an IVF building, or clinic. Basically, it just comes down to I’m angry that I exist and that, you know, nobody got my consent to bring me here,” he said in the recording.\n\nHe must have been an absolute joy to live with. Essentially it sounds like he was suicidal, and also incredibly resentful and selfish. \"I don't want to exist, so other people can't exist,.either\"? \n\n None of us gave consent to be here.   Not a single one.",
                "This honestly sounds like suicide but with more steps. What happened to crazy people like this doing death by police?",
                "“Guy Bartkus” exactly the name one would have when doing what he did.",
                "[removed]",
                "[removed]",
                "Average r/efilism poster.",
                "I'm just gonna say it; this guy was an absolute moron."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Man handed suspended sentence over role in Blenheim Palace £4.8m gold toilet heist",
            "external_url": "https://www.theguardian.com/uk-news/2025/may/19/blenheim-palace-gold-toilet-heist-man-sentenced",
            "upvotes": 41,
            "date": "05/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8423dc512f2967ec57a909ab79467ba723007bcc/0_890_2449_1960/master/2449.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f5a2e942aa5fb324f4f20fddc36f689e",
            "top_comments": [
                "Stole the wrong golden toilet.",
                "The other two guys who are awaiting trial really flushed their lives down the toilet.",
                "Disappointed to learn the culprits name isn’t Max Flush. :/",
                "glad to see the suspect is no longer on the loos."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump cuts to National Weather Service leave Kentucky offices understaffed",
            "external_url": "https://www.kentucky.com/news/politics-government/article306549111.html",
            "upvotes": 16076,
            "date": "05/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Shit like this is going to keep happening, too. Fuckin sucks, man.",
                "Well, if it isn't the predictable result of the actions taken since 47 took office.",
                "Can confirm,  we had a tornado touch down 5 miles away and received no alerts. We were watching the news but our area had major outages and a phone alert could have been the difference for some people seeking shelter.",
                "\"More than 600 National Weather Service staff out of more than 4,200 were fired or took early retirement since January, according to Fahy. That’s the same number of people who left the service over a 15-year period from 2010 to early January, Fahy said.\"\n\n\"Tornado-spawning storms leave 25 dead in 2 states and swaths of destruction across central US\"\n\nPeople are dead due to the NOAA cuts of the Trump admin. Disgusting",
                "That’s one way to stop the democrats weather machine.",
                "\"On election night, Kentucky voted Republican for former president Donald Trump by a wide margin for the third time in a row, with him winning the state by 30.53%, a considerable increase from his 25.94% victory in 2020 and to a lesser extent his 29.84% victory in 2016.\"",
                "So... we are cutting essential personnel so that the President can have a nice big military parade and billionaires can get another tax cut\n\ncool, cool",
                "lmao just wait until hurricane season rolls around, it’s gonna get real bad.",
                "A LOT of residents in red states have no idea that so much of what seems like basic services have been funded by federal money coming directly from blue states. They are the \"welfare queens\" they complain about and they always have been. They're like house cats. They have a mistaken idea that they're fiercely independent, while being completely dependent on a complex system they neither appreciate nor understand.",
                "Kentucky here. We got a warning - finally - through somebody making a facebook post nearby that a tornado had touched down. Then we lost power, so anyone not USING FACEBOOK on their PHONES had no idea."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/19/2025 12:17:46 UTC"
}