{
    "posts": [
        {
            "category": "HOT",
            "title": "More than 25 protesters arrested after taking over University of Washington building",
            "external_url": "https://abcnews.go.com/US/protesters-university-washington-building/story?id=121505881",
            "upvotes": 5835,
            "date": "05/06/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8b79e615-2538-4cc9-b752-cde7df424dcd/uw-police_1746525294015_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Demanding that UW cut ties with Boeing is insane, the joke among engineering students was that there were secret WW2 tunnels from the engineering department directly to Boeing because of how many graduates went there.  You might as well ask the Colorado School of Mines to divest from the mining industry.",
                "You're not going to get any support by calling what happened on Oct. 7th a \"heroic victory\".",
                "I won't shed a tear for a group that has glorified the Oct 7th attack. They do a disservice to the pro=Palestine movement.\n\n  \n[source](https://medium.com/@super.uw.seattle/we-demand-uw-will-no-longer-be-complicit-in-genocide-0099dc761f92)",
                "Yep that’ll happen.\n\n Protest takes sacrifice",
                "[removed]",
                "From UW this morning:\nDear UW community,\n\nLate yesterday afternoon, a group identifying themselves as the suspended student organization SUPER UW posted on social media that they were occupying the Interdisciplinary Engineering Building on the Seattle campus and asked for other groups to join them. These groups temporarily occupied and vandalized the building before being arrested by law enforcement officers from UWPD, the Seattle Police Department and the Washington State Patrol. They also set fire to dumpsters in a nearby street after blocking exits in the IEB and blocking nearby streets to delay firefighters’ access.\n\nThis was no peaceful protest in support of Palestinian rights or against the war in Gaza. I condemn this dangerous, violent and illegal building occupation and related vandalism. I also condemn in the strongest terms the group’s statement celebrating the Oct. 7, 2023, Hamas terrorist attacks against Israeli civilians. The University will not be intimidated by this sort of horrific and destructive behavior and will not engage in dialogue with any group using or condoning such destructive tactics. We will continue our actions to oppose antisemitism, racism and all forms of biases so that ALL our students, faculty, staff and visitors can feel safe and welcome on our campuses.\n\nKing County jail staff are working to identify the roughly 30 people who were arrested, so at the moment we do not know how many are UW students or community members. We are working with law enforcement and through our own disciplinary processes to ensure those responsible face appropriate consequences for their actions. And we will continue to stand strong against violent and illegal activities that create a hostile environment for any and all members of our community. I want to thank the members of UWPD and our law enforcement partners for their assistance in bringing this situation to a swift resolution.",
                "I know we were all still dumbasses in college, but I just refuse to believe we were this dumb.",
                "They also set a fire 🔥 so I'm a little less empathetic.",
                "Are these people still protesting about Gaza while Trump is speed-running America into a dictatorship?\n\nPriorities.",
                "Fuck these people. Glorifying October 7th into a good thing. Hope they get the entire book thrown at them. They’ve turned Palestine support into straight up terrorist support. Fucking disgusting. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Supreme Court upholds Trump's ban on transgender military members while appeals continue.",
            "external_url": "https://www.npr.org/2025/05/06/nx-s1-5388507/supreme-court-transgender-military",
            "upvotes": 3279,
            "date": "05/06/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5566x3131+0+290/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F09%2F5f%2F69ad07ce43bfb90d1e44c599d837%2Fgettyimages-2157829281-10.jpg",
            "top_comments": [
                "Says the draft dodger",
                "Trump reinstated service members who refused to take the COVID-19 vaccine. (The same vaccine Donald Trump, himself, took) Nearly 100 service members died. A half a million were infected. But, lets kick out transgendered troops.",
                "[deleted]",
                "Funny how SCOTUS typically leans on the side of allowing harm when it benefits the prejudices of their base.",
                "Transgender people are the canary in the coal mine. However you may feel, if they are not free to be themselves, then none of us are... Fun fact: All those books the Nazis began with burning was transgender medical research. Up until that time, Berlin was the world leader in healthcare. We know what they ended with burning...",
                "According to their logic it is arrogant and selfish to be trans, thus disqualifying, so I guess 100% of the Trump admin are also unfit to serve in the military.",
                "You can’t have trans people in the military when the military starts rounding up trans people. It’s a conflict of interest you see…",
                "it's so insane to me to tell someone their life isn't good enough to sacrifice?",
                "Doesn’t the military have a recruitment issue as it is?\n\nIsn’t it counterproductive to deny the (realistically) dozens of transgenders looking to enlist?",
                "The Census Bureau has the number of trans people in the US pegged at 2.6 million out of 340 million Americans. For the room temperature IQ maga's in the room with us that's less than 1% of the population. \n\nOf that 1% of the population how many do you think are in the military? Again for the room temperature IQ, at most still less than 1% of the US population. \n\n1% of the US population they're mad at and for what reason?\n\nRidiculous."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Falsified records, fake donations: Credit Suisse fined for helping rich Americans hide over $4 billion from the taxman",
            "external_url": "https://edition.cnn.com/2025/05/06/business/credit-suisse-fine-americans-tax-evasion-intl",
            "upvotes": 3628,
            "date": "05/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2184011222.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If the profits exceed the fine amount than its just the cost of doing business and nothing will be changed.",
                "Rich Americans will just do anything to avoid paying their fair share. Sure they like to sing about how \"great\" America is while funding non-stop disinformation campaigns (see: Fox News, OANN, etc) trying to the convince American people that the problem is anything, everything but *them*. Billionaires who use this country to make their fortune but then hide their money in offshore accounts are the least patriotic citizens among us - and now we have an administration made up entirely of these leeches.",
                "They'd rather pay a crooked banker to doctor the records than let anyone needy benefit from their hoarded wealth.\n\nEveryone who participated in this should be in jail.",
                "Who went to jail for these crimes?",
                "I doubt the fine will approach the $4 billion. Why would they stop doing this if they still profit?",
                "Should send the rich Americans to prison. Oh wait that's for the poor.",
                "Slap on the wrist. Go back to laundering money for the elite and wait for your next slap on the wrist.",
                "There is no Credit Suisse anymore.",
                "And the “Americans” hiding the money? Pardoned by our anti-American “president” no doubt",
                ">UBS, which acquired Credit Suisse in 2023, said Monday that Credit Suisse Services pleaded guilty to one count of conspiracy to aid and assist in the preparation of false income tax returns.\n\nOkay so now go after those who filed false income tax returns."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Exclusive: Order by Hegseth to cancel Ukraine weapons caught White House off guard",
            "external_url": "https://www.reuters.com/world/us/order-by-hegseth-cancel-ukraine-weapons-caught-white-house-off-guard-2025-05-06/",
            "upvotes": 10544,
            "date": "05/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Hegseth has seriously cured my imposter syndrome.",
                "The president was unaware. \n\nGet used to hearing that one.",
                "Probably not a good idea to cheat countries while trying to make trade deals with every other country in the world.",
                "The Associated Press reports that the savings will be used to implement \"unlimited jello shots\" at all future DoD meetings.",
                "Ooh, this one makes Trump look bad. That will prob get him replaced.",
                "I don’t understand how everything these dudes do materially helps the Russians and our media is all 🤷",
                "What's wild is that the DOD is running on his impulses. Alcoholism also brings erratic and impulsive behavior. America is so cooked if this regime ever steps down, so much relation building that will forever be at arms distance and the amount of money that will go towards contractors to assess what happened across the entire government in this 4 year period is going to last 2-3 president's at least.\n\nYall fucked",
                "I don't think the mineral deal will still be valid if Russia conquers Ukraine.",
                "**This article is talking about a unilateral stop of Aid in February but Hegseth:**\n\n\n\nThe president was unaware of Hegseth’s order, as were other top national security officials in the meeting, according to two sources briefed on the private White House discussions and another with direct knowledge of the matter.\n\nAsked to comment on this report, the White House told Reuters that Hegseth had followed a directive from Trump to pause aid to Ukraine, which it said was the administration's position at the time. It did not explain why, according to those who spoke to Reuters, top national security officials in the normal decision making process didn’t know about the order or why it was so swiftly reversed.\n\n“Negotiating an end to the Russia-Ukraine War has been a complex and fluid situation. We are not going to detail every conversation among top administration officials throughout the process,” said Karoline Leavitt, the White House spokeswoman. “The bottom line is the war is much closer to an end today than it was when President Trump took office.”\n\nThe cancelations cost TRANSCOM $2.2 million, according to the records reviewed by Reuters. In response to a request for comment, TRANSCOM said that the total cost was $1.6 million – 11 flights were canceled but one incurred no charge.\n\nAn order halting military aid authorized under the Biden administration went into effect officially a month later, on March 4, with a White House announcement.\n\nThe story of how flights were canceled, detailed by Reuters for the first time, points to an at-times haphazard policy-making process within the Trump administration and a command structure that is unclear even to its own ranking members.\n\nThe multiday pause of the flights, confirmed by five people with knowledge of it, also shows confusion in how the administration has created and implemented national security policy. At the Pentagon, the disarray is an open secret, with many current and former officials saying the department is plagued by internal disagreements on foreign policy, deep-seated grudges, and inexperienced staff.\n\nReuters couldn’t establish exactly when Hegseth’s office ordered the freight flights canceled. Two sources said Ukrainian and European officials began asking about the pause on February 2. The TRANSCOM records indicate that there was a verbal order from “SECDEF” – the secretary of defense – that stopped the flights and that they had resumed by February 5.\n\n“This is consistent with the administration's policy to move fast, break things and sort it out later. That is their managing philosophy,” said Mark Cancian, a retired Marine officer and defense expert with the Center for Strategic and International Studies think tank. “That is great for Silicon Valley. But when you’re talking about institutions that have been around for hundreds of years, you are going to run into problems.”\nThe stop in shipments caused consternation in Kyiv.\nThe Ukrainians quickly asked the administration through multiple channels but had difficulty obtaining any useful information, according to a Ukrainian official with direct knowledge of the situation. In later conversations with the Ukrainians, the administration wrote off the pause as “internal politics,” said the source. Ukrainian officials did not respond to requests for comment.\n\nThe shipping of American weapons to Ukraine requires sign-off from multiple agencies and can take weeks or even months to complete, depending on the size of the cargo. The majority of US military assistance goes through a logistics hub in Poland before being picked up by Ukrainian representatives and transported into the country.\n\nThat hub can hold shipments for extended periods of time. It’s not clear if the 11 canceled flights were the only ones scheduled that week in February, how much aid was already stockpiled in Poland and if it continued to flow into Ukraine despite the TRANSCOM orders.\n\nThe revelations come at a time of upheaval in the department. Several of Hegseth’s top advisers were escorted from the building April 15 after being accused of unauthorized disclosure of classified information. The secretary continues to face scrutiny, including from Congress, about his own communications. Previously he’s attributed allegations of upheaval to disgruntled employees.\n\nThe canceled flights contained weapons that had long been approved by the Biden administration, authorized by lawmakers on Capitol Hill.\n\nReuters couldn’t determine if Hegseth or his team knew how the order to TRANSCOM would play out or that the order would be a substantial change in U.S. policy on Ukraine. Three sources familiar with the situation said Hegseth misinterpreted discussions with the president about Ukraine policy and aid shipments without elaborating further.\n\nFour other people briefed on the situation said a small cadre of staffers inside the Pentagon, many of whom have never held a government job and who have for years spoken out against U.S. aid to Ukraine, advised Hegseth to consider pausing aid to the country.\n\nTwo people familiar with the matter denied there was a true cutoff in aid. One of them described it as a logistical pause.\n“(They) just wanted to get a handle on what was going on and people, as a result, misinterpreted that as: ‘You need to stop everything,’” said one.",
                "The Whitehouse has been on guard about something.....ever?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "FBI has opened 250 investigations tied to violent online network '764' that preys on teens, top official says",
            "external_url": "https://abcnews.go.com/US/fbi-opened-250-investigations-tied-violent-online-network/story?id=121480884",
            "upvotes": 2913,
            "date": "05/06/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/03cf45c4-04fd-47e9-aa47-8575d204265d/Barbie-Doll-ht-er-250505_1746474142203_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "> Reflecting what her family described as a typical 764-related encounter, the girl met him on the popular online gaming platform Roblox, and then they began communicating more regularly online, including on Discord, which caters to gamers.\nThe man convinced her he was her boyfriend, and she sent him sexual photos of herself -- the types of images that 764 adherents threaten to share widely if victims don't comply with their escalating demands.\nAccording to police, she had produced an assortment of 764-related content, including a photo of a nude Barbie doll marked with \"764\" on its forehead; photos depicting her cutting herself; and a note, written in her blood, calling her supposed boyfriend \"a god.\"\nAccording to her family, the Connecticut girl was trained to hack into Roblox accounts and lock them -- which allowed her to make demands of account owners if they wanted their accounts back. And she allegedly helped direct a series of threats that rattled Vernon-area schools for three months in late 2023 and early last year.\n\nThis is so disturbing. If these kids say no, they get threatened or their family gets swatted. Unmonitored internet usage is far more dangerous than so many parents realize. People will find creative and horrible ways to contact kids online.",
                "I've never understood why they don't investigate more about the people calling in the SWAT raids. I'm really unfamiliar with how the process works, but there seem to be way too many stories of raids on regular people's homes without much seeming to be done about the false SWATters.",
                "surprise! One of the kids on DOGE is affiliated with Com/764. https://krebsonsecurity.com/2025/02/teen-on-musks-doge-team-graduated-from-the-com/",
                "Yeah, this is the type of online grooming I’m highly concerned about, and I’d much rather time and effort be funneled here.",
                "It must be a weird environment at the FBI right now. Some branches are going after criminals like normal, some are letting crypto scammers off because Trump's one of them, and others are arresting judges and political opponents. Will your whole investigation be a complete waste of time because the criminal/organization buys a pardon off of Trump? Is the guy at the next desk over part of the secret police? Who knows!",
                "“In another federal case, 19-year-old Jack Rocker of Tampa amassed a collection of more than 8,300 videos and images that the Justice Department called \"some of the most horrific, evil content available on the Internet.\" He pleaded guilty in January to possessing child sexual abuse material and was sentenced to seven years in prison.” \n7 years does not seem to be long enough for this type of crime. 8300 videos and images?? And only 7 years?? Make it make sense!!!",
                "If they prey on teens and the FBI considers them domestic terrorists, then a presidential pardon shouldn't be far behind.",
                "It's a good thing the administration is planning to cut the FBI budget.  As they always say, \"Won't you please stop thinking about the children!?\".",
                "Expect this story to disappear once Putin lets trump know that it's Russian agents behind this criminal \"gang\"",
                "> Followers of the 764 network share all sorts of violent content with their victims, while some also glorify past mass-casualty attacks such as the 1999 Columbine High School shooting, or introduce victims to other extreme ideologies like neo-Nazism or Satanism, according to authorities.\n\nOh good, we're doing Satanic Panic again and lumping them in with nazis and mass murderers."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US Defense Secretary Hegseth to slash senior-most ranks of military",
            "external_url": "https://www.reuters.com/world/us/pentagon-reduce-4-star-positions-by-20-official-says-2025-05-05/",
            "upvotes": 39885,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This includes removing the Chairman of the Joint Chiefs of Staff, the Navy's top admiral and other senior flag officers from their positions.",
                "Imagine achieving the highest rank in the military over a lifetime of excellence & devotion ... only to be relieved of command by this chode.\n\n  \nedit. used relieved rather than fired.",
                "You gotta remove the guys who won’t do fascism for you, y’know?",
                "Genuinely troubling. These are the few people most likely to stand up against an unconstitutional order.",
                "The cleanup after this administration will be monumental and take decades. America is in the process of learning an intensely painful lesson.",
                "For all the noise conservatives make when democratic presidents are in charge, screeching about tyranny... I've never been more afraid of the government than I have been the last four months. And it is getting worse every day.  Something has got to give. The mid terms need to be fucking tidal wave\n\nEdit: yeah, yeah, I get it, \"there won't be midterms\"... Well what the fuck are you doing, then?  You got a militia I can join? Otherwise, propose a fucking solution. Because I'll be phone banking, donating, knocking on doors and doing the best my household can to democratically pull this shit back.",
                "*\"More generals and admirals does not lead to more success,\" Hegseth said in a video posted on X.*\n\nThis is coming from a Fox News weekend TV host - someone with absolutely zero experience to say something like that. \n…\n\n*\"This is not a slash and burn exercise meant to punish high ranking officers, nothing could be further from the truth,\" he said.*\n\nSooooo, it’s a slash and burn exercise meant to punish high ranking officers.",
                "Yeah, so when they stage the coup for the third term there is no one at the top to defy them.",
                "I can’t imagine being a general and having this hot dog fire you. After leaking literal war plans in multiple group chats.",
                "Getting rid of any military leaders who swore allegiance to the US Constitution, and not Trump before they are deployed to oppress Americans."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Russia says all airports in Moscow shut after drone attack",
            "external_url": "https://www.bbc.com/news/articles/c20xqdn04g3o",
            "upvotes": 7829,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/0ef2/live/45708ce0-2a11-11f0-b699-f17b68e54842.jpg",
            "top_comments": [
                "Not a good sign for the military parade",
                "Anyone that would fly these dodgy Russian airlines after all the sanctions needs to have their head checked\n ",
                "Job well done. Professionals bring results without bluster; amateurs declare a special military operation.",
                "They got what they wanted. Shouldn't have invaded another country. C***s.",
                "Better to keep those jets ground as many of them are western made running parts that is long overdue to be replaced but can't due to sanction.\n\nPassengers will be inconvenienced but better they are on ground rather than flying.",
                "Shutting down all the airports in Moscow??  Good lord that sounds costly. \n\nDo it again.  Seriously.  Keep them shuting down, that's as easy way to bankrupt a few airlines.",
                "Are people in Moscow starting to see their lives impacted? I would assume if the people in that city start getting very upset things might start happening?",
                "Hell, our Jetports don't even need drone attacks to be shut down.\n\nWe are EXCEPTIONAL!!!",
                "“Oh no!”\n\nAnyway, my nuts itch. ",
                "It can all be over tomorrow, Russia. Just give up Putin, withdraw all your troops and don’t fuck around anymore."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump directs Department of Justice to try to free Tina Peters from prison in social media post",
            "external_url": "https://www.cpr.org/2025/05/05/trump-directs-department-of-justice-to-try-to-free-tina-peters-from-prison-in-social-media-post/",
            "upvotes": 455,
            "date": "05/06/2025",
            "thumbnail": "https://wp-cpr.s3.amazonaws.com/uploads/2022/04/220409-GOP-ASSEMBLY-PETERS-HV-0002.jpg",
            "top_comments": [
                "A couple of reminders:\n\nTina Peters was convicted of Colorado state law felonies by a Colorado jury and sentenced by a Colorado judge and is serving nine years in a Colorado prison.  \n\nShe has never professed innocence:  instead, she has asserted falsely that her interference in the elections she was entrusted with administering was justified by large-scale fraud by others.\n\nToday's social-media fart by the President is inflammatory, but not wholly insane.\n\nDOJ is pursuing a Federal habeas corpus writ to get Peters out of prison while she pursues appeals.  That writ keeps getting denied because her state level appeals are not exhausted.\n\nPeters has not applied for state clemency.",
                ">“Tina is an innocent Political Prisoner being horribly and unjustly punished in the form of Cruel and Unusual Punishment,” he wrote.\n\nOh you mean like Kilmar Abrego Garcia, you dementia addled twit?",
                "She was convicted on state charges. You know. Like the state's right to enforce, properly try and convict a citizen of that state when it runs afoul of a proper law?",
                "Trump is such a corrupt sleaze bag. Trying to destroy our rule of law.",
                "They should be happy we applied the rule of law and she had her due process rights and was properly convicted.",
                "Tries to free a felon and lets an innocent man rot in an El Salvadoran torture prison.\n\nThe Republican party for you.",
                "If she was brown, Trump would have her in El Salvador.",
                "He’s going to facilitate her release, is that what I’m hearing?",
                "Trump himself has 32 felony convictions. One felon trying to jailbreak another felon. And no one seems to have the basic sense to see that this is what is going on!",
                "He is like:  she backed my lie"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration bars Harvard from new federal research funding",
            "external_url": "https://www.politico.com/news/2025/05/05/trump-bars-harvard-new-federal-research-funding-00330059",
            "upvotes": 8094,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Yet another thing Harvard can sue him for and win.\n\n\nTrump is so bad at this villainous consolidation thing.",
                "Trump just showing the way Liberty University can be denied federal funding through their students.",
                "12 Nobel Prize-winning scientists have active research programs at the Harvard Biological Labs.  Trump is attempting to cut off funding to some of the most important and impactful research on the planet, research that has and will save lives and make people's lives better, all because he's in a snit. \n\nAnd I say this as someone who did my PhD at a rival institution,  and devoutly believes that Harvard can gargle my testicles.  It's hard to argue with their results.",
                "Just a waste of everyone's resources and time. Fuckwad and his crew have no intentions on actually doing anything that will help the average American",
                "He’s going to decimate America’s leadership in various areas of research over his bruised ego, and the Republican Congress won’t challenge him. This is a team effort.",
                "He's gonna hamstring the brightest minds in the United States from conducting research that may help us all some day? Great.",
                "Fascists doing fascist shit.",
                "I wonder what a great America looks like to Trump. He guts NASA, the greatest space research institution in the world. He guts the NIH, the greatest medical research institution in the world. He guts the CDC, the greatest public health organization in the world. And now he targets Harvard, one of the greatest universities in the world. These are the things that, to me, make America \"great.\"\n\nDoes he think a great America is just a place with the most sweat shops in the world? He really seems to prefer America makes brake pads than revolutionary medical breakthroughs.",
                "He’s really not up to speed on what Universities can achieve, is he?\n\nManchester University isolating Graphene being just one example…",
                "It is *wild* that every day we have another Presidency ending scandal or abuse of power, and yet...there are no conquences for anyone."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Germany's Merz falls short of majority in vote for chancellor",
            "external_url": "https://www.bbc.com/news/articles/cvgp22zlrgko",
            "upvotes": 1146,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/76e1/live/3e100270-2a8c-11f0-b6cf-130123c0aa42.jpg",
            "top_comments": [
                "I think this shouldn't lead to anything too bad. I assume the no votes come from hardliners in the Union who disliked his debt brake agreement. According to the bundestag website they have 14 days for the second round during which they'll do backroom deals, and even if that fails the third round only requires a plurality not a majority of votes. \n\nWorst case scenario would be Merz elected by plurality but he is then immediately toppled by a no confidence vote resulting in new elections. However I doubt the Greens or even the Left would do so since polling for the AfD has only increased since early this year.\n\nAt least this is my speculation feel free to correct me.",
                "That’s definitely a blow for him, but I think he should meet with the dissidents and understand their reasons and make an agreement. That’s politics and will show if he can make bridges with the adversaries.  At least one more time he should be given the chance to form government.",
                "This was only the first vote! Behold! As there still can be two more. But this has never happened before, so I'm all excited for round two. 😄",
                "Time for back room deals.",
                "He probably shouldn’t have allied him self with the extremist right wing party AfD and he probably shouldn’t kept the last government’s budget short just to abandon all his strong hesitations about the budged once he himself headed toward office…",
                "Starts his tenure with a broken deal. Fitting.",
                "To quite Nelson from The Simpsons :\n\n\nHaha!",
                "Some German MPs could be in Russia's pocket. It's not without precedent.",
                "Die Rache von Saskia Esken und Olaf Scholz 😊",
                "A clear set up by Trump and Musk, after they declared the Afd an extremist organization."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Road rage victim in Arizona resurrected through AI to deliver his own impact statement",
            "external_url": "https://www.denver7.com/science-and-tech/artificial-intelligence/arizona-family-uses-ai-to-create-road-rage-victims-own-impact-statement",
            "upvotes": 177,
            "date": "05/06/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/b39d689/2147483647/strip/true/crop/1920x1008+0+36/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Ff5%2Fc8%2Fec26a091450ebc0fc0f77b637e21%2Ftwo-slot-5.png",
            "top_comments": [
                "just seems disrespectful and manipulative.",
                "Make the victim say whatever we want. Should not have been allowed.",
                "“your honor, I am unable to generate an impact statement that meets our content guidelines.”",
                "Am I going to have to put it in my will to not do this?\n\nI’m 36 so that’s never been a thought before\n\nHow expensive would it be to have a will with that one provision just in case? Like could I find a lawyer who could draft that in under an hour and not charge me through the roof?",
                "Cyberpunk type of horror beyond human understanding",
                ">It was the first time in Arizona judicial history — and possibly nationwide — that AI has been used to create a deceased victim’s own impact statement.\n\n[A ghost testified at trial in the 1890s](https://wvtourism.com/ghost-who-gave-legal-testimony/). So, this isn't quite that far-fetched.",
                "ahh really respective to the dead, what's next? Tying strings to him and puppeting his corpse in the hearing?",
                "This feels like some black mirror type shit. The 20 ai ads in this thread doesnt help...",
                "Impact statements are supposed to be written from the perspective of the living relatives and friends, not the dead victim",
                "\"So you won't say what we want you to? Ok. We will 'accident you' and make AI say it for you, then.\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Supreme Court upholds Trump's ban on transgender military members while appeals continue.",
            "external_url": "https://www.npr.org/2025/05/06/nx-s1-5388507/supreme-court-transgender-military",
            "upvotes": 3295,
            "date": "05/06/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5566x3131+0+290/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F09%2F5f%2F69ad07ce43bfb90d1e44c599d837%2Fgettyimages-2157829281-10.jpg",
            "top_comments": [
                "Says the draft dodger",
                "Trump reinstated service members who refused to take the COVID-19 vaccine. (The same vaccine Donald Trump, himself, took) Nearly 100 service members died. A half a million were infected. But, lets kick out transgendered troops.",
                "[deleted]",
                "Funny how SCOTUS typically leans on the side of allowing harm when it benefits the prejudices of their base.",
                "Transgender people are the canary in the coal mine. However you may feel, if they are not free to be themselves, then none of us are... Fun fact: All those books the Nazis began with burning was transgender medical research. Up until that time, Berlin was the world leader in healthcare. We know what they ended with burning...",
                "According to their logic it is arrogant and selfish to be trans, thus disqualifying, so I guess 100% of the Trump admin are also unfit to serve in the military.",
                "You can’t have trans people in the military when the military starts rounding up trans people. It’s a conflict of interest you see…",
                "it's so insane to me to tell someone their life isn't good enough to sacrifice?",
                "Doesn’t the military have a recruitment issue as it is?\n\nIsn’t it counterproductive to deny the (realistically) dozens of transgenders looking to enlist?",
                "The Census Bureau has the number of trans people in the US pegged at 2.6 million out of 340 million Americans. For the room temperature IQ maga's in the room with us that's less than 1% of the population. \n\nOf that 1% of the population how many do you think are in the military? Again for the room temperature IQ, at most still less than 1% of the US population. \n\n1% of the US population they're mad at and for what reason?\n\nRidiculous."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump directs Department of Justice to try to free Tina Peters from prison in social media post",
            "external_url": "https://www.cpr.org/2025/05/05/trump-directs-department-of-justice-to-try-to-free-tina-peters-from-prison-in-social-media-post/",
            "upvotes": 450,
            "date": "05/06/2025",
            "thumbnail": "https://wp-cpr.s3.amazonaws.com/uploads/2022/04/220409-GOP-ASSEMBLY-PETERS-HV-0002.jpg",
            "top_comments": [
                "A couple of reminders:\n\nTina Peters was convicted of Colorado state law felonies by a Colorado jury and sentenced by a Colorado judge and is serving nine years in a Colorado prison.  \n\nShe has never professed innocence:  instead, she has asserted falsely that her interference in the elections she was entrusted with administering was justified by large-scale fraud by others.\n\nToday's social-media fart by the President is inflammatory, but not wholly insane.\n\nDOJ is pursuing a Federal habeas corpus writ to get Peters out of prison while she pursues appeals.  That writ keeps getting denied because her state level appeals are not exhausted.\n\nPeters has not applied for state clemency.",
                ">“Tina is an innocent Political Prisoner being horribly and unjustly punished in the form of Cruel and Unusual Punishment,” he wrote.\n\nOh you mean like Kilmar Abrego Garcia, you dementia addled twit?",
                "She was convicted on state charges. You know. Like the state's right to enforce, properly try and convict a citizen of that state when it runs afoul of a proper law?",
                "Trump is such a corrupt sleaze bag. Trying to destroy our rule of law.",
                "They should be happy we applied the rule of law and she had her due process rights and was properly convicted.",
                "Tries to free a felon and lets an innocent man rot in an El Salvadoran torture prison.\n\nThe Republican party for you.",
                "If she was brown, Trump would have her in El Salvador.",
                "He’s going to facilitate her release, is that what I’m hearing?",
                "Trump himself has 32 felony convictions. One felon trying to jailbreak another felon. And no one seems to have the basic sense to see that this is what is going on!",
                "He is like:  she backed my lie"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "El Salvador president orders arrest of bus company heads for defying free ride policy",
            "external_url": "https://www.npr.org/2025/05/06/nx-s1-5388197/el-salvador-president-bukele-bus-free-transport",
            "upvotes": 158,
            "date": "05/06/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+430/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F62%2F63%2Ffaf7dc964ba998fdb39ae419d08c%2Fap25104613817402.jpg",
            "top_comments": [
                "He’s beginning his dictator arc. I thought he was going to just stick with tough on crime and be normal about everything else (other than allowing our president traffic people into his prisons)",
                "..and while you are at it how about returning our people for due processing?",
                "This guy is a dictator .. he is planning to be President for life",
                "He's a budding Saddam Hussein.",
                "\"Straight to jail. Right away.\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Modi says India will retain share of water it once sent outside the country",
            "external_url": "https://www.reuters.com/world/asia-pacific/un-security-council-urges-india-pakistan-talks-kashmir-islamabad-says-2025-05-06/",
            "upvotes": 179,
            "date": "05/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Water wars yeah! Mix with some religion",
                "Cool heads need to step in quickly here as this has the potential to spin out of control with appalling consequences quite quickly, there's fundamentalist hotheads, within each government, on both sides.",
                "What's stops China from doing the same to India?",
                "I just hope both sides have fun",
                "Pakistan should stop with multiple terrorist attacks , hiding Osama bin Laden types while seeking and milking for aid from the USA , throwing acid on women, honor killings and live in 2025. \nSuch a simple solution to have all the water in the world.",
                "Sounds like Modi is trying to start a ‘short victorious’ war for domestic reasons. ",
                "Not single drop of water to Pakistan is now official Indian state policy. Pakistan will either cut down its funding for terrorism or they will act on their threats of war.",
                "What?  Is everyone just going to just hold their pee?  I'm being facetious.",
                "So- this would cause mass death in Pakistan. Without massive international aid it could be in the millions. Accordingly Pakistan has maintained the position that cutting off its supply of water is an act of war. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Falsified records, fake donations: Credit Suisse fined for helping rich Americans hide over $4 billion from the taxman",
            "external_url": "https://edition.cnn.com/2025/05/06/business/credit-suisse-fine-americans-tax-evasion-intl",
            "upvotes": 3618,
            "date": "05/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2184011222.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If the profits exceed the fine amount than its just the cost of doing business and nothing will be changed.",
                "Rich Americans will just do anything to avoid paying their fair share. Sure they like to sing about how \"great\" America is while funding non-stop disinformation campaigns (see: Fox News, OANN, etc) trying to the convince American people that the problem is anything, everything but *them*. Billionaires who use this country to make their fortune but then hide their money in offshore accounts are the least patriotic citizens among us - and now we have an administration made up entirely of these leeches.",
                "They'd rather pay a crooked banker to doctor the records than let anyone needy benefit from their hoarded wealth.\n\nEveryone who participated in this should be in jail.",
                "Who went to jail for these crimes?",
                "I doubt the fine will approach the $4 billion. Why would they stop doing this if they still profit?",
                "Should send the rich Americans to prison. Oh wait that's for the poor.",
                "Slap on the wrist. Go back to laundering money for the elite and wait for your next slap on the wrist.",
                "There is no Credit Suisse anymore.",
                "And the “Americans” hiding the money? Pardoned by our anti-American “president” no doubt",
                ">UBS, which acquired Credit Suisse in 2023, said Monday that Credit Suisse Services pleaded guilty to one count of conspiracy to aid and assist in the preparation of false income tax returns.\n\nOkay so now go after those who filed false income tax returns."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "More than 25 protesters arrested after taking over University of Washington building",
            "external_url": "https://abcnews.go.com/US/protesters-university-washington-building/story?id=121505881",
            "upvotes": 5835,
            "date": "05/06/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8b79e615-2538-4cc9-b752-cde7df424dcd/uw-police_1746525294015_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Demanding that UW cut ties with Boeing is insane, the joke among engineering students was that there were secret WW2 tunnels from the engineering department directly to Boeing because of how many graduates went there.  You might as well ask the Colorado School of Mines to divest from the mining industry.",
                "You're not going to get any support by calling what happened on Oct. 7th a \"heroic victory\".",
                "I won't shed a tear for a group that has glorified the Oct 7th attack. They do a disservice to the pro=Palestine movement.\n\n  \n[source](https://medium.com/@super.uw.seattle/we-demand-uw-will-no-longer-be-complicit-in-genocide-0099dc761f92)",
                "Yep that’ll happen.\n\n Protest takes sacrifice",
                "[removed]",
                "From UW this morning:\nDear UW community,\n\nLate yesterday afternoon, a group identifying themselves as the suspended student organization SUPER UW posted on social media that they were occupying the Interdisciplinary Engineering Building on the Seattle campus and asked for other groups to join them. These groups temporarily occupied and vandalized the building before being arrested by law enforcement officers from UWPD, the Seattle Police Department and the Washington State Patrol. They also set fire to dumpsters in a nearby street after blocking exits in the IEB and blocking nearby streets to delay firefighters’ access.\n\nThis was no peaceful protest in support of Palestinian rights or against the war in Gaza. I condemn this dangerous, violent and illegal building occupation and related vandalism. I also condemn in the strongest terms the group’s statement celebrating the Oct. 7, 2023, Hamas terrorist attacks against Israeli civilians. The University will not be intimidated by this sort of horrific and destructive behavior and will not engage in dialogue with any group using or condoning such destructive tactics. We will continue our actions to oppose antisemitism, racism and all forms of biases so that ALL our students, faculty, staff and visitors can feel safe and welcome on our campuses.\n\nKing County jail staff are working to identify the roughly 30 people who were arrested, so at the moment we do not know how many are UW students or community members. We are working with law enforcement and through our own disciplinary processes to ensure those responsible face appropriate consequences for their actions. And we will continue to stand strong against violent and illegal activities that create a hostile environment for any and all members of our community. I want to thank the members of UWPD and our law enforcement partners for their assistance in bringing this situation to a swift resolution.",
                "I know we were all still dumbasses in college, but I just refuse to believe we were this dumb.",
                "They also set a fire 🔥 so I'm a little less empathetic.",
                "Are these people still protesting about Gaza while Trump is speed-running America into a dictatorship?\n\nPriorities.",
                "Fuck these people. Glorifying October 7th into a good thing. Hope they get the entire book thrown at them. They’ve turned Palestine support into straight up terrorist support. Fucking disgusting. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "FBI has opened 250 investigations tied to violent online network '764' that preys on teens, top official says",
            "external_url": "https://abcnews.go.com/US/fbi-opened-250-investigations-tied-violent-online-network/story?id=121480884",
            "upvotes": 2914,
            "date": "05/06/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/03cf45c4-04fd-47e9-aa47-8575d204265d/Barbie-Doll-ht-er-250505_1746474142203_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "> Reflecting what her family described as a typical 764-related encounter, the girl met him on the popular online gaming platform Roblox, and then they began communicating more regularly online, including on Discord, which caters to gamers.\nThe man convinced her he was her boyfriend, and she sent him sexual photos of herself -- the types of images that 764 adherents threaten to share widely if victims don't comply with their escalating demands.\nAccording to police, she had produced an assortment of 764-related content, including a photo of a nude Barbie doll marked with \"764\" on its forehead; photos depicting her cutting herself; and a note, written in her blood, calling her supposed boyfriend \"a god.\"\nAccording to her family, the Connecticut girl was trained to hack into Roblox accounts and lock them -- which allowed her to make demands of account owners if they wanted their accounts back. And she allegedly helped direct a series of threats that rattled Vernon-area schools for three months in late 2023 and early last year.\n\nThis is so disturbing. If these kids say no, they get threatened or their family gets swatted. Unmonitored internet usage is far more dangerous than so many parents realize. People will find creative and horrible ways to contact kids online.",
                "I've never understood why they don't investigate more about the people calling in the SWAT raids. I'm really unfamiliar with how the process works, but there seem to be way too many stories of raids on regular people's homes without much seeming to be done about the false SWATters.",
                "surprise! One of the kids on DOGE is affiliated with Com/764. https://krebsonsecurity.com/2025/02/teen-on-musks-doge-team-graduated-from-the-com/",
                "Yeah, this is the type of online grooming I’m highly concerned about, and I’d much rather time and effort be funneled here.",
                "It must be a weird environment at the FBI right now. Some branches are going after criminals like normal, some are letting crypto scammers off because Trump's one of them, and others are arresting judges and political opponents. Will your whole investigation be a complete waste of time because the criminal/organization buys a pardon off of Trump? Is the guy at the next desk over part of the secret police? Who knows!",
                "“In another federal case, 19-year-old Jack Rocker of Tampa amassed a collection of more than 8,300 videos and images that the Justice Department called \"some of the most horrific, evil content available on the Internet.\" He pleaded guilty in January to possessing child sexual abuse material and was sentenced to seven years in prison.” \n7 years does not seem to be long enough for this type of crime. 8300 videos and images?? And only 7 years?? Make it make sense!!!",
                "If they prey on teens and the FBI considers them domestic terrorists, then a presidential pardon shouldn't be far behind.",
                "It's a good thing the administration is planning to cut the FBI budget.  As they always say, \"Won't you please stop thinking about the children!?\".",
                "Expect this story to disappear once Putin lets trump know that it's Russian agents behind this criminal \"gang\"",
                "> Followers of the 764 network share all sorts of violent content with their victims, while some also glorify past mass-casualty attacks such as the 1999 Columbine High School shooting, or introduce victims to other extreme ideologies like neo-Nazism or Satanism, according to authorities.\n\nOh good, we're doing Satanic Panic again and lumping them in with nazis and mass murderers."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "UK and India agree 'landmark' trade deal - BBC News",
            "external_url": "https://www.bbc.com/news/articles/c5y6y90e5vzo.amp?amp_gsa=1&amp_js_v=a9&usqp=mq331AQIUAKwASCAAgM%3D#amp_tf=From%20%251%24s&aoh=17465387294159&referrer=https%3A%2F%2Fwww.google.com&ampshare=https%3A%2F%2Fwww.bbc.com%2Fnews%2Farticles%2Fc5y6y90e5vzo",
            "upvotes": 117,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/a778/live/54191e20-2a83-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "Not worth the paper it's written on. Love, Canada"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Exclusive: Order by Hegseth to cancel Ukraine weapons caught White House off guard",
            "external_url": "https://www.reuters.com/world/us/order-by-hegseth-cancel-ukraine-weapons-caught-white-house-off-guard-2025-05-06/",
            "upvotes": 10556,
            "date": "05/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Hegseth has seriously cured my imposter syndrome.",
                "The president was unaware. \n\nGet used to hearing that one.",
                "Probably not a good idea to cheat countries while trying to make trade deals with every other country in the world.",
                "The Associated Press reports that the savings will be used to implement \"unlimited jello shots\" at all future DoD meetings.",
                "Ooh, this one makes Trump look bad. That will prob get him replaced.",
                "I don’t understand how everything these dudes do materially helps the Russians and our media is all 🤷",
                "What's wild is that the DOD is running on his impulses. Alcoholism also brings erratic and impulsive behavior. America is so cooked if this regime ever steps down, so much relation building that will forever be at arms distance and the amount of money that will go towards contractors to assess what happened across the entire government in this 4 year period is going to last 2-3 president's at least.\n\nYall fucked",
                "I don't think the mineral deal will still be valid if Russia conquers Ukraine.",
                "**This article is talking about a unilateral stop of Aid in February but Hegseth:**\n\n\n\nThe president was unaware of Hegseth’s order, as were other top national security officials in the meeting, according to two sources briefed on the private White House discussions and another with direct knowledge of the matter.\n\nAsked to comment on this report, the White House told Reuters that Hegseth had followed a directive from Trump to pause aid to Ukraine, which it said was the administration's position at the time. It did not explain why, according to those who spoke to Reuters, top national security officials in the normal decision making process didn’t know about the order or why it was so swiftly reversed.\n\n“Negotiating an end to the Russia-Ukraine War has been a complex and fluid situation. We are not going to detail every conversation among top administration officials throughout the process,” said Karoline Leavitt, the White House spokeswoman. “The bottom line is the war is much closer to an end today than it was when President Trump took office.”\n\nThe cancelations cost TRANSCOM $2.2 million, according to the records reviewed by Reuters. In response to a request for comment, TRANSCOM said that the total cost was $1.6 million – 11 flights were canceled but one incurred no charge.\n\nAn order halting military aid authorized under the Biden administration went into effect officially a month later, on March 4, with a White House announcement.\n\nThe story of how flights were canceled, detailed by Reuters for the first time, points to an at-times haphazard policy-making process within the Trump administration and a command structure that is unclear even to its own ranking members.\n\nThe multiday pause of the flights, confirmed by five people with knowledge of it, also shows confusion in how the administration has created and implemented national security policy. At the Pentagon, the disarray is an open secret, with many current and former officials saying the department is plagued by internal disagreements on foreign policy, deep-seated grudges, and inexperienced staff.\n\nReuters couldn’t establish exactly when Hegseth’s office ordered the freight flights canceled. Two sources said Ukrainian and European officials began asking about the pause on February 2. The TRANSCOM records indicate that there was a verbal order from “SECDEF” – the secretary of defense – that stopped the flights and that they had resumed by February 5.\n\n“This is consistent with the administration's policy to move fast, break things and sort it out later. That is their managing philosophy,” said Mark Cancian, a retired Marine officer and defense expert with the Center for Strategic and International Studies think tank. “That is great for Silicon Valley. But when you’re talking about institutions that have been around for hundreds of years, you are going to run into problems.”\nThe stop in shipments caused consternation in Kyiv.\nThe Ukrainians quickly asked the administration through multiple channels but had difficulty obtaining any useful information, according to a Ukrainian official with direct knowledge of the situation. In later conversations with the Ukrainians, the administration wrote off the pause as “internal politics,” said the source. Ukrainian officials did not respond to requests for comment.\n\nThe shipping of American weapons to Ukraine requires sign-off from multiple agencies and can take weeks or even months to complete, depending on the size of the cargo. The majority of US military assistance goes through a logistics hub in Poland before being picked up by Ukrainian representatives and transported into the country.\n\nThat hub can hold shipments for extended periods of time. It’s not clear if the 11 canceled flights were the only ones scheduled that week in February, how much aid was already stockpiled in Poland and if it continued to flow into Ukraine despite the TRANSCOM orders.\n\nThe revelations come at a time of upheaval in the department. Several of Hegseth’s top advisers were escorted from the building April 15 after being accused of unauthorized disclosure of classified information. The secretary continues to face scrutiny, including from Congress, about his own communications. Previously he’s attributed allegations of upheaval to disgruntled employees.\n\nThe canceled flights contained weapons that had long been approved by the Biden administration, authorized by lawmakers on Capitol Hill.\n\nReuters couldn’t determine if Hegseth or his team knew how the order to TRANSCOM would play out or that the order would be a substantial change in U.S. policy on Ukraine. Three sources familiar with the situation said Hegseth misinterpreted discussions with the president about Ukraine policy and aid shipments without elaborating further.\n\nFour other people briefed on the situation said a small cadre of staffers inside the Pentagon, many of whom have never held a government job and who have for years spoken out against U.S. aid to Ukraine, advised Hegseth to consider pausing aid to the country.\n\nTwo people familiar with the matter denied there was a true cutoff in aid. One of them described it as a logistical pause.\n“(They) just wanted to get a handle on what was going on and people, as a result, misinterpreted that as: ‘You need to stop everything,’” said one.",
                "The Whitehouse has been on guard about something.....ever?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Falsified records, fake donations: Credit Suisse fined for helping rich Americans hide over $4 billion from the taxman",
            "external_url": "https://edition.cnn.com/2025/05/06/business/credit-suisse-fine-americans-tax-evasion-intl",
            "upvotes": 3620,
            "date": "05/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2184011222.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If the profits exceed the fine amount than its just the cost of doing business and nothing will be changed.",
                "Rich Americans will just do anything to avoid paying their fair share. Sure they like to sing about how \"great\" America is while funding non-stop disinformation campaigns (see: Fox News, OANN, etc) trying to the convince American people that the problem is anything, everything but *them*. Billionaires who use this country to make their fortune but then hide their money in offshore accounts are the least patriotic citizens among us - and now we have an administration made up entirely of these leeches.",
                "They'd rather pay a crooked banker to doctor the records than let anyone needy benefit from their hoarded wealth.\n\nEveryone who participated in this should be in jail.",
                "Who went to jail for these crimes?",
                "I doubt the fine will approach the $4 billion. Why would they stop doing this if they still profit?",
                "Should send the rich Americans to prison. Oh wait that's for the poor.",
                "Slap on the wrist. Go back to laundering money for the elite and wait for your next slap on the wrist.",
                "There is no Credit Suisse anymore.",
                "And the “Americans” hiding the money? Pardoned by our anti-American “president” no doubt",
                ">UBS, which acquired Credit Suisse in 2023, said Monday that Credit Suisse Services pleaded guilty to one count of conspiracy to aid and assist in the preparation of false income tax returns.\n\nOkay so now go after those who filed false income tax returns."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Supreme Court upholds Trump's ban on transgender military members while appeals continue.",
            "external_url": "https://www.npr.org/2025/05/06/nx-s1-5388507/supreme-court-transgender-military",
            "upvotes": 3285,
            "date": "05/06/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5566x3131+0+290/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F09%2F5f%2F69ad07ce43bfb90d1e44c599d837%2Fgettyimages-2157829281-10.jpg",
            "top_comments": [
                "Says the draft dodger",
                "Trump reinstated service members who refused to take the COVID-19 vaccine. (The same vaccine Donald Trump, himself, took) Nearly 100 service members died. A half a million were infected. But, lets kick out transgendered troops.",
                "[deleted]",
                "Funny how SCOTUS typically leans on the side of allowing harm when it benefits the prejudices of their base.",
                "Transgender people are the canary in the coal mine. However you may feel, if they are not free to be themselves, then none of us are... Fun fact: All those books the Nazis began with burning was transgender medical research. Up until that time, Berlin was the world leader in healthcare. We know what they ended with burning...",
                "According to their logic it is arrogant and selfish to be trans, thus disqualifying, so I guess 100% of the Trump admin are also unfit to serve in the military.",
                "You can’t have trans people in the military when the military starts rounding up trans people. It’s a conflict of interest you see…",
                "it's so insane to me to tell someone their life isn't good enough to sacrifice?",
                "Doesn’t the military have a recruitment issue as it is?\n\nIsn’t it counterproductive to deny the (realistically) dozens of transgenders looking to enlist?",
                "The Census Bureau has the number of trans people in the US pegged at 2.6 million out of 340 million Americans. For the room temperature IQ maga's in the room with us that's less than 1% of the population. \n\nOf that 1% of the population how many do you think are in the military? Again for the room temperature IQ, at most still less than 1% of the US population. \n\n1% of the US population they're mad at and for what reason?\n\nRidiculous."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "More than 25 protesters arrested after taking over University of Washington building",
            "external_url": "https://abcnews.go.com/US/protesters-university-washington-building/story?id=121505881",
            "upvotes": 5829,
            "date": "05/06/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8b79e615-2538-4cc9-b752-cde7df424dcd/uw-police_1746525294015_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Demanding that UW cut ties with Boeing is insane, the joke among engineering students was that there were secret WW2 tunnels from the engineering department directly to Boeing because of how many graduates went there.  You might as well ask the Colorado School of Mines to divest from the mining industry.",
                "You're not going to get any support by calling what happened on Oct. 7th a \"heroic victory\".",
                "I won't shed a tear for a group that has glorified the Oct 7th attack. They do a disservice to the pro=Palestine movement.\n\n  \n[source](https://medium.com/@super.uw.seattle/we-demand-uw-will-no-longer-be-complicit-in-genocide-0099dc761f92)",
                "Yep that’ll happen.\n\n Protest takes sacrifice",
                "[removed]",
                "From UW this morning:\nDear UW community,\n\nLate yesterday afternoon, a group identifying themselves as the suspended student organization SUPER UW posted on social media that they were occupying the Interdisciplinary Engineering Building on the Seattle campus and asked for other groups to join them. These groups temporarily occupied and vandalized the building before being arrested by law enforcement officers from UWPD, the Seattle Police Department and the Washington State Patrol. They also set fire to dumpsters in a nearby street after blocking exits in the IEB and blocking nearby streets to delay firefighters’ access.\n\nThis was no peaceful protest in support of Palestinian rights or against the war in Gaza. I condemn this dangerous, violent and illegal building occupation and related vandalism. I also condemn in the strongest terms the group’s statement celebrating the Oct. 7, 2023, Hamas terrorist attacks against Israeli civilians. The University will not be intimidated by this sort of horrific and destructive behavior and will not engage in dialogue with any group using or condoning such destructive tactics. We will continue our actions to oppose antisemitism, racism and all forms of biases so that ALL our students, faculty, staff and visitors can feel safe and welcome on our campuses.\n\nKing County jail staff are working to identify the roughly 30 people who were arrested, so at the moment we do not know how many are UW students or community members. We are working with law enforcement and through our own disciplinary processes to ensure those responsible face appropriate consequences for their actions. And we will continue to stand strong against violent and illegal activities that create a hostile environment for any and all members of our community. I want to thank the members of UWPD and our law enforcement partners for their assistance in bringing this situation to a swift resolution.",
                "I know we were all still dumbasses in college, but I just refuse to believe we were this dumb.",
                "They also set a fire 🔥 so I'm a little less empathetic.",
                "Are these people still protesting about Gaza while Trump is speed-running America into a dictatorship?\n\nPriorities.",
                "Fuck these people. Glorifying October 7th into a good thing. Hope they get the entire book thrown at them. They’ve turned Palestine support into straight up terrorist support. Fucking disgusting. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "FBI has opened 250 investigations tied to violent online network '764' that preys on teens, top official says",
            "external_url": "https://abcnews.go.com/US/fbi-opened-250-investigations-tied-violent-online-network/story?id=121480884",
            "upvotes": 2913,
            "date": "05/06/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/03cf45c4-04fd-47e9-aa47-8575d204265d/Barbie-Doll-ht-er-250505_1746474142203_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "> Reflecting what her family described as a typical 764-related encounter, the girl met him on the popular online gaming platform Roblox, and then they began communicating more regularly online, including on Discord, which caters to gamers.\nThe man convinced her he was her boyfriend, and she sent him sexual photos of herself -- the types of images that 764 adherents threaten to share widely if victims don't comply with their escalating demands.\nAccording to police, she had produced an assortment of 764-related content, including a photo of a nude Barbie doll marked with \"764\" on its forehead; photos depicting her cutting herself; and a note, written in her blood, calling her supposed boyfriend \"a god.\"\nAccording to her family, the Connecticut girl was trained to hack into Roblox accounts and lock them -- which allowed her to make demands of account owners if they wanted their accounts back. And she allegedly helped direct a series of threats that rattled Vernon-area schools for three months in late 2023 and early last year.\n\nThis is so disturbing. If these kids say no, they get threatened or their family gets swatted. Unmonitored internet usage is far more dangerous than so many parents realize. People will find creative and horrible ways to contact kids online.",
                "I've never understood why they don't investigate more about the people calling in the SWAT raids. I'm really unfamiliar with how the process works, but there seem to be way too many stories of raids on regular people's homes without much seeming to be done about the false SWATters.",
                "surprise! One of the kids on DOGE is affiliated with Com/764. https://krebsonsecurity.com/2025/02/teen-on-musks-doge-team-graduated-from-the-com/",
                "Yeah, this is the type of online grooming I’m highly concerned about, and I’d much rather time and effort be funneled here.",
                "It must be a weird environment at the FBI right now. Some branches are going after criminals like normal, some are letting crypto scammers off because Trump's one of them, and others are arresting judges and political opponents. Will your whole investigation be a complete waste of time because the criminal/organization buys a pardon off of Trump? Is the guy at the next desk over part of the secret police? Who knows!",
                "“In another federal case, 19-year-old Jack Rocker of Tampa amassed a collection of more than 8,300 videos and images that the Justice Department called \"some of the most horrific, evil content available on the Internet.\" He pleaded guilty in January to possessing child sexual abuse material and was sentenced to seven years in prison.” \n7 years does not seem to be long enough for this type of crime. 8300 videos and images?? And only 7 years?? Make it make sense!!!",
                "If they prey on teens and the FBI considers them domestic terrorists, then a presidential pardon shouldn't be far behind.",
                "It's a good thing the administration is planning to cut the FBI budget.  As they always say, \"Won't you please stop thinking about the children!?\".",
                "Expect this story to disappear once Putin lets trump know that it's Russian agents behind this criminal \"gang\"",
                "> Followers of the 764 network share all sorts of violent content with their victims, while some also glorify past mass-casualty attacks such as the 1999 Columbine High School shooting, or introduce victims to other extreme ideologies like neo-Nazism or Satanism, according to authorities.\n\nOh good, we're doing Satanic Panic again and lumping them in with nazis and mass murderers."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Road rage victim in Arizona resurrected through AI to deliver his own impact statement",
            "external_url": "https://www.denver7.com/science-and-tech/artificial-intelligence/arizona-family-uses-ai-to-create-road-rage-victims-own-impact-statement",
            "upvotes": 177,
            "date": "05/06/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/b39d689/2147483647/strip/true/crop/1920x1008+0+36/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Ff5%2Fc8%2Fec26a091450ebc0fc0f77b637e21%2Ftwo-slot-5.png",
            "top_comments": [
                "just seems disrespectful and manipulative.",
                "Make the victim say whatever we want. Should not have been allowed.",
                "“your honor, I am unable to generate an impact statement that meets our content guidelines.”",
                "Am I going to have to put it in my will to not do this?\n\nI’m 36 so that’s never been a thought before\n\nHow expensive would it be to have a will with that one provision just in case? Like could I find a lawyer who could draft that in under an hour and not charge me through the roof?",
                "Cyberpunk type of horror beyond human understanding",
                ">It was the first time in Arizona judicial history — and possibly nationwide — that AI has been used to create a deceased victim’s own impact statement.\n\n[A ghost testified at trial in the 1890s](https://wvtourism.com/ghost-who-gave-legal-testimony/). So, this isn't quite that far-fetched.",
                "ahh really respective to the dead, what's next? Tying strings to him and puppeting his corpse in the hearing?",
                "This feels like some black mirror type shit. The 20 ai ads in this thread doesnt help...",
                "Impact statements are supposed to be written from the perspective of the living relatives and friends, not the dead victim",
                "\"So you won't say what we want you to? Ok. We will 'accident you' and make AI say it for you, then.\""
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump directs Department of Justice to try to free Tina Peters from prison in social media post",
            "external_url": "https://www.cpr.org/2025/05/05/trump-directs-department-of-justice-to-try-to-free-tina-peters-from-prison-in-social-media-post/",
            "upvotes": 456,
            "date": "05/06/2025",
            "thumbnail": "https://wp-cpr.s3.amazonaws.com/uploads/2022/04/220409-GOP-ASSEMBLY-PETERS-HV-0002.jpg",
            "top_comments": [
                "A couple of reminders:\n\nTina Peters was convicted of Colorado state law felonies by a Colorado jury and sentenced by a Colorado judge and is serving nine years in a Colorado prison.  \n\nShe has never professed innocence:  instead, she has asserted falsely that her interference in the elections she was entrusted with administering was justified by large-scale fraud by others.\n\nToday's social-media fart by the President is inflammatory, but not wholly insane.\n\nDOJ is pursuing a Federal habeas corpus writ to get Peters out of prison while she pursues appeals.  That writ keeps getting denied because her state level appeals are not exhausted.\n\nPeters has not applied for state clemency.",
                ">“Tina is an innocent Political Prisoner being horribly and unjustly punished in the form of Cruel and Unusual Punishment,” he wrote.\n\nOh you mean like Kilmar Abrego Garcia, you dementia addled twit?",
                "She was convicted on state charges. You know. Like the state's right to enforce, properly try and convict a citizen of that state when it runs afoul of a proper law?",
                "Trump is such a corrupt sleaze bag. Trying to destroy our rule of law.",
                "They should be happy we applied the rule of law and she had her due process rights and was properly convicted.",
                "Tries to free a felon and lets an innocent man rot in an El Salvadoran torture prison.\n\nThe Republican party for you.",
                "If she was brown, Trump would have her in El Salvador.",
                "He’s going to facilitate her release, is that what I’m hearing?",
                "Trump himself has 32 felony convictions. One felon trying to jailbreak another felon. And no one seems to have the basic sense to see that this is what is going on!",
                "He is like:  she backed my lie"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Exclusive: Order by Hegseth to cancel Ukraine weapons caught White House off guard",
            "external_url": "https://www.reuters.com/world/us/order-by-hegseth-cancel-ukraine-weapons-caught-white-house-off-guard-2025-05-06/",
            "upvotes": 10547,
            "date": "05/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Hegseth has seriously cured my imposter syndrome.",
                "The president was unaware. \n\nGet used to hearing that one.",
                "Probably not a good idea to cheat countries while trying to make trade deals with every other country in the world.",
                "The Associated Press reports that the savings will be used to implement \"unlimited jello shots\" at all future DoD meetings.",
                "Ooh, this one makes Trump look bad. That will prob get him replaced.",
                "I don’t understand how everything these dudes do materially helps the Russians and our media is all 🤷",
                "What's wild is that the DOD is running on his impulses. Alcoholism also brings erratic and impulsive behavior. America is so cooked if this regime ever steps down, so much relation building that will forever be at arms distance and the amount of money that will go towards contractors to assess what happened across the entire government in this 4 year period is going to last 2-3 president's at least.\n\nYall fucked",
                "I don't think the mineral deal will still be valid if Russia conquers Ukraine.",
                "**This article is talking about a unilateral stop of Aid in February but Hegseth:**\n\n\n\nThe president was unaware of Hegseth’s order, as were other top national security officials in the meeting, according to two sources briefed on the private White House discussions and another with direct knowledge of the matter.\n\nAsked to comment on this report, the White House told Reuters that Hegseth had followed a directive from Trump to pause aid to Ukraine, which it said was the administration's position at the time. It did not explain why, according to those who spoke to Reuters, top national security officials in the normal decision making process didn’t know about the order or why it was so swiftly reversed.\n\n“Negotiating an end to the Russia-Ukraine War has been a complex and fluid situation. We are not going to detail every conversation among top administration officials throughout the process,” said Karoline Leavitt, the White House spokeswoman. “The bottom line is the war is much closer to an end today than it was when President Trump took office.”\n\nThe cancelations cost TRANSCOM $2.2 million, according to the records reviewed by Reuters. In response to a request for comment, TRANSCOM said that the total cost was $1.6 million – 11 flights were canceled but one incurred no charge.\n\nAn order halting military aid authorized under the Biden administration went into effect officially a month later, on March 4, with a White House announcement.\n\nThe story of how flights were canceled, detailed by Reuters for the first time, points to an at-times haphazard policy-making process within the Trump administration and a command structure that is unclear even to its own ranking members.\n\nThe multiday pause of the flights, confirmed by five people with knowledge of it, also shows confusion in how the administration has created and implemented national security policy. At the Pentagon, the disarray is an open secret, with many current and former officials saying the department is plagued by internal disagreements on foreign policy, deep-seated grudges, and inexperienced staff.\n\nReuters couldn’t establish exactly when Hegseth’s office ordered the freight flights canceled. Two sources said Ukrainian and European officials began asking about the pause on February 2. The TRANSCOM records indicate that there was a verbal order from “SECDEF” – the secretary of defense – that stopped the flights and that they had resumed by February 5.\n\n“This is consistent with the administration's policy to move fast, break things and sort it out later. That is their managing philosophy,” said Mark Cancian, a retired Marine officer and defense expert with the Center for Strategic and International Studies think tank. “That is great for Silicon Valley. But when you’re talking about institutions that have been around for hundreds of years, you are going to run into problems.”\nThe stop in shipments caused consternation in Kyiv.\nThe Ukrainians quickly asked the administration through multiple channels but had difficulty obtaining any useful information, according to a Ukrainian official with direct knowledge of the situation. In later conversations with the Ukrainians, the administration wrote off the pause as “internal politics,” said the source. Ukrainian officials did not respond to requests for comment.\n\nThe shipping of American weapons to Ukraine requires sign-off from multiple agencies and can take weeks or even months to complete, depending on the size of the cargo. The majority of US military assistance goes through a logistics hub in Poland before being picked up by Ukrainian representatives and transported into the country.\n\nThat hub can hold shipments for extended periods of time. It’s not clear if the 11 canceled flights were the only ones scheduled that week in February, how much aid was already stockpiled in Poland and if it continued to flow into Ukraine despite the TRANSCOM orders.\n\nThe revelations come at a time of upheaval in the department. Several of Hegseth’s top advisers were escorted from the building April 15 after being accused of unauthorized disclosure of classified information. The secretary continues to face scrutiny, including from Congress, about his own communications. Previously he’s attributed allegations of upheaval to disgruntled employees.\n\nThe canceled flights contained weapons that had long been approved by the Biden administration, authorized by lawmakers on Capitol Hill.\n\nReuters couldn’t determine if Hegseth or his team knew how the order to TRANSCOM would play out or that the order would be a substantial change in U.S. policy on Ukraine. Three sources familiar with the situation said Hegseth misinterpreted discussions with the president about Ukraine policy and aid shipments without elaborating further.\n\nFour other people briefed on the situation said a small cadre of staffers inside the Pentagon, many of whom have never held a government job and who have for years spoken out against U.S. aid to Ukraine, advised Hegseth to consider pausing aid to the country.\n\nTwo people familiar with the matter denied there was a true cutoff in aid. One of them described it as a logistical pause.\n“(They) just wanted to get a handle on what was going on and people, as a result, misinterpreted that as: ‘You need to stop everything,’” said one.",
                "The Whitehouse has been on guard about something.....ever?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Two of our dinosaurs are missing - head ranger",
            "external_url": "https://www.bbc.co.uk/news/articles/cly5dk219gwo",
            "upvotes": 246,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0c14/live/c93ab230-29b2-11f0-a252-f789f44e224b.jpg",
            "top_comments": [
                "I can't imagine the people who steal dino animatronics are the type to be low key, and wont go posting them all over social media(or have friends that do so).",
                "Turok, if you had anything to do with this...",
                "Who steals a dinosaur??!",
                "For the curious, as I was it is little more than a guy walking around in a rubber suit. \n\nhttps://raptorsworld.co.uk/",
                "Life will...uhh....errr.....ummm.....find a way.",
                "Goddammit Phil you had *one job*. *One* job. My sainted grandmother would be a better Dinosaur Supervisor than you Phil Tippets!",
                "Ace Ventura IV: Ace goes Jur-ass-ic",
                "Listen up, boy, or pornography starring your mother will be the second worst thing that happens to you today. This Boneburgler has already breached our defenses...(Points to *Please dont steal this sign*)... worst of all, he could be any one of us! \n\nHe could be in this very room! He could be you! He could be me! He could even be....",
                "Have they checked their other pants?",
                "Open the door, get on the floor, someone walked off with the dinosaur"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Germany's Merz falls short of majority in vote for chancellor",
            "external_url": "https://www.bbc.com/news/articles/cvgp22zlrgko",
            "upvotes": 1149,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/76e1/live/3e100270-2a8c-11f0-b6cf-130123c0aa42.jpg",
            "top_comments": [
                "I think this shouldn't lead to anything too bad. I assume the no votes come from hardliners in the Union who disliked his debt brake agreement. According to the bundestag website they have 14 days for the second round during which they'll do backroom deals, and even if that fails the third round only requires a plurality not a majority of votes. \n\nWorst case scenario would be Merz elected by plurality but he is then immediately toppled by a no confidence vote resulting in new elections. However I doubt the Greens or even the Left would do so since polling for the AfD has only increased since early this year.\n\nAt least this is my speculation feel free to correct me.",
                "That’s definitely a blow for him, but I think he should meet with the dissidents and understand their reasons and make an agreement. That’s politics and will show if he can make bridges with the adversaries.  At least one more time he should be given the chance to form government.",
                "This was only the first vote! Behold! As there still can be two more. But this has never happened before, so I'm all excited for round two. 😄",
                "Time for back room deals.",
                "He probably shouldn’t have allied him self with the extremist right wing party AfD and he probably shouldn’t kept the last government’s budget short just to abandon all his strong hesitations about the budged once he himself headed toward office…",
                "Starts his tenure with a broken deal. Fitting.",
                "To quite Nelson from The Simpsons :\n\n\nHaha!",
                "Some German MPs could be in Russia's pocket. It's not without precedent.",
                "Die Rache von Saskia Esken und Olaf Scholz 😊",
                "A clear set up by Trump and Musk, after they declared the Afd an extremist organization."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US Defense Secretary Hegseth to slash senior-most ranks of military",
            "external_url": "https://www.reuters.com/world/us/pentagon-reduce-4-star-positions-by-20-official-says-2025-05-05/",
            "upvotes": 39872,
            "date": "05/05/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This includes removing the Chairman of the Joint Chiefs of Staff, the Navy's top admiral and other senior flag officers from their positions.",
                "Imagine achieving the highest rank in the military over a lifetime of excellence & devotion ... only to be relieved of command by this chode.\n\n  \nedit. used relieved rather than fired.",
                "You gotta remove the guys who won’t do fascism for you, y’know?",
                "Genuinely troubling. These are the few people most likely to stand up against an unconstitutional order.",
                "The cleanup after this administration will be monumental and take decades. America is in the process of learning an intensely painful lesson.",
                "For all the noise conservatives make when democratic presidents are in charge, screeching about tyranny... I've never been more afraid of the government than I have been the last four months. And it is getting worse every day.  Something has got to give. The mid terms need to be fucking tidal wave\n\nEdit: yeah, yeah, I get it, \"there won't be midterms\"... Well what the fuck are you doing, then?  You got a militia I can join? Otherwise, propose a fucking solution. Because I'll be phone banking, donating, knocking on doors and doing the best my household can to democratically pull this shit back.",
                "*\"More generals and admirals does not lead to more success,\" Hegseth said in a video posted on X.*\n\nThis is coming from a Fox News weekend TV host - someone with absolutely zero experience to say something like that. \n…\n\n*\"This is not a slash and burn exercise meant to punish high ranking officers, nothing could be further from the truth,\" he said.*\n\nSooooo, it’s a slash and burn exercise meant to punish high ranking officers.",
                "Yeah, so when they stage the coup for the third term there is no one at the top to defy them.",
                "I can’t imagine being a general and having this hot dog fire you. After leaking literal war plans in multiple group chats.",
                "Getting rid of any military leaders who swore allegiance to the US Constitution, and not Trump before they are deployed to oppress Americans."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/06/2025 20:10:30 UTC"
}