{
    "posts": [
        {
            "category": "HOT",
            "title": "Former Rep. George Santos sentenced to 87 months in New York federal fraud case",
            "external_url": "https://www.cnbc.com/2025/04/25/george-santos-fraud-sentence-congress.html",
            "upvotes": 14263,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136734-17455932402025-04-25t145727z_1834006727_rc225eatuykw_rtrmadp_0_usa-congress-santos.jpeg?v=1745609921&w=1920&h=1080",
            "top_comments": [
                "What a way to treat the man who not only founded New York, but built Central Park with his own three hands.",
                "Former Rep. George Santos, whose web of [lies](https://www.cnbc.com/2023/01/19/rep-george-santos-pushes-back-on-insane-reports-he-took-funds-for-veterans-dying-dog.html) about his life led to his expulsion from Congress, was sentenced Friday to more than seven years in prison in his federal fraud case.\n\nThe New York Republican must also pay restitution of $373,750, a judge ruled in U.S. District Court in Long Island.\n\nSantos admitted last August to engaging in a multi-pronged campaign finance scheme, stealing unemployment benefits during the Covid-19 pandemic, and lying on House financial disclosure forms.\n\nAs part of an agreement with prosecutors, Santos pleaded guilty to a single count each of wire fraud and aggravated identity theft. He also agreed to restitution and forfeiture totaling nearly $580,000.",
                "Does Vegas have over under on how long he actually spends in prison and is it .5 days cause at this rate I feel it’s more likely the judge who sentenced him somehow is arrested some made up charges than this guy seeing a cell.",
                "Federal?\n\nI give it 48 hours until he's pardoned.",
                "George Santos is, hands down, the best minor villain America has ever seen. His story is absolutely wild. And not merely because he has a drag-queen alter ego, [Kitara Rivache](https://www.nbcnews.com/nbc-out/out-politics-and-policy/george-santos-says-will-revive-drag-queen-persona-cameo-rcna149867).\n\nThe Republican party is an organized crime syndicate. Like the mob, [the GOP happily protected Santos from expulsion](https://apnews.com/article/george-santos-expel-house-republicans-new-york-249bd2341d157bc6727b77607d8d45ae) when he merely deceived voters with financial fraud.\n\nBut, Santos broke the most important rule in organized crime: don't steal from the mob. [Santos sent emails to Senator Kevin McCarthy's wealthy donors claiming to be McCarthy's fundraiser. Santos siphoned money from McCarthy's campaign into his own](https://www.cnbc.com/2023/01/09/george-santos-raised-money-from-wealthy-gop-donors-while-lying-about-his-resume.html).\n\nThat was the last straw. [Republicans joined Democrats in a second ethics vote against Santos, successfully removing the disgraced representative from Congress](https://www.cbsnews.com/news/who-voted-to-expel-george-santos/).",
                "Former President Santos going to prison, wow. ",
                "To all the snarky “he’s gonna get pardoned” comments, no he fucking isn’t lol. This dude was an absolute nobody before coming into the picture and deeply embarrassed a lot of really powerful people. I could be mistaken but I don’t think a single republican has spoken up in defense of Santos with any meaningful weight beyond maybe a broad platitude about democrats being worse or something. If he didn’t plead guilty they would have 100% thrown the book at him.",
                "Hell fuck yes let's GOOOOOO.\n\nFuck this prick 😂😂😂😂\n\nEdit: LMAOOOOOO. Imagine being a complete prick online, CONTINUE to lie, and have the balls to ask for 2 years only to get screwed over for online behavior 😂😂😂😂😂😂 Enjoy those 7 years, ~~Anthony Santos~~, George Santos, ~~Anthony Devolder~~, ~~George Anthony Devolder~~, ~~George Devolder~~, ~~George A.D. Santos~~, ~~Anthony Zabrovsky~~, ~~George Anthony Santos-Devolder~~, ~~Katara Ravache~~, ~~GADS~~",
                "his father, the inventor of toaster strudel, will not be very happy with this.",
                "He’s getting pardoned"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "FBI arrests Wisconsin judge for alleged immigration arrest obstruction",
            "external_url": "https://www.cnbc.com/2025/04/25/fbi-arrest-judge-hannah-dugan-milwaukee.html",
            "upvotes": 41853,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136765-17455967922025-04-25t155724z_1252469857_rc235eacvo1d_rtrmadp_0_usa-fbi-judge.jpeg?v=1745596837&w=1920&h=1080",
            "top_comments": [
                "That's 2 judges in 2 days.",
                "Meanwhile, trump recently pardoned a judge in Nevada who committed fraud related to a ~~veterans charity~~ honoring a slain police officer. \n\nIf that didn’t enrage you enough, that judge had no law degree and said she was looking forward to getting back on the bench.\n\nEdit: she stole money that was supposed to go to a fund for a slain officer for personal expenses.....like plastic surgery. \n\nFrom ABC\n\n*President Trump has pardoned a Las Vegas politician convicted last year of using money meant for a statue honoring a slain police officer on personal costs, including plastic surgery.*\n\n*Michele Fiore, a former city councilwoman and Nevada state lawmaker, was* [*found guilty in October*](https://apnews.com/article/republican-michele-fiore-guilty-wire-fraud-nevada-5844d79dacf0bfd6b43d36e03eb6cd95) *of six counts of federal wire fraud and one count of conspiracy to commit wire fraud. She was out of custody ahead of a sentencing scheduled for next month.*\n\n*Federal prosecutors alleged during trial that Fiore, 54, had raised more than $70,000 for the statue of a Las Vegas police officer who was fatally shot in 2014 in the line of duty, but had instead spent some of the funds on cosmetic surgery, rent and her daughter's wedding.*\n\n*Fiore, who does not have a law degree, was appointed as a judge in deep-red Nye County in 2022 shortly after she lost her campaign for state treasurer. She was elected in June 2024 to complete the unexpired term of a judge who died but had been suspended without pay amid her legal troubles. Pahrump is an hour's drive west of Las Vegas.*",
                "Is this record time to go from \"Stop overreacting\" to \"we are literally arresting judges\"",
                "Find this beyond alarming given he fully pardoned a judge in Nevada who was caught red handed pocketing money raised for a police memorial. Was an open and shut case. \n\nShe said it was god’s doing and borderline called Trump a deity. I shit you not. She’s back in court like next week.",
                "Just want to add a historical note that in the Declaration of Independence there is a mention that if a government becomes oppressive, the people have the right to abolish it.",
                "So Trump is sending his crony at the FBI, Kash Patel, to arrest judges standing up to him.\n\n*Yeah, that's definitely the sign of a properly functioning democracy.*",
                "Guys? You're under reacting. way under reacting",
                "Everyone in this administration deserves to end up in prison when this is all over. ",
                "Time for the National Strikes to begin. If they are arresting judges now for upholding the law, there is nothing left for this country. Time to shut it all down.",
                ">Patel wrote on X that the FBI believes Milwaukee Circuit Court Judge Hannah Dugan “intentionally misdirected federal agents away” from Eduardo Flores Ruiz as agents were attempting to arrest him at her courthouse last week.\n\nIt’s not what you believe, it’s what you can prove. It will be interesting to see what kind of case they have but my money is on the FBI over reaching here."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Russian general killed in car blast hours before US envoy’s Kremlin meeting",
            "external_url": "https://www.theguardian.com/world/2025/apr/25/russian-general-killed-car-blast-hours-before-us-envoy-kremlin-meeting-yaroslav-moskalik",
            "upvotes": 24880,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4beba3175180dee351a337f00ebd19d16476b431/0_512_7846_4708/master/7846.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=61cb3211834c5c69e12d02d112f966b7",
            "top_comments": [
                "Imagine scheduling peace talks and getting met with *“please hold, your general has exploded.”*",
                "He shouldn't have provoked the bomb, if he didn't want to be blown up.",
                "Was he supposed to meet with Vance. He’s the harbinger of death",
                "Are ya'll just finding out about this? Some dude named Pete texted me about it days ago.",
                "Oh well. No harm done.",
                "First thing I thought was, who did it. Ukrainians, anti war Russians, or Putin himself?",
                "Finally some good news",
                "Ukraine lurking in the Signal chats.",
                "Looks better than a window lintel, doesn't it?",
                "Did he even say thank you?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "US prosecutors to seek death penalty against Luigi Mangione in UnitedHealth executive’s murder",
            "external_url": "https://www.reuters.com/world/us/prosecutors-file-formal-notice-plan-seek-death-penalty-luigi-mangione-2025-04-25/",
            "upvotes": 5736,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Mass shooter at a school? Life in prison.\n\n\nKill a rich person? DEATH PENALTY.",
                "They want to make an example out of him. Shame that our government cares more about the life of one CEO than it does about the wellbeing of its citizens who are forced to rely on substandard health insurance coverage and labyrinthian claims processes.",
                "In justifying their decision, prosecutors wrote in their filing that Mangione \"presents a future danger because he expressed an intent to target an entire industry, and rally political and social opposition to that industry, by engaging in an act of lethal violence.\"",
                "Interesting to note that racially motivated mass shooters don't get the prosecutors this bloodthirsty for a death penalty case (and the cops will take them out for burger king on the way to jail in some cases!)",
                "Oh, they're making an example all right lol. The example being that if you have nothing to lose, may as well take out a rich fucker or two on the way out. Fucking idiots.",
                ">Mr Mangione is facing 11 state criminal counts in New York, including first-degree murder and murder as a crime of terrorism.\n\n\n>But federal prosecutors have also separately charged Mr Mangione for using a firearm to commit murder and interstate stalking resulting in death. These charges make him eligible for the death penalty.\n\nFar be it from me to want to bring up DOGE, but if the state has a really good case, why is the federal government piling on and wasting taxpayer money? It's possible *if* something jury nullification comes into play and the accused is acquitted on all charges on the state level, the federal government can still step in and charge this man for the crimes listed above. But that's only if something like an acquittal happens at the state level, for something like jury nullification.",
                "Is it normal for the attorney general to taint a trial by calling the defendant a murderer on live TV? You know, before any juries have been selected?",
                "are we even sure he did it",
                "Last i checked a significant amount of school shooters have not gotten the death penalty?",
                "They just gave the highland park shooter life in prison for killing 7 and injuring atleast a dozen others but this dude gets one rich dude and they'll probably chop his head off on live TV"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Elon Musk's social media platform X sues Minnesota over political deepfake ban | MPR News",
            "external_url": "https://www.mprnews.org/episode/2025/04/24/elon-musk-social-media-platform-x-sues-minnesota-political-deepfake-ban",
            "upvotes": 2290,
            "date": "04/25/2025",
            "thumbnail": "https://img.apmcdn.org/caab343605b8e3130e9316b76da4c3fc3f3bafd5/widescreen/fec767-20250330-wisconsin-supreme-court-2000.jpg",
            "top_comments": [
                "So Elon musk, who has several years worth of history of posting nazi propaganda on Twitter, is sueing because a law saw people can't use AI to create deepfakes to intentionally spread political misinformation.\n\nI mean, aside from all the other awful shit he has done, does anyone really need anymore proof musk is an evil narcissistic psycho?",
                "Sueing to spread political disinformation sounds like a stupid idea and only proves that you and your platform shouldn't be trusted.",
                "That guy is a taint barnacle",
                "In the spirit of Musk's concerns: Never, ever stop creating and posting deep fakes of Elon Musk openly bragging about rigging the 2024 election.",
                "I'm so sick of malignant narcissist billionaires.\n\n*I apologize for being redundant though.*",
                "He's suing for the right to deliberately mislead and lie to people. P. O. S",
                "Elons just doing this to fuck with Tim Walz",
                "\"“requirements are so vague and unintelligible that social media platforms cannot understand what the statute permits and what it prohibits\"\n\nUh... maybe don't make shit up? How is that so fucking difficult to understand?",
                "I can't wait for this cunt to exit the planet.",
                "Musk is only filing suit because he personally would be responsible for generating most of it."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Manhattan DA says attorney raped, electro-shocked, tortured women in his apartment",
            "external_url": "https://gothamist.com/news/manhattan-da-says-attorney-raped-electro-shocked-tortured-women-in-his-apartment",
            "upvotes": 3549,
            "date": "04/25/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350893/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "[More info](https://apnews.com/article/manhattan-private-equity-sexual-assault-93890bd429eaf864407207c55f7a7ee5):\n\n>A private equity executive turned his New York City apartment into a torture chamber of “grotesque sexual violence,” Manhattan prosecutors said Thursday. He is accused of raping six women over five months in a depraved rampage in which he allegedly punched, waterboarded and shocked victims with a cattle prod and kept recordings of the assaults as trophies.\n\n>Ryan Hemphill, who remains jailed after his arrest last month, pleaded not guilty to a 116-count indictment charging him with predatory sexual assault and other crimes dating to last October. The 43-year-old, who is also a lawyer, threatened to have victims arrested or disappeared in a bid to keep them silent, prosecutors said.",
                "Found a pic of him from the last time he got in trouble for abusing women:\n\n[https://archive.ph/wU24j](https://archive.ph/wU24j)",
                "Holy shit private equity executive. These people are fucked. ",
                "From the comments on the article:\n\n>Zazuum\n>17h ago\n\n>Outside of his professional endeavors, Ryan Hemphill is a committed philanthropist who is passionate about giving back to his community and others around the world. Ryan operated as Youth Ambassador to the NGO Voices of African Mothers for the former CFO of UN Peacekeeping where he helped initiate the development of a school for young women in Ghana. In 2009, Ryan Hemphill coordinated and directed the Bronx Opera Children’s Program, which performs excerpts of the latest Bronx Opera productions for schoolchildren between the ages of 5 and 15 in order to give them access the arts when they may not be able to experience it otherwise.\n\n>^ Well, someone needs to check both programs",
                "It concerns me that he worked overseas with children. If he's willing to torture and threaten these women here in America, imagine the fucked up crimes he potentially committed in developing countries.",
                "[removed]",
                "https://ryanhemphill.nyc/",
                "I bet this guy has an amazing business card.",
                "The AUDACITY to plead Not Guilty. 🤬",
                "[removed]"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "ICE is reversing termination of legal status for international students around US, lawyers say",
            "external_url": "https://apnews.com/article/international-student-status-restored-9e8a7cb90f4193ec52bf06edc5094cd9",
            "upvotes": 1267,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Monday headlines: Trump tells ICE to revoke legal status.  Tuesday headline- ICE reverts status once again.",
                "It's not going to matter much. The uncertainty around it just makes everything worse.\n\nWe have an administration who shrugs when they accidentally deport the wrong person, actively goes after judges in every way they can, and I wouldn't be surprised to see issuing brown boots to ICE.\n\nThe world has seen what we are becoming, even if a dark part of our own population is in denial about it.",
                "I’m tired of hearing fatalist remarks about how this doesn’t matter. We can’t secede our power and need to keep the fight going. Inch by inch, if necessary. This is a good sign that the administration is responding to legal action and pushback.",
                "The protests are working. If you go to them, keep it up.",
                "This was always evil and cruel. \n\nBut on a dumber level, this shit is WASTEFUL and EXPENSIVE. \n\nThis messy administration and DOGE boys will cost us billions and billions at the end of the day. Because all of this costs us time and money.",
                "Lol they are about to find out how much international students' exorbitant tuitions subsidy domestic students'. You think paying for colleges as an American is too expensive? Without international students you're gonna pay double the current rate.",
                "So, basically... \"We have absolutely no legal foundation for our actions, so rather than set a legal precedent we'll just voluntarily reverse our decision.\"\n\nI'm hardly an expert on such matters, but from what I understand from credible sources, is that even if your student visa is terminated, you're legally allowed to remain in the country as long as you're enrolled at a school. I presume at least until the end of the current term, then you're expected to either get a new visa or leave.",
                " Trumps goons were acting unlawfully. Colour me surprised.",
                "I'm sure there will be some \"accidental\" arrests once these students start coming back.",
                "I wouldn't trust them to not change their minds again next week - or the week after. \n\nDon't come to the US to go to school. And if you're here, plan for something else."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "California’s economy surpasses Japan’s as it becomes fourth largest in world",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/24/california-economy-japan-gavin-newsom?utm_source=substack&utm_medium=email",
            "upvotes": 3871,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/938f0112d71adef10ac1e9e9b33960fe42957355/0_92_2774_1665/master/2774.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f42dd3033c917d012c2a14d492480724",
            "top_comments": [
                "But conservatives said that it's a failed state.are you implying that they lied?",
                "California population 40million. Japan population 125 million.\n\nJapanese are known to be some of the hardest working people in the world, yet here we are in California with 1/3 the population and still cranking out numbers to match entire nations. It really is something Californians should be proud of.\n\nOne of the biggest overlooked things is California's education system. Our UC and Cal State system consistently cranks out some of the smartest and brightest young adults in the world. \n\nCalifornia also has some of the best labor laws to protect workers compared to many other states.",
                "And why does California need the other 49 states?",
                "I'm surprised Trump hasn't started a trade war with California yet.",
                "MAGA screams daily (in every possible form of media) that hundreds of thousands of people are leaving California every second.  They scream that California is a dead and broken state.  A poor state.  A place only fit for the criminals that have illegally entered the US.  \n\nAnd yet.....Cali is now the 4th largest economy on the planet. \n\nBoth these things can't be true.  One is instantly and credibly verifiable using financial data.  The other is the slobbering moans of insipid losers.",
                "Underrated tidbit of info from the article:\n\n\"California is a major contributor to economic growth nationally, with the money it sends to the federal government outpacing what it receives in federal funding by $83bn...\"",
                "Is that because Japan's economy is shrinking or California's economy is growing? ",
                "It'll be interesting when they have the next disaster and Benedict Donald says FEMA is broke. I hope they refuse to send their tax money to the taker red states.",
                "Why doesn't Cali just buy it's own SCOTUS judges and Congress critters? If Russia can do it, they can too!",
                "As a Midwesterner and a lover of my city ...I've lately caught myself asking myself \"hm...can I find a job in Cali that offsets the cost of living? What about other blue states?\" 🤔"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Pete Hegseth had an unsecured internet line set up in his office to connect to Signal, AP sources say",
            "external_url": "https://www.ctvnews.ca/world/article/pete-hegseth-had-an-unsecured-internet-line-set-up-in-his-office-to-connect-to-signal-ap-sources-say/",
            "upvotes": 41909,
            "date": "04/25/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/4YEWSMJAY45CNMAAARZCB6XHPQ.jpg?smart=true&auth=334b1defe62b2a369ef8b3cd017a963865ba09c3918db0420f3c9cfb5b8aa9d9&width=1200&height=630",
            "top_comments": [
                "“U.S. Defense Secretary Pete Hegseth had an internet connection that bypassed the Pentagon’s security protocols set up in his office to use the Signal messaging app on a personal computer, two people familiar with the line told The Associated Press.\n\nThe existence of the unsecured internet connection is the latest revelation about Hegseth’s use of the unclassified app and raises the possibility that sensitive defense information could have been put at risk of potential hacking or surveillance.”",
                "So he's just trying to hide some illegal shit at this point.",
                "What’s this fuckers obsession with signal?",
                "He has also been having a mental breakdown on television, he needs to be removed from his position as soon as possible. He is a danger to the safety of the United States. ",
                "....which synced to his phone though Bluetooth or WiFi. \n\nThe most powerful military leader -has an open internet computer, inside his office, that synced to his phone app everytime he sat down.",
                "But, Hillary’s emails..",
                ".....\n\nHilarys fucking emails....\n\nHunter Bidens laptop.\n\nJfc I hate these fascists and the dumb sheep that listen to them.",
                "Seriously can this dude be arrested or something. This is outright blatant security violations. He should be in GITMO",
                "I mean, just out of curiosity, how do you get an insecure line added in the pentagon? Did they call up and have their ISP drill a new line in? I feel like someone somewhere had to say “yah we can’t really approve this”. It’s not like he dragged a cable through the building himself.",
                "i miss having a government made of even 50% competent upper management"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Trump pardons Nevada politician who paid for her plastic surgery with funds to honor a slain officer",
            "external_url": "https://apnews.com/article/trump-pardon-michele-fiore-nevada-fraud-cf56ef8b302b8111e47cf52d5a606d19",
            "upvotes": 22819,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Fiore, who does not have a law degree, was [appointed as a judge](https://apnews.com/article/politics-las-vegas-nevada-73278936d0baa571db1174aaf275d4c2) in deep-red Nye County in 2022 shortly after she lost her campaign for state treasurer.\n\nShe was elected last June to complete the unexpired term of a judge who died but had been suspended without pay amid her legal troubles. Pahrump is an hour’s drive west of Las Vegas.\n\nIn her statement Thursday, Fiore also said she plans to return to the bench next week.\"\n\n\n\nwhy indeed",
                "At first I was like \"Why would he pardon her\".. but then..\n\n> President Donald Trump has pardoned a Nevada Republican politician who was awaiting sentencing on federal charges that she used money",
                "A scumbag pardoning a scumbag.",
                "The silence from the right speaks for itself",
                "Of course he did, he stole funds from a veteran’s charity",
                "We're only 4 months into this.",
                "The fraud is one thing, but personally I find this more concerning: \n\n\"Fiore, who does not have a law degree, was appointed as a judge in deep-red Nye County in 2022 shortly after she lost her campaign for state treasurer.\"\n\nFor an administration that howls about DEI, they couldn't install less qualified people to more important positions if they tried.",
                "Republicans do their thing",
                "The Onion and reality are merging and I hate it",
                "Crime is legal. Steal from rich people. Literally just take their shit."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Man convicted of first-degree murder in rock-throwing death of Colorado driver",
            "external_url": "https://apnews.com/article/throwing-rock-car-denver-colorado-trial-05c84344aa9dfa7fcf88c644a616c6f2",
            "upvotes": 28,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> After seeing Bartell’s car leave the road after being hit, the three friends circled back a few times to look again, according to testimony and investigators. One of them, Kwak, took a photo as a memento but no one checked on the driver or called for help, according to their testimony.\n\n> Bartell’s body would not be discovered until her girlfriend, Jenna Griggs, who was on the phone with her that night when the call abruptly cut out, tracked her phone to the field, she testified.\n\ntl;dr: Not only did they do this, they had saw the results, had the chance to save them... not only didn't, but took a photo and just left them there.\n\nEdit: Fixed, ty jojo",
                "Drivers brain was found in the back seat of the car."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Big Tech carries Wall Street higher as most US stocks fall on uncertainty about the trade war",
            "external_url": "https://www.nvdaily.com/associated_press_national/big-tech-carries-wall-street-higher-as-most-us-stocks-fall-on-uncertainty-about-the/article_08c29ea9-adce-5ea5-a734-9dfbb85c1f6f.html",
            "upvotes": 88,
            "date": "04/25/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/nvdaily.com/content/tncms/assets/v3/editorial/9/94/99497432-db6e-53fe-a99e-a57ef970a7c7/680b79d097b20.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "oh awesome, about time these tech billionaires caught a break",
                "Meanwhile TSLA had a bunch of bad news and rose 22% in the past five days.",
                "This is because Big Tech is getting insider information from the Donald Duck administration.  It’s rigged and it’s not rigged in our favor.",
                "*But Trump’s on-again-off-again tariffs may nevertheless be pushing households and businesses to alter their spending and freeze plans for long-term investment because of how quickly conditions can change, sometimes seemingly by the hour.*\n\nOnly a few large tech firms covered this week for others, and for general losses.",
                "S&P is over bloated.  As soon as consumer news for April and then May come in shit is going to hit the fan."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "ICE is reversing termination of legal status for international students around US, lawyers say",
            "external_url": "https://apnews.com/article/international-student-status-restored-9e8a7cb90f4193ec52bf06edc5094cd9",
            "upvotes": 1267,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Monday headlines: Trump tells ICE to revoke legal status.  Tuesday headline- ICE reverts status once again.",
                "It's not going to matter much. The uncertainty around it just makes everything worse.\n\nWe have an administration who shrugs when they accidentally deport the wrong person, actively goes after judges in every way they can, and I wouldn't be surprised to see issuing brown boots to ICE.\n\nThe world has seen what we are becoming, even if a dark part of our own population is in denial about it.",
                "I’m tired of hearing fatalist remarks about how this doesn’t matter. We can’t secede our power and need to keep the fight going. Inch by inch, if necessary. This is a good sign that the administration is responding to legal action and pushback.",
                "The protests are working. If you go to them, keep it up.",
                "This was always evil and cruel. \n\nBut on a dumber level, this shit is WASTEFUL and EXPENSIVE. \n\nThis messy administration and DOGE boys will cost us billions and billions at the end of the day. Because all of this costs us time and money.",
                "Lol they are about to find out how much international students' exorbitant tuitions subsidy domestic students'. You think paying for colleges as an American is too expensive? Without international students you're gonna pay double the current rate.",
                "So, basically... \"We have absolutely no legal foundation for our actions, so rather than set a legal precedent we'll just voluntarily reverse our decision.\"\n\nI'm hardly an expert on such matters, but from what I understand from credible sources, is that even if your student visa is terminated, you're legally allowed to remain in the country as long as you're enrolled at a school. I presume at least until the end of the current term, then you're expected to either get a new visa or leave.",
                " Trumps goons were acting unlawfully. Colour me surprised.",
                "I'm sure there will be some \"accidental\" arrests once these students start coming back.",
                "I wouldn't trust them to not change their minds again next week - or the week after. \n\nDon't come to the US to go to school. And if you're here, plan for something else."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "Elon Musk's social media platform X sues Minnesota over political deepfake ban | MPR News",
            "external_url": "https://www.mprnews.org/episode/2025/04/24/elon-musk-social-media-platform-x-sues-minnesota-political-deepfake-ban",
            "upvotes": 2286,
            "date": "04/25/2025",
            "thumbnail": "https://img.apmcdn.org/caab343605b8e3130e9316b76da4c3fc3f3bafd5/widescreen/fec767-20250330-wisconsin-supreme-court-2000.jpg",
            "top_comments": [
                "So Elon musk, who has several years worth of history of posting nazi propaganda on Twitter, is sueing because a law saw people can't use AI to create deepfakes to intentionally spread political misinformation.\n\nI mean, aside from all the other awful shit he has done, does anyone really need anymore proof musk is an evil narcissistic psycho?",
                "Sueing to spread political disinformation sounds like a stupid idea and only proves that you and your platform shouldn't be trusted.",
                "That guy is a taint barnacle",
                "In the spirit of Musk's concerns: Never, ever stop creating and posting deep fakes of Elon Musk openly bragging about rigging the 2024 election.",
                "I'm so sick of malignant narcissist billionaires.\n\n*I apologize for being redundant though.*",
                "He's suing for the right to deliberately mislead and lie to people. P. O. S",
                "Elons just doing this to fuck with Tim Walz",
                "\"“requirements are so vague and unintelligible that social media platforms cannot understand what the statute permits and what it prohibits\"\n\nUh... maybe don't make shit up? How is that so fucking difficult to understand?",
                "I can't wait for this cunt to exit the planet.",
                "Musk is only filing suit because he personally would be responsible for generating most of it."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Luigi Mangione pleads not guilty in federal court to murder of UnitedHealthcare CEO",
            "external_url": "https://www.cnbc.com/2025/04/25/luigi-mangione-pleads-not-guilty-in-federal-court-to-murder-of-unitedhealthcare-ceo.html",
            "upvotes": 199,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108105907-17401702152025-02-21t203147z_180253610_rc22zcaawdld_rtrmadp_0_unitedhealth-ceo.jpeg?v=1740170306&w=1920&h=1080",
            "top_comments": [
                "Why did his case even go to federal court when it all happened in New York?",
                "Well that’s good enough for me, knock it down to rolling a stop sign and cut him loose.",
                "Case closed.  He's innocent. Don't know if we'll ever figure this one out but the important thing is that we tried.",
                "The aristocracy is really unhappy that one of their own was targeted, and public sentiment leaned towards the attacker. They're trying to make an example of him. Mass murdering terrorists didn't catch federal charges with a death penalty.",
                "Now bring the real murderers to trial - Health Insurance CEOs and their Boards.",
                "We're all looking for the guy that did this.",
                "Death penalty for thee, but not for the guy that killed 12 people recently in a shooting."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Former Rep. George Santos sentenced to 87 months in New York federal fraud case",
            "external_url": "https://www.cnbc.com/2025/04/25/george-santos-fraud-sentence-congress.html",
            "upvotes": 14263,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136734-17455932402025-04-25t145727z_1834006727_rc225eatuykw_rtrmadp_0_usa-congress-santos.jpeg?v=1745609921&w=1920&h=1080",
            "top_comments": [
                "What a way to treat the man who not only founded New York, but built Central Park with his own three hands.",
                "Former Rep. George Santos, whose web of [lies](https://www.cnbc.com/2023/01/19/rep-george-santos-pushes-back-on-insane-reports-he-took-funds-for-veterans-dying-dog.html) about his life led to his expulsion from Congress, was sentenced Friday to more than seven years in prison in his federal fraud case.\n\nThe New York Republican must also pay restitution of $373,750, a judge ruled in U.S. District Court in Long Island.\n\nSantos admitted last August to engaging in a multi-pronged campaign finance scheme, stealing unemployment benefits during the Covid-19 pandemic, and lying on House financial disclosure forms.\n\nAs part of an agreement with prosecutors, Santos pleaded guilty to a single count each of wire fraud and aggravated identity theft. He also agreed to restitution and forfeiture totaling nearly $580,000.",
                "Does Vegas have over under on how long he actually spends in prison and is it .5 days cause at this rate I feel it’s more likely the judge who sentenced him somehow is arrested some made up charges than this guy seeing a cell.",
                "Federal?\n\nI give it 48 hours until he's pardoned.",
                "George Santos is, hands down, the best minor villain America has ever seen. His story is absolutely wild. And not merely because he has a drag-queen alter ego, [Kitara Rivache](https://www.nbcnews.com/nbc-out/out-politics-and-policy/george-santos-says-will-revive-drag-queen-persona-cameo-rcna149867).\n\nThe Republican party is an organized crime syndicate. Like the mob, [the GOP happily protected Santos from expulsion](https://apnews.com/article/george-santos-expel-house-republicans-new-york-249bd2341d157bc6727b77607d8d45ae) when he merely deceived voters with financial fraud.\n\nBut, Santos broke the most important rule in organized crime: don't steal from the mob. [Santos sent emails to Senator Kevin McCarthy's wealthy donors claiming to be McCarthy's fundraiser. Santos siphoned money from McCarthy's campaign into his own](https://www.cnbc.com/2023/01/09/george-santos-raised-money-from-wealthy-gop-donors-while-lying-about-his-resume.html).\n\nThat was the last straw. [Republicans joined Democrats in a second ethics vote against Santos, successfully removing the disgraced representative from Congress](https://www.cbsnews.com/news/who-voted-to-expel-george-santos/).",
                "Former President Santos going to prison, wow. ",
                "To all the snarky “he’s gonna get pardoned” comments, no he fucking isn’t lol. This dude was an absolute nobody before coming into the picture and deeply embarrassed a lot of really powerful people. I could be mistaken but I don’t think a single republican has spoken up in defense of Santos with any meaningful weight beyond maybe a broad platitude about democrats being worse or something. If he didn’t plead guilty they would have 100% thrown the book at him.",
                "Hell fuck yes let's GOOOOOO.\n\nFuck this prick 😂😂😂😂\n\nEdit: LMAOOOOOO. Imagine being a complete prick online, CONTINUE to lie, and have the balls to ask for 2 years only to get screwed over for online behavior 😂😂😂😂😂😂 Enjoy those 7 years, ~~Anthony Santos~~, George Santos, ~~Anthony Devolder~~, ~~George Anthony Devolder~~, ~~George Devolder~~, ~~George A.D. Santos~~, ~~Anthony Zabrovsky~~, ~~George Anthony Santos-Devolder~~, ~~Katara Ravache~~, ~~GADS~~",
                "his father, the inventor of toaster strudel, will not be very happy with this.",
                "He’s getting pardoned"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "UK scientists to launch outdoor geoengineering experiments | Geoengineering | The Guardian",
            "external_url": "https://www.theguardian.com/environment/2025/apr/22/uk-scientists-outdoor-geoengineering-experiments",
            "upvotes": 75,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/0d5659197e4e05f923549b37886cf810f2fc0f65/275_225_4290_2575/master/4290.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7a43bca3a75e7607bde96789bf46c965",
            "top_comments": [
                "Unless the geoengineering takes the form of absorbing more carbon from the environment, at best it's going to change the environment in different ways. A high CO2 environment that has the same temperature as before is not the same as a pre-industrial environment. And then you add the side-effects from what's used to bring the temperature down.\n\nIf the geoengineering stops being maintained, temperatures go right back up (more if more CO2's been released).",
                "I think we've all seen enough Sci-Fi movies to know how this song and dance goes.",
                "The problem is the people with money are never going to allow this on a meaningful scale. Drill baby drill is their motiff. And they will suck the Earth dry for profit even if it is the death of us all."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "FBI arrests Wisconsin judge for alleged immigration arrest obstruction",
            "external_url": "https://www.cnbc.com/2025/04/25/fbi-arrest-judge-hannah-dugan-milwaukee.html",
            "upvotes": 41865,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136765-17455967922025-04-25t155724z_1252469857_rc235eacvo1d_rtrmadp_0_usa-fbi-judge.jpeg?v=1745596837&w=1920&h=1080",
            "top_comments": [
                "That's 2 judges in 2 days.",
                "Meanwhile, trump recently pardoned a judge in Nevada who committed fraud related to a ~~veterans charity~~ honoring a slain police officer. \n\nIf that didn’t enrage you enough, that judge had no law degree and said she was looking forward to getting back on the bench.\n\nEdit: she stole money that was supposed to go to a fund for a slain officer for personal expenses.....like plastic surgery. \n\nFrom ABC\n\n*President Trump has pardoned a Las Vegas politician convicted last year of using money meant for a statue honoring a slain police officer on personal costs, including plastic surgery.*\n\n*Michele Fiore, a former city councilwoman and Nevada state lawmaker, was* [*found guilty in October*](https://apnews.com/article/republican-michele-fiore-guilty-wire-fraud-nevada-5844d79dacf0bfd6b43d36e03eb6cd95) *of six counts of federal wire fraud and one count of conspiracy to commit wire fraud. She was out of custody ahead of a sentencing scheduled for next month.*\n\n*Federal prosecutors alleged during trial that Fiore, 54, had raised more than $70,000 for the statue of a Las Vegas police officer who was fatally shot in 2014 in the line of duty, but had instead spent some of the funds on cosmetic surgery, rent and her daughter's wedding.*\n\n*Fiore, who does not have a law degree, was appointed as a judge in deep-red Nye County in 2022 shortly after she lost her campaign for state treasurer. She was elected in June 2024 to complete the unexpired term of a judge who died but had been suspended without pay amid her legal troubles. Pahrump is an hour's drive west of Las Vegas.*",
                "Is this record time to go from \"Stop overreacting\" to \"we are literally arresting judges\"",
                "Find this beyond alarming given he fully pardoned a judge in Nevada who was caught red handed pocketing money raised for a police memorial. Was an open and shut case. \n\nShe said it was god’s doing and borderline called Trump a deity. I shit you not. She’s back in court like next week.",
                "Just want to add a historical note that in the Declaration of Independence there is a mention that if a government becomes oppressive, the people have the right to abolish it.",
                "So Trump is sending his crony at the FBI, Kash Patel, to arrest judges standing up to him.\n\n*Yeah, that's definitely the sign of a properly functioning democracy.*",
                "Guys? You're under reacting. way under reacting",
                "Everyone in this administration deserves to end up in prison when this is all over. ",
                "Time for the National Strikes to begin. If they are arresting judges now for upholding the law, there is nothing left for this country. Time to shut it all down.",
                ">Patel wrote on X that the FBI believes Milwaukee Circuit Court Judge Hannah Dugan “intentionally misdirected federal agents away” from Eduardo Flores Ruiz as agents were attempting to arrest him at her courthouse last week.\n\nIt’s not what you believe, it’s what you can prove. It will be interesting to see what kind of case they have but my money is on the FBI over reaching here."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Manhattan DA says attorney raped, electro-shocked, tortured women in his apartment",
            "external_url": "https://gothamist.com/news/manhattan-da-says-attorney-raped-electro-shocked-tortured-women-in-his-apartment",
            "upvotes": 3549,
            "date": "04/25/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350893/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "[More info](https://apnews.com/article/manhattan-private-equity-sexual-assault-93890bd429eaf864407207c55f7a7ee5):\n\n>A private equity executive turned his New York City apartment into a torture chamber of “grotesque sexual violence,” Manhattan prosecutors said Thursday. He is accused of raping six women over five months in a depraved rampage in which he allegedly punched, waterboarded and shocked victims with a cattle prod and kept recordings of the assaults as trophies.\n\n>Ryan Hemphill, who remains jailed after his arrest last month, pleaded not guilty to a 116-count indictment charging him with predatory sexual assault and other crimes dating to last October. The 43-year-old, who is also a lawyer, threatened to have victims arrested or disappeared in a bid to keep them silent, prosecutors said.",
                "Found a pic of him from the last time he got in trouble for abusing women:\n\n[https://archive.ph/wU24j](https://archive.ph/wU24j)",
                "Holy shit private equity executive. These people are fucked. ",
                "From the comments on the article:\n\n>Zazuum\n>17h ago\n\n>Outside of his professional endeavors, Ryan Hemphill is a committed philanthropist who is passionate about giving back to his community and others around the world. Ryan operated as Youth Ambassador to the NGO Voices of African Mothers for the former CFO of UN Peacekeeping where he helped initiate the development of a school for young women in Ghana. In 2009, Ryan Hemphill coordinated and directed the Bronx Opera Children’s Program, which performs excerpts of the latest Bronx Opera productions for schoolchildren between the ages of 5 and 15 in order to give them access the arts when they may not be able to experience it otherwise.\n\n>^ Well, someone needs to check both programs",
                "It concerns me that he worked overseas with children. If he's willing to torture and threaten these women here in America, imagine the fucked up crimes he potentially committed in developing countries.",
                "[removed]",
                "https://ryanhemphill.nyc/",
                "I bet this guy has an amazing business card.",
                "The AUDACITY to plead Not Guilty. 🤬",
                "[removed]"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Judge orders return of second Maryland man deported to El Salvador in violation of court order",
            "external_url": "https://www.cbsnews.com/baltimore/news/judge-maryland-man-deported-trump-administration-el-salvador/",
            "upvotes": 384,
            "date": "04/25/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/07/719341dd-e4d6-4e77-aba4-8c6ed49a4f58/thumbnail/1200x630/1ef3543989e3e812f06ced64dca3057c/gettyimages-2195569279.jpg?v=8e9dede207b29c97b32974c53e32aabc",
            "top_comments": [
                "I'm sure the trump cult will get right on that.",
                "I'm sure ICE will just arrest that Judge next instead.",
                "STOP SAYING “DEPORTED” - being renditioned to a supermax torture prison in a foreign country isn’t a deportation.",
                "\"How did that radical left lunatic get to be a judge?\" \n\n\"You appointed her, sir.\""
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Luigi Mangione pleads not guilty in federal court to murder of UnitedHealthcare CEO",
            "external_url": "https://www.cnbc.com/2025/04/25/luigi-mangione-pleads-not-guilty-in-federal-court-to-murder-of-unitedhealthcare-ceo.html",
            "upvotes": 199,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108105907-17401702152025-02-21t203147z_180253610_rc22zcaawdld_rtrmadp_0_unitedhealth-ceo.jpeg?v=1740170306&w=1920&h=1080",
            "top_comments": [
                "Why did his case even go to federal court when it all happened in New York?",
                "Well that’s good enough for me, knock it down to rolling a stop sign and cut him loose.",
                "Case closed.  He's innocent. Don't know if we'll ever figure this one out but the important thing is that we tried.",
                "The aristocracy is really unhappy that one of their own was targeted, and public sentiment leaned towards the attacker. They're trying to make an example of him. Mass murdering terrorists didn't catch federal charges with a death penalty.",
                "Now bring the real murderers to trial - Health Insurance CEOs and their Boards.",
                "We're all looking for the guy that did this.",
                "Death penalty for thee, but not for the guy that killed 12 people recently in a shooting."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "ICE is reversing termination of legal status for international students around US, lawyers say",
            "external_url": "https://apnews.com/article/international-student-status-restored-9e8a7cb90f4193ec52bf06edc5094cd9",
            "upvotes": 1266,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Monday headlines: Trump tells ICE to revoke legal status.  Tuesday headline- ICE reverts status once again.",
                "It's not going to matter much. The uncertainty around it just makes everything worse.\n\nWe have an administration who shrugs when they accidentally deport the wrong person, actively goes after judges in every way they can, and I wouldn't be surprised to see issuing brown boots to ICE.\n\nThe world has seen what we are becoming, even if a dark part of our own population is in denial about it.",
                "I’m tired of hearing fatalist remarks about how this doesn’t matter. We can’t secede our power and need to keep the fight going. Inch by inch, if necessary. This is a good sign that the administration is responding to legal action and pushback.",
                "The protests are working. If you go to them, keep it up.",
                "This was always evil and cruel. \n\nBut on a dumber level, this shit is WASTEFUL and EXPENSIVE. \n\nThis messy administration and DOGE boys will cost us billions and billions at the end of the day. Because all of this costs us time and money.",
                "Lol they are about to find out how much international students' exorbitant tuitions subsidy domestic students'. You think paying for colleges as an American is too expensive? Without international students you're gonna pay double the current rate.",
                "So, basically... \"We have absolutely no legal foundation for our actions, so rather than set a legal precedent we'll just voluntarily reverse our decision.\"\n\nI'm hardly an expert on such matters, but from what I understand from credible sources, is that even if your student visa is terminated, you're legally allowed to remain in the country as long as you're enrolled at a school. I presume at least until the end of the current term, then you're expected to either get a new visa or leave.",
                " Trumps goons were acting unlawfully. Colour me surprised.",
                "I'm sure there will be some \"accidental\" arrests once these students start coming back.",
                "I wouldn't trust them to not change their minds again next week - or the week after. \n\nDon't come to the US to go to school. And if you're here, plan for something else."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk's social media platform X sues Minnesota over political deepfake ban | MPR News",
            "external_url": "https://www.mprnews.org/episode/2025/04/24/elon-musk-social-media-platform-x-sues-minnesota-political-deepfake-ban",
            "upvotes": 2282,
            "date": "04/25/2025",
            "thumbnail": "https://img.apmcdn.org/caab343605b8e3130e9316b76da4c3fc3f3bafd5/widescreen/fec767-20250330-wisconsin-supreme-court-2000.jpg",
            "top_comments": [
                "So Elon musk, who has several years worth of history of posting nazi propaganda on Twitter, is sueing because a law saw people can't use AI to create deepfakes to intentionally spread political misinformation.\n\nI mean, aside from all the other awful shit he has done, does anyone really need anymore proof musk is an evil narcissistic psycho?",
                "Sueing to spread political disinformation sounds like a stupid idea and only proves that you and your platform shouldn't be trusted.",
                "That guy is a taint barnacle",
                "In the spirit of Musk's concerns: Never, ever stop creating and posting deep fakes of Elon Musk openly bragging about rigging the 2024 election.",
                "I'm so sick of malignant narcissist billionaires.\n\n*I apologize for being redundant though.*",
                "He's suing for the right to deliberately mislead and lie to people. P. O. S",
                "Elons just doing this to fuck with Tim Walz",
                "\"“requirements are so vague and unintelligible that social media platforms cannot understand what the statute permits and what it prohibits\"\n\nUh... maybe don't make shit up? How is that so fucking difficult to understand?",
                "I can't wait for this cunt to exit the planet.",
                "Musk is only filing suit because he personally would be responsible for generating most of it."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "Former Rep. George Santos sentenced to 87 months in New York federal fraud case",
            "external_url": "https://www.cnbc.com/2025/04/25/george-santos-fraud-sentence-congress.html",
            "upvotes": 14255,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136734-17455932402025-04-25t145727z_1834006727_rc225eatuykw_rtrmadp_0_usa-congress-santos.jpeg?v=1745609921&w=1920&h=1080",
            "top_comments": [
                "What a way to treat the man who not only founded New York, but built Central Park with his own three hands.",
                "Former Rep. George Santos, whose web of [lies](https://www.cnbc.com/2023/01/19/rep-george-santos-pushes-back-on-insane-reports-he-took-funds-for-veterans-dying-dog.html) about his life led to his expulsion from Congress, was sentenced Friday to more than seven years in prison in his federal fraud case.\n\nThe New York Republican must also pay restitution of $373,750, a judge ruled in U.S. District Court in Long Island.\n\nSantos admitted last August to engaging in a multi-pronged campaign finance scheme, stealing unemployment benefits during the Covid-19 pandemic, and lying on House financial disclosure forms.\n\nAs part of an agreement with prosecutors, Santos pleaded guilty to a single count each of wire fraud and aggravated identity theft. He also agreed to restitution and forfeiture totaling nearly $580,000.",
                "Does Vegas have over under on how long he actually spends in prison and is it .5 days cause at this rate I feel it’s more likely the judge who sentenced him somehow is arrested some made up charges than this guy seeing a cell.",
                "Federal?\n\nI give it 48 hours until he's pardoned.",
                "George Santos is, hands down, the best minor villain America has ever seen. His story is absolutely wild. And not merely because he has a drag-queen alter ego, [Kitara Rivache](https://www.nbcnews.com/nbc-out/out-politics-and-policy/george-santos-says-will-revive-drag-queen-persona-cameo-rcna149867).\n\nThe Republican party is an organized crime syndicate. Like the mob, [the GOP happily protected Santos from expulsion](https://apnews.com/article/george-santos-expel-house-republicans-new-york-249bd2341d157bc6727b77607d8d45ae) when he merely deceived voters with financial fraud.\n\nBut, Santos broke the most important rule in organized crime: don't steal from the mob. [Santos sent emails to Senator Kevin McCarthy's wealthy donors claiming to be McCarthy's fundraiser. Santos siphoned money from McCarthy's campaign into his own](https://www.cnbc.com/2023/01/09/george-santos-raised-money-from-wealthy-gop-donors-while-lying-about-his-resume.html).\n\nThat was the last straw. [Republicans joined Democrats in a second ethics vote against Santos, successfully removing the disgraced representative from Congress](https://www.cbsnews.com/news/who-voted-to-expel-george-santos/).",
                "Former President Santos going to prison, wow. ",
                "To all the snarky “he’s gonna get pardoned” comments, no he fucking isn’t lol. This dude was an absolute nobody before coming into the picture and deeply embarrassed a lot of really powerful people. I could be mistaken but I don’t think a single republican has spoken up in defense of Santos with any meaningful weight beyond maybe a broad platitude about democrats being worse or something. If he didn’t plead guilty they would have 100% thrown the book at him.",
                "Hell fuck yes let's GOOOOOO.\n\nFuck this prick 😂😂😂😂\n\nEdit: LMAOOOOOO. Imagine being a complete prick online, CONTINUE to lie, and have the balls to ask for 2 years only to get screwed over for online behavior 😂😂😂😂😂😂 Enjoy those 7 years, ~~Anthony Santos~~, George Santos, ~~Anthony Devolder~~, ~~George Anthony Devolder~~, ~~George Devolder~~, ~~George A.D. Santos~~, ~~Anthony Zabrovsky~~, ~~George Anthony Santos-Devolder~~, ~~Katara Ravache~~, ~~GADS~~",
                "his father, the inventor of toaster strudel, will not be very happy with this.",
                "He’s getting pardoned"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Manhattan DA says attorney raped, electro-shocked, tortured women in his apartment",
            "external_url": "https://gothamist.com/news/manhattan-da-says-attorney-raped-electro-shocked-tortured-women-in-his-apartment",
            "upvotes": 3555,
            "date": "04/25/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350893/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "[More info](https://apnews.com/article/manhattan-private-equity-sexual-assault-93890bd429eaf864407207c55f7a7ee5):\n\n>A private equity executive turned his New York City apartment into a torture chamber of “grotesque sexual violence,” Manhattan prosecutors said Thursday. He is accused of raping six women over five months in a depraved rampage in which he allegedly punched, waterboarded and shocked victims with a cattle prod and kept recordings of the assaults as trophies.\n\n>Ryan Hemphill, who remains jailed after his arrest last month, pleaded not guilty to a 116-count indictment charging him with predatory sexual assault and other crimes dating to last October. The 43-year-old, who is also a lawyer, threatened to have victims arrested or disappeared in a bid to keep them silent, prosecutors said.",
                "Found a pic of him from the last time he got in trouble for abusing women:\n\n[https://archive.ph/wU24j](https://archive.ph/wU24j)",
                "Holy shit private equity executive. These people are fucked. ",
                "From the comments on the article:\n\n>Zazuum\n>17h ago\n\n>Outside of his professional endeavors, Ryan Hemphill is a committed philanthropist who is passionate about giving back to his community and others around the world. Ryan operated as Youth Ambassador to the NGO Voices of African Mothers for the former CFO of UN Peacekeeping where he helped initiate the development of a school for young women in Ghana. In 2009, Ryan Hemphill coordinated and directed the Bronx Opera Children’s Program, which performs excerpts of the latest Bronx Opera productions for schoolchildren between the ages of 5 and 15 in order to give them access the arts when they may not be able to experience it otherwise.\n\n>^ Well, someone needs to check both programs",
                "It concerns me that he worked overseas with children. If he's willing to torture and threaten these women here in America, imagine the fucked up crimes he potentially committed in developing countries.",
                "[removed]",
                "https://ryanhemphill.nyc/",
                "I bet this guy has an amazing business card.",
                "The AUDACITY to plead Not Guilty. 🤬",
                "[removed]"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "US prosecutors to seek death penalty against Luigi Mangione in UnitedHealth executive’s murder",
            "external_url": "https://www.reuters.com/world/us/prosecutors-file-formal-notice-plan-seek-death-penalty-luigi-mangione-2025-04-25/",
            "upvotes": 5734,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Mass shooter at a school? Life in prison.\n\n\nKill a rich person? DEATH PENALTY.",
                "They want to make an example out of him. Shame that our government cares more about the life of one CEO than it does about the wellbeing of its citizens who are forced to rely on substandard health insurance coverage and labyrinthian claims processes.",
                "In justifying their decision, prosecutors wrote in their filing that Mangione \"presents a future danger because he expressed an intent to target an entire industry, and rally political and social opposition to that industry, by engaging in an act of lethal violence.\"",
                "Interesting to note that racially motivated mass shooters don't get the prosecutors this bloodthirsty for a death penalty case (and the cops will take them out for burger king on the way to jail in some cases!)",
                "Oh, they're making an example all right lol. The example being that if you have nothing to lose, may as well take out a rich fucker or two on the way out. Fucking idiots.",
                ">Mr Mangione is facing 11 state criminal counts in New York, including first-degree murder and murder as a crime of terrorism.\n\n\n>But federal prosecutors have also separately charged Mr Mangione for using a firearm to commit murder and interstate stalking resulting in death. These charges make him eligible for the death penalty.\n\nFar be it from me to want to bring up DOGE, but if the state has a really good case, why is the federal government piling on and wasting taxpayer money? It's possible *if* something jury nullification comes into play and the accused is acquitted on all charges on the state level, the federal government can still step in and charge this man for the crimes listed above. But that's only if something like an acquittal happens at the state level, for something like jury nullification.",
                "Is it normal for the attorney general to taint a trial by calling the defendant a murderer on live TV? You know, before any juries have been selected?",
                "are we even sure he did it",
                "Last i checked a significant amount of school shooters have not gotten the death penalty?",
                "They just gave the highland park shooter life in prison for killing 7 and injuring atleast a dozen others but this dude gets one rich dude and they'll probably chop his head off on live TV"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "California’s economy surpasses Japan’s as it becomes fourth largest in world",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/24/california-economy-japan-gavin-newsom?utm_source=substack&utm_medium=email",
            "upvotes": 3871,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/938f0112d71adef10ac1e9e9b33960fe42957355/0_92_2774_1665/master/2774.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f42dd3033c917d012c2a14d492480724",
            "top_comments": [
                "But conservatives said that it's a failed state.are you implying that they lied?",
                "California population 40million. Japan population 125 million.\n\nJapanese are known to be some of the hardest working people in the world, yet here we are in California with 1/3 the population and still cranking out numbers to match entire nations. It really is something Californians should be proud of.\n\nOne of the biggest overlooked things is California's education system. Our UC and Cal State system consistently cranks out some of the smartest and brightest young adults in the world. \n\nCalifornia also has some of the best labor laws to protect workers compared to many other states.",
                "And why does California need the other 49 states?",
                "I'm surprised Trump hasn't started a trade war with California yet.",
                "MAGA screams daily (in every possible form of media) that hundreds of thousands of people are leaving California every second.  They scream that California is a dead and broken state.  A poor state.  A place only fit for the criminals that have illegally entered the US.  \n\nAnd yet.....Cali is now the 4th largest economy on the planet. \n\nBoth these things can't be true.  One is instantly and credibly verifiable using financial data.  The other is the slobbering moans of insipid losers.",
                "Underrated tidbit of info from the article:\n\n\"California is a major contributor to economic growth nationally, with the money it sends to the federal government outpacing what it receives in federal funding by $83bn...\"",
                "Is that because Japan's economy is shrinking or California's economy is growing? ",
                "It'll be interesting when they have the next disaster and Benedict Donald says FEMA is broke. I hope they refuse to send their tax money to the taker red states.",
                "Why doesn't Cali just buy it's own SCOTUS judges and Congress critters? If Russia can do it, they can too!",
                "As a Midwesterner and a lover of my city ...I've lately caught myself asking myself \"hm...can I find a job in Cali that offsets the cost of living? What about other blue states?\" 🤔"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "FBI arrests Wisconsin judge for alleged immigration arrest obstruction",
            "external_url": "https://www.cnbc.com/2025/04/25/fbi-arrest-judge-hannah-dugan-milwaukee.html",
            "upvotes": 41868,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136765-17455967922025-04-25t155724z_1252469857_rc235eacvo1d_rtrmadp_0_usa-fbi-judge.jpeg?v=1745596837&w=1920&h=1080",
            "top_comments": [
                "That's 2 judges in 2 days.",
                "Meanwhile, trump recently pardoned a judge in Nevada who committed fraud related to a ~~veterans charity~~ honoring a slain police officer. \n\nIf that didn’t enrage you enough, that judge had no law degree and said she was looking forward to getting back on the bench.\n\nEdit: she stole money that was supposed to go to a fund for a slain officer for personal expenses.....like plastic surgery. \n\nFrom ABC\n\n*President Trump has pardoned a Las Vegas politician convicted last year of using money meant for a statue honoring a slain police officer on personal costs, including plastic surgery.*\n\n*Michele Fiore, a former city councilwoman and Nevada state lawmaker, was* [*found guilty in October*](https://apnews.com/article/republican-michele-fiore-guilty-wire-fraud-nevada-5844d79dacf0bfd6b43d36e03eb6cd95) *of six counts of federal wire fraud and one count of conspiracy to commit wire fraud. She was out of custody ahead of a sentencing scheduled for next month.*\n\n*Federal prosecutors alleged during trial that Fiore, 54, had raised more than $70,000 for the statue of a Las Vegas police officer who was fatally shot in 2014 in the line of duty, but had instead spent some of the funds on cosmetic surgery, rent and her daughter's wedding.*\n\n*Fiore, who does not have a law degree, was appointed as a judge in deep-red Nye County in 2022 shortly after she lost her campaign for state treasurer. She was elected in June 2024 to complete the unexpired term of a judge who died but had been suspended without pay amid her legal troubles. Pahrump is an hour's drive west of Las Vegas.*",
                "Is this record time to go from \"Stop overreacting\" to \"we are literally arresting judges\"",
                "Find this beyond alarming given he fully pardoned a judge in Nevada who was caught red handed pocketing money raised for a police memorial. Was an open and shut case. \n\nShe said it was god’s doing and borderline called Trump a deity. I shit you not. She’s back in court like next week.",
                "Just want to add a historical note that in the Declaration of Independence there is a mention that if a government becomes oppressive, the people have the right to abolish it.",
                "So Trump is sending his crony at the FBI, Kash Patel, to arrest judges standing up to him.\n\n*Yeah, that's definitely the sign of a properly functioning democracy.*",
                "Guys? You're under reacting. way under reacting",
                "Everyone in this administration deserves to end up in prison when this is all over. ",
                "Time for the National Strikes to begin. If they are arresting judges now for upholding the law, there is nothing left for this country. Time to shut it all down.",
                ">Patel wrote on X that the FBI believes Milwaukee Circuit Court Judge Hannah Dugan “intentionally misdirected federal agents away” from Eduardo Flores Ruiz as agents were attempting to arrest him at her courthouse last week.\n\nIt’s not what you believe, it’s what you can prove. It will be interesting to see what kind of case they have but my money is on the FBI over reaching here."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "China quietly rolls back retaliatory tariffs on some US-made semiconductors, import agencies say",
            "external_url": "https://edition.cnn.com/2025/04/25/business/china-us-tariffs-semiconductors-exemptions-hnk-intl?cid=external-feeds_iluminar_google",
            "upvotes": 449,
            "date": "04/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-15t045902z-1569210894-rc2vcz9qv2nu-rtrmadp-3-usa-trump-taiwan.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> On April 11, Trump exempted imports of electronics such as smartphones and computers from his “reciprocal” tariffs. That exemption has had a major impact on tech giants like Apple, which make iPhones and other products in China.\n\nThis is after Trump's already done the same for some Chinese goods.",
                "Waiting for Trump to declare total victory",
                "How is it quiet if it’s on CNN?",
                "China just ate our lunch",
                "China is only trying to save face. That is why they will say they aren’t talking when they actually are or roll back tariffs but not publish the information with a large media campaign. It’s all about saving face culturally.\n\nThem showing the “real suppliers” for luxury brands even though they were just dupe factories is a psyop  trying to get people to still buy products. People don’t want a dupe Birkin bag without the Hermes logo…. People want the status symbol of the logo",
                "[deleted]",
                "China showed they need these US imports. Trump can use this by increasing export requirements to China of critical semiconductors to pressure China to negotiate."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "RISING",
            "title": "Hidden magma cap discovered at Yellowstone National Park",
            "external_url": "https://abcnews.go.com/US/hidden-magma-cap-discovered-yellowstone-national-park/story?id=121083908",
            "upvotes": 694,
            "date": "04/25/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8dbdc40f-591f-4937-806c-efad4fa064c1/yellowstone-01-gty-jef-250423_1745423218204_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Geoscientists have discovered a magma cap at Yellowstone National Park that is likely playing a critical role in preventing a massive eruption in one of the largest active volcanic systems in the world.\n\nOh, interesting. That Yellowstone caldera from the movie 2012 seems to be farther from reality.",
                ">Geoscientists have discovered a magma cap at Yellowstone National Park that is likely playing a critical role in preventing a massive eruption in one of the largest active volcanic systems in the world.\n\nThat's interesting.\n\n>The scientists found the cap by using a 53,000-pound vibroseis truck, a device capable of injecting low-frequency vibrations into the Earth to study the geology of the volcanic system. By generating tiny earthquakes that send seismic waves into the ground, the researchers were able to measure how the waves reflected off subsurface layers.\n\nHmmm... if it's really doing what they say it's doing, I hope they stop injecting it with underground earthquakes.",
                "Mr. Yellowstone. Respectfully, please leave your cap on.",
                "Keep JD Vance away from there!",
                "Ugh I read MAGA cap..... I need to go camping this weekend and leave the phone at home. See y'all Monday 👋",
                "FFS, Yellow Stone, this isn't the time for such delay tactics. Just erupt already and put us out of our misery.\n\n>Volcanic eruptions can then occur as the bubbles accumulate and increase in buoyancy, driving an explosion.\n\n>An eruption at Yellowstone, however, is likely not imminent, the researchers said.\n\n>Data from seismic imaging and advanced computer modeling indicates that the magma reservoir is actively releasing gas and remains in a stable state. The system was described by Schmandt as \"steady breathing,\" with the bubbles rising and releasing through the porous rock of the magma cap.\n\nCan we maybe just pave over some of that to trap the gases?",
                "On first pass I read that as maga ... the Internet has ruined me",
                "For a minute I thought the headline was “MAGA” cap.  Which would be ironic because MAGA is firing much of US forestry staff.  Lol.",
                "*something something* 2025 bingo card",
                "I read\nHidden MAGA cap discovered at Yellowstone."
            ],
            "aggregate_sentiment": 14.0
        }
    ],
    "last_updated": "04/25/2025 20:09:51 UTC"
}