{
    "posts": [
        {
            "category": "HOT",
            "title": "Journalists defend press freedom at muted White House correspondents’ dinner",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/27/white-house-correspondents-dinner",
            "upvotes": 13097,
            "date": "04/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3de87fcc8d0cd3ef43ea4e8bb3da63b41e4e45e1/0_273_8192_4918/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1439bd4aace8f904e33aee094e5efa24",
            "top_comments": [
                "I like how they cancelled the comedian and totally capitulated to Trump, just to not have him or anyone from the administration show up anyway. Sums up a lot",
                "These fuckers cancelled the comedian because they were worried about offending Trump. I won't even get into the decades of \"Both Sides Equally At Fault\" coverage that's played a material role in how the current state of affairs was arrived at. Absolutely fuck off and be better, THEN pat yourselves on the back.",
                "The media's been bothsidesing and sanewashing Trump for so long and now they wanna prate about press freedom as the monster they helped create openly cracks down on 1A rights. What a pack of useless fools, but I guess we get what we ask for.\n\nAmerica wanted to believe both sides were the same so they didn't have to pay attention and they paid people like this to tell them that, now here we are.",
                ">Journalists rallied in defence of press freedom on Saturday, insisting they “are not the enemy of the people” at [a Washington media gala](https://www.c-span.org/program/public-affairs-event/white-house-correspondents-association-dinner/658807) snubbed by Donald Trump.\n\nIt's weird the press has to make a point of not being the enemy of the people, and doubly bizarre considering who is doing the accusing.",
                "Journalists cover politics like it's red team vs blue team when the reality is Project 2025 vs the Constitution.",
                ">Alex Thompson of Axios, who won an award for coverage of Biden, silenced a room that was otherwise buzzing all night when he called out the media for failing to adequately investigate Biden’s mental acuity. The issue blew up when the 81-year-old gave a disastrous debate performance four months before the election.\n\n\nI think it's wild that this person thinks the mess up was that we just weren't hard enough on the Biden administration. Yeah, he fucked up immeasurably in how he fumbled the end of his term. Granted. The problem is not that the media didn't talk enough about Biden being old. That was literally everywhere.\n\n\nWe have a GOP that has been barreling towards authoritarianism for decades, and our media institutions have treated them as either rational thought leaders or loveable joksters while they've  torn down our communities and sold us off to wealthy donors.\n\n\nThese people sitting in their fancy ballroom and speaking to nobody but themselves is the perfect metaphor for the current value of our media institutions.",
                ">The WHCA had invited [then cancelled](https://www.theguardian.com/us-news/2025/mar/30/white-house-correspondents-dinner-cancels-comedian-appearance) comedian Amber Ruffin after she referred to the Trump administration as “kind of a bunch of murderers” and asserted that “nobody wants” Trump to attend the dinner.\n\nAh yes, the WHCA, the bastion of free speech and openness to hearing all voices",
                "The Press continues to feed the Trump beast. He spouts nonsense non-stop. Nothing makes sense. He says everything under the sun and they hang on every word. Why? Because it is so crazy it sells their news for them. Not a one has stopped featuring Frumpy’s every word because it enriches them. They could singularly focus on the deaths from loss of reproductive rights, the deportation of Americans, the breaking of supply chains, while leaving Frumpy to fulminate. The Press gave up on it’s constitutional responsibilities and now they complain? Fuck ‘em.",
                "Corporate owned 'journalism' has been a massive failure. The owners have too many skeletons in their closet (how many have been to Epstein's island? We'll never know...) and too much power and wealth to lose to let their properties *actually* ever tell the full truth about anything. It hasn't been a 'free press' in a long time. \n\nNot for profit journalism must emerge from the ashes quickly. It's already happening a bit, but must accelerate if we are going to survive Trump 2.0.",
                "If they were light on jokes they should have invited Tim Pool."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Circumcision at NYC hospital almost made baby bleed to death, parents say",
            "external_url": "https://www.cbsnews.com/newyork/news/baby-nearly-bled-to-death-circumcision-parents-say/",
            "upvotes": 4358,
            "date": "04/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/25/2607bc07-2da0-4f95-a5be-c67a4b41f989/thumbnail/1200x630/0790313b56ce710814d12de467b8523d/bisram-5p-pkg-alleged-b-wcbsdpf9-hi-res-still-00-00-5619.jpg?v=8e9dede207b29c97b32974c53e32aabc",
            "top_comments": [
                "For those who haven't read the article, child was born with heart condition. After receiving a stent, hospital asked parents if they wanted to go ahead of circ. According to parents, hospital did not warn them about increased risks of surgery in an infant with a heart condition. \n\nAnd on a personal note, I was shocked by how much pressure the docs and nurses put on us after our son was born.  Not-so-subtle but still indirect \"Are you sure?\" and ongoing discussion after we indicated \"no.\"",
                "I'm a nurse in critical care, and have seem some truly horrific things. The only thing that ever made me feel light-headed, like I might vomit or faint, was seeing an infant circumcision during my OB rotation in school. The way that little baby screamed... Absolutely horrifying. There is no good reason for this to be a commonplace practice",
                "Forcing male cosmetic surgery on an infant \\*should\\* be illegal, just how it is for females. We just aren't ready for that talk as a society yet, which disappoints me considerably.",
                "We could eradicate breast cancer if we did preventative mastectomies on every woman. We don't alter their secondary sexual characteristics to prevent terminal illness, altering a boy's to prevent UTIs is insane.",
                "Elective plastic surgery within days of birth is wild.",
                "Who knew non-consensual genital mutilation could do that.",
                "It's estimated that approximately 117 male neonatal deaths per year in the US are due to complications of circumcision.",
                "anesthesia checking in.  I see so many circumcision revisions on the OR board.  Some problems aren't seen until years later.  Please stop mutilating boys.  Parents complain their girls sleep well but their boys took months to sleep well.  That's because circumcision is painful genital mutilation.  If you want your baby to sleep well don't mutilate their genitals.  Boys and girls deserve the right to intact genitals.  The foreskin and labial hood protect from chaffing.",
                "Nonconsensual genital mutilation happens every day in the US, and it's not trans kids.\nIt's Christian/conservative parents who don't want to teach their sons to wash their peckers.",
                "Crazy that people still do this shit to their babies for whatever weird reasons."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Multiple deaths in Vancouver street festival Van attack",
            "external_url": "https://www.cbc.ca/news/canada/british-columbia/vehicle-hits-crowd-filipino-festival-lapu-lapu-day-block-party-1.7519778",
            "upvotes": 18257,
            "date": "04/27/2025",
            "thumbnail": "https://i.cbc.ca/1.7519787.1745732600!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/lapu-lapu-police.jpg?im=Resize%3D620",
            "top_comments": [
                "From the police: A 30-year-old Vancouver man was arrested at the scene after driving into a crowd, killing at least 8 people, around 8:14 PM local time.",
                "In the pinned Vancouver thread it says that 40 people were struck. ",
                "We’re going to have to start putting balustrades and bollards everywhere now",
                "Vancouver hasn't had anything quite like this happen before. \n\nI think we all felt really safe + immune here, BC is such a chill place. This is horrifying.",
                "Just watched a video where they have the dude against a fence. Asian guy, doesn't seem older than 30. He was just standing there and said \"I'm sorry\" very annoyingly when being yelled at. Really can't tell what's an accident and what's intentional these days...",
                "[removed]",
                "We live in Hawai'i and my aunt flew to Vancouver last week to visit her relatives. She just contacted my mom saying she and her sister's family just witnessed this tragedy and they are currently reeling. We pray for all the victims and cannot believe something violent such as this would happen to Vancouver.",
                "This reminds me to the times when every city used to put giant pots in walking places so this kind of thing could be \"prevented\". I think it was at those times when terrorism was all time high after 11S.\n\nSad :(",
                "Local police confirmed suspect is known to them but not entirely known to what degree. Some families have yet to be contacted so details will be held out of respect. There should be another briefing Sunday morning. It’s current 1:47AM here in Vancouver",
                "I just saw a video of the aftermath on Twitter, and counted at least 7 bodies. Jesus fucking Christ. This is gonna be really really fucking bad. Fuck. It was a street festival. People should always return home safely from a street festival. Unfathomable."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Local Social Security offices face staffing shortages, delays due to federal budget cuts",
            "external_url": "https://cbs6albany.com/news/local/local-social-security-offices-face-staffing-shortages-delays-due-to-federal-budget-cuts",
            "upvotes": 2958,
            "date": "04/27/2025",
            "thumbnail": "https://cbs6albany.com/resources/media2/16x9/6187/986/0x323/90/bbb6c68e-dc7b-4336-b82d-0f8551aa3928-AP25045062103614.jpg",
            "top_comments": [
                "Working as intended....smh",
                "1. Cut funding for public programs that help people\n\n2. They get worse due to budget cuts\n\n3. Use the lack of productivity you directly caused as evidence of social safety nets being worthless\n\n4. Repeat",
                "But they said the cuts would have no effect on benefits.",
                "How many social security recipients voted for this?\n\nMeanwhile the laughing black lady wanted to expand Medicare to cover in-home care for our elderly.\n\nOopsie poopsie, hope y’all enjoy eating cat food.",
                "How does trump still have such a high approval rating?! It makes no goddamn sense.  His administration has just been a wildfire of awfulness through this country",
                "Both of my parents just retired. I’m the only family member left in the same area. \n\nI have a strong feeling this is going to make *my* life as difficult as it will theirs, as I do my best to handle their administrative stuff, since they’ve, uh, slowed down quite a bit. (It’s hard to accept when you see your parents reeeaaally start to age and not be able to do as much.) \n\nI’ve been thinking about this frequently since they first announced rural offices would be closing; we’re in a rural area, and access to stuff like this is already very limited.",
                "Social security receiving Trump supporters. Why did Biden and the Deml do this. ",
                "Social Security is advertising for jobs in my area. I just don't know who would leave a steady job to go work for the feds right now.",
                "Friendly reminder that Elon Musk is a traitorous Nazi. And we aren’t going to forget that now that he’s hiding back in the shadows.",
                "Starting to think \"America First!\" was a veiled threat that nobody understood."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "The FBI mistakenly raided their Atlanta home. Now the Supreme Court will hear their lawsuit",
            "external_url": "https://apnews.com/article/georgia-fbi-raid-supreme-court-lawsuit-9cb55aa6f45bbf02c29d84363c7c9e6f",
            "upvotes": 686,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Oops wrong house, oops wrong house, oops wrong house, oops wrong house, oops wrong house”\n\n“Well this neighborhood is clean I really thought we would find something too”",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions.\n\nI would think any patently wrong decision should absolutely be “second guessed”. Something precious has been taken from the victims, and whether or not the officers should be personally held accountable, the government should absolutely provide some reasonable measure of restitution including physical damage and the opportunity for psychological counseling.",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions\n\nCorrect me if I'm wrong but isn't second-guessing law enforcement decisions like, at least 60% of a courts job",
                "So shouldn’t be long before the Supreme Court rules it’s okay to violate the 4th amendment as long as the officers were just trying their darnedest and didn’t mean to.",
                "Allowing a GPS device to take you to the wrong address isn't an honest mistake. It's gross incompetence that is extraordinarily easy to avoid.\n\n\nA life and death situation and this stupid motherfuckering agent popped info into the GPS and was off to adventure time.\n\n\nNo checking Google maps or street views. No driving by the place before hand. No use of additional GPS devices by other agents involved. Nothing. Squat. Nada.\n\n\nPure laziness and idiocy that you'd hope would mean immediate handing in of any badges, and a national Do Not Hire flag for the entire team responsible.\n\n\nBut nope.",
                "This kind of shit happens way too much. I think they may want to quadruple check these raids before they ok them.",
                "I wonder how the Supreme Court will defy precedent to allow cops to do this more in the future. \n\nHearing their absurd justifications is always entertaining in a macabre.",
                "I am waiting to find out whether this Maga Supreme Court hates Black people more or the FBI more.",
                "Why is this any different than doctors? They also don't mean to make mistakes.",
                "I executed tons of search warrants in my career. Never hit the wrong house.  This isn’t a mistake. It’s laziness and incompetence of the highest order."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Ex-New Mexico judge arrested in case involving man suspected of being a Venezuelan gang member",
            "external_url": "https://apnews.com/article/new-mexico-judge-arrested-venezuelan-gang-gun-360d4ec8ba6676fbf33abcb606c3f104",
            "upvotes": 1370,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the article: \"A former New Mexico judge has been arrested on an evidence tampering charge for allegedly destroying a phone belonging to a tenant who is accused of keeping guns at the property and suspected of being a member of a Venezuelan criminal gang.\n\nFederal authorities said in court records that former Doña Ana County Magistrate Judge Jose Luis “Joel” Cano, who was arrested Thursday, told investigators that he believed photos or videos on the device would reflect negatively on the tenant and threw away what remained of it five weeks ago after smashing it with a hammer.\n\nCano resigned last month after the state Judicial Standards Commission sought to suspend him, saying he was accused of letting three members of the Venezuelan gang Tren de Aragua live on his property in Las Cruces and have access to firearms.\"",
                "The narrative being presented in the article doesn't make a lot of sense to me.\n\nSo far as I'm aware there's nothing inherently illegal about shooting guns and alleged \"evidence tampering phone destruction\" seems very temporally disconnected from the other events.",
                "Maybe its true but its probably not. They make fools of the public every day. You can’t believe anything the trump and his doj puts out there. They’ve routinely lied to federal judges under penalty of perjury. They will say anything at any time without regards to truth.",
                "I dont understand how one can tamper with evidence if an investigation hasn't been formally announced or if the phone owner is not under indictment?\n\nHowever, basic legal principles doesn't seem to apply anymore when discussing the actions of these federal agencies. \n\nHowever, if he told investigators (why would he do so?) that he purposefully destroyed evidence pertaining to criminal conduct, that could be criminal misconduct I think or at the very least judicial misconduct. \n\nBut of course, being a judge and all, why would you even allow yourself to answer any questions about these people at all. Just keep your mouth shut or have a lawyer talk for you. \n\nAlso, the gun thing seems irrelevant. Unless these people are convicted felons, I dont think its illegal to give them access to firearms. Its kind of weird, but I suppose not illegal.   \n  \nI don't know, seems like a weird story but its interesting.",
                "It's not evidence tampering unless they knew there was an investigation or they knew one was going to be started.\n\n\n§ 11.440 Tampering with or fabricating physical evidence.\n\nA person commits a misdemeanor if, believing that an official proceeding or investigation is pending or about to be instituted, he or she:",
                "When even a former judge is accused of shielding tenants tied to a gang and destroying evidence, it raises serious questions, not just about the individuals, but about how overwhelmed or inconsistent our immigration and vetting systems have become. It's a reminder: due process matters, but so does accountability — for everyone, no matter their role",
                "It is an open attack on the judiciary.",
                "A question for Americans on here:\n\nWhy are you all letting Cheeto King embarrass you all so much?",
                "At least this time they appear to have at least the semblance of justification for their actions. Assuming--and that's a big assumption--there was some kind of official request for that phone, or he even suspected one was imminent, then he did indeed tamper with evidence. However, if maybe the people moved out, left the phone behind, he looked at it when inspecting the unit then found something like the furry porn mentioned by someone else--not illegal, but might be very embarrassing for the person if it were to get out--and that's why he destroyed it, having no knowledge or reasonable suspicion to think that there was any kind of imminent request from law enforcement... then this is just another case of political persecution by the Trump admin.",
                "If everyone is a gang member, no one is."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "An Ohio doctor killed his wife 36 years ago. As his parole hearing nears, his son wrestles with his emotions",
            "external_url": "https://www.cnn.com/2025/04/27/us/john-boyle-murder-collier-landry-cec/index.html",
            "upvotes": 553,
            "date": "04/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/boyle1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "What an amazing story.  Thank you for the copy.\n\nThat must have been terrifying, having to live with the person you _know_ murdered his own wife, hoping he wouldn't know you were meeting with police, hoping he wouldn't do the same to you.",
                "Sad that he and his sister were broken up/not put in the same family, and that he never saw her again. \n\nI mean I would want to reach out to her as adult, if I were him. At least say, 'if you want to connect, I'd be fine with that in whatever capacity you choose.' But that's just me. I won't judge him on his trauma response, because the whole thing was deeply traumatic.",
                "copy and paste in case of pay wall:\n\n Collier Landry heard a piercing scream and two thuds. He pulled the covers over his face as heavy footsteps passed outside his bedroom door. The glowing Batman clock on his wall said it was 3:17 a.m.\n\nThe 11-year-old boy held his breath, a flurry of questions racing through his mind: What was going on? Who was lurking outside his door? What had caused the commotion?\n\nThe footsteps briefly paused in the hallway — as if to check whether he was awake — then faded into the night.\n\nYoung Collier came downstairs the next morning looking for his mother. It was the last day of 1989 — New Year’s Eve — and his father sat on the living room couch in their home in Mansfield, Ohio. He calmly told his son that his mother had left them and gone on a vacation.\n\nSensing Collier’s distrust, his father told him, “I never laid a finger on mommy.” He threatened to punish him if he called the police and reported that she’d disappeared, Landry later said.\n\nThe boy felt something was off. His mother wouldn’t just leave him — especially not during the holiday season, he said. And so began a tragedy that captivated north-central Ohio and soon unearthed one dark secret after another.\n\nDetermined to uncover the truth, Collier called a friend of his mother’s — a woman she’d urged him to contact in an emergency. The call prompted a police investigation, with Collier as a key witness. Without his father’s knowledge he provided crucial details to the lead detective, marking a turning point in the case.\n\nThree weeks after she vanished, police exhumed Noreen Boyle’s body from the basement of a home 175 miles away in Erie, Pennsylvania. She was wrapped in a green tarp and her head was covered with a white plastic bag, which a coroner testified had been used to suffocate her.\n\nFive months later John Francis Boyle Jr. was found guilty of aggravated murder and sentenced to 20 years to life in prison.\n\nAfter more than three decades, the case is back in the spotlight with the release of a new podcast, “Finding Mom’s Killer,” which chronicles how the preteen boy teamed up with Mansfield police detective Dave Messmore to uncover the devastating truth about his mother’s disappearance. Collier Landry told CNN that after years of silence he now regularly talks to his father, who is incarcerated at the Marion Correctional Institute in Ohio.\n\nBoyle is now 81, and his third parole hearing is approaching in August. His son is struggling with a new whirlwind of emotions at the possibility of his dad’s release from prison.\n\n“I don’t feel vengeful toward my father … but it doesn’t mean that we can skip down the yellow brick road holding hands and being like, you know, everything’s great,” said Landry, who dropped the Boyle name after his father’s conviction.\n\nLandry is 47 now — about the same age as his father when he killed his mother.\n\n“I wonder, am I like him? Am I capable of this?” he said. “What separates my life with this person’s life? Why am I the one who will not carry on this legacy of violence?”\nHe discovered his dad’s secret while accompanying him on house calls\n\nTo an outsider, the Boyles’ family life in the 1980s might have appeared idyllic.\n\nJohn Boyle was an osteopathic doctor who ran a family practice in Mansfield. His photogenic family looked like they’d stepped from the pages of a magazine. The couple had also adopted a younger child, Elizabeth, from China and lived in a modest home with their wire fox terrier, Gowdy.\n\nLandry recalled some of his favorite moments during family road trips. His father played classical music in their car, and Landry would sit in the backseat, waving a straw and pretending to be the conductor.\n\nHe loved accompanying his father on his house calls — some doctors still made those back then — in the city of 50,000 people about 75 miles southwest of Cleveland.\n\nDuring those visits, his father appeared especially interested in a younger woman he described as one of his patients, Landry said. He witnessed his father and the woman taking walks, holding hands and stealing kisses. \n\n Landry became more suspicious when he noticed the woman was wearing his mom’s diamond ring. It had two tiny bars to glide the diamonds back-and-forth, a distinctive design that made it easily noticeable, he said.\n\nHe told his mom about the other woman, which led to arguments between his parents, he said. His mother filed for divorce. She began to feel unsafe and gave him the names and numbers of her friends, he said.\n\n“She said, ‘Collier, if your father happens to say that I might have left, call all my friends and have them contact the police and have them investigate how I disappeared,’” Landry testified in court.\n\nThe boy hid the paper with the phone numbers inside a stuffed Garfield cat on his bedroom dresser — not knowing that he’d need it only weeks later.\nA meeting with a detective changed the course of the investigation\n\nLess than two months after the couple filed for divorce, Noreen Boyle disappeared.\n\nSuspicious, Collier called her friends soon after, and they notified the police. Messmore, the Mansfield Police detective, showed up at the Boyles’ doorstep.\n\nMessmore, who’s now retired, told CNN that it was unusual for police to rely on the word of an 11-year-old. But Collier — with his neatly coiffed brown hair, pressed slacks, polo shirt and penny loafers — seemed to the detective like a miniature adult who made it clear in no uncertain terms that something had happened to his mother.\n\n“He was … adamant that there was something really wrong,” Messmore said. “He was close with his mother, and she took him everywhere.” \n\n As Messmore looked deeper into Collier’s concerns, he discovered the couple was in the middle of a bitter divorce and fighting over alimony, child support, joint credit card debts and other financial issues, he said.\n\nMessmore visited the boy at his elementary school. With permission from the principal, they would meet in an empty classroom and talk.\n\nAbout two weeks after Noreen Boyle’s disappearance, Collier found photos in the console of his father’s truck that changed the course of the investigation.\n\nThey showed his father hugging the younger woman next to a fireplace inside a house the boy had never seen before. The woman appeared pregnant. Collier shared the information with Messmore, who discovered that Boyle planned to shutter his Ohio practice for a lucrative job at a company in Erie.\n\nMessmore also learned that Boyle and the woman had bought the house in Erie together, and she had signed the real estate paperwork as his wife.\n\nA search of the Mansfield home had not yielded any clues, so investigators got a warrant for the Erie home, Messmore said.\n\nAuthorities spotted a green carpet in one section of the home’s unfinished basement and ripped it out to reveal a fresh patch of concrete in the shape of a gravesite. They cracked it open and found her body.\n\nProsecutors learned Boyle had rented a jackhammer two days before his wife disappeared and cited it as evidence of premeditation.\n\n“It wasn’t something where he just lost his temper. It was something he planned for a period of time,” Messmore said.\n\nBoyle was indicted and went on trial in June 1990.\n\nCollier, who was the prosecution’s star witness, described the sounds he heard that night. He also shared how his father’s demeanor changed after his mother disappeared. The morning she went missing, he took both children to McDonald’s for pancakes.\n\n“He was acting like daddy dearest and daddy perfect and so nice and stuff like that,” he testified, according to a court transcript.\n\nA jury found Boyle guilty. In statements to the jury, the prosecution used chilling words to describe the doctor: “Healer by day, killer by night.”\nAfter years of silence, he recently reconnected with his father\n\nWithin months, Collier lost everything: his parents, his sister, his home, his dog. He went from a little boy whose parents doted on him to being the child of both a murderer and a victim.\n\nHe lived in foster homes — Messmore’s family briefly took him in — before he was adopted by a Mansfield couple whose child attended the same private school. His adopted sister went to a different home and like him, changed her last name. Landry has not seen her since, he said.\n\nStill haunted by his mother’s death, Collier Landry reached out to his father in prison not long after he was found guilty. In one of his initial letters in March 1991, he got straight to the point. \n\n “Dad, just to get things off my chest, why did you kill my mom? I know you think you didn’t do it, but if you didn’t, why are you in prison?” he wrote. “Don’t get my reasoning wrong. I do love you. Even though you have hurt me … you are my father. And I owe you a great debt.”\n\nHis father was appealing his conviction and responded with letters calling Landry a liar and urging him to recant his testimony. After he refused, his father sent him an eight-page letter in November 1992 suggesting he was delusional, Landry said.\n\n“I will not subscribe to your petulant attitude. I will not feel sorry for poor Collier,” he wrote. “Your day is coming when all will be displayed in court. The difference will be that I will not remain silent this time. You have released me from any compulsion to protect you.”",
                "Wow what a read. \n\n\n\n\nA family member of mine is married to a guy that went through something similar when he was a child. His mom snapped and shot and killed his dad. I've only ever met him a few times but every time I have, he's always been drunk. I can't imagine it's easy to carry the weight of that.",
                "The father sounds like a real piece of work. Deny the murder for decades. Tell the son he’s a delusional liar. Then later admit to the murder but call it an accident. You don’t accidentally kill someone and then rent a jackhammer and bury them in cement in the basement of your newly purchased home with your soon to be new girlfriend/wife.",
                "Thank you for writing up the story for us to read. I admire Landry strength. It is so difficult to live past such a traumatic event. He must have felt lost, betrayed, lonely. His father should die in prison.",
                "The way the murderer calls his dead wife \"it\" in his confession is chilling.  The son is right, this man should not be released from prison.",
                "This is tragic. \nI’m glad both kids got adopted and that Landry is finding his way and has made a decent life. \n\nI think this is a good piece to read to think more about challenging times with a live in partner. \n\nI think if one feels concerned enough for one’s safety to give your kid info on who to contact, then maybe it is time to find a way to organize to leave that home with the kids. \n\nHe planned it, she was concerned that she could be disappeared. \n\nDomestic violence is not uncommon. It is very complex. It is good to think about what supports one has and being able to determine when it is time to get out of one can. \n\nPlease be safe y’all",
                "It's a little strange to hear that Collier Landry is speaking to his father and is anywhere near being on the path to mending their relationship, because he's said before that his father is a narcissist. Narcissists don't change. Mending anything with them is a recipe for disaster.",
                "There was a Forensic Files episode on this case, and Collier has such bravery to be able to stand up to his father."
            ],
            "aggregate_sentiment": 32.0
        },
        {
            "category": "HOT",
            "title": "Wife of US Coast Guard member arrested over expired visa after security check for military housing",
            "external_url": "https://abcnews.go.com/US/wireStory/wife-us-coast-guard-member-arrested-expired-visa-121204871",
            "upvotes": 9664,
            "date": "04/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a40708c4-10c6-4b39-9805-1d9cf1999ac0/wirestory_8c59f778f3245b470871e1da96bf90e7_16x9.jpg?w=1600",
            "top_comments": [
                "America's #1 issue is that military service members and their spouses aren't being harassed and jailed enough! 🏌️‍♂️⛳",
                "As I said, the population may well be halved after the purges.",
                "At a certain point, we as Americans need to ask ourselves, [\"Are we the baddies\"? ](https://www.youtube.com/watch?v=h242eDB84zY)",
                "So much for trying to promote having babies. Can't do that with competing directions.",
                ">the woman and her Coast Guard husband were preparing to move into their on-base housing on Wednesday, they went to the visitor control center to get a pass so she could access the Key West installation. During the routine security screening required for base access, the woman's name was flagged as a problem.\n\nShe's undocumented, married a serviceman 6 weeks ago, and they decided it was a good idea to move into on-base housing and get her  a security pass.  OMFG",
                "Sorry, this is not the the same as the recent gross abuses we've recently witnessed, so I'm not gonna pretend to manufucture outrage over this. There was a removal order given YEARS ago. How about we focus on the actual horrors we've just witnessed.",
                "As much as I think this is probably nonsense, the woman's work visa expired in 2017. She had been told her visa had expired and she needed to leave. So it appears she'd been here illegally for several years. She only got married to this guy earlier this year. It's a bit hard to go to the mat for this specific case especially considering she could be living among US military forces.\n\nI'm going to reserve my anger for those cases that appear to be multiplying where people here on legal visas are just snatched off the street and deported with no due process and sent to who knows where.",
                "Did anyone read the article before commenting?\n\n“According to a U.S. official, the woman's work visa expired around 2017, and she was marked for removal from the United States a few years later.” \n\nShe’s had 8 years to get her shit sorted out.",
                "Step 1: Impose tariffs on pretty much all goods imported into the US, which are undeniably paid by the people in America who purchase those goods.\n\nStep 2: Deport the hardworking, honest, taxpaying people who would be most likely to purchase those goods from their home countries and have them shipped to their new homes in America. \n\nStep 3: Place tariffs on an island inhabited entirely by penguins.\n\nStep 4: ???\n\nStep 5: Profit.",
                "I am liberal as they come on social issues, but this lady overstayed her visa by 8 fucking years and last minute married an American to stay. Fuck that noise, why should we throw a fit that she got deported? \n\n\nI honestly can understand the position on fighting for asylum seekers, and people who had been here decades as a kid with no problems. Not getting a proper trial, thats a huge problem. Someone clearly illegally staying in the US getting deported should be fine if she got a trial and sent back. "
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "11 injured, 1 dead after shooting on North Ocean Blvd, SLED investigating: MBPD",
            "external_url": "https://wpde.com/news/local/police-investigating-after-shooting-incident-on-north-ocean-blvd-in-myrtle-beach",
            "upvotes": 251,
            "date": "04/27/2025",
            "thumbnail": "https://wpde.com/resources/media2/16x9/800/986/1x9/90/6953005f-244f-4ed6-9f99-651908232175-Image.jpg",
            "top_comments": [
                "*“Our officer saw what happened, and when he saw that an altercation was taking place and a gun was being shot, the officer responded very quickly and in my opinion, saved lives,” she said. “Last night could have been so much worse.”*\n\nAnd thus opens the tourist season in Myrtle Beach.",
                "“MYRTLE BEACH, S.C. (WPDE) — As of Sunday morning, 11 people are injured and one is dead after a shooting along the 900 block of North Ocean Boulevard on Saturday night, according to The Myrtle Beach Police Department.”",
                "So just another day in America then? \n\nWe are so fucking stupid. Weapons in abundance but no help to be found for the downtrodden.",
                "Well, this would have not been known had it not been posted in this subreddit.\n\nJFC, if I had the ability to move out of this hellhole of a country, I would be more than happy to.",
                "No mention of whether the person the officer shot was the one doing the shooting, eh?",
                "If only there was some way to help prevent this. Damn.",
                "It's not a white supremacist so reddit doesn't care."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Man allegedly hid marijuana in Easter eggs across the city, posted clues to social media",
            "external_url": "https://local12.com/news/offbeat/easter-egg-marijuana-scavenger-hunt-hints-online-eggs-weed-pot-facebook-social-media-hint-picture-pictures-hid-hidden-police-search-investigation-five-drug-drugs-narcotics-dealer-selling-sell-park-parks-city-around-across?fbclid=IwZXh0bgNhZW0CMTEAAR4yYc8DWrYX0bIgzKbIsg1XPl84PybdrKUGKvLNoCTot1cmS4UyJ6dUCqDB9A_aem_x9AL9gaNBCFh-kY10ab7kw",
            "upvotes": 59,
            "date": "04/27/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/1920/986/center/90/34125fb8-3b75-40d0-b8b0-d1f0e60e0986-weedscavengerhunt.png",
            "top_comments": [
                "Where was he when I was a teen?",
                "Give this man a key the city",
                "Paranoid people have been getting it wrong. There aren't any drugs in the Halloween candy, they're in the Easter eggs!",
                "Doing god’s work here",
                "What a waste of time and money for a couple of dub sacks. "
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Man allegedly hid marijuana in Easter eggs across the city, posted clues to social media",
            "external_url": "https://local12.com/news/offbeat/easter-egg-marijuana-scavenger-hunt-hints-online-eggs-weed-pot-facebook-social-media-hint-picture-pictures-hid-hidden-police-search-investigation-five-drug-drugs-narcotics-dealer-selling-sell-park-parks-city-around-across?fbclid=IwZXh0bgNhZW0CMTEAAR4yYc8DWrYX0bIgzKbIsg1XPl84PybdrKUGKvLNoCTot1cmS4UyJ6dUCqDB9A_aem_x9AL9gaNBCFh-kY10ab7kw",
            "upvotes": 67,
            "date": "04/27/2025",
            "thumbnail": "https://local12.com/resources/media2/16x9/1920/986/center/90/34125fb8-3b75-40d0-b8b0-d1f0e60e0986-weedscavengerhunt.png",
            "top_comments": [
                "Where was he when I was a teen?",
                "Give this man a key the city",
                "Paranoid people have been getting it wrong. There aren't any drugs in the Halloween candy, they're in the Easter eggs!",
                "Doing god’s work here",
                "What a waste of time and money for a couple of dub sacks. "
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "The FBI mistakenly raided their Atlanta home. Now the Supreme Court will hear their lawsuit",
            "external_url": "https://apnews.com/article/georgia-fbi-raid-supreme-court-lawsuit-9cb55aa6f45bbf02c29d84363c7c9e6f",
            "upvotes": 691,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Oops wrong house, oops wrong house, oops wrong house, oops wrong house, oops wrong house”\n\n“Well this neighborhood is clean I really thought we would find something too”",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions.\n\nI would think any patently wrong decision should absolutely be “second guessed”. Something precious has been taken from the victims, and whether or not the officers should be personally held accountable, the government should absolutely provide some reasonable measure of restitution including physical damage and the opportunity for psychological counseling.",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions\n\nCorrect me if I'm wrong but isn't second-guessing law enforcement decisions like, at least 60% of a courts job",
                "So shouldn’t be long before the Supreme Court rules it’s okay to violate the 4th amendment as long as the officers were just trying their darnedest and didn’t mean to.",
                "Allowing a GPS device to take you to the wrong address isn't an honest mistake. It's gross incompetence that is extraordinarily easy to avoid.\n\n\nA life and death situation and this stupid motherfuckering agent popped info into the GPS and was off to adventure time.\n\n\nNo checking Google maps or street views. No driving by the place before hand. No use of additional GPS devices by other agents involved. Nothing. Squat. Nada.\n\n\nPure laziness and idiocy that you'd hope would mean immediate handing in of any badges, and a national Do Not Hire flag for the entire team responsible.\n\n\nBut nope.",
                "This kind of shit happens way too much. I think they may want to quadruple check these raids before they ok them.",
                "I wonder how the Supreme Court will defy precedent to allow cops to do this more in the future. \n\nHearing their absurd justifications is always entertaining in a macabre.",
                "I am waiting to find out whether this Maga Supreme Court hates Black people more or the FBI more.",
                "Why is this any different than doctors? They also don't mean to make mistakes.",
                "I executed tons of search warrants in my career. Never hit the wrong house.  This isn’t a mistake. It’s laziness and incompetence of the highest order."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "11 injured, 1 dead after shooting on North Ocean Blvd, SLED investigating: MBPD",
            "external_url": "https://wpde.com/news/local/police-investigating-after-shooting-incident-on-north-ocean-blvd-in-myrtle-beach",
            "upvotes": 252,
            "date": "04/27/2025",
            "thumbnail": "https://wpde.com/resources/media2/16x9/800/986/1x9/90/6953005f-244f-4ed6-9f99-651908232175-Image.jpg",
            "top_comments": [
                "*“Our officer saw what happened, and when he saw that an altercation was taking place and a gun was being shot, the officer responded very quickly and in my opinion, saved lives,” she said. “Last night could have been so much worse.”*\n\nAnd thus opens the tourist season in Myrtle Beach.",
                "“MYRTLE BEACH, S.C. (WPDE) — As of Sunday morning, 11 people are injured and one is dead after a shooting along the 900 block of North Ocean Boulevard on Saturday night, according to The Myrtle Beach Police Department.”",
                "So just another day in America then? \n\nWe are so fucking stupid. Weapons in abundance but no help to be found for the downtrodden.",
                "Well, this would have not been known had it not been posted in this subreddit.\n\nJFC, if I had the ability to move out of this hellhole of a country, I would be more than happy to.",
                "No mention of whether the person the officer shot was the one doing the shooting, eh?",
                "If only there was some way to help prevent this. Damn.",
                "It's not a white supremacist so reddit doesn't care."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Circumcision at NYC hospital almost made baby bleed to death, parents say",
            "external_url": "https://www.cbsnews.com/newyork/news/baby-nearly-bled-to-death-circumcision-parents-say/",
            "upvotes": 4360,
            "date": "04/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/25/2607bc07-2da0-4f95-a5be-c67a4b41f989/thumbnail/1200x630/0790313b56ce710814d12de467b8523d/bisram-5p-pkg-alleged-b-wcbsdpf9-hi-res-still-00-00-5619.jpg?v=8e9dede207b29c97b32974c53e32aabc",
            "top_comments": [
                "For those who haven't read the article, child was born with heart condition. After receiving a stent, hospital asked parents if they wanted to go ahead of circ. According to parents, hospital did not warn them about increased risks of surgery in an infant with a heart condition. \n\nAnd on a personal note, I was shocked by how much pressure the docs and nurses put on us after our son was born.  Not-so-subtle but still indirect \"Are you sure?\" and ongoing discussion after we indicated \"no.\"",
                "I'm a nurse in critical care, and have seem some truly horrific things. The only thing that ever made me feel light-headed, like I might vomit or faint, was seeing an infant circumcision during my OB rotation in school. The way that little baby screamed... Absolutely horrifying. There is no good reason for this to be a commonplace practice",
                "Forcing male cosmetic surgery on an infant \\*should\\* be illegal, just how it is for females. We just aren't ready for that talk as a society yet, which disappoints me considerably.",
                "We could eradicate breast cancer if we did preventative mastectomies on every woman. We don't alter their secondary sexual characteristics to prevent terminal illness, altering a boy's to prevent UTIs is insane.",
                "Elective plastic surgery within days of birth is wild.",
                "Who knew non-consensual genital mutilation could do that.",
                "It's estimated that approximately 117 male neonatal deaths per year in the US are due to complications of circumcision.",
                "anesthesia checking in.  I see so many circumcision revisions on the OR board.  Some problems aren't seen until years later.  Please stop mutilating boys.  Parents complain their girls sleep well but their boys took months to sleep well.  That's because circumcision is painful genital mutilation.  If you want your baby to sleep well don't mutilate their genitals.  Boys and girls deserve the right to intact genitals.  The foreskin and labial hood protect from chaffing.",
                "Nonconsensual genital mutilation happens every day in the US, and it's not trans kids.\nIt's Christian/conservative parents who don't want to teach their sons to wash their peckers.",
                "Crazy that people still do this shit to their babies for whatever weird reasons."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "An Ohio doctor killed his wife 36 years ago. As his parole hearing nears, his son wrestles with his emotions",
            "external_url": "https://www.cnn.com/2025/04/27/us/john-boyle-murder-collier-landry-cec/index.html",
            "upvotes": 549,
            "date": "04/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/boyle1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "What an amazing story.  Thank you for the copy.\n\nThat must have been terrifying, having to live with the person you _know_ murdered his own wife, hoping he wouldn't know you were meeting with police, hoping he wouldn't do the same to you.",
                "Sad that he and his sister were broken up/not put in the same family, and that he never saw her again. \n\nI mean I would want to reach out to her as adult, if I were him. At least say, 'if you want to connect, I'd be fine with that in whatever capacity you choose.' But that's just me. I won't judge him on his trauma response, because the whole thing was deeply traumatic.",
                "copy and paste in case of pay wall:\n\n Collier Landry heard a piercing scream and two thuds. He pulled the covers over his face as heavy footsteps passed outside his bedroom door. The glowing Batman clock on his wall said it was 3:17 a.m.\n\nThe 11-year-old boy held his breath, a flurry of questions racing through his mind: What was going on? Who was lurking outside his door? What had caused the commotion?\n\nThe footsteps briefly paused in the hallway — as if to check whether he was awake — then faded into the night.\n\nYoung Collier came downstairs the next morning looking for his mother. It was the last day of 1989 — New Year’s Eve — and his father sat on the living room couch in their home in Mansfield, Ohio. He calmly told his son that his mother had left them and gone on a vacation.\n\nSensing Collier’s distrust, his father told him, “I never laid a finger on mommy.” He threatened to punish him if he called the police and reported that she’d disappeared, Landry later said.\n\nThe boy felt something was off. His mother wouldn’t just leave him — especially not during the holiday season, he said. And so began a tragedy that captivated north-central Ohio and soon unearthed one dark secret after another.\n\nDetermined to uncover the truth, Collier called a friend of his mother’s — a woman she’d urged him to contact in an emergency. The call prompted a police investigation, with Collier as a key witness. Without his father’s knowledge he provided crucial details to the lead detective, marking a turning point in the case.\n\nThree weeks after she vanished, police exhumed Noreen Boyle’s body from the basement of a home 175 miles away in Erie, Pennsylvania. She was wrapped in a green tarp and her head was covered with a white plastic bag, which a coroner testified had been used to suffocate her.\n\nFive months later John Francis Boyle Jr. was found guilty of aggravated murder and sentenced to 20 years to life in prison.\n\nAfter more than three decades, the case is back in the spotlight with the release of a new podcast, “Finding Mom’s Killer,” which chronicles how the preteen boy teamed up with Mansfield police detective Dave Messmore to uncover the devastating truth about his mother’s disappearance. Collier Landry told CNN that after years of silence he now regularly talks to his father, who is incarcerated at the Marion Correctional Institute in Ohio.\n\nBoyle is now 81, and his third parole hearing is approaching in August. His son is struggling with a new whirlwind of emotions at the possibility of his dad’s release from prison.\n\n“I don’t feel vengeful toward my father … but it doesn’t mean that we can skip down the yellow brick road holding hands and being like, you know, everything’s great,” said Landry, who dropped the Boyle name after his father’s conviction.\n\nLandry is 47 now — about the same age as his father when he killed his mother.\n\n“I wonder, am I like him? Am I capable of this?” he said. “What separates my life with this person’s life? Why am I the one who will not carry on this legacy of violence?”\nHe discovered his dad’s secret while accompanying him on house calls\n\nTo an outsider, the Boyles’ family life in the 1980s might have appeared idyllic.\n\nJohn Boyle was an osteopathic doctor who ran a family practice in Mansfield. His photogenic family looked like they’d stepped from the pages of a magazine. The couple had also adopted a younger child, Elizabeth, from China and lived in a modest home with their wire fox terrier, Gowdy.\n\nLandry recalled some of his favorite moments during family road trips. His father played classical music in their car, and Landry would sit in the backseat, waving a straw and pretending to be the conductor.\n\nHe loved accompanying his father on his house calls — some doctors still made those back then — in the city of 50,000 people about 75 miles southwest of Cleveland.\n\nDuring those visits, his father appeared especially interested in a younger woman he described as one of his patients, Landry said. He witnessed his father and the woman taking walks, holding hands and stealing kisses. \n\n Landry became more suspicious when he noticed the woman was wearing his mom’s diamond ring. It had two tiny bars to glide the diamonds back-and-forth, a distinctive design that made it easily noticeable, he said.\n\nHe told his mom about the other woman, which led to arguments between his parents, he said. His mother filed for divorce. She began to feel unsafe and gave him the names and numbers of her friends, he said.\n\n“She said, ‘Collier, if your father happens to say that I might have left, call all my friends and have them contact the police and have them investigate how I disappeared,’” Landry testified in court.\n\nThe boy hid the paper with the phone numbers inside a stuffed Garfield cat on his bedroom dresser — not knowing that he’d need it only weeks later.\nA meeting with a detective changed the course of the investigation\n\nLess than two months after the couple filed for divorce, Noreen Boyle disappeared.\n\nSuspicious, Collier called her friends soon after, and they notified the police. Messmore, the Mansfield Police detective, showed up at the Boyles’ doorstep.\n\nMessmore, who’s now retired, told CNN that it was unusual for police to rely on the word of an 11-year-old. But Collier — with his neatly coiffed brown hair, pressed slacks, polo shirt and penny loafers — seemed to the detective like a miniature adult who made it clear in no uncertain terms that something had happened to his mother.\n\n“He was … adamant that there was something really wrong,” Messmore said. “He was close with his mother, and she took him everywhere.” \n\n As Messmore looked deeper into Collier’s concerns, he discovered the couple was in the middle of a bitter divorce and fighting over alimony, child support, joint credit card debts and other financial issues, he said.\n\nMessmore visited the boy at his elementary school. With permission from the principal, they would meet in an empty classroom and talk.\n\nAbout two weeks after Noreen Boyle’s disappearance, Collier found photos in the console of his father’s truck that changed the course of the investigation.\n\nThey showed his father hugging the younger woman next to a fireplace inside a house the boy had never seen before. The woman appeared pregnant. Collier shared the information with Messmore, who discovered that Boyle planned to shutter his Ohio practice for a lucrative job at a company in Erie.\n\nMessmore also learned that Boyle and the woman had bought the house in Erie together, and she had signed the real estate paperwork as his wife.\n\nA search of the Mansfield home had not yielded any clues, so investigators got a warrant for the Erie home, Messmore said.\n\nAuthorities spotted a green carpet in one section of the home’s unfinished basement and ripped it out to reveal a fresh patch of concrete in the shape of a gravesite. They cracked it open and found her body.\n\nProsecutors learned Boyle had rented a jackhammer two days before his wife disappeared and cited it as evidence of premeditation.\n\n“It wasn’t something where he just lost his temper. It was something he planned for a period of time,” Messmore said.\n\nBoyle was indicted and went on trial in June 1990.\n\nCollier, who was the prosecution’s star witness, described the sounds he heard that night. He also shared how his father’s demeanor changed after his mother disappeared. The morning she went missing, he took both children to McDonald’s for pancakes.\n\n“He was acting like daddy dearest and daddy perfect and so nice and stuff like that,” he testified, according to a court transcript.\n\nA jury found Boyle guilty. In statements to the jury, the prosecution used chilling words to describe the doctor: “Healer by day, killer by night.”\nAfter years of silence, he recently reconnected with his father\n\nWithin months, Collier lost everything: his parents, his sister, his home, his dog. He went from a little boy whose parents doted on him to being the child of both a murderer and a victim.\n\nHe lived in foster homes — Messmore’s family briefly took him in — before he was adopted by a Mansfield couple whose child attended the same private school. His adopted sister went to a different home and like him, changed her last name. Landry has not seen her since, he said.\n\nStill haunted by his mother’s death, Collier Landry reached out to his father in prison not long after he was found guilty. In one of his initial letters in March 1991, he got straight to the point. \n\n “Dad, just to get things off my chest, why did you kill my mom? I know you think you didn’t do it, but if you didn’t, why are you in prison?” he wrote. “Don’t get my reasoning wrong. I do love you. Even though you have hurt me … you are my father. And I owe you a great debt.”\n\nHis father was appealing his conviction and responded with letters calling Landry a liar and urging him to recant his testimony. After he refused, his father sent him an eight-page letter in November 1992 suggesting he was delusional, Landry said.\n\n“I will not subscribe to your petulant attitude. I will not feel sorry for poor Collier,” he wrote. “Your day is coming when all will be displayed in court. The difference will be that I will not remain silent this time. You have released me from any compulsion to protect you.”",
                "Wow what a read. \n\n\n\n\nA family member of mine is married to a guy that went through something similar when he was a child. His mom snapped and shot and killed his dad. I've only ever met him a few times but every time I have, he's always been drunk. I can't imagine it's easy to carry the weight of that.",
                "The father sounds like a real piece of work. Deny the murder for decades. Tell the son he’s a delusional liar. Then later admit to the murder but call it an accident. You don’t accidentally kill someone and then rent a jackhammer and bury them in cement in the basement of your newly purchased home with your soon to be new girlfriend/wife.",
                "Thank you for writing up the story for us to read. I admire Landry strength. It is so difficult to live past such a traumatic event. He must have felt lost, betrayed, lonely. His father should die in prison.",
                "The way the murderer calls his dead wife \"it\" in his confession is chilling.  The son is right, this man should not be released from prison.",
                "This is tragic. \nI’m glad both kids got adopted and that Landry is finding his way and has made a decent life. \n\nI think this is a good piece to read to think more about challenging times with a live in partner. \n\nI think if one feels concerned enough for one’s safety to give your kid info on who to contact, then maybe it is time to find a way to organize to leave that home with the kids. \n\nHe planned it, she was concerned that she could be disappeared. \n\nDomestic violence is not uncommon. It is very complex. It is good to think about what supports one has and being able to determine when it is time to get out of one can. \n\nPlease be safe y’all",
                "It's a little strange to hear that Collier Landry is speaking to his father and is anywhere near being on the path to mending their relationship, because he's said before that his father is a narcissist. Narcissists don't change. Mending anything with them is a recipe for disaster.",
                "There was a Forensic Files episode on this case, and Collier has such bravery to be able to stand up to his father."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Ex-New Mexico judge arrested in case involving man suspected of being a Venezuelan gang member",
            "external_url": "https://apnews.com/article/new-mexico-judge-arrested-venezuelan-gang-gun-360d4ec8ba6676fbf33abcb606c3f104",
            "upvotes": 1373,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the article: \"A former New Mexico judge has been arrested on an evidence tampering charge for allegedly destroying a phone belonging to a tenant who is accused of keeping guns at the property and suspected of being a member of a Venezuelan criminal gang.\n\nFederal authorities said in court records that former Doña Ana County Magistrate Judge Jose Luis “Joel” Cano, who was arrested Thursday, told investigators that he believed photos or videos on the device would reflect negatively on the tenant and threw away what remained of it five weeks ago after smashing it with a hammer.\n\nCano resigned last month after the state Judicial Standards Commission sought to suspend him, saying he was accused of letting three members of the Venezuelan gang Tren de Aragua live on his property in Las Cruces and have access to firearms.\"",
                "The narrative being presented in the article doesn't make a lot of sense to me.\n\nSo far as I'm aware there's nothing inherently illegal about shooting guns and alleged \"evidence tampering phone destruction\" seems very temporally disconnected from the other events.",
                "Maybe its true but its probably not. They make fools of the public every day. You can’t believe anything the trump and his doj puts out there. They’ve routinely lied to federal judges under penalty of perjury. They will say anything at any time without regards to truth.",
                "I dont understand how one can tamper with evidence if an investigation hasn't been formally announced or if the phone owner is not under indictment?\n\nHowever, basic legal principles doesn't seem to apply anymore when discussing the actions of these federal agencies. \n\nHowever, if he told investigators (why would he do so?) that he purposefully destroyed evidence pertaining to criminal conduct, that could be criminal misconduct I think or at the very least judicial misconduct. \n\nBut of course, being a judge and all, why would you even allow yourself to answer any questions about these people at all. Just keep your mouth shut or have a lawyer talk for you. \n\nAlso, the gun thing seems irrelevant. Unless these people are convicted felons, I dont think its illegal to give them access to firearms. Its kind of weird, but I suppose not illegal.   \n  \nI don't know, seems like a weird story but its interesting.",
                "It's not evidence tampering unless they knew there was an investigation or they knew one was going to be started.\n\n\n§ 11.440 Tampering with or fabricating physical evidence.\n\nA person commits a misdemeanor if, believing that an official proceeding or investigation is pending or about to be instituted, he or she:",
                "When even a former judge is accused of shielding tenants tied to a gang and destroying evidence, it raises serious questions, not just about the individuals, but about how overwhelmed or inconsistent our immigration and vetting systems have become. It's a reminder: due process matters, but so does accountability — for everyone, no matter their role",
                "It is an open attack on the judiciary.",
                "A question for Americans on here:\n\nWhy are you all letting Cheeto King embarrass you all so much?",
                "At least this time they appear to have at least the semblance of justification for their actions. Assuming--and that's a big assumption--there was some kind of official request for that phone, or he even suspected one was imminent, then he did indeed tamper with evidence. However, if maybe the people moved out, left the phone behind, he looked at it when inspecting the unit then found something like the furry porn mentioned by someone else--not illegal, but might be very embarrassing for the person if it were to get out--and that's why he destroyed it, having no knowledge or reasonable suspicion to think that there was any kind of imminent request from law enforcement... then this is just another case of political persecution by the Trump admin.",
                "If everyone is a gang member, no one is."
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "NEW",
            "title": "Journalists defend press freedom at muted White House correspondents’ dinner",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/27/white-house-correspondents-dinner",
            "upvotes": 13106,
            "date": "04/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3de87fcc8d0cd3ef43ea4e8bb3da63b41e4e45e1/0_273_8192_4918/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1439bd4aace8f904e33aee094e5efa24",
            "top_comments": [
                "I like how they cancelled the comedian and totally capitulated to Trump, just to not have him or anyone from the administration show up anyway. Sums up a lot",
                "These fuckers cancelled the comedian because they were worried about offending Trump. I won't even get into the decades of \"Both Sides Equally At Fault\" coverage that's played a material role in how the current state of affairs was arrived at. Absolutely fuck off and be better, THEN pat yourselves on the back.",
                "The media's been bothsidesing and sanewashing Trump for so long and now they wanna prate about press freedom as the monster they helped create openly cracks down on 1A rights. What a pack of useless fools, but I guess we get what we ask for.\n\nAmerica wanted to believe both sides were the same so they didn't have to pay attention and they paid people like this to tell them that, now here we are.",
                ">Journalists rallied in defence of press freedom on Saturday, insisting they “are not the enemy of the people” at [a Washington media gala](https://www.c-span.org/program/public-affairs-event/white-house-correspondents-association-dinner/658807) snubbed by Donald Trump.\n\nIt's weird the press has to make a point of not being the enemy of the people, and doubly bizarre considering who is doing the accusing.",
                "Journalists cover politics like it's red team vs blue team when the reality is Project 2025 vs the Constitution.",
                ">Alex Thompson of Axios, who won an award for coverage of Biden, silenced a room that was otherwise buzzing all night when he called out the media for failing to adequately investigate Biden’s mental acuity. The issue blew up when the 81-year-old gave a disastrous debate performance four months before the election.\n\n\nI think it's wild that this person thinks the mess up was that we just weren't hard enough on the Biden administration. Yeah, he fucked up immeasurably in how he fumbled the end of his term. Granted. The problem is not that the media didn't talk enough about Biden being old. That was literally everywhere.\n\n\nWe have a GOP that has been barreling towards authoritarianism for decades, and our media institutions have treated them as either rational thought leaders or loveable joksters while they've  torn down our communities and sold us off to wealthy donors.\n\n\nThese people sitting in their fancy ballroom and speaking to nobody but themselves is the perfect metaphor for the current value of our media institutions.",
                ">The WHCA had invited [then cancelled](https://www.theguardian.com/us-news/2025/mar/30/white-house-correspondents-dinner-cancels-comedian-appearance) comedian Amber Ruffin after she referred to the Trump administration as “kind of a bunch of murderers” and asserted that “nobody wants” Trump to attend the dinner.\n\nAh yes, the WHCA, the bastion of free speech and openness to hearing all voices",
                "The Press continues to feed the Trump beast. He spouts nonsense non-stop. Nothing makes sense. He says everything under the sun and they hang on every word. Why? Because it is so crazy it sells their news for them. Not a one has stopped featuring Frumpy’s every word because it enriches them. They could singularly focus on the deaths from loss of reproductive rights, the deportation of Americans, the breaking of supply chains, while leaving Frumpy to fulminate. The Press gave up on it’s constitutional responsibilities and now they complain? Fuck ‘em.",
                "Corporate owned 'journalism' has been a massive failure. The owners have too many skeletons in their closet (how many have been to Epstein's island? We'll never know...) and too much power and wealth to lose to let their properties *actually* ever tell the full truth about anything. It hasn't been a 'free press' in a long time. \n\nNot for profit journalism must emerge from the ashes quickly. It's already happening a bit, but must accelerate if we are going to survive Trump 2.0.",
                "If they were light on jokes they should have invited Tim Pool."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Local Social Security offices face staffing shortages, delays due to federal budget cuts",
            "external_url": "https://cbs6albany.com/news/local/local-social-security-offices-face-staffing-shortages-delays-due-to-federal-budget-cuts",
            "upvotes": 2960,
            "date": "04/27/2025",
            "thumbnail": "https://cbs6albany.com/resources/media2/16x9/6187/986/0x323/90/bbb6c68e-dc7b-4336-b82d-0f8551aa3928-AP25045062103614.jpg",
            "top_comments": [
                "Working as intended....smh",
                "1. Cut funding for public programs that help people\n\n2. They get worse due to budget cuts\n\n3. Use the lack of productivity you directly caused as evidence of social safety nets being worthless\n\n4. Repeat",
                "But they said the cuts would have no effect on benefits.",
                "How many social security recipients voted for this?\n\nMeanwhile the laughing black lady wanted to expand Medicare to cover in-home care for our elderly.\n\nOopsie poopsie, hope y’all enjoy eating cat food.",
                "How does trump still have such a high approval rating?! It makes no goddamn sense.  His administration has just been a wildfire of awfulness through this country",
                "Both of my parents just retired. I’m the only family member left in the same area. \n\nI have a strong feeling this is going to make *my* life as difficult as it will theirs, as I do my best to handle their administrative stuff, since they’ve, uh, slowed down quite a bit. (It’s hard to accept when you see your parents reeeaaally start to age and not be able to do as much.) \n\nI’ve been thinking about this frequently since they first announced rural offices would be closing; we’re in a rural area, and access to stuff like this is already very limited.",
                "Social security receiving Trump supporters. Why did Biden and the Deml do this. ",
                "Social Security is advertising for jobs in my area. I just don't know who would leave a steady job to go work for the feds right now.",
                "Friendly reminder that Elon Musk is a traitorous Nazi. And we aren’t going to forget that now that he’s hiding back in the shadows.",
                "Starting to think \"America First!\" was a veiled threat that nobody understood."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Multiple deaths in Vancouver street festival Van attack",
            "external_url": "https://www.cbc.ca/news/canada/british-columbia/vehicle-hits-crowd-filipino-festival-lapu-lapu-day-block-party-1.7519778",
            "upvotes": 18254,
            "date": "04/27/2025",
            "thumbnail": "https://i.cbc.ca/1.7519787.1745732600!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/lapu-lapu-police.jpg?im=Resize%3D620",
            "top_comments": [
                "From the police: A 30-year-old Vancouver man was arrested at the scene after driving into a crowd, killing at least 8 people, around 8:14 PM local time.",
                "In the pinned Vancouver thread it says that 40 people were struck. ",
                "We’re going to have to start putting balustrades and bollards everywhere now",
                "Vancouver hasn't had anything quite like this happen before. \n\nI think we all felt really safe + immune here, BC is such a chill place. This is horrifying.",
                "Just watched a video where they have the dude against a fence. Asian guy, doesn't seem older than 30. He was just standing there and said \"I'm sorry\" very annoyingly when being yelled at. Really can't tell what's an accident and what's intentional these days...",
                "[removed]",
                "We live in Hawai'i and my aunt flew to Vancouver last week to visit her relatives. She just contacted my mom saying she and her sister's family just witnessed this tragedy and they are currently reeling. We pray for all the victims and cannot believe something violent such as this would happen to Vancouver.",
                "This reminds me to the times when every city used to put giant pots in walking places so this kind of thing could be \"prevented\". I think it was at those times when terrorism was all time high after 11S.\n\nSad :(",
                "Local police confirmed suspect is known to them but not entirely known to what degree. Some families have yet to be contacted so details will be held out of respect. There should be another briefing Sunday morning. It’s current 1:47AM here in Vancouver",
                "I just saw a video of the aftermath on Twitter, and counted at least 7 bodies. Jesus fucking Christ. This is gonna be really really fucking bad. Fuck. It was a street festival. People should always return home safely from a street festival. Unfathomable."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Wife of US Coast Guard member arrested over expired visa after security check for military housing",
            "external_url": "https://abcnews.go.com/US/wireStory/wife-us-coast-guard-member-arrested-expired-visa-121204871",
            "upvotes": 9674,
            "date": "04/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a40708c4-10c6-4b39-9805-1d9cf1999ac0/wirestory_8c59f778f3245b470871e1da96bf90e7_16x9.jpg?w=1600",
            "top_comments": [
                "America's #1 issue is that military service members and their spouses aren't being harassed and jailed enough! 🏌️‍♂️⛳",
                "As I said, the population may well be halved after the purges.",
                "At a certain point, we as Americans need to ask ourselves, [\"Are we the baddies\"? ](https://www.youtube.com/watch?v=h242eDB84zY)",
                "So much for trying to promote having babies. Can't do that with competing directions.",
                ">the woman and her Coast Guard husband were preparing to move into their on-base housing on Wednesday, they went to the visitor control center to get a pass so she could access the Key West installation. During the routine security screening required for base access, the woman's name was flagged as a problem.\n\nShe's undocumented, married a serviceman 6 weeks ago, and they decided it was a good idea to move into on-base housing and get her  a security pass.  OMFG",
                "Sorry, this is not the the same as the recent gross abuses we've recently witnessed, so I'm not gonna pretend to manufucture outrage over this. There was a removal order given YEARS ago. How about we focus on the actual horrors we've just witnessed.",
                "As much as I think this is probably nonsense, the woman's work visa expired in 2017. She had been told her visa had expired and she needed to leave. So it appears she'd been here illegally for several years. She only got married to this guy earlier this year. It's a bit hard to go to the mat for this specific case especially considering she could be living among US military forces.\n\nI'm going to reserve my anger for those cases that appear to be multiplying where people here on legal visas are just snatched off the street and deported with no due process and sent to who knows where.",
                "Did anyone read the article before commenting?\n\n“According to a U.S. official, the woman's work visa expired around 2017, and she was marked for removal from the United States a few years later.” \n\nShe’s had 8 years to get her shit sorted out.",
                "Step 1: Impose tariffs on pretty much all goods imported into the US, which are undeniably paid by the people in America who purchase those goods.\n\nStep 2: Deport the hardworking, honest, taxpaying people who would be most likely to purchase those goods from their home countries and have them shipped to their new homes in America. \n\nStep 3: Place tariffs on an island inhabited entirely by penguins.\n\nStep 4: ???\n\nStep 5: Profit.",
                "I am liberal as they come on social issues, but this lady overstayed her visa by 8 fucking years and last minute married an American to stay. Fuck that noise, why should we throw a fit that she got deported? \n\n\nI honestly can understand the position on fighting for asylum seekers, and people who had been here decades as a kid with no problems. Not getting a proper trial, thats a huge problem. Someone clearly illegally staying in the US getting deported should be fine if she got a trial and sent back. "
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "The FBI mistakenly raided their Atlanta home. Now the Supreme Court will hear their lawsuit",
            "external_url": "https://apnews.com/article/georgia-fbi-raid-supreme-court-lawsuit-9cb55aa6f45bbf02c29d84363c7c9e6f",
            "upvotes": 688,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "“Oops wrong house, oops wrong house, oops wrong house, oops wrong house, oops wrong house”\n\n“Well this neighborhood is clean I really thought we would find something too”",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions.\n\nI would think any patently wrong decision should absolutely be “second guessed”. Something precious has been taken from the victims, and whether or not the officers should be personally held accountable, the government should absolutely provide some reasonable measure of restitution including physical damage and the opportunity for psychological counseling.",
                "> But lawyers for the government argued in Martin’s case that courts shouldn’t be “second-guessing” law enforcement decisions\n\nCorrect me if I'm wrong but isn't second-guessing law enforcement decisions like, at least 60% of a courts job",
                "So shouldn’t be long before the Supreme Court rules it’s okay to violate the 4th amendment as long as the officers were just trying their darnedest and didn’t mean to.",
                "Allowing a GPS device to take you to the wrong address isn't an honest mistake. It's gross incompetence that is extraordinarily easy to avoid.\n\n\nA life and death situation and this stupid motherfuckering agent popped info into the GPS and was off to adventure time.\n\n\nNo checking Google maps or street views. No driving by the place before hand. No use of additional GPS devices by other agents involved. Nothing. Squat. Nada.\n\n\nPure laziness and idiocy that you'd hope would mean immediate handing in of any badges, and a national Do Not Hire flag for the entire team responsible.\n\n\nBut nope.",
                "This kind of shit happens way too much. I think they may want to quadruple check these raids before they ok them.",
                "I wonder how the Supreme Court will defy precedent to allow cops to do this more in the future. \n\nHearing their absurd justifications is always entertaining in a macabre.",
                "I am waiting to find out whether this Maga Supreme Court hates Black people more or the FBI more.",
                "Why is this any different than doctors? They also don't mean to make mistakes.",
                "I executed tons of search warrants in my career. Never hit the wrong house.  This isn’t a mistake. It’s laziness and incompetence of the highest order."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Circumcision at NYC hospital almost made baby bleed to death, parents say",
            "external_url": "https://www.cbsnews.com/newyork/news/baby-nearly-bled-to-death-circumcision-parents-say/",
            "upvotes": 4374,
            "date": "04/27/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/25/2607bc07-2da0-4f95-a5be-c67a4b41f989/thumbnail/1200x630/0790313b56ce710814d12de467b8523d/bisram-5p-pkg-alleged-b-wcbsdpf9-hi-res-still-00-00-5619.jpg?v=8e9dede207b29c97b32974c53e32aabc",
            "top_comments": [
                "For those who haven't read the article, child was born with heart condition. After receiving a stent, hospital asked parents if they wanted to go ahead of circ. According to parents, hospital did not warn them about increased risks of surgery in an infant with a heart condition. \n\nAnd on a personal note, I was shocked by how much pressure the docs and nurses put on us after our son was born.  Not-so-subtle but still indirect \"Are you sure?\" and ongoing discussion after we indicated \"no.\"",
                "I'm a nurse in critical care, and have seem some truly horrific things. The only thing that ever made me feel light-headed, like I might vomit or faint, was seeing an infant circumcision during my OB rotation in school. The way that little baby screamed... Absolutely horrifying. There is no good reason for this to be a commonplace practice",
                "Forcing male cosmetic surgery on an infant \\*should\\* be illegal, just how it is for females. We just aren't ready for that talk as a society yet, which disappoints me considerably.",
                "We could eradicate breast cancer if we did preventative mastectomies on every woman. We don't alter their secondary sexual characteristics to prevent terminal illness, altering a boy's to prevent UTIs is insane.",
                "Elective plastic surgery within days of birth is wild.",
                "Who knew non-consensual genital mutilation could do that.",
                "It's estimated that approximately 117 male neonatal deaths per year in the US are due to complications of circumcision.",
                "anesthesia checking in.  I see so many circumcision revisions on the OR board.  Some problems aren't seen until years later.  Please stop mutilating boys.  Parents complain their girls sleep well but their boys took months to sleep well.  That's because circumcision is painful genital mutilation.  If you want your baby to sleep well don't mutilate their genitals.  Boys and girls deserve the right to intact genitals.  The foreskin and labial hood protect from chaffing.",
                "Nonconsensual genital mutilation happens every day in the US, and it's not trans kids.\nIt's Christian/conservative parents who don't want to teach their sons to wash their peckers.",
                "Crazy that people still do this shit to their babies for whatever weird reasons."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Ex-New Mexico judge arrested in case involving man suspected of being a Venezuelan gang member",
            "external_url": "https://apnews.com/article/new-mexico-judge-arrested-venezuelan-gang-gun-360d4ec8ba6676fbf33abcb606c3f104",
            "upvotes": 1374,
            "date": "04/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the article: \"A former New Mexico judge has been arrested on an evidence tampering charge for allegedly destroying a phone belonging to a tenant who is accused of keeping guns at the property and suspected of being a member of a Venezuelan criminal gang.\n\nFederal authorities said in court records that former Doña Ana County Magistrate Judge Jose Luis “Joel” Cano, who was arrested Thursday, told investigators that he believed photos or videos on the device would reflect negatively on the tenant and threw away what remained of it five weeks ago after smashing it with a hammer.\n\nCano resigned last month after the state Judicial Standards Commission sought to suspend him, saying he was accused of letting three members of the Venezuelan gang Tren de Aragua live on his property in Las Cruces and have access to firearms.\"",
                "The narrative being presented in the article doesn't make a lot of sense to me.\n\nSo far as I'm aware there's nothing inherently illegal about shooting guns and alleged \"evidence tampering phone destruction\" seems very temporally disconnected from the other events.",
                "Maybe its true but its probably not. They make fools of the public every day. You can’t believe anything the trump and his doj puts out there. They’ve routinely lied to federal judges under penalty of perjury. They will say anything at any time without regards to truth.",
                "I dont understand how one can tamper with evidence if an investigation hasn't been formally announced or if the phone owner is not under indictment?\n\nHowever, basic legal principles doesn't seem to apply anymore when discussing the actions of these federal agencies. \n\nHowever, if he told investigators (why would he do so?) that he purposefully destroyed evidence pertaining to criminal conduct, that could be criminal misconduct I think or at the very least judicial misconduct. \n\nBut of course, being a judge and all, why would you even allow yourself to answer any questions about these people at all. Just keep your mouth shut or have a lawyer talk for you. \n\nAlso, the gun thing seems irrelevant. Unless these people are convicted felons, I dont think its illegal to give them access to firearms. Its kind of weird, but I suppose not illegal.   \n  \nI don't know, seems like a weird story but its interesting.",
                "It's not evidence tampering unless they knew there was an investigation or they knew one was going to be started.\n\n\n§ 11.440 Tampering with or fabricating physical evidence.\n\nA person commits a misdemeanor if, believing that an official proceeding or investigation is pending or about to be instituted, he or she:",
                "When even a former judge is accused of shielding tenants tied to a gang and destroying evidence, it raises serious questions, not just about the individuals, but about how overwhelmed or inconsistent our immigration and vetting systems have become. It's a reminder: due process matters, but so does accountability — for everyone, no matter their role",
                "It is an open attack on the judiciary.",
                "A question for Americans on here:\n\nWhy are you all letting Cheeto King embarrass you all so much?",
                "At least this time they appear to have at least the semblance of justification for their actions. Assuming--and that's a big assumption--there was some kind of official request for that phone, or he even suspected one was imminent, then he did indeed tamper with evidence. However, if maybe the people moved out, left the phone behind, he looked at it when inspecting the unit then found something like the furry porn mentioned by someone else--not illegal, but might be very embarrassing for the person if it were to get out--and that's why he destroyed it, having no knowledge or reasonable suspicion to think that there was any kind of imminent request from law enforcement... then this is just another case of political persecution by the Trump admin.",
                "If everyone is a gang member, no one is."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "11 injured, 1 dead after shooting on North Ocean Blvd, SLED investigating: MBPD",
            "external_url": "https://wpde.com/news/local/police-investigating-after-shooting-incident-on-north-ocean-blvd-in-myrtle-beach",
            "upvotes": 252,
            "date": "04/27/2025",
            "thumbnail": "https://wpde.com/resources/media2/16x9/800/986/1x9/90/6953005f-244f-4ed6-9f99-651908232175-Image.jpg",
            "top_comments": [
                "*“Our officer saw what happened, and when he saw that an altercation was taking place and a gun was being shot, the officer responded very quickly and in my opinion, saved lives,” she said. “Last night could have been so much worse.”*\n\nAnd thus opens the tourist season in Myrtle Beach.",
                "“MYRTLE BEACH, S.C. (WPDE) — As of Sunday morning, 11 people are injured and one is dead after a shooting along the 900 block of North Ocean Boulevard on Saturday night, according to The Myrtle Beach Police Department.”",
                "So just another day in America then? \n\nWe are so fucking stupid. Weapons in abundance but no help to be found for the downtrodden.",
                "Well, this would have not been known had it not been posted in this subreddit.\n\nJFC, if I had the ability to move out of this hellhole of a country, I would be more than happy to.",
                "No mention of whether the person the officer shot was the one doing the shooting, eh?",
                "If only there was some way to help prevent this. Damn.",
                "It's not a white supremacist so reddit doesn't care."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Local Social Security offices face staffing shortages, delays due to federal budget cuts",
            "external_url": "https://cbs6albany.com/news/local/local-social-security-offices-face-staffing-shortages-delays-due-to-federal-budget-cuts",
            "upvotes": 2958,
            "date": "04/27/2025",
            "thumbnail": "https://cbs6albany.com/resources/media2/16x9/6187/986/0x323/90/bbb6c68e-dc7b-4336-b82d-0f8551aa3928-AP25045062103614.jpg",
            "top_comments": [
                "Working as intended....smh",
                "1. Cut funding for public programs that help people\n\n2. They get worse due to budget cuts\n\n3. Use the lack of productivity you directly caused as evidence of social safety nets being worthless\n\n4. Repeat",
                "But they said the cuts would have no effect on benefits.",
                "How many social security recipients voted for this?\n\nMeanwhile the laughing black lady wanted to expand Medicare to cover in-home care for our elderly.\n\nOopsie poopsie, hope y’all enjoy eating cat food.",
                "How does trump still have such a high approval rating?! It makes no goddamn sense.  His administration has just been a wildfire of awfulness through this country",
                "Both of my parents just retired. I’m the only family member left in the same area. \n\nI have a strong feeling this is going to make *my* life as difficult as it will theirs, as I do my best to handle their administrative stuff, since they’ve, uh, slowed down quite a bit. (It’s hard to accept when you see your parents reeeaaally start to age and not be able to do as much.) \n\nI’ve been thinking about this frequently since they first announced rural offices would be closing; we’re in a rural area, and access to stuff like this is already very limited.",
                "Social security receiving Trump supporters. Why did Biden and the Deml do this. ",
                "Social Security is advertising for jobs in my area. I just don't know who would leave a steady job to go work for the feds right now.",
                "Friendly reminder that Elon Musk is a traitorous Nazi. And we aren’t going to forget that now that he’s hiding back in the shadows.",
                "Starting to think \"America First!\" was a veiled threat that nobody understood."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "An Ohio doctor killed his wife 36 years ago. As his parole hearing nears, his son wrestles with his emotions",
            "external_url": "https://www.cnn.com/2025/04/27/us/john-boyle-murder-collier-landry-cec/index.html",
            "upvotes": 550,
            "date": "04/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/boyle1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "What an amazing story.  Thank you for the copy.\n\nThat must have been terrifying, having to live with the person you _know_ murdered his own wife, hoping he wouldn't know you were meeting with police, hoping he wouldn't do the same to you.",
                "Sad that he and his sister were broken up/not put in the same family, and that he never saw her again. \n\nI mean I would want to reach out to her as adult, if I were him. At least say, 'if you want to connect, I'd be fine with that in whatever capacity you choose.' But that's just me. I won't judge him on his trauma response, because the whole thing was deeply traumatic.",
                "copy and paste in case of pay wall:\n\n Collier Landry heard a piercing scream and two thuds. He pulled the covers over his face as heavy footsteps passed outside his bedroom door. The glowing Batman clock on his wall said it was 3:17 a.m.\n\nThe 11-year-old boy held his breath, a flurry of questions racing through his mind: What was going on? Who was lurking outside his door? What had caused the commotion?\n\nThe footsteps briefly paused in the hallway — as if to check whether he was awake — then faded into the night.\n\nYoung Collier came downstairs the next morning looking for his mother. It was the last day of 1989 — New Year’s Eve — and his father sat on the living room couch in their home in Mansfield, Ohio. He calmly told his son that his mother had left them and gone on a vacation.\n\nSensing Collier’s distrust, his father told him, “I never laid a finger on mommy.” He threatened to punish him if he called the police and reported that she’d disappeared, Landry later said.\n\nThe boy felt something was off. His mother wouldn’t just leave him — especially not during the holiday season, he said. And so began a tragedy that captivated north-central Ohio and soon unearthed one dark secret after another.\n\nDetermined to uncover the truth, Collier called a friend of his mother’s — a woman she’d urged him to contact in an emergency. The call prompted a police investigation, with Collier as a key witness. Without his father’s knowledge he provided crucial details to the lead detective, marking a turning point in the case.\n\nThree weeks after she vanished, police exhumed Noreen Boyle’s body from the basement of a home 175 miles away in Erie, Pennsylvania. She was wrapped in a green tarp and her head was covered with a white plastic bag, which a coroner testified had been used to suffocate her.\n\nFive months later John Francis Boyle Jr. was found guilty of aggravated murder and sentenced to 20 years to life in prison.\n\nAfter more than three decades, the case is back in the spotlight with the release of a new podcast, “Finding Mom’s Killer,” which chronicles how the preteen boy teamed up with Mansfield police detective Dave Messmore to uncover the devastating truth about his mother’s disappearance. Collier Landry told CNN that after years of silence he now regularly talks to his father, who is incarcerated at the Marion Correctional Institute in Ohio.\n\nBoyle is now 81, and his third parole hearing is approaching in August. His son is struggling with a new whirlwind of emotions at the possibility of his dad’s release from prison.\n\n“I don’t feel vengeful toward my father … but it doesn’t mean that we can skip down the yellow brick road holding hands and being like, you know, everything’s great,” said Landry, who dropped the Boyle name after his father’s conviction.\n\nLandry is 47 now — about the same age as his father when he killed his mother.\n\n“I wonder, am I like him? Am I capable of this?” he said. “What separates my life with this person’s life? Why am I the one who will not carry on this legacy of violence?”\nHe discovered his dad’s secret while accompanying him on house calls\n\nTo an outsider, the Boyles’ family life in the 1980s might have appeared idyllic.\n\nJohn Boyle was an osteopathic doctor who ran a family practice in Mansfield. His photogenic family looked like they’d stepped from the pages of a magazine. The couple had also adopted a younger child, Elizabeth, from China and lived in a modest home with their wire fox terrier, Gowdy.\n\nLandry recalled some of his favorite moments during family road trips. His father played classical music in their car, and Landry would sit in the backseat, waving a straw and pretending to be the conductor.\n\nHe loved accompanying his father on his house calls — some doctors still made those back then — in the city of 50,000 people about 75 miles southwest of Cleveland.\n\nDuring those visits, his father appeared especially interested in a younger woman he described as one of his patients, Landry said. He witnessed his father and the woman taking walks, holding hands and stealing kisses. \n\n Landry became more suspicious when he noticed the woman was wearing his mom’s diamond ring. It had two tiny bars to glide the diamonds back-and-forth, a distinctive design that made it easily noticeable, he said.\n\nHe told his mom about the other woman, which led to arguments between his parents, he said. His mother filed for divorce. She began to feel unsafe and gave him the names and numbers of her friends, he said.\n\n“She said, ‘Collier, if your father happens to say that I might have left, call all my friends and have them contact the police and have them investigate how I disappeared,’” Landry testified in court.\n\nThe boy hid the paper with the phone numbers inside a stuffed Garfield cat on his bedroom dresser — not knowing that he’d need it only weeks later.\nA meeting with a detective changed the course of the investigation\n\nLess than two months after the couple filed for divorce, Noreen Boyle disappeared.\n\nSuspicious, Collier called her friends soon after, and they notified the police. Messmore, the Mansfield Police detective, showed up at the Boyles’ doorstep.\n\nMessmore, who’s now retired, told CNN that it was unusual for police to rely on the word of an 11-year-old. But Collier — with his neatly coiffed brown hair, pressed slacks, polo shirt and penny loafers — seemed to the detective like a miniature adult who made it clear in no uncertain terms that something had happened to his mother.\n\n“He was … adamant that there was something really wrong,” Messmore said. “He was close with his mother, and she took him everywhere.” \n\n As Messmore looked deeper into Collier’s concerns, he discovered the couple was in the middle of a bitter divorce and fighting over alimony, child support, joint credit card debts and other financial issues, he said.\n\nMessmore visited the boy at his elementary school. With permission from the principal, they would meet in an empty classroom and talk.\n\nAbout two weeks after Noreen Boyle’s disappearance, Collier found photos in the console of his father’s truck that changed the course of the investigation.\n\nThey showed his father hugging the younger woman next to a fireplace inside a house the boy had never seen before. The woman appeared pregnant. Collier shared the information with Messmore, who discovered that Boyle planned to shutter his Ohio practice for a lucrative job at a company in Erie.\n\nMessmore also learned that Boyle and the woman had bought the house in Erie together, and she had signed the real estate paperwork as his wife.\n\nA search of the Mansfield home had not yielded any clues, so investigators got a warrant for the Erie home, Messmore said.\n\nAuthorities spotted a green carpet in one section of the home’s unfinished basement and ripped it out to reveal a fresh patch of concrete in the shape of a gravesite. They cracked it open and found her body.\n\nProsecutors learned Boyle had rented a jackhammer two days before his wife disappeared and cited it as evidence of premeditation.\n\n“It wasn’t something where he just lost his temper. It was something he planned for a period of time,” Messmore said.\n\nBoyle was indicted and went on trial in June 1990.\n\nCollier, who was the prosecution’s star witness, described the sounds he heard that night. He also shared how his father’s demeanor changed after his mother disappeared. The morning she went missing, he took both children to McDonald’s for pancakes.\n\n“He was acting like daddy dearest and daddy perfect and so nice and stuff like that,” he testified, according to a court transcript.\n\nA jury found Boyle guilty. In statements to the jury, the prosecution used chilling words to describe the doctor: “Healer by day, killer by night.”\nAfter years of silence, he recently reconnected with his father\n\nWithin months, Collier lost everything: his parents, his sister, his home, his dog. He went from a little boy whose parents doted on him to being the child of both a murderer and a victim.\n\nHe lived in foster homes — Messmore’s family briefly took him in — before he was adopted by a Mansfield couple whose child attended the same private school. His adopted sister went to a different home and like him, changed her last name. Landry has not seen her since, he said.\n\nStill haunted by his mother’s death, Collier Landry reached out to his father in prison not long after he was found guilty. In one of his initial letters in March 1991, he got straight to the point. \n\n “Dad, just to get things off my chest, why did you kill my mom? I know you think you didn’t do it, but if you didn’t, why are you in prison?” he wrote. “Don’t get my reasoning wrong. I do love you. Even though you have hurt me … you are my father. And I owe you a great debt.”\n\nHis father was appealing his conviction and responded with letters calling Landry a liar and urging him to recant his testimony. After he refused, his father sent him an eight-page letter in November 1992 suggesting he was delusional, Landry said.\n\n“I will not subscribe to your petulant attitude. I will not feel sorry for poor Collier,” he wrote. “Your day is coming when all will be displayed in court. The difference will be that I will not remain silent this time. You have released me from any compulsion to protect you.”",
                "Wow what a read. \n\n\n\n\nA family member of mine is married to a guy that went through something similar when he was a child. His mom snapped and shot and killed his dad. I've only ever met him a few times but every time I have, he's always been drunk. I can't imagine it's easy to carry the weight of that.",
                "The father sounds like a real piece of work. Deny the murder for decades. Tell the son he’s a delusional liar. Then later admit to the murder but call it an accident. You don’t accidentally kill someone and then rent a jackhammer and bury them in cement in the basement of your newly purchased home with your soon to be new girlfriend/wife.",
                "Thank you for writing up the story for us to read. I admire Landry strength. It is so difficult to live past such a traumatic event. He must have felt lost, betrayed, lonely. His father should die in prison.",
                "The way the murderer calls his dead wife \"it\" in his confession is chilling.  The son is right, this man should not be released from prison.",
                "This is tragic. \nI’m glad both kids got adopted and that Landry is finding his way and has made a decent life. \n\nI think this is a good piece to read to think more about challenging times with a live in partner. \n\nI think if one feels concerned enough for one’s safety to give your kid info on who to contact, then maybe it is time to find a way to organize to leave that home with the kids. \n\nHe planned it, she was concerned that she could be disappeared. \n\nDomestic violence is not uncommon. It is very complex. It is good to think about what supports one has and being able to determine when it is time to get out of one can. \n\nPlease be safe y’all",
                "It's a little strange to hear that Collier Landry is speaking to his father and is anywhere near being on the path to mending their relationship, because he's said before that his father is a narcissist. Narcissists don't change. Mending anything with them is a recipe for disaster.",
                "There was a Forensic Files episode on this case, and Collier has such bravery to be able to stand up to his father."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Journalists defend press freedom at muted White House correspondents’ dinner",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/27/white-house-correspondents-dinner",
            "upvotes": 13100,
            "date": "04/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3de87fcc8d0cd3ef43ea4e8bb3da63b41e4e45e1/0_273_8192_4918/master/8192.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1439bd4aace8f904e33aee094e5efa24",
            "top_comments": [
                "I like how they cancelled the comedian and totally capitulated to Trump, just to not have him or anyone from the administration show up anyway. Sums up a lot",
                "These fuckers cancelled the comedian because they were worried about offending Trump. I won't even get into the decades of \"Both Sides Equally At Fault\" coverage that's played a material role in how the current state of affairs was arrived at. Absolutely fuck off and be better, THEN pat yourselves on the back.",
                "The media's been bothsidesing and sanewashing Trump for so long and now they wanna prate about press freedom as the monster they helped create openly cracks down on 1A rights. What a pack of useless fools, but I guess we get what we ask for.\n\nAmerica wanted to believe both sides were the same so they didn't have to pay attention and they paid people like this to tell them that, now here we are.",
                ">Journalists rallied in defence of press freedom on Saturday, insisting they “are not the enemy of the people” at [a Washington media gala](https://www.c-span.org/program/public-affairs-event/white-house-correspondents-association-dinner/658807) snubbed by Donald Trump.\n\nIt's weird the press has to make a point of not being the enemy of the people, and doubly bizarre considering who is doing the accusing.",
                "Journalists cover politics like it's red team vs blue team when the reality is Project 2025 vs the Constitution.",
                ">Alex Thompson of Axios, who won an award for coverage of Biden, silenced a room that was otherwise buzzing all night when he called out the media for failing to adequately investigate Biden’s mental acuity. The issue blew up when the 81-year-old gave a disastrous debate performance four months before the election.\n\n\nI think it's wild that this person thinks the mess up was that we just weren't hard enough on the Biden administration. Yeah, he fucked up immeasurably in how he fumbled the end of his term. Granted. The problem is not that the media didn't talk enough about Biden being old. That was literally everywhere.\n\n\nWe have a GOP that has been barreling towards authoritarianism for decades, and our media institutions have treated them as either rational thought leaders or loveable joksters while they've  torn down our communities and sold us off to wealthy donors.\n\n\nThese people sitting in their fancy ballroom and speaking to nobody but themselves is the perfect metaphor for the current value of our media institutions.",
                ">The WHCA had invited [then cancelled](https://www.theguardian.com/us-news/2025/mar/30/white-house-correspondents-dinner-cancels-comedian-appearance) comedian Amber Ruffin after she referred to the Trump administration as “kind of a bunch of murderers” and asserted that “nobody wants” Trump to attend the dinner.\n\nAh yes, the WHCA, the bastion of free speech and openness to hearing all voices",
                "The Press continues to feed the Trump beast. He spouts nonsense non-stop. Nothing makes sense. He says everything under the sun and they hang on every word. Why? Because it is so crazy it sells their news for them. Not a one has stopped featuring Frumpy’s every word because it enriches them. They could singularly focus on the deaths from loss of reproductive rights, the deportation of Americans, the breaking of supply chains, while leaving Frumpy to fulminate. The Press gave up on it’s constitutional responsibilities and now they complain? Fuck ‘em.",
                "Corporate owned 'journalism' has been a massive failure. The owners have too many skeletons in their closet (how many have been to Epstein's island? We'll never know...) and too much power and wealth to lose to let their properties *actually* ever tell the full truth about anything. It hasn't been a 'free press' in a long time. \n\nNot for profit journalism must emerge from the ashes quickly. It's already happening a bit, but must accelerate if we are going to survive Trump 2.0.",
                "If they were light on jokes they should have invited Tim Pool."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Multiple deaths in Vancouver street festival Van attack",
            "external_url": "https://www.cbc.ca/news/canada/british-columbia/vehicle-hits-crowd-filipino-festival-lapu-lapu-day-block-party-1.7519778",
            "upvotes": 18260,
            "date": "04/27/2025",
            "thumbnail": "https://i.cbc.ca/1.7519787.1745732600!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/lapu-lapu-police.jpg?im=Resize%3D620",
            "top_comments": [
                "From the police: A 30-year-old Vancouver man was arrested at the scene after driving into a crowd, killing at least 8 people, around 8:14 PM local time.",
                "In the pinned Vancouver thread it says that 40 people were struck. ",
                "We’re going to have to start putting balustrades and bollards everywhere now",
                "Vancouver hasn't had anything quite like this happen before. \n\nI think we all felt really safe + immune here, BC is such a chill place. This is horrifying.",
                "Just watched a video where they have the dude against a fence. Asian guy, doesn't seem older than 30. He was just standing there and said \"I'm sorry\" very annoyingly when being yelled at. Really can't tell what's an accident and what's intentional these days...",
                "[removed]",
                "We live in Hawai'i and my aunt flew to Vancouver last week to visit her relatives. She just contacted my mom saying she and her sister's family just witnessed this tragedy and they are currently reeling. We pray for all the victims and cannot believe something violent such as this would happen to Vancouver.",
                "This reminds me to the times when every city used to put giant pots in walking places so this kind of thing could be \"prevented\". I think it was at those times when terrorism was all time high after 11S.\n\nSad :(",
                "Local police confirmed suspect is known to them but not entirely known to what degree. Some families have yet to be contacted so details will be held out of respect. There should be another briefing Sunday morning. It’s current 1:47AM here in Vancouver",
                "I just saw a video of the aftermath on Twitter, and counted at least 7 bodies. Jesus fucking Christ. This is gonna be really really fucking bad. Fuck. It was a street festival. People should always return home safely from a street festival. Unfathomable."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Wife of US Coast Guard member arrested over expired visa after security check for military housing",
            "external_url": "https://abcnews.go.com/US/wireStory/wife-us-coast-guard-member-arrested-expired-visa-121204871",
            "upvotes": 9669,
            "date": "04/27/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a40708c4-10c6-4b39-9805-1d9cf1999ac0/wirestory_8c59f778f3245b470871e1da96bf90e7_16x9.jpg?w=1600",
            "top_comments": [
                "America's #1 issue is that military service members and their spouses aren't being harassed and jailed enough! 🏌️‍♂️⛳",
                "As I said, the population may well be halved after the purges.",
                "At a certain point, we as Americans need to ask ourselves, [\"Are we the baddies\"? ](https://www.youtube.com/watch?v=h242eDB84zY)",
                "So much for trying to promote having babies. Can't do that with competing directions.",
                ">the woman and her Coast Guard husband were preparing to move into their on-base housing on Wednesday, they went to the visitor control center to get a pass so she could access the Key West installation. During the routine security screening required for base access, the woman's name was flagged as a problem.\n\nShe's undocumented, married a serviceman 6 weeks ago, and they decided it was a good idea to move into on-base housing and get her  a security pass.  OMFG",
                "Sorry, this is not the the same as the recent gross abuses we've recently witnessed, so I'm not gonna pretend to manufucture outrage over this. There was a removal order given YEARS ago. How about we focus on the actual horrors we've just witnessed.",
                "As much as I think this is probably nonsense, the woman's work visa expired in 2017. She had been told her visa had expired and she needed to leave. So it appears she'd been here illegally for several years. She only got married to this guy earlier this year. It's a bit hard to go to the mat for this specific case especially considering she could be living among US military forces.\n\nI'm going to reserve my anger for those cases that appear to be multiplying where people here on legal visas are just snatched off the street and deported with no due process and sent to who knows where.",
                "Did anyone read the article before commenting?\n\n“According to a U.S. official, the woman's work visa expired around 2017, and she was marked for removal from the United States a few years later.” \n\nShe’s had 8 years to get her shit sorted out.",
                "Step 1: Impose tariffs on pretty much all goods imported into the US, which are undeniably paid by the people in America who purchase those goods.\n\nStep 2: Deport the hardworking, honest, taxpaying people who would be most likely to purchase those goods from their home countries and have them shipped to their new homes in America. \n\nStep 3: Place tariffs on an island inhabited entirely by penguins.\n\nStep 4: ???\n\nStep 5: Profit.",
                "I am liberal as they come on social issues, but this lady overstayed her visa by 8 fucking years and last minute married an American to stay. Fuck that noise, why should we throw a fit that she got deported? \n\n\nI honestly can understand the position on fighting for asylum seekers, and people who had been here decades as a kid with no problems. Not getting a proper trial, thats a huge problem. Someone clearly illegally staying in the US getting deported should be fine if she got a trial and sent back. "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Israeli airstrike kills 10 people, half of them children, as mediators try to restart a ceasefire",
            "external_url": "https://toronto.citynews.ca/2025/04/26/49-killed-by-israeli-strikes-in-gaza-over-24-hours-as-mediators-scramble-to-restart-ceasefire/",
            "upvotes": 9161,
            "date": "04/26/2025",
            "thumbnail": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/04/f743900487001c434a424a57e1960c4da544498fbda65b62a9412eb3f36df951.jpg",
            "top_comments": [
                "If there aren't going to be any trials in a decade or so, I guess genocide is fair game then. \n\nEven the Serbs and Croats in Bosnia did less heinous things.",
                "[removed]",
                "[removed]"
            ],
            "aggregate_sentiment": 50.0
        }
    ],
    "last_updated": "04/27/2025 20:09:06 UTC"
}