{
    "posts": [
        {
            "category": "HOT",
            "title": "Mehmet Oz confirmed by US Senate to lead Medicare and Medicaid",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/03/mehmet-oz-confirmation-medicare-medicaid",
            "upvotes": 5470,
            "date": "04/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/929fb0a8e383cf00a594c61b34bd66eac77804d6/308_184_4282_2570/master/4282.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=46fa54902ac733c5f57066f59d463592",
            "top_comments": [
                "Another grifter. Jesus fuck.",
                "A [quack](https://en.wikipedia.org/wiki/Medical_claims_on_The_Dr._Oz_Show) leading Medicare and Medicaid. Seems on point for this administration.",
                "The clown show continues",
                "Rejected by voters but still given power. Typical.",
                "Dr. Phil wasn’t available?",
                "And here I thought that they couldn't get any worse than RFK jr.\n\n1. I was wrong.\n\n2. I gotta stop saying that they can't make things worse because they turn that into a challenge.\n\n3. Congressional Republicans should be forced to use RFK jr and Oz as their Primary Care Physicians.",
                "I think I’d prefer nepotism or blatant corruption to just giving jobs to people he has seen on TV.",
                "Embarassing is the new norm. Yet another greedy amoral charlatan representing America.",
                "When this guy is old and dying, we should take away his insurance.",
                "Fuck you - to all my elected officers, for spiraling this country into a reality TV show."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Man says son was stabbed in the heart at high school track meet, died in twin's arms",
            "external_url": "https://www.nbcdfw.com/news/local/student-stabbed-frisco-track-meet/3806667/",
            "upvotes": 19232,
            "date": "04/03/2025",
            "thumbnail": "https://media.nbcdfw.com/2025/04/jeff-and-austin-metcalf.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                ">Jeff Metcalf spoke with NBC 5 Tuesday afternoon and said his son, Austin Metcalf, was killed when another student armed with a knife got upset after being told he was sitting in the wrong spot.\n\nAh well at least it was over something important 🙄",
                "Similar thing happened last week in town where I live. Two girls fighting and one stabbed in the neck died. Principal and teachers fired, but shitty parent gets to point a finger at the school instead of admitting she raised the kind of kid that would stab someone to death",
                "Fuck. The poor surviving brother.",
                ">I'm not trying to judge\n\nI think it's ok to judge someone who murdered your son.",
                "Absolutely psychotic to murder someone over a mild inconvenience.",
                ">Jeff Metcalf spoke with NBC 5 Tuesday afternoon and said his son, Austin Metcalf, was killed when another student armed with a knife got upset after being told he was sitting in the wrong spot.\n\nThis is what the kid that brings a knife to school in case someone messes with him thinks is someone messing with him.",
                "What a strange headline: His son WAS stabbed at a track meet.",
                "The local rumor is that the murderer told a friend earlier in the day that he wanted to stab someone.",
                "What a loving family he had.. Quoted from the article:\n\n“I’m not trying to judge, but what kind of parents did this child have? What was he taught? He brought a knife to a track meet and he murdered my son by stabbing him in the heart. The guy was in the wrong place and they asked him to move and he bowed up [became angry and aggressive]. This is murder,” Jeff Metcalf said.\n\n“You know what, I already forgive this person. Already. God takes care of things. God is going to take care of me. God is going to take care of my family,” he added.",
                "Wow way to ruin your life in a millisecond. Really makes you wonder about people"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "White House fires three NSC staffers after president meets with far-right activist Laura Loomer",
            "external_url": "https://www.cnn.com/2025/04/03/politics/nsc-firings-trump-laura-loomer-meeting/index.html",
            "upvotes": 8867,
            "date": "04/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-2024-09-11t000440z-1209639841-rc2zx9a96h4i-rtrmadp-3-usa-election-debate-arrivals.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Isn't this the woman who was very obviously trying to have an affair with Trump during the campaign? Maybe she even was.",
                "Nothing to see here, just the President's mistress directing national security policy like you'd see in any other normal, functioning democracy.",
                "This was probably just for an oval office blowjob. Probably not related.",
                "And none of the people involved with Signalgate",
                "TFH? Is that an actual picture of her? Or is that an animatronic or wax statue?",
                "He probably gets extra jazzy about getting away in the open with what Bill Clinton lost a portion of his legacy over. And so does anyone intentionally looking the other way.",
                "It’s painful to be reminded of all d-list sycophants Trump had during his campaign. \n\nRFKjr, Keri Lake, Catturd, Comrade Tulsi, Kid Rock, Rob Schneider, Kash Patel, Pete Hegseth, Giuliani , Hulk Hogan, Vince McMahon etc.  \n\nThese guys were on their way out of public consciousness once Trump\nLost.  But enough people sat out the election and now he’s rewarding the absolute worst of humanity by giving them power and influence over the American people for no other reason than “the libs will hate this”. \n\nHearing Laura Loomers name is a reminder that he’s not close to being done getting his revenge on America.  (And no, not only the libs, on the entire country).",
                "she's only 31?! she looks like a refurbished 50 at *best*.",
                "It’s wild how much she turned herself into a goblin",
                "\"Come s my d and you can fire whoever you want\""
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Pentagon’s watchdog to review Hegseth’s use of Signal app to convey plans for Houthi strike",
            "external_url": "https://apnews.com/article/hegseth-signal-messaging-app-attack-plans-f8581bcb447b91d2e7f9cb7809ae0f06",
            "upvotes": 3814,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Tomorrow:  DOGE fires Pentagon staff, cites \"wasteful spending\".",
                "He’ll be fine. They already shifted the blame.",
                "Now that we know Republicans will lie about Democrats \"weaponizing the justice system\" and that Republicans will absolutely weaponize the justice system, I'd like to see a Democratic candidate run on it.\n\nTheir entire campaign could be a laundry list of people like Hegseth who will be rounded up and sent to an El Salvadoran prison on day 1 of the new administration.",
                "Trump appoints himself Pentagon watchdog.",
                "There's a watchdog that hasn't been replaced by Sycophants?",
                "“We’ve reviewed the illegal use of civilian social apps for classified information sharing of active military combat, and found no wrong doing”",
                "Oh boy, I sure am ready for absolutely nothing of consequence to happen to the secretary of drunkenness.",
                "I wouldn't be surprised if it is a made-up examination to say after a few days \"Nope, all easy. It wasn't that bad!\" to sweep the whole issue under the carpet for good...",
                "Yeah, like that will go anywhere.",
                "I mean, is this even a question? He violated federal laws and military regulations and created a massive OPSEC dataspill\n\nHe and everyone on that chat should be fired. ( except the reporter, they get a raise)"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "U.S. tourist arrested after bringing a handgun into Japan",
            "external_url": "https://www.japantimes.co.jp/news/2025/04/02/japan/crime-legal/us-tourist-gun-japan/",
            "upvotes": 27747,
            "date": "04/03/2025",
            "thumbnail": "https://www.japantimes.co.jp/japantimes/uploads/images/2025/04/02/461123.jpg?v=3.1",
            "top_comments": [
                "My aunt and uncle (ridiculously kind people) borrowed some luggage from a friend of theirs to take on a cruise to the Bahamas. When they were already on the boat they found their friend had forgotten a handgun in one of the bags. They reached out to my dad (an attorney) on what to do with it, he told them to throw it off the side of the boat and not bring it up to anyone. They did not and instead told staff about it. They were detained and the gun was confiscated and not returned to them or the owner and it was a big big hassle. No charges or anything though. To this day my uncle will say “we should’ve just thrown it over the side.” Lmao.",
                "The fact that he alerted someone to the gun will help him. That he tossed three rounds in the trash will not. He’ll probably avoid a jail sentence with hard labor, but the Japanese will put him through the wringer anyway.",
                "Japan has extreme strict gun control laws. They don’t play around. And if you wanted to possess a gun in Japan, one of the process is an interview with the local police and convincing them why you need a gun, and you better have a very good reason.",
                "In 2012, an American tourist visiting a park in Calgary Canada had a conversation with two Canadians he didn't know. He was understandably terrified as he wasn't packing heat.  \n\nSo he wrote a letter to the editor of a local paper. [This was published and hilarity ensued.](https://calgaryherald.com/news/local-news/walt-wawras-nosehillgentlemen-story-a-non-event-but-social-media-loved-it-all-the-same)\n\nEdit: [here is a working link to the letter, credit to u/MixedPotion for digging it up](https://web.archive.org/web/20121019011529/http://www.calgaryherald.com/opinion/letters/nose+hill+park+confrontation+makes+visitors+feel+unsafe/7050028/story.html)",
                "One of the safest countries I have ever been to.",
                "Remember a few years ago when some dipshit brought a gun to Australia and when she was arrested she said it was her god given right under the 2nd Amendment.",
                "I for one am fine with reckless american gun owners getting arrested for doing stupid shit with their guns.",
                "Moron. How do you \"inadvertently\" bring a weapon to another country? At the very least it demonstrates he's not a responsible gun owner and deserves to lose his gun license.",
                "how do people \"forget\" where a gun is?",
                "I cannot imagine living in a country where you have to take with you an item solely designed for taking another humans life with you at all times to the point where you *forget you have it on you*, just to feel safe."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "US bans government personnel in China from romantic or sexual relations with Chinese citizens",
            "external_url": "https://apnews.com/article/chinese-beijing-honeypot-spies-diplomat-agent-intelligence-c077ef57b0f7ae43dd0db41bea92238b",
            "upvotes": 3123,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Curious. This was put in place by the outgoing, Biden-appointed ambassador, Nicholas Burns. And it's an expansion of an earlier fraternization policy. Trump's nominee is unconfirmed at this moment.",
                "What about government personnel having sexual encounters on a private island belonging to a billionaire who is sex trafficking women and minors?",
                "What about regular us citizens? Can we still smash?",
                "That's good.  Don't want to make Russia jealous.",
                "You can ban me all you want, you're just making it hotter!",
                "Will I get tariffs for banging my partner of 18 years?",
                "Honestly kinda surprised this wasn't already a thing due to risk of espionage",
                "I'm not sure if they can legally do this. (Not that this would stop them)\n\nEdit- many people have kindly informed me that I'm wrong, and there are many circumstances where this is completely possible and appropriate.",
                "Also in the news, there's a sudden influx of US government personnel in China asking to return home\n\n/s",
                "No mentions of DoD, they asked Congress, Congress said ask the State Dept., State Dept. said nothing.\n\nArticle is deeply vague"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "‘Potentially historic’ flooding threat looms after almost 100 tornadoes hit US",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/03/potentially-historic-flooding-threat-looms-almost-100-tornadoes-hit-us?fbclid=IwY2xjawJbwM5leHRuA2FlbQIxMAABHf0BvM5E8-X3l1OI-2P-MhoArZtVfmWk_VqPltvB_XT2bPfpe3kApMiBlg_aem_o40FYX2abRDOh2wxzsObJQ",
            "upvotes": 1947,
            "date": "04/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/eef4db8a70a019076a43e6a27e0f1c7af9f4d14f/0_121_8000_4799/master/8000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=26d925fec27c5adf0333e12f3487d811",
            "top_comments": [
                "*The nationwide network of River Forecast Centers – operated by Noaa – have been especially hard hit by staffing cuts with five of the 12 offices currently having critical vacancies. This week’s heavy rains will be yet another example of how extreme weather is testing the increasingly weakened agency*\n\nFlooding and tornadoes reaching record-breaking numbers at a time when national and local responses have been limited or undermined by this out of control admin.",
                "Didn't DOGE recently put a stop to FEMA funding?  Said \"the states can take care of their own\"?\n\nThese people are screwed.",
                "Hopefully there's a federal agency with enough funding and human resources to deal with such disasters, right?",
                "As someone who lives in this so-called \"Bible Belt\", I wonder who/what the religious wackos here will blame this time for this happening.",
                "A little FEMA would be good right about now.  Oh wait..",
                "If there was only some Agency that could manage emergencies on a federal level",
                "Paper towels on the way!",
                "Biden helped NC in the floods and they went with Trump",
                "They should have raked",
                "Don’t worry, everyone! Dear leader is on his way to go to a golf tournament after setting the world economy on fire and therefore certainly does not giving two flying fucks about any of you."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Layoff announcements surge to the most since the pandemic as Musk's DOGE slices federal labor force",
            "external_url": "https://www.cnbc.com/2025/04/03/layoff-announcements-surge-to-the-most-since-the-pandemic-as-musks-doge-slices-federal-labor-force.html",
            "upvotes": 5656,
            "date": "04/03/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108124184-17435157572025-04-01t134226z_383673798_rc21pdav4zv2_rtrmadp_0_usa-trump-health.jpeg?v=1743515784&w=1920&h=1080",
            "top_comments": [
                "Lmao and the stock market is in free fall to own the Libs.",
                "I'm beginning to understand how this MF bankrupted an effing CASINO!",
                "Burning down the economy at both ends",
                "This bullshit is going to crush the business I work for. \nFuck everyone who voted for it.",
                "> “It would have otherwise been a fairly quiet month for layoffs.”\nHowever, DOGE has continued to cut aggressively across the government.\nVarious reports have indicated that the Veterans Affairs department could lose 80,000 jobs, the IRS is in line for some 18,000 reductions and Treasury is expected to drop a “substantial” level of workers as well, according to a court filing.\nThe year to date tally for federal government announced layoffs represents a 672% increase from the same period in 2024, according to Challenger.\n\nA 672% increase is painful. Unemployment claims are going to take much longer, and people are going to struggle to find new jobs in an oversaturated market. Especially here in the DMW area.",
                "Donald Trump is a terrorist. He is literally destroying everything in America.\n\nIs Trump being controlled by Putin?",
                "> U.S.-based employers announced 275,240 job cuts in March\n\n> Of that total, 216,670 were due to “DOGE Actions”\n\n> job cut announcements rose 60% month-on-month, and were 205% higher than in March 2024.\n\n> That’s a record high for any March, and the third-highest monthly total ever recorded.\n\n[Source](https://www.theguardian.com/us-news/live/2025/apr/03/business-news-live-updates-trump-tarrifs-asian-markets-nikkei-asx-wall-st-dow-jones-dollar-euro?page=with%3Ablock-67ee73148f08dc205ac3569c#block-67ee73148f08dc205ac3569c)",
                "The funny thing is Al Gore slashed 400,000 jobs from the federal government under Clinton,  through a combination of voluntary departures, attrition and a relatively small number of layoffs, but he did it in partnership with the agencies and wasn't sued once. Coincidentally, that was the last time the country had a budget surplus.",
                "And it's not even going to be saving the government money thanks to all the lost revenues",
                "Depression Donnie is just getting started."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Tariff-related layoffs hit five US auto plants that supply factories in Canada and Mexico",
            "external_url": "https://www.abc12.com/news/tariff-related-layoffs-hit-five-us-auto-plants-that-supply-factories-in-canada-and-mexico/article_6d95d30a-9956-521c-86e2-a62c9b07d3f4.html?fbclid=IwZXh0bgNhZW0CMTEAAR2xPs0qVaSgfUJmdqsaFHK_By3_8B-vrj9GDws297UllzMvWzCnes45dzw_aem_dyNT8yFsAPiIgD3r5Nwnnw",
            "upvotes": 486,
            "date": "04/03/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/abc12.com/content/tncms/assets/v3/editorial/f/c3/fc353f5d-082e-589f-a506-9db6a3ea043a/67eecd25de0f5.image.jpg?crop=1763%2C926%2C0%2C125&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "Congrats to the red states that lost jobs due to a tariff policy based on farcical mathematics devised by an 80yr old man who has not released his college transcript",
                "Guys, I’m starting to think Trump voters aren’t smart. ",
                "So that took what... 11 hours for massive layoffs to occur directly connected to Trumps Recession Plan Tarriffs.",
                "Leopards going to eat well. Mmmm faces",
                " But twump is a bidness man!",
                "And the UAW is supporting these tariffs",
                "And people voted for this because they didn’t like someone’s laugh 🤣",
                "There is a silver lining in every cloud - unemployed people don't cause inflation.",
                "Whenever are we going to stop winning?",
                "Don't forget. This is what you voted for.  Americans have no one else to blame but themselves."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Russia bans Elton John Aids Foundation over its support for LGBTQ+ rights",
            "external_url": "https://www.theguardian.com/world/2025/apr/03/russia-bans-elton-john-aids-foundation-support-lgbtq-rights",
            "upvotes": 3191,
            "date": "04/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1da710a393dbb0652e80593d9269e27b7c00d37e/650_325_3498_2099/master/3498.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=95b5f956c29a4cce2aa1334b39d2c5ff",
            "top_comments": [
                "I am now confused between America and Russia. Seems both countries now have the same policies.",
                "What a wild political time shift  I’ve lived. \n\nOld enough to watch Live Aid on tv live. \n\nOld enough to remember the Scorpions “Wind of Change” being a song of hope and renewal.\n\nOld enough to see some of my favorite peoples come through the “don’t touch them!” Era of AIDS and HIV, and , “God hates F*gs”  to the semi acceptance  of homosexuality except for the most hard core religious kooks and insecure males. \n\nOld enough to see women make gains in positions of power.\n\nOld enough to know people who went to see Roger Waters perform “the Wall” on the No man’s land Strip in Germany, where fleeing East Germans used to be shot dead, just for seeking freedom. \n\nOld enough to see the ISS come to fruition as a symbol of International scientific cooperation in space exploration.\n\nTo see it all destroyed in less than a decade, and to see my country wind the clock back to a time I never lived in, where minorities are stripped of their rights and their histories, where women are no longer autonomous humans, where lgbtq people have to hide in fear in some spaces again. \n\nI know the pendulum swings, but DAMN.",
                "My wish is one day Putin & Trump are playing cards in The Hague.",
                "Donald Trump is a Russian asset, Elon Musk is a hostile foreign power trying to destroy worker and consumer protections, and the GQP is a complicit terrorist organization.Donald Trump is a Russian asset, Elon Musk is a hostile foreign power trying to destroy worker and consumer protections, and the GQP is a complicit terrorist organization.",
                "Tomorrows Fox News Chryon: Impending US Recession caused by LGBTQ+ rights",
                "America will probably follow suit soon",
                "Stay classy Russia. Who are you invading next?",
                "I expect the Trump White House to follow suit, though RFK Jr is getting a head start making things deadlier over here already.\n\nIt’s so strange living in the era of the idiotic supervillain.",
                "#Saturday \n\n#Saturday\n\n#Saturday nights all right for fighting Nazis \n\n\n#SEE YOU IN THE STREETS APRIL 5",
                "How long before Trump bans them too?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "RFK Jr. says 20% of health agency layoffs could be mistakes",
            "external_url": "https://www.cbsnews.com/news/rfk-jr-hhs-job-cuts-doge-mistakes/",
            "upvotes": 28,
            "date": "04/04/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/02/03/2480592f-598f-4a1c-a1b4-a4ba2e37bf84/thumbnail/1200x630/3376b78922c70934a82e9a4e8794fc51/cbsn-fusion-does-rfk-jr-have-enough-support-from-republican-senators-thumbnail.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "Is it him or the worm talking? Who made the mistake?",
                "He’s just such a fucking moron. Christ. Like look at this fucking idiocy:\n\n>”Part of the DOGE, we talked about this from the beginning, is we’re going to do 80% cuts, but 20% of those are going to have to be reinstated, because we’ll make mistakes,” Kennedy said, speaking to reporters at a stop in Virginia.",
                "Award for the most incompetent government of all time?",
                "How do you accidentally lay off people?",
                "The incompetence of this administration is just mind blowing...",
                "These dipshits! That's not how you treat employees. That's how you treat cattle. That's all we are to them."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Seven killed as thunderstorms and tornadoes rip through US states",
            "external_url": "https://news.sky.com/story/seven-killed-as-thunderstorms-and-tornadoes-rip-through-us-states-13341376",
            "upvotes": 42,
            "date": "04/04/2025",
            "thumbnail": "https://e3.365dm.com/25/04/1600x900/skynews-tornado-tennessee-us_6875196.jpg?20250403193805",
            "top_comments": [
                "If I were a Christian, I’d say that God is punishing republicans for electing Donald trump, but I’m an atheist ",
                "florida, north carolina, california, arkansas, kentucky, and thailand are all being faced with catastrophic environmental events within the last year. this is outrageous.",
                "*A stretch of the Mississippi River around Memphis, where more than 1.3 million people live, is set to bear the brunt.   In total, more than 90 million people have been at risk of severe weather – from Texas to Minnesota and Maine, according to the Oklahoma-based Storm Prediction Centre.*\n\nYup, even Maine--and the northeast.  We had a a crackling thunderstorm here that kept me up half the night. Very unusual for 2 April. Scary stuff."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Tariff-related layoffs hit five US auto plants that supply factories in Canada and Mexico",
            "external_url": "https://www.abc12.com/news/tariff-related-layoffs-hit-five-us-auto-plants-that-supply-factories-in-canada-and-mexico/article_6d95d30a-9956-521c-86e2-a62c9b07d3f4.html?fbclid=IwZXh0bgNhZW0CMTEAAR2xPs0qVaSgfUJmdqsaFHK_By3_8B-vrj9GDws297UllzMvWzCnes45dzw_aem_dyNT8yFsAPiIgD3r5Nwnnw",
            "upvotes": 486,
            "date": "04/03/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/abc12.com/content/tncms/assets/v3/editorial/f/c3/fc353f5d-082e-589f-a506-9db6a3ea043a/67eecd25de0f5.image.jpg?crop=1763%2C926%2C0%2C125&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "Congrats to the red states that lost jobs due to a tariff policy based on farcical mathematics devised by an 80yr old man who has not released his college transcript",
                "Guys, I’m starting to think Trump voters aren’t smart. ",
                "So that took what... 11 hours for massive layoffs to occur directly connected to Trumps Recession Plan Tarriffs.",
                "Leopards going to eat well. Mmmm faces",
                " But twump is a bidness man!",
                "And the UAW is supporting these tariffs",
                "And people voted for this because they didn’t like someone’s laugh 🤣",
                "There is a silver lining in every cloud - unemployed people don't cause inflation.",
                "Whenever are we going to stop winning?",
                "Don't forget. This is what you voted for.  Americans have no one else to blame but themselves."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Xiaofeng Wang, the cybersecurity professor targeted by FBI, has not been detained",
            "external_url": "https://www.reuters.com/world/us/indiana-university-cybersecurity-professor-has-not-been-arrested-or-detained-2025-04-02/",
            "upvotes": 101,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is a weird story to publish. If he was fired and has his house and another property searched by law enforcement but they also refused to comment. The Trump administration is looking for any negative news story it can put out about immigrants but this is the type of immigrant the US would want. DHS hasn't commented yet and the Wangs seem like they're ready to move on without mentioning what the investigation was possibly about. I associate their lawyer advised them to hush up for a specific reason. We will have to wait & see.",
                "There’s rumors he was looking at electronic voting systems.",
                "I’m assuming this is some SCP type coverup"
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "NEW",
            "title": "Mehmet Oz confirmed by US Senate to lead Medicare and Medicaid",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/03/mehmet-oz-confirmation-medicare-medicaid",
            "upvotes": 5478,
            "date": "04/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/929fb0a8e383cf00a594c61b34bd66eac77804d6/308_184_4282_2570/master/4282.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=46fa54902ac733c5f57066f59d463592",
            "top_comments": [
                "Another grifter. Jesus fuck.",
                "A [quack](https://en.wikipedia.org/wiki/Medical_claims_on_The_Dr._Oz_Show) leading Medicare and Medicaid. Seems on point for this administration.",
                "The clown show continues",
                "Rejected by voters but still given power. Typical.",
                "Dr. Phil wasn’t available?",
                "And here I thought that they couldn't get any worse than RFK jr.\n\n1. I was wrong.\n\n2. I gotta stop saying that they can't make things worse because they turn that into a challenge.\n\n3. Congressional Republicans should be forced to use RFK jr and Oz as their Primary Care Physicians.",
                "I think I’d prefer nepotism or blatant corruption to just giving jobs to people he has seen on TV.",
                "Embarassing is the new norm. Yet another greedy amoral charlatan representing America.",
                "When this guy is old and dying, we should take away his insurance.",
                "Fuck you - to all my elected officers, for spiraling this country into a reality TV show."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "RFK Jr. announces HHS reinstating some programs, employees cut by mistake",
            "external_url": "https://abcnews.go.com/Politics/rfk-jr-announces-hhs-reinstating-programs-employees-cut/story?id=120463293",
            "upvotes": 514,
            "date": "04/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/59054b86-6045-41cf-ac07-75876e01e50f/rfk-ap-jt-250402_1743624409938_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Complete chaos and disfunction in this administration every day. \n\n77 million Americans willingly voted for this.",
                "This has got to be the dumbest and most inept administration since the country was founded.",
                "More like \"We tried to do exactly what we wanted, but people lost their shit, so we're going to walk back some of it for now and try again once you all forget about this in a month or two.\"",
                "They don’t know what they’re doing.",
                "this is the standard now... fire a massive group then try walking back some of them that they realize they need",
                "Huh, weird.\n\nYou’d thing that incompetent people acting without thinking would only lead to success, yet somehow here we are.",
                "The man has fucking WORMS in his BRAINS. ",
                "What happens if the fired employees don't trust you anymore and don't want to come back, eh?",
                "The trump administration is both evil and incompetent",
                "goes in with sledge hammer, youre all fired, look how good we do! whats that?? we actually needed some of those people we just randomly cut without rhyme or reason? Oh yeah, uhhhhh, they were let go \"by accident\"\n\n\\- moves on to next department - .\n\n  \ngoes in with sledge hammer, youre all fired, look how good we do! whats that?? we actually needed some of those people we just randomly cut without rhyme or reason? Oh yeah, uhhhhh, they were let go \"by accident\"\n\n\n\n  \nHow many times do they have to do this until people realize they are incompetent?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Govt. immigration scorecard for deportations relied on tattoos and social posts, court filings show",
            "external_url": "https://www.nbcnews.com/news/latino/trump-deportations-scorecard-tattoos-venezuelans-el-salvador-rcna199116",
            "upvotes": 191,
            "date": "04/03/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250318-venezuela-gang-mb-0736-6ea82b.jpg",
            "top_comments": [
                "A true Kakistocracy at work. This administration has been nothing short of a shit volcano since day one. Their main goal literally appears to be just doing widespread evil.",
                "Also relied on hunches, horoscopes, inklings, urges, and auras\n\nNothing is a bigger or more pressing threat to the U.S. than trump and his rape gang administration",
                "I have an anime tattoo with a katana on it. I criticized the US government and its people's education level on my social media posts.\n\nIt is best for me to not visit US and I should wear this privilege like a badge of honour.",
                "Thanks, Obama. Weird how fascist tactics right out of a fearful rightwing conspiracy theory about Democrats is suddenly a real thing run by Republicans and it's fine. This is worse than their fantasyland version of Jade Helm.",
                "Just mindlessly following orders like a good evil lapdog",
                "When stupid evil people do evil shit stupidly it's still evil",
                "Ah yes, the gold standard for evidence."
            ],
            "aggregate_sentiment": 95.0
        },
        {
            "category": "NEW",
            "title": "New York man charged after authorities say he botched a medical procedure performed in his home",
            "external_url": "https://apnews.com/article/botched-medical-procedure-queens-lidocane-31e81fc4dea93ed0be0e299a24396665",
            "upvotes": 257,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">performed in his home\n\nYeah, that's usually a bad sign.",
                "Another article says they arrested him at JFK airport with a ticket to Columbia in hand. The victim isn't expected to live. And he is being held without bail.",
                "good lord how much lidocaine did he inject",
                "Reading the details in another article, I'm amazed he hasn't killed someone before. He was performing invasive cosmetic procedures on people. I'm sure the people close to her are devastated. \n\n> Felipe Hoyos-Foronda, 38, was running a makeshift medical office without a license out of a home on 35th Street in Astoria, police say.\nThe house is now under a partial vacate order, which states \"first apartment operating as a medical office with medical exam table, cosmetic injectable syringes, exam lights.\"",
                "Listen, YOU find a cheap ripperdoc willing to install a Sandevistan unit you pulled off your dead choom after a firefight with the Maelstrom.",
                "I’ve had some surgeries. Never once did it cross my mind to have them in someone’s apartment.",
                "“‘Inflammable’ means flammable? What a country!”",
                "The I did my own research people",
                ">Felipe Hoyos-Foronda injected the 31-year-old woman with the local anesthetic lidocaine, causing her to go into cardiac arrest\n\nYea great idea",
                "They found Elon’s dick doc?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "‘Potentially historic’ flooding threat looms after almost 100 tornadoes hit US",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/03/potentially-historic-flooding-threat-looms-almost-100-tornadoes-hit-us?fbclid=IwY2xjawJbwM5leHRuA2FlbQIxMAABHf0BvM5E8-X3l1OI-2P-MhoArZtVfmWk_VqPltvB_XT2bPfpe3kApMiBlg_aem_o40FYX2abRDOh2wxzsObJQ",
            "upvotes": 1941,
            "date": "04/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/eef4db8a70a019076a43e6a27e0f1c7af9f4d14f/0_121_8000_4799/master/8000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=26d925fec27c5adf0333e12f3487d811",
            "top_comments": [
                "*The nationwide network of River Forecast Centers – operated by Noaa – have been especially hard hit by staffing cuts with five of the 12 offices currently having critical vacancies. This week’s heavy rains will be yet another example of how extreme weather is testing the increasingly weakened agency*\n\nFlooding and tornadoes reaching record-breaking numbers at a time when national and local responses have been limited or undermined by this out of control admin.",
                "Didn't DOGE recently put a stop to FEMA funding?  Said \"the states can take care of their own\"?\n\nThese people are screwed.",
                "Hopefully there's a federal agency with enough funding and human resources to deal with such disasters, right?",
                "As someone who lives in this so-called \"Bible Belt\", I wonder who/what the religious wackos here will blame this time for this happening.",
                "A little FEMA would be good right about now.  Oh wait..",
                "If there was only some Agency that could manage emergencies on a federal level",
                "Paper towels on the way!",
                "Biden helped NC in the floods and they went with Trump",
                "They should have raked",
                "Don’t worry, everyone! Dear leader is on his way to go to a golf tournament after setting the world economy on fire and therefore certainly does not giving two flying fucks about any of you."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Canada will match Trump’s 25% auto tariffs, Carney says",
            "external_url": "https://globalnews.ca/news/11113522/donald-trump-auto-tariffs-canada-april-3/",
            "upvotes": 602,
            "date": "04/03/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/04/trump-auto-tariffs.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "I challenge everybody. Do you know any businessman who has filed for bankruptcy at least six times?\n\nRight. He is handling America's economy right now.",
                "Inflation is going to go sky high. If you're planning to buy any foreign goods then I would do it very soon.",
                "Looks like I’ll be driving my 2005 Pontiac G6 till it falls apart lol",
                "Canadians can find many good vehicles made in Canada, Mexico, South Korea and Japan that do not have tariffs. Even when this is over, remember that the US UAW membership is a bunch of Trump-trash and buy your vehicles accordingly. The slobs in Ohio, Michigan, Alabama and South Carolina don’t deserve your business.",
                "Canadian here:\n\n#GET REKT",
                "I think they should just outright ban the sale of cars from American owned companies, starting with Tesla.",
                "I am a Canadian and don't really understand these things, so please bare with me.\n\nI am planning on buying a car likely in the next year or so. I don't plan on buying a \\*new\\* car. I was thinking either off Marketplace with the help of a mechanic, or certified pre-owned. Do you think that the price of these cars will go up because of these tariffs? Even if it is private, possibly because of the increased demand to avoid tariffs?\n\nIn other words, should I say fuck it and buy a car sooner rather than later?",
                "This is insane. Why allow the US to get away with this nonsense. Retaliation and standing up against a bully is not an option. Fight united against 🤡 Trump and his egotistical narcissism.",
                "Buy your car before it's too late to afford even a used dumpster ",
                "Don't match.  Double.  Every 1% Trump puts on something, retaliate with 2%.  If he removes 1%, leave the other 1% as a reminder of his idiocy.  Institute a policy of the remainder being phased out over 25 years (2% of it per year), if no new tariffs are added contingent on there being no new tariffs added, threatened, or proposed, for the previous year."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "RFK Jr. announces HHS reinstating some programs, employees cut by mistake",
            "external_url": "https://abcnews.go.com/Politics/rfk-jr-announces-hhs-reinstating-programs-employees-cut/story?id=120463293",
            "upvotes": 516,
            "date": "04/03/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/59054b86-6045-41cf-ac07-75876e01e50f/rfk-ap-jt-250402_1743624409938_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Complete chaos and disfunction in this administration every day. \n\n77 million Americans willingly voted for this.",
                "This has got to be the dumbest and most inept administration since the country was founded.",
                "More like \"We tried to do exactly what we wanted, but people lost their shit, so we're going to walk back some of it for now and try again once you all forget about this in a month or two.\"",
                "They don’t know what they’re doing.",
                "this is the standard now... fire a massive group then try walking back some of them that they realize they need",
                "Huh, weird.\n\nYou’d thing that incompetent people acting without thinking would only lead to success, yet somehow here we are.",
                "The man has fucking WORMS in his BRAINS. ",
                "What happens if the fired employees don't trust you anymore and don't want to come back, eh?",
                "The trump administration is both evil and incompetent",
                "goes in with sledge hammer, youre all fired, look how good we do! whats that?? we actually needed some of those people we just randomly cut without rhyme or reason? Oh yeah, uhhhhh, they were let go \"by accident\"\n\n\\- moves on to next department - .\n\n  \ngoes in with sledge hammer, youre all fired, look how good we do! whats that?? we actually needed some of those people we just randomly cut without rhyme or reason? Oh yeah, uhhhhh, they were let go \"by accident\"\n\n\n\n  \nHow many times do they have to do this until people realize they are incompetent?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Tariff-related layoffs hit five US auto plants that supply factories in Canada and Mexico",
            "external_url": "https://www.abc12.com/news/tariff-related-layoffs-hit-five-us-auto-plants-that-supply-factories-in-canada-and-mexico/article_6d95d30a-9956-521c-86e2-a62c9b07d3f4.html?fbclid=IwZXh0bgNhZW0CMTEAAR2xPs0qVaSgfUJmdqsaFHK_By3_8B-vrj9GDws297UllzMvWzCnes45dzw_aem_dyNT8yFsAPiIgD3r5Nwnnw",
            "upvotes": 489,
            "date": "04/03/2025",
            "thumbnail": "https://bloximages.newyork1.vip.townnews.com/abc12.com/content/tncms/assets/v3/editorial/f/c3/fc353f5d-082e-589f-a506-9db6a3ea043a/67eecd25de0f5.image.jpg?crop=1763%2C926%2C0%2C125&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "Congrats to the red states that lost jobs due to a tariff policy based on farcical mathematics devised by an 80yr old man who has not released his college transcript",
                "Guys, I’m starting to think Trump voters aren’t smart. ",
                "So that took what... 11 hours for massive layoffs to occur directly connected to Trumps Recession Plan Tarriffs.",
                "Leopards going to eat well. Mmmm faces",
                " But twump is a bidness man!",
                "And the UAW is supporting these tariffs",
                "And people voted for this because they didn’t like someone’s laugh 🤣",
                "There is a silver lining in every cloud - unemployed people don't cause inflation.",
                "Whenever are we going to stop winning?",
                "Don't forget. This is what you voted for.  Americans have no one else to blame but themselves."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Pentagon’s watchdog to review Hegseth’s use of Signal app to convey plans for Houthi strike",
            "external_url": "https://apnews.com/article/hegseth-signal-messaging-app-attack-plans-f8581bcb447b91d2e7f9cb7809ae0f06",
            "upvotes": 3820,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Tomorrow:  DOGE fires Pentagon staff, cites \"wasteful spending\".",
                "He’ll be fine. They already shifted the blame.",
                "Now that we know Republicans will lie about Democrats \"weaponizing the justice system\" and that Republicans will absolutely weaponize the justice system, I'd like to see a Democratic candidate run on it.\n\nTheir entire campaign could be a laundry list of people like Hegseth who will be rounded up and sent to an El Salvadoran prison on day 1 of the new administration.",
                "Trump appoints himself Pentagon watchdog.",
                "There's a watchdog that hasn't been replaced by Sycophants?",
                "“We’ve reviewed the illegal use of civilian social apps for classified information sharing of active military combat, and found no wrong doing”",
                "Oh boy, I sure am ready for absolutely nothing of consequence to happen to the secretary of drunkenness.",
                "I wouldn't be surprised if it is a made-up examination to say after a few days \"Nope, all easy. It wasn't that bad!\" to sweep the whole issue under the carpet for good...",
                "Yeah, like that will go anywhere.",
                "I mean, is this even a question? He violated federal laws and military regulations and created a massive OPSEC dataspill\n\nHe and everyone on that chat should be fired. ( except the reporter, they get a raise)"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Mehmet Oz confirmed by US Senate to lead Medicare and Medicaid",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/03/mehmet-oz-confirmation-medicare-medicaid",
            "upvotes": 5471,
            "date": "04/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/929fb0a8e383cf00a594c61b34bd66eac77804d6/308_184_4282_2570/master/4282.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=46fa54902ac733c5f57066f59d463592",
            "top_comments": [
                "Another grifter. Jesus fuck.",
                "A [quack](https://en.wikipedia.org/wiki/Medical_claims_on_The_Dr._Oz_Show) leading Medicare and Medicaid. Seems on point for this administration.",
                "The clown show continues",
                "Rejected by voters but still given power. Typical.",
                "Dr. Phil wasn’t available?",
                "And here I thought that they couldn't get any worse than RFK jr.\n\n1. I was wrong.\n\n2. I gotta stop saying that they can't make things worse because they turn that into a challenge.\n\n3. Congressional Republicans should be forced to use RFK jr and Oz as their Primary Care Physicians.",
                "I think I’d prefer nepotism or blatant corruption to just giving jobs to people he has seen on TV.",
                "Embarassing is the new norm. Yet another greedy amoral charlatan representing America.",
                "When this guy is old and dying, we should take away his insurance.",
                "Fuck you - to all my elected officers, for spiraling this country into a reality TV show."
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "RISING",
            "title": "Canada will match Trump’s 25% auto tariffs, Carney says",
            "external_url": "https://globalnews.ca/news/11113522/donald-trump-auto-tariffs-canada-april-3/",
            "upvotes": 597,
            "date": "04/03/2025",
            "thumbnail": "https://globalnews.ca/wp-content/uploads/2025/04/trump-auto-tariffs.jpg?quality=85&strip=all&w=720&h=379&crop=1",
            "top_comments": [
                "I challenge everybody. Do you know any businessman who has filed for bankruptcy at least six times?\n\nRight. He is handling America's economy right now.",
                "Inflation is going to go sky high. If you're planning to buy any foreign goods then I would do it very soon.",
                "Looks like I’ll be driving my 2005 Pontiac G6 till it falls apart lol",
                "Canadians can find many good vehicles made in Canada, Mexico, South Korea and Japan that do not have tariffs. Even when this is over, remember that the US UAW membership is a bunch of Trump-trash and buy your vehicles accordingly. The slobs in Ohio, Michigan, Alabama and South Carolina don’t deserve your business.",
                "Canadian here:\n\n#GET REKT",
                "I think they should just outright ban the sale of cars from American owned companies, starting with Tesla.",
                "I am a Canadian and don't really understand these things, so please bare with me.\n\nI am planning on buying a car likely in the next year or so. I don't plan on buying a \\*new\\* car. I was thinking either off Marketplace with the help of a mechanic, or certified pre-owned. Do you think that the price of these cars will go up because of these tariffs? Even if it is private, possibly because of the increased demand to avoid tariffs?\n\nIn other words, should I say fuck it and buy a car sooner rather than later?",
                "This is insane. Why allow the US to get away with this nonsense. Retaliation and standing up against a bully is not an option. Fight united against 🤡 Trump and his egotistical narcissism.",
                "Buy your car before it's too late to afford even a used dumpster ",
                "Don't match.  Double.  Every 1% Trump puts on something, retaliate with 2%.  If he removes 1%, leave the other 1% as a reminder of his idiocy.  Institute a policy of the remainder being phased out over 25 years (2% of it per year), if no new tariffs are added contingent on there being no new tariffs added, threatened, or proposed, for the previous year."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Govt. immigration scorecard for deportations relied on tattoos and social posts, court filings show",
            "external_url": "https://www.nbcnews.com/news/latino/trump-deportations-scorecard-tattoos-venezuelans-el-salvador-rcna199116",
            "upvotes": 189,
            "date": "04/03/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250318-venezuela-gang-mb-0736-6ea82b.jpg",
            "top_comments": [
                "A true Kakistocracy at work. This administration has been nothing short of a shit volcano since day one. Their main goal literally appears to be just doing widespread evil.",
                "Also relied on hunches, horoscopes, inklings, urges, and auras\n\nNothing is a bigger or more pressing threat to the U.S. than trump and his rape gang administration",
                "I have an anime tattoo with a katana on it. I criticized the US government and its people's education level on my social media posts.\n\nIt is best for me to not visit US and I should wear this privilege like a badge of honour.",
                "Thanks, Obama. Weird how fascist tactics right out of a fearful rightwing conspiracy theory about Democrats is suddenly a real thing run by Republicans and it's fine. This is worse than their fantasyland version of Jade Helm.",
                "Just mindlessly following orders like a good evil lapdog",
                "When stupid evil people do evil shit stupidly it's still evil",
                "Ah yes, the gold standard for evidence."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "‘Potentially historic’ flooding threat looms after almost 100 tornadoes hit US",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/03/potentially-historic-flooding-threat-looms-almost-100-tornadoes-hit-us?fbclid=IwY2xjawJbwM5leHRuA2FlbQIxMAABHf0BvM5E8-X3l1OI-2P-MhoArZtVfmWk_VqPltvB_XT2bPfpe3kApMiBlg_aem_o40FYX2abRDOh2wxzsObJQ",
            "upvotes": 1946,
            "date": "04/03/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/eef4db8a70a019076a43e6a27e0f1c7af9f4d14f/0_121_8000_4799/master/8000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=26d925fec27c5adf0333e12f3487d811",
            "top_comments": [
                "*The nationwide network of River Forecast Centers – operated by Noaa – have been especially hard hit by staffing cuts with five of the 12 offices currently having critical vacancies. This week’s heavy rains will be yet another example of how extreme weather is testing the increasingly weakened agency*\n\nFlooding and tornadoes reaching record-breaking numbers at a time when national and local responses have been limited or undermined by this out of control admin.",
                "Didn't DOGE recently put a stop to FEMA funding?  Said \"the states can take care of their own\"?\n\nThese people are screwed.",
                "Hopefully there's a federal agency with enough funding and human resources to deal with such disasters, right?",
                "As someone who lives in this so-called \"Bible Belt\", I wonder who/what the religious wackos here will blame this time for this happening.",
                "A little FEMA would be good right about now.  Oh wait..",
                "If there was only some Agency that could manage emergencies on a federal level",
                "Paper towels on the way!",
                "Biden helped NC in the floods and they went with Trump",
                "They should have raked",
                "Don’t worry, everyone! Dear leader is on his way to go to a golf tournament after setting the world economy on fire and therefore certainly does not giving two flying fucks about any of you."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Myanmar earthquake death toll rises to 3,145 as more bodies found",
            "external_url": "https://apnews.com/article/myanmar-thailand-earthquake-71d51dfc7339e017b1d116c105effab4",
            "upvotes": 478,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And they're stuck in the middle of a brutal civil war during this disaster, too. \n\nHorrifyingly awful.",
                "Jesus dude, they just can’t catch a break. Civill war, brutal dictatorship, coups, genocide, intentional targeting of civilians, etc.",
                "It's awful at the moment. Compounded by the fact that the military junta has continued to airstrike the epicenter of the quake, Sagaing Region and firing at Chinese rescue workers coming into the region.\n\nSource: [Junta fires on convoy bringing aid to quake-hit regions - BBC News](https://www.bbc.com/news/live/c2dep0r5ygnt)",
                "Thank God the US sent 3 people to help with this.",
                "Well, we sent 3 people to help... days late. America is leading from behind now."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "RISING",
            "title": "US bans government personnel in China from romantic or sexual relations with Chinese citizens",
            "external_url": "https://apnews.com/article/chinese-beijing-honeypot-spies-diplomat-agent-intelligence-c077ef57b0f7ae43dd0db41bea92238b",
            "upvotes": 3118,
            "date": "04/03/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Curious. This was put in place by the outgoing, Biden-appointed ambassador, Nicholas Burns. And it's an expansion of an earlier fraternization policy. Trump's nominee is unconfirmed at this moment.",
                "What about government personnel having sexual encounters on a private island belonging to a billionaire who is sex trafficking women and minors?",
                "What about regular us citizens? Can we still smash?",
                "That's good.  Don't want to make Russia jealous.",
                "You can ban me all you want, you're just making it hotter!",
                "Will I get tariffs for banging my partner of 18 years?",
                "Honestly kinda surprised this wasn't already a thing due to risk of espionage",
                "I'm not sure if they can legally do this. (Not that this would stop them)\n\nEdit- many people have kindly informed me that I'm wrong, and there are many circumstances where this is completely possible and appropriate.",
                "Also in the news, there's a sudden influx of US government personnel in China asking to return home\n\n/s",
                "No mentions of DoD, they asked Congress, Congress said ask the State Dept., State Dept. said nothing.\n\nArticle is deeply vague"
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "RISING",
            "title": "White House fires three NSC staffers after president meets with far-right activist Laura Loomer",
            "external_url": "https://www.cnn.com/2025/04/03/politics/nsc-firings-trump-laura-loomer-meeting/index.html",
            "upvotes": 8870,
            "date": "04/03/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-2024-09-11t000440z-1209639841-rc2zx9a96h4i-rtrmadp-3-usa-election-debate-arrivals.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Isn't this the woman who was very obviously trying to have an affair with Trump during the campaign? Maybe she even was.",
                "Nothing to see here, just the President's mistress directing national security policy like you'd see in any other normal, functioning democracy.",
                "This was probably just for an oval office blowjob. Probably not related.",
                "And none of the people involved with Signalgate",
                "TFH? Is that an actual picture of her? Or is that an animatronic or wax statue?",
                "He probably gets extra jazzy about getting away in the open with what Bill Clinton lost a portion of his legacy over. And so does anyone intentionally looking the other way.",
                "It’s painful to be reminded of all d-list sycophants Trump had during his campaign. \n\nRFKjr, Keri Lake, Catturd, Comrade Tulsi, Kid Rock, Rob Schneider, Kash Patel, Pete Hegseth, Giuliani , Hulk Hogan, Vince McMahon etc.  \n\nThese guys were on their way out of public consciousness once Trump\nLost.  But enough people sat out the election and now he’s rewarding the absolute worst of humanity by giving them power and influence over the American people for no other reason than “the libs will hate this”. \n\nHearing Laura Loomers name is a reminder that he’s not close to being done getting his revenge on America.  (And no, not only the libs, on the entire country).",
                "she's only 31?! she looks like a refurbished 50 at *best*.",
                "It’s wild how much she turned herself into a goblin",
                "\"Come s my d and you can fire whoever you want\""
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/04/2025 00:40:49 UTC"
}