{
    "posts": [
        {
            "category": "HOT",
            "title": "‘Ruined this place’: chorus of boos against JD Vance at Washington concert",
            "external_url": "https://www.theguardian.com/world/2025/mar/14/jd-vance-booed-national-symphony-orchestra-concert-washington-kennedy-center",
            "upvotes": 5624,
            "date": "03/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/237c2180b80bf56ca869dc7b0e1b6eb7f00ea50c/60_0_1800_1080/master/1800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2ad43ddef753c4ddb674bee73155dbd1",
            "top_comments": [
                "The irony of JD Vance going to a Shostakovich concert after Trump fired the board of the Kennedy Center is lost on every one of his supporters.",
                "It irritates me when people who constantly mock a made up version of the sensitive liberals and want to defund/ban anything slightly artistic or expressive then think they’re entitled to enjoy art. May they never find peace",
                "The public roasting of these doucebags is beautiful and cathartic",
                "I’m pretty sure JD Vance soon will tweet how his wife and him was nearly attacked by an angry liberal mob paid for by Soros while attending a concert.",
                "These motherfuckers should be booed and ridiculed wherever they go. They don't deserve to enjoy anything.",
                "“You’re Intolerant because you don’t love our hatred and Intolerance!!!”\n\n\nYep",
                "Oh they love it. You have a bunch of college educated, sometimes Ivy League educated, guys who worked at hedge funds or ran insurance companies talking about \"elites\" this and that",
                "how does the wife sit through that.",
                "If everyone stops using his ‘cool’ name abbreviation and starts calling him James or Jimmy, he’d hate that.",
                "*”Elites use different words, eat different foods, listen to different music – I was astonished when I learned that people listened to classical music for pleasure – and generally occupy different worlds from America’s poor,” he said. “Unfortunately, this can make things a little culturally awkward when you leap from one class to the other.”*\n\nDon’t worry, JD, your unlikeability transcends social classes.  From the imposed-upon donut shop workers to presidents whose citizens are being slaughtered in war, they can all find at least one thing to agree upon."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "US meat trade days away from getting 'kicked out' of China",
            "external_url": "https://www.abc.net.au/news/2025-03-14/3-billion-united-states-meat-trade-to-china-at-risk/105052220",
            "upvotes": 2058,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/1c99f16be5073db8a407da33b9d26f25?impolicy=wcms_watermark_news&cropH=788&cropW=1400&xPos=0&yPos=73&width=862&height=485&imformat=generic",
            "top_comments": [
                "Looks like someone doesn’t have all the cards…",
                "Has anyone in the white house read a history book? Because the current consequences seem easily avoided based on the way things have turned out previously.",
                "Art of the deal, now we can all buy it for less money, right? Right?",
                "The largest pork processor in the US is Smithfield and they're Chinese owned.  I wonder how that'll work.",
                "he'll wait till the last minute sign it and claim credit for saving the beef industry....",
                "Good for China. The US gets what it voted for.",
                "So much winning, non stop winning. The voters must be so proud",
                "So, China just need to do nothing (not renew export licences) and “...$US3 billion ($A4.77B) worth of beef, pork and poultry no longer eligible to export to China.”.  That is just so low effort with highly effective impact.  Maybe, other countries that are affected by the U.S. tariffs need to look at this as a tactic to defend their economy.",
                "Looks like American decisions in the ballot box have consequences...",
                "I mean if they want the dump all that produce in the American market I would love to pick up some nice cuts of steak for the cheap."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Trump asks Supreme Court to allow him to end birthright citizenship | CNN Politics",
            "external_url": "https://www.cnn.com/2025/03/13/politics/birthright-citizenship-trump-supreme-court/index.html",
            "upvotes": 31108,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2198243247-1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So, that requires an amendment. Does anyone have a copy of The Constitution For Dummies?",
                "If the Supreme Court says anything but no, there should be secession. Explicit text requires an amendment to undo.",
                "If they say “yes” to him, Then the constitution no longer matters.",
                "Immigrants are bad except when a rogue immigrant billionaire wants to destroy the country.",
                "There's an insidious corollary, of course. If\n\n> the benefit applies only to people who are “subject to the jurisdiction” of the United States. Immigrants in the country illegally, the theory goes, are subject to the jurisdiction of their native homeland. \n\nthen people in the country illegally aren't subject to the laws of the US, and they can be treated in any manner the administration decides.",
                "Does that mean we can deport Cuban-canadian and birthright citizen Ted Cruz? Please?",
                "To which, in a just world, they would reply: Fuck off",
                "If this one goes through supreme court, IT IS OVER for democracy in USA. Officially a Tyrannical government. \n\nInterpretation of words in the constitution like the president sees fit. Tomorrow it could mean the 1st and 2nd amendment which are also being challenged. \n\nRise up americans.",
                "We shouldn't be laughing at this. We've been laughing at things like this before.\n\nThen they happened for real.",
                "Just so everyone is aware, if you look up [the 14th amendment, the very first sentence is](https://constitution.congress.gov/constitution/amendment-14/):\n\n> **All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.** No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\n\nIt does not get any clearer than that. If this is anything except a unanimous \"go fuck yourself\", we've got a (yet another) constitutional crisis on our hands."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Judge Chutkan demands ‘some kind of evidence’ from Trump’s EPA to halt climate grants. \"You can't even tell me what the evidence of malfeasance is.\"",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/13/epa-grants-trump-judge-tanya-chutkan",
            "upvotes": 4971,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a06c5b96b2d43f44495a018ab9f5b673dccd439f/0_80_5410_3245/master/5410.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=26fe43c2241b4b05506a2da652e15a4b",
            "top_comments": [
                "They run the House, the Senate, the Supreme Court, and the presidency and this fucking dipshit still can't get anything done despite using executive orders for everything.",
                "Because they're making shit up.",
                "Conservatives: The rules were you weren't going to fact-check!",
                "The don't know what malfeasance means so ...",
                "“Your honor, we are under direct orders by President Trump to bombard the courts with bullshit cases and see what sticks.”",
                "Please, I'm begging the justice system to stop giving endless deference to this mindless legal nonsense.\n\nJust ask them for evidence, and when they don't provide it, pound the gavel and send them  packing.",
                "\"Evidence is for losers.\"\n\n--Donald Trump",
                "The sad part is that we have One Judge Chutkan for every 4 Judge Cannons. \n\nAll they have to do is shift it to the right court and they will get whatever they want.",
                "An oil tycoon is running the EPA what do you think his agenda is.",
                "Odds are he doesn't even know what \"malfeasance\" is, no matter that his very existence drips with it."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Influencer who snatched baby wombat leaves Australia",
            "external_url": "https://www.abc.net.au/news/2025-03-14/sam-jones-baby-wombat-video-leaves-australia/105051630",
            "upvotes": 1159,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/cfd3459afa4febabed3f2ab124a7eb6c?impolicy=wcms_watermark_news&cropH=336&cropW=597&xPos=0&yPos=45&width=862&height=485&imformat=generic",
            "top_comments": [
                "*On her profile, she describes herself as a \"wildlife biologist and environmental scientist\", an \"outdoor enthusiast\" and a hunter*.\n\nthe only thing i believe is the hunter part",
                "Can we stop calling them Influencers and just refer to them as attention seeking idiots?",
                "She went from something like 2k followers to almost 100k. Thats completely gross. She got exactly what she wanted.",
                "Nothing but ignorance.  Imagine gaining notoriety through lack of decency and pure stupidity.",
                "Insert Australian Northern Territory tourism slogan here.",
                "should not have been allowed to leave the country without paying some sort of fine imo",
                "These influencers should be banned from having any form of social media etc when they pull shit like this. That’s the only way to stop them doing shit for attention.",
                "> Influencer\n\nI don’t remember cunt being spelled with so many letters. ",
                "Can we not allow her back in the US?",
                "Embarrassing for Montana and Americans."
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "HOT",
            "title": "Judge orders Trump administration to reinstate thousands of fired employees at VA, Defense Department and other agencies",
            "external_url": "https://www.cnn.com/2025/03/13/politics/judge-opm-probationary-employees-fired-hearing",
            "upvotes": 13326,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/judge-alsup-with-book-crop.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This will fast track to SCOTUS",
                "Doge is now claiming they had nothing to do with it. What a massive mess. \n\nThis is just costing US taxpayers more money. \n\nI do know for the US Forest Service and the National Park Service, is this early part of the year is critical planning time to get ready for summer visitation. \n\nInstead, key employees weren’t in the office. Now they’ll get paid for the time but none of their critical responsibilities have been completed. \n\nThe National Parks had their highest visitation ever in 2024. They need more employees now, not fewer. \n\nI imagine the National Forest visitation is similarly at record levels.",
                "You know what would make the federal government lean and efficient? A competent leader. \n\nOne who understands basic bureaucracy and the fundamentals of representative democracy well enough to administer an entire nation for the benefit of the whole constituency. The Musk/Trump administration doesn't even care about the people who elected them into office to make the distinctions during this power grab.",
                "Constitutional crisis if the felon doesn't follow the order.",
                "Trump is the opposite of the saying, \"When uou do things right, people won't be sure you've done anything at all.\"  Like love or hate, Biden, all you want, at least for 4 years, we didn't have to deal with new shit every day.",
                "I get the feeling of \"well the courts won't follow through\" etc. And yes, the Supreme Court is a vile corrupt pack of trash.\n\n\nBut don't underestimate the individual egos of judges as they watch their authority undermined time and time again by this administration. It's all too late but just like the business leaders seeing the economic devastation Trump is causing and finally coming around, many judges are starting to realize that Trump is trying to make them powerless and obsolete. They're like cops, they'll protect their own. And there's a potential tipping point here.",
                "They probably already shredded the records like they’ve been doing with other agencies.",
                "From the news, it seems that the judges are the only ones willing to fight back against this dictator while the Congress has completely bended the knee to him. His priority now is to have the supreme court bend the knee to him and he can finally become the autocrat he always wanted to be. The supreme court is the final line of defense, now. Let's see how it goes.",
                "This is why DOGE was deleting records and shredding paperwork. By mass deleting everything to non recoverability, they can’t actually rehire anyone because they have no paperwork to enable them to do so. It was a deliberate choice to destroy those records just in case they were forced to reinstate them, or if they were all thrown out of office and new management took over.",
                "That’s all great and all but. Or else what? trump broke a lot of laws and? And what?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Stolen Telsa Driven Into Calgary's Bow River",
            "external_url": "https://www.ctvnews.ca/calgary/article/stolen-tesla-drives-into-calgarys-bow-river/",
            "upvotes": 1953,
            "date": "03/14/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/7NJBAQJO55GNXGZG6UFHZFJJII.jpg?smart=true&auth=e1c5e4cc13c4389c09c1ec0bcef5d14b5d5b30e87b077fae33bc714ad315e432&width=1200&height=630",
            "top_comments": [
                "The driver had to make quick decision: Should I be electrocuted by the batteries or be eaten by the Bow River sharks.",
                "Are they sure it wasn’t the self driving software?",
                "[removed]",
                "I hope Elon loses another 30 billion this week ….",
                "Just put that shit in some rice",
                "Prayers up for the river",
                "It's not stolen, its just returning to the stream to spawn.",
                "Boston Harbour  might have made a bigger.......splash!",
                "Performance art of Telsa's stock sinking.",
                "Ah yes. A \"stolen\" Tesla. \nDefinitely not a Tesla owner living with regret and a car they can't sell. \n\n\nTotal conjecture on my part. But I'm suspicious. "
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "White House withdraws CDC director nomination just before his Senate confirmation hearing",
            "external_url": "https://www.nbcnews.com/politics/trump-administration/white-house-pulls-cdc-director-nomination-day-confirmation-hearing-rcna196208",
            "upvotes": 7511,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-11/241125-Dave-Weldon-2-aa-234p-7a721e.jpg",
            "top_comments": [
                "*\"he defended the work of Andrew Wakefield, the British physician who published a study that falsely claimed the vaccine for measles, mumps and rubella causes autism.\"*\n\nYeah.",
                "> In a lengthy statement, Weldon said he assumed the White House withdrew his nomination because Sen. Susan Collins, R-Maine, had reservations, and Cassidy also planned to vote against him. \n\nOK, that's the excuse. What's the real reason? Because I find it hard to believe Collins having \"reservations\" is ever a showstopper.",
                "They probably found someone who is worse for the job. Maybe a redneck grandmother who will provide universal castor oil and exorcisms mental health issues. ",
                "If his past comments had just stuck to Nazi adoration and glorifying sexual assault, he would have made it through!",
                "Guess you're only allowed to say that vaccines cause autism if your last name is Kennedy or Trump.",
                "Im assuming a better candidate (Kid Rock probably) has become available.",
                "What happened, did it turn out that he was qualified for the job?",
                "That's a face that says \"I just woke up and I have no idea what's going on.\"",
                "Must've accidentally once Tweeted, \"I don't think people should get sick.\"",
                "This administration really exudes competence"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "Dow slides and S&P closes in correction as Trump’s trade war escalates",
            "external_url": "https://www.cnn.com/2025/03/13/investing/us-stocks-global-trade-tensions",
            "upvotes": 4047,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25062863572137.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The stock market is not the problem. It's the recession that I'm worried about.\n\nPeople will lose their jobs just when their 401Ks are low. Sad.",
                "It really should not be this easy to fuck things up this much.",
                "Honestly, Donald just seems like the kind of guy to preheat a microwave.",
                "Let’s see how long the money puts up with this",
                "Trump 💩is killing the USA",
                "trump and his minions are going to make a killing  make it fall buy cheap",
                "Jesus fucking Christ ! Can I please get 1 decade where this bullshit doesn't happen?",
                "Is \"correction\" another term for economic suicide?",
                "Don’t forget that even after Berlin was in ashes and the Red Army occupied Germany, most Germans still adored their Fuher and longed for Nazi Germany. MAGA will never learn and this is what they desperately crave. They just love Trump, more than anything. Let them have it.",
                "A correction means that stock was overvalued. That's not what's happening here. What's happening here is that the underlying companies are less valuable because America is less valuable."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Jewish protesters flood Trump Tower's lobby to demand the Columbia University activist's release",
            "external_url": "https://apnews.com/article/columbia-university-protests-khalil-trump-tower-8e2f455134a2f1b82458e32aecbb59f7",
            "upvotes": 7626,
            "date": "03/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Jewish people having a problem with agents of the state disappearing someone without the government publicly saying what he did wrong?\n\nWeird.",
                "As a jew -- and one who certainly does not agree with everything this activist says -- much, MUCH more of this please.\n\nNo extrajudicial governmental disappearances. Ever. No matter the disagreement. That is a hallmark of fascism, as if we needed any further evidence of the unhinged authoritarian tendencies of this administration.",
                "trump: they’re all Palestinians, members of Hamas just like Schumer…",
                "Ok but Fox News was telling me these were all anti semetic protesters who hate America. Why would they say that? /s",
                "Hell yeah! Solidarity",
                "Okay, how long until they're labeled as Hamas supporters and/or paid agitators?",
                "Many Jews in the US are not supporters of Trump and his policies. What Trump is doing is an attack on our freedom.",
                "Wonder if Jon Stewart is ready to call him fascist yet",
                "[removed]",
                "Should of mentioned it was “jewish voice for peace” the “jewish” group in question is problematic and had many issues with the jewish-American community and the israeli jewish community and its HIGHLY debated if its even made up of jewish people.\n\nHere’s some of the things they do.\n\nsaying speaking Hebrew as jews is offensive and traumatic to Palestinians thus nobody should speak it\n\nCalling Zionism an Ashkenazi ideology and calling Mizrahi jews oppressed when Mizrahi (predominant majority in israel) organisations actively denounce them as false. They are bringing bad taste to their name. \n\nIts admins registered in Lebanon\n\nLiterally writing Passover Hebrew backwards (so much jewish of them right?) \n\nPoliticising their (debated) jewishness. Like making every holyday about palestine.\n\nApportioning Judaism  to support palestine and remove mentions of Israel or jewish connection to israel. \n\nUploading a “happy passover in support of palestine” post while the picture of the post was literally bread (forbidden in passover) \n\nJustified october 7th as a means for Palestinians to get freedom\n\n\nJewish voice for peace does not speak for jewish people. They are culturally appropriating Judaism and are anti semitic as much as the name will mislead you. Even if in this case freedom of speech is to be protected, its important to note this"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Fierce protests as eight-year-old rape victim dies in Bangladesh",
            "external_url": "https://www.bbc.com/news/articles/ce30k9g6x2eo",
            "upvotes": 12,
            "date": "03/14/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/1897/live/ebd12f00-0094-11f0-93cc-fd4e777d3e70.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "‘Ruined this place’: chorus of boos against JD Vance at Washington concert",
            "external_url": "https://www.theguardian.com/world/2025/mar/14/jd-vance-booed-national-symphony-orchestra-concert-washington-kennedy-center",
            "upvotes": 5652,
            "date": "03/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/237c2180b80bf56ca869dc7b0e1b6eb7f00ea50c/60_0_1800_1080/master/1800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2ad43ddef753c4ddb674bee73155dbd1",
            "top_comments": [
                "The irony of JD Vance going to a Shostakovich concert after Trump fired the board of the Kennedy Center is lost on every one of his supporters.",
                "It irritates me when people who constantly mock a made up version of the sensitive liberals and want to defund/ban anything slightly artistic or expressive then think they’re entitled to enjoy art. May they never find peace",
                "The public roasting of these doucebags is beautiful and cathartic",
                "I’m pretty sure JD Vance soon will tweet how his wife and him was nearly attacked by an angry liberal mob paid for by Soros while attending a concert.",
                "These motherfuckers should be booed and ridiculed wherever they go. They don't deserve to enjoy anything.",
                "“You’re Intolerant because you don’t love our hatred and Intolerance!!!”\n\n\nYep",
                "Oh they love it. You have a bunch of college educated, sometimes Ivy League educated, guys who worked at hedge funds or ran insurance companies talking about \"elites\" this and that",
                "how does the wife sit through that.",
                "If everyone stops using his ‘cool’ name abbreviation and starts calling him James or Jimmy, he’d hate that.",
                "*”Elites use different words, eat different foods, listen to different music – I was astonished when I learned that people listened to classical music for pleasure – and generally occupy different worlds from America’s poor,” he said. “Unfortunately, this can make things a little culturally awkward when you leap from one class to the other.”*\n\nDon’t worry, JD, your unlikeability transcends social classes.  From the imposed-upon donut shop workers to presidents whose citizens are being slaughtered in war, they can all find at least one thing to agree upon."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Influencer who snatched baby wombat leaves Australia",
            "external_url": "https://www.abc.net.au/news/2025-03-14/sam-jones-baby-wombat-video-leaves-australia/105051630",
            "upvotes": 1163,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/cfd3459afa4febabed3f2ab124a7eb6c?impolicy=wcms_watermark_news&cropH=336&cropW=597&xPos=0&yPos=45&width=862&height=485&imformat=generic",
            "top_comments": [
                "*On her profile, she describes herself as a \"wildlife biologist and environmental scientist\", an \"outdoor enthusiast\" and a hunter*.\n\nthe only thing i believe is the hunter part",
                "Can we stop calling them Influencers and just refer to them as attention seeking idiots?",
                "She went from something like 2k followers to almost 100k. Thats completely gross. She got exactly what she wanted.",
                "Nothing but ignorance.  Imagine gaining notoriety through lack of decency and pure stupidity.",
                "Insert Australian Northern Territory tourism slogan here.",
                "should not have been allowed to leave the country without paying some sort of fine imo",
                "These influencers should be banned from having any form of social media etc when they pull shit like this. That’s the only way to stop them doing shit for attention.",
                "> Influencer\n\nI don’t remember cunt being spelled with so many letters. ",
                "Can we not allow her back in the US?",
                "Embarrassing for Montana and Americans."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US meat trade days away from getting 'kicked out' of China",
            "external_url": "https://www.abc.net.au/news/2025-03-14/3-billion-united-states-meat-trade-to-china-at-risk/105052220",
            "upvotes": 2062,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/1c99f16be5073db8a407da33b9d26f25?impolicy=wcms_watermark_news&cropH=788&cropW=1400&xPos=0&yPos=73&width=862&height=485&imformat=generic",
            "top_comments": [
                "Looks like someone doesn’t have all the cards…",
                "Has anyone in the white house read a history book? Because the current consequences seem easily avoided based on the way things have turned out previously.",
                "Art of the deal, now we can all buy it for less money, right? Right?",
                "The largest pork processor in the US is Smithfield and they're Chinese owned.  I wonder how that'll work.",
                "he'll wait till the last minute sign it and claim credit for saving the beef industry....",
                "Good for China. The US gets what it voted for.",
                "So much winning, non stop winning. The voters must be so proud",
                "So, China just need to do nothing (not renew export licences) and “...$US3 billion ($A4.77B) worth of beef, pork and poultry no longer eligible to export to China.”.  That is just so low effort with highly effective impact.  Maybe, other countries that are affected by the U.S. tariffs need to look at this as a tactic to defend their economy.",
                "Looks like American decisions in the ballot box have consequences...",
                "I mean if they want the dump all that produce in the American market I would love to pick up some nice cuts of steak for the cheap."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "School employee accused of inappropriate relationship with student",
            "external_url": "https://www.wsfa.com/2025/02/23/school-employee-accused-inappropriate-relationship-with-student/?utm_source=taboola&utm_medium=organicclicks",
            "upvotes": 74,
            "date": "03/14/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/3P3GEYT52BAZNHXTUNRBEJ5OEA.jpg?auth=e027da333f599b88f90b4d26d1aa8b7542aed2e5beb6710e5de5e89b5998db3c&width=1200&height=600&smart=true",
            "top_comments": [
                "She’s obviously legally innocent until proven guilty, but if she is being charged with statutory rape, the article should say she’s being accused of statutory rape.  I don’t know why the news tiptoes around this type of allegation.",
                "\"Having a relationship\"",
                "Is it Texas or Florida?",
                "And just like always.  when it's a woman, it's \"inappropriate relationship\".  I'm not sexist...ladies have it goddamn rough in society and I absolutely do NOT understand just how bad it is, but I know it is pretty bad...but when it comes to sexual misconduct of any kind the men are always the ones saddled with 'rape' by the media, and the women get 'inappropriate relationship'.",
                "This is deeply concerning. Are there any details on the investigation or actions taken by the school?",
                "[removed]",
                "i feel like more and more female teachers lately are making it their mission to single-handedly lessen the gender gap of child sexual violence",
                "I personally just don’t want to hear the idiot dude say she’s hot and where she when I was in school",
                "3 week old news. Thanks",
                "One lucky SOB. She looks like an angel."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Apple accused of discrimination for telling employee to stop wearing jewellery supporting Gaza",
            "external_url": "https://www.abc.net.au/news/2025-03-13/apple-accused-discrimination-jewellery-supporting-gaza/105042996",
            "upvotes": 659,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/2b158d5aa18917d229c4f2bd195f2dbf?impolicy=wcms_watermark_news&cropH=2354&cropW=4185&xPos=414&yPos=1147&width=862&height=485&imformat=generic",
            "top_comments": [
                "IANAL in Aus, but usually private companies can have uniform policies. They have a right to protect the brand..",
                "Im sure some coworker or customer complained that this person was supporting terror.",
                "[deleted]",
                "How is telling someone to not wear political wear discrimination?",
                "> in the shape of historic Palestine\n\nLOL\n\nAnyway, in spite of such jokes, the fact that his coworkers were scared of him and multiple people accuse him of antisemitism says that maybe this wasn't just about the Free Palestine bracelet and the Palestine necklace.\n\nI wonder what the viewpoints of his managers and coworkers are.  They didn't seem to be quoted anywhere.",
                "Your beliefs on your own time. You’re paid to work not politicize the office. This is just basic rules that have always been in effect. It’s just these days it needs to be spoken aloud or written in a handbook for those with less common sense and self awareness. \nWork is hard enough without having people bicker over personal stuff.",
                "Let's see them tell employees to stop wearing star of David necklaces and see how well that goes for them.",
                "Why? Keep your politics outside when you're at work. Honestly, the most insufferable people are those that wear their politics on their sleave at all times, like some sort of a martyr or virtue badge at work.",
                "This could raise questions about workplace policies on political expression and how they balance with anti-discrimination laws.",
                "Imagine the reaction if the had banned a cross,  star of David, or the moon and star ...."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Judge Chutkan demands ‘some kind of evidence’ from Trump’s EPA to halt climate grants. \"You can't even tell me what the evidence of malfeasance is.\"",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/13/epa-grants-trump-judge-tanya-chutkan",
            "upvotes": 4979,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a06c5b96b2d43f44495a018ab9f5b673dccd439f/0_80_5410_3245/master/5410.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=26fe43c2241b4b05506a2da652e15a4b",
            "top_comments": [
                "They run the House, the Senate, the Supreme Court, and the presidency and this fucking dipshit still can't get anything done despite using executive orders for everything.",
                "Because they're making shit up.",
                "Conservatives: The rules were you weren't going to fact-check!",
                "The don't know what malfeasance means so ...",
                "“Your honor, we are under direct orders by President Trump to bombard the courts with bullshit cases and see what sticks.”",
                "Please, I'm begging the justice system to stop giving endless deference to this mindless legal nonsense.\n\nJust ask them for evidence, and when they don't provide it, pound the gavel and send them  packing.",
                "\"Evidence is for losers.\"\n\n--Donald Trump",
                "The sad part is that we have One Judge Chutkan for every 4 Judge Cannons. \n\nAll they have to do is shift it to the right court and they will get whatever they want.",
                "An oil tycoon is running the EPA what do you think his agenda is.",
                "Odds are he doesn't even know what \"malfeasance\" is, no matter that his very existence drips with it."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Federal Cuts Prompt Johns Hopkins to Cut More Than 2,000 Workers",
            "external_url": "https://www.nytimes.com/2025/03/13/us/trump-cuts-johns-hopkins-university-layoffs.html?unlocked_article_code=1.304.EFUS.chI-h1pFmD5L&smid=nytcore-android-share",
            "upvotes": 848,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So this is what so called conservatives completely miss in the fed cut conversation. Absolutely no concept of the multiplier effect of government spending. At this point I’m convinced that they fall into one of two camps:  The truly clueless and the 1% who are trying to intentionally drive markets into the dirt so they can snatch up the bargains.",
                "Someone who needed medical care might die. But hey - those three trans kids in the entire state of Idaho won’t get to play sports so worth it, amiright?",
                "Hey let’s screw up the best medical research hospital in the whole freaking world. That sounds like a great idea! /s",
                "There's going to be so many down stream job losses from this. Most of these cuts were well paid middle-class jobs. How many restaurants, landscapers, maids and pretty much anything that's not a basic need might go under because they just lost 10-20% of their business? And how many more from those going out of business?",
                "I am still mind blown the first six weeks have been almost entirely about cutting good American jobs. I will never understand how people voted for this",
                "Only 3 years and 10 more months of disaster left.   \n\nHopefully we still have a country left by then",
                "This is like refusing to water a tree that will later provide fruit and shade.",
                "Are we great again yet?",
                "Hey, but they made that kid an honorary secret service member or whatever. Why aren't y'all clapping more?!",
                "2000 more families with upended lives"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Stolen Telsa Driven Into Calgary's Bow River",
            "external_url": "https://www.ctvnews.ca/calgary/article/stolen-tesla-drives-into-calgarys-bow-river/",
            "upvotes": 1960,
            "date": "03/14/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/7NJBAQJO55GNXGZG6UFHZFJJII.jpg?smart=true&auth=e1c5e4cc13c4389c09c1ec0bcef5d14b5d5b30e87b077fae33bc714ad315e432&width=1200&height=630",
            "top_comments": [
                "The driver had to make quick decision: Should I be electrocuted by the batteries or be eaten by the Bow River sharks.",
                "Are they sure it wasn’t the self driving software?",
                "[removed]",
                "I hope Elon loses another 30 billion this week ….",
                "Just put that shit in some rice",
                "Prayers up for the river",
                "It's not stolen, its just returning to the stream to spawn.",
                "Boston Harbour  might have made a bigger.......splash!",
                "Performance art of Telsa's stock sinking.",
                "Ah yes. A \"stolen\" Tesla. \nDefinitely not a Tesla owner living with regret and a car they can't sell. \n\n\nTotal conjecture on my part. But I'm suspicious. "
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Seattle man shot in argument after throwing chicken bone out car window",
            "external_url": "https://www.fox13seattle.com/news/seattle-shot-argument-chicken-bone",
            "upvotes": 274,
            "date": "03/13/2025",
            "thumbnail": "https://images.foxtv.com/static.q13fox.com/www.q13fox.com/content/uploads/2025/03/1280/720/vlcsnap-2025-03-10-21h13m09s571.jpg?ve=1&tl=1",
            "top_comments": [
                "I live in Atlanta and people do this shit (throwing chicken bones wherever the fuck they want) and it's annoying as hell\n\n\nIt's such a problem that \"WingsOfAtl\" was a thing on IG\n\n\nTruly fuck people who throw chicken bones everywhere",
                "Guess that guy really did have a bone to pick with him",
                "Sounds like everyone involved is absolute trash.",
                "Anddd .... he's fund raising for his medical bills (per the article, no donations as of 7:15 pm EST).\n\nWhile I don't support chicken bone shooters, I don't support chicken bones litterers either. It'll interesting to see how much he gets.",
                "Not to downplay the crazy in this story, but who throws chicken bones out a window?  Is it difficult to hold onto the bones until you're done and then put them in the trash?  He didn't deserve to get shot over it, but that was trashy (pun might be intended).",
                "In the criminal justice system, poultry-based offences are considered especially hen-nous.\n\nIn Seattle, the dedicated detectives who investigate these vicious fowlenies are members of an elite squad known as the Special Chickens Unit.\n\nThese are their stories.\n\nBUCK BUCK",
                "[ Removed by Reddit ]",
                "Sheesh. Over a bone? Dun dun dun… the plot chickens.",
                "And to think all that came about from one person being a litterbug. I hope he learned it's probably easier to just use a trash can. Not saying the women's reactions were correct, but as a dog owner, assholes who throw chicken bones on the ground need some sort of intervention to dissuade such behavior.",
                "At least the guy almost died for something truly worthwhile. /s"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "‘Ruined this place’: chorus of boos against JD Vance at Washington concert",
            "external_url": "https://www.theguardian.com/world/2025/mar/14/jd-vance-booed-national-symphony-orchestra-concert-washington-kennedy-center",
            "upvotes": 5639,
            "date": "03/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/237c2180b80bf56ca869dc7b0e1b6eb7f00ea50c/60_0_1800_1080/master/1800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2ad43ddef753c4ddb674bee73155dbd1",
            "top_comments": [
                "The irony of JD Vance going to a Shostakovich concert after Trump fired the board of the Kennedy Center is lost on every one of his supporters.",
                "It irritates me when people who constantly mock a made up version of the sensitive liberals and want to defund/ban anything slightly artistic or expressive then think they’re entitled to enjoy art. May they never find peace",
                "The public roasting of these doucebags is beautiful and cathartic",
                "I’m pretty sure JD Vance soon will tweet how his wife and him was nearly attacked by an angry liberal mob paid for by Soros while attending a concert.",
                "These motherfuckers should be booed and ridiculed wherever they go. They don't deserve to enjoy anything.",
                "“You’re Intolerant because you don’t love our hatred and Intolerance!!!”\n\n\nYep",
                "Oh they love it. You have a bunch of college educated, sometimes Ivy League educated, guys who worked at hedge funds or ran insurance companies talking about \"elites\" this and that",
                "how does the wife sit through that.",
                "If everyone stops using his ‘cool’ name abbreviation and starts calling him James or Jimmy, he’d hate that.",
                "*”Elites use different words, eat different foods, listen to different music – I was astonished when I learned that people listened to classical music for pleasure – and generally occupy different worlds from America’s poor,” he said. “Unfortunately, this can make things a little culturally awkward when you leap from one class to the other.”*\n\nDon’t worry, JD, your unlikeability transcends social classes.  From the imposed-upon donut shop workers to presidents whose citizens are being slaughtered in war, they can all find at least one thing to agree upon."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US meat trade days away from getting 'kicked out' of China",
            "external_url": "https://www.abc.net.au/news/2025-03-14/3-billion-united-states-meat-trade-to-china-at-risk/105052220",
            "upvotes": 2059,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/1c99f16be5073db8a407da33b9d26f25?impolicy=wcms_watermark_news&cropH=788&cropW=1400&xPos=0&yPos=73&width=862&height=485&imformat=generic",
            "top_comments": [
                "Looks like someone doesn’t have all the cards…",
                "Has anyone in the white house read a history book? Because the current consequences seem easily avoided based on the way things have turned out previously.",
                "Art of the deal, now we can all buy it for less money, right? Right?",
                "The largest pork processor in the US is Smithfield and they're Chinese owned.  I wonder how that'll work.",
                "he'll wait till the last minute sign it and claim credit for saving the beef industry....",
                "Good for China. The US gets what it voted for.",
                "So much winning, non stop winning. The voters must be so proud",
                "So, China just need to do nothing (not renew export licences) and “...$US3 billion ($A4.77B) worth of beef, pork and poultry no longer eligible to export to China.”.  That is just so low effort with highly effective impact.  Maybe, other countries that are affected by the U.S. tariffs need to look at this as a tactic to defend their economy.",
                "Looks like American decisions in the ballot box have consequences...",
                "I mean if they want the dump all that produce in the American market I would love to pick up some nice cuts of steak for the cheap."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Apple accused of discrimination for telling employee to stop wearing jewellery supporting Gaza",
            "external_url": "https://www.abc.net.au/news/2025-03-13/apple-accused-discrimination-jewellery-supporting-gaza/105042996",
            "upvotes": 661,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/2b158d5aa18917d229c4f2bd195f2dbf?impolicy=wcms_watermark_news&cropH=2354&cropW=4185&xPos=414&yPos=1147&width=862&height=485&imformat=generic",
            "top_comments": [
                "IANAL in Aus, but usually private companies can have uniform policies. They have a right to protect the brand..",
                "Im sure some coworker or customer complained that this person was supporting terror.",
                "[deleted]",
                "How is telling someone to not wear political wear discrimination?",
                "> in the shape of historic Palestine\n\nLOL\n\nAnyway, in spite of such jokes, the fact that his coworkers were scared of him and multiple people accuse him of antisemitism says that maybe this wasn't just about the Free Palestine bracelet and the Palestine necklace.\n\nI wonder what the viewpoints of his managers and coworkers are.  They didn't seem to be quoted anywhere.",
                "Your beliefs on your own time. You’re paid to work not politicize the office. This is just basic rules that have always been in effect. It’s just these days it needs to be spoken aloud or written in a handbook for those with less common sense and self awareness. \nWork is hard enough without having people bicker over personal stuff.",
                "Let's see them tell employees to stop wearing star of David necklaces and see how well that goes for them.",
                "Why? Keep your politics outside when you're at work. Honestly, the most insufferable people are those that wear their politics on their sleave at all times, like some sort of a martyr or virtue badge at work.",
                "This could raise questions about workplace policies on political expression and how they balance with anti-discrimination laws.",
                "Imagine the reaction if the had banned a cross,  star of David, or the moon and star ...."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Influencer who snatched baby wombat leaves Australia",
            "external_url": "https://www.abc.net.au/news/2025-03-14/sam-jones-baby-wombat-video-leaves-australia/105051630",
            "upvotes": 1159,
            "date": "03/14/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/cfd3459afa4febabed3f2ab124a7eb6c?impolicy=wcms_watermark_news&cropH=336&cropW=597&xPos=0&yPos=45&width=862&height=485&imformat=generic",
            "top_comments": [
                "*On her profile, she describes herself as a \"wildlife biologist and environmental scientist\", an \"outdoor enthusiast\" and a hunter*.\n\nthe only thing i believe is the hunter part",
                "Can we stop calling them Influencers and just refer to them as attention seeking idiots?",
                "She went from something like 2k followers to almost 100k. Thats completely gross. She got exactly what she wanted.",
                "Nothing but ignorance.  Imagine gaining notoriety through lack of decency and pure stupidity.",
                "Insert Australian Northern Territory tourism slogan here.",
                "should not have been allowed to leave the country without paying some sort of fine imo",
                "These influencers should be banned from having any form of social media etc when they pull shit like this. That’s the only way to stop them doing shit for attention.",
                "> Influencer\n\nI don’t remember cunt being spelled with so many letters. ",
                "Can we not allow her back in the US?",
                "Embarrassing for Montana and Americans."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Federal Cuts Prompt Johns Hopkins to Cut More Than 2,000 Workers",
            "external_url": "https://www.nytimes.com/2025/03/13/us/trump-cuts-johns-hopkins-university-layoffs.html?unlocked_article_code=1.304.EFUS.chI-h1pFmD5L&smid=nytcore-android-share",
            "upvotes": 847,
            "date": "03/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So this is what so called conservatives completely miss in the fed cut conversation. Absolutely no concept of the multiplier effect of government spending. At this point I’m convinced that they fall into one of two camps:  The truly clueless and the 1% who are trying to intentionally drive markets into the dirt so they can snatch up the bargains.",
                "Someone who needed medical care might die. But hey - those three trans kids in the entire state of Idaho won’t get to play sports so worth it, amiright?",
                "Hey let’s screw up the best medical research hospital in the whole freaking world. That sounds like a great idea! /s",
                "There's going to be so many down stream job losses from this. Most of these cuts were well paid middle-class jobs. How many restaurants, landscapers, maids and pretty much anything that's not a basic need might go under because they just lost 10-20% of their business? And how many more from those going out of business?",
                "I am still mind blown the first six weeks have been almost entirely about cutting good American jobs. I will never understand how people voted for this",
                "Only 3 years and 10 more months of disaster left.   \n\nHopefully we still have a country left by then",
                "This is like refusing to water a tree that will later provide fruit and shade.",
                "Are we great again yet?",
                "Hey, but they made that kid an honorary secret service member or whatever. Why aren't y'all clapping more?!",
                "2000 more families with upended lives"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Stolen Telsa Driven Into Calgary's Bow River",
            "external_url": "https://www.ctvnews.ca/calgary/article/stolen-tesla-drives-into-calgarys-bow-river/",
            "upvotes": 1953,
            "date": "03/14/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/7NJBAQJO55GNXGZG6UFHZFJJII.jpg?smart=true&auth=e1c5e4cc13c4389c09c1ec0bcef5d14b5d5b30e87b077fae33bc714ad315e432&width=1200&height=630",
            "top_comments": [
                "The driver had to make quick decision: Should I be electrocuted by the batteries or be eaten by the Bow River sharks.",
                "Are they sure it wasn’t the self driving software?",
                "[removed]",
                "I hope Elon loses another 30 billion this week ….",
                "Just put that shit in some rice",
                "Prayers up for the river",
                "It's not stolen, its just returning to the stream to spawn.",
                "Boston Harbour  might have made a bigger.......splash!",
                "Performance art of Telsa's stock sinking.",
                "Ah yes. A \"stolen\" Tesla. \nDefinitely not a Tesla owner living with regret and a car they can't sell. \n\n\nTotal conjecture on my part. But I'm suspicious. "
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Trump asks Supreme Court to allow him to end birthright citizenship | CNN Politics",
            "external_url": "https://www.cnn.com/2025/03/13/politics/birthright-citizenship-trump-supreme-court/index.html",
            "upvotes": 31112,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2198243247-1.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So, that requires an amendment. Does anyone have a copy of The Constitution For Dummies?",
                "If the Supreme Court says anything but no, there should be secession. Explicit text requires an amendment to undo.",
                "If they say “yes” to him, Then the constitution no longer matters.",
                "Immigrants are bad except when a rogue immigrant billionaire wants to destroy the country.",
                "There's an insidious corollary, of course. If\n\n> the benefit applies only to people who are “subject to the jurisdiction” of the United States. Immigrants in the country illegally, the theory goes, are subject to the jurisdiction of their native homeland. \n\nthen people in the country illegally aren't subject to the laws of the US, and they can be treated in any manner the administration decides.",
                "Does that mean we can deport Cuban-canadian and birthright citizen Ted Cruz? Please?",
                "To which, in a just world, they would reply: Fuck off",
                "If this one goes through supreme court, IT IS OVER for democracy in USA. Officially a Tyrannical government. \n\nInterpretation of words in the constitution like the president sees fit. Tomorrow it could mean the 1st and 2nd amendment which are also being challenged. \n\nRise up americans.",
                "We shouldn't be laughing at this. We've been laughing at things like this before.\n\nThen they happened for real.",
                "Just so everyone is aware, if you look up [the 14th amendment, the very first sentence is](https://constitution.congress.gov/constitution/amendment-14/):\n\n> **All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.** No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\n\nIt does not get any clearer than that. If this is anything except a unanimous \"go fuck yourself\", we've got a (yet another) constitutional crisis on our hands."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Judge Chutkan demands ‘some kind of evidence’ from Trump’s EPA to halt climate grants. \"You can't even tell me what the evidence of malfeasance is.\"",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/13/epa-grants-trump-judge-tanya-chutkan",
            "upvotes": 4979,
            "date": "03/13/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a06c5b96b2d43f44495a018ab9f5b673dccd439f/0_80_5410_3245/master/5410.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=26fe43c2241b4b05506a2da652e15a4b",
            "top_comments": [
                "They run the House, the Senate, the Supreme Court, and the presidency and this fucking dipshit still can't get anything done despite using executive orders for everything.",
                "Because they're making shit up.",
                "Conservatives: The rules were you weren't going to fact-check!",
                "The don't know what malfeasance means so ...",
                "“Your honor, we are under direct orders by President Trump to bombard the courts with bullshit cases and see what sticks.”",
                "Please, I'm begging the justice system to stop giving endless deference to this mindless legal nonsense.\n\nJust ask them for evidence, and when they don't provide it, pound the gavel and send them  packing.",
                "\"Evidence is for losers.\"\n\n--Donald Trump",
                "The sad part is that we have One Judge Chutkan for every 4 Judge Cannons. \n\nAll they have to do is shift it to the right court and they will get whatever they want.",
                "An oil tycoon is running the EPA what do you think his agenda is.",
                "Odds are he doesn't even know what \"malfeasance\" is, no matter that his very existence drips with it."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Judge orders Trump administration to reinstate thousands of fired employees at VA, Defense Department and other agencies",
            "external_url": "https://www.cnn.com/2025/03/13/politics/judge-opm-probationary-employees-fired-hearing",
            "upvotes": 13317,
            "date": "03/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/judge-alsup-with-book-crop.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This will fast track to SCOTUS",
                "Doge is now claiming they had nothing to do with it. What a massive mess. \n\nThis is just costing US taxpayers more money. \n\nI do know for the US Forest Service and the National Park Service, is this early part of the year is critical planning time to get ready for summer visitation. \n\nInstead, key employees weren’t in the office. Now they’ll get paid for the time but none of their critical responsibilities have been completed. \n\nThe National Parks had their highest visitation ever in 2024. They need more employees now, not fewer. \n\nI imagine the National Forest visitation is similarly at record levels.",
                "You know what would make the federal government lean and efficient? A competent leader. \n\nOne who understands basic bureaucracy and the fundamentals of representative democracy well enough to administer an entire nation for the benefit of the whole constituency. The Musk/Trump administration doesn't even care about the people who elected them into office to make the distinctions during this power grab.",
                "Constitutional crisis if the felon doesn't follow the order.",
                "Trump is the opposite of the saying, \"When uou do things right, people won't be sure you've done anything at all.\"  Like love or hate, Biden, all you want, at least for 4 years, we didn't have to deal with new shit every day.",
                "I get the feeling of \"well the courts won't follow through\" etc. And yes, the Supreme Court is a vile corrupt pack of trash.\n\n\nBut don't underestimate the individual egos of judges as they watch their authority undermined time and time again by this administration. It's all too late but just like the business leaders seeing the economic devastation Trump is causing and finally coming around, many judges are starting to realize that Trump is trying to make them powerless and obsolete. They're like cops, they'll protect their own. And there's a potential tipping point here.",
                "They probably already shredded the records like they’ve been doing with other agencies.",
                "From the news, it seems that the judges are the only ones willing to fight back against this dictator while the Congress has completely bended the knee to him. His priority now is to have the supreme court bend the knee to him and he can finally become the autocrat he always wanted to be. The supreme court is the final line of defense, now. Let's see how it goes.",
                "This is why DOGE was deleting records and shredding paperwork. By mass deleting everything to non recoverability, they can’t actually rehire anyone because they have no paperwork to enable them to do so. It was a deliberate choice to destroy those records just in case they were forced to reinstate them, or if they were all thrown out of office and new management took over.",
                "That’s all great and all but. Or else what? trump broke a lot of laws and? And what?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "White House withdraws CDC director nomination just before his Senate confirmation hearing",
            "external_url": "https://www.nbcnews.com/politics/trump-administration/white-house-pulls-cdc-director-nomination-day-confirmation-hearing-rcna196208",
            "upvotes": 7511,
            "date": "03/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-11/241125-Dave-Weldon-2-aa-234p-7a721e.jpg",
            "top_comments": [
                "*\"he defended the work of Andrew Wakefield, the British physician who published a study that falsely claimed the vaccine for measles, mumps and rubella causes autism.\"*\n\nYeah.",
                "> In a lengthy statement, Weldon said he assumed the White House withdrew his nomination because Sen. Susan Collins, R-Maine, had reservations, and Cassidy also planned to vote against him. \n\nOK, that's the excuse. What's the real reason? Because I find it hard to believe Collins having \"reservations\" is ever a showstopper.",
                "They probably found someone who is worse for the job. Maybe a redneck grandmother who will provide universal castor oil and exorcisms mental health issues. ",
                "If his past comments had just stuck to Nazi adoration and glorifying sexual assault, he would have made it through!",
                "Guess you're only allowed to say that vaccines cause autism if your last name is Kennedy or Trump.",
                "Im assuming a better candidate (Kid Rock probably) has become available.",
                "What happened, did it turn out that he was qualified for the job?",
                "That's a face that says \"I just woke up and I have no idea what's going on.\"",
                "Must've accidentally once Tweeted, \"I don't think people should get sick.\"",
                "This administration really exudes competence"
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "03/14/2025 12:14:53 UTC"
}