{
    "posts": [
        {
            "category": "HOT",
            "title": "White House denies defying judge's order over deportations to El Salvador",
            "external_url": "https://www.bbc.co.uk/news/articles/cr5219ezjrpo",
            "upvotes": 11352,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bfbd/live/8481df30-0331-11f0-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "Alternative facts. Their own DOJ memo indicated that they were aware that they were violating the judges orders.",
                "\"The [court] order, which had no lawful basis,...\" - WH Press Secretary\n\nThey're openly trying to suggest that federal courts have no legal basis to adjudicate. This is insane.",
                "It’s pretty clear he doesn’t listen to the courts anymore. He also had a Lebanese medical doctor / professor with a valid visa deported for no apparent reason, against a judge’s explicit order: https://www.cnn.com/2025/03/17/us/brown-university-doctor-deported-hnk/index.html",
                "So we’re there. “Let them enforce it” is now reality.",
                "Even if they acknowledge defying the judges orders, what are we expecting the judges/judicial system to do to him? He never has to deal with any consequences of doing illegal things, no one is going to start imposing consequences on him now at this level. I don't think the government is equipped to deal with a president who just straight up defies laws.",
                "The most dangerous people to our country (world?) are the current administration.\n\nThe call is coming from inside the WH, and it doesn't appear that anyone plans on stopping them. \n\nDeflection and projection is their game.",
                "Ah we're at the we didn't do that stage, soon to be at the we did it but they deserved it stage...",
                "How does this administration manage to chose the absolute wrong side of every single issue? They would be better if they just flipped a coin.",
                "They'd probably have a better case to make if our dipshit Secretary of State wasn't laughing about it on Twitter",
                "So if I'm understanding this entire situation correctly, the Trump Administration initiated an 18th century Act, corralled a bunch of alleged \"gang members\" (I'm putting this in quotes because literally nobody even verified they really were gang members, but that's not the point here), violated their due process (this is the point here!), loaded them on a plane WHILE this situation was being reviewed by a judge, let that plane take off while this situation was being ruled on by a judge, then claimed \"Oops, well the plane already left before the ruling so therefore it doesn't count AND we didn't defy a court order!\"?\n\nAnd we are supposed to believe this wasn't done maliciously? They knew the judge was ruling on this situation. They knew they could have had the plane wait until the ruling came down to have it deport these people IF it was legal. They knew what they were doing was illegal anyways. **They still did it**.\n\nLet me also be clear, this is not about gang members. If these people truly were members of a Venezuelan gang, then go through due process AND THEN deport them. Same result. This is about pushing our due process to it's limits to see what you can get away with, then justifying it with \"Oh well it was gang members, you don't want gang members here DO YOU?\", and the entire point is \"How do WE know they were gang members if you rounded them up and deported them without any due process?\".\n\nTHAT'S THE ENTIRE POINT. This is how they're allowed to make people disappear, because they are violating your rights and using the cover of \"it's gang members!\" to do it, just like previous administrations did with \"Oh they're terrorists!\"."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "Black Medal of Honor recipient removed from US Department of Defense website",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/16/defense-department-black-medal-of-honor-veteran",
            "upvotes": 64271,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "*On Saturday, US army Maj Gen Charles Calvin Rogers’s Medal of Honor webpage led to a “404” error message. The URL was also changed, with the word “medal” changed to “deimedal”.*",
                "Changing “medal” to “deimedal” in the url is so fucking gross",
                "Erasing the heroic accomplishments of black Americans is certainly not going to “Make America Great Again.” Hopefully no one is still fooled by what is going on here.",
                "[deleted]",
                "What’s funny is that MAGA loves Clarence Thomas who is 100% a DEI judge picked to replace Thurgood Marshall.",
                "It's actually real. Try going to https://www.defense.gov/News/Feature-Stories/Story/Article/2824721/medal-of-honor-monday-army-maj-gen-charles-calvin-rogers/\n\n the URL redirects to \"deimedal\"",
                "This has nothing to do with DEI even though MAGA thinks it does. This medal was given under Nixon, their ultra racist hero.",
                "I am waiting for veterans to be pissed off really bad...",
                "This makes me so angry I have no words. ",
                "Where the \"support our troops\" crowd at now?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Severe weather disaster: 40 dead after destructive tornadoes, wildfires and dust storms, sweep across US",
            "external_url": "https://www.accuweather.com/en/severe-weather/severe-weather-disaster-40-dead-after-destructive-tornadoes-wildfires-and-dust-storms-sweep-across-us/1754990",
            "upvotes": 962,
            "date": "03/17/2025",
            "thumbnail": "https://cms.accuweather.com/wp-content/uploads/2025/03/GettyImages-2204764243.jpg?w=768",
            "top_comments": [
                "And we want to cut back government aid for these families in crisis",
                "Have the dust storms started already? Getting an early start to the depression era",
                "Yeah, but did you hear that Trump won a golf tournament at one of his clubs?",
                "From what I understand..\n\nMy no contact MAGA parents are currently blaming NASA. The logic being, NASA is angry about DOGE cuts and SpaceX that they are \"manufacturing bio-engineered storms to attack America. And only Donald Trump can save us\". \n\nThese are educated people whose brain broke in 2008 when a brown man became president. I just can't deal with them.",
                "A widespread and violent storm system has claimed at least 40 lives across seven states as of Monday, with additional fatalities emerging in Oklahoma. Sunday was the third day in a row that severe storms packing destructive winds, large hail, tornadoes and flooding downpours target over 20 states and 150 million people.",
                "This is just the start of it.  Climate change is only going to worsen.",
                "reminder that they actively nerfed fema and the NOAA",
                "Luckily these are the states that voted for the guy who cut FEMA so they will receive all the help they wanted.",
                "We really should consider deporting extreme weather since it kills more Americans than immigrants do.",
                "Fortunately these people have voted for their savior to cut all the help they could have gotten."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Michigan boy's death raises concerns about unregulated hyperbaric oxygen therapy",
            "external_url": "https://www.nbcnews.com/news/us-news/-michigan-boys-death-raises-concerns-hyperbaric-therapy-rcna196260",
            "upvotes": 1176,
            "date": "03/17/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250313-Hyperbaric-chamber-Oxford-Center-Thomas-Cooper-aa-1225-83c28d.jpg",
            "top_comments": [
                "Regulation is written in blood.",
                "The part that kills me is it takes all of 20 seconds to figure out that this stuff doesn't work.  And yet all it takes to find suckers is to say they're lying to you! And now you will find scads of people who now believe anything you say.  \n\n\nSpeaking of which,  I have found the cure for depression, insomnia,  headaches,  erectile dysfunction,  baldness and cancer! But the greedy medical establishment doesn't want my miracle cure all to be sold because it'd put them out of business. PM for details!",
                "I mean the fact they were promoting it for ADHD, and ED cures just for patients to come in (ped the owner lying) is pretty insane. It needs to be regulated so idiots like this don't keep doing this. Oxygen is a drug and needs to be prescribed correctly",
                "There is a cult/wacko group that believes and promotes the rich and/or government have suped up \"medical beds\" that can instantly cure any aliment.\nThese snake oil salesmen are playing off that thread of desperation.\nRegulation might help, but we need education...and frankly I would suggest regulation for the people advocating and promoting agreed conspiracies.",
                "We humans really have to stop pretending like we're special and have found some secret trick or cure that \"they\" have been hiding from us.  We never will, we all think we're special, and have somehow gained secret knowledge from a YouTube commercial or some influencer or podcaster (where the secret knowledge is usually kept).  \n\nTo quote Tim Minchin: \"alternative medicine, by definition, has either not been proved to work or has been proved not to work.  You know what they call alternative medicine that's been proved to work?  Medicine.\"",
                "[deleted]",
                "They did Apollo 1 to a child.",
                "Anti-science, conservative, partisan rhetoric is cooking peoples' brains. Fully being deep-fried by the matrix.",
                "Oh, so the Deadpool therapy doesn’t work?",
                "So was this a real one or a rinky dink private clinic one (huge difference in pressure)? For either, the owners are constantly trying to expand their use and make them first-line treatment to get their investment back (I swear, MGH would use proton beam for runny noses if they could get away with it)."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Houthi missile, drone attack on U.S. Navy ships failed, official says",
            "external_url": "https://abcnews.go.com/International/houthi-missile-drone-attack-us-navy-ships-failed/story?id=119863896",
            "upvotes": 1112,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/82304d7d-3ace-4e06-aac9-6df1e5d5ebea/F18-Red-Sea-DB-250317_1742197821049_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Don't touch the boats!",
                "\"A U.S. official told ABC News that the Houthis fired 11 drones and one ballistic missile, none of which came close to hitting any U.S. vessels.\n\nAll drones were downed by fighters -- 10 shot down by Air Force planes and one by Navy planes -- while the ballistic missile was not intercepted as it fell far short of the vessels, the official said.\" \n\n-lol",
                "I would say they'll have better luck next time, but now that the navy knows they're serious, they may not exist much longer.",
                "*Throws sandle at tank* \"THAT'LL TEACH THEM!\" ",
                "Why are we bombing them rn? Are they still attacking commercial shipping going through the area?",
                "Those anti drone missles cost hundreds of thousands to millions to make. The houthis drones cost under $1000 each. Just to put this into perspective.",
                "How did any country or group have the courage to attack the US military while Trump is in office? I thought everyone feared and respected him?",
                "Why are we fighting Israel's war with Yemen? To secure the Trump/Gaza strip mall and casino? We are risking US servicemen's lives for Trump and Jared Kushner's new real estate venture? Is that what y'all voted for? ",
                "Agh, so the jenus started another war in order to support Israel?",
                "So the Navy ships didn't fail, the drones did. Wow that's a great title."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Brown Medicine professor, doctor deported to Lebanon despite having valid visa, court filings claim",
            "external_url": "https://www.nbcnews.com/news/us-news/brown-medicine-professor-doctor-deported-lebanon-valid-visa-court-fili-rcna196638",
            "upvotes": 9390,
            "date": "03/17/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-04/230424-brown-university-al-1003-908a6b.jpg",
            "top_comments": [
                "There’s a fellow in our office from Mexico who is winding down his time here in preparation for his medical residency. I just found out he has to go back home to update his visa from doing his service hours with us, to one for his residency. I worry that there will be “some problem or the other” and he won’t be let back in and there goes one more good man and good young doctor.",
                "You got a PhD? Gtfo.  \n\n\nYou got $5 mil? Come on in!",
                "As long as the machine is designed to vilify and persecute and see enemies everywhere, we are going to keep seeing innocent victims caught up in its teeth. ",
                "We have a deep Lebanese community and a need for doctors here in Canada!",
                "Watch immigration officers not let her back in for some bullshit reason.",
                "> “Our CBP Officers adhere to strict protocols to identify and stop threats, using rigorous screening, vetting, strong law enforcement partnerships, and keen inspectional skills to keep threats out of the country,” Hilton Beckham, CBP’s assistant commissioner of public affairs, said in the statement. \n\nSo… what was the threat here?\n\nI’m getting “ocular pat down” vibes from that sentence.",
                "Wouldn’t be surprised if she never comes back, can’t blame her. The brain drain we are seeing is gonna be legendary, except in a terrifying way. ",
                "Another court order ignored. Wonderful.",
                "Oh yes, get rid of doctors. \n\n\nThat's totally not going to blow up in our faces.\n\n\n\nIs the government going to make a list of people who know multiple languages and wear glasses next?",
                "The US is so short on professionals doing her position, that frankly even if she didn't have a valid visa the correct answer should be \"figure out how to get this critical professional a visa,\" not deport them.\n\nThis is of course assuming the government cares about its people, which the current admin does not."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "HOT",
            "title": "Finland turns down US request for eggs",
            "external_url": "https://yle.fi/a/74-20149786",
            "upvotes": 31070,
            "date": "03/16/2025",
            "thumbnail": "https://images.cdn.yle.fi/image/upload/c_crop,x_0,y_0,w_1597,h_901/w_1200,ar_1.91,c_fill/q_auto:eco,f_auto,fl_lossy/v1723193249/39-133049966b5d6a6d2abd",
            "top_comments": [
                "Maybe JD didn’t say please",
                "So let me get this straight....\n\nYou expect to get something you need from someone you've pissed off?",
                "”US authorities have turned to Europe for help with the country's severe egg shortage. The shortfall is due to bird flu, which has plagued the United States for several years.\n\nThe Finnish Poultry Association says it has been contacted about exporting eggs to the US. The organisation's executive director, Veera Lehtilä, told Yle on Saturday that exporting eggs does not seem to be possible at the moment because no market access negotiations have been held with US authorities. This can be a drawn-out process involving extensive inspections and studies.”",
                "1. Fuck everyone, we’re not subsidizing any of you anymore, you’re not even a real country, America first, USA, USA, etc. etc.\n\n2. Can we have some eggs please? \n\n\nCan’t make this shit up.",
                "There is little to no goodwill left for the US in Europe. No eggs for you. \n\n\nThe US spent 80 years building up their role as a big brother to the western world, recognized as the leader of the free world.\n\n\nIt took Trump 3 weeks to destroy its reputation, and it will probably take several generations to make it \"great again\" ",
                "Coming soon: *\"Nasty people in Finland, maybe we're looking at it becoming a US state...\"*",
                "Imagine how much cheaper things would get if we just worked with allies instead of pissing them off.\n\nIt’s all a show. The current administration has no plans on making the lives of Americans better. Same with doge. Cost cutting that cuts 02% of federal budget. America strong economic policy that makes us weak.",
                "You could ask Canada... oh, wait.",
                "You don’t have the cards",
                "Any dealings in that magnitude has to be done through an EU negotiated trade agreement. \nAnd considering that the US has just started a trade war with the EU and threatens to invade EU territory.. that's gonna be a no from us dawg."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "A Spending Freeze at the FDA Threatens Safety of Food Supply, Current Staffers Say - Consumer Reports",
            "external_url": "https://www.consumerreports.org/health/food-safety/fda-spending-freeze-threatens-safety-of-food-supply-a7676246448/",
            "upvotes": 269,
            "date": "03/17/2025",
            "thumbnail": "https://article.images.consumerreports.org/image/upload/t_article_tout/v1741207022/prod/content/dam/CRO-Images-2025/Special%20Projects/CR-SP-InlineHero-Cuts-at-FDA-are-putting-consumers-at-risk-0325",
            "top_comments": [
                "Oh awesome, simple awesome\n\n\nInfant formula factories, really good stuff\n\n\nKilling Americans for no reason, awesome president no notes",
                "But according to RFK Jr the real threat is the riboflavo-something (he can't pronounce it) he saw on the ingredient list.",
                "Thankfully eating food is optional so its safety is a luxury more than a requirement /s",
                "If Trumpers had any brains, they’d be protesting right now. ",
                "For anyone interested. The FDA posts recalls on their webpage and you can see there are a few food recalls every week across the nation. Things like listeria, elevated levels of lead/arsenic, or other contamination. Just google FDA Recalls and then you can go sort based on drug/food/device/ etc\n\nI would imagine that if foods are not being purchased for testing then there would be a gap in reporting recalls as well as holding manufacturers accountable for physically taking their product off the shelf. The reporting appears consistent and up to date with the most recent recall being 3/17.",
                "I guess the new administrations way of doing it is to let the people be Guinee Pigs.  If a whole bunch die THEN check and see if the product is bad.\n\n\"Some FDA employees say they now feel dangerously unprepared for any new outbreak emergency. And some say that if the current situation continues, all food testing could come to a halt.\"",
                "This is why I started a vegetable garden in February. It is not to late to start your own now.",
                "Some of you may die, but that is a sacrifice I’m prepared to make….",
                "Yes let's pause spending at the FDA while bird flu is ravaging flocks of chickens",
                "One more reason I don't want food from the USA. Unsafe!!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Greek government debt raised to investment grade by Moody's, closing the door on a painful era",
            "external_url": "https://apnews.com/article/greece-moodys-debt-credit-rating-politics-7b9f0902d0d858323b1998aec52e11a0",
            "upvotes": 3776,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Holy cow I never thought I'd be alive to see this. I wonder if the economy will ever rebound to the point where Greeks move back.",
                "And soon enough US bonds will be downgraded by Moody’s. So that’s neat!",
                "Praise be to [**Plutus**](https://en.wikipedia.org/wiki/Plutus)",
                "\"So Greece is insolvent?\"  \n\"Brian, put it this way. If it were a privately owned company there'd be a fire there on Saturday about 4 o' clock in the morning.\"",
                "An era exacerbated by a discredited study centered around a spreadsheet using flawed math.",
                "Cool! I can now invest at a Nick the Greek franchise",
                "What does this mean exactly for us that are financially illiterate?",
                "Don’t forget that they got there and it took this long to recover because they implemented austerity measures. You know, like Trump is trying to do despite congress being responsible for funding.",
                "it's a AAA trenche.\n* In \"ridiculously hot girl in a bathtub with a flute of Moet\" voice",
                "Lower tzatziki prices?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "India-New Zealand: Free trade talks relaunched after a decade",
            "external_url": "https://www.bbc.com/news/articles/cn4yvp739m2o",
            "upvotes": 303,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/5283/live/d8cb98e0-031a-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "India is one of the most protectionist countries. I’m guessing they’re only considering free trade with NZ because NZ doesn’t really have any exports that could compete in India.",
                "aaaaaand India is already asking New Zealand to quash free speech because modi finds it upsetting.  \n\n[India shares concerns over growing activities of Khalistani elements in New Zealand](https://www.wionews.com/india-news/india-rings-alarm-bells-over-growing-khalistan-issue-to-new-zealand-8862638)",
                "Ask them to leave Brics and let's create something better for the world, maybe with China and Brazil too?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Forever 21 files for bankruptcy again, plans to close all US stores",
            "external_url": "https://www.denver7.com/business/company-news/forever-21-files-for-bankruptcy-again-plans-to-close-all-us-stores",
            "upvotes": 1,
            "date": "03/17/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/5071f19/2147483647/strip/true/crop/1000x525+0+71/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F7b%2Fb6%2F2d90f847436d8f13ff42e436582e%2Fshutterstock-2156779941.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "A Spending Freeze at the FDA Threatens Safety of Food Supply, Current Staffers Say - Consumer Reports",
            "external_url": "https://www.consumerreports.org/health/food-safety/fda-spending-freeze-threatens-safety-of-food-supply-a7676246448/",
            "upvotes": 271,
            "date": "03/17/2025",
            "thumbnail": "https://article.images.consumerreports.org/image/upload/t_article_tout/v1741207022/prod/content/dam/CRO-Images-2025/Special%20Projects/CR-SP-InlineHero-Cuts-at-FDA-are-putting-consumers-at-risk-0325",
            "top_comments": [
                "Oh awesome, simple awesome\n\n\nInfant formula factories, really good stuff\n\n\nKilling Americans for no reason, awesome president no notes",
                "But according to RFK Jr the real threat is the riboflavo-something (he can't pronounce it) he saw on the ingredient list.",
                "Thankfully eating food is optional so its safety is a luxury more than a requirement /s",
                "If Trumpers had any brains, they’d be protesting right now. ",
                "For anyone interested. The FDA posts recalls on their webpage and you can see there are a few food recalls every week across the nation. Things like listeria, elevated levels of lead/arsenic, or other contamination. Just google FDA Recalls and then you can go sort based on drug/food/device/ etc\n\nI would imagine that if foods are not being purchased for testing then there would be a gap in reporting recalls as well as holding manufacturers accountable for physically taking their product off the shelf. The reporting appears consistent and up to date with the most recent recall being 3/17.",
                "I guess the new administrations way of doing it is to let the people be Guinee Pigs.  If a whole bunch die THEN check and see if the product is bad.\n\n\"Some FDA employees say they now feel dangerously unprepared for any new outbreak emergency. And some say that if the current situation continues, all food testing could come to a halt.\"",
                "This is why I started a vegetable garden in February. It is not to late to start your own now.",
                "Some of you may die, but that is a sacrifice I’m prepared to make….",
                "Yes let's pause spending at the FDA while bird flu is ravaging flocks of chickens",
                "One more reason I don't want food from the USA. Unsafe!!"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Severe weather disaster: 40 dead after destructive tornadoes, wildfires and dust storms, sweep across US",
            "external_url": "https://www.accuweather.com/en/severe-weather/severe-weather-disaster-40-dead-after-destructive-tornadoes-wildfires-and-dust-storms-sweep-across-us/1754990",
            "upvotes": 960,
            "date": "03/17/2025",
            "thumbnail": "https://cms.accuweather.com/wp-content/uploads/2025/03/GettyImages-2204764243.jpg?w=768",
            "top_comments": [
                "And we want to cut back government aid for these families in crisis",
                "Have the dust storms started already? Getting an early start to the depression era",
                "Yeah, but did you hear that Trump won a golf tournament at one of his clubs?",
                "From what I understand..\n\nMy no contact MAGA parents are currently blaming NASA. The logic being, NASA is angry about DOGE cuts and SpaceX that they are \"manufacturing bio-engineered storms to attack America. And only Donald Trump can save us\". \n\nThese are educated people whose brain broke in 2008 when a brown man became president. I just can't deal with them.",
                "A widespread and violent storm system has claimed at least 40 lives across seven states as of Monday, with additional fatalities emerging in Oklahoma. Sunday was the third day in a row that severe storms packing destructive winds, large hail, tornadoes and flooding downpours target over 20 states and 150 million people.",
                "This is just the start of it.  Climate change is only going to worsen.",
                "reminder that they actively nerfed fema and the NOAA",
                "Luckily these are the states that voted for the guy who cut FEMA so they will receive all the help they wanted.",
                "We really should consider deporting extreme weather since it kills more Americans than immigrants do.",
                "Fortunately these people have voted for their savior to cut all the help they could have gotten."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Thames Water wins court approval in London for emergency funding deal",
            "external_url": "https://apnews.com/article/britain-thames-water-emergency-funding-fa1bcf9f4cbb023cb21b1ad770d66582",
            "upvotes": 100,
            "date": "03/17/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Sounds like \"Corporate socialism\" to me: company get billions from a government to improve supply of a necessity to people, company gives that money to shareholders and then goes back to government to dig it out of the hole the company created.",
                "This is the bullshit banking Bailout allover again.....",
                ">Consumers and politicians have criticized the company, arguing that Thames Water created its own problems by paying overly generous dividends to investors and high salaries to executives while failing to invest in pipelines, pumps and reservoirs. Company executives say the fault lies with regulators who kept bills too low for too long, starving the company of the cash it needed to fund improvements.\n\nHow could a cash starved company pay overly generous dividends and executives' high salaries? \nI think such a badly run company should become bankrupt, mae investors' shares worthless and the government buy it out for £1.",
                "Unwilling Thames Water customer here : Re-Nationalise it without compensation and hunt down and sequester the funds of the Boardroom members which caused this all nonsense since privatisation.\n\nWill Thatcher acolyte Starmer's Government  do any of that - of course not - too busy persecuting the disabled to pay attention."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "White House denies defying judge's order over deportations to El Salvador",
            "external_url": "https://www.bbc.co.uk/news/articles/cr5219ezjrpo",
            "upvotes": 11344,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bfbd/live/8481df30-0331-11f0-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "Alternative facts. Their own DOJ memo indicated that they were aware that they were violating the judges orders.",
                "\"The [court] order, which had no lawful basis,...\" - WH Press Secretary\n\nThey're openly trying to suggest that federal courts have no legal basis to adjudicate. This is insane.",
                "It’s pretty clear he doesn’t listen to the courts anymore. He also had a Lebanese medical doctor / professor with a valid visa deported for no apparent reason, against a judge’s explicit order: https://www.cnn.com/2025/03/17/us/brown-university-doctor-deported-hnk/index.html",
                "So we’re there. “Let them enforce it” is now reality.",
                "Even if they acknowledge defying the judges orders, what are we expecting the judges/judicial system to do to him? He never has to deal with any consequences of doing illegal things, no one is going to start imposing consequences on him now at this level. I don't think the government is equipped to deal with a president who just straight up defies laws.",
                "The most dangerous people to our country (world?) are the current administration.\n\nThe call is coming from inside the WH, and it doesn't appear that anyone plans on stopping them. \n\nDeflection and projection is their game.",
                "Ah we're at the we didn't do that stage, soon to be at the we did it but they deserved it stage...",
                "How does this administration manage to chose the absolute wrong side of every single issue? They would be better if they just flipped a coin.",
                "They'd probably have a better case to make if our dipshit Secretary of State wasn't laughing about it on Twitter",
                "So if I'm understanding this entire situation correctly, the Trump Administration initiated an 18th century Act, corralled a bunch of alleged \"gang members\" (I'm putting this in quotes because literally nobody even verified they really were gang members, but that's not the point here), violated their due process (this is the point here!), loaded them on a plane WHILE this situation was being reviewed by a judge, let that plane take off while this situation was being ruled on by a judge, then claimed \"Oops, well the plane already left before the ruling so therefore it doesn't count AND we didn't defy a court order!\"?\n\nAnd we are supposed to believe this wasn't done maliciously? They knew the judge was ruling on this situation. They knew they could have had the plane wait until the ruling came down to have it deport these people IF it was legal. They knew what they were doing was illegal anyways. **They still did it**.\n\nLet me also be clear, this is not about gang members. If these people truly were members of a Venezuelan gang, then go through due process AND THEN deport them. Same result. This is about pushing our due process to it's limits to see what you can get away with, then justifying it with \"Oh well it was gang members, you don't want gang members here DO YOU?\", and the entire point is \"How do WE know they were gang members if you rounded them up and deported them without any due process?\".\n\nTHAT'S THE ENTIRE POINT. This is how they're allowed to make people disappear, because they are violating your rights and using the cover of \"it's gang members!\" to do it, just like previous administrations did with \"Oh they're terrorists!\"."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Michigan boy's death raises concerns about unregulated hyperbaric oxygen therapy",
            "external_url": "https://www.nbcnews.com/news/us-news/-michigan-boys-death-raises-concerns-hyperbaric-therapy-rcna196260",
            "upvotes": 1176,
            "date": "03/17/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250313-Hyperbaric-chamber-Oxford-Center-Thomas-Cooper-aa-1225-83c28d.jpg",
            "top_comments": [
                "Regulation is written in blood.",
                "The part that kills me is it takes all of 20 seconds to figure out that this stuff doesn't work.  And yet all it takes to find suckers is to say they're lying to you! And now you will find scads of people who now believe anything you say.  \n\n\nSpeaking of which,  I have found the cure for depression, insomnia,  headaches,  erectile dysfunction,  baldness and cancer! But the greedy medical establishment doesn't want my miracle cure all to be sold because it'd put them out of business. PM for details!",
                "I mean the fact they were promoting it for ADHD, and ED cures just for patients to come in (ped the owner lying) is pretty insane. It needs to be regulated so idiots like this don't keep doing this. Oxygen is a drug and needs to be prescribed correctly",
                "There is a cult/wacko group that believes and promotes the rich and/or government have suped up \"medical beds\" that can instantly cure any aliment.\nThese snake oil salesmen are playing off that thread of desperation.\nRegulation might help, but we need education...and frankly I would suggest regulation for the people advocating and promoting agreed conspiracies.",
                "We humans really have to stop pretending like we're special and have found some secret trick or cure that \"they\" have been hiding from us.  We never will, we all think we're special, and have somehow gained secret knowledge from a YouTube commercial or some influencer or podcaster (where the secret knowledge is usually kept).  \n\nTo quote Tim Minchin: \"alternative medicine, by definition, has either not been proved to work or has been proved not to work.  You know what they call alternative medicine that's been proved to work?  Medicine.\"",
                "[deleted]",
                "They did Apollo 1 to a child.",
                "Anti-science, conservative, partisan rhetoric is cooking peoples' brains. Fully being deep-fried by the matrix.",
                "Oh, so the Deadpool therapy doesn’t work?",
                "So was this a real one or a rinky dink private clinic one (huge difference in pressure)? For either, the owners are constantly trying to expand their use and make them first-line treatment to get their investment back (I swear, MGH would use proton beam for runny noses if they could get away with it)."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "India-New Zealand: Free trade talks relaunched after a decade",
            "external_url": "https://www.bbc.com/news/articles/cn4yvp739m2o",
            "upvotes": 306,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/5283/live/d8cb98e0-031a-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "India is one of the most protectionist countries. I’m guessing they’re only considering free trade with NZ because NZ doesn’t really have any exports that could compete in India.",
                "aaaaaand India is already asking New Zealand to quash free speech because modi finds it upsetting.  \n\n[India shares concerns over growing activities of Khalistani elements in New Zealand](https://www.wionews.com/india-news/india-rings-alarm-bells-over-growing-khalistan-issue-to-new-zealand-8862638)",
                "Ask them to leave Brics and let's create something better for the world, maybe with China and Brazil too?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Houthi missile, drone attack on U.S. Navy ships failed, official says",
            "external_url": "https://abcnews.go.com/International/houthi-missile-drone-attack-us-navy-ships-failed/story?id=119863896",
            "upvotes": 1113,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/82304d7d-3ace-4e06-aac9-6df1e5d5ebea/F18-Red-Sea-DB-250317_1742197821049_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Don't touch the boats!",
                "\"A U.S. official told ABC News that the Houthis fired 11 drones and one ballistic missile, none of which came close to hitting any U.S. vessels.\n\nAll drones were downed by fighters -- 10 shot down by Air Force planes and one by Navy planes -- while the ballistic missile was not intercepted as it fell far short of the vessels, the official said.\" \n\n-lol",
                "I would say they'll have better luck next time, but now that the navy knows they're serious, they may not exist much longer.",
                "*Throws sandle at tank* \"THAT'LL TEACH THEM!\" ",
                "Why are we bombing them rn? Are they still attacking commercial shipping going through the area?",
                "Those anti drone missles cost hundreds of thousands to millions to make. The houthis drones cost under $1000 each. Just to put this into perspective.",
                "How did any country or group have the courage to attack the US military while Trump is in office? I thought everyone feared and respected him?",
                "Why are we fighting Israel's war with Yemen? To secure the Trump/Gaza strip mall and casino? We are risking US servicemen's lives for Trump and Jared Kushner's new real estate venture? Is that what y'all voted for? ",
                "Agh, so the jenus started another war in order to support Israel?",
                "So the Navy ships didn't fail, the drones did. Wow that's a great title."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Black Medal of Honor recipient removed from US Department of Defense website",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/16/defense-department-black-medal-of-honor-veteran",
            "upvotes": 64290,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "*On Saturday, US army Maj Gen Charles Calvin Rogers’s Medal of Honor webpage led to a “404” error message. The URL was also changed, with the word “medal” changed to “deimedal”.*",
                "Changing “medal” to “deimedal” in the url is so fucking gross",
                "Erasing the heroic accomplishments of black Americans is certainly not going to “Make America Great Again.” Hopefully no one is still fooled by what is going on here.",
                "[deleted]",
                "What’s funny is that MAGA loves Clarence Thomas who is 100% a DEI judge picked to replace Thurgood Marshall.",
                "It's actually real. Try going to https://www.defense.gov/News/Feature-Stories/Story/Article/2824721/medal-of-honor-monday-army-maj-gen-charles-calvin-rogers/\n\n the URL redirects to \"deimedal\"",
                "This has nothing to do with DEI even though MAGA thinks it does. This medal was given under Nixon, their ultra racist hero.",
                "I am waiting for veterans to be pissed off really bad...",
                "This makes me so angry I have no words. ",
                "Where the \"support our troops\" crowd at now?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Iranian general raises prospect of response amid US strikes on Houthis",
            "external_url": "https://abcnews.go.com/International/iranian-general-raises-prospect-response-amid-us-strikes/story?id=119847045&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 910,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0c7b8af1-0bce-4726-9779-15725547cd67/trump-main_1742126398911_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "They pretty much always say some inflammatory comment but don't follow through.",
                "Someone is not very good at the \"those guys have nothing to do with us\" denial game.",
                ">SINCE BUCKO DELETED HIS COMMENT \"America is trying to instigate a conflict it can frame as a war for national security and defense, not of aggression. They are going to continue to poke and prod until they have their justification and then bring the hammer down. Trump claims to want peace, but he is drooling at the thought of flexing American military might.\"\n\nAs much as I hate t-man, weren't the Houthis the ones threatening EVERYONE, and I mean EVERYONE a while back?\n\nSaudi Oil tankers in 2020, China ships were threatened, IIRC they accidentally did hit a russian ship, and I believe an American one and another one from the EU were hit but survived, unless someone else rememebrs more precisely to correct so I can edit?\n\nDid some searching, heres more info: between 2023-2024 houthi forces have targetted ships in the **Bab-el-Mandeb Strait** and the **Red Sea**. **Saudi Arabia**, **UAE**, **global shipping** (especially vessels from countries like **Japan**, **South Korea**, **India**, **China**.)\n\nSo yeah, you've striked against Saudi Arabia and UAE, some of the biggest powers next to you; attacked not only American, Chinese, but also **Russian** commercial ships at some point in the past 4 years threaneing **WORLD** trade and not just one part, but a huge pathway that would cause tons of economic turmoil for all countries involved that work on schedules. Can't say I'm shocked. I just hope it isn't too bad and the U.S shows some sort of \"restraint\" and by restraint I just mean precise.",
                "Like what? Try to murder defenseless girls outside of Iran because of hair?",
                "The scary thing is that we’ve never been more vulnerable to terror attacks than we are right now with the federal government in disarray.\n\nThere are highly unqualified people running the CIA and FBI",
                "I would certainly hope they don't retaliate by dropping a bomb on Mar a Lago 🏌️‍♂️⛳",
                "Aren’t they still mad at the assassination of some top general during his first term?",
                "Well, the Houthis are a nuissance and minions of Iran. Trump would love to clobber Iran, but Iran must know this, so these are mostly empty prospects of response.\n\nIran's regime is shaky these days. Young Iranians want change. I would love to see the theocracy tumble from within and a secular democracy rise in its place, without the US using any force.\n\nStriking the Houthis is already questionable. If the strikes kill many civilians, this will just increase the number of radicals looking to avenge family, much like the IDF striking Hamas with so many collateral casualties.",
                "Saudi Arabia has been in a proxy war with Iran for decades.  That’s why Saudi Arabia has been fighting in Yemen. ",
                "The prophecy unfolds right before our blind eyes."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "A Spending Freeze at the FDA Threatens Safety of Food Supply, Current Staffers Say - Consumer Reports",
            "external_url": "https://www.consumerreports.org/health/food-safety/fda-spending-freeze-threatens-safety-of-food-supply-a7676246448/",
            "upvotes": 274,
            "date": "03/17/2025",
            "thumbnail": "https://article.images.consumerreports.org/image/upload/t_article_tout/v1741207022/prod/content/dam/CRO-Images-2025/Special%20Projects/CR-SP-InlineHero-Cuts-at-FDA-are-putting-consumers-at-risk-0325",
            "top_comments": [
                "Oh awesome, simple awesome\n\n\nInfant formula factories, really good stuff\n\n\nKilling Americans for no reason, awesome president no notes",
                "But according to RFK Jr the real threat is the riboflavo-something (he can't pronounce it) he saw on the ingredient list.",
                "Thankfully eating food is optional so its safety is a luxury more than a requirement /s",
                "If Trumpers had any brains, they’d be protesting right now. ",
                "For anyone interested. The FDA posts recalls on their webpage and you can see there are a few food recalls every week across the nation. Things like listeria, elevated levels of lead/arsenic, or other contamination. Just google FDA Recalls and then you can go sort based on drug/food/device/ etc\n\nI would imagine that if foods are not being purchased for testing then there would be a gap in reporting recalls as well as holding manufacturers accountable for physically taking their product off the shelf. The reporting appears consistent and up to date with the most recent recall being 3/17.",
                "I guess the new administrations way of doing it is to let the people be Guinee Pigs.  If a whole bunch die THEN check and see if the product is bad.\n\n\"Some FDA employees say they now feel dangerously unprepared for any new outbreak emergency. And some say that if the current situation continues, all food testing could come to a halt.\"",
                "This is why I started a vegetable garden in February. It is not to late to start your own now.",
                "Some of you may die, but that is a sacrifice I’m prepared to make….",
                "Yes let's pause spending at the FDA while bird flu is ravaging flocks of chickens",
                "One more reason I don't want food from the USA. Unsafe!!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Severe weather disaster: 40 dead after destructive tornadoes, wildfires and dust storms, sweep across US",
            "external_url": "https://www.accuweather.com/en/severe-weather/severe-weather-disaster-40-dead-after-destructive-tornadoes-wildfires-and-dust-storms-sweep-across-us/1754990",
            "upvotes": 969,
            "date": "03/17/2025",
            "thumbnail": "https://cms.accuweather.com/wp-content/uploads/2025/03/GettyImages-2204764243.jpg?w=768",
            "top_comments": [
                "And we want to cut back government aid for these families in crisis",
                "Have the dust storms started already? Getting an early start to the depression era",
                "Yeah, but did you hear that Trump won a golf tournament at one of his clubs?",
                "From what I understand..\n\nMy no contact MAGA parents are currently blaming NASA. The logic being, NASA is angry about DOGE cuts and SpaceX that they are \"manufacturing bio-engineered storms to attack America. And only Donald Trump can save us\". \n\nThese are educated people whose brain broke in 2008 when a brown man became president. I just can't deal with them.",
                "A widespread and violent storm system has claimed at least 40 lives across seven states as of Monday, with additional fatalities emerging in Oklahoma. Sunday was the third day in a row that severe storms packing destructive winds, large hail, tornadoes and flooding downpours target over 20 states and 150 million people.",
                "This is just the start of it.  Climate change is only going to worsen.",
                "reminder that they actively nerfed fema and the NOAA",
                "Luckily these are the states that voted for the guy who cut FEMA so they will receive all the help they wanted.",
                "We really should consider deporting extreme weather since it kills more Americans than immigrants do.",
                "Fortunately these people have voted for their savior to cut all the help they could have gotten."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "White House denies defying judge's order over deportations to El Salvador",
            "external_url": "https://www.bbc.co.uk/news/articles/cr5219ezjrpo",
            "upvotes": 11352,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bfbd/live/8481df30-0331-11f0-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "Alternative facts. Their own DOJ memo indicated that they were aware that they were violating the judges orders.",
                "\"The [court] order, which had no lawful basis,...\" - WH Press Secretary\n\nThey're openly trying to suggest that federal courts have no legal basis to adjudicate. This is insane.",
                "It’s pretty clear he doesn’t listen to the courts anymore. He also had a Lebanese medical doctor / professor with a valid visa deported for no apparent reason, against a judge’s explicit order: https://www.cnn.com/2025/03/17/us/brown-university-doctor-deported-hnk/index.html",
                "So we’re there. “Let them enforce it” is now reality.",
                "Even if they acknowledge defying the judges orders, what are we expecting the judges/judicial system to do to him? He never has to deal with any consequences of doing illegal things, no one is going to start imposing consequences on him now at this level. I don't think the government is equipped to deal with a president who just straight up defies laws.",
                "The most dangerous people to our country (world?) are the current administration.\n\nThe call is coming from inside the WH, and it doesn't appear that anyone plans on stopping them. \n\nDeflection and projection is their game.",
                "Ah we're at the we didn't do that stage, soon to be at the we did it but they deserved it stage...",
                "How does this administration manage to chose the absolute wrong side of every single issue? They would be better if they just flipped a coin.",
                "They'd probably have a better case to make if our dipshit Secretary of State wasn't laughing about it on Twitter",
                "So if I'm understanding this entire situation correctly, the Trump Administration initiated an 18th century Act, corralled a bunch of alleged \"gang members\" (I'm putting this in quotes because literally nobody even verified they really were gang members, but that's not the point here), violated their due process (this is the point here!), loaded them on a plane WHILE this situation was being reviewed by a judge, let that plane take off while this situation was being ruled on by a judge, then claimed \"Oops, well the plane already left before the ruling so therefore it doesn't count AND we didn't defy a court order!\"?\n\nAnd we are supposed to believe this wasn't done maliciously? They knew the judge was ruling on this situation. They knew they could have had the plane wait until the ruling came down to have it deport these people IF it was legal. They knew what they were doing was illegal anyways. **They still did it**.\n\nLet me also be clear, this is not about gang members. If these people truly were members of a Venezuelan gang, then go through due process AND THEN deport them. Same result. This is about pushing our due process to it's limits to see what you can get away with, then justifying it with \"Oh well it was gang members, you don't want gang members here DO YOU?\", and the entire point is \"How do WE know they were gang members if you rounded them up and deported them without any due process?\".\n\nTHAT'S THE ENTIRE POINT. This is how they're allowed to make people disappear, because they are violating your rights and using the cover of \"it's gang members!\" to do it, just like previous administrations did with \"Oh they're terrorists!\"."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Michigan boy's death raises concerns about unregulated hyperbaric oxygen therapy",
            "external_url": "https://www.nbcnews.com/news/us-news/-michigan-boys-death-raises-concerns-hyperbaric-therapy-rcna196260",
            "upvotes": 1179,
            "date": "03/17/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250313-Hyperbaric-chamber-Oxford-Center-Thomas-Cooper-aa-1225-83c28d.jpg",
            "top_comments": [
                "Regulation is written in blood.",
                "The part that kills me is it takes all of 20 seconds to figure out that this stuff doesn't work.  And yet all it takes to find suckers is to say they're lying to you! And now you will find scads of people who now believe anything you say.  \n\n\nSpeaking of which,  I have found the cure for depression, insomnia,  headaches,  erectile dysfunction,  baldness and cancer! But the greedy medical establishment doesn't want my miracle cure all to be sold because it'd put them out of business. PM for details!",
                "I mean the fact they were promoting it for ADHD, and ED cures just for patients to come in (ped the owner lying) is pretty insane. It needs to be regulated so idiots like this don't keep doing this. Oxygen is a drug and needs to be prescribed correctly",
                "There is a cult/wacko group that believes and promotes the rich and/or government have suped up \"medical beds\" that can instantly cure any aliment.\nThese snake oil salesmen are playing off that thread of desperation.\nRegulation might help, but we need education...and frankly I would suggest regulation for the people advocating and promoting agreed conspiracies.",
                "We humans really have to stop pretending like we're special and have found some secret trick or cure that \"they\" have been hiding from us.  We never will, we all think we're special, and have somehow gained secret knowledge from a YouTube commercial or some influencer or podcaster (where the secret knowledge is usually kept).  \n\nTo quote Tim Minchin: \"alternative medicine, by definition, has either not been proved to work or has been proved not to work.  You know what they call alternative medicine that's been proved to work?  Medicine.\"",
                "[deleted]",
                "They did Apollo 1 to a child.",
                "Anti-science, conservative, partisan rhetoric is cooking peoples' brains. Fully being deep-fried by the matrix.",
                "Oh, so the Deadpool therapy doesn’t work?",
                "So was this a real one or a rinky dink private clinic one (huge difference in pressure)? For either, the owners are constantly trying to expand their use and make them first-line treatment to get their investment back (I swear, MGH would use proton beam for runny noses if they could get away with it)."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "India-New Zealand: Free trade talks relaunched after a decade",
            "external_url": "https://www.bbc.com/news/articles/cn4yvp739m2o",
            "upvotes": 304,
            "date": "03/17/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/5283/live/d8cb98e0-031a-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "India is one of the most protectionist countries. I’m guessing they’re only considering free trade with NZ because NZ doesn’t really have any exports that could compete in India.",
                "aaaaaand India is already asking New Zealand to quash free speech because modi finds it upsetting.  \n\n[India shares concerns over growing activities of Khalistani elements in New Zealand](https://www.wionews.com/india-news/india-rings-alarm-bells-over-growing-khalistan-issue-to-new-zealand-8862638)",
                "Ask them to leave Brics and let's create something better for the world, maybe with China and Brazil too?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Houthi missile, drone attack on U.S. Navy ships failed, official says",
            "external_url": "https://abcnews.go.com/International/houthi-missile-drone-attack-us-navy-ships-failed/story?id=119863896",
            "upvotes": 1110,
            "date": "03/17/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/82304d7d-3ace-4e06-aac9-6df1e5d5ebea/F18-Red-Sea-DB-250317_1742197821049_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Don't touch the boats!",
                "\"A U.S. official told ABC News that the Houthis fired 11 drones and one ballistic missile, none of which came close to hitting any U.S. vessels.\n\nAll drones were downed by fighters -- 10 shot down by Air Force planes and one by Navy planes -- while the ballistic missile was not intercepted as it fell far short of the vessels, the official said.\" \n\n-lol",
                "I would say they'll have better luck next time, but now that the navy knows they're serious, they may not exist much longer.",
                "*Throws sandle at tank* \"THAT'LL TEACH THEM!\" ",
                "Why are we bombing them rn? Are they still attacking commercial shipping going through the area?",
                "Those anti drone missles cost hundreds of thousands to millions to make. The houthis drones cost under $1000 each. Just to put this into perspective.",
                "How did any country or group have the courage to attack the US military while Trump is in office? I thought everyone feared and respected him?",
                "Why are we fighting Israel's war with Yemen? To secure the Trump/Gaza strip mall and casino? We are risking US servicemen's lives for Trump and Jared Kushner's new real estate venture? Is that what y'all voted for? ",
                "Agh, so the jenus started another war in order to support Israel?",
                "So the Navy ships didn't fail, the drones did. Wow that's a great title."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Black Medal of Honor recipient removed from US Department of Defense website",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/16/defense-department-black-medal-of-honor-veteran",
            "upvotes": 64272,
            "date": "03/17/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/10cb2bcf7c18f4a8f94c75339e964d857db71ce2/0_1_1586_951/master/1586.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6658a1cbae958e9f7b85d24ba271a09",
            "top_comments": [
                "*On Saturday, US army Maj Gen Charles Calvin Rogers’s Medal of Honor webpage led to a “404” error message. The URL was also changed, with the word “medal” changed to “deimedal”.*",
                "Changing “medal” to “deimedal” in the url is so fucking gross",
                "Erasing the heroic accomplishments of black Americans is certainly not going to “Make America Great Again.” Hopefully no one is still fooled by what is going on here.",
                "[deleted]",
                "What’s funny is that MAGA loves Clarence Thomas who is 100% a DEI judge picked to replace Thurgood Marshall.",
                "It's actually real. Try going to https://www.defense.gov/News/Feature-Stories/Story/Article/2824721/medal-of-honor-monday-army-maj-gen-charles-calvin-rogers/\n\n the URL redirects to \"deimedal\"",
                "This has nothing to do with DEI even though MAGA thinks it does. This medal was given under Nixon, their ultra racist hero.",
                "I am waiting for veterans to be pissed off really bad...",
                "This makes me so angry I have no words. ",
                "Where the \"support our troops\" crowd at now?"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Brown Medicine professor, doctor deported to Lebanon despite having valid visa, court filings claim",
            "external_url": "https://www.nbcnews.com/news/us-news/brown-medicine-professor-doctor-deported-lebanon-valid-visa-court-fili-rcna196638",
            "upvotes": 9390,
            "date": "03/17/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-04/230424-brown-university-al-1003-908a6b.jpg",
            "top_comments": [
                "There’s a fellow in our office from Mexico who is winding down his time here in preparation for his medical residency. I just found out he has to go back home to update his visa from doing his service hours with us, to one for his residency. I worry that there will be “some problem or the other” and he won’t be let back in and there goes one more good man and good young doctor.",
                "You got a PhD? Gtfo.  \n\n\nYou got $5 mil? Come on in!",
                "As long as the machine is designed to vilify and persecute and see enemies everywhere, we are going to keep seeing innocent victims caught up in its teeth. ",
                "We have a deep Lebanese community and a need for doctors here in Canada!",
                "Watch immigration officers not let her back in for some bullshit reason.",
                "> “Our CBP Officers adhere to strict protocols to identify and stop threats, using rigorous screening, vetting, strong law enforcement partnerships, and keen inspectional skills to keep threats out of the country,” Hilton Beckham, CBP’s assistant commissioner of public affairs, said in the statement. \n\nSo… what was the threat here?\n\nI’m getting “ocular pat down” vibes from that sentence.",
                "Wouldn’t be surprised if she never comes back, can’t blame her. The brain drain we are seeing is gonna be legendary, except in a terrifying way. ",
                "Another court order ignored. Wonderful.",
                "Oh yes, get rid of doctors. \n\n\nThat's totally not going to blow up in our faces.\n\n\n\nIs the government going to make a list of people who know multiple languages and wear glasses next?",
                "The US is so short on professionals doing her position, that frankly even if she didn't have a valid visa the correct answer should be \"figure out how to get this critical professional a visa,\" not deport them.\n\nThis is of course assuming the government cares about its people, which the current admin does not."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Finland turns down US request for eggs",
            "external_url": "https://yle.fi/a/74-20149786",
            "upvotes": 31075,
            "date": "03/16/2025",
            "thumbnail": "https://images.cdn.yle.fi/image/upload/c_crop,x_0,y_0,w_1597,h_901/w_1200,ar_1.91,c_fill/q_auto:eco,f_auto,fl_lossy/v1723193249/39-133049966b5d6a6d2abd",
            "top_comments": [
                "Maybe JD didn’t say please",
                "So let me get this straight....\n\nYou expect to get something you need from someone you've pissed off?",
                "”US authorities have turned to Europe for help with the country's severe egg shortage. The shortfall is due to bird flu, which has plagued the United States for several years.\n\nThe Finnish Poultry Association says it has been contacted about exporting eggs to the US. The organisation's executive director, Veera Lehtilä, told Yle on Saturday that exporting eggs does not seem to be possible at the moment because no market access negotiations have been held with US authorities. This can be a drawn-out process involving extensive inspections and studies.”",
                "1. Fuck everyone, we’re not subsidizing any of you anymore, you’re not even a real country, America first, USA, USA, etc. etc.\n\n2. Can we have some eggs please? \n\n\nCan’t make this shit up.",
                "There is little to no goodwill left for the US in Europe. No eggs for you. \n\n\nThe US spent 80 years building up their role as a big brother to the western world, recognized as the leader of the free world.\n\n\nIt took Trump 3 weeks to destroy its reputation, and it will probably take several generations to make it \"great again\" ",
                "Coming soon: *\"Nasty people in Finland, maybe we're looking at it becoming a US state...\"*",
                "Imagine how much cheaper things would get if we just worked with allies instead of pissing them off.\n\nIt’s all a show. The current administration has no plans on making the lives of Americans better. Same with doge. Cost cutting that cuts 02% of federal budget. America strong economic policy that makes us weak.",
                "You could ask Canada... oh, wait.",
                "You don’t have the cards",
                "Any dealings in that magnitude has to be done through an EU negotiated trade agreement. \nAnd considering that the US has just started a trade war with the EU and threatens to invade EU territory.. that's gonna be a no from us dawg."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Greek government debt raised to investment grade by Moody's, closing the door on a painful era",
            "external_url": "https://apnews.com/article/greece-moodys-debt-credit-rating-politics-7b9f0902d0d858323b1998aec52e11a0",
            "upvotes": 3773,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Holy cow I never thought I'd be alive to see this. I wonder if the economy will ever rebound to the point where Greeks move back.",
                "And soon enough US bonds will be downgraded by Moody’s. So that’s neat!",
                "Praise be to [**Plutus**](https://en.wikipedia.org/wiki/Plutus)",
                "\"So Greece is insolvent?\"  \n\"Brian, put it this way. If it were a privately owned company there'd be a fire there on Saturday about 4 o' clock in the morning.\"",
                "An era exacerbated by a discredited study centered around a spreadsheet using flawed math.",
                "Cool! I can now invest at a Nick the Greek franchise",
                "What does this mean exactly for us that are financially illiterate?",
                "Don’t forget that they got there and it took this long to recover because they implemented austerity measures. You know, like Trump is trying to do despite congress being responsible for funding.",
                "it's a AAA trenche.\n* In \"ridiculously hot girl in a bathtub with a flute of Moet\" voice",
                "Lower tzatziki prices?"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "03/17/2025 16:11:12 UTC"
}