{
    "posts": [
        {
            "category": "HOT",
            "title": "Texas creates its own DOGE in attempt to make the state more business-friendly",
            "external_url": "https://www.keranews.org/texas-news/2025-04-24/texas-creates-its-own-doge-in-attempt-to-make-the-state-more-business-friendly",
            "upvotes": 3580,
            "date": "04/24/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/055851c/2147483647/strip/true/crop/6000x3150+0+425/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F74%2F12%2F6851575a4c40bf69e5e89538cf43%2F20250219-abbott-10-1.jpg",
            "top_comments": [
                "What is it going to cut?  Republicans in Texas have been in charge of the budgetfor decades.",
                "Isn't Texas one of those states that's been controlled by republicans for decades? ",
                "Gross. Texas proving once again that it's a total shithole",
                "The irony of signing a bill for \"government efficiency\", while using dozens of different pens to hand off as souvenirs for your corporate masters",
                "Texas can't even keep their power grid functioning 🙄 cuts to spending should be the last thing on their mind",
                "Business friendly = human miserable",
                "Is business friendly the impression they got from this? Wow",
                "Businesses and tech can come crawling back to CA. I expect your tail between your legs, but happy to have them back (also, for anyone who thinks CA isn’t doing well, we’re now the 4th largest global economy… up from 5th)",
                "Maybe they will realize the governor is a dei hire.",
                "I like how the long time Republican States are making DOGE clones..like MFers you've been in charge this whole time."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Colombian Migrant Dies Under ICE Custody In Missouri While Waiting For Deportation",
            "external_url": "https://www.latintimes.com/colombian-migrant-dies-under-ice-custody-missouri-while-waiting-deportation-581593",
            "upvotes": 1437,
            "date": "04/24/2025",
            "thumbnail": "https://d.latintimes.com/en/full/568935/mass-teen-01292025-1.jpg",
            "top_comments": [
                "> ICE spokeswoman Alethea Smock told press that there is no additional information regarding the death. \"Consistent with ICE protocols, the appropriate components were notified about the death, including the Department of Homeland Security Office of Inspector General and the ICE Office of Professional Responsibility,\" the agency added in a statement. \"Additionally, ICE notified the next of kin.\"\n\n\nSo they just found the poor man dead and have no clue how he died? ICE is seriously out of control.",
                "And of course, ICE bears no responsibility whatsoever. <insert eye roll>",
                "I wonder how many have already perished without us knowing about it, and that's even before we count the people sent to CECOT. It's reprehensible.",
                "That's murder. At best, negligent homicide.",
                "Absolutely disgraceful",
                "It's finally happened, a death is being reported. Unfortunately, the people that support the mass deportation will only look at this part of the article:\n\n>Rayo-Garzon had previously been arrested for shoplifting and was again detained in March for credit card fraud, St. Louis police said.  \n...  \nThere is no evidence that the death of Rayo-Garzon, however, was a result of mistreatment from authorities.\n\nThis guy was in custody since June 2024, but the headlines are going to cause even more panic and possibly escalate the resentment and response people have for ICE. People have died in ICE custody before, and this current administration offers no incentive to improve or even maintain the handling of human beings to any standards.",
                "It's appalling how many hateful government cunts allow this shit to happen.",
                "The best part is they will find themselves innocent when they do an internal investigation.",
                "Makes you wonder why the ENTIRE office of [CRCL](https://www.pogo.org/investigations/dhs-removed-100-civil-rights-and-civil-liberties-records) got fired by DOGE. Never mind, they would've been the ones to investigate this.",
                "And there will be no investigation or consequences. This is disgusting. "
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Benin admits that 54 soldiers killed in border attack by Jnim",
            "external_url": "https://www.bbc.com/news/articles/c4grjgkxn9vo",
            "upvotes": 1239,
            "date": "04/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/631e/live/bb40e620-20fe-11f0-9060-674316cb3a1f.jpg",
            "top_comments": [
                "For those curious like myself, Jnim is a terror org from Mali but active in a lot of west africa. They’re 4 groups that combined with a leader that pledged allegiance to the leader of the Taliban among others",
                "By the time the world pays attention, half of North and Central/West Africa will have these problems. Feels like Isis just moved from Syria to the Sahel.",
                "TIL Benin is a country I'd never heard of.  Really gotta improve my knowledge of African geography.",
                "Top comment on this thread is “I don’t know where Benin is”\n\nReddit, never change /s",
                " [Had to look it up …](https://www.britannica.com/place/Benin)",
                "Update: another attack happened today, this time an attack  on a French Supplied Vab.   key info is this happened in Borgu department which is far south of the attack which killed the 54 soldiers."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Pete Hegseth orders makeup studio installed at Pentagon.",
            "external_url": "https://www.cbsnews.com/news/hegseth-orders-makeup-studio-installed-pentagon/",
            "upvotes": 12168,
            "date": "04/24/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/22/11a3d5f1-6474-45f7-9b25-ba260adf85c3/thumbnail/1200x630/ca22e91bcfeff562b946ad603109d829/gettyimages-2210086493.jpg?v=3c17db24e594e0bfc14b069a51163c10",
            "top_comments": [
                "Army Regulation 670-1 3-2b.(1)  (Cosmetics) \n>* Males are prohibited from wearing cosmetics, except when medically prescribed\n\nDoctors note, please?\n\nTrump's doctor excluded.",
                "He’s an abject failure of a human.",
                "I’m eagerly waiting for Fox entertainment to report out on this one",
                "I never want to hear about Pete Buttigieg being too gay for office again.",
                "First it was the leaks, now he has gone rouge.",
                "Where is Doge when you actually have waste.",
                "This sounds like a waste doge can actually handle.\nCome on democrats, he’s giving you gold on a platter and nothing? \n\n- is he transitioning?\n- or example of wrong hire?\n-or corruption?\n\nNothing?\n\n(Answer: 2 and 3)",
                "His sideburns are still drunk",
                "Trump and Drunk Pete wear more makeup than Ru Paul and then lecture everyone on being manly men, warfighters. JD is going to have to expand beyond mascara if he wants to be fabulously vain like those  dipshits. Maybe Pete can give him a makeover and spill the classified tea.",
                "Truly a “ non military wimp “ - no example for soldiers"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Judge rules federal government owes nearly $28 million to North Dakota for pipeline protests",
            "external_url": "https://www.nbcnews.com/news/us-news/judge-rules-federal-government-owes-nearly-28-million-north-dakota-pip-rcna202738",
            "upvotes": 1857,
            "date": "04/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-dakota-access-pipeline-mb-0909-90917d.jpg",
            "top_comments": [
                ">The sometimes-chaotic demonstrations drew international attention for the Standing Rock Sioux Tribe’s opposition to the pipeline’s Missouri River crossing upstream of the tribe’s reservation. The tribe has long opposed the pipeline, fearing an oil spill polluting its water supply.\n\nAnd sure enough [the pipeline ruptured spilling 3,500 gallons of oil a couple weeks ago](https://www.kvrr.com/2025/04/08/update-3500-barrels-of-oil-spilled-after-keystone-pipeline-rupture-near-fort-ransom/) but good news for the cops who policed the protests I guess",
                "Wow this is so corrupt it's ridiculous. Suing the government to pay the state for illegally using state law enforcement to break up a protest against a private company.",
                "“federal government owes state government millions for doing the violent suppression for them”",
                "Which political party was in power in Feb 2017 when the protests were over  and it came time to pay up? What a mystery.",
                "We’ve learned judges’ ruling are all toothless",
                "Can't sue the government unless the government lets you."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Tornado victims blocked from federal recovery aid after Trump denied request",
            "external_url": "https://edition.cnn.com/2025/04/23/weather/trump-denied-disaster-aid-arkansas-tornadoes/index.html",
            "upvotes": 12556,
            "date": "04/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/img-2960.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This nugget shocked me..\n\nTrump easily carried the state or Arkansas for the third time in a row in 2024, this time by a 30.64% margin, the largest since 1972.\n\nFrom article-\n\nDisaster survivors in Arkansas left homeless by recent tornadoes have been blocked from receiving federal recovery aid after President Donald Trump rejected the state’s request to declare a major disaster in March.\n\nThe Trump administration denied Republican Gov. Sarah Huckabee Sanders’ request for individual and public assistance following an outbreak of severe storms and tornadoes that also affected neighboring Mississippi and Missouri and left more than 40 people dead.",
                "Gonna start selling MAGA bootstraps on every religious radio station in that state.",
                "All the Leopards eating faces would be pretty entertaining if it wasn't for the fact that good people who didn't vote for this are also suffering.",
                "YUP. There is only one way for all this to go, going forward. NOT looking forward to the wildfires and hurricane season later in the year.",
                "God, remember when conservatives were whining about Biden not “funding FEMA” while voting for the republican Congress members who campaigned on defunding FEMA? \n\nI’m sick of maga cult members not understanding their own fucking politics.",
                "Where is the outcry from the ignorant conservatives who were super pissed when they believed the lie that Biden was cutting fema to red states?",
                "Red state asks for help because they can’t afford a few billion to cover a disaster.  So, like a \\*\\*communist\\*\\* state, they ask the rest of us to pay for their misfortune.    \n\n\nMaybe their god can share some of those prosperity dollars they have collected to help out. \n\n/s.  I don’t want to see people suffer.  I really don’t. But it is incredibly hard not to turn a blind eye to the plight of people who continue to dig their own graves while screaming to bring the rest of us down as well.",
                "Thanks for voting for me Arkansas... but tornadoes are your problem.",
                "Another red state discovers leopards.",
                "Is this going to get the same play on MSM that trump's attacks on Biden/Harris in '24 about North Carolina got?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Maryland judge orders return of Venezuelan asylum seeker deported to El Salvador | CNN Politics",
            "external_url": "https://www.cnn.com/2025/04/24/politics/maryland-judge-return-venezuelan-asylum-seeker/index.html",
            "upvotes": 576,
            "date": "04/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/08-04-2025-03-16t233141z-1466303683-rc25edablquk-rtrmadp-3-usa-trump-migration-el-salvador-jpg.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Yes. Due process for every last person that we've sent. Every single human that we've deported there is protected under the constitution and the day we stop defending that is the day that we all surrender our own constitutional rights.",
                "Add it to the list of shit they'll ignore because who's gonna do anything about it?",
                "Donald Trump thinks that asylum means \"insane asylum\" and that's why he says it all the time. I really do believe this.",
                "But have we looked at his tattoos. According to our gov, tattoos are the fundamental principle of fairness.",
                "Order schmorder, you have no power over the king.\n\nI HATE this timeline.",
                "Well, didn't the supreme court also order the return of the one wrongfully sent to El Salvador a while ago. Does anyone really believe that will happen?\n\nThe constitution crisis is here now. When an order of the supreme court is ignored, the house of cards is going to come crashing down because the only thing holding up our constitution is the belief that it should be. There is no real power being allocated to the judicial.",
                "> The Trump administration, according to the order, has argued Cristian’s deportation did not violate the settlement, asserting “his designation as an alien enemy pursuant to the AEA results in him ceasing to be a member” of the class action. The government invoked the Alien Enemies Act, an 18th-century wartime authority, on March 15 to deport alleged members of Tren de Aragua, a Venezuelan gang Trump accuses of “perpetrating an invasion of and predatory incursion into the United States.”\nA sworn declaration from Robert Cerna, the ICE acting Field Office Director for Enforcement and Removal Operations, said Cristian had been arrested in Texas in January.\n“On January 6, 2025, (‘Cristian’) was convicted in the 482nd District Court at Harris County, Texas, for the offense of possession of cocaine,” Cerna stated in the filing. Cerna added that Immigration and Customs Enforcement determined Cristian was subject to removal following the invocation of the AEA.\n\nSo he was deported to El Salvador when he was from Venezuela. Against orders of a legal settlement that gave him protection. To be placed in CECOT, but the only detailed claim against him is he had cocaine. Are we going to be arresting every college kid who does cocaine and tossing them in a US Supermax without due process? Due process must be upheld for all, or it is too easy for our government to incarcerate anyone on a whim."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Dozen states sue Trump in bid to block new tariffs",
            "external_url": "https://www.cnbc.com/2025/04/23/states-sue-trump-in-bid-to-block-new-tariffs.html",
            "upvotes": 46073,
            "date": "04/23/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108102916-1739560760118-gettyimages-2199659780-mms20867_kamriiiu.jpeg?v=1745437525&w=1920&h=1080",
            "top_comments": [
                "In addition to New York, the plaintiffs in the new lawsuit filed Wednesday include Arizona, Colorado, Connecticut, Delaware, Illinois, Maine, Minnesota, New Mexico, Oregon, and Vermont",
                "Good, because this shit is weeks away from causing about half my industry to disappear.",
                "Take me back to 2024 before this administration",
                "There was clip of powerful bankers in his office and he  was saying he made 900 million yesterday, and this other guy made 2.5 billion. He’s causing dips on purpose so him and rich friends can buy low and then sell later. He announced some tariffs a while back then walked them back 90 days later. This is market manipulation.",
                "I work for a solar company who everyone here (aside from me) are Trump voters. Yet they’re all still licking his boot.",
                "Couldn't they just get their congress members to, do their job instead?",
                "Thank you to every single state doing this, sadly I'm not in one.",
                "Taxation without representation!  Throw it all into the harbor, boys!",
                "It’s one of the single dumbest things I’ve ever seen an individual do. And he happens to be the most powerful individual in the world. Pretty amazing, in a weird way",
                "If you live in a red state (like me) and are thinking of moving somewhere away from the madness (at least a little bit) then you now have a list of states that will at least try to stand up for their citizens in the face of this insanity. \n\n\"In addition to New York, the plaintiffs in the new lawsuit filed Wednesday include Arizona, Colorado, Connecticut, Delaware, Illinois, Maine, Minnesota, New Mexico, Oregon, and Vermont.\"\n\nNot saying there's not crazy to be had everywhere, but I'm going to assume most of these states are not trying to make it illegal to speak badly about Trump, make Trump's birthday a holiday, rename major airport after him, and ask his administration with help in ensuring they'll be able to keep the billions in federal tax subsidies for public education after they pass an unconstitutional bill to ban undocumented kids from public schools. All of this and more is happening in Tennessee- and the news says the tariffs will hurt TN too- but our spineless and horrid super majority GOP state government is too busy doing racist, bigoted victory laps to care."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "After a month of searching, man learns from NBC News that DHS sent his brother to El Salvador",
            "external_url": "https://www.nbcnews.com/news/rcna202279",
            "upvotes": 20901,
            "date": "04/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250422-Neiyerver-Adrian-Leon-Rengel-ac-754p-339b39.jpg",
            "top_comments": [
                "How many people have been disappeared that we don't  even know about?",
                "That must’ve been a horrifying revelation. Like on the one hand you’d be glad that you know where they are, but on the other hand holy fuck they’re at a forced labor camp in a different country.\n\nEdit Apologies, he may be at a concentration camp or death camp instead. I was going off the fact that the president of El Salvador said that he was going to be using these prisoners for labor.",
                ">Asked for details and documents supporting DHS’ allegations of criminality, McLaughlin responded: “We aren’t going to share intelligence reports and undermine national security every time a gang member denies he is one. That would be insane.” \n\n\nTranslation here is \"We don't have any, besides that he's Venezuelan. We also didn't bother with due process.\"",
                "So the secret police took him away and couldn't be bothered to notify anybody? They're likely in a concentration camp...",
                ">Adrián, 27, came to the United States in 2023 by appointment through the CBP One app. Alejandro provided NBC News a photo of a printout confirming his brother’s June 12, 2023, appointment.  \n\n>Adrián had also applied for temporary protected status, according to a Dec. 1, 2024, document from U.S. Citizenship and Immigration Services, a part of DHS that handles immigration benefits. \n\nSo this guy did EXACTLY what the government asked him to do to come in legally, and they still said he was here illegally.",
                "> Asked for details and documents supporting DHS’ allegations of criminality, McLaughlin responded: “We aren’t going to share intelligence reports and undermine national security every time a gang member denies he is one. That would be insane.”\n\nLiterally the administration is arguing that they shouldn’t have to prove anything in court or anywhere else.  They scoop people off the street, deport them to a foreign gulag, and when asked why, respond “trust me bro. . . “\n\nHow conservatives can defend this shit is beyond me.",
                "\"The law holds that it is better that ten guilty persons escape than that one innocent suffer.\"\n\n\\-- William Blackstone, 1760s\n\n\"We're getting them out... and you can't have a trial for all of these people.\"\n\n\\-- Donald Trump, 04/22/2025",
                "This is so goddamn repulsive. It’s ghoulish.",
                "That’s the thing… they’re all crying “We’re not members of Tren de Agua!” But the problem is we’ll never know. They never got to respond to the government’s very serious allegations against them and are now indefinitely detained in a country they are not from. This is actually really fucked.",
                "Think of every despotic, authoritarian government that disappears people off its streets and denies it all, and realize that this is what the United States of America is under the Republicans."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "World Leaders From China to EU Hold Climate Meeting Without US",
            "external_url": "https://financialpost.com/pmn/business-pmn/world-leaders-from-china-to-eu-hold-climate-meeting-without-us",
            "upvotes": 4776,
            "date": "04/23/2025",
            "thumbnail": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/04/775566467.jpg",
            "top_comments": [
                "“A “certain major country” is keen on unilateralism and protectionism and has caused “serious impact” on international rules and order, Xi also said, according to the official Xinhua News Agency.”\n\n👀",
                "What if this is actually a free trade forum wrapped in a climate change skin.",
                "Everytime I hear news like this, I always keep thinking of Biden last speech about how an oligarchy is taking over the us",
                "Of course the US isn't there. Remember when Al Gore was passionate about the environment and he became the laughingstock of the country for *over a decade*? Even now I hear jokes about him breaking his projector in anger over trees.",
                "The US doesn't care about the climate anyway. Pffft hahaha. They literally just slapped a huge tariff on solar panels. Some US states you can't even have solar on your house at all. EPA gutted. What is a Kei car? Other than Honda, are there even any regular size or compact cars even being sold in America anymore?",
                "The USA being pushed away from dominance is happening a lot faster than I thought it would. It hasn't even been a year yet.",
                "Nice, more focus on climate is always welcome and needed!",
                "The U.S. is too busy jerking off in the corner!",
                "America lost under the leadership of a man with a fake tan and an immigrant who hates other immigrants.",
                "Of course they're not going to invite a clown that has consistently called climate change a \"hoax\" to a climate meeting."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Colombian Migrant Dies Under ICE Custody In Missouri While Waiting For Deportation",
            "external_url": "https://www.latintimes.com/colombian-migrant-dies-under-ice-custody-missouri-while-waiting-deportation-581593",
            "upvotes": 1502,
            "date": "04/24/2025",
            "thumbnail": "https://d.latintimes.com/en/full/568935/mass-teen-01292025-1.jpg",
            "top_comments": [
                "> ICE spokeswoman Alethea Smock told press that there is no additional information regarding the death. \"Consistent with ICE protocols, the appropriate components were notified about the death, including the Department of Homeland Security Office of Inspector General and the ICE Office of Professional Responsibility,\" the agency added in a statement. \"Additionally, ICE notified the next of kin.\"\n\n\nSo they just found the poor man dead and have no clue how he died? ICE is seriously out of control.",
                "And of course, ICE bears no responsibility whatsoever. <insert eye roll>",
                "I wonder how many have already perished without us knowing about it, and that's even before we count the people sent to CECOT. It's reprehensible.",
                "That's murder. At best, negligent homicide.",
                "Absolutely disgraceful",
                "It's finally happened, a death is being reported. Unfortunately, the people that support the mass deportation will only look at this part of the article:\n\n>Rayo-Garzon had previously been arrested for shoplifting and was again detained in March for credit card fraud, St. Louis police said.  \n...  \nThere is no evidence that the death of Rayo-Garzon, however, was a result of mistreatment from authorities.\n\nThis guy was in custody since June 2024, but the headlines are going to cause even more panic and possibly escalate the resentment and response people have for ICE. People have died in ICE custody before, and this current administration offers no incentive to improve or even maintain the handling of human beings to any standards.",
                "It's appalling how many hateful government cunts allow this shit to happen.",
                "The best part is they will find themselves innocent when they do an internal investigation.",
                "Makes you wonder why the ENTIRE office of [CRCL](https://www.pogo.org/investigations/dhs-removed-100-civil-rights-and-civil-liberties-records) got fired by DOGE. Never mind, they would've been the ones to investigate this.",
                "And there will be no investigation or consequences. This is disgusting. "
            ],
            "aggregate_sentiment": 5.0
        },
        {
            "category": "NEW",
            "title": "Maryland judge orders return of Venezuelan asylum seeker deported to El Salvador | CNN Politics",
            "external_url": "https://www.cnn.com/2025/04/24/politics/maryland-judge-return-venezuelan-asylum-seeker/index.html",
            "upvotes": 578,
            "date": "04/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/08-04-2025-03-16t233141z-1466303683-rc25edablquk-rtrmadp-3-usa-trump-migration-el-salvador-jpg.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Yes. Due process for every last person that we've sent. Every single human that we've deported there is protected under the constitution and the day we stop defending that is the day that we all surrender our own constitutional rights.",
                "Add it to the list of shit they'll ignore because who's gonna do anything about it?",
                "Donald Trump thinks that asylum means \"insane asylum\" and that's why he says it all the time. I really do believe this.",
                "But have we looked at his tattoos. According to our gov, tattoos are the fundamental principle of fairness.",
                "Order schmorder, you have no power over the king.\n\nI HATE this timeline.",
                "Well, didn't the supreme court also order the return of the one wrongfully sent to El Salvador a while ago. Does anyone really believe that will happen?\n\nThe constitution crisis is here now. When an order of the supreme court is ignored, the house of cards is going to come crashing down because the only thing holding up our constitution is the belief that it should be. There is no real power being allocated to the judicial.",
                "> The Trump administration, according to the order, has argued Cristian’s deportation did not violate the settlement, asserting “his designation as an alien enemy pursuant to the AEA results in him ceasing to be a member” of the class action. The government invoked the Alien Enemies Act, an 18th-century wartime authority, on March 15 to deport alleged members of Tren de Aragua, a Venezuelan gang Trump accuses of “perpetrating an invasion of and predatory incursion into the United States.”\nA sworn declaration from Robert Cerna, the ICE acting Field Office Director for Enforcement and Removal Operations, said Cristian had been arrested in Texas in January.\n“On January 6, 2025, (‘Cristian’) was convicted in the 482nd District Court at Harris County, Texas, for the offense of possession of cocaine,” Cerna stated in the filing. Cerna added that Immigration and Customs Enforcement determined Cristian was subject to removal following the invocation of the AEA.\n\nSo he was deported to El Salvador when he was from Venezuela. Against orders of a legal settlement that gave him protection. To be placed in CECOT, but the only detailed claim against him is he had cocaine. Are we going to be arresting every college kid who does cocaine and tossing them in a US Supermax without due process? Due process must be upheld for all, or it is too easy for our government to incarcerate anyone on a whim."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "German beer sales down at home and abroad",
            "external_url": "https://www.dw.com/en/german-beer-sales-down-at-home-and-abroad/a-72306658",
            "upvotes": 139,
            "date": "04/24/2025",
            "thumbnail": "https://static.dw.com/image/69689805_6.jpg",
            "top_comments": [
                ">Non-alcoholic beer has, however, been seeing a huge increase in sales in Germany as those of alcoholic beverages fall.\n\nPeople are just switching to non alcoholic drinks.",
                "Beer quality abroad has surged. \n\nI used to buy German beers because the purity laws gave me some confidence I wasn't just drinking a pint of preservatives sure to give me a mega hangover, but there's so many good local micro to medium sized brewers now, it makes more sense to support local businesses.",
                "According to my bank account, yep. I used to buy about $200 in Weihensptephaner, Hofbrau, Spaten and Fruh every month. Now it's down to less than $100.",
                "Deleted because replied wrong, was meant for a commentator, not OP\n\nEdit: thank you, kind redditor, for the award.",
                "I wonder if it's more competition from Japanese beers? Like I've noticed the past few years that Asahi beers are now being served alot more then they used to and offerings in supermarkets.",
                "Personally I enjoy a good German pilsner or dunkel.  Craft breweries in the US only want to make IPAs.  I don't like IPAs, they hide any taste they might have behind way too much hops.",
                "If I want to get drunk, I drink cheap beer. German beer has always been overrated.\n\nEither way, in my case, most of the time, if I want to get drunk and I'm with friends and family, I just drink good wine. I'm from Portugal, and Portugal has some high-quality wine at low prices. But I'm not picky, I’ll drink any good wine from any southern European country.",
                "Less domestic alcohol consumption is a win in my book.",
                "Dab drinking Canadian here doing my part.  It’s the best beer for the low price here.",
                "German beer is to bitter..."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "NEW",
            "title": "Texas creates its own DOGE in attempt to make the state more business-friendly",
            "external_url": "https://www.keranews.org/texas-news/2025-04-24/texas-creates-its-own-doge-in-attempt-to-make-the-state-more-business-friendly",
            "upvotes": 3588,
            "date": "04/24/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/055851c/2147483647/strip/true/crop/6000x3150+0+425/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F74%2F12%2F6851575a4c40bf69e5e89538cf43%2F20250219-abbott-10-1.jpg",
            "top_comments": [
                "What is it going to cut?  Republicans in Texas have been in charge of the budgetfor decades.",
                "Isn't Texas one of those states that's been controlled by republicans for decades? ",
                "Gross. Texas proving once again that it's a total shithole",
                "The irony of signing a bill for \"government efficiency\", while using dozens of different pens to hand off as souvenirs for your corporate masters",
                "Texas can't even keep their power grid functioning 🙄 cuts to spending should be the last thing on their mind",
                "Business friendly = human miserable",
                "Is business friendly the impression they got from this? Wow",
                "Businesses and tech can come crawling back to CA. I expect your tail between your legs, but happy to have them back (also, for anyone who thinks CA isn’t doing well, we’re now the 4th largest global economy… up from 5th)",
                "Maybe they will realize the governor is a dei hire.",
                "I like how the long time Republican States are making DOGE clones..like MFers you've been in charge this whole time."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Benin admits that 54 soldiers killed in border attack by Jnim",
            "external_url": "https://www.bbc.com/news/articles/c4grjgkxn9vo",
            "upvotes": 1240,
            "date": "04/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/631e/live/bb40e620-20fe-11f0-9060-674316cb3a1f.jpg",
            "top_comments": [
                "For those curious like myself, Jnim is a terror org from Mali but active in a lot of west africa. They’re 4 groups that combined with a leader that pledged allegiance to the leader of the Taliban among others",
                "By the time the world pays attention, half of North and Central/West Africa will have these problems. Feels like Isis just moved from Syria to the Sahel.",
                "TIL Benin is a country I'd never heard of.  Really gotta improve my knowledge of African geography.",
                "Top comment on this thread is “I don’t know where Benin is”\n\nReddit, never change /s",
                " [Had to look it up …](https://www.britannica.com/place/Benin)",
                "Update: another attack happened today, this time an attack  on a French Supplied Vab.   key info is this happened in Borgu department which is far south of the attack which killed the 54 soldiers."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "2 men detained at Albemarle courthouse in alleged ICE raid",
            "external_url": "https://www.vpm.org/news/2025-04-23/albemarle-courthouse-ice-raid-nicholas-reppucci-teodoro-dominguez-rodriguez",
            "upvotes": 505,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Cville resident here. They were going after people taking care of minor traffic violations. At least one of the ICE \"officers\" was wearing a balaclava. All they're missing are the brown shirts. It's sickening.\n\n\nPeople I've talked to about it are *livid*. This is a fairly blue town in a sea of red. It's only a matter of time until someone does something stupid and then they'll have all the justification they need.",
                "This is domestic terrorism. They have a almost complete disregard for our constitution. Anybody that is supportive of this behavior is complicit, not just morally bankrupt.\n\nThis administration has corporations, news media outlets, and cult followers bending the knee. \n\nThere is a reason that this administration has all the personnel in place with zero experience outside of loyalty.\n\n\"Were gonna make this a Christian Nation.\" Give the population more latitude on free religion, and the administration has better control on the populace. Ex: A 33 time felon fucking pornstars,...they don't care.\n\n.... I mean,..c'mon, a military parade in his honor?\n\nAnybody that doesn't see the reality of what is happening at this point is not ignorant. They know.",
                "We keep hearing about them rounding up a few people here and there in dramatic ways but has Trump actually made any impact on illegal immigrants as a whole? I wouldn’t be surprised if Biden deported more immigrants.",
                "First they came for the brown people, yet I did nothing cause I was not brown.\n\nThen they came for the transgender, yet I did nothing cause I was not transgender.\n\nThen they came for......\n\n  \nYou see where I'm going with this? Will Europe have to invade the USA to liberate those in the detention camps?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Judge rules federal government owes nearly $28 million to North Dakota for pipeline protests",
            "external_url": "https://www.nbcnews.com/news/us-news/judge-rules-federal-government-owes-nearly-28-million-north-dakota-pip-rcna202738",
            "upvotes": 1854,
            "date": "04/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-dakota-access-pipeline-mb-0909-90917d.jpg",
            "top_comments": [
                ">The sometimes-chaotic demonstrations drew international attention for the Standing Rock Sioux Tribe’s opposition to the pipeline’s Missouri River crossing upstream of the tribe’s reservation. The tribe has long opposed the pipeline, fearing an oil spill polluting its water supply.\n\nAnd sure enough [the pipeline ruptured spilling 3,500 gallons of oil a couple weeks ago](https://www.kvrr.com/2025/04/08/update-3500-barrels-of-oil-spilled-after-keystone-pipeline-rupture-near-fort-ransom/) but good news for the cops who policed the protests I guess",
                "Wow this is so corrupt it's ridiculous. Suing the government to pay the state for illegally using state law enforcement to break up a protest against a private company.",
                "“federal government owes state government millions for doing the violent suppression for them”",
                "Which political party was in power in Feb 2017 when the protests were over  and it came time to pay up? What a mystery.",
                "We’ve learned judges’ ruling are all toothless",
                "Can't sue the government unless the government lets you."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Tornado victims blocked from federal recovery aid after Trump denied request",
            "external_url": "https://edition.cnn.com/2025/04/23/weather/trump-denied-disaster-aid-arkansas-tornadoes/index.html",
            "upvotes": 12548,
            "date": "04/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/img-2960.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This nugget shocked me..\n\nTrump easily carried the state or Arkansas for the third time in a row in 2024, this time by a 30.64% margin, the largest since 1972.\n\nFrom article-\n\nDisaster survivors in Arkansas left homeless by recent tornadoes have been blocked from receiving federal recovery aid after President Donald Trump rejected the state’s request to declare a major disaster in March.\n\nThe Trump administration denied Republican Gov. Sarah Huckabee Sanders’ request for individual and public assistance following an outbreak of severe storms and tornadoes that also affected neighboring Mississippi and Missouri and left more than 40 people dead.",
                "Gonna start selling MAGA bootstraps on every religious radio station in that state.",
                "All the Leopards eating faces would be pretty entertaining if it wasn't for the fact that good people who didn't vote for this are also suffering.",
                "YUP. There is only one way for all this to go, going forward. NOT looking forward to the wildfires and hurricane season later in the year.",
                "God, remember when conservatives were whining about Biden not “funding FEMA” while voting for the republican Congress members who campaigned on defunding FEMA? \n\nI’m sick of maga cult members not understanding their own fucking politics.",
                "Where is the outcry from the ignorant conservatives who were super pissed when they believed the lie that Biden was cutting fema to red states?",
                "Red state asks for help because they can’t afford a few billion to cover a disaster.  So, like a \\*\\*communist\\*\\* state, they ask the rest of us to pay for their misfortune.    \n\n\nMaybe their god can share some of those prosperity dollars they have collected to help out. \n\n/s.  I don’t want to see people suffer.  I really don’t. But it is incredibly hard not to turn a blind eye to the plight of people who continue to dig their own graves while screaming to bring the rest of us down as well.",
                "Thanks for voting for me Arkansas... but tornadoes are your problem.",
                "Another red state discovers leopards.",
                "Is this going to get the same play on MSM that trump's attacks on Biden/Harris in '24 about North Carolina got?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Pete Hegseth orders makeup studio installed at Pentagon.",
            "external_url": "https://www.cbsnews.com/news/hegseth-orders-makeup-studio-installed-pentagon/",
            "upvotes": 12160,
            "date": "04/24/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/22/11a3d5f1-6474-45f7-9b25-ba260adf85c3/thumbnail/1200x630/ca22e91bcfeff562b946ad603109d829/gettyimages-2210086493.jpg?v=3c17db24e594e0bfc14b069a51163c10",
            "top_comments": [
                "Army Regulation 670-1 3-2b.(1)  (Cosmetics) \n>* Males are prohibited from wearing cosmetics, except when medically prescribed\n\nDoctors note, please?\n\nTrump's doctor excluded.",
                "He’s an abject failure of a human.",
                "I’m eagerly waiting for Fox entertainment to report out on this one",
                "I never want to hear about Pete Buttigieg being too gay for office again.",
                "First it was the leaks, now he has gone rouge.",
                "Where is Doge when you actually have waste.",
                "This sounds like a waste doge can actually handle.\nCome on democrats, he’s giving you gold on a platter and nothing? \n\n- is he transitioning?\n- or example of wrong hire?\n-or corruption?\n\nNothing?\n\n(Answer: 2 and 3)",
                "His sideburns are still drunk",
                "Trump and Drunk Pete wear more makeup than Ru Paul and then lecture everyone on being manly men, warfighters. JD is going to have to expand beyond mascara if he wants to be fabulously vain like those  dipshits. Maybe Pete can give him a makeover and spill the classified tea.",
                "Truly a “ non military wimp “ - no example for soldiers"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "World Leaders From China to EU Hold Climate Meeting Without US",
            "external_url": "https://financialpost.com/pmn/business-pmn/world-leaders-from-china-to-eu-hold-climate-meeting-without-us",
            "upvotes": 4782,
            "date": "04/23/2025",
            "thumbnail": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/04/775566467.jpg",
            "top_comments": [
                "“A “certain major country” is keen on unilateralism and protectionism and has caused “serious impact” on international rules and order, Xi also said, according to the official Xinhua News Agency.”\n\n👀",
                "What if this is actually a free trade forum wrapped in a climate change skin.",
                "Everytime I hear news like this, I always keep thinking of Biden last speech about how an oligarchy is taking over the us",
                "Of course the US isn't there. Remember when Al Gore was passionate about the environment and he became the laughingstock of the country for *over a decade*? Even now I hear jokes about him breaking his projector in anger over trees.",
                "The US doesn't care about the climate anyway. Pffft hahaha. They literally just slapped a huge tariff on solar panels. Some US states you can't even have solar on your house at all. EPA gutted. What is a Kei car? Other than Honda, are there even any regular size or compact cars even being sold in America anymore?",
                "The USA being pushed away from dominance is happening a lot faster than I thought it would. It hasn't even been a year yet.",
                "Nice, more focus on climate is always welcome and needed!",
                "The U.S. is too busy jerking off in the corner!",
                "America lost under the leadership of a man with a fake tan and an immigrant who hates other immigrants.",
                "Of course they're not going to invite a clown that has consistently called climate change a \"hoax\" to a climate meeting."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Colombian Migrant Dies Under ICE Custody In Missouri While Waiting For Deportation",
            "external_url": "https://www.latintimes.com/colombian-migrant-dies-under-ice-custody-missouri-while-waiting-deportation-581593",
            "upvotes": 1506,
            "date": "04/24/2025",
            "thumbnail": "https://d.latintimes.com/en/full/568935/mass-teen-01292025-1.jpg",
            "top_comments": [
                "> ICE spokeswoman Alethea Smock told press that there is no additional information regarding the death. \"Consistent with ICE protocols, the appropriate components were notified about the death, including the Department of Homeland Security Office of Inspector General and the ICE Office of Professional Responsibility,\" the agency added in a statement. \"Additionally, ICE notified the next of kin.\"\n\n\nSo they just found the poor man dead and have no clue how he died? ICE is seriously out of control.",
                "And of course, ICE bears no responsibility whatsoever. <insert eye roll>",
                "I wonder how many have already perished without us knowing about it, and that's even before we count the people sent to CECOT. It's reprehensible.",
                "That's murder. At best, negligent homicide.",
                "Absolutely disgraceful",
                "It's finally happened, a death is being reported. Unfortunately, the people that support the mass deportation will only look at this part of the article:\n\n>Rayo-Garzon had previously been arrested for shoplifting and was again detained in March for credit card fraud, St. Louis police said.  \n...  \nThere is no evidence that the death of Rayo-Garzon, however, was a result of mistreatment from authorities.\n\nThis guy was in custody since June 2024, but the headlines are going to cause even more panic and possibly escalate the resentment and response people have for ICE. People have died in ICE custody before, and this current administration offers no incentive to improve or even maintain the handling of human beings to any standards.",
                "It's appalling how many hateful government cunts allow this shit to happen.",
                "The best part is they will find themselves innocent when they do an internal investigation.",
                "Makes you wonder why the ENTIRE office of [CRCL](https://www.pogo.org/investigations/dhs-removed-100-civil-rights-and-civil-liberties-records) got fired by DOGE. Never mind, they would've been the ones to investigate this.",
                "And there will be no investigation or consequences. This is disgusting. "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Maryland judge orders return of Venezuelan asylum seeker deported to El Salvador | CNN Politics",
            "external_url": "https://www.cnn.com/2025/04/24/politics/maryland-judge-return-venezuelan-asylum-seeker/index.html",
            "upvotes": 579,
            "date": "04/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/08-04-2025-03-16t233141z-1466303683-rc25edablquk-rtrmadp-3-usa-trump-migration-el-salvador-jpg.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Yes. Due process for every last person that we've sent. Every single human that we've deported there is protected under the constitution and the day we stop defending that is the day that we all surrender our own constitutional rights.",
                "Add it to the list of shit they'll ignore because who's gonna do anything about it?",
                "Donald Trump thinks that asylum means \"insane asylum\" and that's why he says it all the time. I really do believe this.",
                "But have we looked at his tattoos. According to our gov, tattoos are the fundamental principle of fairness.",
                "Order schmorder, you have no power over the king.\n\nI HATE this timeline.",
                "Well, didn't the supreme court also order the return of the one wrongfully sent to El Salvador a while ago. Does anyone really believe that will happen?\n\nThe constitution crisis is here now. When an order of the supreme court is ignored, the house of cards is going to come crashing down because the only thing holding up our constitution is the belief that it should be. There is no real power being allocated to the judicial.",
                "> The Trump administration, according to the order, has argued Cristian’s deportation did not violate the settlement, asserting “his designation as an alien enemy pursuant to the AEA results in him ceasing to be a member” of the class action. The government invoked the Alien Enemies Act, an 18th-century wartime authority, on March 15 to deport alleged members of Tren de Aragua, a Venezuelan gang Trump accuses of “perpetrating an invasion of and predatory incursion into the United States.”\nA sworn declaration from Robert Cerna, the ICE acting Field Office Director for Enforcement and Removal Operations, said Cristian had been arrested in Texas in January.\n“On January 6, 2025, (‘Cristian’) was convicted in the 482nd District Court at Harris County, Texas, for the offense of possession of cocaine,” Cerna stated in the filing. Cerna added that Immigration and Customs Enforcement determined Cristian was subject to removal following the invocation of the AEA.\n\nSo he was deported to El Salvador when he was from Venezuela. Against orders of a legal settlement that gave him protection. To be placed in CECOT, but the only detailed claim against him is he had cocaine. Are we going to be arresting every college kid who does cocaine and tossing them in a US Supermax without due process? Due process must be upheld for all, or it is too easy for our government to incarcerate anyone on a whim."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Texas creates its own DOGE in attempt to make the state more business-friendly",
            "external_url": "https://www.keranews.org/texas-news/2025-04-24/texas-creates-its-own-doge-in-attempt-to-make-the-state-more-business-friendly",
            "upvotes": 3580,
            "date": "04/24/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/055851c/2147483647/strip/true/crop/6000x3150+0+425/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F74%2F12%2F6851575a4c40bf69e5e89538cf43%2F20250219-abbott-10-1.jpg",
            "top_comments": [
                "What is it going to cut?  Republicans in Texas have been in charge of the budgetfor decades.",
                "Isn't Texas one of those states that's been controlled by republicans for decades? ",
                "Gross. Texas proving once again that it's a total shithole",
                "The irony of signing a bill for \"government efficiency\", while using dozens of different pens to hand off as souvenirs for your corporate masters",
                "Texas can't even keep their power grid functioning 🙄 cuts to spending should be the last thing on their mind",
                "Business friendly = human miserable",
                "Is business friendly the impression they got from this? Wow",
                "Businesses and tech can come crawling back to CA. I expect your tail between your legs, but happy to have them back (also, for anyone who thinks CA isn’t doing well, we’re now the 4th largest global economy… up from 5th)",
                "Maybe they will realize the governor is a dei hire.",
                "I like how the long time Republican States are making DOGE clones..like MFers you've been in charge this whole time."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Judge rules federal government owes nearly $28 million to North Dakota for pipeline protests",
            "external_url": "https://www.nbcnews.com/news/us-news/judge-rules-federal-government-owes-nearly-28-million-north-dakota-pip-rcna202738",
            "upvotes": 1857,
            "date": "04/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250424-dakota-access-pipeline-mb-0909-90917d.jpg",
            "top_comments": [
                ">The sometimes-chaotic demonstrations drew international attention for the Standing Rock Sioux Tribe’s opposition to the pipeline’s Missouri River crossing upstream of the tribe’s reservation. The tribe has long opposed the pipeline, fearing an oil spill polluting its water supply.\n\nAnd sure enough [the pipeline ruptured spilling 3,500 gallons of oil a couple weeks ago](https://www.kvrr.com/2025/04/08/update-3500-barrels-of-oil-spilled-after-keystone-pipeline-rupture-near-fort-ransom/) but good news for the cops who policed the protests I guess",
                "Wow this is so corrupt it's ridiculous. Suing the government to pay the state for illegally using state law enforcement to break up a protest against a private company.",
                "“federal government owes state government millions for doing the violent suppression for them”",
                "Which political party was in power in Feb 2017 when the protests were over  and it came time to pay up? What a mystery.",
                "We’ve learned judges’ ruling are all toothless",
                "Can't sue the government unless the government lets you."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "2 men detained at Albemarle courthouse in alleged ICE raid",
            "external_url": "https://www.vpm.org/news/2025-04-23/albemarle-courthouse-ice-raid-nicholas-reppucci-teodoro-dominguez-rodriguez",
            "upvotes": 505,
            "date": "04/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Cville resident here. They were going after people taking care of minor traffic violations. At least one of the ICE \"officers\" was wearing a balaclava. All they're missing are the brown shirts. It's sickening.\n\n\nPeople I've talked to about it are *livid*. This is a fairly blue town in a sea of red. It's only a matter of time until someone does something stupid and then they'll have all the justification they need.",
                "This is domestic terrorism. They have a almost complete disregard for our constitution. Anybody that is supportive of this behavior is complicit, not just morally bankrupt.\n\nThis administration has corporations, news media outlets, and cult followers bending the knee. \n\nThere is a reason that this administration has all the personnel in place with zero experience outside of loyalty.\n\n\"Were gonna make this a Christian Nation.\" Give the population more latitude on free religion, and the administration has better control on the populace. Ex: A 33 time felon fucking pornstars,...they don't care.\n\n.... I mean,..c'mon, a military parade in his honor?\n\nAnybody that doesn't see the reality of what is happening at this point is not ignorant. They know.",
                "We keep hearing about them rounding up a few people here and there in dramatic ways but has Trump actually made any impact on illegal immigrants as a whole? I wouldn’t be surprised if Biden deported more immigrants.",
                "First they came for the brown people, yet I did nothing cause I was not brown.\n\nThen they came for the transgender, yet I did nothing cause I was not transgender.\n\nThen they came for......\n\n  \nYou see where I'm going with this? Will Europe have to invade the USA to liberate those in the detention camps?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Benin admits that 54 soldiers killed in border attack by Jnim",
            "external_url": "https://www.bbc.com/news/articles/c4grjgkxn9vo",
            "upvotes": 1240,
            "date": "04/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/631e/live/bb40e620-20fe-11f0-9060-674316cb3a1f.jpg",
            "top_comments": [
                "For those curious like myself, Jnim is a terror org from Mali but active in a lot of west africa. They’re 4 groups that combined with a leader that pledged allegiance to the leader of the Taliban among others",
                "By the time the world pays attention, half of North and Central/West Africa will have these problems. Feels like Isis just moved from Syria to the Sahel.",
                "TIL Benin is a country I'd never heard of.  Really gotta improve my knowledge of African geography.",
                "Top comment on this thread is “I don’t know where Benin is”\n\nReddit, never change /s",
                " [Had to look it up …](https://www.britannica.com/place/Benin)",
                "Update: another attack happened today, this time an attack  on a French Supplied Vab.   key info is this happened in Borgu department which is far south of the attack which killed the 54 soldiers."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Pete Hegseth orders makeup studio installed at Pentagon.",
            "external_url": "https://www.cbsnews.com/news/hegseth-orders-makeup-studio-installed-pentagon/",
            "upvotes": 12171,
            "date": "04/24/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/22/11a3d5f1-6474-45f7-9b25-ba260adf85c3/thumbnail/1200x630/ca22e91bcfeff562b946ad603109d829/gettyimages-2210086493.jpg?v=3c17db24e594e0bfc14b069a51163c10",
            "top_comments": [
                "Army Regulation 670-1 3-2b.(1)  (Cosmetics) \n>* Males are prohibited from wearing cosmetics, except when medically prescribed\n\nDoctors note, please?\n\nTrump's doctor excluded.",
                "He’s an abject failure of a human.",
                "I’m eagerly waiting for Fox entertainment to report out on this one",
                "I never want to hear about Pete Buttigieg being too gay for office again.",
                "First it was the leaks, now he has gone rouge.",
                "Where is Doge when you actually have waste.",
                "This sounds like a waste doge can actually handle.\nCome on democrats, he’s giving you gold on a platter and nothing? \n\n- is he transitioning?\n- or example of wrong hire?\n-or corruption?\n\nNothing?\n\n(Answer: 2 and 3)",
                "His sideburns are still drunk",
                "Trump and Drunk Pete wear more makeup than Ru Paul and then lecture everyone on being manly men, warfighters. JD is going to have to expand beyond mascara if he wants to be fabulously vain like those  dipshits. Maybe Pete can give him a makeover and spill the classified tea.",
                "Truly a “ non military wimp “ - no example for soldiers"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Tornado victims blocked from federal recovery aid after Trump denied request",
            "external_url": "https://edition.cnn.com/2025/04/23/weather/trump-denied-disaster-aid-arkansas-tornadoes/index.html",
            "upvotes": 12551,
            "date": "04/23/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/img-2960.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "This nugget shocked me..\n\nTrump easily carried the state or Arkansas for the third time in a row in 2024, this time by a 30.64% margin, the largest since 1972.\n\nFrom article-\n\nDisaster survivors in Arkansas left homeless by recent tornadoes have been blocked from receiving federal recovery aid after President Donald Trump rejected the state’s request to declare a major disaster in March.\n\nThe Trump administration denied Republican Gov. Sarah Huckabee Sanders’ request for individual and public assistance following an outbreak of severe storms and tornadoes that also affected neighboring Mississippi and Missouri and left more than 40 people dead.",
                "Gonna start selling MAGA bootstraps on every religious radio station in that state.",
                "All the Leopards eating faces would be pretty entertaining if it wasn't for the fact that good people who didn't vote for this are also suffering.",
                "YUP. There is only one way for all this to go, going forward. NOT looking forward to the wildfires and hurricane season later in the year.",
                "God, remember when conservatives were whining about Biden not “funding FEMA” while voting for the republican Congress members who campaigned on defunding FEMA? \n\nI’m sick of maga cult members not understanding their own fucking politics.",
                "Where is the outcry from the ignorant conservatives who were super pissed when they believed the lie that Biden was cutting fema to red states?",
                "Red state asks for help because they can’t afford a few billion to cover a disaster.  So, like a \\*\\*communist\\*\\* state, they ask the rest of us to pay for their misfortune.    \n\n\nMaybe their god can share some of those prosperity dollars they have collected to help out. \n\n/s.  I don’t want to see people suffer.  I really don’t. But it is incredibly hard not to turn a blind eye to the plight of people who continue to dig their own graves while screaming to bring the rest of us down as well.",
                "Thanks for voting for me Arkansas... but tornadoes are your problem.",
                "Another red state discovers leopards.",
                "Is this going to get the same play on MSM that trump's attacks on Biden/Harris in '24 about North Carolina got?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Dozen states sue Trump in bid to block new tariffs",
            "external_url": "https://www.cnbc.com/2025/04/23/states-sue-trump-in-bid-to-block-new-tariffs.html",
            "upvotes": 46076,
            "date": "04/23/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108102916-1739560760118-gettyimages-2199659780-mms20867_kamriiiu.jpeg?v=1745437525&w=1920&h=1080",
            "top_comments": [
                "In addition to New York, the plaintiffs in the new lawsuit filed Wednesday include Arizona, Colorado, Connecticut, Delaware, Illinois, Maine, Minnesota, New Mexico, Oregon, and Vermont",
                "Good, because this shit is weeks away from causing about half my industry to disappear.",
                "Take me back to 2024 before this administration",
                "There was clip of powerful bankers in his office and he  was saying he made 900 million yesterday, and this other guy made 2.5 billion. He’s causing dips on purpose so him and rich friends can buy low and then sell later. He announced some tariffs a while back then walked them back 90 days later. This is market manipulation.",
                "I work for a solar company who everyone here (aside from me) are Trump voters. Yet they’re all still licking his boot.",
                "Couldn't they just get their congress members to, do their job instead?",
                "Thank you to every single state doing this, sadly I'm not in one.",
                "Taxation without representation!  Throw it all into the harbor, boys!",
                "It’s one of the single dumbest things I’ve ever seen an individual do. And he happens to be the most powerful individual in the world. Pretty amazing, in a weird way",
                "If you live in a red state (like me) and are thinking of moving somewhere away from the madness (at least a little bit) then you now have a list of states that will at least try to stand up for their citizens in the face of this insanity. \n\n\"In addition to New York, the plaintiffs in the new lawsuit filed Wednesday include Arizona, Colorado, Connecticut, Delaware, Illinois, Maine, Minnesota, New Mexico, Oregon, and Vermont.\"\n\nNot saying there's not crazy to be had everywhere, but I'm going to assume most of these states are not trying to make it illegal to speak badly about Trump, make Trump's birthday a holiday, rename major airport after him, and ask his administration with help in ensuring they'll be able to keep the billions in federal tax subsidies for public education after they pass an unconstitutional bill to ban undocumented kids from public schools. All of this and more is happening in Tennessee- and the news says the tariffs will hurt TN too- but our spineless and horrid super majority GOP state government is too busy doing racist, bigoted victory laps to care."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "After a month of searching, man learns from NBC News that DHS sent his brother to El Salvador",
            "external_url": "https://www.nbcnews.com/news/rcna202279",
            "upvotes": 20904,
            "date": "04/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250422-Neiyerver-Adrian-Leon-Rengel-ac-754p-339b39.jpg",
            "top_comments": [
                "How many people have been disappeared that we don't  even know about?",
                "That must’ve been a horrifying revelation. Like on the one hand you’d be glad that you know where they are, but on the other hand holy fuck they’re at a forced labor camp in a different country.\n\nEdit Apologies, he may be at a concentration camp or death camp instead. I was going off the fact that the president of El Salvador said that he was going to be using these prisoners for labor.",
                ">Asked for details and documents supporting DHS’ allegations of criminality, McLaughlin responded: “We aren’t going to share intelligence reports and undermine national security every time a gang member denies he is one. That would be insane.” \n\n\nTranslation here is \"We don't have any, besides that he's Venezuelan. We also didn't bother with due process.\"",
                "So the secret police took him away and couldn't be bothered to notify anybody? They're likely in a concentration camp...",
                ">Adrián, 27, came to the United States in 2023 by appointment through the CBP One app. Alejandro provided NBC News a photo of a printout confirming his brother’s June 12, 2023, appointment.  \n\n>Adrián had also applied for temporary protected status, according to a Dec. 1, 2024, document from U.S. Citizenship and Immigration Services, a part of DHS that handles immigration benefits. \n\nSo this guy did EXACTLY what the government asked him to do to come in legally, and they still said he was here illegally.",
                "> Asked for details and documents supporting DHS’ allegations of criminality, McLaughlin responded: “We aren’t going to share intelligence reports and undermine national security every time a gang member denies he is one. That would be insane.”\n\nLiterally the administration is arguing that they shouldn’t have to prove anything in court or anywhere else.  They scoop people off the street, deport them to a foreign gulag, and when asked why, respond “trust me bro. . . “\n\nHow conservatives can defend this shit is beyond me.",
                "\"The law holds that it is better that ten guilty persons escape than that one innocent suffer.\"\n\n\\-- William Blackstone, 1760s\n\n\"We're getting them out... and you can't have a trial for all of these people.\"\n\n\\-- Donald Trump, 04/22/2025",
                "This is so goddamn repulsive. It’s ghoulish.",
                "That’s the thing… they’re all crying “We’re not members of Tren de Agua!” But the problem is we’ll never know. They never got to respond to the government’s very serious allegations against them and are now indefinitely detained in a country they are not from. This is actually really fucked.",
                "Think of every despotic, authoritarian government that disappears people off its streets and denies it all, and realize that this is what the United States of America is under the Republicans."
            ],
            "aggregate_sentiment": 14.0
        }
    ],
    "last_updated": "04/24/2025 16:11:21 UTC"
}