{
    "posts": [
        {
            "category": "HOT",
            "title": "U.S. Marine in Okinawa indicted over rape, injury",
            "external_url": "https://english.kyodonews.net/news/2025/04/5413b1fdde94-us-marine-in-okinawa-indicted-over-rape-injury.html",
            "upvotes": 9359,
            "date": "05/01/2025",
            "thumbnail": "https://img.kyodonews.net/english/public/images/posts/1a71a3b6018cfd9dd803de89574f1b7e/cropped_image_l.jpg",
            "top_comments": [
                "Same old shit, different year. I remember arriving in Okinawa in 2004 right before bases went on lock down because some Air Force SSgt liked school girls.",
                "I visited Japan back in 2019 and my cousin, who was stationed there, couldn't hang out with me until the very last day of my trip because the base had gone in to lockdown over some rapes that transpired in Okinawa.",
                "Holy fuck shots\n\n\"We cannot help but have doubts regarding the education and management of U.S. military personnel. We strongly urge the implementation of more effective countermeasures,\" \n\nHoly fuck this guy is bonkers.\n\n\"According to the indictment, Wedington choked a female civilian worker in a base lavatory before sexually assaulting her against a stall door and then stomped on the face of the woman who tried to rescue her.\"",
                "Same old shit, different year, I remember being on Oki back in 2010 and left just before the bases got locked down and drinking secured because some reserve fly boys thought consent ended at the international date line.\n\nWalk down any strip near a base at 9pm and its embarassing how our servicemen present themselves. \n\nThe fact he has already been handed over to Japanese authorities sounds like SOFA is being waived and he is fuuuuuucked, he will likely be charged and serve time in the Japanese criminal justice system, then be handed back over to be charged again under the UCMJ.   \n  \nU.S. and Japanese legal systems are considered **separate sovereigns**, so prosecution by both does **not** violate double jeopardy laws.",
                "Does this happen more frequently in Okinawa compared to other international bases?",
                "Why is it always Marines? I'm sure Army, Navy... etc are guilty as well, but it really seems 90% of issues in Okinawa are from Marines.",
                "Fuck, man.  This shit again.  Was stationed in Japan from 08 - 14.  Towards the end of my time there, some sailors decided to rape and murder a local girl which sent the whole of Japan bases on lockdown and curfews.  This shit just keeps happening.  Fucking clowns.  To hell with this guy.",
                "So that place still the same since I was there in 2000.",
                "Ah yes Okinawa marines and rape. Truly a combo",
                ">U.S. Ambassador to Japan **George Glass** said in a statement that he was \"disturbed\" by the allegations, \n\nHe went from being Jan Brady's [boyfriend](https://bradybunch.fandom.com/wiki/George_Glass) to US Ambassador to Japan.  Pretty impressive."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Trump shuts down program to end human waste backing into Alabama homes, calling it ‘illegal DEI’",
            "external_url": "https://www.nbcnews.com/news/nbcblk/trump-canceled-dei-program-raw-sewage-alabaman-homes-rcna201164",
            "upvotes": 33945,
            "date": "05/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-alabama-rural-water-mn-1240-060c98.jpg",
            "top_comments": [
                "“The problem has existed so long and was so pervasive that a 2017 study determined 1 in every 3 adults in the county had the intestinal parasite hookworm. “\n\nNice",
                "Let me guess the program was helping minority communities (the most common community that is effected by pollution) in Alabama, but because helping minorities is ‘illegal DEI’ then it had to be removed",
                "Can we focus on that \"illegal DEI\" comment for a moment? He's now saying that DEI is *against the law*. Not just something he wants to stop, but something that will get you thrown in jail. \n\nDoing anything that benefits anyone other than cis straight White men with zero disabilities is now illegal.",
                "I guess Alabama will now be literally full of shit.",
                "Apparently not drinking or bathing in water tainted with human excrement is (checks notes) *woke*.",
                "He says “environmental justice” is a diversity, equity and inclusion program. Somehow.",
                "Anyone noticing everything benefitting anyone other than wealthy, white, male, Christian, heterosexuals is being killed for being DEI?\n\nThey've found a way to back door discrimination.",
                "So the federal government is shutting down a program because of the race and color of those benefitting from it.\n\nMaybe...https://uscode.house.gov/view.xhtml?req=(title:42%20section:1983%20edition:prelim)",
                "Reminder that DEI is not illegal, even if that was a valid argument, which it's not.",
                "To be extremely clear: \n\nThe program itself has nothing to do with DEI. The program itself has nothing to do with racism.\n\nThe program is simply because 1 in 3 people there have intestinal parasitic hookworms, due to an extremely unsafe lack of proper sanitation.\n\nThe REASON this area has zero infrastructure for good sanitation is because the federal government and the state of Alabama have been extremely racist for 150 years, since black people were allowed to own land. The only place they were allowed to buy land was an area which was very low and had soil which made it basically impossible to dig sanitation infrastructure. \n\nOn top of that, due to segregationist zoning laws and redlining, their parents and grandparents were prohibited from buying land elsewhere. \n\nNow, they cannot move because the land they live on is basically worthless - nobody would want to buy their property for a reasonable price - and they cannot climb out of poverty due to suppressed wages and higher medical bills - due to the lack of sanitation.\n\nCan't sell the land, can't get better wages, can't climb out of poverty. \n\nThis is true for all the people there, regardless of race.\n\nSo, to repeat myself: the *current program* has nothing to do with DEI and race. Everyone who lives there benefits from it.\n\nThis is  also a perfect example of Critical Race Theory - it's not about anyone *currently* being racist. It's just that centuries of racism created this situation, and we need to fix it. \n\nDonald Trump, and Republicans, want to get rid of it because *they* are racist, though."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Critically ill 9/11 first responders are being turned away from the program meant to save them",
            "external_url": "https://abcnews.go.com/US/critically-ill-911-responders-turned-program-meant-save/story?id=121338021",
            "upvotes": 48018,
            "date": "05/01/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1d68ac5d-43f3-4701-8892-aeb3f5ac40dc/firefighter-helmet-gty-jef-250501_1746117071710_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I feel the need to clarify something. The WTC healthcare program is not just for NYC first responders, it's for anyone who lived and worked within a certain area of the event. Volunteer doctors and nurses came from as far as Canada to help in the immediate aftermath and are now sick. People went back to work and school in the area because the government said it was safe. \n\nANYONE who lived or worked in that area in the following months need to sign up for the healthcare program to be monitored.",
                "Isn't this what they wanted? Traded a 30 min DEI course you had to take for work for tax cuts and no support for healthcare. Great choice!",
                "Sucks that most first responders voted for this. Jon Stewart couldn't save them from themselves. 🤷‍♂️",
                "Republicans hate first responders and veterans; they vote against them an overwhelming majority of the time.",
                ">The program now serves more than 150,000 people nationwide, up from about 76,000 in 2015, according to data from the Centers for Disease Control and Prevention. A bipartisan bill, HR 1410, was introduced in February to close the funding gap as enrollment surged, but it remains stalled in Congress.\n\nHR 1410 was introduced February 18th of this year and was sent to the House Committee on Energy and Commerce. It hasn't moved there since.",
                "Notice how the filthy troglodyte robber barons take and take and say there is not enough to go around? No one needs 100 million dollars, much less 100 billion!",
                "*Jon Stewart didn't like that*",
                "9/11 firefighters are treated far worse than J6ers",
                "We winning yet? \n\nIdk why we are suprised. Republicans have always faught the 9/11 suvivors fund...",
                "may you live in interesting times \n\nmay you come to the attention of those in authority \n\nmay the gods give you everything you ask for\n\nCongrats firefighters you got all three!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "White House national security adviser Waltz to leave post, sources say",
            "external_url": "https://www.reuters.com/world/us/white-house-national-security-adviser-waltz-leave-post-source-says-2025-05-01/",
            "upvotes": 13156,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is this one of the first departures of MAGA2025?",
                "How many mooches long is this?",
                "I wonder if Hegseth understands this makes it more likely that he's fucked, not less. Waltz just got motivated to talk honestly about him.",
                "I wonder if the last 3.5 months for him were worth giving up a safe congressional seat.",
                "Laura Loomer runs National security",
                "how long before Donnie starts trashing them?",
                "This MFer is leaving, not because he shared the plans or was using Signal to do it, but because he had that journalist from the Atlantic in his contacts.  It's the same journalist that reported Trump calling the enlisted \"Suckers and Losers\" so Trump HATES that guy.  To see one of his people have his direct contact sent Trump into a paranoid spiral and he would never trust Mike Waltz again.  No coming back for him.",
                "“When a clown moves into a palace, he does not become a king, instead the palace becomes a circus”",
                "I think it has something to do with doge getting access to nuke systems, stealing ssn, and providing access to the Russians via ‘unsecure’ means.  I think this is also why musk is ‘stepping back’.  All of this happened around the time those reports and the whistleblower came out.  I’m guessing it’s bad bad.",
                "Waltz has left the group chat."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Jill Sobule, the singer-songwriter known for ‘I Kissed a Girl,’ has died in a fire",
            "external_url": "https://apnews.com/article/singer-jill-sobule-died-b4e86bd7f089df00da536ea9815bce03",
            "upvotes": 787,
            "date": "05/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is a little bit of an aside but I just want to spread the PSA:  \n\nHouse fires are dangerous as fuck.   You might only have minutes to get out.   I was with my mom when my parents' house burned half-way down (started by a battery).   From the moment the alarms went off to when we would have been fucked was about 6 minutes.  \n\nTake that shit seriously.",
                ">Sobule was known for taking control of her career by fundraising so she could make her next album. In 2008, after two major record companies dumped her and two indie labels went bankrupt beneath her, she raised tens of thousands of dollars from fans so she could make a new album.\n\nNice. A take charge lady who kick-started before Kickstarter.",
                "Oh fuck. I remember she did some videos and livestreams with Kate Micucci and they were all wonderful, this is such a tragedy.",
                "‘Cause I’m young, and I’m hip, and so beautiful! I’m gonna be a supermodel!\n \n😢",
                "That song meant a lot to so many, heartbreaking way to go. Rest easy, Jill.",
                "I met her many years ago now, but I've never forgotten how nice she was. It was easily one of the warmest and most genuine celebrity interactions I've ever had.\n\nWhat a loss. May her memory be a blessing, especially under such awful circumstances.",
                "So Katy Perry's onslaught continues.  First that nun and now this woman.  How monstrous.",
                "Listen to her song “Lucy at the Gym”….Truly so sad that such a spirit left this earth far too soon.",
                "Didnt this lady just do an ama on askmeanything on here about the music shed written like this song",
                "I remember that song/video. Sad. "
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Justice Department sues Hawaii, Michigan over plans to sue fossil fuel companies for climate harm",
            "external_url": "https://apnews.com/article/trump-doj-climate-states-policy-lawsuits-a5228e1dd6348f09d2a70f460142531a",
            "upvotes": 2941,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the article:\n\n> In court filings, the DOJ said the Clean Air Act — a federal law authorizing the Environmental Protection Agency to regulate air emissions — “creates a comprehensive program for regulating air pollution in the United States and “displaces” the ability of States to regulate greenhouse gas emissions beyond their borders.”\n\nDidn't the Trump administration make a big stink about how governmental agencies don't have the power to direct and lead policy decisions?",
                "I'm glad the government is standing up for the little guy.  Multi billion dollar corporations are people too, just unlike you and me.",
                "Small government, states rights, and all that jazz…",
                "You're gonna sue _us_? No. WE DOUBLE DOG SUE YOU!!1!",
                "It's all about states rights... until it isn't.",
                "So they're being prosecuted for pre-crime?",
                "Can you even sue someone for the sole reason that someone sues someone else??? Do you even have a standing?",
                "The justice department is going to have to prove to a judge what damages would be caused by another state suing fossil fuel companies.",
                "The trump regime and his republican sycophants HATE actual hard-working Americans.",
                "All the corporate cocks in Trump's and bondi's mouths, it's amazing they're still able to speak."
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "HOT",
            "title": "Education Department stops $1 billion in funding for school mental health",
            "external_url": "https://www.npr.org/2025/05/01/nx-s1-5382582/trump-school-mental-health",
            "upvotes": 6092,
            "date": "05/01/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+430/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F28%2F70%2Fb8e504e5426384e23dd10894cbb8%2Fgettyimages-2206185094.jpg",
            "top_comments": [
                "Interesting this drops on the same day the Supreme Court is expected to rule states are obligated to fund religious charter schools. We have to pay for religion with our tax dollars, but can't pay for mental health i suppose.",
                "They are literally writing entire books about how these kids are suffering from mental health issues. It's ok though remember this country doesn't have a gun problem it has a mental health problem.",
                "Conservatives say school shootings are a mental health problem and then do shit like this",
                "This is how you get school shootings. But at this point I think that's what this administration wants.",
                "Weren’t school shootings about mental health?",
                "\"It's not the guns! It's a mental health issue!\"\n\nProceeds to gut mental health support. \n\nFuck the GOP.",
                "Republicans have always been about short term thinking. \n\nTheir biggest concerns are how to make fast money and they dismiss climate change or investments into society. This is why they hate scientists, economists, analysts and historians. Anyone who isn’t helping them gain immediate wealth is trying to sabotage them. And that is why the current administration is operating under the republican golden rule:  \n\n“if we can’t monetize it then we will destroy it”. \n\nGreenland, Canada, Ukraine, Education, Healthcare, Social Security, EVs, Windmills, FEMA and National Parks. All things that should be invested into (or at least left alone) are viewed as enemies to America because “How can these things exist without huge personal profit?”  \n\nDe-investing Education, Mental Health and Kids is going to create the absolute worst society possible. And this is why putting these things in the hands of people who wont be here in a decade is so destructive. They aren’t looking at the future, they’re trying to cash in now.",
                "We are an evil country. There's no other way to say it that won't get me banned, lol",
                "Just our kids, folks.  You know, the future of our nation … \n\nCan’t think of a single, solitary, rational reason that investing money into the mental health of our children is a bad thing.",
                "The rate at which they are completely dismantling anything that helps american people is staggering.  Like, i would have thought it would be more difficult to do, but in 100 days, Trump has done more than a military strike against America would have done.  \n\nIt's all so strange, since he was so ineffective his first time as President.  But, I guess he was 'new' to it, and tried to surround himself with actual politicians at the time, rather than people who are yes-men or even worse than he is."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Bay Area parent calls for baseball season to end after anti-Asian taunts",
            "external_url": "https://www.sfgate.com/bayarea/article/bay-area-parent-baseball-season-racism-20305307.php",
            "upvotes": 898,
            "date": "05/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That’s pretty shitty.  \n\nWhen I played ball as a kid, our coach would have ate us alive for disgracing the game, shaming our school, and letting our community down.\n\nSounds like some real accountability problems with that team and its leadership.",
                "You gotta punish folks for this or else racists are gonna continue to behave this way. You have to hold coaches accountable too. Players involved in this kind of behavior need to be benched or kicked off the team.",
                "Unfortunate that his son had to go through this. But this once again proves that Asian racism is not taken as seriously.",
                "No need to cancel the rest of the season, just bar that one team for the remainder.",
                "It's the pattern of Asian racism in these high school baseball games that's at issue, not just the one or two games mentioned in this article. But there's enough here to indicate a pattern.  This also aligns with the increasing Asian racism in California--perhaps associated with the trade war or a lot of the oft mentioned possible war with China--and the deportations of international students (many of whom are envied/disliked by American students)",
                "First off, absolutely unacceptable behavior. Having played baseball myself, I know our coach would have never let us get away with this. \n\nBut looking through the comments, it’s clear how disconnected many Redditors are from reality. The narrative that this is just “Trump white people being racist” doesn’t hold up when you consider that the school is only 12.9% white. It’s time to step outside the echo chamber and acknowledge that anti-Asian hate isn’t solely coming from the direction many of you just assume.\n\nIf we can't address the problem as it really is we can't and won't solve anything.",
                "wtf is happening to the Bay Area",
                "I wonder if this is exacerbated by the best most famous MLB player being east Asian. I bet some racist white folk are salty about it",
                "All the pictures of Pinole Valley High School I see on Google feature African-American students or Latinos....so it all makes sense.",
                "The head coach is responsible for the culture of the team. He should be fired for allowing this behavior to go on. My son played Little League and had been on a team with a coach like this. It's a disgrace. We need to prioritize sportsmanship over winning games. If I had done this on my high school basketball team my coach and the principal would have kicked my ass."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Israel has no duty to allow UN aid agency into Gaza, says US state department lawyer | Israel-Gaza war | The Guardian",
            "external_url": "https://www.theguardian.com/world/2025/apr/30/israel-has-no-duty-to-allow-un-aid-agency-into-gaza-says-us-state-department-lawyer",
            "upvotes": 263,
            "date": "05/02/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f32329cda40d24c8426993d31d34e92196e8ac71/0_245_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d7e51d6b32641d1cbcce06d8fd26c0ef",
            "top_comments": [
                "So what is the defence here? They accept Israel has obligations to protect civilians but not that they have to work with UNRWA. So where are these alternative methods to support the civilian population?\n\nHow does this square with the claim that Hamas steals the aid? I mean if Hamas has been stealing aid, then it is clear that the civilians will starve before Hamas if you don’t led aid in.\n\nNone of this passes any logic test.\n\nBut then again I have not seen a single journalist ask the question how preventing aid will impact Hamas before it will impact civilians.",
                "We can all argue about the Israel/Palestine situation til we're blue in the face (I've personally been watching people do it for well over 50 years) but what could the possibly be the virtue of not allowing emergency aid to starving/wounded people - if not barefaced cruelty?",
                "People will starve to death.. this is crazy.",
                "You know you might be a nazi when you’re arguing that someone is absolved of guilt because they’re not legally obligated to do the morally and ethically right thing.",
                "Cool so our ethics and common decency has been bought and paid for by AIPAC rad ; this time line is dog shit",
                "Their ancestors that were murdered in the Holocaust would be absolutely ashamed.",
                "Don’t tell me… this is in defence of them senselessly ambushing and slaughting all those UN aid workers in cold blood?",
                "Record what Israel is doing. \n\nVery soon, America will do the exact same thing only everything will be live streamed and countries against such blatant disregard for human lives will have their capital bombed as a warning.",
                "The United States, former champions of human rights, and now supporters of a genocide.",
                "Sure. Perfectly true. \n\nBut then the UN and the rest of the world has no duty to tolerate a war of extinction and occupation. \n\nIf Israel discards any and all humanitarian concerns and make this an all out war, where one side is immensely more powerful, then they loose any and all current tolerance. Period."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Kohl's CEO ousted amid allegations of undisclosed conflicts of interest",
            "external_url": "https://www.denver7.com/business/company-news/kohls-ceo-ousted-amid-allegations-of-undisclosed-conflicts-of-interest",
            "upvotes": 1950,
            "date": "05/01/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/9702aab/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fcd%2Fd4%2F726699724b699961ede3b2330243%2F1702512423-lbmffs.jpg",
            "top_comments": [
                "Spicy headline. Article reads “Mr. Buchanan violated company policies by directing the company to engage in vendor transactions that involved undisclosed conflicts of interest, which the Board determined to be cause,\" Kohl's said in a statement” without any more details.",
                "His severance package includes $3.7m in Kohls Cash which will expire in two weeks if unused and cannot be combined with other coupons or offers",
                "I love Kohl’s. Buy two tshirts and somehow save 200 dollars.",
                "Kirk Cousins retires and becomes new Kohl’s CEO.",
                "Hated that man when he ran Michael's. Glad he was ousted",
                "Funny that kohls doesn’t like conflicts of interest, but when it comes to POTUS, well…it’s a feature, not a bug!",
                "You know all of the low level employees are going to forego any raises and have to take some useless training as the company's response to addressing this.",
                "\\[turning to the camera & whispering with one hand to the side of my mouth\\]  \n\"THIS is how you get ousted as CEO\"",
                "God, I wish Tesla's BOD would take a page out of Kohl's management style.",
                "See I would have guessed he was caught shopping at macys."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Mexico City bans violent bullfighting in bid to keep the tradition, but without the bloodshed",
            "external_url": "https://www.cbsnews.com/news/mexico-city-ban-violent-bullfighting-back-bloodless-bullfights/",
            "upvotes": 19,
            "date": "05/02/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/19/62236213-f328-4178-934f-d34ff11c463f/thumbnail/1200x630/3b44483feea07dbbe00ecca20daba708/mexico-bullfighting-1406776071.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Israel has no duty to allow UN aid agency into Gaza, says US state department lawyer | Israel-Gaza war | The Guardian",
            "external_url": "https://www.theguardian.com/world/2025/apr/30/israel-has-no-duty-to-allow-un-aid-agency-into-gaza-says-us-state-department-lawyer",
            "upvotes": 265,
            "date": "05/02/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f32329cda40d24c8426993d31d34e92196e8ac71/0_245_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d7e51d6b32641d1cbcce06d8fd26c0ef",
            "top_comments": [
                "So what is the defence here? They accept Israel has obligations to protect civilians but not that they have to work with UNRWA. So where are these alternative methods to support the civilian population?\n\nHow does this square with the claim that Hamas steals the aid? I mean if Hamas has been stealing aid, then it is clear that the civilians will starve before Hamas if you don’t led aid in.\n\nNone of this passes any logic test.\n\nBut then again I have not seen a single journalist ask the question how preventing aid will impact Hamas before it will impact civilians.",
                "We can all argue about the Israel/Palestine situation til we're blue in the face (I've personally been watching people do it for well over 50 years) but what could the possibly be the virtue of not allowing emergency aid to starving/wounded people - if not barefaced cruelty?",
                "People will starve to death.. this is crazy.",
                "You know you might be a nazi when you’re arguing that someone is absolved of guilt because they’re not legally obligated to do the morally and ethically right thing.",
                "Cool so our ethics and common decency has been bought and paid for by AIPAC rad ; this time line is dog shit",
                "Their ancestors that were murdered in the Holocaust would be absolutely ashamed.",
                "Don’t tell me… this is in defence of them senselessly ambushing and slaughting all those UN aid workers in cold blood?",
                "Record what Israel is doing. \n\nVery soon, America will do the exact same thing only everything will be live streamed and countries against such blatant disregard for human lives will have their capital bombed as a warning.",
                "The United States, former champions of human rights, and now supporters of a genocide.",
                "Sure. Perfectly true. \n\nBut then the UN and the rest of the world has no duty to tolerate a war of extinction and occupation. \n\nIf Israel discards any and all humanitarian concerns and make this an all out war, where one side is immensely more powerful, then they loose any and all current tolerance. Period."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "China sees surge in worker protests over unpaid wages, factory closures and US tariffs - The Economic Times",
            "external_url": "https://m.economictimes.com/news/international/global-trends/china-sees-surge-in-worker-protests-over-unpaid-wages-factory-closures-and-us-tariffs/articleshow/120796368.cms",
            "upvotes": 65,
            "date": "05/02/2025",
            "thumbnail": "https://img.etimg.com/thumb/msid-120796480,width-1200,height-630,imgsize-95498,overlay-economictimes/articleshow.jpg",
            "top_comments": [
                "Oh good, so it's a war of attrition. Those always turn out well. /s",
                "Workers in China shouldn’t be exploited or underpaid same with any factory or manufacturing work in US\n\nLooking it up apparently this is China’s unemployment benefits \n\n> The maximum duration for receiving unemployment benefits is determined by the cumulative contribution period: 1 to 5 years of contributions: Up to 12 months of benefits. 5 to 10 years of contributions: Up to 18 months of benefits. More than 10 years of contributions: Up to 24 months of benefits.",
                "Chinas cashflow economy of making and selling cheap electronics to western countries has dried up significantly… I’m not surprised"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Jill Sobule, the singer-songwriter known for ‘I Kissed a Girl,’ has died in a fire",
            "external_url": "https://apnews.com/article/singer-jill-sobule-died-b4e86bd7f089df00da536ea9815bce03",
            "upvotes": 789,
            "date": "05/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is a little bit of an aside but I just want to spread the PSA:  \n\nHouse fires are dangerous as fuck.   You might only have minutes to get out.   I was with my mom when my parents' house burned half-way down (started by a battery).   From the moment the alarms went off to when we would have been fucked was about 6 minutes.  \n\nTake that shit seriously.",
                ">Sobule was known for taking control of her career by fundraising so she could make her next album. In 2008, after two major record companies dumped her and two indie labels went bankrupt beneath her, she raised tens of thousands of dollars from fans so she could make a new album.\n\nNice. A take charge lady who kick-started before Kickstarter.",
                "Oh fuck. I remember she did some videos and livestreams with Kate Micucci and they were all wonderful, this is such a tragedy.",
                "‘Cause I’m young, and I’m hip, and so beautiful! I’m gonna be a supermodel!\n \n😢",
                "That song meant a lot to so many, heartbreaking way to go. Rest easy, Jill.",
                "I met her many years ago now, but I've never forgotten how nice she was. It was easily one of the warmest and most genuine celebrity interactions I've ever had.\n\nWhat a loss. May her memory be a blessing, especially under such awful circumstances.",
                "So Katy Perry's onslaught continues.  First that nun and now this woman.  How monstrous.",
                "Listen to her song “Lucy at the Gym”….Truly so sad that such a spirit left this earth far too soon.",
                "Didnt this lady just do an ama on askmeanything on here about the music shed written like this song",
                "I remember that song/video. Sad. "
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Bay Area parent calls for baseball season to end after anti-Asian taunts",
            "external_url": "https://www.sfgate.com/bayarea/article/bay-area-parent-baseball-season-racism-20305307.php",
            "upvotes": 900,
            "date": "05/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That’s pretty shitty.  \n\nWhen I played ball as a kid, our coach would have ate us alive for disgracing the game, shaming our school, and letting our community down.\n\nSounds like some real accountability problems with that team and its leadership.",
                "You gotta punish folks for this or else racists are gonna continue to behave this way. You have to hold coaches accountable too. Players involved in this kind of behavior need to be benched or kicked off the team.",
                "Unfortunate that his son had to go through this. But this once again proves that Asian racism is not taken as seriously.",
                "No need to cancel the rest of the season, just bar that one team for the remainder.",
                "It's the pattern of Asian racism in these high school baseball games that's at issue, not just the one or two games mentioned in this article. But there's enough here to indicate a pattern.  This also aligns with the increasing Asian racism in California--perhaps associated with the trade war or a lot of the oft mentioned possible war with China--and the deportations of international students (many of whom are envied/disliked by American students)",
                "First off, absolutely unacceptable behavior. Having played baseball myself, I know our coach would have never let us get away with this. \n\nBut looking through the comments, it’s clear how disconnected many Redditors are from reality. The narrative that this is just “Trump white people being racist” doesn’t hold up when you consider that the school is only 12.9% white. It’s time to step outside the echo chamber and acknowledge that anti-Asian hate isn’t solely coming from the direction many of you just assume.\n\nIf we can't address the problem as it really is we can't and won't solve anything.",
                "wtf is happening to the Bay Area",
                "I wonder if this is exacerbated by the best most famous MLB player being east Asian. I bet some racist white folk are salty about it",
                "All the pictures of Pinole Valley High School I see on Google feature African-American students or Latinos....so it all makes sense.",
                "The head coach is responsible for the culture of the team. He should be fired for allowing this behavior to go on. My son played Little League and had been on a team with a coach like this. It's a disgrace. We need to prioritize sportsmanship over winning games. If I had done this on my high school basketball team my coach and the principal would have kicked my ass."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "U.S. Marine in Okinawa indicted over rape, injury",
            "external_url": "https://english.kyodonews.net/news/2025/04/5413b1fdde94-us-marine-in-okinawa-indicted-over-rape-injury.html",
            "upvotes": 9353,
            "date": "05/01/2025",
            "thumbnail": "https://img.kyodonews.net/english/public/images/posts/1a71a3b6018cfd9dd803de89574f1b7e/cropped_image_l.jpg",
            "top_comments": [
                "Same old shit, different year. I remember arriving in Okinawa in 2004 right before bases went on lock down because some Air Force SSgt liked school girls.",
                "I visited Japan back in 2019 and my cousin, who was stationed there, couldn't hang out with me until the very last day of my trip because the base had gone in to lockdown over some rapes that transpired in Okinawa.",
                "Holy fuck shots\n\n\"We cannot help but have doubts regarding the education and management of U.S. military personnel. We strongly urge the implementation of more effective countermeasures,\" \n\nHoly fuck this guy is bonkers.\n\n\"According to the indictment, Wedington choked a female civilian worker in a base lavatory before sexually assaulting her against a stall door and then stomped on the face of the woman who tried to rescue her.\"",
                "Same old shit, different year, I remember being on Oki back in 2010 and left just before the bases got locked down and drinking secured because some reserve fly boys thought consent ended at the international date line.\n\nWalk down any strip near a base at 9pm and its embarassing how our servicemen present themselves. \n\nThe fact he has already been handed over to Japanese authorities sounds like SOFA is being waived and he is fuuuuuucked, he will likely be charged and serve time in the Japanese criminal justice system, then be handed back over to be charged again under the UCMJ.   \n  \nU.S. and Japanese legal systems are considered **separate sovereigns**, so prosecution by both does **not** violate double jeopardy laws.",
                "Does this happen more frequently in Okinawa compared to other international bases?",
                "Why is it always Marines? I'm sure Army, Navy... etc are guilty as well, but it really seems 90% of issues in Okinawa are from Marines.",
                "Fuck, man.  This shit again.  Was stationed in Japan from 08 - 14.  Towards the end of my time there, some sailors decided to rape and murder a local girl which sent the whole of Japan bases on lockdown and curfews.  This shit just keeps happening.  Fucking clowns.  To hell with this guy.",
                "So that place still the same since I was there in 2000.",
                "Ah yes Okinawa marines and rape. Truly a combo",
                ">U.S. Ambassador to Japan **George Glass** said in a statement that he was \"disturbed\" by the allegations, \n\nHe went from being Jan Brady's [boyfriend](https://bradybunch.fandom.com/wiki/George_Glass) to US Ambassador to Japan.  Pretty impressive."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Manhunt in South Carolina as police search for armed suspect who hit 2 kids, 1 adult with vehicle",
            "external_url": "https://www.nbcnews.com/news/us-news/manhunt-south-carolina-police-search-armed-suspect-hit-2-kids-1-adult-rcna204261",
            "upvotes": 427,
            "date": "05/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250501-sullivans-island-responders-se-413p-6866f3.jpg",
            "top_comments": [
                ">\"The driver of that vehicle fled the scene on foot and was last seen armed with a knife,\" Storen said. \n\nThat's the description? Not very helpful.",
                "The fact that he was taken alive confirms that he is white.",
                "Sad to see this kind of news. Praying for those involved."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Justice Department sues Hawaii, Michigan over plans to sue fossil fuel companies for climate harm",
            "external_url": "https://apnews.com/article/trump-doj-climate-states-policy-lawsuits-a5228e1dd6348f09d2a70f460142531a",
            "upvotes": 2938,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the article:\n\n> In court filings, the DOJ said the Clean Air Act — a federal law authorizing the Environmental Protection Agency to regulate air emissions — “creates a comprehensive program for regulating air pollution in the United States and “displaces” the ability of States to regulate greenhouse gas emissions beyond their borders.”\n\nDidn't the Trump administration make a big stink about how governmental agencies don't have the power to direct and lead policy decisions?",
                "I'm glad the government is standing up for the little guy.  Multi billion dollar corporations are people too, just unlike you and me.",
                "Small government, states rights, and all that jazz…",
                "You're gonna sue _us_? No. WE DOUBLE DOG SUE YOU!!1!",
                "It's all about states rights... until it isn't.",
                "So they're being prosecuted for pre-crime?",
                "Can you even sue someone for the sole reason that someone sues someone else??? Do you even have a standing?",
                "The justice department is going to have to prove to a judge what damages would be caused by another state suing fossil fuel companies.",
                "The trump regime and his republican sycophants HATE actual hard-working Americans.",
                "All the corporate cocks in Trump's and bondi's mouths, it's amazing they're still able to speak."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Kohl's CEO ousted amid allegations of undisclosed conflicts of interest",
            "external_url": "https://www.denver7.com/business/company-news/kohls-ceo-ousted-amid-allegations-of-undisclosed-conflicts-of-interest",
            "upvotes": 1955,
            "date": "05/01/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/9702aab/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fcd%2Fd4%2F726699724b699961ede3b2330243%2F1702512423-lbmffs.jpg",
            "top_comments": [
                "Spicy headline. Article reads “Mr. Buchanan violated company policies by directing the company to engage in vendor transactions that involved undisclosed conflicts of interest, which the Board determined to be cause,\" Kohl's said in a statement” without any more details.",
                "His severance package includes $3.7m in Kohls Cash which will expire in two weeks if unused and cannot be combined with other coupons or offers",
                "I love Kohl’s. Buy two tshirts and somehow save 200 dollars.",
                "Kirk Cousins retires and becomes new Kohl’s CEO.",
                "Hated that man when he ran Michael's. Glad he was ousted",
                "Funny that kohls doesn’t like conflicts of interest, but when it comes to POTUS, well…it’s a feature, not a bug!",
                "You know all of the low level employees are going to forego any raises and have to take some useless training as the company's response to addressing this.",
                "\\[turning to the camera & whispering with one hand to the side of my mouth\\]  \n\"THIS is how you get ousted as CEO\"",
                "God, I wish Tesla's BOD would take a page out of Kohl's management style.",
                "See I would have guessed he was caught shopping at macys."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "More than 100 children fall sick after dead snake reportedly found in school lunch in India",
            "external_url": "https://www.cbsnews.com/news/dead-snake-school-lunch-100-children-sick-india-report/",
            "upvotes": 1257,
            "date": "05/01/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/01/19629d99-068f-44da-a578-8a0bc6d3d3f2/thumbnail/1200x630/ce8e390ff36f84a152805a516484e043/gettyimages-1244020471.jpg?v=7c5acc180b39394767372ab4e02619ce",
            "top_comments": [
                "India's human rights commission is investigating an incident in which more than 100 children became sick after eating a school lunch contaminated by a dead snake at a government-run school in Mokama, Bihar. According to reports, the cook served the meal even after removing the snake from the food, resulting in illnesses among the children and triggering angry protests from their families. The commission has requested local authorities to submit a detailed report, highlighting concerns of human rights violations and ongoing issues of poor food hygiene associated with India's free Mid-Day Meal scheme, a program aimed at encouraging school attendance among disadvantaged children. This incident echoes a tragic 2013 event in Bihar, where 23 children died due to a pesticide-contaminated school meal.",
                "You know it's bad when a food mishandling story in India makes the news.",
                "I wonder what type of illness can a snake pass to you?",
                "I hope all the kids will be ok.",
                "You friggin pedestrian, for the 1000th time, snakes are venomous not poiso..... Oh wait.",
                "Makes me think about all the videos I see in India where they are serving street food that is unrecognizable. I always wonder how people don’t get sick from it.",
                "Gross ass India failing basic food sanitation. Who would’ve thought?",
                "School lunches these days, smh.",
                "Indian parents need to start spreading peanut butter and jelly on bread and throw it into a paper bag with a twinkie and a banana. That's how my mom protected us from shitty school lunches.",
                "[deleted]"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Israel has no duty to allow UN aid agency into Gaza, says US state department lawyer | Israel-Gaza war | The Guardian",
            "external_url": "https://www.theguardian.com/world/2025/apr/30/israel-has-no-duty-to-allow-un-aid-agency-into-gaza-says-us-state-department-lawyer",
            "upvotes": 267,
            "date": "05/02/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f32329cda40d24c8426993d31d34e92196e8ac71/0_245_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d7e51d6b32641d1cbcce06d8fd26c0ef",
            "top_comments": [
                "So what is the defence here? They accept Israel has obligations to protect civilians but not that they have to work with UNRWA. So where are these alternative methods to support the civilian population?\n\nHow does this square with the claim that Hamas steals the aid? I mean if Hamas has been stealing aid, then it is clear that the civilians will starve before Hamas if you don’t led aid in.\n\nNone of this passes any logic test.\n\nBut then again I have not seen a single journalist ask the question how preventing aid will impact Hamas before it will impact civilians.",
                "We can all argue about the Israel/Palestine situation til we're blue in the face (I've personally been watching people do it for well over 50 years) but what could the possibly be the virtue of not allowing emergency aid to starving/wounded people - if not barefaced cruelty?",
                "People will starve to death.. this is crazy.",
                "You know you might be a nazi when you’re arguing that someone is absolved of guilt because they’re not legally obligated to do the morally and ethically right thing.",
                "Cool so our ethics and common decency has been bought and paid for by AIPAC rad ; this time line is dog shit",
                "Their ancestors that were murdered in the Holocaust would be absolutely ashamed.",
                "Don’t tell me… this is in defence of them senselessly ambushing and slaughting all those UN aid workers in cold blood?",
                "Record what Israel is doing. \n\nVery soon, America will do the exact same thing only everything will be live streamed and countries against such blatant disregard for human lives will have their capital bombed as a warning.",
                "The United States, former champions of human rights, and now supporters of a genocide.",
                "Sure. Perfectly true. \n\nBut then the UN and the rest of the world has no duty to tolerate a war of extinction and occupation. \n\nIf Israel discards any and all humanitarian concerns and make this an all out war, where one side is immensely more powerful, then they loose any and all current tolerance. Period."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Jill Sobule, the singer-songwriter known for ‘I Kissed a Girl,’ has died in a fire",
            "external_url": "https://apnews.com/article/singer-jill-sobule-died-b4e86bd7f089df00da536ea9815bce03",
            "upvotes": 787,
            "date": "05/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is a little bit of an aside but I just want to spread the PSA:  \n\nHouse fires are dangerous as fuck.   You might only have minutes to get out.   I was with my mom when my parents' house burned half-way down (started by a battery).   From the moment the alarms went off to when we would have been fucked was about 6 minutes.  \n\nTake that shit seriously.",
                ">Sobule was known for taking control of her career by fundraising so she could make her next album. In 2008, after two major record companies dumped her and two indie labels went bankrupt beneath her, she raised tens of thousands of dollars from fans so she could make a new album.\n\nNice. A take charge lady who kick-started before Kickstarter.",
                "Oh fuck. I remember she did some videos and livestreams with Kate Micucci and they were all wonderful, this is such a tragedy.",
                "‘Cause I’m young, and I’m hip, and so beautiful! I’m gonna be a supermodel!\n \n😢",
                "That song meant a lot to so many, heartbreaking way to go. Rest easy, Jill.",
                "I met her many years ago now, but I've never forgotten how nice she was. It was easily one of the warmest and most genuine celebrity interactions I've ever had.\n\nWhat a loss. May her memory be a blessing, especially under such awful circumstances.",
                "So Katy Perry's onslaught continues.  First that nun and now this woman.  How monstrous.",
                "Listen to her song “Lucy at the Gym”….Truly so sad that such a spirit left this earth far too soon.",
                "Didnt this lady just do an ama on askmeanything on here about the music shed written like this song",
                "I remember that song/video. Sad. "
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "U.S. Marine in Okinawa indicted over rape, injury",
            "external_url": "https://english.kyodonews.net/news/2025/04/5413b1fdde94-us-marine-in-okinawa-indicted-over-rape-injury.html",
            "upvotes": 9354,
            "date": "05/01/2025",
            "thumbnail": "https://img.kyodonews.net/english/public/images/posts/1a71a3b6018cfd9dd803de89574f1b7e/cropped_image_l.jpg",
            "top_comments": [
                "Same old shit, different year. I remember arriving in Okinawa in 2004 right before bases went on lock down because some Air Force SSgt liked school girls.",
                "I visited Japan back in 2019 and my cousin, who was stationed there, couldn't hang out with me until the very last day of my trip because the base had gone in to lockdown over some rapes that transpired in Okinawa.",
                "Holy fuck shots\n\n\"We cannot help but have doubts regarding the education and management of U.S. military personnel. We strongly urge the implementation of more effective countermeasures,\" \n\nHoly fuck this guy is bonkers.\n\n\"According to the indictment, Wedington choked a female civilian worker in a base lavatory before sexually assaulting her against a stall door and then stomped on the face of the woman who tried to rescue her.\"",
                "Same old shit, different year, I remember being on Oki back in 2010 and left just before the bases got locked down and drinking secured because some reserve fly boys thought consent ended at the international date line.\n\nWalk down any strip near a base at 9pm and its embarassing how our servicemen present themselves. \n\nThe fact he has already been handed over to Japanese authorities sounds like SOFA is being waived and he is fuuuuuucked, he will likely be charged and serve time in the Japanese criminal justice system, then be handed back over to be charged again under the UCMJ.   \n  \nU.S. and Japanese legal systems are considered **separate sovereigns**, so prosecution by both does **not** violate double jeopardy laws.",
                "Does this happen more frequently in Okinawa compared to other international bases?",
                "Why is it always Marines? I'm sure Army, Navy... etc are guilty as well, but it really seems 90% of issues in Okinawa are from Marines.",
                "Fuck, man.  This shit again.  Was stationed in Japan from 08 - 14.  Towards the end of my time there, some sailors decided to rape and murder a local girl which sent the whole of Japan bases on lockdown and curfews.  This shit just keeps happening.  Fucking clowns.  To hell with this guy.",
                "So that place still the same since I was there in 2000.",
                "Ah yes Okinawa marines and rape. Truly a combo",
                ">U.S. Ambassador to Japan **George Glass** said in a statement that he was \"disturbed\" by the allegations, \n\nHe went from being Jan Brady's [boyfriend](https://bradybunch.fandom.com/wiki/George_Glass) to US Ambassador to Japan.  Pretty impressive."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Bay Area parent calls for baseball season to end after anti-Asian taunts",
            "external_url": "https://www.sfgate.com/bayarea/article/bay-area-parent-baseball-season-racism-20305307.php",
            "upvotes": 895,
            "date": "05/02/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That’s pretty shitty.  \n\nWhen I played ball as a kid, our coach would have ate us alive for disgracing the game, shaming our school, and letting our community down.\n\nSounds like some real accountability problems with that team and its leadership.",
                "You gotta punish folks for this or else racists are gonna continue to behave this way. You have to hold coaches accountable too. Players involved in this kind of behavior need to be benched or kicked off the team.",
                "Unfortunate that his son had to go through this. But this once again proves that Asian racism is not taken as seriously.",
                "No need to cancel the rest of the season, just bar that one team for the remainder.",
                "It's the pattern of Asian racism in these high school baseball games that's at issue, not just the one or two games mentioned in this article. But there's enough here to indicate a pattern.  This also aligns with the increasing Asian racism in California--perhaps associated with the trade war or a lot of the oft mentioned possible war with China--and the deportations of international students (many of whom are envied/disliked by American students)",
                "First off, absolutely unacceptable behavior. Having played baseball myself, I know our coach would have never let us get away with this. \n\nBut looking through the comments, it’s clear how disconnected many Redditors are from reality. The narrative that this is just “Trump white people being racist” doesn’t hold up when you consider that the school is only 12.9% white. It’s time to step outside the echo chamber and acknowledge that anti-Asian hate isn’t solely coming from the direction many of you just assume.\n\nIf we can't address the problem as it really is we can't and won't solve anything.",
                "wtf is happening to the Bay Area",
                "I wonder if this is exacerbated by the best most famous MLB player being east Asian. I bet some racist white folk are salty about it",
                "All the pictures of Pinole Valley High School I see on Google feature African-American students or Latinos....so it all makes sense.",
                "The head coach is responsible for the culture of the team. He should be fired for allowing this behavior to go on. My son played Little League and had been on a team with a coach like this. It's a disgrace. We need to prioritize sportsmanship over winning games. If I had done this on my high school basketball team my coach and the principal would have kicked my ass."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Manhunt in South Carolina as police search for armed suspect who hit 2 kids, 1 adult with vehicle",
            "external_url": "https://www.nbcnews.com/news/us-news/manhunt-south-carolina-police-search-armed-suspect-hit-2-kids-1-adult-rcna204261",
            "upvotes": 431,
            "date": "05/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250501-sullivans-island-responders-se-413p-6866f3.jpg",
            "top_comments": [
                ">\"The driver of that vehicle fled the scene on foot and was last seen armed with a knife,\" Storen said. \n\nThat's the description? Not very helpful.",
                "The fact that he was taken alive confirms that he is white.",
                "Sad to see this kind of news. Praying for those involved."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Trump shuts down program to end human waste backing into Alabama homes, calling it ‘illegal DEI’",
            "external_url": "https://www.nbcnews.com/news/nbcblk/trump-canceled-dei-program-raw-sewage-alabaman-homes-rcna201164",
            "upvotes": 33949,
            "date": "05/01/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-alabama-rural-water-mn-1240-060c98.jpg",
            "top_comments": [
                "“The problem has existed so long and was so pervasive that a 2017 study determined 1 in every 3 adults in the county had the intestinal parasite hookworm. “\n\nNice",
                "Let me guess the program was helping minority communities (the most common community that is effected by pollution) in Alabama, but because helping minorities is ‘illegal DEI’ then it had to be removed",
                "Can we focus on that \"illegal DEI\" comment for a moment? He's now saying that DEI is *against the law*. Not just something he wants to stop, but something that will get you thrown in jail. \n\nDoing anything that benefits anyone other than cis straight White men with zero disabilities is now illegal.",
                "I guess Alabama will now be literally full of shit.",
                "Apparently not drinking or bathing in water tainted with human excrement is (checks notes) *woke*.",
                "He says “environmental justice” is a diversity, equity and inclusion program. Somehow.",
                "Anyone noticing everything benefitting anyone other than wealthy, white, male, Christian, heterosexuals is being killed for being DEI?\n\nThey've found a way to back door discrimination.",
                "So the federal government is shutting down a program because of the race and color of those benefitting from it.\n\nMaybe...https://uscode.house.gov/view.xhtml?req=(title:42%20section:1983%20edition:prelim)",
                "Reminder that DEI is not illegal, even if that was a valid argument, which it's not.",
                "To be extremely clear: \n\nThe program itself has nothing to do with DEI. The program itself has nothing to do with racism.\n\nThe program is simply because 1 in 3 people there have intestinal parasitic hookworms, due to an extremely unsafe lack of proper sanitation.\n\nThe REASON this area has zero infrastructure for good sanitation is because the federal government and the state of Alabama have been extremely racist for 150 years, since black people were allowed to own land. The only place they were allowed to buy land was an area which was very low and had soil which made it basically impossible to dig sanitation infrastructure. \n\nOn top of that, due to segregationist zoning laws and redlining, their parents and grandparents were prohibited from buying land elsewhere. \n\nNow, they cannot move because the land they live on is basically worthless - nobody would want to buy their property for a reasonable price - and they cannot climb out of poverty due to suppressed wages and higher medical bills - due to the lack of sanitation.\n\nCan't sell the land, can't get better wages, can't climb out of poverty. \n\nThis is true for all the people there, regardless of race.\n\nSo, to repeat myself: the *current program* has nothing to do with DEI and race. Everyone who lives there benefits from it.\n\nThis is  also a perfect example of Critical Race Theory - it's not about anyone *currently* being racist. It's just that centuries of racism created this situation, and we need to fix it. \n\nDonald Trump, and Republicans, want to get rid of it because *they* are racist, though."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Critically ill 9/11 first responders are being turned away from the program meant to save them",
            "external_url": "https://abcnews.go.com/US/critically-ill-911-responders-turned-program-meant-save/story?id=121338021",
            "upvotes": 48028,
            "date": "05/01/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1d68ac5d-43f3-4701-8892-aeb3f5ac40dc/firefighter-helmet-gty-jef-250501_1746117071710_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "I feel the need to clarify something. The WTC healthcare program is not just for NYC first responders, it's for anyone who lived and worked within a certain area of the event. Volunteer doctors and nurses came from as far as Canada to help in the immediate aftermath and are now sick. People went back to work and school in the area because the government said it was safe. \n\nANYONE who lived or worked in that area in the following months need to sign up for the healthcare program to be monitored.",
                "Isn't this what they wanted? Traded a 30 min DEI course you had to take for work for tax cuts and no support for healthcare. Great choice!",
                "Sucks that most first responders voted for this. Jon Stewart couldn't save them from themselves. 🤷‍♂️",
                "Republicans hate first responders and veterans; they vote against them an overwhelming majority of the time.",
                ">The program now serves more than 150,000 people nationwide, up from about 76,000 in 2015, according to data from the Centers for Disease Control and Prevention. A bipartisan bill, HR 1410, was introduced in February to close the funding gap as enrollment surged, but it remains stalled in Congress.\n\nHR 1410 was introduced February 18th of this year and was sent to the House Committee on Energy and Commerce. It hasn't moved there since.",
                "Notice how the filthy troglodyte robber barons take and take and say there is not enough to go around? No one needs 100 million dollars, much less 100 billion!",
                "*Jon Stewart didn't like that*",
                "9/11 firefighters are treated far worse than J6ers",
                "We winning yet? \n\nIdk why we are suprised. Republicans have always faught the 9/11 suvivors fund...",
                "may you live in interesting times \n\nmay you come to the attention of those in authority \n\nmay the gods give you everything you ask for\n\nCongrats firefighters you got all three!"
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "RISING",
            "title": "White House national security adviser Waltz to leave post, sources say",
            "external_url": "https://www.reuters.com/world/us/white-house-national-security-adviser-waltz-leave-post-source-says-2025-05-01/",
            "upvotes": 13159,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is this one of the first departures of MAGA2025?",
                "How many mooches long is this?",
                "I wonder if Hegseth understands this makes it more likely that he's fucked, not less. Waltz just got motivated to talk honestly about him.",
                "I wonder if the last 3.5 months for him were worth giving up a safe congressional seat.",
                "Laura Loomer runs National security",
                "how long before Donnie starts trashing them?",
                "This MFer is leaving, not because he shared the plans or was using Signal to do it, but because he had that journalist from the Atlantic in his contacts.  It's the same journalist that reported Trump calling the enlisted \"Suckers and Losers\" so Trump HATES that guy.  To see one of his people have his direct contact sent Trump into a paranoid spiral and he would never trust Mike Waltz again.  No coming back for him.",
                "“When a clown moves into a palace, he does not become a king, instead the palace becomes a circus”",
                "I think it has something to do with doge getting access to nuke systems, stealing ssn, and providing access to the Russians via ‘unsecure’ means.  I think this is also why musk is ‘stepping back’.  All of this happened around the time those reports and the whistleblower came out.  I’m guessing it’s bad bad.",
                "Waltz has left the group chat."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Justice Department sues Hawaii, Michigan over plans to sue fossil fuel companies for climate harm",
            "external_url": "https://apnews.com/article/trump-doj-climate-states-policy-lawsuits-a5228e1dd6348f09d2a70f460142531a",
            "upvotes": 2940,
            "date": "05/01/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the article:\n\n> In court filings, the DOJ said the Clean Air Act — a federal law authorizing the Environmental Protection Agency to regulate air emissions — “creates a comprehensive program for regulating air pollution in the United States and “displaces” the ability of States to regulate greenhouse gas emissions beyond their borders.”\n\nDidn't the Trump administration make a big stink about how governmental agencies don't have the power to direct and lead policy decisions?",
                "I'm glad the government is standing up for the little guy.  Multi billion dollar corporations are people too, just unlike you and me.",
                "Small government, states rights, and all that jazz…",
                "You're gonna sue _us_? No. WE DOUBLE DOG SUE YOU!!1!",
                "It's all about states rights... until it isn't.",
                "So they're being prosecuted for pre-crime?",
                "Can you even sue someone for the sole reason that someone sues someone else??? Do you even have a standing?",
                "The justice department is going to have to prove to a judge what damages would be caused by another state suing fossil fuel companies.",
                "The trump regime and his republican sycophants HATE actual hard-working Americans.",
                "All the corporate cocks in Trump's and bondi's mouths, it's amazing they're still able to speak."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Education Department stops $1 billion in funding for school mental health",
            "external_url": "https://www.npr.org/2025/05/01/nx-s1-5382582/trump-school-mental-health",
            "upvotes": 6087,
            "date": "05/01/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+430/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F28%2F70%2Fb8e504e5426384e23dd10894cbb8%2Fgettyimages-2206185094.jpg",
            "top_comments": [
                "Interesting this drops on the same day the Supreme Court is expected to rule states are obligated to fund religious charter schools. We have to pay for religion with our tax dollars, but can't pay for mental health i suppose.",
                "They are literally writing entire books about how these kids are suffering from mental health issues. It's ok though remember this country doesn't have a gun problem it has a mental health problem.",
                "Conservatives say school shootings are a mental health problem and then do shit like this",
                "This is how you get school shootings. But at this point I think that's what this administration wants.",
                "Weren’t school shootings about mental health?",
                "\"It's not the guns! It's a mental health issue!\"\n\nProceeds to gut mental health support. \n\nFuck the GOP.",
                "Republicans have always been about short term thinking. \n\nTheir biggest concerns are how to make fast money and they dismiss climate change or investments into society. This is why they hate scientists, economists, analysts and historians. Anyone who isn’t helping them gain immediate wealth is trying to sabotage them. And that is why the current administration is operating under the republican golden rule:  \n\n“if we can’t monetize it then we will destroy it”. \n\nGreenland, Canada, Ukraine, Education, Healthcare, Social Security, EVs, Windmills, FEMA and National Parks. All things that should be invested into (or at least left alone) are viewed as enemies to America because “How can these things exist without huge personal profit?”  \n\nDe-investing Education, Mental Health and Kids is going to create the absolute worst society possible. And this is why putting these things in the hands of people who wont be here in a decade is so destructive. They aren’t looking at the future, they’re trying to cash in now.",
                "We are an evil country. There's no other way to say it that won't get me banned, lol",
                "Just our kids, folks.  You know, the future of our nation … \n\nCan’t think of a single, solitary, rational reason that investing money into the mental health of our children is a bad thing.",
                "The rate at which they are completely dismantling anything that helps american people is staggering.  Like, i would have thought it would be more difficult to do, but in 100 days, Trump has done more than a military strike against America would have done.  \n\nIt's all so strange, since he was so ineffective his first time as President.  But, I guess he was 'new' to it, and tried to surround himself with actual politicians at the time, rather than people who are yes-men or even worse than he is."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "05/02/2025 08:12:17 UTC"
}