{
    "posts": [
        {
            "category": "HOT",
            "title": "Judge blocks administration from deporting noncitizens to 3rd countries without due process",
            "external_url": "https://abcnews.go.com/US/judge-blocks-administration-deporting-noncitizens-3rd-countries-due/story?id=120951918",
            "upvotes": 41294,
            "date": "04/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0c049aa4-fe66-4160-9209-c2f35277f952/donald-trump-1-ap-gmh-250418_1744979483649_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The courts should block the payments from the administration to the countries taking these people and they won't take them anymore.",
                "I want to know how this would be enforced\n\nBecause currently I am not seeing an active and useful enforcement vehicle of any kind in play\n\nHe’s not gonna be impeached bc republicans dont care\n\nHe’s still got massive approval among republican voters \n\nIce agents aren’t exactly gonna go for civil disobedience\n\nAnd anyone charged with a crime can be pardoned by trump and he also cannot be charged with a crime apparently\n\nSo what is the barrier here other than like decorum?",
                "And who gonna stop them from ignoring this judge? \n\nFascists only play by their own rules.",
                "**It isn't a deportation; it is an extrajudicial rendition to a 3rd party dictatorship for indefinite incarceration in cruel and unusual conditions without any recourse nor due process for the accused (All at the behest of the Executive Branch and continually paid for by the U.S. taxpayer).**\n\nCalling it a \"deportation\" is like calling attempted murder, a friendly tussle.\n\nSupporting deportations and thinking the deportations are justified, doesn't require you to agree with turning a deportation order into life imprisonment in a dictatorship, paid for with your tax dollars.\n\n>\"Defendants argue that the United States may send a deportable alien to a country not of their origin, not where an immigration judge has ordered, where they may be immediately tortured and killed, without providing that person any opportunity to tell the deporting authorities that they face grave danger or death because of such a deportation,\" Judge Murphy wrote.\n\n\\---\n\nThese aren't a deportation in any traditional sense of the word and we should not call nor acknowledge them using \"deportation.\"\n\nIt wasn't removal from the country. It was U.S. law enforcement physically handing over two hundred plus people in custody (often with a questionable basis) over to El Salvador's law enforcement to throw them in a dictator's prison camp without trial, due process, or any legal recourse, all paid for by the U.S. taxpayer.\n\nThat is what we call an extraordinary rendition, or state-sponsored kidnapping, paid for by the U.S. taxpayer.\n\nCalling it a deportation buries the lead and plays into the alt-right/this administrations' narrative. Likewise it makes it harder to explain the problem here, as it phrases the complaint as against people being sent back to their country of origin.\n\nTo be clear we aren't deporting people from the country; we are using U.S. taxpayer dollars to pay a dictator to imprison and disappear hundreds (so far) of foreign nationals from 3rd party countries at the behest of the U.S. executive branch.\n\n(Not that there are no problems with the deportations/process in general, but that is much harder to communicate.)",
                "Yeah, because that's stopped them so far.",
                "Uh huh. Now fucking enforce it.",
                "\"All nine sitting justices of the Supreme Court of the United States, the Assistant Solicitor General of the United States, Congress, common sense, basic decency, and this Court all disagree [with the Trump admin].\"    \n\nU.S. District Judge Brian Murphy when issuing an injunction barring the administration from deporting non citizens to a country that is not their origin.   \n\nThat bit about common sense and basic decency is so true.",
                "The fifth amendment says no person shall be deprived of life, liberty, or property without due process of law.\n\nNot citizen. PERSON.",
                "Administration proceeds to do it anyway, because nothing matters anymore.",
                "Okay but it also needs to be stated not to \"deport\" citizens too"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Undocumented Immigrant Faces Decades In Prison After Breaking ICE Officer's Nose During Arrest",
            "external_url": "https://www.latintimes.com/undocumented-immigrant-faces-decades-prison-after-breaking-ice-officers-nose-during-arrest-581132",
            "upvotes": 5578,
            "date": "04/18/2025",
            "thumbnail": "https://d.latintimes.com/en/full/568935/mass-teen-01292025-1.jpg",
            "top_comments": [
                "The headline says undocumented, the caption under the photo says legal U.S. status, and the article says he was here unlawfully. \n\nI know I’m not the brightest bulb in the box but which is it lol?",
                "Better than going to el Salvador",
                "The ICE agent is angling to retire early on a disability pension.",
                "This is like the three strikes laws, it basically corners people so they have nothing to lose. If somebody knows they are going to Cecot, or Gitmo they are going to respond with violence.",
                "I can’t help but notice that the picture for the article isn’t of the ICE agent whose nose got broken.",
                "> U.S. Attorney Alina Habba in the aforementioned statement. “Those who choose to attack and assault law enforcement will continue to be met with swift and severe punishment.”\n\nBullshit. Only the people you don’t like will be punished. The ones that support you get pardoned for attacking and assaulting law enforcement.",
                "If someone in an unmarked car, with plain clothes, attempts to abduct me under any circumstances I should have the right to defend myself. This is ridiculous",
                "I think...if there are weekly news stories about ICE sending folks to a concentration camp in El Salvador, then you shouldn't be surprised that people begin finding tooth and nail to avoid capture. It could be a literal death sentence for them",
                "If more of the (and I'm not sure if this case applies here) situations where plain-clothes, no badge, black-bag kidnapping style abductions take place, I imagine you'll see a lot, lot more of this style resistance. Second amendment really coming into play soon, too. If the alternative is always going to be torture prison, what risk is there in resisting kidnapping? Broken nose would be getting off easy in that kind of situation. More likely to get a few extra holes.",
                "I mean, how long until one of these ICE officers is shot in self defense? They’re showing up masked with no credentials. Any weirdo that wants to cosplay and harass their immigrant neighbors can buy patches and vests off the internet."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Man arrested by ICE in Massachusetts can't be moved without notice, judge rules",
            "external_url": "https://www.cbsnews.com/boston/news/new-bedford-ice-arrest-window-smashed/",
            "upvotes": 5622,
            "date": "04/18/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/15/3197e503-3de1-4513-b220-c0bde5145fce/thumbnail/1200x630/e43e0759fd51e42734c4b0d0afb4ed94/ice2.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Headline tomorrow\n\nMan arrested by ICE in Massachusetts moved without notice",
                "Aaaaand he’s (probably) been moved.",
                "People meme, but every single order like this still matters. They are still feigning innocence precisely because they don't have full support for extrajudicial action.",
                "ICE: \\*Sends him to El Salvadorian Death Camp\\* \"What are you gonna do about it, huh?\"",
                "Judges should start holding the ICE officers themselves in contempt. Throw a few of them in jail and see what happens.",
                "Okay so here me out\n\nExercise that 2A right and dress appropriately for every occasion should you have to defend yourself or\n\nBe carted off to CECOT in El Salvador, the human hen house, never to be seen again\n\nWhat a brilliant plan, the conservatives will have everyone carrying, not just them",
                "These guys are Nazis.  Done sugar coating things.  These are the lunatic rejects who couldn’t get hired at a legitimate law enforcement agency (not that those are much better).",
                "Is one allowed to defend themselves if any entity attempts to arrest them without due cause or a warrant?",
                "I don’t believe they heard you!  Another judicial order to be ignored until it just doesn’t make sense to bother. Then what?",
                "Please don't feed the trolls.\n\nedit: ..and best of luck to this guy."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Japan bus driver with 3 decades of service loses $84,000 pension after he was caught stealing $7",
            "external_url": "https://www.cbsnews.com/news/japan-bus-driver-loses-pension-for-stealing-7-dollars/",
            "upvotes": 9055,
            "date": "04/18/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/18/b958a561-2831-4cb5-8035-ce58469db518/thumbnail/1200x630/413cc3e4c195185d2b8eaec5d3fafe61/gettyimages-2147869596.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "> The driver had been reprimanded several times during his career over various incidents, according to the ruling.\n\nI think the $7 worth of fare stolen was what they could prove in court with evidence. There may have been far more discrepancies in terms of number of passengers versus fare collected but for some reason won’t disclose it, because otherwise this does seem extraordinarily excessive for someone that had been driving with them for that long, even for Japan.",
                "Imagine if they did this to cops",
                "Is it 84K in total or annually?\n\nSeems very low for 30 years of work.",
                "That's how much he was caught stealing, how much was stolen before it was identified?",
                "\"Despite being caught on camera, he tried to deny it during a meeting with his superior.\"\n\nSo a dishonest and idiotic liar. \n\n\"The driver had been reprimanded several times during his career over various incidents, according to the ruling.\"\n\nShould be fired long ago.",
                "This was the first time he was CAUGHT, not necessarily the first time he stole.",
                "its only 7$, but its still stealing and who knows how many times he hasnt gotten caught.",
                "Maybe $14 stolen before,  crime unsolved",
                "Japanese justice is known to not fuck around",
                "Hey atleast he lose his pension with his own power,\nSome people are losing that amount in their retirement by another man’s actions"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "White House changes COVID.gov web page to page supporting lab leak theory",
            "external_url": "https://abcnews.go.com/Health/white-house-covid-web-page-page-supporting-lab/story?id=120956514",
            "upvotes": 653,
            "date": "04/19/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f304a57c-6502-4e33-98bf-ac81930f3a40/lab-1-ht-er-250418_1745003468373_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                "I’m not even opposed to the Lab Leak theory and think it’s an entirely possible, or even probable, cause of COVID.\n\nBut the presentation of this information is not dissimilar to crackhead conspiracy. Horribly unprofessional page and incredibly divisive. \n\nThey don’t know how to implement unifying (and ultimately patriotic) policy and it’s frightening",
                ">The White House has redirected [COVID.gov](http://COVID.gov) to a new landing page called \"Lab Leak: True Origins of COVID-19,\" which makes a five-point argument for the theory that COVID-19 originated from a mistaken lab leak in Wuhan, China. \n\n>The new site appears to use theories from the final report of the Republican-led Select Subcommittee on the Coronavirus Pandemic, released in December 2024. There has never been a consensus or a \"smoking gun\" to explain what started the pandemic. \n\n>The [COVID.gov](http://COVID.gov) page, as recently as last week, listed resources for testing, treatment, and vaccination against COVID-19, as well as information for Long COVID.\n\n>The five pieces of evidence put forth by the White House for the theory include the following assertions: that the \"virus possesses a biological characteristic that is *not found in nature*,\" that data shows all cases \"stem from *a single introduction into humans*,\" that \"*Wuhan is home to China's foremost SARS research lab*,\" that researchers at that research lab \"were *sick with COVID-like symptoms* in the fall of 2019,\" and that \"if there was evidence of a natural origin it would have *already surfaced.*\"\n\n>The page includes claims that government officials, including former NIAID Director Dr. Anthony Fauci, helped edit and then amplify a research paper on the origins of COVID-19 published in 2020 that supported natural origin theory.\n\nTrump attacking Fauci is nothing new, but there's a concerted effort to make definitive statements based on circumstantial evidence",
                "[Whitehouse.gov](http://Whitehouse.gov) is a satire site now",
                "Site looks like a junior high web design project",
                "Help me understand what is the government gaining with this change?\n\n\nI get that they're all for chaos and believe in the unproven things but besides appealing to their voters, what is this adding to the conversation? ",
                "All else aside, who the hell designed that header graphic?",
                "What in the megalomania is that webpage header? A picture of Trump photoshopped to look thinner walking out of the words “lab leak” and a swirly signature font to write “covid 19.” This has to be AI graphic design",
                "They discredit the social distancing.    No way.  That saved lives.",
                "I love how the white house webpage lays it all out as if he wasn't president during most of what's mentioned. - Also, why the hell is \"Covid-19\" written in script like the cover of a romance novel?",
                "Whatever the cause ends up being we can all agree that Trump did an absolutely piss poor job of handling the pandemic. There's a reason why everyone was watching Andrew Cuomo's covid press conferences every day. It was because they were hungry for some leadership and there was absolutely none coming from the White House."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Austin Metcalf's father escorted out of Karmelo Anthony's family news conference after unexpected appearance",
            "external_url": "https://www.cbsnews.com/texas/news/austin-metcalfs-father-escorted-out-karmelo-anthonys-family-news-conference/",
            "upvotes": 4425,
            "date": "04/18/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/17/6d8cd1eb-c9b9-41e5-ad50-215fcff451d3/thumbnail/1200x630/78e26ed903475263be7846dd82823cf6/toc-04172025-karmelo-anthony-family-presser-11-24-0519-1.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Not gonna lie, this is a bad article.\n\nYou can't just drop an initialism ike \"NGAN\" without writing it out once, that's just common knowledge.",
                "For a second I thought this was in reference to retired NBA player Carmelo Anthony and got extremely confused",
                "When I saw the news conference, I thought it was the family of the victim speaking. Then I went online to find out what happened to him and uh, they're the family of the killer? The family of the victim is being treated like the family of the killer and the killer's family treated like the victim...it's bizarre.",
                "Why are they even having a press conference?  Their kid murdered someone, I'd be hiding in shame",
                "That minister is a tool.",
                "> Minister Dominique Alexander \n\nUh, I don't think they want to associate with that guy...  \nhttps://nypost.com/2025/04/18/us-news/activist-minister-aiding-accused-teen-killer-karmelo-anthony-has-his-own-lengthy-rap-sheet-report/",
                "So he got asked to leave but didn't stab anyone? Crazy. ",
                "The discourse surrounding this murder is just insane. I'm not sure where these opposing narratives are coming from, but the kid took a knife to a track meet and stabbed someone in the heart....I don't think much else matters.",
                "They make it sound like the killer was the victim. Jfc.",
                "How is a grieving father showing up at the press conference of the parents of his son's accused killer both \"disrespectful\" and \"inappropriate\"?  How is it trespassing?  I'm appalled that the man was asked to leave."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Measles update: State officials report 36 more cases in West Texas",
            "external_url": "https://www.tpr.org/bioscience-medicine/2025-04-18/measles-update-state-officials-report-36-more-cases-in-west-texas",
            "upvotes": 2160,
            "date": "04/18/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/d4986a6/2147483647/strip/true/crop/2787x1463+0+252/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6a%2Ff8%2F0267f45f4986944eee0e903257db%2F2016-03-11t140544z-1308609988-mt1pra25799643-rtrmadp-3-pa-images.JPG",
            "top_comments": [
                "This update adds 36 cases to the number of reported cases in Texas associated with the outbreak. Tuesday's update added 20 cases. Last Friday's update added 36 cases. Last Tuesday's update added 24 cases. The previous Friday's update added 59 cases.\n\nFour new hospitalizations were reported, up to 62 from 58. Texas has two deaths associated with this outbreak. Both were in school-aged children.\n\nThere is also an outbreak in Upshur County, which is in East Texas. It consists of 19 cases, so far, all at one location. It is linked to two out-of-state visitors.",
                "Just waiting for the dept responsible for these reports is told to stand down.",
                "The maga leadership is a deadly disease that harms American society - stop voting for these skeevy maga liars.",
                "Rumor is that the Upshur County outbreak is at the Alert Academy in Big Sandy, Texas. People who follow the super-sized Duggar and Bates families will likely be familiar with Alert. It's part of the larger IBLP organization they're associated with.\n\nhttps://en.wikipedia.org/wiki/Institute_in_Basic_Life_Principles",
                "Imagine if they tried to get rid of measles as hard as they tried to get rid of trans athletes.",
                "As a lib living in Washington, man do I feel owned. \n\nI’m alive, and so are my kids, but phew! What a burn! \n\nMasterfully done.",
                "The CDC reported earlier today that the US is up to [800 cases nationwide this week](https://www.cdc.gov/measles/data-research/index.html).  That adds 88 to last week's total of 712.",
                "Saw my PCP. No chance of a booster vaccine despite being immunocompromised. ¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯",
                "Miscarriage = murderer and possibly prison\n\nLetting your child die of a preventable disease in agony = Religious freedum",
                "Fuckin fundies. Avoid Target and BB&B in LBK and Amarillo. They really like shopping at those places. See them there almost every weekend."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "San Diego City Council bans landlords from 'price fixing' with algorithms",
            "external_url": "https://www.kpbs.org/news/living/2025/04/15/san-diego-city-council-bans-landlords-from-price-fixing-with-algorithms",
            "upvotes": 2361,
            "date": "04/18/2025",
            "thumbnail": "https://cdn.kpbs.org/dims4/default/e89525e/2147483647/strip/true/crop/5678x2981+0+107/resize/1200x630!/quality/90/?url=http%3A%2F%2Fkpbs-brightspot.s3.us-west-2.amazonaws.com%2Fba%2Fdc%2F9117f2ff4ca08e6f8efb325a3fd0%2Fimg-4479.jpg",
            "top_comments": [
                "I wonder how you enforce the ban. We tell employees they're not allowed to use AI with work-related files but we also know they still upload our proprietary data.",
                ">Once the ordinance goes into effect, tenants will have the right to sue their landlords for violations.\n\nThis sounds like a good plan on paper but how do the tenants know a banned algorithm is being used?",
                "\"The ordinance does not apply to algorithms that rely on public information, such as advertisements or listings on websites like Zillow or apartments.com.\"\n\nThere we go. Just scrap zillow and run a similar algorithm. Not that you can enforce anything. You can always ask an employee to decide the rental price, but let him look at the output the old algorithm and make sure he add some randomness to it.",
                "Rents up 36% in 6 years in SD County.    Just think about that for a sec",
                "They'll just do it the way they used to before AI - on the golf course, at the country club, at the strip club, etc.",
                "Considering California has a rent cap I imagine it’ll go the same way it has been ie. if new year = raise by maximum allowed. Don’t really need an algorithm for it",
                "So proving this is going to be a nightmare.  Any person using AI or any algorithm for this is just doing what they could, and likely were doing, before.  These algorithms merely pull from publicly available data so that means that a person can find that data if they know where to look, and these guys are not exactly hiding prices. That means you have to assume they are finding it via an algorithm instead of manually and good luck proving that and even if you can prove it, its still the same result just with a few more hours of labor.",
                "How about they relax zoning and allow people to build density, addressing the supply issue?   We've allowed NIMBYs to block density and supply so they can monetize scarcity.   It's not just the \"algorithms.\"  It's the supply.  \n\nEven for those who will say \"It's not necessarily supply--I see *tons* of housing going up and...\" the problem is supply there too.  They never mention where they're talking about, or the vacancy rate for this unnamed place where they've decided there is \"plenty\" of housing.",
                "In other news, the San Diego City Council doesn't know what an algorithm is.",
                "my san diego apt building (near OB pier) had realpage back in 2016, the whole neighborhood shot up in price pretty significantly by the time we left in late 2019. it was a really great surfer outpost, super affordable and on the water"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Key regulators approve merger of Capital One and Discover, paving the way for a new biggest credit card company",
            "external_url": "https://edition.cnn.com/2025/04/18/business/capital-one-discover-merger-conditional-approval/index.html",
            "upvotes": 1340,
            "date": "04/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2018747624.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Less competition means consumers are going to get screwed.",
                "Well shit. Discover has always been pretty good but here comes the enshittification...",
                "I assume they'll be off-shoring Discovers call centers now?",
                "[deleted]",
                "They’re calling it Disc One",
                "I've never had a Capital One card, I've always just used my Discover card for the cash back for the seasonal 5 % category and occasionally they'd offer a decent balance transfer promo. It would be nice to see Discover expanded, it's rarely useful internationally.",
                "Of course they did. The dystopia becomes more dystopian.",
                "This is going to be terrible for consumers!",
                "What's in your wallet?\n\nNOT Capitol One or Discover!",
                "Oh good. Just what we need. Bigger finance companies."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Sex toys cause fire engulfing multiple Staten Island homes: Court docs",
            "external_url": "https://www.nbcnewyork.com/local/sex-toys-cause-fire-engulfing-multiple-staten-island-homes-court-docs/6230573/",
            "upvotes": 962,
            "date": "04/18/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/StatenIslandfireforweb_56427256_1920x1080_2422284867752.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "A backyard bonfire sure is a strange way to dispose of sex toys.",
                "Articles for The Onion are writing themselves these days.",
                "They warned us to use lubrication...why didn't we listen?",
                "The dildo of consequences rarely comes lubed.",
                "best headline ever.  and of course it's staten island.",
                "🎶You\n\nYour sex is on fire\n\nConsumed\n\nWith what's to transpire🎶",
                "Dammit Lazlo..  Or maybe it was Nadja\n\nOh, who are we kidding.  This was on Nandor.",
                "This smells of Nandor and Nadja...",
                "SNL weekend update is going to have a field day with this one. ",
                "I just love the title of this article."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "White House changes COVID.gov web page to page supporting lab leak theory",
            "external_url": "https://abcnews.go.com/Health/white-house-covid-web-page-page-supporting-lab/story?id=120956514",
            "upvotes": 662,
            "date": "04/19/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f304a57c-6502-4e33-98bf-ac81930f3a40/lab-1-ht-er-250418_1745003468373_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                "I’m not even opposed to the Lab Leak theory and think it’s an entirely possible, or even probable, cause of COVID.\n\nBut the presentation of this information is not dissimilar to crackhead conspiracy. Horribly unprofessional page and incredibly divisive. \n\nThey don’t know how to implement unifying (and ultimately patriotic) policy and it’s frightening",
                ">The White House has redirected [COVID.gov](http://COVID.gov) to a new landing page called \"Lab Leak: True Origins of COVID-19,\" which makes a five-point argument for the theory that COVID-19 originated from a mistaken lab leak in Wuhan, China. \n\n>The new site appears to use theories from the final report of the Republican-led Select Subcommittee on the Coronavirus Pandemic, released in December 2024. There has never been a consensus or a \"smoking gun\" to explain what started the pandemic. \n\n>The [COVID.gov](http://COVID.gov) page, as recently as last week, listed resources for testing, treatment, and vaccination against COVID-19, as well as information for Long COVID.\n\n>The five pieces of evidence put forth by the White House for the theory include the following assertions: that the \"virus possesses a biological characteristic that is *not found in nature*,\" that data shows all cases \"stem from *a single introduction into humans*,\" that \"*Wuhan is home to China's foremost SARS research lab*,\" that researchers at that research lab \"were *sick with COVID-like symptoms* in the fall of 2019,\" and that \"if there was evidence of a natural origin it would have *already surfaced.*\"\n\n>The page includes claims that government officials, including former NIAID Director Dr. Anthony Fauci, helped edit and then amplify a research paper on the origins of COVID-19 published in 2020 that supported natural origin theory.\n\nTrump attacking Fauci is nothing new, but there's a concerted effort to make definitive statements based on circumstantial evidence",
                "[Whitehouse.gov](http://Whitehouse.gov) is a satire site now",
                "Site looks like a junior high web design project",
                "Help me understand what is the government gaining with this change?\n\n\nI get that they're all for chaos and believe in the unproven things but besides appealing to their voters, what is this adding to the conversation? ",
                "All else aside, who the hell designed that header graphic?",
                "What in the megalomania is that webpage header? A picture of Trump photoshopped to look thinner walking out of the words “lab leak” and a swirly signature font to write “covid 19.” This has to be AI graphic design",
                "They discredit the social distancing.    No way.  That saved lives.",
                "I love how the white house webpage lays it all out as if he wasn't president during most of what's mentioned. - Also, why the hell is \"Covid-19\" written in script like the cover of a romance novel?",
                "Whatever the cause ends up being we can all agree that Trump did an absolutely piss poor job of handling the pandemic. There's a reason why everyone was watching Andrew Cuomo's covid press conferences every day. It was because they were hungry for some leadership and there was absolutely none coming from the White House."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "The US and Iran are set to meet for a second round of nuclear talks. Here’s what we know | CNN",
            "external_url": "https://www.cnn.com/2025/04/18/middleeast/us-iran-nuclear-talks-what-we-know-intl/index.html",
            "upvotes": 31,
            "date": "04/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/20250415-hghghghg.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "What we know is no agreement with Trump is worth the toilet paper it’s written on.",
                "Maybe, just maybe Trump shouldn't have gotten us out of the first agreement and we  wouldn't have to be doing it again right now.",
                "Trump abandoned the deal the US had reached with Iran before \n\nTrump also abandoned his own trade deal he signed with canada \n\nWhy would anyone trust a deal made with trump\n\nHe infamously does not keep his promises and does not even follow the law of his own country",
                "It’ll be interesting how this turns out."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "Undocumented Immigrant Faces Decades In Prison After Breaking ICE Officer's Nose During Arrest",
            "external_url": "https://www.latintimes.com/undocumented-immigrant-faces-decades-prison-after-breaking-ice-officers-nose-during-arrest-581132",
            "upvotes": 5596,
            "date": "04/18/2025",
            "thumbnail": "https://d.latintimes.com/en/full/568935/mass-teen-01292025-1.jpg",
            "top_comments": [
                "The headline says undocumented, the caption under the photo says legal U.S. status, and the article says he was here unlawfully. \n\nI know I’m not the brightest bulb in the box but which is it lol?",
                "Better than going to el Salvador",
                "The ICE agent is angling to retire early on a disability pension.",
                "This is like the three strikes laws, it basically corners people so they have nothing to lose. If somebody knows they are going to Cecot, or Gitmo they are going to respond with violence.",
                "I can’t help but notice that the picture for the article isn’t of the ICE agent whose nose got broken.",
                "> U.S. Attorney Alina Habba in the aforementioned statement. “Those who choose to attack and assault law enforcement will continue to be met with swift and severe punishment.”\n\nBullshit. Only the people you don’t like will be punished. The ones that support you get pardoned for attacking and assaulting law enforcement.",
                "If someone in an unmarked car, with plain clothes, attempts to abduct me under any circumstances I should have the right to defend myself. This is ridiculous",
                "I think...if there are weekly news stories about ICE sending folks to a concentration camp in El Salvador, then you shouldn't be surprised that people begin finding tooth and nail to avoid capture. It could be a literal death sentence for them",
                "If more of the (and I'm not sure if this case applies here) situations where plain-clothes, no badge, black-bag kidnapping style abductions take place, I imagine you'll see a lot, lot more of this style resistance. Second amendment really coming into play soon, too. If the alternative is always going to be torture prison, what risk is there in resisting kidnapping? Broken nose would be getting off easy in that kind of situation. More likely to get a few extra holes.",
                "I mean, how long until one of these ICE officers is shot in self defense? They’re showing up masked with no credentials. Any weirdo that wants to cosplay and harass their immigrant neighbors can buy patches and vests off the internet."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Man arrested by ICE in Massachusetts can't be moved without notice, judge rules",
            "external_url": "https://www.cbsnews.com/boston/news/new-bedford-ice-arrest-window-smashed/",
            "upvotes": 5620,
            "date": "04/18/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/15/3197e503-3de1-4513-b220-c0bde5145fce/thumbnail/1200x630/e43e0759fd51e42734c4b0d0afb4ed94/ice2.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Headline tomorrow\n\nMan arrested by ICE in Massachusetts moved without notice",
                "Aaaaand he’s (probably) been moved.",
                "People meme, but every single order like this still matters. They are still feigning innocence precisely because they don't have full support for extrajudicial action.",
                "ICE: \\*Sends him to El Salvadorian Death Camp\\* \"What are you gonna do about it, huh?\"",
                "Judges should start holding the ICE officers themselves in contempt. Throw a few of them in jail and see what happens.",
                "Okay so here me out\n\nExercise that 2A right and dress appropriately for every occasion should you have to defend yourself or\n\nBe carted off to CECOT in El Salvador, the human hen house, never to be seen again\n\nWhat a brilliant plan, the conservatives will have everyone carrying, not just them",
                "These guys are Nazis.  Done sugar coating things.  These are the lunatic rejects who couldn’t get hired at a legitimate law enforcement agency (not that those are much better).",
                "Is one allowed to defend themselves if any entity attempts to arrest them without due cause or a warrant?",
                "I don’t believe they heard you!  Another judicial order to be ignored until it just doesn’t make sense to bother. Then what?",
                "Please don't feed the trolls.\n\nedit: ..and best of luck to this guy."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Judge blocks administration from deporting noncitizens to 3rd countries without due process",
            "external_url": "https://abcnews.go.com/US/judge-blocks-administration-deporting-noncitizens-3rd-countries-due/story?id=120951918",
            "upvotes": 41283,
            "date": "04/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0c049aa4-fe66-4160-9209-c2f35277f952/donald-trump-1-ap-gmh-250418_1744979483649_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The courts should block the payments from the administration to the countries taking these people and they won't take them anymore.",
                "I want to know how this would be enforced\n\nBecause currently I am not seeing an active and useful enforcement vehicle of any kind in play\n\nHe’s not gonna be impeached bc republicans dont care\n\nHe’s still got massive approval among republican voters \n\nIce agents aren’t exactly gonna go for civil disobedience\n\nAnd anyone charged with a crime can be pardoned by trump and he also cannot be charged with a crime apparently\n\nSo what is the barrier here other than like decorum?",
                "And who gonna stop them from ignoring this judge? \n\nFascists only play by their own rules.",
                "**It isn't a deportation; it is an extrajudicial rendition to a 3rd party dictatorship for indefinite incarceration in cruel and unusual conditions without any recourse nor due process for the accused (All at the behest of the Executive Branch and continually paid for by the U.S. taxpayer).**\n\nCalling it a \"deportation\" is like calling attempted murder, a friendly tussle.\n\nSupporting deportations and thinking the deportations are justified, doesn't require you to agree with turning a deportation order into life imprisonment in a dictatorship, paid for with your tax dollars.\n\n>\"Defendants argue that the United States may send a deportable alien to a country not of their origin, not where an immigration judge has ordered, where they may be immediately tortured and killed, without providing that person any opportunity to tell the deporting authorities that they face grave danger or death because of such a deportation,\" Judge Murphy wrote.\n\n\\---\n\nThese aren't a deportation in any traditional sense of the word and we should not call nor acknowledge them using \"deportation.\"\n\nIt wasn't removal from the country. It was U.S. law enforcement physically handing over two hundred plus people in custody (often with a questionable basis) over to El Salvador's law enforcement to throw them in a dictator's prison camp without trial, due process, or any legal recourse, all paid for by the U.S. taxpayer.\n\nThat is what we call an extraordinary rendition, or state-sponsored kidnapping, paid for by the U.S. taxpayer.\n\nCalling it a deportation buries the lead and plays into the alt-right/this administrations' narrative. Likewise it makes it harder to explain the problem here, as it phrases the complaint as against people being sent back to their country of origin.\n\nTo be clear we aren't deporting people from the country; we are using U.S. taxpayer dollars to pay a dictator to imprison and disappear hundreds (so far) of foreign nationals from 3rd party countries at the behest of the U.S. executive branch.\n\n(Not that there are no problems with the deportations/process in general, but that is much harder to communicate.)",
                "Yeah, because that's stopped them so far.",
                "Uh huh. Now fucking enforce it.",
                "\"All nine sitting justices of the Supreme Court of the United States, the Assistant Solicitor General of the United States, Congress, common sense, basic decency, and this Court all disagree [with the Trump admin].\"    \n\nU.S. District Judge Brian Murphy when issuing an injunction barring the administration from deporting non citizens to a country that is not their origin.   \n\nThat bit about common sense and basic decency is so true.",
                "The fifth amendment says no person shall be deprived of life, liberty, or property without due process of law.\n\nNot citizen. PERSON.",
                "Administration proceeds to do it anyway, because nothing matters anymore.",
                "Okay but it also needs to be stated not to \"deport\" citizens too"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Sex toys cause fire engulfing multiple Staten Island homes: Court docs",
            "external_url": "https://www.nbcnewyork.com/local/sex-toys-cause-fire-engulfing-multiple-staten-island-homes-court-docs/6230573/",
            "upvotes": 964,
            "date": "04/18/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/StatenIslandfireforweb_56427256_1920x1080_2422284867752.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "A backyard bonfire sure is a strange way to dispose of sex toys.",
                "Articles for The Onion are writing themselves these days.",
                "They warned us to use lubrication...why didn't we listen?",
                "The dildo of consequences rarely comes lubed.",
                "best headline ever.  and of course it's staten island.",
                "🎶You\n\nYour sex is on fire\n\nConsumed\n\nWith what's to transpire🎶",
                "Dammit Lazlo..  Or maybe it was Nadja\n\nOh, who are we kidding.  This was on Nandor.",
                "This smells of Nandor and Nadja...",
                "SNL weekend update is going to have a field day with this one. ",
                "I just love the title of this article."
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "NEW",
            "title": "Measles update: State officials report 36 more cases in West Texas",
            "external_url": "https://www.tpr.org/bioscience-medicine/2025-04-18/measles-update-state-officials-report-36-more-cases-in-west-texas",
            "upvotes": 2154,
            "date": "04/18/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/d4986a6/2147483647/strip/true/crop/2787x1463+0+252/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6a%2Ff8%2F0267f45f4986944eee0e903257db%2F2016-03-11t140544z-1308609988-mt1pra25799643-rtrmadp-3-pa-images.JPG",
            "top_comments": [
                "This update adds 36 cases to the number of reported cases in Texas associated with the outbreak. Tuesday's update added 20 cases. Last Friday's update added 36 cases. Last Tuesday's update added 24 cases. The previous Friday's update added 59 cases.\n\nFour new hospitalizations were reported, up to 62 from 58. Texas has two deaths associated with this outbreak. Both were in school-aged children.\n\nThere is also an outbreak in Upshur County, which is in East Texas. It consists of 19 cases, so far, all at one location. It is linked to two out-of-state visitors.",
                "Just waiting for the dept responsible for these reports is told to stand down.",
                "The maga leadership is a deadly disease that harms American society - stop voting for these skeevy maga liars.",
                "Rumor is that the Upshur County outbreak is at the Alert Academy in Big Sandy, Texas. People who follow the super-sized Duggar and Bates families will likely be familiar with Alert. It's part of the larger IBLP organization they're associated with.\n\nhttps://en.wikipedia.org/wiki/Institute_in_Basic_Life_Principles",
                "Imagine if they tried to get rid of measles as hard as they tried to get rid of trans athletes.",
                "As a lib living in Washington, man do I feel owned. \n\nI’m alive, and so are my kids, but phew! What a burn! \n\nMasterfully done.",
                "The CDC reported earlier today that the US is up to [800 cases nationwide this week](https://www.cdc.gov/measles/data-research/index.html).  That adds 88 to last week's total of 712.",
                "Saw my PCP. No chance of a booster vaccine despite being immunocompromised. ¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯",
                "Miscarriage = murderer and possibly prison\n\nLetting your child die of a preventable disease in agony = Religious freedum",
                "Fuckin fundies. Avoid Target and BB&B in LBK and Amarillo. They really like shopping at those places. See them there almost every weekend."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Key regulators approve merger of Capital One and Discover, paving the way for a new biggest credit card company",
            "external_url": "https://edition.cnn.com/2025/04/18/business/capital-one-discover-merger-conditional-approval/index.html",
            "upvotes": 1332,
            "date": "04/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2018747624.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Less competition means consumers are going to get screwed.",
                "Well shit. Discover has always been pretty good but here comes the enshittification...",
                "I assume they'll be off-shoring Discovers call centers now?",
                "[deleted]",
                "They’re calling it Disc One",
                "I've never had a Capital One card, I've always just used my Discover card for the cash back for the seasonal 5 % category and occasionally they'd offer a decent balance transfer promo. It would be nice to see Discover expanded, it's rarely useful internationally.",
                "Of course they did. The dystopia becomes more dystopian.",
                "This is going to be terrible for consumers!",
                "What's in your wallet?\n\nNOT Capitol One or Discover!",
                "Oh good. Just what we need. Bigger finance companies."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "San Diego City Council bans landlords from 'price fixing' with algorithms",
            "external_url": "https://www.kpbs.org/news/living/2025/04/15/san-diego-city-council-bans-landlords-from-price-fixing-with-algorithms",
            "upvotes": 2357,
            "date": "04/18/2025",
            "thumbnail": "https://cdn.kpbs.org/dims4/default/e89525e/2147483647/strip/true/crop/5678x2981+0+107/resize/1200x630!/quality/90/?url=http%3A%2F%2Fkpbs-brightspot.s3.us-west-2.amazonaws.com%2Fba%2Fdc%2F9117f2ff4ca08e6f8efb325a3fd0%2Fimg-4479.jpg",
            "top_comments": [
                "I wonder how you enforce the ban. We tell employees they're not allowed to use AI with work-related files but we also know they still upload our proprietary data.",
                ">Once the ordinance goes into effect, tenants will have the right to sue their landlords for violations.\n\nThis sounds like a good plan on paper but how do the tenants know a banned algorithm is being used?",
                "\"The ordinance does not apply to algorithms that rely on public information, such as advertisements or listings on websites like Zillow or apartments.com.\"\n\nThere we go. Just scrap zillow and run a similar algorithm. Not that you can enforce anything. You can always ask an employee to decide the rental price, but let him look at the output the old algorithm and make sure he add some randomness to it.",
                "Rents up 36% in 6 years in SD County.    Just think about that for a sec",
                "They'll just do it the way they used to before AI - on the golf course, at the country club, at the strip club, etc.",
                "Considering California has a rent cap I imagine it’ll go the same way it has been ie. if new year = raise by maximum allowed. Don’t really need an algorithm for it",
                "So proving this is going to be a nightmare.  Any person using AI or any algorithm for this is just doing what they could, and likely were doing, before.  These algorithms merely pull from publicly available data so that means that a person can find that data if they know where to look, and these guys are not exactly hiding prices. That means you have to assume they are finding it via an algorithm instead of manually and good luck proving that and even if you can prove it, its still the same result just with a few more hours of labor.",
                "How about they relax zoning and allow people to build density, addressing the supply issue?   We've allowed NIMBYs to block density and supply so they can monetize scarcity.   It's not just the \"algorithms.\"  It's the supply.  \n\nEven for those who will say \"It's not necessarily supply--I see *tons* of housing going up and...\" the problem is supply there too.  They never mention where they're talking about, or the vacancy rate for this unnamed place where they've decided there is \"plenty\" of housing.",
                "In other news, the San Diego City Council doesn't know what an algorithm is.",
                "my san diego apt building (near OB pier) had realpage back in 2016, the whole neighborhood shot up in price pretty significantly by the time we left in late 2019. it was a really great surfer outpost, super affordable and on the water"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Austin Metcalf's father escorted out of Karmelo Anthony's family news conference after unexpected appearance",
            "external_url": "https://www.cbsnews.com/texas/news/austin-metcalfs-father-escorted-out-karmelo-anthonys-family-news-conference/",
            "upvotes": 4434,
            "date": "04/18/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/17/6d8cd1eb-c9b9-41e5-ad50-215fcff451d3/thumbnail/1200x630/78e26ed903475263be7846dd82823cf6/toc-04172025-karmelo-anthony-family-presser-11-24-0519-1.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Not gonna lie, this is a bad article.\n\nYou can't just drop an initialism ike \"NGAN\" without writing it out once, that's just common knowledge.",
                "For a second I thought this was in reference to retired NBA player Carmelo Anthony and got extremely confused",
                "When I saw the news conference, I thought it was the family of the victim speaking. Then I went online to find out what happened to him and uh, they're the family of the killer? The family of the victim is being treated like the family of the killer and the killer's family treated like the victim...it's bizarre.",
                "Why are they even having a press conference?  Their kid murdered someone, I'd be hiding in shame",
                "That minister is a tool.",
                "> Minister Dominique Alexander \n\nUh, I don't think they want to associate with that guy...  \nhttps://nypost.com/2025/04/18/us-news/activist-minister-aiding-accused-teen-killer-karmelo-anthony-has-his-own-lengthy-rap-sheet-report/",
                "So he got asked to leave but didn't stab anyone? Crazy. ",
                "The discourse surrounding this murder is just insane. I'm not sure where these opposing narratives are coming from, but the kid took a knife to a track meet and stabbed someone in the heart....I don't think much else matters.",
                "They make it sound like the killer was the victim. Jfc.",
                "How is a grieving father showing up at the press conference of the parents of his son's accused killer both \"disrespectful\" and \"inappropriate\"?  How is it trespassing?  I'm appalled that the man was asked to leave."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "White House changes COVID.gov web page to page supporting lab leak theory",
            "external_url": "https://abcnews.go.com/Health/white-house-covid-web-page-page-supporting-lab/story?id=120956514",
            "upvotes": 659,
            "date": "04/19/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/f304a57c-6502-4e33-98bf-ac81930f3a40/lab-1-ht-er-250418_1745003468373_hpMain_16x9t.jpg?w=1600",
            "top_comments": [
                "I’m not even opposed to the Lab Leak theory and think it’s an entirely possible, or even probable, cause of COVID.\n\nBut the presentation of this information is not dissimilar to crackhead conspiracy. Horribly unprofessional page and incredibly divisive. \n\nThey don’t know how to implement unifying (and ultimately patriotic) policy and it’s frightening",
                ">The White House has redirected [COVID.gov](http://COVID.gov) to a new landing page called \"Lab Leak: True Origins of COVID-19,\" which makes a five-point argument for the theory that COVID-19 originated from a mistaken lab leak in Wuhan, China. \n\n>The new site appears to use theories from the final report of the Republican-led Select Subcommittee on the Coronavirus Pandemic, released in December 2024. There has never been a consensus or a \"smoking gun\" to explain what started the pandemic. \n\n>The [COVID.gov](http://COVID.gov) page, as recently as last week, listed resources for testing, treatment, and vaccination against COVID-19, as well as information for Long COVID.\n\n>The five pieces of evidence put forth by the White House for the theory include the following assertions: that the \"virus possesses a biological characteristic that is *not found in nature*,\" that data shows all cases \"stem from *a single introduction into humans*,\" that \"*Wuhan is home to China's foremost SARS research lab*,\" that researchers at that research lab \"were *sick with COVID-like symptoms* in the fall of 2019,\" and that \"if there was evidence of a natural origin it would have *already surfaced.*\"\n\n>The page includes claims that government officials, including former NIAID Director Dr. Anthony Fauci, helped edit and then amplify a research paper on the origins of COVID-19 published in 2020 that supported natural origin theory.\n\nTrump attacking Fauci is nothing new, but there's a concerted effort to make definitive statements based on circumstantial evidence",
                "[Whitehouse.gov](http://Whitehouse.gov) is a satire site now",
                "Site looks like a junior high web design project",
                "Help me understand what is the government gaining with this change?\n\n\nI get that they're all for chaos and believe in the unproven things but besides appealing to their voters, what is this adding to the conversation? ",
                "All else aside, who the hell designed that header graphic?",
                "What in the megalomania is that webpage header? A picture of Trump photoshopped to look thinner walking out of the words “lab leak” and a swirly signature font to write “covid 19.” This has to be AI graphic design",
                "They discredit the social distancing.    No way.  That saved lives.",
                "I love how the white house webpage lays it all out as if he wasn't president during most of what's mentioned. - Also, why the hell is \"Covid-19\" written in script like the cover of a romance novel?",
                "Whatever the cause ends up being we can all agree that Trump did an absolutely piss poor job of handling the pandemic. There's a reason why everyone was watching Andrew Cuomo's covid press conferences every day. It was because they were hungry for some leadership and there was absolutely none coming from the White House."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Man arrested by ICE in Massachusetts can't be moved without notice, judge rules",
            "external_url": "https://www.cbsnews.com/boston/news/new-bedford-ice-arrest-window-smashed/",
            "upvotes": 5622,
            "date": "04/18/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/15/3197e503-3de1-4513-b220-c0bde5145fce/thumbnail/1200x630/e43e0759fd51e42734c4b0d0afb4ed94/ice2.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Headline tomorrow\n\nMan arrested by ICE in Massachusetts moved without notice",
                "Aaaaand he’s (probably) been moved.",
                "People meme, but every single order like this still matters. They are still feigning innocence precisely because they don't have full support for extrajudicial action.",
                "ICE: \\*Sends him to El Salvadorian Death Camp\\* \"What are you gonna do about it, huh?\"",
                "Judges should start holding the ICE officers themselves in contempt. Throw a few of them in jail and see what happens.",
                "Okay so here me out\n\nExercise that 2A right and dress appropriately for every occasion should you have to defend yourself or\n\nBe carted off to CECOT in El Salvador, the human hen house, never to be seen again\n\nWhat a brilliant plan, the conservatives will have everyone carrying, not just them",
                "These guys are Nazis.  Done sugar coating things.  These are the lunatic rejects who couldn’t get hired at a legitimate law enforcement agency (not that those are much better).",
                "Is one allowed to defend themselves if any entity attempts to arrest them without due cause or a warrant?",
                "I don’t believe they heard you!  Another judicial order to be ignored until it just doesn’t make sense to bother. Then what?",
                "Please don't feed the trolls.\n\nedit: ..and best of luck to this guy."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Undocumented Immigrant Faces Decades In Prison After Breaking ICE Officer's Nose During Arrest",
            "external_url": "https://www.latintimes.com/undocumented-immigrant-faces-decades-prison-after-breaking-ice-officers-nose-during-arrest-581132",
            "upvotes": 5579,
            "date": "04/18/2025",
            "thumbnail": "https://d.latintimes.com/en/full/568935/mass-teen-01292025-1.jpg",
            "top_comments": [
                "The headline says undocumented, the caption under the photo says legal U.S. status, and the article says he was here unlawfully. \n\nI know I’m not the brightest bulb in the box but which is it lol?",
                "Better than going to el Salvador",
                "The ICE agent is angling to retire early on a disability pension.",
                "This is like the three strikes laws, it basically corners people so they have nothing to lose. If somebody knows they are going to Cecot, or Gitmo they are going to respond with violence.",
                "I can’t help but notice that the picture for the article isn’t of the ICE agent whose nose got broken.",
                "> U.S. Attorney Alina Habba in the aforementioned statement. “Those who choose to attack and assault law enforcement will continue to be met with swift and severe punishment.”\n\nBullshit. Only the people you don’t like will be punished. The ones that support you get pardoned for attacking and assaulting law enforcement.",
                "If someone in an unmarked car, with plain clothes, attempts to abduct me under any circumstances I should have the right to defend myself. This is ridiculous",
                "I think...if there are weekly news stories about ICE sending folks to a concentration camp in El Salvador, then you shouldn't be surprised that people begin finding tooth and nail to avoid capture. It could be a literal death sentence for them",
                "If more of the (and I'm not sure if this case applies here) situations where plain-clothes, no badge, black-bag kidnapping style abductions take place, I imagine you'll see a lot, lot more of this style resistance. Second amendment really coming into play soon, too. If the alternative is always going to be torture prison, what risk is there in resisting kidnapping? Broken nose would be getting off easy in that kind of situation. More likely to get a few extra holes.",
                "I mean, how long until one of these ICE officers is shot in self defense? They’re showing up masked with no credentials. Any weirdo that wants to cosplay and harass their immigrant neighbors can buy patches and vests off the internet."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Measles update: State officials report 36 more cases in West Texas",
            "external_url": "https://www.tpr.org/bioscience-medicine/2025-04-18/measles-update-state-officials-report-36-more-cases-in-west-texas",
            "upvotes": 2154,
            "date": "04/18/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/d4986a6/2147483647/strip/true/crop/2787x1463+0+252/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6a%2Ff8%2F0267f45f4986944eee0e903257db%2F2016-03-11t140544z-1308609988-mt1pra25799643-rtrmadp-3-pa-images.JPG",
            "top_comments": [
                "This update adds 36 cases to the number of reported cases in Texas associated with the outbreak. Tuesday's update added 20 cases. Last Friday's update added 36 cases. Last Tuesday's update added 24 cases. The previous Friday's update added 59 cases.\n\nFour new hospitalizations were reported, up to 62 from 58. Texas has two deaths associated with this outbreak. Both were in school-aged children.\n\nThere is also an outbreak in Upshur County, which is in East Texas. It consists of 19 cases, so far, all at one location. It is linked to two out-of-state visitors.",
                "Just waiting for the dept responsible for these reports is told to stand down.",
                "The maga leadership is a deadly disease that harms American society - stop voting for these skeevy maga liars.",
                "Rumor is that the Upshur County outbreak is at the Alert Academy in Big Sandy, Texas. People who follow the super-sized Duggar and Bates families will likely be familiar with Alert. It's part of the larger IBLP organization they're associated with.\n\nhttps://en.wikipedia.org/wiki/Institute_in_Basic_Life_Principles",
                "Imagine if they tried to get rid of measles as hard as they tried to get rid of trans athletes.",
                "As a lib living in Washington, man do I feel owned. \n\nI’m alive, and so are my kids, but phew! What a burn! \n\nMasterfully done.",
                "The CDC reported earlier today that the US is up to [800 cases nationwide this week](https://www.cdc.gov/measles/data-research/index.html).  That adds 88 to last week's total of 712.",
                "Saw my PCP. No chance of a booster vaccine despite being immunocompromised. ¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯",
                "Miscarriage = murderer and possibly prison\n\nLetting your child die of a preventable disease in agony = Religious freedum",
                "Fuckin fundies. Avoid Target and BB&B in LBK and Amarillo. They really like shopping at those places. See them there almost every weekend."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Judge blocks administration from deporting noncitizens to 3rd countries without due process",
            "external_url": "https://abcnews.go.com/US/judge-blocks-administration-deporting-noncitizens-3rd-countries-due/story?id=120951918",
            "upvotes": 41283,
            "date": "04/18/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/0c049aa4-fe66-4160-9209-c2f35277f952/donald-trump-1-ap-gmh-250418_1744979483649_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "The courts should block the payments from the administration to the countries taking these people and they won't take them anymore.",
                "I want to know how this would be enforced\n\nBecause currently I am not seeing an active and useful enforcement vehicle of any kind in play\n\nHe’s not gonna be impeached bc republicans dont care\n\nHe’s still got massive approval among republican voters \n\nIce agents aren’t exactly gonna go for civil disobedience\n\nAnd anyone charged with a crime can be pardoned by trump and he also cannot be charged with a crime apparently\n\nSo what is the barrier here other than like decorum?",
                "And who gonna stop them from ignoring this judge? \n\nFascists only play by their own rules.",
                "**It isn't a deportation; it is an extrajudicial rendition to a 3rd party dictatorship for indefinite incarceration in cruel and unusual conditions without any recourse nor due process for the accused (All at the behest of the Executive Branch and continually paid for by the U.S. taxpayer).**\n\nCalling it a \"deportation\" is like calling attempted murder, a friendly tussle.\n\nSupporting deportations and thinking the deportations are justified, doesn't require you to agree with turning a deportation order into life imprisonment in a dictatorship, paid for with your tax dollars.\n\n>\"Defendants argue that the United States may send a deportable alien to a country not of their origin, not where an immigration judge has ordered, where they may be immediately tortured and killed, without providing that person any opportunity to tell the deporting authorities that they face grave danger or death because of such a deportation,\" Judge Murphy wrote.\n\n\\---\n\nThese aren't a deportation in any traditional sense of the word and we should not call nor acknowledge them using \"deportation.\"\n\nIt wasn't removal from the country. It was U.S. law enforcement physically handing over two hundred plus people in custody (often with a questionable basis) over to El Salvador's law enforcement to throw them in a dictator's prison camp without trial, due process, or any legal recourse, all paid for by the U.S. taxpayer.\n\nThat is what we call an extraordinary rendition, or state-sponsored kidnapping, paid for by the U.S. taxpayer.\n\nCalling it a deportation buries the lead and plays into the alt-right/this administrations' narrative. Likewise it makes it harder to explain the problem here, as it phrases the complaint as against people being sent back to their country of origin.\n\nTo be clear we aren't deporting people from the country; we are using U.S. taxpayer dollars to pay a dictator to imprison and disappear hundreds (so far) of foreign nationals from 3rd party countries at the behest of the U.S. executive branch.\n\n(Not that there are no problems with the deportations/process in general, but that is much harder to communicate.)",
                "Yeah, because that's stopped them so far.",
                "Uh huh. Now fucking enforce it.",
                "\"All nine sitting justices of the Supreme Court of the United States, the Assistant Solicitor General of the United States, Congress, common sense, basic decency, and this Court all disagree [with the Trump admin].\"    \n\nU.S. District Judge Brian Murphy when issuing an injunction barring the administration from deporting non citizens to a country that is not their origin.   \n\nThat bit about common sense and basic decency is so true.",
                "The fifth amendment says no person shall be deprived of life, liberty, or property without due process of law.\n\nNot citizen. PERSON.",
                "Administration proceeds to do it anyway, because nothing matters anymore.",
                "Okay but it also needs to be stated not to \"deport\" citizens too"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "San Diego City Council bans landlords from 'price fixing' with algorithms",
            "external_url": "https://www.kpbs.org/news/living/2025/04/15/san-diego-city-council-bans-landlords-from-price-fixing-with-algorithms",
            "upvotes": 2358,
            "date": "04/18/2025",
            "thumbnail": "https://cdn.kpbs.org/dims4/default/e89525e/2147483647/strip/true/crop/5678x2981+0+107/resize/1200x630!/quality/90/?url=http%3A%2F%2Fkpbs-brightspot.s3.us-west-2.amazonaws.com%2Fba%2Fdc%2F9117f2ff4ca08e6f8efb325a3fd0%2Fimg-4479.jpg",
            "top_comments": [
                "I wonder how you enforce the ban. We tell employees they're not allowed to use AI with work-related files but we also know they still upload our proprietary data.",
                ">Once the ordinance goes into effect, tenants will have the right to sue their landlords for violations.\n\nThis sounds like a good plan on paper but how do the tenants know a banned algorithm is being used?",
                "\"The ordinance does not apply to algorithms that rely on public information, such as advertisements or listings on websites like Zillow or apartments.com.\"\n\nThere we go. Just scrap zillow and run a similar algorithm. Not that you can enforce anything. You can always ask an employee to decide the rental price, but let him look at the output the old algorithm and make sure he add some randomness to it.",
                "Rents up 36% in 6 years in SD County.    Just think about that for a sec",
                "They'll just do it the way they used to before AI - on the golf course, at the country club, at the strip club, etc.",
                "Considering California has a rent cap I imagine it’ll go the same way it has been ie. if new year = raise by maximum allowed. Don’t really need an algorithm for it",
                "So proving this is going to be a nightmare.  Any person using AI or any algorithm for this is just doing what they could, and likely were doing, before.  These algorithms merely pull from publicly available data so that means that a person can find that data if they know where to look, and these guys are not exactly hiding prices. That means you have to assume they are finding it via an algorithm instead of manually and good luck proving that and even if you can prove it, its still the same result just with a few more hours of labor.",
                "How about they relax zoning and allow people to build density, addressing the supply issue?   We've allowed NIMBYs to block density and supply so they can monetize scarcity.   It's not just the \"algorithms.\"  It's the supply.  \n\nEven for those who will say \"It's not necessarily supply--I see *tons* of housing going up and...\" the problem is supply there too.  They never mention where they're talking about, or the vacancy rate for this unnamed place where they've decided there is \"plenty\" of housing.",
                "In other news, the San Diego City Council doesn't know what an algorithm is.",
                "my san diego apt building (near OB pier) had realpage back in 2016, the whole neighborhood shot up in price pretty significantly by the time we left in late 2019. it was a really great surfer outpost, super affordable and on the water"
            ],
            "aggregate_sentiment": 73.0
        },
        {
            "category": "RISING",
            "title": "Sex toys cause fire engulfing multiple Staten Island homes: Court docs",
            "external_url": "https://www.nbcnewyork.com/local/sex-toys-cause-fire-engulfing-multiple-staten-island-homes-court-docs/6230573/",
            "upvotes": 965,
            "date": "04/18/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/StatenIslandfireforweb_56427256_1920x1080_2422284867752.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "A backyard bonfire sure is a strange way to dispose of sex toys.",
                "Articles for The Onion are writing themselves these days.",
                "They warned us to use lubrication...why didn't we listen?",
                "The dildo of consequences rarely comes lubed.",
                "best headline ever.  and of course it's staten island.",
                "🎶You\n\nYour sex is on fire\n\nConsumed\n\nWith what's to transpire🎶",
                "Dammit Lazlo..  Or maybe it was Nadja\n\nOh, who are we kidding.  This was on Nandor.",
                "This smells of Nandor and Nadja...",
                "SNL weekend update is going to have a field day with this one. ",
                "I just love the title of this article."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Key regulators approve merger of Capital One and Discover, paving the way for a new biggest credit card company",
            "external_url": "https://edition.cnn.com/2025/04/18/business/capital-one-discover-merger-conditional-approval/index.html",
            "upvotes": 1337,
            "date": "04/18/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2018747624.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Less competition means consumers are going to get screwed.",
                "Well shit. Discover has always been pretty good but here comes the enshittification...",
                "I assume they'll be off-shoring Discovers call centers now?",
                "[deleted]",
                "They’re calling it Disc One",
                "I've never had a Capital One card, I've always just used my Discover card for the cash back for the seasonal 5 % category and occasionally they'd offer a decent balance transfer promo. It would be nice to see Discover expanded, it's rarely useful internationally.",
                "Of course they did. The dystopia becomes more dystopian.",
                "This is going to be terrible for consumers!",
                "What's in your wallet?\n\nNOT Capitol One or Discover!",
                "Oh good. Just what we need. Bigger finance companies."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Austin Metcalf's father escorted out of Karmelo Anthony's family news conference after unexpected appearance",
            "external_url": "https://www.cbsnews.com/texas/news/austin-metcalfs-father-escorted-out-karmelo-anthonys-family-news-conference/",
            "upvotes": 4436,
            "date": "04/18/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/17/6d8cd1eb-c9b9-41e5-ad50-215fcff451d3/thumbnail/1200x630/78e26ed903475263be7846dd82823cf6/toc-04172025-karmelo-anthony-family-presser-11-24-0519-1.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "Not gonna lie, this is a bad article.\n\nYou can't just drop an initialism ike \"NGAN\" without writing it out once, that's just common knowledge.",
                "For a second I thought this was in reference to retired NBA player Carmelo Anthony and got extremely confused",
                "When I saw the news conference, I thought it was the family of the victim speaking. Then I went online to find out what happened to him and uh, they're the family of the killer? The family of the victim is being treated like the family of the killer and the killer's family treated like the victim...it's bizarre.",
                "Why are they even having a press conference?  Their kid murdered someone, I'd be hiding in shame",
                "That minister is a tool.",
                "> Minister Dominique Alexander \n\nUh, I don't think they want to associate with that guy...  \nhttps://nypost.com/2025/04/18/us-news/activist-minister-aiding-accused-teen-killer-karmelo-anthony-has-his-own-lengthy-rap-sheet-report/",
                "So he got asked to leave but didn't stab anyone? Crazy. ",
                "The discourse surrounding this murder is just insane. I'm not sure where these opposing narratives are coming from, but the kid took a knife to a track meet and stabbed someone in the heart....I don't think much else matters.",
                "They make it sound like the killer was the victim. Jfc.",
                "How is a grieving father showing up at the press conference of the parents of his son's accused killer both \"disrespectful\" and \"inappropriate\"?  How is it trespassing?  I'm appalled that the man was asked to leave."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Japan bus driver with 3 decades of service loses $84,000 pension after he was caught stealing $7",
            "external_url": "https://www.cbsnews.com/news/japan-bus-driver-loses-pension-for-stealing-7-dollars/",
            "upvotes": 9061,
            "date": "04/18/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/18/b958a561-2831-4cb5-8035-ce58469db518/thumbnail/1200x630/413cc3e4c195185d2b8eaec5d3fafe61/gettyimages-2147869596.jpg?v=04a4ba26f526ed8207f014fe1018c4aa",
            "top_comments": [
                "> The driver had been reprimanded several times during his career over various incidents, according to the ruling.\n\nI think the $7 worth of fare stolen was what they could prove in court with evidence. There may have been far more discrepancies in terms of number of passengers versus fare collected but for some reason won’t disclose it, because otherwise this does seem extraordinarily excessive for someone that had been driving with them for that long, even for Japan.",
                "Imagine if they did this to cops",
                "Is it 84K in total or annually?\n\nSeems very low for 30 years of work.",
                "That's how much he was caught stealing, how much was stolen before it was identified?",
                "\"Despite being caught on camera, he tried to deny it during a meeting with his superior.\"\n\nSo a dishonest and idiotic liar. \n\n\"The driver had been reprimanded several times during his career over various incidents, according to the ruling.\"\n\nShould be fired long ago.",
                "This was the first time he was CAUGHT, not necessarily the first time he stole.",
                "its only 7$, but its still stealing and who knows how many times he hasnt gotten caught.",
                "Maybe $14 stolen before,  crime unsolved",
                "Japanese justice is known to not fuck around",
                "Hey atleast he lose his pension with his own power,\nSome people are losing that amount in their retirement by another man’s actions"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/19/2025 00:39:58 UTC"
}