{
    "posts": [
        {
            "category": "HOT",
            "title": "Department of Education lays off nearly 50% of its workforce",
            "external_url": "https://abcnews.go.com/US/department-education-faces-50-layoffs-after-closure-notice/story?id=119690524&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 33350,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/63d5aa42-9003-48c5-b937-5f4e3fa8c88f/dept-education-1-epa-gmh-250311_1741707004175_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Woman who's never worked in education and enrolled her own kids in private schools has strong feelings on how little funding should go to programs helping special needs students.",
                "As a disabled person that benefited from DoE policy to get my high school and college diplomas I worry for the younger generation that will lose access.",
                "From the contacts I know at the Dept of Ed, the compliance department has been more or less decimated, and the ombudsman's office has also taken a massive hit if not completely destroyed as well. \n\nThese departments served as guide rails, keeping people on track and providing accountability. Things are going to get very very messy.\n\nDepts with firings: \n\n • National Center for Education Statistics\n\n • Institute of Education Sciences\n\n • Federal Student Aid\n\n • Office for Civil Rights\n\n • Office of Postsecondary Education \n\n • Office of General Counsel Ethics Division\n\nBoston, New York, Atlanta, Chicago, Cleveland, Dallas, San Francisco have been abolished.  The offices spared are Denver, Kansas City, Seattle and DC Metro. DOED Office for Civil Rights\n\nOver 1800 people gone. \n\nThis is gonna have a MASSIVE down stream impact on K-12, Hs, and college level Education, data, compliance, and special education programs. \n\nPeople aren't really aware of what this will do. It's like being on a plane 20000ft jn the air and ripping out random wires because you dont think you need them.",
                "Everything Trump is doing weakens America, and hurts Americans.",
                "This is the kind of thing that should set off alarm bells, but somehow it just feels like another day in the slow dismantling of public services. Cutting nearly half a department overnight, with barely a warning, is not streamlining, it is sabotage. Even if you believe the Department of Education is bloated, you do not fix a system by gutting it in a way that leaves staff terrified and scrambling. \n\nPeople do not work well under fear, and a government that rules through uncertainty is more interested in control than competence. The bigger question is what comes next. If this is just the warm-up act for dismantling the department altogether, what does that mean for the millions of students and families who rely on federal education programmes? Anyone cheering this move might want to ask themselves whether they trust their local politicians to handle education funding fairly and effectively because that is where this is headed.",
                "\"Six communications offices are going to be consolidated, they explained, and leases will end in major cities including San Francisco, New York, Cleveland, Boston, Chicago and Dallas.\"\n\nSeem a little targeted to anyone else?",
                "I hate how the worst possible news reports don't even get a sigh out of me anymore. Not that I'm accepting this as normal, but at this point my reaction to this headline is just 'of course it is'.",
                "Being in college right now is weird. Not a lot of political discussions allowed/welcome in the classrooms. Instead of organizing (maybe out of fear) everyone is in self preservation mode due to midterms. This news doesn’t make it easy to lock in on my own studying.",
                "2024 Election exit data polling shows the higher level of education someone achieves, the more likely they are to vote Democratic. Those without a college degree are most likely to vote Republican\n\n[Source](https://www.nbcnews.com/politics/2024-elections/exit-polls)\n\nIf you check this [source](https://en.wikipedia.org/wiki/List_of_U.S._states_and_territories_by_educational_attainment) and sort by states based on percent of people who have a bachelors or higher, the top 10 are blue states and the bottom ten are red states.\n\nTrump said \"I love the uneducated\" because they are his base. Attacks on education are purposeful.",
                "It's gonna take decades to repair the damage trump has done."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Arrested ship's captain is Russian national",
            "external_url": "https://www.bbc.co.uk/news/articles/c30mj5gq9d5o",
            "upvotes": 2159,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0a22/live/f3b246e0-ff23-11ef-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "So this will be the last we’ll hear of it then.",
                ">The Stena Immaculate was carrying 220,000 barrels of aviation fuel to be used by the US military.\n\nHoly crap. Is the US military going to respond to this?",
                "The only group of people trying to start WW3 are the Russians. Cutting communication lines across the region and now purposefully attacking other vessels.",
                "China does the same, ramming Philippine, Taiwan, Vietnam, Japan etc's ships with their fake fishing boats then pretending they were the ones attacked. Brace for similar allegations from Russia.\n\n[https://youtu.be/lv031K\\_lV4I?si=9T-KbHK6SxSAPAxp](https://youtu.be/lv031K_lV4I?si=9T-KbHK6SxSAPAxp)\n\n[https://youtu.be/JxhjHAFwcd4?si=9FxKO3Z6Mz2tVr2f](https://youtu.be/JxhjHAFwcd4?si=9FxKO3Z6Mz2tVr2f)",
                "In what world is this not considered an attack on a U.S. military vessel?",
                "So it was an intentional collision",
                "We need to be scuttling every Russian ship in Europe. Period. Everything gone.",
                "Unfortunately when Besiktas-M accidentally ran into the USS Harry S. Truman, it showed how easy it is to just ram a ship into a US asset. Just like 'accidentally' dragging anchors can cut underwater cables, I'm sure we're about to see a spike in 'accidental' ship collisions.",
                "Russians and boats don’t seem to mix well.",
                "“No no comrade, I refer to everywhere as motherland”"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "US Military cancels climate change studies that Pentagon chief calls 'crap'",
            "external_url": "https://www.reuters.com/world/us/us-military-cancels-climate-change-studies-that-pentagon-chief-calls-crap-2025-03-10/",
            "upvotes": 3523,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It's fine, it's not like climate change ruins crop growth, which fluffs up food production, which elevates food prices, which causes civil unrest, which causes social-political collapse, which overthrows regimes.\nEG Syria.",
                "Pretty sure for 2 decades or so DoD has said climate change is one of our biggest threats.",
                "A Secretary of Defense that achieved a high rank in the military would have finished required studies and known how important this issue is towards geopolitics going forward.  Our country is run my idiots that think they know everything.",
                "Save 30 million, lose 100 billion. Math is mathing.\n\n\n\"In 2023, the United States experienced 28 separate weather or climate disasters that each resulted in at least $1 billion in damages. Damages from the 2023 disasters totaled $92.9 billion.\"",
                "Literally a DEI hire generic white dude lmao",
                "\"If you ignore the problem, it will just go away.\"\n\n- Alberto Einstein",
                "Most unqualified Sec of Defense in history.",
                "In the future, any Americans devastated due to climate change have full rights to pillage the homes of rich fucks who denied it.",
                "I'm sure he came to that conclusion based on a thorough review of the available literature, conference proceedings, analysis of the raw data, and discussion with academic experts who have spent decades studying the topic.",
                "Pentagon was studying climate change as one of the most apparent and urgent concerns for national security for years. Its going to strain resources, destabilize regions, cause mass refugee crisis's etc.\n\nBut sure. Lets turn a blind eye to it because fossil fuel propaganda.  Not like the people who covered up the dangers of mass lead poisoning ever lead us astray."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Musk launches appeal to restore $56 billion Tesla payday",
            "external_url": "https://www.reuters.com/business/autos-transportation/musk-launches-appeal-restore-56-billion-tesla-payday-2025-03-11/",
            "upvotes": 21386,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Musk has said that he wants a greater stake in Tesla or he might develop products outside of the company.   \n   \nAh yes, threatening your own company.",
                "\"I would like you to pay me 56 billion dollars while I am actively tanking the company's value\" is an interesting pitch ...",
                "They should ask him to name 5 things he did for the company last week.",
                "Hey guys I’m gonna need that money before I completely destroy the brand with my evil actions",
                ">When Elon Musk came to the White House asking me for help on all of his many subsidized projects, whether it's electric cars that don't drive long enough, driverless cars that crash, or rocket ships to nowhere, without which subsidies he'd be worthless and telling me how he was a big Trump fan and Republican, I could have said, 'drop to your knees and beg,' and he would have done it…\n\n[Donald Trump, Jul 12, 2022.](https://www.google.com/search?q=%22When%20Elon%20Musk%20came%20to%20the%20White%20House%20asking%20me%20for%20help%20on%20all%20of%20his%20many%20subsidized%20projects%2C%20whether%20it%27s%20electric%20cars%20that%20don%27t%20drive%20long%20enough%2C%20driverless%20cars%20that%20crash%2C%20or%20rocket%20ships%20to%20nowhere%2C%20without%20which%20subsidies%20he%27d%20be%20worthless%20and%20telling%20me%20how%20he%20was%20a%20big%20Trump%20fan%20and%20Republican%2C%20I%20could%20have%20said%2C%20%27drop%20to%20your%20knees%20and%20beg%2C%27%20and%20he%20would%20have%20done%20it%E2%80%A6%22%20-Donald%20Trump)",
                "Has he seen the stock price?",
                "He admitted that while running Doge, he is running his companies with \"great difficulty\"\n\nWhy would shareholders reward a CEO who is having \"great difficulty\" running their company?",
                "I highly doubt shareholders would support him now if they were to vote on it again. He's lost the shareholders billions.",
                "He should not buy a Tesla unless it’s in Canada and he buys two a minute",
                "Elon, do you little salute again, maybe that will fix things"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Australia will not be imposing reciprocal tariffs on the US, says PM Anthony Albanese",
            "external_url": "https://www.sbs.com.au/news/article/australia-wont-be-exempt-from-us-tariffs-on-steel-and-aluminium-exports/oos69k7eq",
            "upvotes": 2229,
            "date": "03/12/2025",
            "thumbnail": "https://images.sbs.com.au/dims4/default/5703497/2147483647/strip/true/crop/4907x2760+0+0/resize/1280x720!/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2F64%2Fd0%2Fa2287b944dff82c452ee8dffe4d6%2F20241213183308566713-original.jpg",
            "top_comments": [
                "Watch out, that’s like an open invitation for annexation",
                "In 2024, the United States imported $16.7 billion worth of goods from Australia, with the top commodities being agricultural products, stone, glass, metals, and pearls, and chemicals, plastics, rubber, and leather goods. The U.S. has a trade surplus with Australia, meaning it exports more goods and services to Australia than it imports. \n\nThere are no incentives for Australians to add tariffs.",
                "Just ban Tesla sales for national security, or impose huge tariffs on them. Ooh and make a big show of banning Trump from visiting outside of official duties effective in 4 years (or do whatever you want, I'm just spit balling here)",
                "Probably because he knows it isn’t worth it. Australia isn’t like Canada, who can actually do some damage in a trade war with the U.S. Australia’s economy isn’t as interlinked with the U.S.",
                "When I googled \"what does Australia export to the usa\"\n\nAustralia's largest exports to the US are financial services, gold, sheep/goat meat, transportations services and vaccines. US direct investment in Australia is more than in any other country in the Indo-Pacific.\n\nI think Australia will be fine.",
                "Why have tariffs when you can just boycott American goods like the rest of us?",
                "I get it that Australia has to keep Trump happy because they’re hanging on to this sliver of hope that the US will protect them if China attacks. But as a Canadian I couldn’t be happier with how our government on all levels has responded, straight aggression, none of this appeasement shit.",
                "Boycott all US products.",
                "Careful Australia. Give Trump an inch and he takes it all.",
                "No need to reciprocate when you can get everything you need elsewhere."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "West Texas measles outbreak spreads into Oklahoma",
            "external_url": "https://www.nbcnews.com/health/health-news/west-texas-measles-outbreak-spreads-oklahoma-rcna195858",
            "upvotes": 2803,
            "date": "03/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250311-measles-ch-1302-700353.jpg",
            "top_comments": [
                "Goddamn you, you goddamn idiots.",
                "Very sad and preventable. \n\nEven if you survive, you can still end up with scarring on your lungs and all sorts of other complications years down the line. ",
                "God sends another plague on Trump's America because Evangelicals didn't get the point the first time.",
                "Anti-vaxxers are all fucking idiots. I can tell you from experience that there is absolutely nothing you can say to get them to see sense. I have an aunt who is anti-vax, and she always says in the face of facts, \"agree to disagree.\" I'm not sure that they'd change their stance even if one of their kids died. \n\nIt's not fair for the kids, since they didn't exactly choose to be born to total morons. Although unfortunately, the apple doesn't always fall far from the tree. My aunt had two daughters, and my cousins are as vapid as their mother. One of my cousins also has two daughters, and they're also not vaccinated. I just hope that they grow up to be better than their mom and grandma. The whole family is just lucky that they've only encountered mild cases of measles, and they're super lucky that we've managed to eliminate more serious illnesses such as polio and smallpox before my cousins were even born. The former is still out there in the world. It may be unlikely for it to come back to the US, but it isn't impossible.",
                "Don't worry, brain worm boy has a crack solution.\n\nAnd yes that is 100% /s.",
                "This is not going away by itself now, even if you vaccinate like crazy",
                "Oklahoma??? You mean:\n\n- 44th in Education?\n- 49th in Healthcare?\n- 44th in Life Quality?\n- 50th in Test Scores?\n- top ten worst in poverty?\n\nThat Oklahoma? Boy, am I shocked!",
                "Scary time to be pregnant, thankfully my baby will be out soon. My dad was made deaf from his mom having measles while pregnant.",
                "Are there really this many unvaccinated people? I’m 40 and had all mine as a kid, they say the vaccine for measles is a life vaccine so what the fuck is going on?",
                "If there is a hell Andrew Wakefield will feel the pain of every single disease his bogus \"research\" caused"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "US to immediately restore intelligence sharing and 'security assistance' to Ukraine",
            "external_url": "https://www.bbc.com/news/live/c51ypekv9xwt",
            "upvotes": 23688,
            "date": "03/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f1b2/live/63263dc0-ff28-11ef-b50e-9d086302645f.jpg",
            "top_comments": [
                ">Marco Rubio is asked if they are accepting any good-will gestures from Russia or if there is a deadline.\n\n\n>Rubio says \"Ukraine is ready to stop shooting and start talking.\"\n\n\n>He reiterates that he hopes Russia will say yes to the ceasefire, but if they say no \"then we'll unfortunately know what the impediment is to peace here\".\n\n\nIf you didn't already know that the impediment to peace is the guy who started the invasion............",
                "Forgot to add asterisk*, *with terms and conditions applied.*",
                "So he basically got hundreds of Ukrainians killed for nothing",
                "[removed]",
                "I don't believe it and any \"assistance\" will likely help Russia.",
                "I feel like Trump is running this country like a 13 yr old. He hates you today and likes you the next. Nobody signed up for this shitty roller coaster ride.",
                "I would not be trusting any US intel if I was Ukraine ",
                "So the deal with the Russians was that Trump would pause intelligence sharing to give them an advantage in Kursk? Well done, Trump!",
                "Oh, is he thankful enough now? Was his shirt nicer? Did X have hiccups for reasons other than Ukraine?\n\nWe’ll see in 3 days when the administration throws them under the bus again.",
                "American Intelligence is becoming something of an oxymoron under this administration"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Trump backs off doubling Canadian steel and aluminum tariffs after Ontario suspends electricity surcharge",
            "external_url": "https://www.cbsnews.com/news/trump-tariffs-canada-steel-aluminum/",
            "upvotes": 6491,
            "date": "03/11/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/11/d3dc91bb-a425-42cb-9d30-0ff10eafaa14/thumbnail/1200x630g2/b57462378b668dd5d145a85b2e321fc0/gettyimages-2203227046.jpg?v=23322f4fbf0a01b337c42258c443e9ac",
            "top_comments": [
                "This is the most farcical trade war ever.",
                "I swear to God this is exhausting. It makes me wish we were back in the pandemic years so I can just make sourdough and not have to hear the word tariff 50x a day.",
                "So he's not running America so much like ***a*** business, as he is running America like [*his* business](https://www.americanbanker.com/news/banking-on-the-donald).",
                "They suspended the surcharge as good faith for the meeting this Thursday. That was not a win for the orange bastard.",
                "His decision making is child-like. Impulsive, personal, ad hoc, transactional. He is a bully who has been handed the reigns of government.",
                "\"Speak loudly and carry a small dick.\" --The Trump Doctrine ",
                "snip snap snip snap snip snap snip snap snip snap snip snap",
                "Consistently inconsistent",
                "Sundowning embarrassment",
                "At least until tomorrow. When he wakes up in his shit filled diaper and decides to tariff  something else because he’s mad."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "Trump has instructed to raise Canadian tariffs on aluminum and steel to 50%",
            "external_url": "https://www.theguardian.com/us-news/live/2025/mar/11/donald-trump-latest-us-politics-news-live?CMP=share_btn_url&page=with%3Ablock-67d042cb8f087aea3a248e0d#block-67d042cb8f087aea3a248e0d",
            "upvotes": 40380,
            "date": "03/11/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/0b0825591c1024786d86f2885a2b0b687e566fbd/0_431_7276_4368/master/7276.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=d469fea090bd2490dd7093a76c2aa525",
            "top_comments": [
                "Sounds like it gonna be another great day on the Stock Market!!!",
                "I like how he keeps bringing up the dairy one. Negotiated BY HIM, and it only kicks in at a level that has NEVER been met. Those tariffs have never been charged.",
                "\"Trump said he would “permanently shut down the automobile manufacturing business in Canada” if the country did not end unspecified tariffs it had placed on US goods:\"\n\nEverything in thr market could be appeased if this moron backs down. \n\nAnd yet, he continues to double down on tariffs. \n\nThis is madness",
                "“He would see the entire world burn just to be the king of ashes”",
                "It's wild. We were so scared of the first set of tariffs, now I'm just like \"I'm tired boss\" and keep scrolling. Honestly his inability to take a measured approach to anything makes me think it'll sputter out quickly, he'll claim victory and forget tariffs are a thing by summer. Wishful thinking, I know.",
                "Last time he did this, during Trump 1.0, aluminum plants in Kentucky closed, leading to higher unemployment. That county was devastated. Congratulations, Trump, and Trump voters!!!",
                "Maybe instead of tariffs, we could properly tax billionaires 🤷🏻‍♂️",
                "Apparently Trump wanted more chaos and uncertainty today. He and his administration have been trying to do at least one ill intentioned thing per day so far.",
                "My MAGA buddy who owns a metal building construction business is about to find out",
                "Trump recession is self inflicted. Trump must be rejected."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "HOT",
            "title": "Fear of flying is pushing ticket sales down in the wake of multiple crashes, airlines say",
            "external_url": "https://www.cnn.com/2025/03/11/business/passengers-air-travel-crashes-fear/index.html",
            "upvotes": 10150,
            "date": "03/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2199796404.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Let's offset this by charging for luggage.\n\n \\- Southwest Airlines",
                "Misleading headlines it's not so much \"fear of flying\" as it is \"safety concerns after whistleblowers and deregulation and several accidents\"",
                "Elon Musk only flies on Air Force 1 lately.  Must be a sign.",
                " Without proper oversight, it is not the Fear of flying but the fear of crashing. Why would people travel with all the fear and uncertainty in the Russian Vassal State of the USA.",
                "make trains great again :) i seriously wish USA would build a massive highspeed rail system",
                "With the government cutting a large amount of the people who service the air traffic equipment and knowing the fact that they were already pretty thin in that area, I'm probably not going to fly for a long while myself.",
                "I think it's more people not traveling because of economic reasons...",
                "I just had to decide whether to to make a 7.5 hour drive or fly. I chose to drive thinking of Elon's FAA cuts. Fuck those DOGE assholes.",
                "Yup, I canceled a flight this month after my brother's girlfriend almost died in that recent near miss where Southwest pilot pulled up just in time to avoid a taxiing idiot. Not gonna be a statistic for these assholes.",
                "It seems completely rational with the dangerous cuts to the FAA."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "China, Russia, Iran to hold nuclear talks in Beijing on Friday",
            "external_url": "https://www.reuters.com/world/china-hold-meeting-with-russia-iran-iranian-nuclear-issue-2025-03-12/",
            "upvotes": 78,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Nightmare blunt rotation.",
                "Trump mad yet that Putin didn't invite him?",
                "One piece of journalism I didn’t wish to hear today.",
                "Oh that's just China and Russia flexing their new world order and showing that big bad USA has been broken and is now just a marginalized country with no friends that can be ignored and brushed aside when making decisions about how the global order is going to be run.",
                "Well it's a good thing we killed our own nuclear agreement with Iran so that they could find a new agreement with more stable regimes. \n\nThis started off as sarcasm but I don't know what's parody and what's real life anymore.",
                "Lol first getting booted from the nato table for talking shit and now friendzoned by the new buddies. \n\nI think they don‘t like the US proposal to half all military spending.",
                "When the multiverse villians make their own avenger, \n\nomg that would be a sick movie"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Captain of Solong container ship involved in North Sea crash is Russian national, company says",
            "external_url": "https://news.sky.com/story/captain-of-solong-container-ship-involved-in-north-sea-crash-is-russian-national-company-says-13326888",
            "upvotes": 212,
            "date": "03/12/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-solong-container-ship_6853935.jpg?20250312092801",
            "top_comments": [
                "Russians and boats don’t seem to mix well.",
                "Figures, the question is how will they blame Ukraine.",
                "Of course he is!\n\nA ship crashes, at speed, into one that is anchored, clearly visible and carrying tonnes of aviation fuel. \n\nAll russian ships have a \"Ramming Speed\" setting apparently. Its right beside the \"Submarine\", setting and \"Cable cutting speed\" setting. \n\nI",
                "Damn at first glance I thought it said Captain Schlong which would have been way cooler",
                "Russia in WAR against Europe in 3 years... Why Europe hire russians... They distroy, have many under sea cabel!?...",
                "So now we ask ourselves, was this done on purpose by Russia?",
                "So you’re saying he did it on purpose because he’s Russian?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Arrested ship's captain is Russian national",
            "external_url": "https://www.bbc.co.uk/news/articles/c30mj5gq9d5o",
            "upvotes": 2164,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0a22/live/f3b246e0-ff23-11ef-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "So this will be the last we’ll hear of it then.",
                ">The Stena Immaculate was carrying 220,000 barrels of aviation fuel to be used by the US military.\n\nHoly crap. Is the US military going to respond to this?",
                "The only group of people trying to start WW3 are the Russians. Cutting communication lines across the region and now purposefully attacking other vessels.",
                "China does the same, ramming Philippine, Taiwan, Vietnam, Japan etc's ships with their fake fishing boats then pretending they were the ones attacked. Brace for similar allegations from Russia.\n\n[https://youtu.be/lv031K\\_lV4I?si=9T-KbHK6SxSAPAxp](https://youtu.be/lv031K_lV4I?si=9T-KbHK6SxSAPAxp)\n\n[https://youtu.be/JxhjHAFwcd4?si=9FxKO3Z6Mz2tVr2f](https://youtu.be/JxhjHAFwcd4?si=9FxKO3Z6Mz2tVr2f)",
                "In what world is this not considered an attack on a U.S. military vessel?",
                "So it was an intentional collision",
                "We need to be scuttling every Russian ship in Europe. Period. Everything gone.",
                "Unfortunately when Besiktas-M accidentally ran into the USS Harry S. Truman, it showed how easy it is to just ram a ship into a US asset. Just like 'accidentally' dragging anchors can cut underwater cables, I'm sure we're about to see a spike in 'accidental' ship collisions.",
                "Russians and boats don’t seem to mix well.",
                "“No no comrade, I refer to everywhere as motherland”"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Russia sceptical of US 30-day Ukraine ceasefire idea, sources say",
            "external_url": "https://www.reuters.com/world/europe/russian-lawmaker-says-any-ukraine-deal-will-be-moscows-terms-not-washingtons-2025-03-12/",
            "upvotes": 175,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Hmmm....almost like Russia doesn't want to negotiate...despite Trump's constant glazing.",
                "Russia says they dont want a short term ceasefire, but even if they agree to a long term truce…what reason is there to trust them to abide by it?",
                "Russia preparing there suspicions for when they break the ceasefire. I feel this forced pause is just so orange man can say he found peace. Russia can rearm when trump removes sanctions, and then when it all kicks off again, trump will blame ukraine for the end to the cease fire in some false flag, then Russia will attempt to roll over ukraine again with a rearmed force.",
                "Ukrainians called their bluff.",
                "What's the 30 days for? I thought he'd have it solved in 24 hours?",
                "Ukraine can safely agree to absolutely anything right now since Russia has no plans to uphold anything.",
                "I’m shocked. Shocked! Well not that shocked",
                "They can stop pretending Trump's isn't their's. Everyone outside the US, and 75 million-ish in the US, knows.",
                "The invader doesn’t like ceasefire hmmm, wonder why",
                "Ukraine will not accept any deal that doesn't give them long-term GUARANTEED protection AND land returned. Russia will not accept any deal that gives Ukraine long-term protection and land returned. So, there will never be a deal. \n\nThe quickest way to get to some kind of solution is for the US to send a large number of \"peace keeping\" troops to move into currently held Russian areas and see what the Russians do. If they pull back, then we know they don't want that land enough to fight the US for it. If they don't pull back, then the US has its answer and can go from there. But until we know exactly what Russia is willing to do to keep that territory, we cannot negotiate with them to give anything up. They're committed to the dumbest idea ever with no exit strategy."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Man lives for 100 days with artificial titanium heart in successful new trial",
            "external_url": "https://www.cnn.com/2025/03/12/health/australia-artificial-heart-100-days-intl-hnk/index.html",
            "upvotes": 326,
            "date": "03/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/bivacor-tiq-04-6.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "It says this is the first time someone was able to physically leave the hospital with an artificial heart, too.",
                "From the moment I understood the weakness of my flesh, it disgusted me. I craved the strength and certainty of steel. I aspired to the purity of the Blessed Machine. Your kind cling to your flesh, as though it will not decay and fail you. One day the crude biomass you call a temple will wither, and you will beg my kind to save you. But I am already saved, for the Machine is immortal… Even in death I serve the Omnissiah.",
                "They gave him a Picard",
                "W-w-what happened on day 101..?",
                "Getting closer to cyborgs being a reality.",
                "Looks like a steampunk grenade.",
                "You shoot me down, but I won't fall.",
                "My questions, as someone who knows nothing about these artificial hearts, or pacemakers:\n\nWhat does it feel like? Is it super heavy in the chest? What's holding it up when you stand, to stop it feeling like it's pulling on important infrastructure, and weighing you down? \nWhat does it sound like? Is there a clunking, due to the magnets? Would it lull you to sleep or keep you awake?\nHow is it regulated? Is it just a regular rhythm? If so, no exercise? Or can it speed up to provide oxygen in blood-pumping scenarios?\nIs it proprietary or will folks one day be able to have this titanium heart and not worry about software updates or company collapses, like people in the US have had with CPAP machines and insulin pumps?\n\nAny other questions folks have in regards to this? I bet there's a whole lot of stuff I haven't thought of.",
                "We got Man with a Titanium Heart before GTA 6.",
                "Cyberpunk here we come."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "A 4-year-old’s mom ate his ice cream. He called the cops",
            "external_url": "https://www.cnn.com/2025/03/11/us/wisconsin-boy-911-ice-cream-hnk/index.html",
            "upvotes": 80,
            "date": "03/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/untitled-1-20250311034502815.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "There were no survivors.",
                "I'm so sorry, ma'am. You've raised a narc.",
                "And then the kids doughnuts went missing after the cops showed up.\n\nThe case was never solved.",
                "She needs life without parole for that one.",
                "Kid's been watching too much copaganda like paw patrol or something.",
                "\"Two days later the officers obliged, surprising the young whistleblower with two scoops of ice cream topped with blue sprinkles.\".  \n\nI'm shocked it ended like this",
                "My kid wrote a sign that said MOM JAIL when he was 3. He put it on me. My crime was telling him he did in fact have to go to bed. He then proceeded to tell me that there are no toys in jail and I would have to bring my own food. \n\nKids are savage",
                "And they didn't arrest her? Imagine learning of police corruption at 4.",
                "And then he grew up to be the guy that kicked off about his kids possibly drinking his drink and leaving the empty cup in the fridge.",
                "Time to learn that snitches get stitches 😂"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "US Military cancels climate change studies that Pentagon chief calls 'crap'",
            "external_url": "https://www.reuters.com/world/us/us-military-cancels-climate-change-studies-that-pentagon-chief-calls-crap-2025-03-10/",
            "upvotes": 3534,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It's fine, it's not like climate change ruins crop growth, which fluffs up food production, which elevates food prices, which causes civil unrest, which causes social-political collapse, which overthrows regimes.\nEG Syria.",
                "Pretty sure for 2 decades or so DoD has said climate change is one of our biggest threats.",
                "A Secretary of Defense that achieved a high rank in the military would have finished required studies and known how important this issue is towards geopolitics going forward.  Our country is run my idiots that think they know everything.",
                "Save 30 million, lose 100 billion. Math is mathing.\n\n\n\"In 2023, the United States experienced 28 separate weather or climate disasters that each resulted in at least $1 billion in damages. Damages from the 2023 disasters totaled $92.9 billion.\"",
                "Literally a DEI hire generic white dude lmao",
                "\"If you ignore the problem, it will just go away.\"\n\n- Alberto Einstein",
                "Most unqualified Sec of Defense in history.",
                "In the future, any Americans devastated due to climate change have full rights to pillage the homes of rich fucks who denied it.",
                "I'm sure he came to that conclusion based on a thorough review of the available literature, conference proceedings, analysis of the raw data, and discussion with academic experts who have spent decades studying the topic.",
                "Pentagon was studying climate change as one of the most apparent and urgent concerns for national security for years. Its going to strain resources, destabilize regions, cause mass refugee crisis's etc.\n\nBut sure. Lets turn a blind eye to it because fossil fuel propaganda.  Not like the people who covered up the dangers of mass lead poisoning ever lead us astray."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Australian man survives 100 days with artificial heart in world-first success | Health",
            "external_url": "https://www.theguardian.com/australia-news/2025/mar/12/australian-man-survives-100-days-with-artificial-heart-in-world-first-success",
            "upvotes": 284,
            "date": "03/12/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e2e70943d8df3097e495aa6b2c3d644769d91afd/0_275_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c0280676084c98f7fca2f0647713f0b9",
            "top_comments": [
                "Until the repo man comes",
                "Is he still alive or did he die after exactly 100 days?",
                "This is actually incredibly awesome. Very impressed. ",
                "My ex has been doing it for 30 years…",
                "..I read that initially as, \"In first-world success\", and my aneurysm pulled a hammy.",
                "So he didn't pay for his subscription and they cut him off",
                "Does it have a normal pulse?  \nDoes it pump at the same speed whether he's sleeping or active, or does it have some way to adjust?\nHow is it powered?",
                "The longer I live the more the world is starting to look like the one in Robocop.",
                "That is one steam punk ass looking artificial heart there, i love it",
                "It looks like hector is running three Honda civics with spoon engines."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Australia will not be imposing reciprocal tariffs on the US, says PM Anthony Albanese",
            "external_url": "https://www.sbs.com.au/news/article/australia-wont-be-exempt-from-us-tariffs-on-steel-and-aluminium-exports/oos69k7eq",
            "upvotes": 2234,
            "date": "03/12/2025",
            "thumbnail": "https://images.sbs.com.au/dims4/default/5703497/2147483647/strip/true/crop/4907x2760+0+0/resize/1280x720!/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2F64%2Fd0%2Fa2287b944dff82c452ee8dffe4d6%2F20241213183308566713-original.jpg",
            "top_comments": [
                "Watch out, that’s like an open invitation for annexation",
                "In 2024, the United States imported $16.7 billion worth of goods from Australia, with the top commodities being agricultural products, stone, glass, metals, and pearls, and chemicals, plastics, rubber, and leather goods. The U.S. has a trade surplus with Australia, meaning it exports more goods and services to Australia than it imports. \n\nThere are no incentives for Australians to add tariffs.",
                "Just ban Tesla sales for national security, or impose huge tariffs on them. Ooh and make a big show of banning Trump from visiting outside of official duties effective in 4 years (or do whatever you want, I'm just spit balling here)",
                "Probably because he knows it isn’t worth it. Australia isn’t like Canada, who can actually do some damage in a trade war with the U.S. Australia’s economy isn’t as interlinked with the U.S.",
                "When I googled \"what does Australia export to the usa\"\n\nAustralia's largest exports to the US are financial services, gold, sheep/goat meat, transportations services and vaccines. US direct investment in Australia is more than in any other country in the Indo-Pacific.\n\nI think Australia will be fine.",
                "Why have tariffs when you can just boycott American goods like the rest of us?",
                "I get it that Australia has to keep Trump happy because they’re hanging on to this sliver of hope that the US will protect them if China attacks. But as a Canadian I couldn’t be happier with how our government on all levels has responded, straight aggression, none of this appeasement shit.",
                "Boycott all US products.",
                "Careful Australia. Give Trump an inch and he takes it all.",
                "No need to reciprocate when you can get everything you need elsewhere."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "West Texas measles outbreak spreads into Oklahoma",
            "external_url": "https://www.nbcnews.com/health/health-news/west-texas-measles-outbreak-spreads-oklahoma-rcna195858",
            "upvotes": 2798,
            "date": "03/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250311-measles-ch-1302-700353.jpg",
            "top_comments": [
                "Goddamn you, you goddamn idiots.",
                "Very sad and preventable. \n\nEven if you survive, you can still end up with scarring on your lungs and all sorts of other complications years down the line. ",
                "God sends another plague on Trump's America because Evangelicals didn't get the point the first time.",
                "Anti-vaxxers are all fucking idiots. I can tell you from experience that there is absolutely nothing you can say to get them to see sense. I have an aunt who is anti-vax, and she always says in the face of facts, \"agree to disagree.\" I'm not sure that they'd change their stance even if one of their kids died. \n\nIt's not fair for the kids, since they didn't exactly choose to be born to total morons. Although unfortunately, the apple doesn't always fall far from the tree. My aunt had two daughters, and my cousins are as vapid as their mother. One of my cousins also has two daughters, and they're also not vaccinated. I just hope that they grow up to be better than their mom and grandma. The whole family is just lucky that they've only encountered mild cases of measles, and they're super lucky that we've managed to eliminate more serious illnesses such as polio and smallpox before my cousins were even born. The former is still out there in the world. It may be unlikely for it to come back to the US, but it isn't impossible.",
                "Don't worry, brain worm boy has a crack solution.\n\nAnd yes that is 100% /s.",
                "This is not going away by itself now, even if you vaccinate like crazy",
                "Oklahoma??? You mean:\n\n- 44th in Education?\n- 49th in Healthcare?\n- 44th in Life Quality?\n- 50th in Test Scores?\n- top ten worst in poverty?\n\nThat Oklahoma? Boy, am I shocked!",
                "Scary time to be pregnant, thankfully my baby will be out soon. My dad was made deaf from his mom having measles while pregnant.",
                "Are there really this many unvaccinated people? I’m 40 and had all mine as a kid, they say the vaccine for measles is a life vaccine so what the fuck is going on?",
                "If there is a hell Andrew Wakefield will feel the pain of every single disease his bogus \"research\" caused"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Captain of Solong container ship involved in North Sea crash is Russian national, company says",
            "external_url": "https://news.sky.com/story/captain-of-solong-container-ship-involved-in-north-sea-crash-is-russian-national-company-says-13326888",
            "upvotes": 212,
            "date": "03/12/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-solong-container-ship_6853935.jpg?20250312092801",
            "top_comments": [
                "Russians and boats don’t seem to mix well.",
                "Figures, the question is how will they blame Ukraine.",
                "Of course he is!\n\nA ship crashes, at speed, into one that is anchored, clearly visible and carrying tonnes of aviation fuel. \n\nAll russian ships have a \"Ramming Speed\" setting apparently. Its right beside the \"Submarine\", setting and \"Cable cutting speed\" setting. \n\nI",
                "Damn at first glance I thought it said Captain Schlong which would have been way cooler",
                "Russia in WAR against Europe in 3 years... Why Europe hire russians... They distroy, have many under sea cabel!?...",
                "So now we ask ourselves, was this done on purpose by Russia?",
                "So you’re saying he did it on purpose because he’s Russian?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Arrested ship's captain is Russian national",
            "external_url": "https://www.bbc.co.uk/news/articles/c30mj5gq9d5o",
            "upvotes": 2158,
            "date": "03/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0a22/live/f3b246e0-ff23-11ef-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "So this will be the last we’ll hear of it then.",
                ">The Stena Immaculate was carrying 220,000 barrels of aviation fuel to be used by the US military.\n\nHoly crap. Is the US military going to respond to this?",
                "The only group of people trying to start WW3 are the Russians. Cutting communication lines across the region and now purposefully attacking other vessels.",
                "China does the same, ramming Philippine, Taiwan, Vietnam, Japan etc's ships with their fake fishing boats then pretending they were the ones attacked. Brace for similar allegations from Russia.\n\n[https://youtu.be/lv031K\\_lV4I?si=9T-KbHK6SxSAPAxp](https://youtu.be/lv031K_lV4I?si=9T-KbHK6SxSAPAxp)\n\n[https://youtu.be/JxhjHAFwcd4?si=9FxKO3Z6Mz2tVr2f](https://youtu.be/JxhjHAFwcd4?si=9FxKO3Z6Mz2tVr2f)",
                "In what world is this not considered an attack on a U.S. military vessel?",
                "So it was an intentional collision",
                "We need to be scuttling every Russian ship in Europe. Period. Everything gone.",
                "Unfortunately when Besiktas-M accidentally ran into the USS Harry S. Truman, it showed how easy it is to just ram a ship into a US asset. Just like 'accidentally' dragging anchors can cut underwater cables, I'm sure we're about to see a spike in 'accidental' ship collisions.",
                "Russians and boats don’t seem to mix well.",
                "“No no comrade, I refer to everywhere as motherland”"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US Military cancels climate change studies that Pentagon chief calls 'crap'",
            "external_url": "https://www.reuters.com/world/us/us-military-cancels-climate-change-studies-that-pentagon-chief-calls-crap-2025-03-10/",
            "upvotes": 3525,
            "date": "03/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It's fine, it's not like climate change ruins crop growth, which fluffs up food production, which elevates food prices, which causes civil unrest, which causes social-political collapse, which overthrows regimes.\nEG Syria.",
                "Pretty sure for 2 decades or so DoD has said climate change is one of our biggest threats.",
                "A Secretary of Defense that achieved a high rank in the military would have finished required studies and known how important this issue is towards geopolitics going forward.  Our country is run my idiots that think they know everything.",
                "Save 30 million, lose 100 billion. Math is mathing.\n\n\n\"In 2023, the United States experienced 28 separate weather or climate disasters that each resulted in at least $1 billion in damages. Damages from the 2023 disasters totaled $92.9 billion.\"",
                "Literally a DEI hire generic white dude lmao",
                "\"If you ignore the problem, it will just go away.\"\n\n- Alberto Einstein",
                "Most unqualified Sec of Defense in history.",
                "In the future, any Americans devastated due to climate change have full rights to pillage the homes of rich fucks who denied it.",
                "I'm sure he came to that conclusion based on a thorough review of the available literature, conference proceedings, analysis of the raw data, and discussion with academic experts who have spent decades studying the topic.",
                "Pentagon was studying climate change as one of the most apparent and urgent concerns for national security for years. Its going to strain resources, destabilize regions, cause mass refugee crisis's etc.\n\nBut sure. Lets turn a blind eye to it because fossil fuel propaganda.  Not like the people who covered up the dangers of mass lead poisoning ever lead us astray."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "West Texas measles outbreak spreads into Oklahoma",
            "external_url": "https://www.nbcnews.com/health/health-news/west-texas-measles-outbreak-spreads-oklahoma-rcna195858",
            "upvotes": 2801,
            "date": "03/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250311-measles-ch-1302-700353.jpg",
            "top_comments": [
                "Goddamn you, you goddamn idiots.",
                "Very sad and preventable. \n\nEven if you survive, you can still end up with scarring on your lungs and all sorts of other complications years down the line. ",
                "God sends another plague on Trump's America because Evangelicals didn't get the point the first time.",
                "Anti-vaxxers are all fucking idiots. I can tell you from experience that there is absolutely nothing you can say to get them to see sense. I have an aunt who is anti-vax, and she always says in the face of facts, \"agree to disagree.\" I'm not sure that they'd change their stance even if one of their kids died. \n\nIt's not fair for the kids, since they didn't exactly choose to be born to total morons. Although unfortunately, the apple doesn't always fall far from the tree. My aunt had two daughters, and my cousins are as vapid as their mother. One of my cousins also has two daughters, and they're also not vaccinated. I just hope that they grow up to be better than their mom and grandma. The whole family is just lucky that they've only encountered mild cases of measles, and they're super lucky that we've managed to eliminate more serious illnesses such as polio and smallpox before my cousins were even born. The former is still out there in the world. It may be unlikely for it to come back to the US, but it isn't impossible.",
                "Don't worry, brain worm boy has a crack solution.\n\nAnd yes that is 100% /s.",
                "This is not going away by itself now, even if you vaccinate like crazy",
                "Oklahoma??? You mean:\n\n- 44th in Education?\n- 49th in Healthcare?\n- 44th in Life Quality?\n- 50th in Test Scores?\n- top ten worst in poverty?\n\nThat Oklahoma? Boy, am I shocked!",
                "Scary time to be pregnant, thankfully my baby will be out soon. My dad was made deaf from his mom having measles while pregnant.",
                "Are there really this many unvaccinated people? I’m 40 and had all mine as a kid, they say the vaccine for measles is a life vaccine so what the fuck is going on?",
                "If there is a hell Andrew Wakefield will feel the pain of every single disease his bogus \"research\" caused"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Man lives for 100 days with artificial titanium heart in successful new trial",
            "external_url": "https://www.cnn.com/2025/03/12/health/australia-artificial-heart-100-days-intl-hnk/index.html",
            "upvotes": 326,
            "date": "03/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/bivacor-tiq-04-6.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "It says this is the first time someone was able to physically leave the hospital with an artificial heart, too.",
                "From the moment I understood the weakness of my flesh, it disgusted me. I craved the strength and certainty of steel. I aspired to the purity of the Blessed Machine. Your kind cling to your flesh, as though it will not decay and fail you. One day the crude biomass you call a temple will wither, and you will beg my kind to save you. But I am already saved, for the Machine is immortal… Even in death I serve the Omnissiah.",
                "They gave him a Picard",
                "W-w-what happened on day 101..?",
                "Getting closer to cyborgs being a reality.",
                "Looks like a steampunk grenade.",
                "You shoot me down, but I won't fall.",
                "My questions, as someone who knows nothing about these artificial hearts, or pacemakers:\n\nWhat does it feel like? Is it super heavy in the chest? What's holding it up when you stand, to stop it feeling like it's pulling on important infrastructure, and weighing you down? \nWhat does it sound like? Is there a clunking, due to the magnets? Would it lull you to sleep or keep you awake?\nHow is it regulated? Is it just a regular rhythm? If so, no exercise? Or can it speed up to provide oxygen in blood-pumping scenarios?\nIs it proprietary or will folks one day be able to have this titanium heart and not worry about software updates or company collapses, like people in the US have had with CPAP machines and insulin pumps?\n\nAny other questions folks have in regards to this? I bet there's a whole lot of stuff I haven't thought of.",
                "We got Man with a Titanium Heart before GTA 6.",
                "Cyberpunk here we come."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Australian man survives 100 days with artificial heart in world-first success | Health",
            "external_url": "https://www.theguardian.com/australia-news/2025/mar/12/australian-man-survives-100-days-with-artificial-heart-in-world-first-success",
            "upvotes": 286,
            "date": "03/12/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/e2e70943d8df3097e495aa6b2c3d644769d91afd/0_275_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c0280676084c98f7fca2f0647713f0b9",
            "top_comments": [
                "Until the repo man comes",
                "Is he still alive or did he die after exactly 100 days?",
                "This is actually incredibly awesome. Very impressed. ",
                "My ex has been doing it for 30 years…",
                "..I read that initially as, \"In first-world success\", and my aneurysm pulled a hammy.",
                "So he didn't pay for his subscription and they cut him off",
                "Does it have a normal pulse?  \nDoes it pump at the same speed whether he's sleeping or active, or does it have some way to adjust?\nHow is it powered?",
                "The longer I live the more the world is starting to look like the one in Robocop.",
                "That is one steam punk ass looking artificial heart there, i love it",
                "It looks like hector is running three Honda civics with spoon engines."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "Australia will not be imposing reciprocal tariffs on the US, says PM Anthony Albanese",
            "external_url": "https://www.sbs.com.au/news/article/australia-wont-be-exempt-from-us-tariffs-on-steel-and-aluminium-exports/oos69k7eq",
            "upvotes": 2231,
            "date": "03/12/2025",
            "thumbnail": "https://images.sbs.com.au/dims4/default/5703497/2147483647/strip/true/crop/4907x2760+0+0/resize/1280x720!/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2F64%2Fd0%2Fa2287b944dff82c452ee8dffe4d6%2F20241213183308566713-original.jpg",
            "top_comments": [
                "Watch out, that’s like an open invitation for annexation",
                "In 2024, the United States imported $16.7 billion worth of goods from Australia, with the top commodities being agricultural products, stone, glass, metals, and pearls, and chemicals, plastics, rubber, and leather goods. The U.S. has a trade surplus with Australia, meaning it exports more goods and services to Australia than it imports. \n\nThere are no incentives for Australians to add tariffs.",
                "Just ban Tesla sales for national security, or impose huge tariffs on them. Ooh and make a big show of banning Trump from visiting outside of official duties effective in 4 years (or do whatever you want, I'm just spit balling here)",
                "Probably because he knows it isn’t worth it. Australia isn’t like Canada, who can actually do some damage in a trade war with the U.S. Australia’s economy isn’t as interlinked with the U.S.",
                "When I googled \"what does Australia export to the usa\"\n\nAustralia's largest exports to the US are financial services, gold, sheep/goat meat, transportations services and vaccines. US direct investment in Australia is more than in any other country in the Indo-Pacific.\n\nI think Australia will be fine.",
                "Why have tariffs when you can just boycott American goods like the rest of us?",
                "I get it that Australia has to keep Trump happy because they’re hanging on to this sliver of hope that the US will protect them if China attacks. But as a Canadian I couldn’t be happier with how our government on all levels has responded, straight aggression, none of this appeasement shit.",
                "Boycott all US products.",
                "Careful Australia. Give Trump an inch and he takes it all.",
                "No need to reciprocate when you can get everything you need elsewhere."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Department of Education lays off nearly 50% of its workforce",
            "external_url": "https://abcnews.go.com/US/department-education-faces-50-layoffs-after-closure-notice/story?id=119690524&utm_source=flipboard&utm_content=user%2Fabc",
            "upvotes": 33338,
            "date": "03/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/63d5aa42-9003-48c5-b937-5f4e3fa8c88f/dept-education-1-epa-gmh-250311_1741707004175_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Woman who's never worked in education and enrolled her own kids in private schools has strong feelings on how little funding should go to programs helping special needs students.",
                "As a disabled person that benefited from DoE policy to get my high school and college diplomas I worry for the younger generation that will lose access.",
                "From the contacts I know at the Dept of Ed, the compliance department has been more or less decimated, and the ombudsman's office has also taken a massive hit if not completely destroyed as well. \n\nThese departments served as guide rails, keeping people on track and providing accountability. Things are going to get very very messy.\n\nDepts with firings: \n\n • National Center for Education Statistics\n\n • Institute of Education Sciences\n\n • Federal Student Aid\n\n • Office for Civil Rights\n\n • Office of Postsecondary Education \n\n • Office of General Counsel Ethics Division\n\nBoston, New York, Atlanta, Chicago, Cleveland, Dallas, San Francisco have been abolished.  The offices spared are Denver, Kansas City, Seattle and DC Metro. DOED Office for Civil Rights\n\nOver 1800 people gone. \n\nThis is gonna have a MASSIVE down stream impact on K-12, Hs, and college level Education, data, compliance, and special education programs. \n\nPeople aren't really aware of what this will do. It's like being on a plane 20000ft jn the air and ripping out random wires because you dont think you need them.",
                "Everything Trump is doing weakens America, and hurts Americans.",
                "This is the kind of thing that should set off alarm bells, but somehow it just feels like another day in the slow dismantling of public services. Cutting nearly half a department overnight, with barely a warning, is not streamlining, it is sabotage. Even if you believe the Department of Education is bloated, you do not fix a system by gutting it in a way that leaves staff terrified and scrambling. \n\nPeople do not work well under fear, and a government that rules through uncertainty is more interested in control than competence. The bigger question is what comes next. If this is just the warm-up act for dismantling the department altogether, what does that mean for the millions of students and families who rely on federal education programmes? Anyone cheering this move might want to ask themselves whether they trust their local politicians to handle education funding fairly and effectively because that is where this is headed.",
                "\"Six communications offices are going to be consolidated, they explained, and leases will end in major cities including San Francisco, New York, Cleveland, Boston, Chicago and Dallas.\"\n\nSeem a little targeted to anyone else?",
                "I hate how the worst possible news reports don't even get a sigh out of me anymore. Not that I'm accepting this as normal, but at this point my reaction to this headline is just 'of course it is'.",
                "Being in college right now is weird. Not a lot of political discussions allowed/welcome in the classrooms. Instead of organizing (maybe out of fear) everyone is in self preservation mode due to midterms. This news doesn’t make it easy to lock in on my own studying.",
                "2024 Election exit data polling shows the higher level of education someone achieves, the more likely they are to vote Democratic. Those without a college degree are most likely to vote Republican\n\n[Source](https://www.nbcnews.com/politics/2024-elections/exit-polls)\n\nIf you check this [source](https://en.wikipedia.org/wiki/List_of_U.S._states_and_territories_by_educational_attainment) and sort by states based on percent of people who have a bachelors or higher, the top 10 are blue states and the bottom ten are red states.\n\nTrump said \"I love the uneducated\" because they are his base. Attacks on education are purposeful.",
                "It's gonna take decades to repair the damage trump has done."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Musk launches appeal to restore $56 billion Tesla payday",
            "external_url": "https://www.reuters.com/business/autos-transportation/musk-launches-appeal-restore-56-billion-tesla-payday-2025-03-11/",
            "upvotes": 21392,
            "date": "03/11/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "> Musk has said that he wants a greater stake in Tesla or he might develop products outside of the company.   \n   \nAh yes, threatening your own company.",
                "\"I would like you to pay me 56 billion dollars while I am actively tanking the company's value\" is an interesting pitch ...",
                "They should ask him to name 5 things he did for the company last week.",
                "Hey guys I’m gonna need that money before I completely destroy the brand with my evil actions",
                ">When Elon Musk came to the White House asking me for help on all of his many subsidized projects, whether it's electric cars that don't drive long enough, driverless cars that crash, or rocket ships to nowhere, without which subsidies he'd be worthless and telling me how he was a big Trump fan and Republican, I could have said, 'drop to your knees and beg,' and he would have done it…\n\n[Donald Trump, Jul 12, 2022.](https://www.google.com/search?q=%22When%20Elon%20Musk%20came%20to%20the%20White%20House%20asking%20me%20for%20help%20on%20all%20of%20his%20many%20subsidized%20projects%2C%20whether%20it%27s%20electric%20cars%20that%20don%27t%20drive%20long%20enough%2C%20driverless%20cars%20that%20crash%2C%20or%20rocket%20ships%20to%20nowhere%2C%20without%20which%20subsidies%20he%27d%20be%20worthless%20and%20telling%20me%20how%20he%20was%20a%20big%20Trump%20fan%20and%20Republican%2C%20I%20could%20have%20said%2C%20%27drop%20to%20your%20knees%20and%20beg%2C%27%20and%20he%20would%20have%20done%20it%E2%80%A6%22%20-Donald%20Trump)",
                "Has he seen the stock price?",
                "He admitted that while running Doge, he is running his companies with \"great difficulty\"\n\nWhy would shareholders reward a CEO who is having \"great difficulty\" running their company?",
                "I highly doubt shareholders would support him now if they were to vote on it again. He's lost the shareholders billions.",
                "He should not buy a Tesla unless it’s in Canada and he buys two a minute",
                "Elon, do you little salute again, maybe that will fix things"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "US to immediately restore intelligence sharing and 'security assistance' to Ukraine",
            "external_url": "https://www.bbc.com/news/live/c51ypekv9xwt",
            "upvotes": 23682,
            "date": "03/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f1b2/live/63263dc0-ff28-11ef-b50e-9d086302645f.jpg",
            "top_comments": [
                ">Marco Rubio is asked if they are accepting any good-will gestures from Russia or if there is a deadline.\n\n\n>Rubio says \"Ukraine is ready to stop shooting and start talking.\"\n\n\n>He reiterates that he hopes Russia will say yes to the ceasefire, but if they say no \"then we'll unfortunately know what the impediment is to peace here\".\n\n\nIf you didn't already know that the impediment to peace is the guy who started the invasion............",
                "Forgot to add asterisk*, *with terms and conditions applied.*",
                "So he basically got hundreds of Ukrainians killed for nothing",
                "[removed]",
                "I don't believe it and any \"assistance\" will likely help Russia.",
                "I feel like Trump is running this country like a 13 yr old. He hates you today and likes you the next. Nobody signed up for this shitty roller coaster ride.",
                "I would not be trusting any US intel if I was Ukraine ",
                "So the deal with the Russians was that Trump would pause intelligence sharing to give them an advantage in Kursk? Well done, Trump!",
                "Oh, is he thankful enough now? Was his shirt nicer? Did X have hiccups for reasons other than Ukraine?\n\nWe’ll see in 3 days when the administration throws them under the bus again.",
                "American Intelligence is becoming something of an oxymoron under this administration"
            ],
            "aggregate_sentiment": 50.0
        }
    ],
    "last_updated": "03/12/2025 12:44:00 UTC"
}