{
    "posts": [
        {
            "category": "HOT",
            "title": "Newark mayor arrested by ICE agents at detention center",
            "external_url": "https://www.fox5ny.com/news/newark-mayor-arrested-ice-detention",
            "upvotes": 26478,
            "date": "05/09/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5ny.com/www.fox5ny.com/content/uploads/2025/05/1280/720/ssstwitter.com_1746820692383.00_00_52_27.still003.jpg?ve=1&tl=1",
            "top_comments": [
                "\"Witnesses said the arrest came after Baraka attempted to join a scheduled tour of the facility with three members of New Jersey’s congressional delegation, Reps. Robert Menendez, LaMonica McIver, and Bonnie Watson Coleman.\n\nWhen federal officials blocked his entry, a heated argument broke out, according to Viri Martinez, an activist with the New Jersey Alliance for Immigrant Justice. It continued even after Baraka returned to the public side of the gates.\n\n. . . \n\nIn video of the altercation shared with The Associated Press, a federal official in a jacket with the logo of the Homeland Security Investigations can be heard telling Baraka he could not join a tour of the facility because “you are not a congress member.”\n\nBaraka then left the secure area, rejoining protesters on the public side of the gate. Video showed him speaking through the gate to a man in a suit, who informed him: “They’re talking about coming back to arrest you.”\n\n“I’m not on their property, they can’t come out on the street and arrest me,” Baraka replied.\n\nMinutes later several ICE agents, some wearing face coverings, surrounded Baraka and others on the public side of the gate. As protesters cried out, “Shame,” Baraka was dragged back through the security gate in handcuffs.\"",
                "Wow surprising, they are all masked.",
                "Alina Habba is a fucking US ATTORNEY?\n\nI guess I shouldn’t be surprised…\nWhat a fucking joke\n\nDemocrats need to aggressively oppose this gestapo shit AND offer a lawful and humane immigration solution",
                "Something’s going to give in this country. All this is already happening and Trump has only been in power 100 days and some change. Can’t even imagine how much worse things are going to get.",
                "Gestapo doin Gestapo shit.",
                "It is not mistake. It is blatant racism. \n\n\"An ICE attorney in Dallas, James “Jim” Joseph Rodden, is under scrutiny following allegations that he operated a white supremacist account on X (formerly Twitter) under the handle u/GlomarResponder\".\n\n[https://www.texasobserver.org/ice-prosecutor-dallas-white-supremacist-x-account/](https://www.texasobserver.org/ice-prosecutor-dallas-white-supremacist-x-account/)",
                "ICE is a rogue paramilitary unit. Fuck ICE",
                "What I don't understand is how ICE was able to arrest him. If this is criminal trespass, and it is committed by a citizen, then local police had jurisdiction.",
                "Arresting judges and elected officials. Don't overreact. Totally normal....in places like Nazi Germany.",
                "This administration is disgusting"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "White House to take choice of Pentagon chief of staff out of Hegseth’s hands",
            "external_url": "https://www.theguardian.com/us-news/2025/may/09/white-house-pentagon-hegseth-chief-of-staff",
            "upvotes": 2409,
            "date": "05/09/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/36d91d35d67fb3bf70e2c1b7ca629548c2f3be24/370_0_3799_3039/master/3799.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=087849a5e2ae22a93e97daced29b4d6b",
            "top_comments": [
                "How about just take Pete Hegseth out of the Pentagon and DOD?",
                "Just fucking fire him if you clearly don’t trust him to do anything then.",
                "It’s almost like theyve lost confidence. ",
                "> “Ricky will not be getting the chief position,” one of the people directly familiar with deliberations said. “He doesn’t have adequate experience, lacks the political chops and is widely disliked by almost everyone in the White House who has been exposed to him.”\n\nAre we sure they didn't confuse this guy with Hegseth? 🤔",
                "Replaced an overly qualified Black man who they called DEI hire, with a wholly unqualified white man, that they can't trust to fully do his job. ",
                "Well, the leash is short.",
                "It’s not a bottle of liquor they’re taking from him so he’ll relinquish",
                "It’s almost as if they are taking the keys away from the drunk so they don’t kill someone on the road; he can still sit in the car and pass out, but he won’t be driving. Political castration by the White House.",
                "Spin the Bottle personnel management not turning out so great?",
                "Can't trust the judgement of a raging alcoholic? Weird"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "FedEx board member Steiner is picked to be next USPS postmaster general amid talk of privatization",
            "external_url": "https://apnews.com/article/usps-postmaster-general-steiner-privatization-b88684227b01c71f6674f9569ca8adc6",
            "upvotes": 1993,
            "date": "05/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ahh, I remember the good old days when admins at least pretended to care about 'conflict of interest'.",
                "Almost every business in the US relies on USPS this would be an unmitigated disaster. Trumps rural base would also get screwed which would be a silver lining.",
                "USPS is constitutionally mandated. We would need a constitutional amendment to privatize it.\n\nFirst Class mail will be $5, though. And It won't go to every address in the U.S. in a short amount of time.",
                "In a few years a Democratic president will say it's not possible to get rid of this person.",
                "Let’s pick someone from the shittiest, most unreliable courier service in America to be the next postmaster. That makes sense.",
                "They are going to privatize it. Once Dejoy was in it was just a matter of time.",
                "#SAVE the USPS\n\nUSPS is one of America’s oldest institutions. Benjamin Franklin was the first Postmaster.",
                "Every Trump agency head pick is an intentional act to destroy the agency they're heading.",
                "FedEx is the absolute worst of the shipping companies. Really bottom of the barrel in every way.",
                "Between this, selling off national parks, shutting down other public institutions for private gain... We're going to look like the oligarchy in Russia after the fall of the USSR.\n\nIt's going to take decades to repair, if we even can fix it at all."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US grants asylum to 54 white Afrikaner South Africans, reports say",
            "external_url": "https://www.theguardian.com/world/2025/may/09/us-grants-asylum-to-54-white-afrikaner-south-africans",
            "upvotes": 9437,
            "date": "05/09/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1d1c99da998b4f59038b80221c689beeec347fd1/938_14_4562_3651/master/4562.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=835b1fe072a557dab0a80aef9adaec52",
            "top_comments": [
                ">On Thursday, US officials were trying to arrange a charter flight to land at Dulles international airport, with commercial flights being assessed as an alternative, NPR reported, citing unnamed sources.\n\n>The Department of Health and Human Services will help the South Africans with “housing … basic home furnishings, essential household items … groceries, weather-appropriate clothing, diapers, formula, hygiene products and prepaid phones,” according to a memo seen by the New York Times.\n\nI just don't know where to begin. They may, in fact, face discrimination. Maybe even violence. And that's terrible. But rolling out the red carpet for these people while Donald Trump, all by himself, cancelled 100,000 asylum claims is beyond the pale.",
                "I thought they hated giving free handouts to migrants. If what the NY Times found is true then what's all this:\n\n>The Department of Health and Human Services will help the South Africans with “housing … basic home furnishings, essential household items … groceries, weather-appropriate clothing, diapers, formula, hygiene products and prepaid phones,” according to a memo seen by the New York Times.\n\nThe fucking hypocrisy.",
                "💯  Elon Musk and Peter Thiel,  fucking nazis",
                "I didn't think we needed more obvious evidence that this country has been hijacked by white supremacists but here we are.",
                "Meanwhile We abandoned Afghans, many of whom assisted the US military, who are literally IN HIDING?\n\nhttps://apnews.com/article/afghanistan-refugees-qatar-trump-immigration-refugee-ban-006240c5700fa7a95e4c2f2dcf66ad4f\n\n\nQuestion- How many Afrikaner/White South Africans immigrate to the US per year normally? \n\nThis reminds me of the case of the German family who applied for US asylum because they homeschooled and that is/was illegal in Germany.\n\nBTW- It usually takes years of waiting and vetting to be granted asylum. This. is. a. joke.",
                "It was never about legal versus illegal immigration.\n\nIt has always been about racism.",
                "So let me get this straight, when it's POC looking for asylum in America its bad. But when it's white people, its good? And not to mention all the free shit their getting as well? Hypocrisy of the highest order.",
                "This administration is a joke. These white people were handed asylum and are getting \"government handouts\" like housing. Yet POC who lived in \"shithole\" countries who were already in the process of being granted citizenship are sent to a concentration camp in El Salvador. Pathetic",
                "Literally can’t make this shit up 💀\n\n-asylum seekers from Mexico: NOO 😡 NOT CITIZENSS😠🤬GET OUT😤\n\n-white asylum seekers from South Africa: oh no! 😥 my sweet poor babies 😩 let me welcome you with open arms 🤗",
                "grants asylum, gives them a fat stack of cash, subsidizes their rent, provides them free college/vocational training....\n\nyour tax dollars at work.... for elon"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US Judge halts Trump regime's secretive deportation scheme to war-torn Libya",
            "external_url": "https://foreignpost.news/p/us-judge-halts-trump-regimes-secretive",
            "upvotes": 2559,
            "date": "05/09/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd209ae36-1e1f-4d23-912a-b9de5dd27c79_1262x841.jpeg",
            "top_comments": [
                "The term is rendition, not deportation. Unless they are deporting Libyans.",
                "Get rid of Trump or it will only get worse.\n\nHe doesnt care about law so it wont stop him or make him rethink. Trump either does it anyway or remove the obstacle that was in his way by using fascist methods and then does it anyway.\n\nTrump is in his 4th month, 2 years(midterms) of this will cause irreparable damage to everything in the USA.\n\nEveryday with him in office is a day closer for civil war being the only way to get rid of Trump, family and friends.",
                "How long until they do it anyway",
                "I'm sure in the near future Trump will reach an agreement with Putin to send American prisoners to Siberia. I'm sure party affiliation will determine if you qualify.",
                "\"Trump regime\" finally we see news outlets say it out loud. Now we need US major outlets to do the same. There's nothing \"administration\" about fascism.",
                "Incorrect headline, they didn’t stop anything, probably just issued a piece of paper that they usually expect to be followed that should stop this plan, but won’t.",
                "> Immigration attorneys moved swiftly on Wednesday to block the effort, filing an emergency request in federal court. “Multiple credible sources report that flights are preparing to immediately depart the United States carrying class members for removal to Libya,” they wrote in a court filing.\n\nThey are trying to do the El Salvador thing all over again because not a single person has been held in contempt for that shit.",
                "OMG time to arrest Trump",
                "Like that matters. The administration is ignoring the unanimous orders from the supreme court and you think they will listen to this? The Supreme Court needs to reverse their decision giving Trump immunity. They can revisit it at any time and they didn't follow the rule of law when they gave Trump immunity so you shouldn't have any issue fixing it.",
                "Libya would be stupid to accept our prisoners. The UN is big mad about the El Salvador kidnapping, they are threatening to cut off all aide unless the men are released. The UN will 100% cut off Libya from aide. My prediction is that the men sent to CECOT will be released to a neighboring country who is also a member of the ICC for due process."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "The U.S. has 1,001 measles cases and 11 states with active outbreaks",
            "external_url": "https://www.nbcnews.com/health/kids-health/us-1001-measles-cases-11-states-outbreaks-virus-spreading-rcna205948",
            "upvotes": 1337,
            "date": "05/09/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250226-measles-mb-1442-44b90a.jpg",
            "top_comments": [
                "One thousand cases. In 2025. This should not be happening.",
                "Number of cases in US by Year:  \n2020 = 13  \n2021 = 49  \n2022 = 121  \n2023 = 59  \n2024 = 285  \n2025 as of Today = 1,001\n\nHmm... One of these things aren't like the others.",
                "Make measles great again! Well done you bunch of friggin clowns.",
                "Texas should be sued for this",
                "Man, if only we could find a way to prevent this from happening…",
                "If only science had come up with a way to protect people and limit the spread of diseases.",
                "You know if there are 1000 cases the number is 10x or 100x that. \n\nI know 5 people myself who had Measels but weren’t reported to the state.",
                "Natural suppression of republican voters.",
                "I’d put money on it being underreported.",
                "More active measles cases than trans people playing sports."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Radar screens at Newark airport went black again overnight",
            "external_url": "https://abcnews.go.com/US/radar-screens-newark-airport-black-overnight/story?id=121638395",
            "upvotes": 3114,
            "date": "05/09/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/87c6775c-47c9-4a16-b499-2c93dab9fdaf/newark-gty-jef-250509_1746799790340_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "at this point, I'm waiting to wake up to the headline of a massive tragedy happening at the airport. seems like things are getting dire if there is pressure getting pushed to get this fixed; as it should be. I hope someone get's their head out of their ass and gets this prioritized a week ago.",
                "Statistics say its probably ok, but I still just changed my upcoming flight so I don't have to connect through Newark.",
                "> Transportation Secretary Sean Duffy said he hopes to have the system built in the next three to four years.\n  \nThat's the timeframe for fixing this problem?",
                "Huh, I remember the last president wanting to spend billions on reinvesting on FAA infrastructure. It even got bipartisan support... Odd they can't just use the money that is already promised to help with this",
                "Republicans have blocked funding for this for 20 years.",
                "I'm flying out of Newark twice in the next two weeks. Can't wait to roll the dice with my life lol.",
                "\n\nThe Daily had a good episode on this a few days ago. Boils down to latency and lack of backup when their systems do go down and how easy it is for someone to just unplug these systems with no oversight. These systems are also old and need to be upgraded. Newark ATC employees were based in Long Island but FAA moved them to Philadelphia but kept the transmissions still going through Long Island and relaying to Philadelphia",
                "Time to blame the previous administration for requesting **more** staff and modernization updates to prevent this happening.  Clearly that's the issue, not firing air traffic controllers and staff that keeps things running.",
                "Just a preview of the problems we can expect when you take a wrecking ball to government with minimal to no planning. Who cares about infrastructure when you can have tax cuts.",
                "Natural result of deferring upkeep of infrastructure maintenance in the chase of budget cuts.  Expect more of this as long as the conservative/libertarian ideology is making decisions.\n\nFifty years of the destructive meme that government needs to get out of the way of free enterprise.  You trust that your planes will fly, food & drugs will be safe, etc because of the regulatory state."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Cargo thieves are attacking the U.S. supply chain at alarming rates",
            "external_url": "https://www.cnbc.com/2025/05/09/cargo-thieves-attack-supply-chain.html",
            "upvotes": 3040,
            "date": "05/09/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108136177-1745508829713-Theft_Video_Overhaul.jpg?v=1745932246&w=1920&h=1080",
            "top_comments": [
                "Every day we inch closer to the cyberpunk universe... which sounds cool except that genre is a screaming thrashing industrial noised warning about a dystopian nightmare ruled by outrageously wealthy psychopaths.\n\n.. but at least we should get some good music out of it.",
                "With the tariff taxes will come smuggling and the increase of organized crime. Border patrol agents will get rich looking the other way as trucks roll across the boarders in remote locations.  However Trump will figure out how to get his cut as well.",
                "We’re going Mad Max way quicker than I thought.",
                "Did anyone check with Dom Toretto and his crew? They might be trying to steal VCRs, DVD players and camcorders again.",
                "with the direction tariffs are sending these prices, it will soon be the only way to get anything.",
                "When poverty increases, so does crime. Mass firings in the government. Huge layoffs in the private sector as businesses brace for the impacts of tariffs.",
                "With much of the law enforcement emphasis on immigrants and frankly targeting just regular people, I feel like these types of crimes are only going to increase.",
                "I recall there being a huge uptick in stories like this the last time the supply chain got fucked up during the peak of the pandemic. Seems like cargo thieves are a force that should be planned for in economic models. Like maybe anytime there's a spike in either prices or how much inventory is sitting in the port, cargo thieves jump in.",
                "Didn’t know it was a Comley truck. ",
                "Hahahahahahahahahahaha they created a black market for normal shit. This timeline is so ridiculous 🤣"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Two men found guilty of cutting down famous Sycamore Gap tree.",
            "external_url": "https://news.sky.com/story/two-men-found-guilty-of-cutting-down-famous-sycamore-gap-tree-13363450",
            "upvotes": 9555,
            "date": "05/09/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-sycamore-gap-tree-daniel-graham_6910985.jpg?20250509121507",
            "top_comments": [
                "I live on the other side of the planet and this really piss me off. I always wanted to go see Hadrians wall and this a stop I’ll make.",
                "Wanton destruction for destructions' sake. They cut a tree down *because* it was iconic, no other reason. Just to break a thing that people enjoyed. Purely selfish.",
                "After reading the online reactions the two men were sending each other texts saying their critics \"didnt have the minerals\" to do what they did. They cut down a tree in the middle of nowhere at night and these pair of cunts think they pulled off a heist in a Guy Ritchie movie.",
                "What absolute morons, ruining their lives for no reason at all. Enjoy the loss of your business, income, and any reputation you may have had. Plus possibly prison. Idiots.",
                "Drove thirty miles through a storm just to make the world a little uglier.\n\nYou fuckers, my faith in humanity is already on fumes",
                "They deserve to go to jail for this.",
                "Daniel Graham, 39, and Adam Carruthers, 32\n\nFucking useless pieces of shit. It’s not even like it was a few dumb teens. Throw away the key, these people are fucked",
                "Grown men doing something like that,, pathetic. They should have to pay for their destruction for the rest of their lives.",
                "I saw the tree three weeks before it was cut down. Glad I got to see it before this happened. Waited my whole life to see it.",
                ">Carruthers, a mechanic living in a caravan in Kirkbride, said he was not at the site of the crime. His barrister, Andrew Gurney, said it made no sense for a man to be “gallivanting around the national park cutting down Sycamore Gap” just five days after his partner had left hospital with their newborn baby.\n\nCorrect. It, in fact, does not *make sense* for this guy with two rocks rattling around in his skull to be out doing this crime leaving his partner home with a newborn.\n\nHowever, it \"not making sense\" doesn't show that he was innocent, but the true shit-tier value of his character."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Israel continues to blockade entry of all food, aid and other goods as hunger, sickness and crime are out of control in Gaza",
            "external_url": "https://www.wsj.com/world/middle-east/hunger-sickness-and-crime-stalk-gaza-under-israels-blockade-9382124f?mod=hp_lead_pos7",
            "upvotes": 1100,
            "date": "05/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "When the WSJ is begging for human rights you know it’s beyond serious. ",
                "Lot of people have been trying to call this what it is since the start, only to be censored. In this very sub.\n\nThis is sickening. Israel is indeed committing genocide.",
                "Are we allowed to criticize this yet without threat of deportation?",
                "Oh boy, seems like they are purposefully creating a situation where crime and extremism are guaranteed to happen, sure hope they don’t later exploit that as an excuse for military action. \n\nThat would be crazy and completely unpredictable and unprecedented. I’m sure the majority of the western world will remember and care in 3-24 months and not just blindly blame Palestinians and think they deserve to be bombed and removed from their homes.",
                "Actions speak louder than words, and any god who might exist can only look upon such actions with sadness and disappointment. There is no noble way to laugh at the suffering of innocent children, it's time for people to take a hard look at themselves and what they are supporting. War crimes are being committed daily and innocent lives being ruined and tortured for what? Any god that asks for such action in their name, is not a god but a devil, so why does man think it just to kill in their name? Just because you recite holy words while you kill someone does not absolve you from the sin, it is nothing more than a mockery to the divine entity you claim to be serving.",
                "Netanyahu knows that once he is out of office he’s going to face corruption charges. He’s trying to keep the country in a state of emergency as long as he can.",
                "Create a Ghetto  then  starve its inhabitants - I wonder what Reich they got that idea from?",
                "The Israeli government is doing an exemplary job of implementing the same Nazi methodologies that were used on the Jewish people, and actually making them somehow even more cruel than the Nazis at the same time.",
                "It’s very interesting to me that supporters of Israel’s operation in Gaza seemingly can’t see the parallels between this and the worst thing that’s ever happened to their people",
                "What type of sheer arrogance and evil could allow your human heart to commit such atrocities and suffering on people? Not only that and feel good about it. How do they sleep at night?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Indian forces kill terrorist whose hijacking led to release of Jewish jlist. Daniel Pearl murderer",
            "external_url": "https://www.jpost.com/breaking-news/article-853233",
            "upvotes": 0,
            "date": "05/09/2025",
            "thumbnail": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/6178",
            "top_comments": [
                "Lot of early 2000s war on terror vibes there.",
                "so now \"jlist\" is journalist?  Yuck.",
                "Hope his family can find some comfort in knowing that the murderers who killed their son were brought to justice and neutralised.\n\nJust wanted to piggy back of this and point out that in February, several Hamas officials attended a parade in Pakistan Occupied Kashmir (PoK) hosted by Pakistani terror groups Lashkar-e-Taiba and Jaish-e-Mohammad (the terror group that killed Daniel Pearl) called the “Kashmir Solidarity and Hamas Operation ‘Al-Aqsa Flood’ Conference”. All of this happened under the watchful eye of the Pakistani government. \n\nHamas leaders get VIP welcome in PoK, Jaish terrorists hold bike rally for Palestinian terror group\n\nThe enemies of US, Israel and India are more connected and have more in common than people realise."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "India Pakistan War LIVE Updates: India intercepts 6 ballistic missiles fired by Pakistan, launches counter-strike, says report",
            "external_url": "https://www.cnbctv18.com/india/india-pakistan-war-live-updates-india-attacks-pakistan-islamabad-lahore-karachi-peshawar-sialkot-punjab-amritsar-blackout-missile-attack-liveblog-19601834.htm",
            "upvotes": 0,
            "date": "05/09/2025",
            "thumbnail": "https://images.cnbctv18.com/uploads/2025/05/india-pakistan-flags-ai-generated-image-2-2025-05-b78777d015841525fa70abfbbbe2298b.jpg",
            "top_comments": [
                "\"CNBC TV18\" is not a reliable source and should not be conflated with CNBC.\n\nStuff is happening but right now the amount of purported attacks vastly outweighs the number of actual attacks. Wait for details from more mainstream news networks like Reuters.",
                "I just read [a Reuters article](https://www.reuters.com/world/asia-pacific/pakistan-armys-spokesman-claims-india-fired-ballistic-missiles-that-fell-into-2025-05-09/) reporting that the _other side_ was claiming india fired BMs lol....\n\nEdit: made sure to double check that the article is from within past 24 hours. Didn't the initial military involvement start with india firing their own BMs into pakistan a few days ago? Given that, as well as how most of the comments in this post are from people seeking from india, all within 30 mins of this being posted (making it seem coordinated), I think I'm going to wait on independent verification.",
                "Both are nuclear powers too. YIKES!",
                "i can vouch for 1 interception in my city sirsa",
                "I have said before saying it again the excuse that a country has terrorists in it as a justification for attacking the entire country or people is so done, it's becoming the go excuse for attacking people you didn't like to start with.",
                "Is someone going to blink? Or, is this the first nuclear exchange?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Two men convicted for the illegal removal of the beloved Sycamore Gap tree.",
            "external_url": "https://apnews.com/article/britain-sycamore-gap-tree-trial-517a911bc158fc04b1013ea8dcb79a29",
            "upvotes": 74,
            "date": "05/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">>The prime piece of evidence was a grainy video on Graham’s phone of the crime being committed on the dark and stormy night.\n\nI'm so glad criminals are dumb enough to document their crimes"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Pakistan's military says three air bases attacked by Indian missiles",
            "external_url": "https://www.channelnewsasia.com/asia/pakistan-says-air-bases-attacked-indian-missiles-5120956",
            "upvotes": 81,
            "date": "05/09/2025",
            "thumbnail": "https://dam.mediacorp.sg/image/upload/s--2xiQOpKz--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2023-11:afp_watermark_14112023,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2025/05/10/000_46324ke.jpg?itok=lcvAHp8-",
            "top_comments": [
                "*Pakistan has warned that it will \"not de-escalate\" a spiralling conflict with India, and blamed New Delhi for bringing the two nuclear-armed neighbours closer to a full-blown war, with the death toll from days of violence crossing 50.*\n\nNo one wants to hear the word \"spiral.\"  Let's hope the back channels (talk) are alive and kicking right now.",
                "The fact that the American media is basically ignoring a conflict that could turn nuclear is, quite honestly, insane.",
                "This was bound to happen in a country that breeds terro**sts. \n\nIndia has been taking hits since 6 decades now and someday it had to happen. \n\nHope this brings some sense in the minds of Pakistani government and act like a normal nation.\n\nIndian army brief in 30 mins so will get to know more details.",
                "initiated by pakistan , they aimed delhi their missile got intercepted, in response india launch missile which they fail to intercept"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "White House to take choice of Pentagon chief of staff out of Hegseth’s hands",
            "external_url": "https://www.theguardian.com/us-news/2025/may/09/white-house-pentagon-hegseth-chief-of-staff",
            "upvotes": 2394,
            "date": "05/09/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/36d91d35d67fb3bf70e2c1b7ca629548c2f3be24/370_0_3799_3039/master/3799.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=087849a5e2ae22a93e97daced29b4d6b",
            "top_comments": [
                "How about just take Pete Hegseth out of the Pentagon and DOD?",
                "Just fucking fire him if you clearly don’t trust him to do anything then.",
                "It’s almost like theyve lost confidence. ",
                "> “Ricky will not be getting the chief position,” one of the people directly familiar with deliberations said. “He doesn’t have adequate experience, lacks the political chops and is widely disliked by almost everyone in the White House who has been exposed to him.”\n\nAre we sure they didn't confuse this guy with Hegseth? 🤔",
                "Replaced an overly qualified Black man who they called DEI hire, with a wholly unqualified white man, that they can't trust to fully do his job. ",
                "Well, the leash is short.",
                "It’s not a bottle of liquor they’re taking from him so he’ll relinquish",
                "It’s almost as if they are taking the keys away from the drunk so they don’t kill someone on the road; he can still sit in the car and pass out, but he won’t be driving. Political castration by the White House.",
                "Spin the Bottle personnel management not turning out so great?",
                "Can't trust the judgement of a raging alcoholic? Weird"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Madeleine McCann suspect faces new unrelated charge",
            "external_url": "https://www.bbc.com/news/articles/c071err0079o",
            "upvotes": 34,
            "date": "05/09/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/639a/live/bce3a900-2cd8-11f0-8969-55735830a270.jpg",
            "top_comments": [
                "Does anyone think he actually did it? Or is he being used as a scapegoat in an internationally polarizing case? \n\nGenuine question, I’m not being sarcastic. I’m actually curious as to what people think.",
                "Insulting guards?  They take self esteem very seriously it would seem.",
                "I still have yet an explanation as to why the McCanns were shying away from the second beach sighting....never heard a good explanation.",
                "No charges against him after all this time, and trying to extend his sentence for insulting a guard? Go ahead, make me side with the sex offender, do it.",
                "> Madeleine McCann\n\nWow. That's a name I haven't heard in a long time."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "The U.S. has 1,001 measles cases and 11 states with active outbreaks",
            "external_url": "https://www.nbcnews.com/health/kids-health/us-1001-measles-cases-11-states-outbreaks-virus-spreading-rcna205948",
            "upvotes": 1336,
            "date": "05/09/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250226-measles-mb-1442-44b90a.jpg",
            "top_comments": [
                "One thousand cases. In 2025. This should not be happening.",
                "Number of cases in US by Year:  \n2020 = 13  \n2021 = 49  \n2022 = 121  \n2023 = 59  \n2024 = 285  \n2025 as of Today = 1,001\n\nHmm... One of these things aren't like the others.",
                "Make measles great again! Well done you bunch of friggin clowns.",
                "Texas should be sued for this",
                "Man, if only we could find a way to prevent this from happening…",
                "If only science had come up with a way to protect people and limit the spread of diseases.",
                "You know if there are 1000 cases the number is 10x or 100x that. \n\nI know 5 people myself who had Measels but weren’t reported to the state.",
                "Natural suppression of republican voters.",
                "I’d put money on it being underreported.",
                "More active measles cases than trans people playing sports."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "FedEx board member Steiner is picked to be next USPS postmaster general amid talk of privatization",
            "external_url": "https://apnews.com/article/usps-postmaster-general-steiner-privatization-b88684227b01c71f6674f9569ca8adc6",
            "upvotes": 1994,
            "date": "05/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ahh, I remember the good old days when admins at least pretended to care about 'conflict of interest'.",
                "Almost every business in the US relies on USPS this would be an unmitigated disaster. Trumps rural base would also get screwed which would be a silver lining.",
                "USPS is constitutionally mandated. We would need a constitutional amendment to privatize it.\n\nFirst Class mail will be $5, though. And It won't go to every address in the U.S. in a short amount of time.",
                "In a few years a Democratic president will say it's not possible to get rid of this person.",
                "Let’s pick someone from the shittiest, most unreliable courier service in America to be the next postmaster. That makes sense.",
                "They are going to privatize it. Once Dejoy was in it was just a matter of time.",
                "#SAVE the USPS\n\nUSPS is one of America’s oldest institutions. Benjamin Franklin was the first Postmaster.",
                "Every Trump agency head pick is an intentional act to destroy the agency they're heading.",
                "FedEx is the absolute worst of the shipping companies. Really bottom of the barrel in every way.",
                "Between this, selling off national parks, shutting down other public institutions for private gain... We're going to look like the oligarchy in Russia after the fall of the USSR.\n\nIt's going to take decades to repair, if we even can fix it at all."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Holocaust survivor Margot Friedländer dies at 103",
            "external_url": "https://www.dw.com/en/holocaust-survivor-margot-friedl%C3%A4nder-dies-at-103/a-72496380",
            "upvotes": 524,
            "date": "05/09/2025",
            "thumbnail": "https://static.dw.com/image/72496843_6.jpg",
            "top_comments": [
                "May her memory be a blessing.",
                "'Everybody knew about it, and they looked away'",
                "Another voice is silent. Let's not forget what she had to say.",
                "\"Friedländer died in Berlin, the same day she was expected to receive the German Order of Merit\".\n\nwild.",
                "Just in time to avoid seeing the US commit a new one.",
                "Yes and you’re doing exactly what I was complaining about, which is distracting from this women’s death and focusing on Palenstine. Did the article didn’t mention about Palenstine? No. Did the article mention anything about Israel? No. It’s about a European Jewish who survived the holocaust and died at 103. You’re the one going off about Palestine and getting triggered.",
                "“There is no Christian blood, there is no Muslim blood, there is no Jewish blood, there is only human blood.”",
                "guess she is not surviving any longer"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Israel continues to blockade entry of all food, aid and other goods as hunger, sickness and crime are out of control in Gaza",
            "external_url": "https://www.wsj.com/world/middle-east/hunger-sickness-and-crime-stalk-gaza-under-israels-blockade-9382124f?mod=hp_lead_pos7",
            "upvotes": 1102,
            "date": "05/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "When the WSJ is begging for human rights you know it’s beyond serious. ",
                "Lot of people have been trying to call this what it is since the start, only to be censored. In this very sub.\n\nThis is sickening. Israel is indeed committing genocide.",
                "Are we allowed to criticize this yet without threat of deportation?",
                "Oh boy, seems like they are purposefully creating a situation where crime and extremism are guaranteed to happen, sure hope they don’t later exploit that as an excuse for military action. \n\nThat would be crazy and completely unpredictable and unprecedented. I’m sure the majority of the western world will remember and care in 3-24 months and not just blindly blame Palestinians and think they deserve to be bombed and removed from their homes.",
                "Actions speak louder than words, and any god who might exist can only look upon such actions with sadness and disappointment. There is no noble way to laugh at the suffering of innocent children, it's time for people to take a hard look at themselves and what they are supporting. War crimes are being committed daily and innocent lives being ruined and tortured for what? Any god that asks for such action in their name, is not a god but a devil, so why does man think it just to kill in their name? Just because you recite holy words while you kill someone does not absolve you from the sin, it is nothing more than a mockery to the divine entity you claim to be serving.",
                "Netanyahu knows that once he is out of office he’s going to face corruption charges. He’s trying to keep the country in a state of emergency as long as he can.",
                "Create a Ghetto  then  starve its inhabitants - I wonder what Reich they got that idea from?",
                "The Israeli government is doing an exemplary job of implementing the same Nazi methodologies that were used on the Jewish people, and actually making them somehow even more cruel than the Nazis at the same time.",
                "It’s very interesting to me that supporters of Israel’s operation in Gaza seemingly can’t see the parallels between this and the worst thing that’s ever happened to their people",
                "What type of sheer arrogance and evil could allow your human heart to commit such atrocities and suffering on people? Not only that and feel good about it. How do they sleep at night?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "The U.S. has 1,001 measles cases and 11 states with active outbreaks",
            "external_url": "https://www.nbcnews.com/health/kids-health/us-1001-measles-cases-11-states-outbreaks-virus-spreading-rcna205948",
            "upvotes": 1335,
            "date": "05/09/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250226-measles-mb-1442-44b90a.jpg",
            "top_comments": [
                "One thousand cases. In 2025. This should not be happening.",
                "Number of cases in US by Year:  \n2020 = 13  \n2021 = 49  \n2022 = 121  \n2023 = 59  \n2024 = 285  \n2025 as of Today = 1,001\n\nHmm... One of these things aren't like the others.",
                "Make measles great again! Well done you bunch of friggin clowns.",
                "Texas should be sued for this",
                "Man, if only we could find a way to prevent this from happening…",
                "If only science had come up with a way to protect people and limit the spread of diseases.",
                "You know if there are 1000 cases the number is 10x or 100x that. \n\nI know 5 people myself who had Measels but weren’t reported to the state.",
                "Natural suppression of republican voters.",
                "I’d put money on it being underreported.",
                "More active measles cases than trans people playing sports."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "White House to take choice of Pentagon chief of staff out of Hegseth’s hands",
            "external_url": "https://www.theguardian.com/us-news/2025/may/09/white-house-pentagon-hegseth-chief-of-staff",
            "upvotes": 2408,
            "date": "05/09/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/36d91d35d67fb3bf70e2c1b7ca629548c2f3be24/370_0_3799_3039/master/3799.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=087849a5e2ae22a93e97daced29b4d6b",
            "top_comments": [
                "How about just take Pete Hegseth out of the Pentagon and DOD?",
                "Just fucking fire him if you clearly don’t trust him to do anything then.",
                "It’s almost like theyve lost confidence. ",
                "> “Ricky will not be getting the chief position,” one of the people directly familiar with deliberations said. “He doesn’t have adequate experience, lacks the political chops and is widely disliked by almost everyone in the White House who has been exposed to him.”\n\nAre we sure they didn't confuse this guy with Hegseth? 🤔",
                "Replaced an overly qualified Black man who they called DEI hire, with a wholly unqualified white man, that they can't trust to fully do his job. ",
                "Well, the leash is short.",
                "It’s not a bottle of liquor they’re taking from him so he’ll relinquish",
                "It’s almost as if they are taking the keys away from the drunk so they don’t kill someone on the road; he can still sit in the car and pass out, but he won’t be driving. Political castration by the White House.",
                "Spin the Bottle personnel management not turning out so great?",
                "Can't trust the judgement of a raging alcoholic? Weird"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US Judge halts Trump regime's secretive deportation scheme to war-torn Libya",
            "external_url": "https://foreignpost.news/p/us-judge-halts-trump-regimes-secretive",
            "upvotes": 2560,
            "date": "05/09/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd209ae36-1e1f-4d23-912a-b9de5dd27c79_1262x841.jpeg",
            "top_comments": [
                "The term is rendition, not deportation. Unless they are deporting Libyans.",
                "Get rid of Trump or it will only get worse.\n\nHe doesnt care about law so it wont stop him or make him rethink. Trump either does it anyway or remove the obstacle that was in his way by using fascist methods and then does it anyway.\n\nTrump is in his 4th month, 2 years(midterms) of this will cause irreparable damage to everything in the USA.\n\nEveryday with him in office is a day closer for civil war being the only way to get rid of Trump, family and friends.",
                "How long until they do it anyway",
                "I'm sure in the near future Trump will reach an agreement with Putin to send American prisoners to Siberia. I'm sure party affiliation will determine if you qualify.",
                "\"Trump regime\" finally we see news outlets say it out loud. Now we need US major outlets to do the same. There's nothing \"administration\" about fascism.",
                "Incorrect headline, they didn’t stop anything, probably just issued a piece of paper that they usually expect to be followed that should stop this plan, but won’t.",
                "> Immigration attorneys moved swiftly on Wednesday to block the effort, filing an emergency request in federal court. “Multiple credible sources report that flights are preparing to immediately depart the United States carrying class members for removal to Libya,” they wrote in a court filing.\n\nThey are trying to do the El Salvador thing all over again because not a single person has been held in contempt for that shit.",
                "OMG time to arrest Trump",
                "Like that matters. The administration is ignoring the unanimous orders from the supreme court and you think they will listen to this? The Supreme Court needs to reverse their decision giving Trump immunity. They can revisit it at any time and they didn't follow the rule of law when they gave Trump immunity so you shouldn't have any issue fixing it.",
                "Libya would be stupid to accept our prisoners. The UN is big mad about the El Salvador kidnapping, they are threatening to cut off all aide unless the men are released. The UN will 100% cut off Libya from aide. My prediction is that the men sent to CECOT will be released to a neighboring country who is also a member of the ICC for due process."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Holocaust survivor Margot Friedländer dies at 103",
            "external_url": "https://www.dw.com/en/holocaust-survivor-margot-friedl%C3%A4nder-dies-at-103/a-72496380",
            "upvotes": 523,
            "date": "05/09/2025",
            "thumbnail": "https://static.dw.com/image/72496843_6.jpg",
            "top_comments": [
                "May her memory be a blessing.",
                "'Everybody knew about it, and they looked away'",
                "Another voice is silent. Let's not forget what she had to say.",
                "\"Friedländer died in Berlin, the same day she was expected to receive the German Order of Merit\".\n\nwild.",
                "Just in time to avoid seeing the US commit a new one.",
                "Yes and you’re doing exactly what I was complaining about, which is distracting from this women’s death and focusing on Palenstine. Did the article didn’t mention about Palenstine? No. Did the article mention anything about Israel? No. It’s about a European Jewish who survived the holocaust and died at 103. You’re the one going off about Palestine and getting triggered.",
                "“There is no Christian blood, there is no Muslim blood, there is no Jewish blood, there is only human blood.”",
                "guess she is not surviving any longer"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Israel continues to blockade entry of all food, aid and other goods as hunger, sickness and crime are out of control in Gaza",
            "external_url": "https://www.wsj.com/world/middle-east/hunger-sickness-and-crime-stalk-gaza-under-israels-blockade-9382124f?mod=hp_lead_pos7",
            "upvotes": 1101,
            "date": "05/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "When the WSJ is begging for human rights you know it’s beyond serious. ",
                "Lot of people have been trying to call this what it is since the start, only to be censored. In this very sub.\n\nThis is sickening. Israel is indeed committing genocide.",
                "Are we allowed to criticize this yet without threat of deportation?",
                "Oh boy, seems like they are purposefully creating a situation where crime and extremism are guaranteed to happen, sure hope they don’t later exploit that as an excuse for military action. \n\nThat would be crazy and completely unpredictable and unprecedented. I’m sure the majority of the western world will remember and care in 3-24 months and not just blindly blame Palestinians and think they deserve to be bombed and removed from their homes.",
                "Actions speak louder than words, and any god who might exist can only look upon such actions with sadness and disappointment. There is no noble way to laugh at the suffering of innocent children, it's time for people to take a hard look at themselves and what they are supporting. War crimes are being committed daily and innocent lives being ruined and tortured for what? Any god that asks for such action in their name, is not a god but a devil, so why does man think it just to kill in their name? Just because you recite holy words while you kill someone does not absolve you from the sin, it is nothing more than a mockery to the divine entity you claim to be serving.",
                "Netanyahu knows that once he is out of office he’s going to face corruption charges. He’s trying to keep the country in a state of emergency as long as he can.",
                "Create a Ghetto  then  starve its inhabitants - I wonder what Reich they got that idea from?",
                "The Israeli government is doing an exemplary job of implementing the same Nazi methodologies that were used on the Jewish people, and actually making them somehow even more cruel than the Nazis at the same time.",
                "It’s very interesting to me that supporters of Israel’s operation in Gaza seemingly can’t see the parallels between this and the worst thing that’s ever happened to their people",
                "What type of sheer arrogance and evil could allow your human heart to commit such atrocities and suffering on people? Not only that and feel good about it. How do they sleep at night?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "FedEx board member Steiner is picked to be next USPS postmaster general amid talk of privatization",
            "external_url": "https://apnews.com/article/usps-postmaster-general-steiner-privatization-b88684227b01c71f6674f9569ca8adc6",
            "upvotes": 1993,
            "date": "05/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ahh, I remember the good old days when admins at least pretended to care about 'conflict of interest'.",
                "Almost every business in the US relies on USPS this would be an unmitigated disaster. Trumps rural base would also get screwed which would be a silver lining.",
                "USPS is constitutionally mandated. We would need a constitutional amendment to privatize it.\n\nFirst Class mail will be $5, though. And It won't go to every address in the U.S. in a short amount of time.",
                "In a few years a Democratic president will say it's not possible to get rid of this person.",
                "Let’s pick someone from the shittiest, most unreliable courier service in America to be the next postmaster. That makes sense.",
                "They are going to privatize it. Once Dejoy was in it was just a matter of time.",
                "#SAVE the USPS\n\nUSPS is one of America’s oldest institutions. Benjamin Franklin was the first Postmaster.",
                "Every Trump agency head pick is an intentional act to destroy the agency they're heading.",
                "FedEx is the absolute worst of the shipping companies. Really bottom of the barrel in every way.",
                "Between this, selling off national parks, shutting down other public institutions for private gain... We're going to look like the oligarchy in Russia after the fall of the USSR.\n\nIt's going to take decades to repair, if we even can fix it at all."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Tufts student Rümeysa Öztürk ordered freed from immigration detention",
            "external_url": "https://www.npr.org/2025/05/09/nx-s1-5393055/tufts-student-rumeysa-ozturk-ordered-freed-from-immigration-detention",
            "upvotes": 490,
            "date": "05/09/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1625x915+0+124/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4d%2F69%2F6d72d63f4e4b80765e9fde5d4ce1%2Fap25085809320001.jpg",
            "top_comments": [
                "More good news. Even if you are against these students causes, you should be against those unlawful attempts at intimidation If you value your right of free speech.",
                "She spent the past 45 days in an overcrowded and filthy jail because she wrote a critical op-ed, which is a first amendment right, even for non-citizens.\n\nTrump has never spent a single day in jail for his lifetime of serious crimes, and yet he constantly whines about being persecuted.",
                "What will compel the Trump administration to comply with these orders? They are not following the court decisions in other cases. Trump voters ensured he doesn't have to face consequences so why would he now? This administration is criminal and the only government body (aka Congress) meant to regulate illegal actions in the executive branch actions is complicit in the crimes. ",
                ">Make us.\n\n\\-Official White House response to court order, 2025"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Newark mayor arrested by ICE agents at detention center",
            "external_url": "https://www.fox5ny.com/news/newark-mayor-arrested-ice-detention",
            "upvotes": 26456,
            "date": "05/09/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5ny.com/www.fox5ny.com/content/uploads/2025/05/1280/720/ssstwitter.com_1746820692383.00_00_52_27.still003.jpg?ve=1&tl=1",
            "top_comments": [
                "\"Witnesses said the arrest came after Baraka attempted to join a scheduled tour of the facility with three members of New Jersey’s congressional delegation, Reps. Robert Menendez, LaMonica McIver, and Bonnie Watson Coleman.\n\nWhen federal officials blocked his entry, a heated argument broke out, according to Viri Martinez, an activist with the New Jersey Alliance for Immigrant Justice. It continued even after Baraka returned to the public side of the gates.\n\n. . . \n\nIn video of the altercation shared with The Associated Press, a federal official in a jacket with the logo of the Homeland Security Investigations can be heard telling Baraka he could not join a tour of the facility because “you are not a congress member.”\n\nBaraka then left the secure area, rejoining protesters on the public side of the gate. Video showed him speaking through the gate to a man in a suit, who informed him: “They’re talking about coming back to arrest you.”\n\n“I’m not on their property, they can’t come out on the street and arrest me,” Baraka replied.\n\nMinutes later several ICE agents, some wearing face coverings, surrounded Baraka and others on the public side of the gate. As protesters cried out, “Shame,” Baraka was dragged back through the security gate in handcuffs.\"",
                "Wow surprising, they are all masked.",
                "Alina Habba is a fucking US ATTORNEY?\n\nI guess I shouldn’t be surprised…\nWhat a fucking joke\n\nDemocrats need to aggressively oppose this gestapo shit AND offer a lawful and humane immigration solution",
                "Something’s going to give in this country. All this is already happening and Trump has only been in power 100 days and some change. Can’t even imagine how much worse things are going to get.",
                "Gestapo doin Gestapo shit.",
                "It is not mistake. It is blatant racism. \n\n\"An ICE attorney in Dallas, James “Jim” Joseph Rodden, is under scrutiny following allegations that he operated a white supremacist account on X (formerly Twitter) under the handle u/GlomarResponder\".\n\n[https://www.texasobserver.org/ice-prosecutor-dallas-white-supremacist-x-account/](https://www.texasobserver.org/ice-prosecutor-dallas-white-supremacist-x-account/)",
                "ICE is a rogue paramilitary unit. Fuck ICE",
                "What I don't understand is how ICE was able to arrest him. If this is criminal trespass, and it is committed by a citizen, then local police had jurisdiction.",
                "Arresting judges and elected officials. Don't overreact. Totally normal....in places like Nazi Germany.",
                "This administration is disgusting"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US admits its new aid plan would initially only feed 60% of Gaza, as UN rejects proposal | CNN",
            "external_url": "https://www.cnn.com/2025/05/09/middleeast/us-gaza-aid-plan-un-rejection-intl",
            "upvotes": 861,
            "date": "05/09/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/04-gettyimages-2209255040.JPG?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So it's better to reject the plan all together and feed 0% of Gaza? Forgive me if I fail to see the logic in this.",
                "That’s 60% more than I expected this government to feed",
                "I agree US Gaza is better than Hamas Gaza",
                "It’s crazy that this was rejected because of US wariness and the stigma that they’ll fail to feed the proposed percentage, so what?? Even if it was just 1% it’s still better than nothing! Why does the US have to constantly be the one feeding the world’s needy?!!? The US can’t even feed its own people at home in the first place. \n\nI don’t usually comment on this news feed but as someone that grew up in a food insecure house where for the first 5 years of my life I was fed solid food once every 3 days at most I say shame on anyone for denying this through. \n\nIm sure there’s more to it and experts at higher levels know what they’re doing, god I hope so cause they sure failed me, but this makes me so angry I can hardly type let alone think.",
                "Since when was it our job to feed 100% of Gaza?",
                "Where the hell is the pro Palestine movement? If Biden or Kamala were in office, this would be a big deal and it would be their fault. Pro Palestine literally does nothing to oppose Trump's plans to harm Palestinians. ",
                "How is this the US responsibility to begin with? There are plenty of other countries in the world, especially in the region, to step up to the task.",
                "well its a start, how fkn hard is it",
                "Better starve them to death? How low can UN go.",
                "Why should the US have to feed Israel's mess?  Let Israel feed them, or don't and let the world see what they really are--monsters."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Founder of crypto lender Celsius sentenced to 12 years in prison",
            "external_url": "https://www.cnn.com/2025/05/09/business/founder-crypto-celsius-network-prison-sentence-intl",
            "upvotes": 976,
            "date": "05/09/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213431760.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The crypto space is just filled with conmen and criminals.",
                "Here comes the pardon.",
                "I think we found the new head of the Federal Reserve",
                "Lots of money and no regulation.\n\nBased on the history of humankind, what do people think is going to happen? And why do they think \"crypto\" will be any different?",
                "Trump will pardon this dude within 3 months once they reach a \"deal\".",
                "Trump: “Another criminal! I will appoint him head honcho at my new crypto bro agency. I need to get this Kleptocracy off the ground”",
                "I hear that the Fahrenheit guy is in hiding.",
                "Feels like every facet of life is filled with cons and scalpers I hate this shit",
                "Trump will be bought for a small paltry amount of one million dollars. No such thing as hard on white collar crime in this administration",
                "This is 2025, he'll donate $1M to dolls-for-Donny and magically catch a pardon, along with 1-2 all-caps tweets about how he was persecuted for being maga."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/10/2025 00:41:13 UTC"
}