{
    "posts": [
        {
            "category": "HOT",
            "title": "Tesla investor calls for Elon Musk to step down as boss | Money News",
            "external_url": "https://news.sky.com/story/tesla-investor-calls-for-elon-musk-to-step-down-as-boss-13331499",
            "upvotes": 79480,
            "date": "03/18/2025",
            "thumbnail": "https://e3.365dm.com/25/02/1600x900/skynews-washington-elon-musk_6827946.jpg?20250213175145",
            "top_comments": [
                "Love this for him. He just broke the Guinness world record for losing the most amount of money in a certain amount of time.",
                "I mean, he *IS* tanking the brand. And he's not doing his job, since he has his fancy new \"government role\".\n\n\nI'm not sure he was ever doing anything to begin with, but now he is actively wrecking Tesla.\n\n\nETA: If you zoom in to this picture, he looks like MODOK.",
                "The crazy part is that Musk is “running” the company remotely.  Also known as telework or remote work.  Musk said remote/telework is immoral.",
                "Stepping down won't matter.  As long as he's the controlling owner of Tesla, people will associate him with the company.",
                "[deleted]",
                "He has to step down from the government 1st.",
                "That brand is dead to me no matter what they do.",
                "If the ceo of a company loses 800 BILLION market value, why on earth would you want to keep that guy around? ",
                "He needs to rot in a cell the rest of his life.",
                "The fact they waited this long proves they're cowards. He fucked their stock for 3 months and only now they're calling for him to fuck off? I hope he stays until it hits 10 dollars a share so these spineless cronies lose as much as possible.\n\nPathetic"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "ICE ‘disappeared’ 48 New Mexico residents, civil rights lawyers say",
            "external_url": "https://www.independent.co.uk/news/world/americas/us-politics/new-mexico-ice-arrests-aclu-complaint-b2717442.html",
            "upvotes": 19440,
            "date": "03/18/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/18/17/46/Immigration-Appointments-toos8eqy.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "TLDR, they have been deprived of Habeus Corpus, even the lawyers who oversight these ICE facilities in question have no proof they are even still alive, in the country, where they are being imprisoned, nothing. Not even their fucking names. They haven't seen them, they don't know what their condition is. These are flagrant abuses of universal human rights. They could also be US Citizens. \n\nThe New Mexico ICE field office is located at 5441 Watson Drive South East Albuquerque, NM 87106 their public number is (505) 452-4700. Do they have the consent of the governed?   \n\n               ",
                "Kidnapped. Time to start saying it as it is. The United States Government is kidnapping citizens.",
                "People are gonna have to start keeping a copy of their birth certificate on them at all times. Get pulled over.. open up a live video on social media immediately.",
                "This is the test everyone says they would have passed during world war 2, turning over humans do be disappeared or to hide and assist them at the risk of imprisonment yourself, we are gonna see the true moral character of those around us in the next few years",
                "A long but good quote from Aleksandr Solzhenitsyn's The Gulag Archipelago: \n\n\n\"And how we burned in the camps later, thinking: What would things have been like if every Security operative, when he went out at night to make an arrest, had been uncertain whether he would return alive and had to say good-bye to his family? \n\n\nOr if, during periods of mass arrests, as for example in Leningrad, when they arrested a quarter of the entire city, people had not simply sat there in their lairs, paling with terror at every bang of the downstairs door and at every step on the staircase, but had understood they had nothing left to lose and had boldly set up in the downstairs hall an ambush of half a dozen people with axes, hammers, pokers, or whatever else was at hand?...\n\n\n The Organs would very quickly have suffered a shortage of officers and transport and, notwithstanding all of Stalin's thirst, the cursed machine would have ground to a halt! If...if...We didn't love freedom enough. And even more – we had no awareness of the real situation.... We purely and simply deserved everything that happened afterward\"",
                "Only a matter of time before US citizens start \"disappearing\" as well. This administration has shown that it does not care about what the law or courts say, so there is no one to stop them from doing this.",
                "[removed]",
                "Did people forget we still have kids who we lost their parents for the last go around with Trump?",
                "We look at the gestabo and KGB and think to ourselves “how could they allow such evils?”",
                "We'll only discover the bodies after it's all over, just like every other fascist nightmare"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Social Security Administration to require in-person identity checks for new and existing recipients",
            "external_url": "https://apnews.com/article/social-security-fraud-waste-doge-elon-musk-212e3089951f731fd3f83443e104b315?utm_source=copy&utm_medium=share",
            "upvotes": 5824,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The waiting room is going to look like it did Beetlejuice.",
                "Now is the time to establish an identity on MySSA\n\nEveryone who has ever worked in the US should do that. You should be checking on your SSA earnings regularly long before you retire. Especially to make sure your employer is paying into it.\n\nEdit: it also detects identity theft of your SSN. If someone is using your SSN the contributions will show up.\n\nEdit2: the website is only open during their business hours.",
                "Didn’t they just close a bunch of SS offices?",
                "Ahh yes the old and disabled population, known for their high mobility and driving skills.\n\nFuck this country.",
                "Wow.\n\n  \nIt is already a hassle enough if you're in a decent sized metro area. Now imagine being in rural Nebraska and having to go identify in person at the SSA office...",
                "Fucking over the core GOP constituency. That’s a bold strategy. Let’s see how it plays out for them.",
                "What are they gonna do for survivor beneficiaries? Have an 8 year old drag their parent’s body across the floor?",
                "So they want a person who might be hospitalized to go to the social security administration to get their checks.  \n\nHe is like:  since they won’t let me end social security, I will make it impossible for people to get their checks.",
                "I waited on a call for 3 hours the other day to be told I had to go to the social security office in person and present some info to get an update, when I went to the office I was told I had to have an appointment and to call the same number I had the other day and there was no walk in appointments.. tried calling and they weren’t letting people sit on hold and to just call back later.. so I got no appointment.. this is going to be a shit show",
                "WAKE UP.  while they cant slash the money going to your pockets directly yet, they are intentionally making things inaccessible and difficult for the people. Imagine the elders that have no internet, no reliable transportation, rely on physical mail. This is inhumane, almost like they wanna cull the people receiving entitled benefits. Except this is death by a thousand cuts. Sickening."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Teslas set on fire with Molotov cocktails and shot with gun in Las Vegas attack",
            "external_url": "https://www.nbcnews.com/news/us-news/teslas-set-fire-molotov-cocktails-shot-las-vegas-attack-rcna196942",
            "upvotes": 16605,
            "date": "03/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250319-teslas-las-vegas-mn-0730-457429.jpg",
            "top_comments": [
                "These attacks aren't just happening in Vegas; they also seem to be taking place in other states. There was some incident in Kansas City where a Tesla dealership's CyberTrucks were lit up in a fire. Man it's getting crazy out there",
                "Imagine traveling back in time 6-8 years and telling someone that in 2025 there would be a group going around destroying EVs, and then trying to convince them it’s the left doing it lol",
                "It's getting kinda \"torch and pitchfork\" out there, huh?",
                "I read the Tesla vehicles are all paid actors.",
                "The stock tanking is a bigger statement IMO and I hope it goes down to pennies.",
                "[removed]",
                "EV fires are such a dangerous fire.  I feel bad for the first responders.",
                "its just locker room arson.",
                "[removed]",
                "Ellon hasn't even said \"thank you\" once"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Ben & Jerry's claims Unilever ousted its boss over political activism",
            "external_url": "https://www.bbc.com/news/articles/ckg8pk9rpx4o",
            "upvotes": 860,
            "date": "03/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d7be/live/d33cbd20-0485-11f0-9776-23d43d9c7fe7.jpg",
            "top_comments": [
                "Back in the 80s, Ben & Jerry’s had a corporate 5 - 1 plan.  The highest paid employee (including CEO) could make no more than 5 times the salary of the lowest paid employee.",
                "Buy an activism by design brand then fire the activists. Sounds about right.",
                "Did they really think selling their brand to a corporation would end any other way?",
                "Sell out to corporate and then wonder why you’re not allowed to act anti-corporate anymore. It’s elementary dear Watson",
                "Be like Canada and buy Chapman's.",
                "Well the company members had a majority vote to sell itself to a multinational corp, what the hell did they think was gonna happen?",
                "The Americone Dream is over.",
                "It doesn’t look like this has gone through yet according to the article. Guess we will see what the independent board decides.",
                "Not going to lie. This boycott is going to hurt.",
                "Perhaps they should have considered not selling out to a giant soulless multinational corporation"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Federal judge rules DOGE's USAID dismantling likely violates the Constitution, blocking Musk from further cuts",
            "external_url": "https://apnews.com/article/usaid-federal-judge-trump-administration-bdc919a5d98eda5ab72a32fdfe2f147d?utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Facebook&fbclid=IwZXh0bgNhZW0CMTEAAR08wP9OXojQ8pN3mFLz88gnMNYOpMliinDgxBeBLcFPFRiCqZNXskWI2J0_aem_wTezhuydfNr_XXXvgwA5Aw",
            "upvotes": 11778,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "the most doge thing for DOGE to do is to eliminate itself",
                "Cool, now that they've made this ruling over and over, how about enforcing it?",
                "The problem is the administration doesn't think it should be held accountable by our checks and balances. You know, the ones the Founding Fathers considered a pillar of our Constitution.",
                ">\"I don't care what the judges think\"\n\n-MAGA, when judges rule against their interests.",
                "Outstanding. Now please enforce it tomorrow when they inevitably do something else unconstitutional.",
                "Shame that won't stop them in any way, they've stated the courts have no authority.",
                "Why do they need to couch the language with \"likely\"? Just cite where in the Constitution was violated. Boom.",
                "\"Blocking\" Musk from doing something he *never* had the authority or legal right to do in the first place isn't going to do anything. This is a start though. Start issuing warrants.",
                "If this ruling has judicial weight, why doesn’t it unravel everything that muskrat has done in terminating federal employees? If it was unconstitutionalfor USAID, then surely it is unconstitutional for NASA, NOAA, FDA, and more.",
                "What happened to do something illegal and go to prison?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Minnesota state Sen. Eichorn arrested on suspicion of soliciting a minor",
            "external_url": "https://www.mprnews.org/story/2025/03/18/state-senator-eichorn-arrested-suspicion-of-soliciting-a-minor",
            "upvotes": 20136,
            "date": "03/18/2025",
            "thumbnail": "https://img.apmcdn.org/efc0a6706dfa0131eda07e7a2398a16d17f2a111/widescreen/e36356-eichorn-arrest-2000.jpg",
            "top_comments": [
                "Wasn't this scumbag one of the guys trying to push legislation in Minnesota to make hating Trump a mental illness?",
                "They didn't state the party in the title because you already know it.",
                "Ya know. \n\n\nRepublicans constantly going on about pedophiles and protecting the children is really starting to seem like some severe projection. \n\n\nEdit: notable typo.",
                "I guess he had Trump Depravity Syndrome.",
                "Title correction: \"**Republican** Minnesota state Sen. Eichorn...\"",
                "[deleted]",
                "I'll save you all a click.  Yes it was a republican",
                "Party of family values, it just might be your child",
                "What a surprise!  He's a Republican.",
                "The GOP - Grand Old Pedophile party."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Canadian actor detained at US border in ‘inhumane conditions’ for nearly two weeks | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/18/canadian-actor-jasmine-mooney-detained-mexico-border",
            "upvotes": 4126,
            "date": "03/18/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4ae288c52a7a1cd5ef59fe67e17fa069035a1233/0_185_950_569/master/950.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=53d6335812338a4954a34b46c1979ff0",
            "top_comments": [
                "Why dont they just send these people home immediately. What is the point of holding them hostage?",
                "You would have to be crazy to come to the US these days.\n\n“Eagles told the Vancouver Sun that instead of sending her daughter to Canada or advising her to fix her application, US Customs and Border Protection officers arrested her.”",
                "*... she was transferred to the San Luis detention center in Arizona,” Eagles said.   “They are housed together in a single concrete cell with no natural light, fluorescent lights that are never turned off, no mats, no blankets, and limited bathroom facilities.” Every time Mooney was transferred, she was handcuffed and in chains...*\n\nOf all the detention centers Mooney, this AZ one in San Luis had to be the worse.",
                "I think this is the 3rd foreign national that was arrested and nearly “disappeared” instead of just denying entry.",
                "I wonder how long it will take before countries start updating their travel advisories for the US",
                "Fox News used to run like weeklong specials about random white chicks that disappear.\n\nNow they're in the administration disappearing them.",
                "Somewhat amazing how quickly ICE went full fascist then again Bush filled the nascent agency with white nationalists and 20 years on those are all the supervisors, managers, and senior level people.",
                "I can hardly wait for the first time Dipshit Donnie tries to enter Canada and is instantly arrested and put in prison as a convicted felon trying to gain unlawful entry into Canada.",
                "What happened to you USA? You used to be cool. Now you like the \"Bumlord\". You're bringing everybody down, man. Stems and seeds, bother.",
                "\"felt like escaping a deeply disturbing psychological experiment\"\n\nWelcome to Trump's \"New Golden Age for America\""
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "U.S. could lose democracy status, says global watchdog",
            "external_url": "https://www.cbc.ca/news/world/trump-democracy-report-1.7486317",
            "upvotes": 4425,
            "date": "03/18/2025",
            "thumbnail": "https://i.cbc.ca/1.7486323.1742279379!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_1180/usa-trump-justice.JPG?im=Resize%3D620",
            "top_comments": [
                "At least the libs are at last owned.",
                "In before conservatives with \"iTs A rEpUbLiC nOt A dEmOcRaCy!\"",
                "Constitutional crisis. What’s next? Martial Law?",
                "As long as we’re well fed and entertained, people would let a monarchy slowly re-emerge. ",
                "I think it said \"could\" instead of \"should\"",
                "It's honestly laughable we are seen as a legitimate democracy at this point.",
                "They're eating the votes, eating the laws",
                "I wonder what the American founding fathers will think if you have transported them to now. I have a feeling that if they are seeing this from the other side, they must be rolling in their graves.",
                "People need to stop putting the kiddie gloves on when it comes to this country and goverment. Call it what it is. It's not a democracy and it hasn't been since Jan 6th when they tried to overthrow the goverment and the heads of that movement faced no consequences.",
                "Abe Lincoln didn't die for this shit"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Turkey detains Erdogan's main rival on array of charges",
            "external_url": "https://www.reuters.com/world/middle-east/turkish-authorities-order-detention-istanbul-mayor-some-100-others-2025-03-19/",
            "upvotes": 389,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It is really sad to see so many countries across the world sink into the depths of authoritarianism and dictatorship. These are truly dark times.",
                "This will soon happen in the US if we're not proactive...let it be a valuable lesson",
                "I am sure the same will happen in the states.",
                "Erdogan detains Erdogan's main rival\n\nFtfy",
                "Classic dictator move. Any potential rival who is too popular suddenly gets into legal trouble.",
                "Coming soon to America, sadly.",
                "I'm grateful for them to behave openly like that, otherwise some people might be under the illusion Turkey should enter the EU, despite them being not European, openly aggressive to Greece... Without the location they would never ever be part of NATO tbw.",
                "I'm Turkish and this is the deep point of unlawfulness. There is no law anymore. He really wants to turn the country into Russia or North Korea, in which only he could be the one and only leader, until he's dead.\n\nMind you, this mayor is indeed Erdogan's strongest rival and won Istanbul elections 3 times. Don't underestimate the amount of people in Turkey who are against Erdogan.",
                "Watch closely America. This is gonna be your future if you don’t do anything against it"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Zelenskyy says Putin’s vow not to hit Ukraine's energy infrastructure 'at odds with reality'",
            "external_url": "https://apnews.com/article/ukraine-russia-war-ceasefire-talks-drones-65c00a0afd130731e0e0c054ac528b44",
            "upvotes": 162,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "And nobody is surprised. Well besides Trump probably because Putin “would not disrespect him” or whatever reason he can think of.",
                "Anything that comes out of Putin’s mouth is inconsistent with reality.",
                "Putin needs to be charged for war crimes and invading another country …..",
                "Funny considering there's another post about ukrainian strike on russian oil plant"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Hollywood director Carl Erik Rinsch charged with defrauding Netflix out of $11 million",
            "external_url": "https://www.cbsnews.com/news/netflix-fraud-charges-carl-erik-rinsch/",
            "upvotes": 83,
            "date": "03/19/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/18/3245de75-577f-40d9-a141-ffee6cf17fe9/thumbnail/1200x630/83d8aafda39da35c6132ecc39d4aa57f/gettyimages-489721890.jpg?v=765ef194a4bf4701e45ec9d5712af42f",
            "top_comments": [
                "> From there, Rinsch spent about $10 million on personal expenses and luxury items in a spending spree that, according to prosecutors, included about $1.8 million on credit card bills; **$1 million on lawyers to sue Netflix for more money;** $3.7 million on furniture and antiques; $2.4 million for five Rolls-Royces and one Ferrari; and $652,000 on watches and clothes.   \n   \n   \nNow that’s audacious.",
                "> A Hollywood writer-director was arrested Tuesday on charges that he swindled $11 million from Netflix for a sci-fi show that never aired, instead steering the cash toward cryptocurrency investments and a series of lavish purchases that included a fleet of Rolls-Royces and a Ferrari.\n\n> Carl Erik Rinsch, perhaps best known for directing the film \"47 Ronin,\" has been charged with wire fraud and money laundering over what federal prosecutors allege was a scheme to defraud the streaming giant. [...]\n\n> Prosecutors said Netflix had initially paid about $44 million to purchase an unfinished show called \"White Horse\" from Rinsch, but eventually doled out another $11 million after he said he needed the additional cash to complete the show.\n\n> Rather than using the extra money to wrap up production, Rinsch quietly transferred the money to a personal brokerage account, where he made a series of failed investments that lost about half of the $11 million in two months, according to prosecutors.\n\nMakes massive investments with other people's money, loses money. Gambles in crypto, makes some profit, proceeds to buy luxury goods instead of paying his debts.\n\nThis man would be welcome on r/wallstreetbets.",
                ">A Hollywood writer-director was arrested Tuesday on charges that he swindled $11 million from Netflix for a sci-fi show that never aired, instead steering the cash toward cryptocurrency investments and a series of lavish purchases that included a fleet of Rolls-Royces and a Ferrari.\n\nA fleet? Who needs a fleet of Rolls-Royces?",
                "Bizarre \n\nHe was making millions legitimately.\n\nNow he’ll never work again and will be financially ruined.\n\nNetflix are clearly vulnerable to fraud and will want to make an example. Civil suits to follow!",
                "He was just using some good old-fashioned Hollywood accounting.",
                "Hulu has acquired the rights to his story and will be releasing a limited series next year",
                "Never trust a guy with a ponytail.\n\n  \n*puts hair under a cap*",
                "This guy’s Wikipedia page is a trip.",
                "This is straight up mental illness.",
                "To be fair netflix had been defrauding it's viewers with the most season 1 then cancel original shows out of all the streaming services"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Turkish cenbank sells record amount of FX after lira plunges, bankers say",
            "external_url": "https://www.reuters.com/markets/currencies/turkish-cenbank-sells-record-amount-fx-after-lira-plunges-bankers-say-2025-03-19/",
            "upvotes": 13,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Ben & Jerry's claims Unilever ousted its boss over political activism",
            "external_url": "https://www.bbc.com/news/articles/ckg8pk9rpx4o",
            "upvotes": 852,
            "date": "03/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d7be/live/d33cbd20-0485-11f0-9776-23d43d9c7fe7.jpg",
            "top_comments": [
                "Back in the 80s, Ben & Jerry’s had a corporate 5 - 1 plan.  The highest paid employee (including CEO) could make no more than 5 times the salary of the lowest paid employee.",
                "Buy an activism by design brand then fire the activists. Sounds about right.",
                "Did they really think selling their brand to a corporation would end any other way?",
                "Sell out to corporate and then wonder why you’re not allowed to act anti-corporate anymore. It’s elementary dear Watson",
                "Be like Canada and buy Chapman's.",
                "Well the company members had a majority vote to sell itself to a multinational corp, what the hell did they think was gonna happen?",
                "The Americone Dream is over.",
                "It doesn’t look like this has gone through yet according to the article. Guess we will see what the independent board decides.",
                "Not going to lie. This boycott is going to hurt.",
                "Perhaps they should have considered not selling out to a giant soulless multinational corporation"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Turkey detains Erdogan's main rival on array of charges",
            "external_url": "https://www.reuters.com/world/middle-east/turkish-authorities-order-detention-istanbul-mayor-some-100-others-2025-03-19/",
            "upvotes": 391,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It is really sad to see so many countries across the world sink into the depths of authoritarianism and dictatorship. These are truly dark times.",
                "This will soon happen in the US if we're not proactive...let it be a valuable lesson",
                "I am sure the same will happen in the states.",
                "Erdogan detains Erdogan's main rival\n\nFtfy",
                "Classic dictator move. Any potential rival who is too popular suddenly gets into legal trouble.",
                "Coming soon to America, sadly.",
                "I'm grateful for them to behave openly like that, otherwise some people might be under the illusion Turkey should enter the EU, despite them being not European, openly aggressive to Greece... Without the location they would never ever be part of NATO tbw.",
                "I'm Turkish and this is the deep point of unlawfulness. There is no law anymore. He really wants to turn the country into Russia or North Korea, in which only he could be the one and only leader, until he's dead.\n\nMind you, this mayor is indeed Erdogan's strongest rival and won Istanbul elections 3 times. Don't underestimate the amount of people in Turkey who are against Erdogan.",
                "Watch closely America. This is gonna be your future if you don’t do anything against it"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Social Security Administration to require in-person identity checks for new and existing recipients",
            "external_url": "https://apnews.com/article/social-security-fraud-waste-doge-elon-musk-212e3089951f731fd3f83443e104b315?utm_source=copy&utm_medium=share",
            "upvotes": 5824,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The waiting room is going to look like it did Beetlejuice.",
                "Now is the time to establish an identity on MySSA\n\nEveryone who has ever worked in the US should do that. You should be checking on your SSA earnings regularly long before you retire. Especially to make sure your employer is paying into it.\n\nEdit: it also detects identity theft of your SSN. If someone is using your SSN the contributions will show up.\n\nEdit2: the website is only open during their business hours.",
                "Didn’t they just close a bunch of SS offices?",
                "Ahh yes the old and disabled population, known for their high mobility and driving skills.\n\nFuck this country.",
                "Wow.\n\n  \nIt is already a hassle enough if you're in a decent sized metro area. Now imagine being in rural Nebraska and having to go identify in person at the SSA office...",
                "Fucking over the core GOP constituency. That’s a bold strategy. Let’s see how it plays out for them.",
                "What are they gonna do for survivor beneficiaries? Have an 8 year old drag their parent’s body across the floor?",
                "So they want a person who might be hospitalized to go to the social security administration to get their checks.  \n\nHe is like:  since they won’t let me end social security, I will make it impossible for people to get their checks.",
                "I waited on a call for 3 hours the other day to be told I had to go to the social security office in person and present some info to get an update, when I went to the office I was told I had to have an appointment and to call the same number I had the other day and there was no walk in appointments.. tried calling and they weren’t letting people sit on hold and to just call back later.. so I got no appointment.. this is going to be a shit show",
                "WAKE UP.  while they cant slash the money going to your pockets directly yet, they are intentionally making things inaccessible and difficult for the people. Imagine the elders that have no internet, no reliable transportation, rely on physical mail. This is inhumane, almost like they wanna cull the people receiving entitled benefits. Except this is death by a thousand cuts. Sickening."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Death row inmate in Louisiana becomes fifth person in US to be executed using nitrogen gas",
            "external_url": "https://news.sky.com/story/death-row-inmate-in-louisiana-becomes-fifth-person-in-us-to-be-executed-using-nitrogen-gas-13331675",
            "upvotes": 1143,
            "date": "03/19/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-louisiana-jessie-hoffman_6860148.jpg?20250318074423",
            "top_comments": [
                "Jesus christ, did a teenager write this article?",
                "I have passed out from nitrogen being added to air in a medically monitored chamber for aviation training on hypoxia. It is painless.",
                "Do they say “good nitrogren” before it’s administered?",
                "I don't see how this is a \"cruel and unusual\" argument.\n\nI would CHOOSE this death if I get the choice.",
                "I’m generally not a proponent of the death penalty, but this sounds much more humane than lethal injection. Reading about lethal injections gone wrong is really very disturbing.\n\nEdit: I spoke too soon, and didn’t do enough research. It’s not at all clear to me that nitrogen is more humane than lethal injection. It seems as though nitrogen is capable of causing severe side effects too.",
                "Of all the humane ways to kill someone, that's the most humane.  You feel nothing different for a few seconds and then you pass out.  4 minutes later you're dead of lack of oxygen.  Your organs are perfectly fine and can be harvested for donation.  Sure, the ones getting the organs might become just like the executed, but hey, at least they'll become future donors, and the cycle will keep going and going and going...^muwahahaha",
                "\"Murder is wrong! Now, help me tie this dude down so I can suffocate him to death.\"",
                "How much does it cost for a full respirator mask and a 15-minute tank of nitrogen?",
                "that nitrogen might come in handy if you ever need to kill some star-eating life form's predator",
                "I am just going to drop this video of Jacob Geller covering the evolution of the death penalty and the false ideology of finding a humane way to kill someone. \n\nhttps://youtu.be/eirR4FHY2YY?si=wQhA9aJZGwnmc6a5"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Canadian actor detained at US border in ‘inhumane conditions’ for nearly two weeks | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/18/canadian-actor-jasmine-mooney-detained-mexico-border",
            "upvotes": 4126,
            "date": "03/18/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4ae288c52a7a1cd5ef59fe67e17fa069035a1233/0_185_950_569/master/950.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=53d6335812338a4954a34b46c1979ff0",
            "top_comments": [
                "Why dont they just send these people home immediately. What is the point of holding them hostage?",
                "You would have to be crazy to come to the US these days.\n\n“Eagles told the Vancouver Sun that instead of sending her daughter to Canada or advising her to fix her application, US Customs and Border Protection officers arrested her.”",
                "*... she was transferred to the San Luis detention center in Arizona,” Eagles said.   “They are housed together in a single concrete cell with no natural light, fluorescent lights that are never turned off, no mats, no blankets, and limited bathroom facilities.” Every time Mooney was transferred, she was handcuffed and in chains...*\n\nOf all the detention centers Mooney, this AZ one in San Luis had to be the worse.",
                "I think this is the 3rd foreign national that was arrested and nearly “disappeared” instead of just denying entry.",
                "I wonder how long it will take before countries start updating their travel advisories for the US",
                "Fox News used to run like weeklong specials about random white chicks that disappear.\n\nNow they're in the administration disappearing them.",
                "Somewhat amazing how quickly ICE went full fascist then again Bush filled the nascent agency with white nationalists and 20 years on those are all the supervisors, managers, and senior level people.",
                "I can hardly wait for the first time Dipshit Donnie tries to enter Canada and is instantly arrested and put in prison as a convicted felon trying to gain unlawful entry into Canada.",
                "What happened to you USA? You used to be cool. Now you like the \"Bumlord\". You're bringing everybody down, man. Stems and seeds, bother.",
                "\"felt like escaping a deeply disturbing psychological experiment\"\n\nWelcome to Trump's \"New Golden Age for America\""
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Amazon sues government safety agency over having to recall products from other sellers",
            "external_url": "https://www.cbsnews.com/news/amazon-product-recalls-consumer-product-safety-commission/",
            "upvotes": 431,
            "date": "03/18/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/01/18/afc44a79-7a90-47c2-95b3-fc34dd05201b/thumbnail/1200x630/30686ad6a91b3107fc78c73cc795d493/ap24017463992288.jpg?v=765ef194a4bf4701e45ec9d5712af42f",
            "top_comments": [
                "> During the proceedings, Amazon did not contest that the products presented a substantial hazard, but argued that it is not a distributor and is not responsible for protecting the public from products sold by third parties.\n\nOh, we'll happily profit from those using our platform to sell dangerous products, but don't you dare hold us responsible.",
                "There’s still a US government agency that hasn’t been dismantled?",
                "They want a cut of the money without any of the responsibility.  Deregulated industry 101.",
                "Because Amazon controls the entire logistics chain and is best suited to handle recalls. Amazon also controls access to that chain and the information customers can get about the products. Amazon is responsible for creating the system through which recalled products are necessary. Why does Amazon allow the sale of so many recalled products that it's a burden? Amazon is free to institute whatever recall conditions it may required between it and the sellers they freely agreed to partner with. Why wouldn't Amazon be responsible for recalls of products sold through them?",
                "It's about time they're held liable for the crap they put on the market.  I learned how to avoid 3rd party merchandise on Amazon until Amazon began misrepresenting the origin.  Navigating fair trade has seldom been more difficult.  Yes, you can return that defective merch as long as you're willing to lug it to the PO or arrange private carriers.  Disingenuous at best; criminal when you have a Prime account.\n\nEvery product/manufacturer/retailer has a market cycle and Amazon is floundering but so are other e-tailers.",
                "*The company reiterated that stance in a lawsuit filed late last week, describing itself as a logistics provider rather than a distributor.*\n\nTomatoes, to-mah-toes. I've worked in government long enough to know that the feds would have no less than 30 separate instances of defining \"distributor\" just in their tax laws alone, never mind the commercial code. And if the feds don't, nearly every state in the US does - distributors have been trying to squirm out of any tax responsibility since warehousing and particularly fulfillment became a thing in business.",
                "*\"Amazon's suit suggests the company thinks the people of the United States would be better off without an independent, bipartisan safety agency to enforce our laws and protect consumers from dangerous products.\"*\n\nThe way the Trump Admin is operating, Amazon probably only has to wait a little longer for one more citizen protective agency to be dismantled... billionaires for billionaires.",
                "And sadly they will probably get what they want because Bezos backed Trump.   \n  \nEverything is for sale in the US unfortunately",
                "> The commission in **July 2024** ruled that Amazon was distributing products that are defective or fail to meet federal safety standards. The CPSC also said Amazon was legally responsible for the recall of more than 400,000 products, including faulty carbon monoxide detectors, hairdryers without electrocution protection and **children's sleepwear that violates federal flammability standards.** \n\nI can only imagine what Amazon founder Jeff Bezos said when he stopped the Washington Post editorial board from endorsing Kamala Harris: *\"The Democrats are trying to stop us from burning America's children to death in their sleep; we can't let their bleeding-heart, pro-child agenda win!\"* \n\n> \"The commission may issue recall orders to the manufacturers, distributors and retailers of a product, but not to third-party logistics providers who store the product in their warehouses and transport it to customers,\" Amazon stated its suit, filed on March 14 in the U.S. District Court for the District of Maryland. \n\n*\"We're not a 'distributor,' we're just a warehouser/transporter. We're not a 'retailer,' we just sell retail goods to customers.\"*",
                "Not after this news. What a waste of taxpayer dollars telling Amazon to keep consumers safe. /s"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "FDA staff return to crowded offices, broken equipment and missing chairs",
            "external_url": "https://apnews.com/article/fda-return-office-parking-lines-chaos-federal-employees-c4fa013f27f286752e7b17a6e39c52e2",
            "upvotes": 2102,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "My god, the efficiency is breathtaking",
                "My hairdresser was just telling me that one of her clients had been working for the IRS for 5 years.   The client was forced to go to the office for the first time last week and told that they could resign or retire and be barred from ever getting another government job and get pay and benefits through the end of the year.   \n\nMeanwhile, they couldn't force enough people to retire so everyone else is required to go into the office 5 days a week.   But there aren't enough parking spaces,  chairs, desks, or cubicles for everyone.   It's a giant shitshow.",
                "We are going to break the system one way or the other.",
                "There is one universal truth about government work. \n\nYour chair will be stolen if you leave it unattended long enough. Damn son'va bitches stealing chairs left and right up in there!",
                "Legionella in the tap water at the FDA.\n\nWelcome to Trump's \"New Golden Age of America\"",
                "Where are all the stolen items stored, let me guess? MaRa La Gooooo.",
                "Office Space 2: Electric We’reAllGonnaDieAndIt’llBeStupid-aloo",
                "Family member works for USAID. They were called in about 3 weeks after this started. They also laid off the janitors… everyone had left their desks as if they’d be back the next day…",
                "Now taking someone’s office chair, putting it above my head, and scurrying away in glee sounds just like me to be honest.",
                "Muskrats got their first and took all the good stuff."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Tesla investor calls for Elon Musk to step down as boss | Money News",
            "external_url": "https://news.sky.com/story/tesla-investor-calls-for-elon-musk-to-step-down-as-boss-13331499",
            "upvotes": 79474,
            "date": "03/18/2025",
            "thumbnail": "https://e3.365dm.com/25/02/1600x900/skynews-washington-elon-musk_6827946.jpg?20250213175145",
            "top_comments": [
                "Love this for him. He just broke the Guinness world record for losing the most amount of money in a certain amount of time.",
                "I mean, he *IS* tanking the brand. And he's not doing his job, since he has his fancy new \"government role\".\n\n\nI'm not sure he was ever doing anything to begin with, but now he is actively wrecking Tesla.\n\n\nETA: If you zoom in to this picture, he looks like MODOK.",
                "The crazy part is that Musk is “running” the company remotely.  Also known as telework or remote work.  Musk said remote/telework is immoral.",
                "Stepping down won't matter.  As long as he's the controlling owner of Tesla, people will associate him with the company.",
                "[deleted]",
                "He has to step down from the government 1st.",
                "That brand is dead to me no matter what they do.",
                "If the ceo of a company loses 800 BILLION market value, why on earth would you want to keep that guy around? ",
                "He needs to rot in a cell the rest of his life.",
                "The fact they waited this long proves they're cowards. He fucked their stock for 3 months and only now they're calling for him to fuck off? I hope he stays until it hits 10 dollars a share so these spineless cronies lose as much as possible.\n\nPathetic"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "ICE ‘disappeared’ 48 New Mexico residents, civil rights lawyers say",
            "external_url": "https://www.independent.co.uk/news/world/americas/us-politics/new-mexico-ice-arrests-aclu-complaint-b2717442.html",
            "upvotes": 19441,
            "date": "03/18/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/18/17/46/Immigration-Appointments-toos8eqy.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "TLDR, they have been deprived of Habeus Corpus, even the lawyers who oversight these ICE facilities in question have no proof they are even still alive, in the country, where they are being imprisoned, nothing. Not even their fucking names. They haven't seen them, they don't know what their condition is. These are flagrant abuses of universal human rights. They could also be US Citizens. \n\nThe New Mexico ICE field office is located at 5441 Watson Drive South East Albuquerque, NM 87106 their public number is (505) 452-4700. Do they have the consent of the governed?   \n\n               ",
                "Kidnapped. Time to start saying it as it is. The United States Government is kidnapping citizens.",
                "People are gonna have to start keeping a copy of their birth certificate on them at all times. Get pulled over.. open up a live video on social media immediately.",
                "This is the test everyone says they would have passed during world war 2, turning over humans do be disappeared or to hide and assist them at the risk of imprisonment yourself, we are gonna see the true moral character of those around us in the next few years",
                "A long but good quote from Aleksandr Solzhenitsyn's The Gulag Archipelago: \n\n\n\"And how we burned in the camps later, thinking: What would things have been like if every Security operative, when he went out at night to make an arrest, had been uncertain whether he would return alive and had to say good-bye to his family? \n\n\nOr if, during periods of mass arrests, as for example in Leningrad, when they arrested a quarter of the entire city, people had not simply sat there in their lairs, paling with terror at every bang of the downstairs door and at every step on the staircase, but had understood they had nothing left to lose and had boldly set up in the downstairs hall an ambush of half a dozen people with axes, hammers, pokers, or whatever else was at hand?...\n\n\n The Organs would very quickly have suffered a shortage of officers and transport and, notwithstanding all of Stalin's thirst, the cursed machine would have ground to a halt! If...if...We didn't love freedom enough. And even more – we had no awareness of the real situation.... We purely and simply deserved everything that happened afterward\"",
                "Only a matter of time before US citizens start \"disappearing\" as well. This administration has shown that it does not care about what the law or courts say, so there is no one to stop them from doing this.",
                "[removed]",
                "Did people forget we still have kids who we lost their parents for the last go around with Trump?",
                "We look at the gestabo and KGB and think to ourselves “how could they allow such evils?”",
                "We'll only discover the bodies after it's all over, just like every other fascist nightmare"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Social Security Administration to require in-person identity checks for new and existing recipients",
            "external_url": "https://apnews.com/article/social-security-fraud-waste-doge-elon-musk-212e3089951f731fd3f83443e104b315?utm_source=copy&utm_medium=share",
            "upvotes": 5825,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The waiting room is going to look like it did Beetlejuice.",
                "Now is the time to establish an identity on MySSA\n\nEveryone who has ever worked in the US should do that. You should be checking on your SSA earnings regularly long before you retire. Especially to make sure your employer is paying into it.\n\nEdit: it also detects identity theft of your SSN. If someone is using your SSN the contributions will show up.\n\nEdit2: the website is only open during their business hours.",
                "Didn’t they just close a bunch of SS offices?",
                "Ahh yes the old and disabled population, known for their high mobility and driving skills.\n\nFuck this country.",
                "Wow.\n\n  \nIt is already a hassle enough if you're in a decent sized metro area. Now imagine being in rural Nebraska and having to go identify in person at the SSA office...",
                "Fucking over the core GOP constituency. That’s a bold strategy. Let’s see how it plays out for them.",
                "What are they gonna do for survivor beneficiaries? Have an 8 year old drag their parent’s body across the floor?",
                "So they want a person who might be hospitalized to go to the social security administration to get their checks.  \n\nHe is like:  since they won’t let me end social security, I will make it impossible for people to get their checks.",
                "I waited on a call for 3 hours the other day to be told I had to go to the social security office in person and present some info to get an update, when I went to the office I was told I had to have an appointment and to call the same number I had the other day and there was no walk in appointments.. tried calling and they weren’t letting people sit on hold and to just call back later.. so I got no appointment.. this is going to be a shit show",
                "WAKE UP.  while they cant slash the money going to your pockets directly yet, they are intentionally making things inaccessible and difficult for the people. Imagine the elders that have no internet, no reliable transportation, rely on physical mail. This is inhumane, almost like they wanna cull the people receiving entitled benefits. Except this is death by a thousand cuts. Sickening."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Teslas set on fire with Molotov cocktails and shot with gun in Las Vegas attack",
            "external_url": "https://www.nbcnews.com/news/us-news/teslas-set-fire-molotov-cocktails-shot-las-vegas-attack-rcna196942",
            "upvotes": 16607,
            "date": "03/18/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250319-teslas-las-vegas-mn-0730-457429.jpg",
            "top_comments": [
                "These attacks aren't just happening in Vegas; they also seem to be taking place in other states. There was some incident in Kansas City where a Tesla dealership's CyberTrucks were lit up in a fire. Man it's getting crazy out there",
                "Imagine traveling back in time 6-8 years and telling someone that in 2025 there would be a group going around destroying EVs, and then trying to convince them it’s the left doing it lol",
                "It's getting kinda \"torch and pitchfork\" out there, huh?",
                "I read the Tesla vehicles are all paid actors.",
                "The stock tanking is a bigger statement IMO and I hope it goes down to pennies.",
                "[removed]",
                "EV fires are such a dangerous fire.  I feel bad for the first responders.",
                "its just locker room arson.",
                "[removed]",
                "Ellon hasn't even said \"thank you\" once"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Ben & Jerry's claims Unilever ousted its boss over political activism",
            "external_url": "https://www.bbc.com/news/articles/ckg8pk9rpx4o",
            "upvotes": 863,
            "date": "03/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d7be/live/d33cbd20-0485-11f0-9776-23d43d9c7fe7.jpg",
            "top_comments": [
                "Back in the 80s, Ben & Jerry’s had a corporate 5 - 1 plan.  The highest paid employee (including CEO) could make no more than 5 times the salary of the lowest paid employee.",
                "Buy an activism by design brand then fire the activists. Sounds about right.",
                "Did they really think selling their brand to a corporation would end any other way?",
                "Sell out to corporate and then wonder why you’re not allowed to act anti-corporate anymore. It’s elementary dear Watson",
                "Be like Canada and buy Chapman's.",
                "Well the company members had a majority vote to sell itself to a multinational corp, what the hell did they think was gonna happen?",
                "The Americone Dream is over.",
                "It doesn’t look like this has gone through yet according to the article. Guess we will see what the independent board decides.",
                "Not going to lie. This boycott is going to hurt.",
                "Perhaps they should have considered not selling out to a giant soulless multinational corporation"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Federal judge rules DOGE's USAID dismantling likely violates the Constitution, blocking Musk from further cuts",
            "external_url": "https://apnews.com/article/usaid-federal-judge-trump-administration-bdc919a5d98eda5ab72a32fdfe2f147d?utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Facebook&fbclid=IwZXh0bgNhZW0CMTEAAR08wP9OXojQ8pN3mFLz88gnMNYOpMliinDgxBeBLcFPFRiCqZNXskWI2J0_aem_wTezhuydfNr_XXXvgwA5Aw",
            "upvotes": 11777,
            "date": "03/18/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "the most doge thing for DOGE to do is to eliminate itself",
                "Cool, now that they've made this ruling over and over, how about enforcing it?",
                "The problem is the administration doesn't think it should be held accountable by our checks and balances. You know, the ones the Founding Fathers considered a pillar of our Constitution.",
                ">\"I don't care what the judges think\"\n\n-MAGA, when judges rule against their interests.",
                "Outstanding. Now please enforce it tomorrow when they inevitably do something else unconstitutional.",
                "Shame that won't stop them in any way, they've stated the courts have no authority.",
                "Why do they need to couch the language with \"likely\"? Just cite where in the Constitution was violated. Boom.",
                "\"Blocking\" Musk from doing something he *never* had the authority or legal right to do in the first place isn't going to do anything. This is a start though. Start issuing warrants.",
                "If this ruling has judicial weight, why doesn’t it unravel everything that muskrat has done in terminating federal employees? If it was unconstitutionalfor USAID, then surely it is unconstitutional for NASA, NOAA, FDA, and more.",
                "What happened to do something illegal and go to prison?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Minnesota state Sen. Eichorn arrested on suspicion of soliciting a minor",
            "external_url": "https://www.mprnews.org/story/2025/03/18/state-senator-eichorn-arrested-suspicion-of-soliciting-a-minor",
            "upvotes": 20135,
            "date": "03/18/2025",
            "thumbnail": "https://img.apmcdn.org/efc0a6706dfa0131eda07e7a2398a16d17f2a111/widescreen/e36356-eichorn-arrest-2000.jpg",
            "top_comments": [
                "Wasn't this scumbag one of the guys trying to push legislation in Minnesota to make hating Trump a mental illness?",
                "They didn't state the party in the title because you already know it.",
                "Ya know. \n\n\nRepublicans constantly going on about pedophiles and protecting the children is really starting to seem like some severe projection. \n\n\nEdit: notable typo.",
                "I guess he had Trump Depravity Syndrome.",
                "Title correction: \"**Republican** Minnesota state Sen. Eichorn...\"",
                "[deleted]",
                "I'll save you all a click.  Yes it was a republican",
                "Party of family values, it just might be your child",
                "What a surprise!  He's a Republican.",
                "The GOP - Grand Old Pedophile party."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Canadian actor detained at US border in ‘inhumane conditions’ for nearly two weeks | US news",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/18/canadian-actor-jasmine-mooney-detained-mexico-border",
            "upvotes": 4125,
            "date": "03/18/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4ae288c52a7a1cd5ef59fe67e17fa069035a1233/0_185_950_569/master/950.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=53d6335812338a4954a34b46c1979ff0",
            "top_comments": [
                "Why dont they just send these people home immediately. What is the point of holding them hostage?",
                "You would have to be crazy to come to the US these days.\n\n“Eagles told the Vancouver Sun that instead of sending her daughter to Canada or advising her to fix her application, US Customs and Border Protection officers arrested her.”",
                "*... she was transferred to the San Luis detention center in Arizona,” Eagles said.   “They are housed together in a single concrete cell with no natural light, fluorescent lights that are never turned off, no mats, no blankets, and limited bathroom facilities.” Every time Mooney was transferred, she was handcuffed and in chains...*\n\nOf all the detention centers Mooney, this AZ one in San Luis had to be the worse.",
                "I think this is the 3rd foreign national that was arrested and nearly “disappeared” instead of just denying entry.",
                "I wonder how long it will take before countries start updating their travel advisories for the US",
                "Fox News used to run like weeklong specials about random white chicks that disappear.\n\nNow they're in the administration disappearing them.",
                "Somewhat amazing how quickly ICE went full fascist then again Bush filled the nascent agency with white nationalists and 20 years on those are all the supervisors, managers, and senior level people.",
                "I can hardly wait for the first time Dipshit Donnie tries to enter Canada and is instantly arrested and put in prison as a convicted felon trying to gain unlawful entry into Canada.",
                "What happened to you USA? You used to be cool. Now you like the \"Bumlord\". You're bringing everybody down, man. Stems and seeds, bother.",
                "\"felt like escaping a deeply disturbing psychological experiment\"\n\nWelcome to Trump's \"New Golden Age for America\""
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "U.S. could lose democracy status, says global watchdog",
            "external_url": "https://www.cbc.ca/news/world/trump-democracy-report-1.7486317",
            "upvotes": 4423,
            "date": "03/18/2025",
            "thumbnail": "https://i.cbc.ca/1.7486323.1742279379!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_1180/usa-trump-justice.JPG?im=Resize%3D620",
            "top_comments": [
                "At least the libs are at last owned.",
                "In before conservatives with \"iTs A rEpUbLiC nOt A dEmOcRaCy!\"",
                "Constitutional crisis. What’s next? Martial Law?",
                "As long as we’re well fed and entertained, people would let a monarchy slowly re-emerge. ",
                "I think it said \"could\" instead of \"should\"",
                "It's honestly laughable we are seen as a legitimate democracy at this point.",
                "They're eating the votes, eating the laws",
                "I wonder what the American founding fathers will think if you have transported them to now. I have a feeling that if they are seeing this from the other side, they must be rolling in their graves.",
                "People need to stop putting the kiddie gloves on when it comes to this country and goverment. Call it what it is. It's not a democracy and it hasn't been since Jan 6th when they tried to overthrow the goverment and the heads of that movement faced no consequences.",
                "Abe Lincoln didn't die for this shit"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Turkey detains Erdogan's main rival on array of charges",
            "external_url": "https://www.reuters.com/world/middle-east/turkish-authorities-order-detention-istanbul-mayor-some-100-others-2025-03-19/",
            "upvotes": 382,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "It is really sad to see so many countries across the world sink into the depths of authoritarianism and dictatorship. These are truly dark times.",
                "This will soon happen in the US if we're not proactive...let it be a valuable lesson",
                "I am sure the same will happen in the states.",
                "Erdogan detains Erdogan's main rival\n\nFtfy",
                "Classic dictator move. Any potential rival who is too popular suddenly gets into legal trouble.",
                "Coming soon to America, sadly.",
                "I'm grateful for them to behave openly like that, otherwise some people might be under the illusion Turkey should enter the EU, despite them being not European, openly aggressive to Greece... Without the location they would never ever be part of NATO tbw.",
                "I'm Turkish and this is the deep point of unlawfulness. There is no law anymore. He really wants to turn the country into Russia or North Korea, in which only he could be the one and only leader, until he's dead.\n\nMind you, this mayor is indeed Erdogan's strongest rival and won Istanbul elections 3 times. Don't underestimate the amount of people in Turkey who are against Erdogan.",
                "Watch closely America. This is gonna be your future if you don’t do anything against it"
            ],
            "aggregate_sentiment": 8.0
        }
    ],
    "last_updated": "03/19/2025 12:15:18 UTC"
}