{
    "posts": [
        {
            "category": "HOT",
            "title": "RFK Jr. to End 'Godsend' Narcan Program That Helped Reduce Overdose Deaths Despite His Past Heroin Addiction",
            "external_url": "https://www.latintimes.com/rfk-jr-end-godsend-narcan-program-that-helped-reduce-overdose-deaths-despite-his-past-heroin-581846",
            "upvotes": 11691,
            "date": "04/28/2025",
            "thumbnail": "https://d.latintimes.com/en/full/575177/rfk-jrs-autism-study-use-millions-americans-medical-records.jpg",
            "top_comments": [
                ">Though Kennedy has previously praised interventions like Narcan as critical to saving lives, he now frames the crisis as one requiring deeper, spiritual and societal change rather than relying solely on “nuts and bolts” medical solutions.\n\n\nwhy have lifesaving medicine like narcan to help reduce overdose deaths when we can just not have that and rely solely on vibes instead?\n\nto be unmistakably clear - they hate you. they are reducing access to the single best weapon we have to treat overdose victims because they don’t want those people to live. if you are unfortunate enough to have lost someone you cared about to an opioid overdose, they want to make sure more people share your pain.\n\nwe are rapidly approaching the point where we need to have our own version of the nuremberg trials for this administration. every single one of them needs to rot in a cell or below one.",
                "Can't have those drug addicts getting autism.",
                "Ah yes the party of “I got mine, so screw you”",
                "absolute piece of shit garbage humanoid",
                "> Recent CDC data shows a nearly 24% drop in overdose deaths for the 12 months ending September 2024, the sharpest one-year decline in decades—an achievement partly attributed to widespread naloxone access.\n\nThat is a massive reduction in deaths. Imagine seeing that kind of positive data and still cutting funding.",
                "Yeah. The hallmark of modern republicans is the *open scorn* of empathy.",
                "Now would be a good time for RFK to pick up the heroin habit again.",
                "They're hardly making any pretenses anymore about the fact that they *want* people to die.\n\nIf you're not a healthy, god-fearing American, you're on your own. Good luck.",
                "Caroline Kennedy claims that RFK got his brother, 13 at the time, addicted to the heroin that killed him at 28.",
                "\"other countries are sending drugs over the border 😠💢\"\n\n\"let's fix it by ruining all amicable relations we have, doing nothing to address that demand is there for hard drugs, and kill the people who do drugs 😚✌️ live laugh love #god #maga\""
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "DOGE employees gain accounts on classified networks holding nuclear secrets",
            "external_url": "https://www.npr.org/2025/04/28/nx-s1-5378684/doge-energy-department-nuclear-secrets-access",
            "upvotes": 18040,
            "date": "04/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2400x1350+0+181/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff7%2F4e%2F1cc1562d471699f983bee6280ccf%2F49640296323-792e9026c5-o.jpg",
            "top_comments": [
                "Just a reminder that the person ultimately responsible here is not Musk - it's Trump.\n\nIt's through Musk's 250 million to Trump, executive powers, and bullying congress - that DOGE happened.\n\nBOTH are responsible for the fiasco. Don't even get me started on the literal AI powered privacy-raping nightmare they are building in Memphis called Colossus - built on our stolen private data.",
                "Remember how Republicans screamed 'LOCK HER UP' for years and years and years - because Hillary used a private server for encrypted email?",
                "Remember when the consequence for this was being sent to Federal, pound-you-in-the-ass Prison.\n\nSucks that we elected a convict who is so weak he cannot even prevent the crimes going on right under his nose.",
                "Someone is giving them access to all of these systems. Like they can’t just gain access. Someone is giving it to them.",
                "Not great.\n\n> Luke Farritor, a 23-year-old former SpaceX intern and Adam Ramada, a Miami-based venture capitalist, have had accounts on the computer systems for at least two weeks, according to the sources who also have access to the networks. Prior to their work at DOGE, neither Farritor nor Ramada appear to have had experience with either nuclear weapons or handling classified information.",
                "\"Russia gains accounts on classified networks holding nuclear secrets\"",
                "Well it won't be long until these aren't secrets anymore I'm sure.",
                "\"It was Elon's thing. I never knew about it.\"\n\n-DJT at the onset of global thermonuclear war",
                "I swear Musk would fire a nuke just see what happens.",
                "So we can assume that russia has them too, now"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "ICE: ‘First-of-its-kind’ operation with local law enforcement leads to nearly 800 immigrant arrests in Florida | CNN",
            "external_url": "https://www.cnn.com/2025/04/27/us/ice-operation-first-of-its-kind-florida-hnk/index.html",
            "upvotes": 6053,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gpd8gotx0aapnmi.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Were any of them citizens or otherwise illegally arrested? Are they going to get treated to full, legal due process?",
                "Hey, remember when the US invaded Iraq and then locals were like, \"OMG DAT DOOD A TERRORIST!\" and later they found out many of them were just neighbors who didn't like them and wanted them gone. I'm sure this isn't anything like that...",
                "I'm sure that includes the CEO's in chicken plants or wherever else who hire them, right? Right?",
                "Bolstering stats before the 100th day in office tomorrow",
                "When we get to the end of this, and the vast majority of the illegal immigrants have been found, and none of the problems the US is facing have been fixed\n\nWhat then?\n\nWill they realize that corporate and individual greed is damning america much more significantly than any immigration issues\n\nOr will they then turn to immigrant citizens and blame them. How many taxpayers need to be victimized before it starts to click that the corporate tax evasion is the bigger drain on society",
                "Ever read Ordinary Men: Reserve Police Battalion 101 and the Final Solution in Poland  by Christopher Browning?\n\n>\n\n>*Ordinary Men* is the true story of Reserve Police Battalion 101 of the German Order Police, which was responsible for mass shootings as well as round-ups of Jewish people for deportation to Nazi death camps in Poland in 1942. Browning argues that most of the men of  RPB 101 were not fanatical Nazis but, rather, ordinary middle-aged, working-class men who committed these atrocities out of a mixture of motives, including the group dynamics of conformity, deference to authority, role adaptation, and the altering of moral norms to justify their actions. Very quickly three groups emerged within the battalion: a core of eager killers, a plurality who carried out their duties reliably but without initiative, and a small minority who evaded participation in the acts of killing without diminishing the murderous efficiency of the battalion whatsoever.\n\n>While this book discusses a specific Reserve Unit during WWII, the general argument Browning makes is that most people succumb to the pressures of a group setting and commit actions they would never do of their own volition.  \n\n>*Ordinary Men* is a powerful, chilling, and important work with themes and arguments that continue to resonate today. \n\n\n\n\n\n\n\nToday, Orpo must stand for Orlando Police",
                "That's a lot, did they raid Mar-a-Lago or something?",
                "I’m sure MAGA will be lining up to take their jobs as farm and construction workers",
                "Even putting aside how gross and immoral Trump’s immigration policies are, this is also evidence as to why it’s ineffective on top of it. One of the reasons he’s been targeting asylum seekers, Visa holders and students is that they’re the easiest ones to track. Even with everyone working together to grab undocumented immigrants, 800 is the best they can do because it’s so much more logistically difficult to find and target them.",
                "It wasn't first of it's kind, 1930s Germany did it first!"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Military incursion imminent according to Pakistan",
            "external_url": "https://www.reuters.com/world/pakistan-defence-minister-says-military-incursion-by-india-is-imminent-2025-04-28/",
            "upvotes": 7744,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Asif said Pakistan was on high alert and that it would only use its arsenal of nuclear weapons if \"there is a direct threat to our existence\"\n\nI was not expecting them to talk about the possibility of using them, thats even more terrifying",
                "The headline has been updated for clarity:\n\n>Pakistan defence minister says military incursion **by India** is imminent\n\n(just in case anyone thought the Pakistan defence minister was announcing attack plans)",
                "Hopefully it'll be just some isolated border skirmish but we have no idea how wide a flashpoint can spread at this point. I'm actually more concerned about the water rights fight. That one can be an existential battle and with nukes on both sides, it's going to be a nail biter.",
                "There is no two countries more prepared to not nuke each other.",
                "This decade fucking sucks.",
                "Who would have thought this would happen.  2025 is definitely going into the history book as a very effed up year and we are only in april.",
                "Here's hoping it stays contained and remains conventional.",
                "He said is words were misinterpreted  . Either this some tactic from Pakistan or Reuters spreading fake news (which would be strange)\n\n[https://www.dawn.com/news/1907158/khawaja-asif-clarifies-remarks-about-imminent-indian-military-incursion-says-words-misinterpreted](https://www.dawn.com/news/1907158/khawaja-asif-clarifies-remarks-about-imminent-indian-military-incursion-says-words-misinterpreted)",
                "Will nothing happen again?",
                "Now if this escalates into a full blown conflict that's really going to put a dent in Apple's plans to shift it's iPhone manufacturing to India."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Final autopsy results on Gene Hackman and his wife, Betsy Arakawa, reveal complex health issues",
            "external_url": "https://www.theguardian.com/film/2025/apr/28/gene-hackman-betsy-arakawa-final-autopsy-results-complex-health-issues",
            "upvotes": 2577,
            "date": "04/28/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6867ae97d295517c95c9356f3e449292ddd146c2/0_129_1442_865/master/1442.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b23f6ffddf97fab838e068e65ad596f2",
            "top_comments": [
                "Nobody plans for dementia. My elderly neighbor scared my husband to death when he found her on our front porch staring through the window in the early days of the COVID lockdown. She thought her husband, who had dementia, was trying to kill her and she “escaped” through a window and crawled through the snow to our home. When I first met them a couple of years earlier they were articulate and friendly folks who seemed wealthy and I might add somewhat narcissistic. \n\nThe smell of their house was nauseating. Their dog was a filthy matted mess who looked more like a rescue off of the streets. He had pooped and peed all over the house and there were mouse droppings in their fridge. It was heart breaking and made me realize that we have to plan early before oor minds and bodies leave us in a vulnerable position. ",
                "The idea that he does not realize she has died because of his dementia breaks my heart",
                "*Further police investigations of their grounds discovered widespread evidence of rodent infestation. Meanwhile, recently released body cam footage of the local police department’s first visit to the property suggested the couple may have struggled to keep their home under control, while a discarded plaster indicated Arakawa might have been bitten by a rodent.*\n\nThis is surprising, given their fame and financial status. I also wonder why Arakawa, given her role as Gene's medical aid, didn't call 911 when she was very sick, knowing that Gene couldn't function without her.",
                "This story is heartbreaking.",
                "I find [this article ](https://theonion.com/even-investigators-not-sure-why-they-keep-releasing-details-of-gene-hackmans-death/) more  relevant every time more information is released.",
                "I'm OK with privacy and wanting to save money.\n\nBut if I'm old, got Gene's money, and medical issues?\n\nI'm having a nurse stop by daily. FUCKING DAILY. Take my blood preasure. Count my pills. Whatever. Just check on me, and deal with shit if things don't seem right.\n\nHeck, there's a great argument to be made for round the clock nursing team living right next door with a \"my tummy hurts\" button to call for help.",
                "The fact that I got an Orkin Pest Control ad in the middle of the comments section is fucking gross.",
                "This is why I now call my mother weekly to reassure her that i know she's alive.",
                "This is the worst story.",
                "You would think with Hackman being such a big star they would have had caregivers in place. Or at least someone checking up on them."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Temu customers in the U.S. hit with steep import charges due to tariffs",
            "external_url": "https://www.nbcnews.com/business/business-news/temu-adds-import-charge-to-orders-trump-tariffs-how-much-rcna203279",
            "upvotes": 3288,
            "date": "04/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250428-temu-app-se-927a-8efad9.jpg",
            "top_comments": [
                "Showing it as an additional line item instead of a price increase is perfect. Shows the consumer WHY it's more expensive and avoids the reality that anyone who increases their price will not lower it if the tariffs are canceled. Inflation will get really bad if retailers just roll the tariff into the retail price.",
                "[It's almost like the thing everyone predicted would happen, happened exactly as predicted.](https://www.washingtonpost.com/business/2023/08/22/trump-trade-tariffs/)",
                "This is unironically going to be where the most impact is for a lot of the MAGA types. My most die hard Trumpist family members all buy their shit off Temu.",
                "Between temu, shein and others, so may youtube channels are suddenly fucked.",
                "\"Shop like a billionaire\" suddenly got a whole different meaning.",
                "I wonder if the tariff tax is happening on SHEIN too? That’ll ruffle some feathers",
                "Temu will be the least of our problems as the economic crisis intensifies.",
                "It's ok. They tell me that the tariff revenue rolling in from products people can no longer afford to buy will replace the income tax",
                "You shouldn't be buying cheap garbage from Temu anyway.  Now you can buy expensive garbage from Temu to pay for billionaire's tax cuts.  Thanks Trump?",
                "Why would Joe Biden do this?!?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "US Navy loses $60 million jet at sea after it fell overboard from aircraft carrier",
            "external_url": "https://www.cnn.com/2025/04/28/politics/us-navy-jet-overboard/index.html",
            "upvotes": 1547,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-8998056.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">A US official said that initial reports from the scene indicated that the Truman made a hard turn to evade Houthi fire, which contributed to the fighter jet falling overboard. The Houthi rebel group claimed on Monday to have launched a drone and missile attack on the aircraft carrier, which is in the Red Sea as part of the US military’s major anti-Houthi operation. \n\nIf a carrier is turning to avoid fire, something is seriously wrong with the battlegroup and the ships that are supposed to be screening. \n\nThis response sounds like BS.",
                ">\"The F/A-18E was actively under tow in the hangar bay when the move crew lost control of the aircraft. The aircraft and tow tractor were lost overboard,\" the statement said. \"Sailors towing the aircraft took immediate action to move clear of the aircraft before it fell overboard. An investigation is underway.\"\n\nFrom inside the ship? So it like tumbled all the way out of one of those big side doors?",
                "Did anybody check if Hegseth was somewhere near it at the time?",
                "The Department of Defense swore to, \"find the DEI hire responsible.\"",
                "Did they try putting it in rice?",
                "Welp, going to need to boot grandma from social security so they can buy two more.",
                "Did the jet even say thank you",
                "Whoops \n\nGlad to do my part with “defense” spending and national debt 💸",
                "\"The carrier made a hard turn to avoid Houthi fire.\"\n\n-\n\nLol",
                "Buried the lede:\n\n> Another F/A-18 from the Truman was also “mistakenly fired” upon and shot down by the USS Gettysburg in the Red Sea in December ; both pilots ejected safely."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Spain declares state of emergency after nationwide power blackout",
            "external_url": "https://www.reuters.com/world/europe/spain-declares-state-emergency-after-nationwide-power-blackout-2025-04-28/",
            "upvotes": 1810,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Madrid centre here. It was not dangerous, but here is what I observed:\n\n- In a matter of 3 hours, supermarkets where overwhelmed. They closed soon after.\n- You could not pay by credit card, only cash. Of course, withdrawing money from the bank was impossible.\n- Chinese convenience stores were the only ones open\n- Chinese utility stores (the kind that sell batteries and lanterns) where overwhelmed.\n- Everybody was on the streets talking about the blackout.\n- Tons of people stuck in elevators and public transport like subway for several hours\n- Cars could not be refilled, not even with gas\n- Bus overflowed\n- Traffic overwhelmed as traffic lights didnt work\n- Tons of people has to walk for hours home\n- People could not cook, as most people here use electric induction\n- Some people where on parks cooking everything other people bring them (as a solidary act)\n\n\nTook 10 hours to restore electricity here.\n\nIf this lasted for a week, I think it is reasonable to expect a much bigger chaos to the point of assaulting supermarkets and all that.\n\nI knew the system that we live in was fragile and people didnt understood. But the experience confirmed my thoughts 1000%.",
                "Just got our lights back at 22:15 in the northern part of Madrid. It was a weird day, but a bit uplifting if I'm being honest. Talked with neighbors I haven't really interacted with since the pandemic. Probably won't again until the next crisis, which is a bummer.",
                "We are fine in my zone (Basque country). Let see if Madrid remains calm.",
                "Have they go found the cause yet?",
                "Nation wide blackout!??! How does this happen?",
                "Has anyone checked on El Estepario? ",
                "It’s quite scary that the infrastructure of so many people, in multiple countries, can be so heavily hit like this. Hospitals, airports, trains. Whether it was an attack or something accidental, you’d really hope that this will be a major wake up call for the affected governments.",
                "Just super happy everyone remained civil. Have heard 0 reports of people starting to loot in either Portugal or Spain. No civil or security issues. Faith in humanity was partially restored.",
                "Pedro Sanchez just said that 60% of the power output dissapeared from the network in 6 seconds. No explanations yet.",
                "Im in Barcelona. My neighborhood (Nou Barris/Horta area; Vilipicina) has had power for about 3 hours. Almost everything is back to normal, except people panic shopped the neighborhood Mercadona and the shelves are COVID bare. It will probably be a week or so before it's fully stocked again. I know there is still work to be done in other parts of the country, but It seems like this is mostly over and was a non-event, really. Besides the people being stuck in the Metro or on the long distance trains."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "All Joann Fabric and Craft store locations to close by end of May",
            "external_url": "https://www.live5news.com/2025/04/28/all-joann-fabric-craft-store-locations-close-by-end-may/",
            "upvotes": 3385,
            "date": "04/28/2025",
            "thumbnail": "https://gray-wcsc-prod.gtv-cdn.com/resizer/v2/XK46E4Z7JZE4ZKDB3NCY4BZIZA.jpg?auth=9d580f4daf716e14a5c7f9f6fbe3aaa51561aba9e16d90e63e3dcde6b189560f&width=1200&height=600&smart=true",
            "top_comments": [
                "Private equity ruins yet another business.",
                "Bye Joann's, you were my go to fabric and notions store. Now where am I supposed to go?",
                "Man, I used to enjoy going there with my mom.",
                "Reading they got Toys R Us’ed. Bought specifically so they can be bankrupted and their assets sold off.",
                "When billionaires destroy to create monopoly everything comes from Amazon.",
                "Their going out of business prices were worse then some stores normal prices",
                "Private equity firms are fucking monsters.",
                "My wife was waiting for prices to go down on sewing patterns at our local store. Patterns were listed at $20 to $30 each, and then they were brought down to about $10 each. She felt that that was still too high considering that the store was shutting down. And so she waited to see if they would bring it down further. \n\nInstead, the store dumped all the patterns into a recycling bin.\n\nI am sure that they were contractually obligated to do this. This was not a case of the store just being spiteful or wasteful.",
                "Are there any craft stores that aren’t super Christian now?",
                "There was no reason for the store near me to close... it always had foot traffic. If was our go-to for any and all kids school projects, Halloween costume stuff, etc etc. the parking lot was never empty. It's just insane that venture capitalism is legal."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Mob chased Brooklyn woman after mistaking her for protester at speech by Israeli security minister",
            "external_url": "https://apnews.com/article/itamar-bengvir-brooklyn-mob-woman-chased-090da170e8800307c54e2520320f6a2c",
            "upvotes": 19468,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Absolutely nuts \n\n> NEW YORK (AP) — A Brooklyn woman said she feared for her life as she was chased, kicked, spit at and pelted with objects by a mob of Orthodox Jewish men who mistook her as a participant in a protest against Israel’s far-right security minister.\n\n-\n\n> The woman, a neighborhood resident in her 30s, told The Associated Press she learned of the protest after hearing police helicopters over her apartment. She walked over to investigate around 10:30 p.m. but by then the protest had mostly disbursed. Not wanting to be filmed, she covered her face with a scarf.\n\n>“As soon as I pulled up my scarf, a group of 100 men came over immediately and encircled me,” said the woman, who spoke to the AP on the condition of anonymity because she feared for her safety.\n\n>‘I had nowhere to go’\n\n>“They were shouting at me, threatening to rape me, chanting ‘death to Arabs.’ I thought the police would protect me from the mob, but they did nothing to intervene,” she said.\n\n>As the chants grew in intensity, a lone police officer tried to escort her to safety. They were followed for blocks by hundreds of men and boys jeering in Hebrew and English.\n\n>Video shows two of the men kicking her in the back, another hurling a traffic cone into her head and a fourth pushing a trash can into her.\n\n>“This is America,” one of the men can be heard saying. “We got Israel. We got an Army now.”\n\n>At one point, she and the police officer were nearly cornered against a building, the video shows.\n\n>“I felt sheer terror,” the woman recalled. “I realized at that point that I couldn’t lead this mob of men to my home. I had nowhere to go. I didn’t know what to do. I was just terrified.”",
                "Remember that time in LA on miami beach with the shooting when both thought the other side were palestinians",
                "Ah yes, the pro-first amendment right of...harassing a lady because of racism",
                "Not a single arrest has been made as far as I know. This country is a fucking shithole.",
                "They saw a lone woman and zeroed in on her. Shows them for what they are...women hating bastards.\n\nFortunately that cop did what he should do, protected her. Shame there weren't other cops to assist.",
                "Holy shit after all of that she was just an innocent bystander? Imagine if that cop wasn’t there.",
                "The fuck is going on over there?? \n\nIf jail time isn't in all their futures then something is deeply wrong.",
                "Now picture that happening the other way around. You´d never hear the end of it, and dozens of people would have been arrested by now.",
                "Remember when a violent pro-Israeli mob attacked UCLA student protesters with weapons, tear gas and fireworks while police just stood back for hours?  Nothing happened then either... well, Biden condemned the pro-Palestinian protesters the following day but that was it.\n\nIt's absolutely nuts how biased this shit is. If the roles were reversed, it would be called domestic terrorism and the national guard would be activated.",
                "What they engaged in is unequivocally terrorism. Mob behavior has no place in a civilized society."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Four killed when vehicle crashes into after-school program site in Illinois",
            "external_url": "https://www.nbcnews.com/news/us-news/chatham-illinois-camp-deadly-crash-rcna203426",
            "upvotes": 342,
            "date": "04/29/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250428-chatham-illinois-ac-807p-cd7c6c.jpg",
            "top_comments": [
                "Sounds to me like someone too old to drive. Could be intentional but I doubt it. \n\nI've noticed a recent uptick in old drivers getting extra scary to drive around.",
                "This was in my hometown…. Such a tight community. This breaks my heart.",
                "How many times do we have to be taught this lesson? We need more public transit in this country.",
                "Why are people, anyone, hurting children? What the actual fuck.\n\nEdit: even if a freak accident (from the wording of the article) it’s still fucked up. Poor families",
                "“Four people 4 to 18” four kids :(",
                "Report says the vehicle went through the wall on one side of the building and came out through the wall on the other side, sounds like a truck or a bus to me"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "RFK Jr. to End 'Godsend' Narcan Program That Helped Reduce Overdose Deaths Despite His Past Heroin Addiction",
            "external_url": "https://www.latintimes.com/rfk-jr-end-godsend-narcan-program-that-helped-reduce-overdose-deaths-despite-his-past-heroin-581846",
            "upvotes": 11676,
            "date": "04/28/2025",
            "thumbnail": "https://d.latintimes.com/en/full/575177/rfk-jrs-autism-study-use-millions-americans-medical-records.jpg",
            "top_comments": [
                ">Though Kennedy has previously praised interventions like Narcan as critical to saving lives, he now frames the crisis as one requiring deeper, spiritual and societal change rather than relying solely on “nuts and bolts” medical solutions.\n\n\nwhy have lifesaving medicine like narcan to help reduce overdose deaths when we can just not have that and rely solely on vibes instead?\n\nto be unmistakably clear - they hate you. they are reducing access to the single best weapon we have to treat overdose victims because they don’t want those people to live. if you are unfortunate enough to have lost someone you cared about to an opioid overdose, they want to make sure more people share your pain.\n\nwe are rapidly approaching the point where we need to have our own version of the nuremberg trials for this administration. every single one of them needs to rot in a cell or below one.",
                "Can't have those drug addicts getting autism.",
                "Ah yes the party of “I got mine, so screw you”",
                "absolute piece of shit garbage humanoid",
                "> Recent CDC data shows a nearly 24% drop in overdose deaths for the 12 months ending September 2024, the sharpest one-year decline in decades—an achievement partly attributed to widespread naloxone access.\n\nThat is a massive reduction in deaths. Imagine seeing that kind of positive data and still cutting funding.",
                "Yeah. The hallmark of modern republicans is the *open scorn* of empathy.",
                "Now would be a good time for RFK to pick up the heroin habit again.",
                "They're hardly making any pretenses anymore about the fact that they *want* people to die.\n\nIf you're not a healthy, god-fearing American, you're on your own. Good luck.",
                "Caroline Kennedy claims that RFK got his brother, 13 at the time, addicted to the heroin that killed him at 28.",
                "\"other countries are sending drugs over the border 😠💢\"\n\n\"let's fix it by ruining all amicable relations we have, doing nothing to address that demand is there for hard drugs, and kill the people who do drugs 😚✌️ live laugh love #god #maga\""
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "NEW",
            "title": "US Navy loses $60 million jet at sea after it fell overboard from aircraft carrier",
            "external_url": "https://www.cnn.com/2025/04/28/politics/us-navy-jet-overboard/index.html",
            "upvotes": 1550,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-8998056.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">A US official said that initial reports from the scene indicated that the Truman made a hard turn to evade Houthi fire, which contributed to the fighter jet falling overboard. The Houthi rebel group claimed on Monday to have launched a drone and missile attack on the aircraft carrier, which is in the Red Sea as part of the US military’s major anti-Houthi operation. \n\nIf a carrier is turning to avoid fire, something is seriously wrong with the battlegroup and the ships that are supposed to be screening. \n\nThis response sounds like BS.",
                ">\"The F/A-18E was actively under tow in the hangar bay when the move crew lost control of the aircraft. The aircraft and tow tractor were lost overboard,\" the statement said. \"Sailors towing the aircraft took immediate action to move clear of the aircraft before it fell overboard. An investigation is underway.\"\n\nFrom inside the ship? So it like tumbled all the way out of one of those big side doors?",
                "Did anybody check if Hegseth was somewhere near it at the time?",
                "The Department of Defense swore to, \"find the DEI hire responsible.\"",
                "Did they try putting it in rice?",
                "Welp, going to need to boot grandma from social security so they can buy two more.",
                "Did the jet even say thank you",
                "Whoops \n\nGlad to do my part with “defense” spending and national debt 💸",
                "\"The carrier made a hard turn to avoid Houthi fire.\"\n\n-\n\nLol",
                "Buried the lede:\n\n> Another F/A-18 from the Truman was also “mistakenly fired” upon and shot down by the USS Gettysburg in the Red Sea in December ; both pilots ejected safely."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Spain declares state of emergency after nationwide power blackout",
            "external_url": "https://www.reuters.com/world/europe/spain-declares-state-emergency-after-nationwide-power-blackout-2025-04-28/",
            "upvotes": 1808,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Madrid centre here. It was not dangerous, but here is what I observed:\n\n- In a matter of 3 hours, supermarkets where overwhelmed. They closed soon after.\n- You could not pay by credit card, only cash. Of course, withdrawing money from the bank was impossible.\n- Chinese convenience stores were the only ones open\n- Chinese utility stores (the kind that sell batteries and lanterns) where overwhelmed.\n- Everybody was on the streets talking about the blackout.\n- Tons of people stuck in elevators and public transport like subway for several hours\n- Cars could not be refilled, not even with gas\n- Bus overflowed\n- Traffic overwhelmed as traffic lights didnt work\n- Tons of people has to walk for hours home\n- People could not cook, as most people here use electric induction\n- Some people where on parks cooking everything other people bring them (as a solidary act)\n\n\nTook 10 hours to restore electricity here.\n\nIf this lasted for a week, I think it is reasonable to expect a much bigger chaos to the point of assaulting supermarkets and all that.\n\nI knew the system that we live in was fragile and people didnt understood. But the experience confirmed my thoughts 1000%.",
                "Just got our lights back at 22:15 in the northern part of Madrid. It was a weird day, but a bit uplifting if I'm being honest. Talked with neighbors I haven't really interacted with since the pandemic. Probably won't again until the next crisis, which is a bummer.",
                "We are fine in my zone (Basque country). Let see if Madrid remains calm.",
                "Have they go found the cause yet?",
                "Nation wide blackout!??! How does this happen?",
                "Has anyone checked on El Estepario? ",
                "It’s quite scary that the infrastructure of so many people, in multiple countries, can be so heavily hit like this. Hospitals, airports, trains. Whether it was an attack or something accidental, you’d really hope that this will be a major wake up call for the affected governments.",
                "Just super happy everyone remained civil. Have heard 0 reports of people starting to loot in either Portugal or Spain. No civil or security issues. Faith in humanity was partially restored.",
                "Pedro Sanchez just said that 60% of the power output dissapeared from the network in 6 seconds. No explanations yet.",
                "Im in Barcelona. My neighborhood (Nou Barris/Horta area; Vilipicina) has had power for about 3 hours. Almost everything is back to normal, except people panic shopped the neighborhood Mercadona and the shelves are COVID bare. It will probably be a week or so before it's fully stocked again. I know there is still work to be done in other parts of the country, but It seems like this is mostly over and was a non-event, really. Besides the people being stuck in the Metro or on the long distance trains."
            ],
            "aggregate_sentiment": 70.0
        },
        {
            "category": "NEW",
            "title": "Former Memphis officers were frustrated when they fatally beat Tyre Nichols, prosecutor says",
            "external_url": "https://www.opb.org/article/2025/04/28/former-memphis-officers-were-frustrated-when-they-fatally-beat-tyre-nichols-prosecutor-says/",
            "upvotes": 816,
            "date": "04/28/2025",
            "thumbnail": "https://opb-opb-prod.cdn.arcpublishing.com/resizer/v2/KH54EQNJC5E27HBRQKYL6WPASU.jpg?auth=a4e81017406253e04b2234a8c6c9b38e405214dfc24809544f1a8ef092453fb9&width=1200&height=675&smart=true",
            "top_comments": [
                "Oh, like you've never been upset and beaten a man to death with your coworkers. Get over yourselves.",
                "Okay. Cool. Sure I can accept that.\n\n.. It's not an excuse for murder though, so they still need to be found guilty and sentenced *like any other murderer who murdered.*",
                "Tyre only ran away after they pepper-sprayed him *and* tased him???!!!\n\nAnd that frustrated the cops so much that they took turns holding him and beating him.  \n**To death.** \nAs he called out for his mother.",
                "Poor babies, murder is ok then.",
                "Imagine how Tyre Nichols felt.",
                ">He said the officers had a duty to stop the beating but none of them did so. They were “overcome by the moment,” the prosecutor said.\n\nAh, yes. The \"overcome by the moment\" defense. The successor to the \"boy will be boys\" defense.",
                ">**Hagerman said Nichols was being held by his arms by two of the officers as he was punched and kicked and hit with a police baton**. After the beating, as a severely injured Nichols sat on the ground, officers failed to tell medical personnel that Nichols had been hit in the head, the prosecutor said.\n\n>“**Nobody is going to call them monsters**,” Hagerman said. “It doesn’t take monsters to kill a man.”\n\nNo... that sounds like monsters to me.",
                "I'm frustrated but if I beat a cop to death, I go to prison",
                "*Police Videos showed officers pepper-spraying Nichols and hitting him with a Taser before he ran away from the traffic stop on Jan. 7, 2023. The five officers, who are all Black, chased Nichols and caught him just steps from his home, and then beat him as he called out for his mother. The video showed the officers milling about, talking and laughing as Nichols struggled.*\n\nMaybe unnerved by Nichols' flight, but as guilty as sin",
                "I mean, when I get frustrated I just have a beer and play some BG3 or something, but I guess that works too."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "ICE: ‘First-of-its-kind’ operation with local law enforcement leads to nearly 800 immigrant arrests in Florida | CNN",
            "external_url": "https://www.cnn.com/2025/04/27/us/ice-operation-first-of-its-kind-florida-hnk/index.html",
            "upvotes": 6060,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gpd8gotx0aapnmi.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Were any of them citizens or otherwise illegally arrested? Are they going to get treated to full, legal due process?",
                "Hey, remember when the US invaded Iraq and then locals were like, \"OMG DAT DOOD A TERRORIST!\" and later they found out many of them were just neighbors who didn't like them and wanted them gone. I'm sure this isn't anything like that...",
                "I'm sure that includes the CEO's in chicken plants or wherever else who hire them, right? Right?",
                "Bolstering stats before the 100th day in office tomorrow",
                "When we get to the end of this, and the vast majority of the illegal immigrants have been found, and none of the problems the US is facing have been fixed\n\nWhat then?\n\nWill they realize that corporate and individual greed is damning america much more significantly than any immigration issues\n\nOr will they then turn to immigrant citizens and blame them. How many taxpayers need to be victimized before it starts to click that the corporate tax evasion is the bigger drain on society",
                "Ever read Ordinary Men: Reserve Police Battalion 101 and the Final Solution in Poland  by Christopher Browning?\n\n>\n\n>*Ordinary Men* is the true story of Reserve Police Battalion 101 of the German Order Police, which was responsible for mass shootings as well as round-ups of Jewish people for deportation to Nazi death camps in Poland in 1942. Browning argues that most of the men of  RPB 101 were not fanatical Nazis but, rather, ordinary middle-aged, working-class men who committed these atrocities out of a mixture of motives, including the group dynamics of conformity, deference to authority, role adaptation, and the altering of moral norms to justify their actions. Very quickly three groups emerged within the battalion: a core of eager killers, a plurality who carried out their duties reliably but without initiative, and a small minority who evaded participation in the acts of killing without diminishing the murderous efficiency of the battalion whatsoever.\n\n>While this book discusses a specific Reserve Unit during WWII, the general argument Browning makes is that most people succumb to the pressures of a group setting and commit actions they would never do of their own volition.  \n\n>*Ordinary Men* is a powerful, chilling, and important work with themes and arguments that continue to resonate today. \n\n\n\n\n\n\n\nToday, Orpo must stand for Orlando Police",
                "That's a lot, did they raid Mar-a-Lago or something?",
                "I’m sure MAGA will be lining up to take their jobs as farm and construction workers",
                "Even putting aside how gross and immoral Trump’s immigration policies are, this is also evidence as to why it’s ineffective on top of it. One of the reasons he’s been targeting asylum seekers, Visa holders and students is that they’re the easiest ones to track. Even with everyone working together to grab undocumented immigrants, 800 is the best they can do because it’s so much more logistically difficult to find and target them.",
                "It wasn't first of it's kind, 1930s Germany did it first!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Final autopsy results on Gene Hackman and his wife, Betsy Arakawa, reveal complex health issues",
            "external_url": "https://www.theguardian.com/film/2025/apr/28/gene-hackman-betsy-arakawa-final-autopsy-results-complex-health-issues",
            "upvotes": 2584,
            "date": "04/28/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6867ae97d295517c95c9356f3e449292ddd146c2/0_129_1442_865/master/1442.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b23f6ffddf97fab838e068e65ad596f2",
            "top_comments": [
                "Nobody plans for dementia. My elderly neighbor scared my husband to death when he found her on our front porch staring through the window in the early days of the COVID lockdown. She thought her husband, who had dementia, was trying to kill her and she “escaped” through a window and crawled through the snow to our home. When I first met them a couple of years earlier they were articulate and friendly folks who seemed wealthy and I might add somewhat narcissistic. \n\nThe smell of their house was nauseating. Their dog was a filthy matted mess who looked more like a rescue off of the streets. He had pooped and peed all over the house and there were mouse droppings in their fridge. It was heart breaking and made me realize that we have to plan early before oor minds and bodies leave us in a vulnerable position. ",
                "The idea that he does not realize she has died because of his dementia breaks my heart",
                "*Further police investigations of their grounds discovered widespread evidence of rodent infestation. Meanwhile, recently released body cam footage of the local police department’s first visit to the property suggested the couple may have struggled to keep their home under control, while a discarded plaster indicated Arakawa might have been bitten by a rodent.*\n\nThis is surprising, given their fame and financial status. I also wonder why Arakawa, given her role as Gene's medical aid, didn't call 911 when she was very sick, knowing that Gene couldn't function without her.",
                "This story is heartbreaking.",
                "I find [this article ](https://theonion.com/even-investigators-not-sure-why-they-keep-releasing-details-of-gene-hackmans-death/) more  relevant every time more information is released.",
                "I'm OK with privacy and wanting to save money.\n\nBut if I'm old, got Gene's money, and medical issues?\n\nI'm having a nurse stop by daily. FUCKING DAILY. Take my blood preasure. Count my pills. Whatever. Just check on me, and deal with shit if things don't seem right.\n\nHeck, there's a great argument to be made for round the clock nursing team living right next door with a \"my tummy hurts\" button to call for help.",
                "The fact that I got an Orkin Pest Control ad in the middle of the comments section is fucking gross.",
                "This is why I now call my mother weekly to reassure her that i know she's alive.",
                "This is the worst story.",
                "You would think with Hackman being such a big star they would have had caregivers in place. Or at least someone checking up on them."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "DOGE employees gain accounts on classified networks holding nuclear secrets",
            "external_url": "https://www.npr.org/2025/04/28/nx-s1-5378684/doge-energy-department-nuclear-secrets-access",
            "upvotes": 18038,
            "date": "04/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2400x1350+0+181/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff7%2F4e%2F1cc1562d471699f983bee6280ccf%2F49640296323-792e9026c5-o.jpg",
            "top_comments": [
                "Just a reminder that the person ultimately responsible here is not Musk - it's Trump.\n\nIt's through Musk's 250 million to Trump, executive powers, and bullying congress - that DOGE happened.\n\nBOTH are responsible for the fiasco. Don't even get me started on the literal AI powered privacy-raping nightmare they are building in Memphis called Colossus - built on our stolen private data.",
                "Remember how Republicans screamed 'LOCK HER UP' for years and years and years - because Hillary used a private server for encrypted email?",
                "Remember when the consequence for this was being sent to Federal, pound-you-in-the-ass Prison.\n\nSucks that we elected a convict who is so weak he cannot even prevent the crimes going on right under his nose.",
                "Someone is giving them access to all of these systems. Like they can’t just gain access. Someone is giving it to them.",
                "Not great.\n\n> Luke Farritor, a 23-year-old former SpaceX intern and Adam Ramada, a Miami-based venture capitalist, have had accounts on the computer systems for at least two weeks, according to the sources who also have access to the networks. Prior to their work at DOGE, neither Farritor nor Ramada appear to have had experience with either nuclear weapons or handling classified information.",
                "\"Russia gains accounts on classified networks holding nuclear secrets\"",
                "Well it won't be long until these aren't secrets anymore I'm sure.",
                "\"It was Elon's thing. I never knew about it.\"\n\n-DJT at the onset of global thermonuclear war",
                "I swear Musk would fire a nuke just see what happens.",
                "So we can assume that russia has them too, now"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Temu customers in the U.S. hit with steep import charges due to tariffs",
            "external_url": "https://www.nbcnews.com/business/business-news/temu-adds-import-charge-to-orders-trump-tariffs-how-much-rcna203279",
            "upvotes": 3294,
            "date": "04/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250428-temu-app-se-927a-8efad9.jpg",
            "top_comments": [
                "Showing it as an additional line item instead of a price increase is perfect. Shows the consumer WHY it's more expensive and avoids the reality that anyone who increases their price will not lower it if the tariffs are canceled. Inflation will get really bad if retailers just roll the tariff into the retail price.",
                "[It's almost like the thing everyone predicted would happen, happened exactly as predicted.](https://www.washingtonpost.com/business/2023/08/22/trump-trade-tariffs/)",
                "This is unironically going to be where the most impact is for a lot of the MAGA types. My most die hard Trumpist family members all buy their shit off Temu.",
                "Between temu, shein and others, so may youtube channels are suddenly fucked.",
                "\"Shop like a billionaire\" suddenly got a whole different meaning.",
                "I wonder if the tariff tax is happening on SHEIN too? That’ll ruffle some feathers",
                "Temu will be the least of our problems as the economic crisis intensifies.",
                "It's ok. They tell me that the tariff revenue rolling in from products people can no longer afford to buy will replace the income tax",
                "You shouldn't be buying cheap garbage from Temu anyway.  Now you can buy expensive garbage from Temu to pay for billionaire's tax cuts.  Thanks Trump?",
                "Why would Joe Biden do this?!?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Fired Disney employee gets 3 years in prison for hacking and changing menus",
            "external_url": "https://www.ctvnews.ca/world/article/fired-disney-employee-gets-3-years-in-prison-for-hacking-and-changing-menus/",
            "upvotes": 3065,
            "date": "04/28/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/QPQ5PUNPPREEVD2MOCJTUA6D3I.JPG?smart=true&auth=89fb147e1a6f29198705ff74a468e89e29a1845510f4182eddfe4bd610a9777d&width=1200&height=630",
            "top_comments": [
                ">Scheuer hacked into Disney’s menu creation servers multiple times to manipulate and disrupt the menus, such as changing prices and adding profane language. He then made changes to the menus that “threatened public health and safety,” the complaint said, including altering allergen information to indicate certain menu items with peanuts were peanut-free, posing a fatal risk to individuals with peanut allergies.\n\nThis dude sounds like a massive edgelord.",
                "I thought that 3 years was probably way out of proportion to what was done. Then I saw that they were removing allergen information, which could potentially kill people. So yeah, fuck this guy.",
                "The price changing & general digital vandalism doesn’t seem that bad, but changing the allergens is just cruel (and certainly prison-worthy)",
                "Fucking with the megacorp, bring it on.\n\nFucking with the small people who need their jobs there, massive shit move.\n\nAltering allergen information that could cost people their lives, fuck that guy.",
                "Buzzed for Lightyears Grain Alcohol Cocktail.\n\n  \nBut seriously, don't ever screw around with allergens - dead kids don't wash away, ever.",
                "I thought this was gonna be a prank, but the guy altered allergen information, specifically marking items as peanut free that weren't. This is serious stuff.\n\nPlus aggravated identity theft?\n\nThis guy is dangerous.",
                "He could've killed someone with the allergen stunt. Give him ten years",
                "Given the size of the disney restaurant traffic, it is almost for sure that he would have killed someone just based on peanut allergy alone.\n\nHe is lucky that no one is hurt (because disney stopped this in time) and they did not charge him with attempted murder.",
                "What did they hope to gain from this?",
                "I've never considered giving someone pain of inconvenience by making intentionally false login attempts on their accounts.\n\nLook, I'm normally not that kind of person, but once in a while something comes up and that might be the exact level of petty I need."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "RFK Jr. to End 'Godsend' Narcan Program That Helped Reduce Overdose Deaths Despite His Past Heroin Addiction",
            "external_url": "https://www.latintimes.com/rfk-jr-end-godsend-narcan-program-that-helped-reduce-overdose-deaths-despite-his-past-heroin-581846",
            "upvotes": 11632,
            "date": "04/28/2025",
            "thumbnail": "https://d.latintimes.com/en/full/575177/rfk-jrs-autism-study-use-millions-americans-medical-records.jpg",
            "top_comments": [
                ">Though Kennedy has previously praised interventions like Narcan as critical to saving lives, he now frames the crisis as one requiring deeper, spiritual and societal change rather than relying solely on “nuts and bolts” medical solutions.\n\n\nwhy have lifesaving medicine like narcan to help reduce overdose deaths when we can just not have that and rely solely on vibes instead?\n\nto be unmistakably clear - they hate you. they are reducing access to the single best weapon we have to treat overdose victims because they don’t want those people to live. if you are unfortunate enough to have lost someone you cared about to an opioid overdose, they want to make sure more people share your pain.\n\nwe are rapidly approaching the point where we need to have our own version of the nuremberg trials for this administration. every single one of them needs to rot in a cell or below one.",
                "Can't have those drug addicts getting autism.",
                "Ah yes the party of “I got mine, so screw you”",
                "absolute piece of shit garbage humanoid",
                "> Recent CDC data shows a nearly 24% drop in overdose deaths for the 12 months ending September 2024, the sharpest one-year decline in decades—an achievement partly attributed to widespread naloxone access.\n\nThat is a massive reduction in deaths. Imagine seeing that kind of positive data and still cutting funding.",
                "Yeah. The hallmark of modern republicans is the *open scorn* of empathy.",
                "Now would be a good time for RFK to pick up the heroin habit again.",
                "They're hardly making any pretenses anymore about the fact that they *want* people to die.\n\nIf you're not a healthy, god-fearing American, you're on your own. Good luck.",
                "Caroline Kennedy claims that RFK got his brother, 13 at the time, addicted to the heroin that killed him at 28.",
                "\"other countries are sending drugs over the border 😠💢\"\n\n\"let's fix it by ruining all amicable relations we have, doing nothing to address that demand is there for hard drugs, and kill the people who do drugs 😚✌️ live laugh love #god #maga\""
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Four killed when vehicle crashes into after-school program site in Illinois",
            "external_url": "https://www.nbcnews.com/news/us-news/chatham-illinois-camp-deadly-crash-rcna203426",
            "upvotes": 343,
            "date": "04/29/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250428-chatham-illinois-ac-807p-cd7c6c.jpg",
            "top_comments": [
                "Sounds to me like someone too old to drive. Could be intentional but I doubt it. \n\nI've noticed a recent uptick in old drivers getting extra scary to drive around.",
                "This was in my hometown…. Such a tight community. This breaks my heart.",
                "How many times do we have to be taught this lesson? We need more public transit in this country.",
                "Why are people, anyone, hurting children? What the actual fuck.\n\nEdit: even if a freak accident (from the wording of the article) it’s still fucked up. Poor families",
                "“Four people 4 to 18” four kids :(",
                "Report says the vehicle went through the wall on one side of the building and came out through the wall on the other side, sounds like a truck or a bus to me"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Spain declares state of emergency after nationwide power blackout",
            "external_url": "https://www.reuters.com/world/europe/spain-declares-state-emergency-after-nationwide-power-blackout-2025-04-28/",
            "upvotes": 1808,
            "date": "04/28/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Madrid centre here. It was not dangerous, but here is what I observed:\n\n- In a matter of 3 hours, supermarkets where overwhelmed. They closed soon after.\n- You could not pay by credit card, only cash. Of course, withdrawing money from the bank was impossible.\n- Chinese convenience stores were the only ones open\n- Chinese utility stores (the kind that sell batteries and lanterns) where overwhelmed.\n- Everybody was on the streets talking about the blackout.\n- Tons of people stuck in elevators and public transport like subway for several hours\n- Cars could not be refilled, not even with gas\n- Bus overflowed\n- Traffic overwhelmed as traffic lights didnt work\n- Tons of people has to walk for hours home\n- People could not cook, as most people here use electric induction\n- Some people where on parks cooking everything other people bring them (as a solidary act)\n\n\nTook 10 hours to restore electricity here.\n\nIf this lasted for a week, I think it is reasonable to expect a much bigger chaos to the point of assaulting supermarkets and all that.\n\nI knew the system that we live in was fragile and people didnt understood. But the experience confirmed my thoughts 1000%.",
                "Just got our lights back at 22:15 in the northern part of Madrid. It was a weird day, but a bit uplifting if I'm being honest. Talked with neighbors I haven't really interacted with since the pandemic. Probably won't again until the next crisis, which is a bummer.",
                "We are fine in my zone (Basque country). Let see if Madrid remains calm.",
                "Have they go found the cause yet?",
                "Nation wide blackout!??! How does this happen?",
                "Has anyone checked on El Estepario? ",
                "It’s quite scary that the infrastructure of so many people, in multiple countries, can be so heavily hit like this. Hospitals, airports, trains. Whether it was an attack or something accidental, you’d really hope that this will be a major wake up call for the affected governments.",
                "Just super happy everyone remained civil. Have heard 0 reports of people starting to loot in either Portugal or Spain. No civil or security issues. Faith in humanity was partially restored.",
                "Pedro Sanchez just said that 60% of the power output dissapeared from the network in 6 seconds. No explanations yet.",
                "Im in Barcelona. My neighborhood (Nou Barris/Horta area; Vilipicina) has had power for about 3 hours. Almost everything is back to normal, except people panic shopped the neighborhood Mercadona and the shelves are COVID bare. It will probably be a week or so before it's fully stocked again. I know there is still work to be done in other parts of the country, but It seems like this is mostly over and was a non-event, really. Besides the people being stuck in the Metro or on the long distance trains."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "US Navy loses $60 million jet at sea after it fell overboard from aircraft carrier",
            "external_url": "https://www.cnn.com/2025/04/28/politics/us-navy-jet-overboard/index.html",
            "upvotes": 1548,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-8998056.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">A US official said that initial reports from the scene indicated that the Truman made a hard turn to evade Houthi fire, which contributed to the fighter jet falling overboard. The Houthi rebel group claimed on Monday to have launched a drone and missile attack on the aircraft carrier, which is in the Red Sea as part of the US military’s major anti-Houthi operation. \n\nIf a carrier is turning to avoid fire, something is seriously wrong with the battlegroup and the ships that are supposed to be screening. \n\nThis response sounds like BS.",
                ">\"The F/A-18E was actively under tow in the hangar bay when the move crew lost control of the aircraft. The aircraft and tow tractor were lost overboard,\" the statement said. \"Sailors towing the aircraft took immediate action to move clear of the aircraft before it fell overboard. An investigation is underway.\"\n\nFrom inside the ship? So it like tumbled all the way out of one of those big side doors?",
                "Did anybody check if Hegseth was somewhere near it at the time?",
                "The Department of Defense swore to, \"find the DEI hire responsible.\"",
                "Did they try putting it in rice?",
                "Welp, going to need to boot grandma from social security so they can buy two more.",
                "Did the jet even say thank you",
                "Whoops \n\nGlad to do my part with “defense” spending and national debt 💸",
                "\"The carrier made a hard turn to avoid Houthi fire.\"\n\n-\n\nLol",
                "Buried the lede:\n\n> Another F/A-18 from the Truman was also “mistakenly fired” upon and shot down by the USS Gettysburg in the Red Sea in December ; both pilots ejected safely."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "ICE: ‘First-of-its-kind’ operation with local law enforcement leads to nearly 800 immigrant arrests in Florida | CNN",
            "external_url": "https://www.cnn.com/2025/04/27/us/ice-operation-first-of-its-kind-florida-hnk/index.html",
            "upvotes": 6061,
            "date": "04/28/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gpd8gotx0aapnmi.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Were any of them citizens or otherwise illegally arrested? Are they going to get treated to full, legal due process?",
                "Hey, remember when the US invaded Iraq and then locals were like, \"OMG DAT DOOD A TERRORIST!\" and later they found out many of them were just neighbors who didn't like them and wanted them gone. I'm sure this isn't anything like that...",
                "I'm sure that includes the CEO's in chicken plants or wherever else who hire them, right? Right?",
                "Bolstering stats before the 100th day in office tomorrow",
                "When we get to the end of this, and the vast majority of the illegal immigrants have been found, and none of the problems the US is facing have been fixed\n\nWhat then?\n\nWill they realize that corporate and individual greed is damning america much more significantly than any immigration issues\n\nOr will they then turn to immigrant citizens and blame them. How many taxpayers need to be victimized before it starts to click that the corporate tax evasion is the bigger drain on society",
                "Ever read Ordinary Men: Reserve Police Battalion 101 and the Final Solution in Poland  by Christopher Browning?\n\n>\n\n>*Ordinary Men* is the true story of Reserve Police Battalion 101 of the German Order Police, which was responsible for mass shootings as well as round-ups of Jewish people for deportation to Nazi death camps in Poland in 1942. Browning argues that most of the men of  RPB 101 were not fanatical Nazis but, rather, ordinary middle-aged, working-class men who committed these atrocities out of a mixture of motives, including the group dynamics of conformity, deference to authority, role adaptation, and the altering of moral norms to justify their actions. Very quickly three groups emerged within the battalion: a core of eager killers, a plurality who carried out their duties reliably but without initiative, and a small minority who evaded participation in the acts of killing without diminishing the murderous efficiency of the battalion whatsoever.\n\n>While this book discusses a specific Reserve Unit during WWII, the general argument Browning makes is that most people succumb to the pressures of a group setting and commit actions they would never do of their own volition.  \n\n>*Ordinary Men* is a powerful, chilling, and important work with themes and arguments that continue to resonate today. \n\n\n\n\n\n\n\nToday, Orpo must stand for Orlando Police",
                "That's a lot, did they raid Mar-a-Lago or something?",
                "I’m sure MAGA will be lining up to take their jobs as farm and construction workers",
                "Even putting aside how gross and immoral Trump’s immigration policies are, this is also evidence as to why it’s ineffective on top of it. One of the reasons he’s been targeting asylum seekers, Visa holders and students is that they’re the easiest ones to track. Even with everyone working together to grab undocumented immigrants, 800 is the best they can do because it’s so much more logistically difficult to find and target them.",
                "It wasn't first of it's kind, 1930s Germany did it first!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "DOGE employees gain accounts on classified networks holding nuclear secrets",
            "external_url": "https://www.npr.org/2025/04/28/nx-s1-5378684/doge-energy-department-nuclear-secrets-access",
            "upvotes": 18043,
            "date": "04/28/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2400x1350+0+181/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff7%2F4e%2F1cc1562d471699f983bee6280ccf%2F49640296323-792e9026c5-o.jpg",
            "top_comments": [
                "Just a reminder that the person ultimately responsible here is not Musk - it's Trump.\n\nIt's through Musk's 250 million to Trump, executive powers, and bullying congress - that DOGE happened.\n\nBOTH are responsible for the fiasco. Don't even get me started on the literal AI powered privacy-raping nightmare they are building in Memphis called Colossus - built on our stolen private data.",
                "Remember how Republicans screamed 'LOCK HER UP' for years and years and years - because Hillary used a private server for encrypted email?",
                "Remember when the consequence for this was being sent to Federal, pound-you-in-the-ass Prison.\n\nSucks that we elected a convict who is so weak he cannot even prevent the crimes going on right under his nose.",
                "Someone is giving them access to all of these systems. Like they can’t just gain access. Someone is giving it to them.",
                "Not great.\n\n> Luke Farritor, a 23-year-old former SpaceX intern and Adam Ramada, a Miami-based venture capitalist, have had accounts on the computer systems for at least two weeks, according to the sources who also have access to the networks. Prior to their work at DOGE, neither Farritor nor Ramada appear to have had experience with either nuclear weapons or handling classified information.",
                "\"Russia gains accounts on classified networks holding nuclear secrets\"",
                "Well it won't be long until these aren't secrets anymore I'm sure.",
                "\"It was Elon's thing. I never knew about it.\"\n\n-DJT at the onset of global thermonuclear war",
                "I swear Musk would fire a nuke just see what happens.",
                "So we can assume that russia has them too, now"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Temu customers in the U.S. hit with steep import charges due to tariffs",
            "external_url": "https://www.nbcnews.com/business/business-news/temu-adds-import-charge-to-orders-trump-tariffs-how-much-rcna203279",
            "upvotes": 3290,
            "date": "04/28/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250428-temu-app-se-927a-8efad9.jpg",
            "top_comments": [
                "Showing it as an additional line item instead of a price increase is perfect. Shows the consumer WHY it's more expensive and avoids the reality that anyone who increases their price will not lower it if the tariffs are canceled. Inflation will get really bad if retailers just roll the tariff into the retail price.",
                "[It's almost like the thing everyone predicted would happen, happened exactly as predicted.](https://www.washingtonpost.com/business/2023/08/22/trump-trade-tariffs/)",
                "This is unironically going to be where the most impact is for a lot of the MAGA types. My most die hard Trumpist family members all buy their shit off Temu.",
                "Between temu, shein and others, so may youtube channels are suddenly fucked.",
                "\"Shop like a billionaire\" suddenly got a whole different meaning.",
                "I wonder if the tariff tax is happening on SHEIN too? That’ll ruffle some feathers",
                "Temu will be the least of our problems as the economic crisis intensifies.",
                "It's ok. They tell me that the tariff revenue rolling in from products people can no longer afford to buy will replace the income tax",
                "You shouldn't be buying cheap garbage from Temu anyway.  Now you can buy expensive garbage from Temu to pay for billionaire's tax cuts.  Thanks Trump?",
                "Why would Joe Biden do this?!?"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Former Memphis officers were frustrated when they fatally beat Tyre Nichols, prosecutor says",
            "external_url": "https://www.opb.org/article/2025/04/28/former-memphis-officers-were-frustrated-when-they-fatally-beat-tyre-nichols-prosecutor-says/",
            "upvotes": 813,
            "date": "04/28/2025",
            "thumbnail": "https://opb-opb-prod.cdn.arcpublishing.com/resizer/v2/KH54EQNJC5E27HBRQKYL6WPASU.jpg?auth=a4e81017406253e04b2234a8c6c9b38e405214dfc24809544f1a8ef092453fb9&width=1200&height=675&smart=true",
            "top_comments": [
                "Oh, like you've never been upset and beaten a man to death with your coworkers. Get over yourselves.",
                "Okay. Cool. Sure I can accept that.\n\n.. It's not an excuse for murder though, so they still need to be found guilty and sentenced *like any other murderer who murdered.*",
                "Tyre only ran away after they pepper-sprayed him *and* tased him???!!!\n\nAnd that frustrated the cops so much that they took turns holding him and beating him.  \n**To death.** \nAs he called out for his mother.",
                "Poor babies, murder is ok then.",
                "Imagine how Tyre Nichols felt.",
                ">He said the officers had a duty to stop the beating but none of them did so. They were “overcome by the moment,” the prosecutor said.\n\nAh, yes. The \"overcome by the moment\" defense. The successor to the \"boy will be boys\" defense.",
                ">**Hagerman said Nichols was being held by his arms by two of the officers as he was punched and kicked and hit with a police baton**. After the beating, as a severely injured Nichols sat on the ground, officers failed to tell medical personnel that Nichols had been hit in the head, the prosecutor said.\n\n>“**Nobody is going to call them monsters**,” Hagerman said. “It doesn’t take monsters to kill a man.”\n\nNo... that sounds like monsters to me.",
                "I'm frustrated but if I beat a cop to death, I go to prison",
                "*Police Videos showed officers pepper-spraying Nichols and hitting him with a Taser before he ran away from the traffic stop on Jan. 7, 2023. The five officers, who are all Black, chased Nichols and caught him just steps from his home, and then beat him as he called out for his mother. The video showed the officers milling about, talking and laughing as Nichols struggled.*\n\nMaybe unnerved by Nichols' flight, but as guilty as sin",
                "I mean, when I get frustrated I just have a beer and play some BG3 or something, but I guess that works too."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "All Joann Fabric and Craft store locations to close by end of May",
            "external_url": "https://www.live5news.com/2025/04/28/all-joann-fabric-craft-store-locations-close-by-end-may/",
            "upvotes": 3381,
            "date": "04/28/2025",
            "thumbnail": "https://gray-wcsc-prod.gtv-cdn.com/resizer/v2/XK46E4Z7JZE4ZKDB3NCY4BZIZA.jpg?auth=9d580f4daf716e14a5c7f9f6fbe3aaa51561aba9e16d90e63e3dcde6b189560f&width=1200&height=600&smart=true",
            "top_comments": [
                "Private equity ruins yet another business.",
                "Bye Joann's, you were my go to fabric and notions store. Now where am I supposed to go?",
                "Man, I used to enjoy going there with my mom.",
                "Reading they got Toys R Us’ed. Bought specifically so they can be bankrupted and their assets sold off.",
                "When billionaires destroy to create monopoly everything comes from Amazon.",
                "Their going out of business prices were worse then some stores normal prices",
                "Private equity firms are fucking monsters.",
                "My wife was waiting for prices to go down on sewing patterns at our local store. Patterns were listed at $20 to $30 each, and then they were brought down to about $10 each. She felt that that was still too high considering that the store was shutting down. And so she waited to see if they would bring it down further. \n\nInstead, the store dumped all the patterns into a recycling bin.\n\nI am sure that they were contractually obligated to do this. This was not a case of the store just being spiteful or wasteful.",
                "Are there any craft stores that aren’t super Christian now?",
                "There was no reason for the store near me to close... it always had foot traffic. If was our go-to for any and all kids school projects, Halloween costume stuff, etc etc. the parking lot was never empty. It's just insane that venture capitalism is legal."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Final autopsy results on Gene Hackman and his wife, Betsy Arakawa, reveal complex health issues",
            "external_url": "https://www.theguardian.com/film/2025/apr/28/gene-hackman-betsy-arakawa-final-autopsy-results-complex-health-issues",
            "upvotes": 2582,
            "date": "04/28/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6867ae97d295517c95c9356f3e449292ddd146c2/0_129_1442_865/master/1442.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b23f6ffddf97fab838e068e65ad596f2",
            "top_comments": [
                "Nobody plans for dementia. My elderly neighbor scared my husband to death when he found her on our front porch staring through the window in the early days of the COVID lockdown. She thought her husband, who had dementia, was trying to kill her and she “escaped” through a window and crawled through the snow to our home. When I first met them a couple of years earlier they were articulate and friendly folks who seemed wealthy and I might add somewhat narcissistic. \n\nThe smell of their house was nauseating. Their dog was a filthy matted mess who looked more like a rescue off of the streets. He had pooped and peed all over the house and there were mouse droppings in their fridge. It was heart breaking and made me realize that we have to plan early before oor minds and bodies leave us in a vulnerable position. ",
                "The idea that he does not realize she has died because of his dementia breaks my heart",
                "*Further police investigations of their grounds discovered widespread evidence of rodent infestation. Meanwhile, recently released body cam footage of the local police department’s first visit to the property suggested the couple may have struggled to keep their home under control, while a discarded plaster indicated Arakawa might have been bitten by a rodent.*\n\nThis is surprising, given their fame and financial status. I also wonder why Arakawa, given her role as Gene's medical aid, didn't call 911 when she was very sick, knowing that Gene couldn't function without her.",
                "This story is heartbreaking.",
                "I find [this article ](https://theonion.com/even-investigators-not-sure-why-they-keep-releasing-details-of-gene-hackmans-death/) more  relevant every time more information is released.",
                "I'm OK with privacy and wanting to save money.\n\nBut if I'm old, got Gene's money, and medical issues?\n\nI'm having a nurse stop by daily. FUCKING DAILY. Take my blood preasure. Count my pills. Whatever. Just check on me, and deal with shit if things don't seem right.\n\nHeck, there's a great argument to be made for round the clock nursing team living right next door with a \"my tummy hurts\" button to call for help.",
                "The fact that I got an Orkin Pest Control ad in the middle of the comments section is fucking gross.",
                "This is why I now call my mother weekly to reassure her that i know she's alive.",
                "This is the worst story.",
                "You would think with Hackman being such a big star they would have had caregivers in place. Or at least someone checking up on them."
            ],
            "aggregate_sentiment": 5.0
        }
    ],
    "last_updated": "04/29/2025 00:42:39 UTC"
}