{
    "posts": [
        {
            "category": "HOT",
            "title": "Elon Musk's X to clamp down on parody accounts",
            "external_url": "https://www.bbc.com/news/articles/c4g37elkrxdo",
            "upvotes": 13614,
            "date": "04/07/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e94a/live/b7740ce0-139b-11f0-b054-11b99aeb4b3e.jpg",
            "top_comments": [
                "Is he making comedy illegal on X?",
                "If only there was some checkmark system which could be used to see if an account is real or parody.",
                "What happened to “legalize comedy”?",
                "The bastion of free speech and open comedy. Why would anyone still use X",
                "Free speech absolutists are always just right wing chuds screaming about censorship until they are in control",
                "Freedom of speech? More like parody of freedom.",
                "Remember when Elon Musk called himself a \"free speech absolutist\" and some people actually believed him?",
                "\"Free Speech Absolutist\" indeed...\n\nGentle reminder:\n\n#ELON FUCKS GOATS",
                "Stop using X.   He doesn’t have to allow free speech on his private platform.  Boycott everything Musk.",
                "thought there was war against comedy mr elon ?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "US sidelines DOJ lawyer involved in deportation case, which judge calls 'wholly lawless'",
            "external_url": "https://www.reuters.com/world/us/us-sidelines-doj-lawyer-after-judge-orders-return-man-deported-erroneously-2025-04-06/",
            "upvotes": 5645,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The whole administration is lawless.",
                "Send Marco Rubio to El Salvador to rescue Garcia. He's secretary of state.",
                "Trump is testing the checks and balances of democracy…….Pam bondi is absolute SCUM",
                "Let's not forget what's at stake considering the absolutely horrific conditions at the mega prison they're sending legally protected people to, and now of course floating the idea of sending American citizens there too. https://youtu.be/WMUbrG7eJbY",
                "Lawyer truthfully responded to a question from the judge.\nNow he's been removed by the Trump DOJ.\n\n> Reuveni said he had raised questions with U.S. officials about why the federal government could not bring back Abrego Garcia but had received no \"satisfactory\" answer. He acknowledged what he called an \"absence of evidence\" justifying Abrego Garcia's detention and deportation.",
                "She should be in jail.",
                "Pam Bondi can run the case then and we can watch her unqualified ass fail to push the Trump bullshit through the courts in person.",
                "You didn’t lie or manipulate hard enough, you failed to be as big of an asshole and douchebag as is required to be associated with this administration, you’re fired.",
                "He wasn’t sycophant enough..",
                "DOJ is going to run out of attorneys pretty quick at this rate."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "U.S. sent 238 migrants to Salvadoran mega-prison; documents indicate most have no apparent criminal records",
            "external_url": "https://www.cbsnews.com/news/what-records-show-about-migrants-sent-to-salvadoran-prison-60-minutes-transcript/",
            "upvotes": 34427,
            "date": "04/07/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/06/3b1e09e0-d953-4d74-b1bc-7c3e37d31442/thumbnail/1200x630/fd149fa128df9273bc0e471b42d3f4f0/gettyimages-2205557653.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "We knew this - and then administration actually stated that the lack of a criminal record was itself evidence of how dangerous they were.\n\nEta: [ICE official in March saying this](https://www.google.com/amp/s/abcnews.go.com/amp/US/noncitizens-deported-alien-enemies-act-criminal-records-ice/story%3fid=119912375)",
                "> Among them: a makeup artist, a soccer player and a food delivery driver, being held in a place so harsh that El Salvador's justice minister once said the only way out is in a coffin.\n\nReading this article was so sad. Imagine coming to claim asylum, being told you have a valid claim, then vanishing before your court case. Only for photos of you to surface being dragged into a prison that is hell on earth.",
                "In any normal and sane society, this would be grounds for impeachment. I still can’t comprehend that THIS is the world we’re currently living in.",
                "60 minutes segment on this aired last night (as talked about in the article), highly recommend finding it on YouTube if you can. It’s terrifying.",
                "But MAGA said it was only violent criminals? No surprise, Trump is trying to send a racist message to all immigrants by imprisoning them and throwing them in harsh conditions. Next, MAGA is gonna be convincing us why people who come here for a better life deserve to go die in a concentration camp",
                "I find this so incredibly sad. I saw a picture of rows of the deportees sat in the prison, heads shaved just vacantly looking into the distance, because at that point you know you’re never getting out. They didn’t send them there to process their claims or hold them to then deport its far far more sinister. It’s really scary and horrible and I can’t believe they can get away with this.",
                "Even if you support deportation, it doesn't make sense to use money to deport these people specifically to a third country and have them imprisoned. It's inhumane and a waste of money. \n\nWe have due process of law. These people should've had/deserve a day in court, then through litigation, a determination could have been made whether or not they could stay legitimately. \n\nAmericans should be worried about the creeping erosion of our rights and civil liberties.",
                "First it was remove all criminals, and then it was being here without papers was criminal. Moving the goal posts. Being undocumented in the US is a civil offense, not a criminal offense. Everyone should be concerned when there is no due process.",
                "Maga morons will still say they deserve it until it happens to somebody they know",
                "This needs to end. Where is congress? They should be putting the brakes on this president.Nearly everything he does is illegal."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Sailor killed in Pearl Harbor attack finally ID'd 84 years later, bringing closure to family",
            "external_url": "https://www.nbcnews.com/news/us-news/sailor-killed-pearl-harbor-attack-finally-idd-84-years-later-bringing-rcna199986",
            "upvotes": 2574,
            "date": "04/07/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250407-Neil-D-Frye-ew-1128a-c15aa1.jpg",
            "top_comments": [
                "“My mom used to say she loved to people watch,” McCrimmon told WHRO. “She would go anywhere she could get a chance to go to a little town and just watch all the men go by to see if she could see Neil.” \n\nthat’s so heartbreaking omg\n\nit’s a shame that only his youngest sister is left and not a couple more of his siblings, but I’m glad there was at least one of them left to see this. Rip",
                "I'm glad his family will finally get some closure. It's insane to think about the scale of death and tragedy of WW2. 80 years later, the DPAA is still IDing unknown remains on an almost daily basis. Theyve made a lot of progress lately with remains from Pearl Harbor and Japanese POW camps.",
                "Just in time for the current admiration to erase his name from history.",
                "Still had a baby face. RIP",
                "Im so glad he got to come home.",
                "He was so young. That's sad",
                "Good thing they IDed him before Trump got into office.",
                "Glad to read some uplifting news today, even if bittersweet. \n\n  \nSadly, the Trump Administration will try to erase him.",
                "Fair winds and following seas Sailor!",
                "He looks like a kid. I think we sometimes forget how young these heroes were that fought in our wars."
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "HOT",
            "title": "Family of Texas teen accused in fatal stabbing raises over $150K",
            "external_url": "https://www.lmtonline.com/news/article/texas-teen-stabbing-fundraiser-20262648.php",
            "upvotes": 1449,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "He better hope they get a good lawyer with all that money because he sounds guilty as fuck.",
                "Wait a minute. The stabbers name is actually Karmelo Anthony?? GTFOH!",
                "Unfortunately, the only winners are the lawyers' bank accounts",
                "I been in track and I’ve been to track as a spectator um. Never needed to kill anyone with a knife",
                "I want to know who is donating to this and why??",
                "Who brings a knife to a track meet? Sorry, but that I don't get. Both families are devastated. Period.",
                "Nah fuck people for using this story for a Left vs Right/White vs Black argument. \n\nI’m as left leaning on the political spectrum nowadays but no matter how many factors you insert into this story, it’s cut and dry. \n\nOnly one party decided to pull out a knife and stab another in the heart. Fuck every other variable, and every one defending the piece of shit that did the crime.\n\nEdit: Also a double fuck you to the person further down and in my DM’s with the “whataboutism” in the Kyle Rittenhouse case. Rittenhouse is a fucking dork and should’ve been guilty too. Again this isn’t a left vs right thing no matter how much TikTok or Faux News is trying to make it out to be",
                "Seems to be a ton of conflicting information floating around here. Gonna withhold any judgements until something more concrete comes out.",
                "This sounds like exactly the sort of case where nobody should jump to any conclusions until all of the evidence is presented, but of course most people seem totally confident on either side with almost no evidence.",
                "Bottom line:  Stabbing someone to death is not an appropriate reaction to getting pushed."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Top US official meant to add spokesman to Houthi Signal chat - reports",
            "external_url": "https://www.bbc.com/news/articles/cz01lepk3y8o",
            "upvotes": 470,
            "date": "04/07/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b201/live/eaefe380-131b-11f0-81c5-63e3ec908c94.jpg",
            "top_comments": [
                "Doesn't matter who was intended.\n\nThe problem is they were (and probably still are) unlawfully using Signal to skirt federal record keeping requirements and transmitting sensitive national security information on it.",
                "The upshot of all this is that principal members of Trump's cabinet are SO BAD AT THEIR JOBS that they actually screwed up months earlier than realized, kept screwing up, and have screwed up since it happened.\n\nNone of it in any way invalidates the fact they were discussing SCIF-level info on their personal phones, on an unapproved app, in an unapproved manner, in direct contravention of the Presidential Records Act and the Espionage Act.\n\nIn any other administration, heads would've already rolled.",
                "Oh so that's how they fucked up the illegal thing they were doing illegally.",
                "Cool. If I did that, I’d get fired and prosecuted. Just a little “whoopsie-poopsie” for them. ",
                "  \nDoesn't matter. You don't use publicly available software to discuss battle details. There are hardened, closed systems in place for this kind of communication.\n\nSo why were they using Signal?",
                "Next thing we will find out is waltz really wanted to add Tucker Carlson to the chat",
                "He meant to add a co-conspirator to the felony being committed. Now don’t you feel silly for calling it a leak?",
                "Great, answered one question- how'd the editor get added.\n\nEasy one is done.\n\nNow, how was (is?) usage of Signal allowed, how are records being preserved and how will this be stopped in the future?\n\nI think those will just get answers like, cuz, they aren't and it won't.",
                "This administration is an embarrassment",
                "“They’re not sending their best”\n\n—Donald Trump"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Visa records of CMU international students terminated without notice",
            "external_url": "https://www.ourmidland.com/news/article/cmu-international-students-visa-termination-20259385.php",
            "upvotes": 1765,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The administration is canceling visas without notice so they can claim they are illegal immigrants, arrest them, and send them to foreign prisons without due process.",
                "There is a university near me which has thousands of foreign students paying top dollar for education. One commented on reddit the other day and asked if $68,000 was too much to pay for tuition plus room and board for next year.\n\nI can't think of a better way to destroy medium-sized cities in America, mostly in rural locations, mostly with economies which revolve entirely around these universities.",
                "At what point will foreign countries not see this as America taking their citizens prisoner?",
                "Trump is like: \"We can't find any students here illegally so we need to create them in order to justify our Gestapo tactics.\" \n\nThis is a stepping stone. Next will be his political enemies, any registered Democrat, anyone that said anything negative online about Trump, any minority including ones that voted for him and then finally his own people out of paranoia until there is no one left. \n\nFascism is a cancer that will kill everything it touches.",
                "I don't understand the intent of cancelling student VISAs without notice beyond trying to spark chaos and fear",
                "America is turning into quite the scary place. Do 70 million people really hate foreigners that much that people who come to study then go home are picked on?",
                "This morning on WBUR(NPR in Mass) they reported that UMASS proactively looked into their international students status and found at least a dozen students had their student visa status revoked with no clear reason.",
                "Man, universities are going to lose out on all that out of state tuition fees.",
                "Colleges are education factories. They manufacture degrees and credentials. This is a valuable export when foreign students come here to study.\n\nWe are destroying our own best industry.",
                "Frankly, what these universities should be doing is going to war. They need to provide these students with *heavily armed* guards with orders to do whatever it takes to keep them out of ICE's hands. These students are going to get snatched otherwise and sent to a prison hellhole in another country before their legal representation can even get their shoes tied.\n\nWe're not getting to the point where armed resistance is the only recourse; *we are already there.*"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "China stocks sink on trade war fears; Hong Kong dives 9%",
            "external_url": "https://www.reuters.com/world/china/china-stocks-sink-trade-war-fears-hong-kong-dives-8-2025-04-07/",
            "upvotes": 2398,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Happy Global Recession day everyone!",
                "The futures overnight here are setting us up for a true Black Monday sell off in the morning.",
                "It would be really embarrassing if the US was once again the cause for a global recession like in 2008",
                "Having just read that approximately 87% of the US stock market is owned by individuals in the top 10% of wealth, it’s clear why the normal maga fan couldn’t care less about the stock market crashing. They don’t own stock.",
                "\"This is not just a stock market drop — it's a catastrophe for the entire world! Trade wars led by major powers are destroying the stability of the global economy, and the consequences of this irresponsibility are being felt by millions of people in all corners of the planet. Every market crash means losses for businesses, jobs, and the savings of ordinary people. How much longer will this madness continue? How much longer will the world pay for political games played by a few individuals who don't think about the consequences for everyone?\"",
                "[deleted]",
                "So this is what he thinks liberation looks like, right?",
                "What’s happening holy shit this is stupid",
                "China needs to abandon Russia and enter trade negotiations with Europe and Asian countries.",
                "\"This is outrageous! Once again, the trade war is wreaking havoc on ordinary people’s lives. It’s not just about stock market numbers — it’s about real people losing jobs, savings disappearing, and businesses collapsing because of decisions made by a few powerful leaders. The trade war is not just an economic crisis; it’s a human disaster. People in China, Hong Kong, and around the world are suffering, and for what? Political power games that only benefit the rich and leave the rest of us to pick up the pieces. When will this madness end?\""
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "CNN: Kennedy arrives in Texas after a second unvaccinated child dies of measles amid the state’s outbreak",
            "external_url": "https://www.cnn.com/2025/04/06/health/measles-texas-second-child-dies/index.html",
            "upvotes": 14194,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25058597447123.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The fuck's he gonna do? Find a heroin dealer?",
                "He let 83 die of measles in Samoa. He doesn't care.",
                "Imagine the parents who have lost their child, when they hear from ol' Ken that perhaps vaccines might be the way to go after all...\n\n\nEDIT: [Welp! my comment was premature! he actually straight up said it!](https://www.statnews.com/2025/04/06/rfk-jr-measles-statement-west-texas-outbreak/)",
                "[removed]",
                "Killer showing up to the scene of his crime is a real psychopath move",
                "Relax folks, it's just the brainworm doing the lords work. RFK is just a vessel.",
                "When will RFK be put  in jail for his conspiracy theories and lies ?",
                "Second worst trip a Kennedy made to Texas",
                "Is it so he can eat the remains?",
                "I bet Kennedy has been vaccinated."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Trump administration ends some USAID contracts providing lifesaving aid, officials say",
            "external_url": "https://apnews.com/article/usaid-trump-humanitarian-aid-1167e0f64dde9ab6cafa0d5e0b812710",
            "upvotes": 453,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The newly terminated contracts were among about 900 surviving programs that Secretary of State Marco Rubio had notified Congress he intended to preserve, the USAID official said.\n\nThese idiots couldn't coordinate their way out of a well lit tunnel with exit signs.",
                "The US response to the Thailand/Myanmar quakes was... something.  Instead of providing hundreds of personnel to deal with rescue and immediate needs, we sent 3.  That were laid off mid-mission.",
                "Their acceptance that humanitarian aid are part of a liberal agenda is ok with me. \n\nOwn it republicans, you guys are evil.",
                "He’s going to need that money for his golf game tomorrow.",
                "Food for Lebanon, Jordan, and Syria.  I feel bad for Jordan, but maybe that is intended for Syrian refugees.  Those countries should be getting food from Iran, Russia, and other fellow Arab states?  Or Europe?",
                "Be nice if the title stopped after the first 3 words",
                "Like usual, Republicans again showing they’re not pro life.",
                "Can't vote against them if you're dead!",
                "Trump litmus test: Does it benefit the ultra rich?\n\nThat is how to define the whole GOP platform, use religious fanaticism to distract and attract voters, then enact laws a greedy immoral CEO would want.  Eliminate any laws or regulations that a greedy immoral CEO would dislike. That perfectly describes everything they are doing."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "USCCB Ends Cooperative Agreements with US Federal Government",
            "external_url": "https://www.osvnews.com/usccb-ends-cooperative-agreements-with-us-government-after-work-suspended/",
            "upvotes": 49,
            "date": "04/07/2025",
            "thumbnail": "https://www.osvnews.com/wp-content/uploads/2025/02/20240816T0745-SECRETARIAT-JUSTICE-PEACE-USCCB-1780671-scaled.jpg",
            "top_comments": [
                "Russian pawn takes Catholic bishop.",
                "“*We remain steadfast in our commitment to advocating on behalf of men, women, and children suffering the scourge of human trafficking,” he said. “For half a century, we have been willing partners in implementing the government’s refugee resettlement program. The Gospel’s call to do what we can for the least among us remains our guide.\"*\n\nArchbishop Broglio seemed determined to continue the work but outside the framework of a govt-partner.",
                "They’ve pledged to continue their immigration work, against an administration hostile to immigration.\n\nHuh.\n\nCatholic Church kinda planting a flag here."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "NEW",
            "title": "Family of Texas teen accused in fatal stabbing raises over $150K",
            "external_url": "https://www.lmtonline.com/news/article/texas-teen-stabbing-fundraiser-20262648.php",
            "upvotes": 1434,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "He better hope they get a good lawyer with all that money because he sounds guilty as fuck.",
                "Wait a minute. The stabbers name is actually Karmelo Anthony?? GTFOH!",
                "Unfortunately, the only winners are the lawyers' bank accounts",
                "I been in track and I’ve been to track as a spectator um. Never needed to kill anyone with a knife",
                "I want to know who is donating to this and why??",
                "Who brings a knife to a track meet? Sorry, but that I don't get. Both families are devastated. Period.",
                "Nah fuck people for using this story for a Left vs Right/White vs Black argument. \n\nI’m as left leaning on the political spectrum nowadays but no matter how many factors you insert into this story, it’s cut and dry. \n\nOnly one party decided to pull out a knife and stab another in the heart. Fuck every other variable, and every one defending the piece of shit that did the crime.\n\nEdit: Also a double fuck you to the person further down and in my DM’s with the “whataboutism” in the Kyle Rittenhouse case. Rittenhouse is a fucking dork and should’ve been guilty too. Again this isn’t a left vs right thing no matter how much TikTok or Faux News is trying to make it out to be",
                "Seems to be a ton of conflicting information floating around here. Gonna withhold any judgements until something more concrete comes out.",
                "This sounds like exactly the sort of case where nobody should jump to any conclusions until all of the evidence is presented, but of course most people seem totally confident on either side with almost no evidence.",
                "Bottom line:  Stabbing someone to death is not an appropriate reaction to getting pushed."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Top US official meant to add spokesman to Houthi Signal chat - reports",
            "external_url": "https://www.bbc.com/news/articles/cz01lepk3y8o",
            "upvotes": 467,
            "date": "04/07/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b201/live/eaefe380-131b-11f0-81c5-63e3ec908c94.jpg",
            "top_comments": [
                "Doesn't matter who was intended.\n\nThe problem is they were (and probably still are) unlawfully using Signal to skirt federal record keeping requirements and transmitting sensitive national security information on it.",
                "The upshot of all this is that principal members of Trump's cabinet are SO BAD AT THEIR JOBS that they actually screwed up months earlier than realized, kept screwing up, and have screwed up since it happened.\n\nNone of it in any way invalidates the fact they were discussing SCIF-level info on their personal phones, on an unapproved app, in an unapproved manner, in direct contravention of the Presidential Records Act and the Espionage Act.\n\nIn any other administration, heads would've already rolled.",
                "Oh so that's how they fucked up the illegal thing they were doing illegally.",
                "Cool. If I did that, I’d get fired and prosecuted. Just a little “whoopsie-poopsie” for them. ",
                "  \nDoesn't matter. You don't use publicly available software to discuss battle details. There are hardened, closed systems in place for this kind of communication.\n\nSo why were they using Signal?",
                "Next thing we will find out is waltz really wanted to add Tucker Carlson to the chat",
                "He meant to add a co-conspirator to the felony being committed. Now don’t you feel silly for calling it a leak?",
                "Great, answered one question- how'd the editor get added.\n\nEasy one is done.\n\nNow, how was (is?) usage of Signal allowed, how are records being preserved and how will this be stopped in the future?\n\nI think those will just get answers like, cuz, they aren't and it won't.",
                "This administration is an embarrassment",
                "“They’re not sending their best”\n\n—Donald Trump"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Sailor killed in Pearl Harbor attack finally ID'd 84 years later, bringing closure to family",
            "external_url": "https://www.nbcnews.com/news/us-news/sailor-killed-pearl-harbor-attack-finally-idd-84-years-later-bringing-rcna199986",
            "upvotes": 2575,
            "date": "04/07/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250407-Neil-D-Frye-ew-1128a-c15aa1.jpg",
            "top_comments": [
                "“My mom used to say she loved to people watch,” McCrimmon told WHRO. “She would go anywhere she could get a chance to go to a little town and just watch all the men go by to see if she could see Neil.” \n\nthat’s so heartbreaking omg\n\nit’s a shame that only his youngest sister is left and not a couple more of his siblings, but I’m glad there was at least one of them left to see this. Rip",
                "I'm glad his family will finally get some closure. It's insane to think about the scale of death and tragedy of WW2. 80 years later, the DPAA is still IDing unknown remains on an almost daily basis. Theyve made a lot of progress lately with remains from Pearl Harbor and Japanese POW camps.",
                "Just in time for the current admiration to erase his name from history.",
                "Still had a baby face. RIP",
                "Im so glad he got to come home.",
                "He was so young. That's sad",
                "Good thing they IDed him before Trump got into office.",
                "Glad to read some uplifting news today, even if bittersweet. \n\n  \nSadly, the Trump Administration will try to erase him.",
                "Fair winds and following seas Sailor!",
                "He looks like a kid. I think we sometimes forget how young these heroes were that fought in our wars."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "Trump administration ends some USAID contracts providing lifesaving aid, officials say",
            "external_url": "https://apnews.com/article/usaid-trump-humanitarian-aid-1167e0f64dde9ab6cafa0d5e0b812710",
            "upvotes": 454,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The newly terminated contracts were among about 900 surviving programs that Secretary of State Marco Rubio had notified Congress he intended to preserve, the USAID official said.\n\nThese idiots couldn't coordinate their way out of a well lit tunnel with exit signs.",
                "The US response to the Thailand/Myanmar quakes was... something.  Instead of providing hundreds of personnel to deal with rescue and immediate needs, we sent 3.  That were laid off mid-mission.",
                "Their acceptance that humanitarian aid are part of a liberal agenda is ok with me. \n\nOwn it republicans, you guys are evil.",
                "He’s going to need that money for his golf game tomorrow.",
                "Food for Lebanon, Jordan, and Syria.  I feel bad for Jordan, but maybe that is intended for Syrian refugees.  Those countries should be getting food from Iran, Russia, and other fellow Arab states?  Or Europe?",
                "Be nice if the title stopped after the first 3 words",
                "Like usual, Republicans again showing they’re not pro life.",
                "Can't vote against them if you're dead!",
                "Trump litmus test: Does it benefit the ultra rich?\n\nThat is how to define the whole GOP platform, use religious fanaticism to distract and attract voters, then enact laws a greedy immoral CEO would want.  Eliminate any laws or regulations that a greedy immoral CEO would dislike. That perfectly describes everything they are doing."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Mesa Air, Republic Airways in merger deal to create larger regional airline",
            "external_url": "https://www.reuters.com/business/aerospace-defense/mesa-air-republic-airways-merger-deal-create-larger-regional-airline-2025-04-07/",
            "upvotes": 106,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Before people say they haven't heard of either, they basically operate a lot of regional flights for larger airlines in the US.",
                "Missed opportunity to rebrand as AIRizona",
                "I'm sure this has nothing to do with the fact that the CEO of Republic Airways was just nominated to be the FAA Administrator. Totally definitely a coincidence, right?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "World's largest deforestation project fells forests for bioethanol fuel, sugar and rice in Indonesia",
            "external_url": "https://abcnews.go.com/Business/wireStory/worlds-largest-deforestation-project-fells-forests-bioethanol-fuel-120551201",
            "upvotes": 370,
            "date": "04/07/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a8448036-fff2-4774-af2e-b42fa8fa4503/wirestory_fafbc84bba685d05acd75f78db68da63_16x9.jpg?w=1600",
            "top_comments": [
                "Not become depressed reading the news: mission impossible.",
                ">Indonesia plans to clear forests about the size of Belgium\n\nThat's a little smaller than the area of Maryland. The current Indonesian president wants Indonesia to be food independent within 4-5 years.",
                "You know why it is always countries like Indonesia and Brazil that kept cutting down forests?\n\nBecause we have already cut down ours a long time ago. Europe and China were mostly covered in forest.\n\nimage from internet for example:\n\n[https://serc.carleton.edu/eslabs/carbon/4a.html](https://serc.carleton.edu/eslabs/carbon/4a.html)\n\nso I think preserving the remaining forest are OUR responsibility, and we should all chip in so those countries are partly compensated for not developing those lands.",
                "Anyone else got bingo yet?",
                "This is not sustainable and takes generations to recover .",
                "We just want to make Earth Mars again.(MEMA) I actually have a dream to be the largest landowner of wild land in the world. I don’t know if dream is really the right term for it, but I think we really need to protect as much wild land as possible. Unfortunately, there is no money in doing so, so most people that could fulfill that dream are not at all interested in doing so.",
                "Que video of orangutan fighting the bulldozer….\n\n\nAnd….\n\n\nFuck.",
                "I don’t even like rice."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "US sidelines DOJ lawyer involved in deportation case, which judge calls 'wholly lawless'",
            "external_url": "https://www.reuters.com/world/us/us-sidelines-doj-lawyer-after-judge-orders-return-man-deported-erroneously-2025-04-06/",
            "upvotes": 5637,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The whole administration is lawless.",
                "Send Marco Rubio to El Salvador to rescue Garcia. He's secretary of state.",
                "Trump is testing the checks and balances of democracy…….Pam bondi is absolute SCUM",
                "Let's not forget what's at stake considering the absolutely horrific conditions at the mega prison they're sending legally protected people to, and now of course floating the idea of sending American citizens there too. https://youtu.be/WMUbrG7eJbY",
                "Lawyer truthfully responded to a question from the judge.\nNow he's been removed by the Trump DOJ.\n\n> Reuveni said he had raised questions with U.S. officials about why the federal government could not bring back Abrego Garcia but had received no \"satisfactory\" answer. He acknowledged what he called an \"absence of evidence\" justifying Abrego Garcia's detention and deportation.",
                "She should be in jail.",
                "Pam Bondi can run the case then and we can watch her unqualified ass fail to push the Trump bullshit through the courts in person.",
                "You didn’t lie or manipulate hard enough, you failed to be as big of an asshole and douchebag as is required to be associated with this administration, you’re fired.",
                "He wasn’t sycophant enough..",
                "DOJ is going to run out of attorneys pretty quick at this rate."
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "NEW",
            "title": "Elon Musk's X to clamp down on parody accounts",
            "external_url": "https://www.bbc.com/news/articles/c4g37elkrxdo",
            "upvotes": 13630,
            "date": "04/07/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e94a/live/b7740ce0-139b-11f0-b054-11b99aeb4b3e.jpg",
            "top_comments": [
                "Is he making comedy illegal on X?",
                "If only there was some checkmark system which could be used to see if an account is real or parody.",
                "What happened to “legalize comedy”?",
                "The bastion of free speech and open comedy. Why would anyone still use X",
                "Free speech absolutists are always just right wing chuds screaming about censorship until they are in control",
                "Freedom of speech? More like parody of freedom.",
                "Remember when Elon Musk called himself a \"free speech absolutist\" and some people actually believed him?",
                "\"Free Speech Absolutist\" indeed...\n\nGentle reminder:\n\n#ELON FUCKS GOATS",
                "Stop using X.   He doesn’t have to allow free speech on his private platform.  Boycott everything Musk.",
                "thought there was war against comedy mr elon ?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Visa records of CMU international students terminated without notice",
            "external_url": "https://www.ourmidland.com/news/article/cmu-international-students-visa-termination-20259385.php",
            "upvotes": 1766,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The administration is canceling visas without notice so they can claim they are illegal immigrants, arrest them, and send them to foreign prisons without due process.",
                "There is a university near me which has thousands of foreign students paying top dollar for education. One commented on reddit the other day and asked if $68,000 was too much to pay for tuition plus room and board for next year.\n\nI can't think of a better way to destroy medium-sized cities in America, mostly in rural locations, mostly with economies which revolve entirely around these universities.",
                "At what point will foreign countries not see this as America taking their citizens prisoner?",
                "Trump is like: \"We can't find any students here illegally so we need to create them in order to justify our Gestapo tactics.\" \n\nThis is a stepping stone. Next will be his political enemies, any registered Democrat, anyone that said anything negative online about Trump, any minority including ones that voted for him and then finally his own people out of paranoia until there is no one left. \n\nFascism is a cancer that will kill everything it touches.",
                "I don't understand the intent of cancelling student VISAs without notice beyond trying to spark chaos and fear",
                "America is turning into quite the scary place. Do 70 million people really hate foreigners that much that people who come to study then go home are picked on?",
                "This morning on WBUR(NPR in Mass) they reported that UMASS proactively looked into their international students status and found at least a dozen students had their student visa status revoked with no clear reason.",
                "Man, universities are going to lose out on all that out of state tuition fees.",
                "Colleges are education factories. They manufacture degrees and credentials. This is a valuable export when foreign students come here to study.\n\nWe are destroying our own best industry.",
                "Frankly, what these universities should be doing is going to war. They need to provide these students with *heavily armed* guards with orders to do whatever it takes to keep them out of ICE's hands. These students are going to get snatched otherwise and sent to a prison hellhole in another country before their legal representation can even get their shoes tied.\n\nWe're not getting to the point where armed resistance is the only recourse; *we are already there.*"
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "RISING",
            "title": "Sailor killed in Pearl Harbor attack finally ID'd 84 years later, bringing closure to family",
            "external_url": "https://www.nbcnews.com/news/us-news/sailor-killed-pearl-harbor-attack-finally-idd-84-years-later-bringing-rcna199986",
            "upvotes": 2575,
            "date": "04/07/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250407-Neil-D-Frye-ew-1128a-c15aa1.jpg",
            "top_comments": [
                "“My mom used to say she loved to people watch,” McCrimmon told WHRO. “She would go anywhere she could get a chance to go to a little town and just watch all the men go by to see if she could see Neil.” \n\nthat’s so heartbreaking omg\n\nit’s a shame that only his youngest sister is left and not a couple more of his siblings, but I’m glad there was at least one of them left to see this. Rip",
                "I'm glad his family will finally get some closure. It's insane to think about the scale of death and tragedy of WW2. 80 years later, the DPAA is still IDing unknown remains on an almost daily basis. Theyve made a lot of progress lately with remains from Pearl Harbor and Japanese POW camps.",
                "Just in time for the current admiration to erase his name from history.",
                "Still had a baby face. RIP",
                "Im so glad he got to come home.",
                "He was so young. That's sad",
                "Good thing they IDed him before Trump got into office.",
                "Glad to read some uplifting news today, even if bittersweet. \n\n  \nSadly, the Trump Administration will try to erase him.",
                "Fair winds and following seas Sailor!",
                "He looks like a kid. I think we sometimes forget how young these heroes were that fought in our wars."
            ],
            "aggregate_sentiment": 98.0
        },
        {
            "category": "RISING",
            "title": "Trump administration ends some USAID contracts providing lifesaving aid, officials say",
            "external_url": "https://apnews.com/article/usaid-trump-humanitarian-aid-1167e0f64dde9ab6cafa0d5e0b812710",
            "upvotes": 457,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The newly terminated contracts were among about 900 surviving programs that Secretary of State Marco Rubio had notified Congress he intended to preserve, the USAID official said.\n\nThese idiots couldn't coordinate their way out of a well lit tunnel with exit signs.",
                "The US response to the Thailand/Myanmar quakes was... something.  Instead of providing hundreds of personnel to deal with rescue and immediate needs, we sent 3.  That were laid off mid-mission.",
                "Their acceptance that humanitarian aid are part of a liberal agenda is ok with me. \n\nOwn it republicans, you guys are evil.",
                "He’s going to need that money for his golf game tomorrow.",
                "Food for Lebanon, Jordan, and Syria.  I feel bad for Jordan, but maybe that is intended for Syrian refugees.  Those countries should be getting food from Iran, Russia, and other fellow Arab states?  Or Europe?",
                "Be nice if the title stopped after the first 3 words",
                "Like usual, Republicans again showing they’re not pro life.",
                "Can't vote against them if you're dead!",
                "Trump litmus test: Does it benefit the ultra rich?\n\nThat is how to define the whole GOP platform, use religious fanaticism to distract and attract voters, then enact laws a greedy immoral CEO would want.  Eliminate any laws or regulations that a greedy immoral CEO would dislike. That perfectly describes everything they are doing."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "US sidelines DOJ lawyer involved in deportation case, which judge calls 'wholly lawless'",
            "external_url": "https://www.reuters.com/world/us/us-sidelines-doj-lawyer-after-judge-orders-return-man-deported-erroneously-2025-04-06/",
            "upvotes": 5643,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The whole administration is lawless.",
                "Send Marco Rubio to El Salvador to rescue Garcia. He's secretary of state.",
                "Trump is testing the checks and balances of democracy…….Pam bondi is absolute SCUM",
                "Let's not forget what's at stake considering the absolutely horrific conditions at the mega prison they're sending legally protected people to, and now of course floating the idea of sending American citizens there too. https://youtu.be/WMUbrG7eJbY",
                "Lawyer truthfully responded to a question from the judge.\nNow he's been removed by the Trump DOJ.\n\n> Reuveni said he had raised questions with U.S. officials about why the federal government could not bring back Abrego Garcia but had received no \"satisfactory\" answer. He acknowledged what he called an \"absence of evidence\" justifying Abrego Garcia's detention and deportation.",
                "She should be in jail.",
                "Pam Bondi can run the case then and we can watch her unqualified ass fail to push the Trump bullshit through the courts in person.",
                "You didn’t lie or manipulate hard enough, you failed to be as big of an asshole and douchebag as is required to be associated with this administration, you’re fired.",
                "He wasn’t sycophant enough..",
                "DOJ is going to run out of attorneys pretty quick at this rate."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Top US official meant to add spokesman to Houthi Signal chat - reports",
            "external_url": "https://www.bbc.com/news/articles/cz01lepk3y8o",
            "upvotes": 471,
            "date": "04/07/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/b201/live/eaefe380-131b-11f0-81c5-63e3ec908c94.jpg",
            "top_comments": [
                "Doesn't matter who was intended.\n\nThe problem is they were (and probably still are) unlawfully using Signal to skirt federal record keeping requirements and transmitting sensitive national security information on it.",
                "The upshot of all this is that principal members of Trump's cabinet are SO BAD AT THEIR JOBS that they actually screwed up months earlier than realized, kept screwing up, and have screwed up since it happened.\n\nNone of it in any way invalidates the fact they were discussing SCIF-level info on their personal phones, on an unapproved app, in an unapproved manner, in direct contravention of the Presidential Records Act and the Espionage Act.\n\nIn any other administration, heads would've already rolled.",
                "Oh so that's how they fucked up the illegal thing they were doing illegally.",
                "Cool. If I did that, I’d get fired and prosecuted. Just a little “whoopsie-poopsie” for them. ",
                "  \nDoesn't matter. You don't use publicly available software to discuss battle details. There are hardened, closed systems in place for this kind of communication.\n\nSo why were they using Signal?",
                "Next thing we will find out is waltz really wanted to add Tucker Carlson to the chat",
                "He meant to add a co-conspirator to the felony being committed. Now don’t you feel silly for calling it a leak?",
                "Great, answered one question- how'd the editor get added.\n\nEasy one is done.\n\nNow, how was (is?) usage of Signal allowed, how are records being preserved and how will this be stopped in the future?\n\nI think those will just get answers like, cuz, they aren't and it won't.",
                "This administration is an embarrassment",
                "“They’re not sending their best”\n\n—Donald Trump"
            ],
            "aggregate_sentiment": 37.0
        },
        {
            "category": "RISING",
            "title": "World's largest deforestation project fells forests for bioethanol fuel, sugar and rice in Indonesia",
            "external_url": "https://abcnews.go.com/Business/wireStory/worlds-largest-deforestation-project-fells-forests-bioethanol-fuel-120551201",
            "upvotes": 370,
            "date": "04/07/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a8448036-fff2-4774-af2e-b42fa8fa4503/wirestory_fafbc84bba685d05acd75f78db68da63_16x9.jpg?w=1600",
            "top_comments": [
                "Not become depressed reading the news: mission impossible.",
                ">Indonesia plans to clear forests about the size of Belgium\n\nThat's a little smaller than the area of Maryland. The current Indonesian president wants Indonesia to be food independent within 4-5 years.",
                "You know why it is always countries like Indonesia and Brazil that kept cutting down forests?\n\nBecause we have already cut down ours a long time ago. Europe and China were mostly covered in forest.\n\nimage from internet for example:\n\n[https://serc.carleton.edu/eslabs/carbon/4a.html](https://serc.carleton.edu/eslabs/carbon/4a.html)\n\nso I think preserving the remaining forest are OUR responsibility, and we should all chip in so those countries are partly compensated for not developing those lands.",
                "Anyone else got bingo yet?",
                "This is not sustainable and takes generations to recover .",
                "We just want to make Earth Mars again.(MEMA) I actually have a dream to be the largest landowner of wild land in the world. I don’t know if dream is really the right term for it, but I think we really need to protect as much wild land as possible. Unfortunately, there is no money in doing so, so most people that could fulfill that dream are not at all interested in doing so.",
                "Que video of orangutan fighting the bulldozer….\n\n\nAnd….\n\n\nFuck.",
                "I don’t even like rice."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Family of Texas teen accused in fatal stabbing raises over $150K",
            "external_url": "https://www.lmtonline.com/news/article/texas-teen-stabbing-fundraiser-20262648.php",
            "upvotes": 1451,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "He better hope they get a good lawyer with all that money because he sounds guilty as fuck.",
                "Wait a minute. The stabbers name is actually Karmelo Anthony?? GTFOH!",
                "Unfortunately, the only winners are the lawyers' bank accounts",
                "I been in track and I’ve been to track as a spectator um. Never needed to kill anyone with a knife",
                "I want to know who is donating to this and why??",
                "Who brings a knife to a track meet? Sorry, but that I don't get. Both families are devastated. Period.",
                "Nah fuck people for using this story for a Left vs Right/White vs Black argument. \n\nI’m as left leaning on the political spectrum nowadays but no matter how many factors you insert into this story, it’s cut and dry. \n\nOnly one party decided to pull out a knife and stab another in the heart. Fuck every other variable, and every one defending the piece of shit that did the crime.\n\nEdit: Also a double fuck you to the person further down and in my DM’s with the “whataboutism” in the Kyle Rittenhouse case. Rittenhouse is a fucking dork and should’ve been guilty too. Again this isn’t a left vs right thing no matter how much TikTok or Faux News is trying to make it out to be",
                "Seems to be a ton of conflicting information floating around here. Gonna withhold any judgements until something more concrete comes out.",
                "This sounds like exactly the sort of case where nobody should jump to any conclusions until all of the evidence is presented, but of course most people seem totally confident on either side with almost no evidence.",
                "Bottom line:  Stabbing someone to death is not an appropriate reaction to getting pushed."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Elon Musk's X to clamp down on parody accounts",
            "external_url": "https://www.bbc.com/news/articles/c4g37elkrxdo",
            "upvotes": 13620,
            "date": "04/07/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e94a/live/b7740ce0-139b-11f0-b054-11b99aeb4b3e.jpg",
            "top_comments": [
                "Is he making comedy illegal on X?",
                "If only there was some checkmark system which could be used to see if an account is real or parody.",
                "What happened to “legalize comedy”?",
                "The bastion of free speech and open comedy. Why would anyone still use X",
                "Free speech absolutists are always just right wing chuds screaming about censorship until they are in control",
                "Freedom of speech? More like parody of freedom.",
                "Remember when Elon Musk called himself a \"free speech absolutist\" and some people actually believed him?",
                "\"Free Speech Absolutist\" indeed...\n\nGentle reminder:\n\n#ELON FUCKS GOATS",
                "Stop using X.   He doesn’t have to allow free speech on his private platform.  Boycott everything Musk.",
                "thought there was war against comedy mr elon ?"
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "Visa records of CMU international students terminated without notice",
            "external_url": "https://www.ourmidland.com/news/article/cmu-international-students-visa-termination-20259385.php",
            "upvotes": 1763,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The administration is canceling visas without notice so they can claim they are illegal immigrants, arrest them, and send them to foreign prisons without due process.",
                "There is a university near me which has thousands of foreign students paying top dollar for education. One commented on reddit the other day and asked if $68,000 was too much to pay for tuition plus room and board for next year.\n\nI can't think of a better way to destroy medium-sized cities in America, mostly in rural locations, mostly with economies which revolve entirely around these universities.",
                "At what point will foreign countries not see this as America taking their citizens prisoner?",
                "Trump is like: \"We can't find any students here illegally so we need to create them in order to justify our Gestapo tactics.\" \n\nThis is a stepping stone. Next will be his political enemies, any registered Democrat, anyone that said anything negative online about Trump, any minority including ones that voted for him and then finally his own people out of paranoia until there is no one left. \n\nFascism is a cancer that will kill everything it touches.",
                "I don't understand the intent of cancelling student VISAs without notice beyond trying to spark chaos and fear",
                "America is turning into quite the scary place. Do 70 million people really hate foreigners that much that people who come to study then go home are picked on?",
                "This morning on WBUR(NPR in Mass) they reported that UMASS proactively looked into their international students status and found at least a dozen students had their student visa status revoked with no clear reason.",
                "Man, universities are going to lose out on all that out of state tuition fees.",
                "Colleges are education factories. They manufacture degrees and credentials. This is a valuable export when foreign students come here to study.\n\nWe are destroying our own best industry.",
                "Frankly, what these universities should be doing is going to war. They need to provide these students with *heavily armed* guards with orders to do whatever it takes to keep them out of ICE's hands. These students are going to get snatched otherwise and sent to a prison hellhole in another country before their legal representation can even get their shoes tied.\n\nWe're not getting to the point where armed resistance is the only recourse; *we are already there.*"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "U.S. sent 238 migrants to Salvadoran mega-prison; documents indicate most have no apparent criminal records",
            "external_url": "https://www.cbsnews.com/news/what-records-show-about-migrants-sent-to-salvadoran-prison-60-minutes-transcript/",
            "upvotes": 34426,
            "date": "04/07/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/06/3b1e09e0-d953-4d74-b1bc-7c3e37d31442/thumbnail/1200x630/fd149fa128df9273bc0e471b42d3f4f0/gettyimages-2205557653.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "We knew this - and then administration actually stated that the lack of a criminal record was itself evidence of how dangerous they were.\n\nEta: [ICE official in March saying this](https://www.google.com/amp/s/abcnews.go.com/amp/US/noncitizens-deported-alien-enemies-act-criminal-records-ice/story%3fid=119912375)",
                "> Among them: a makeup artist, a soccer player and a food delivery driver, being held in a place so harsh that El Salvador's justice minister once said the only way out is in a coffin.\n\nReading this article was so sad. Imagine coming to claim asylum, being told you have a valid claim, then vanishing before your court case. Only for photos of you to surface being dragged into a prison that is hell on earth.",
                "In any normal and sane society, this would be grounds for impeachment. I still can’t comprehend that THIS is the world we’re currently living in.",
                "60 minutes segment on this aired last night (as talked about in the article), highly recommend finding it on YouTube if you can. It’s terrifying.",
                "But MAGA said it was only violent criminals? No surprise, Trump is trying to send a racist message to all immigrants by imprisoning them and throwing them in harsh conditions. Next, MAGA is gonna be convincing us why people who come here for a better life deserve to go die in a concentration camp",
                "I find this so incredibly sad. I saw a picture of rows of the deportees sat in the prison, heads shaved just vacantly looking into the distance, because at that point you know you’re never getting out. They didn’t send them there to process their claims or hold them to then deport its far far more sinister. It’s really scary and horrible and I can’t believe they can get away with this.",
                "Even if you support deportation, it doesn't make sense to use money to deport these people specifically to a third country and have them imprisoned. It's inhumane and a waste of money. \n\nWe have due process of law. These people should've had/deserve a day in court, then through litigation, a determination could have been made whether or not they could stay legitimately. \n\nAmericans should be worried about the creeping erosion of our rights and civil liberties.",
                "First it was remove all criminals, and then it was being here without papers was criminal. Moving the goal posts. Being undocumented in the US is a civil offense, not a criminal offense. Everyone should be concerned when there is no due process.",
                "Maga morons will still say they deserve it until it happens to somebody they know",
                "This needs to end. Where is congress? They should be putting the brakes on this president.Nearly everything he does is illegal."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "China stocks sink on trade war fears; Hong Kong dives 9%",
            "external_url": "https://www.reuters.com/world/china/china-stocks-sink-trade-war-fears-hong-kong-dives-8-2025-04-07/",
            "upvotes": 2403,
            "date": "04/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Happy Global Recession day everyone!",
                "The futures overnight here are setting us up for a true Black Monday sell off in the morning.",
                "It would be really embarrassing if the US was once again the cause for a global recession like in 2008",
                "Having just read that approximately 87% of the US stock market is owned by individuals in the top 10% of wealth, it’s clear why the normal maga fan couldn’t care less about the stock market crashing. They don’t own stock.",
                "\"This is not just a stock market drop — it's a catastrophe for the entire world! Trade wars led by major powers are destroying the stability of the global economy, and the consequences of this irresponsibility are being felt by millions of people in all corners of the planet. Every market crash means losses for businesses, jobs, and the savings of ordinary people. How much longer will this madness continue? How much longer will the world pay for political games played by a few individuals who don't think about the consequences for everyone?\"",
                "[deleted]",
                "So this is what he thinks liberation looks like, right?",
                "What’s happening holy shit this is stupid",
                "China needs to abandon Russia and enter trade negotiations with Europe and Asian countries.",
                "\"This is outrageous! Once again, the trade war is wreaking havoc on ordinary people’s lives. It’s not just about stock market numbers — it’s about real people losing jobs, savings disappearing, and businesses collapsing because of decisions made by a few powerful leaders. The trade war is not just an economic crisis; it’s a human disaster. People in China, Hong Kong, and around the world are suffering, and for what? Political power games that only benefit the rich and leave the rest of us to pick up the pieces. When will this madness end?\""
            ],
            "aggregate_sentiment": 58.0
        }
    ],
    "last_updated": "04/07/2025 20:09:29 UTC"
}