{
    "posts": [
        {
            "category": "HOT",
            "title": "FBI arrests Wisconsin judge for alleged immigration arrest obstruction",
            "external_url": "https://www.cnbc.com/2025/04/25/fbi-arrest-judge-hannah-dugan-milwaukee.html",
            "upvotes": 14234,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108105170-1740079897323-gettyimages-2196799506-_d6a3759_jvu3ubzr.jpeg?v=1745593911&w=1920&h=1080",
            "top_comments": [
                "That's 2 judges in 2 days.",
                "Meanwhile, trump recently pardoned a judge in Nevada who committed fraud related to a veterans charity. \n\nIf that didn’t enrage you enough, that judge had no law degree and said she was looking forward to getting back on the bench.",
                "Is this record time to go from \"Stop overreacting\" to \"we are literally arresting judges\"",
                "Just want to add a historical note that in the Declaration of Independence there is a mention that if a government becomes oppressive, the people have the right to abolish it.",
                "So Trump is sending his crony at the FBI, Kash Patel, to arrest judges standing up to him.\n\n*Yeah, that's definitely the sign of a properly functioning democracy.*",
                "Everyone in this administration deserves to end up in prison when this is all over. ",
                "Guys? You're under reacting. way under reacting",
                ">Patel wrote on X that the FBI believes Milwaukee Circuit Court Judge Hannah Dugan “intentionally misdirected federal agents away” from Eduardo Flores Ruiz as agents were attempting to arrest him at her courthouse last week.\n\nIt’s not what you believe, it’s what you can prove. It will be interesting to see what kind of case they have but my money is on the FBI over reaching here.",
                "Time for the National Strikes to begin. If they are arresting judges now for upholding the law, there is nothing left for this country. Time to shut it all down.",
                "This is deeply concerning. Meant to intimidate. I suppose it's a slight positive that Patel is not that smart and probably has no actual case."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Russian general killed in car blast hours before US envoy’s Kremlin meeting",
            "external_url": "https://www.theguardian.com/world/2025/apr/25/russian-general-killed-car-blast-hours-before-us-envoy-kremlin-meeting-yaroslav-moskalik",
            "upvotes": 20315,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4beba3175180dee351a337f00ebd19d16476b431/0_512_7846_4708/master/7846.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=61cb3211834c5c69e12d02d112f966b7",
            "top_comments": [
                "Imagine scheduling peace talks and getting met with *“please hold, your general has exploded.”*",
                "Was he supposed to meet with Vance. He’s the harbinger of death",
                "He shouldn't have provoked the bomb, if he didn't want to be blown up.",
                "Are ya'll just finding out about this? Some dude named Pete texted me about it days ago.",
                "Oh well. No harm done.",
                "First thing I thought was, who did it. Ukrainians, anti war Russians, or Putin himself?",
                "Finally some good news",
                "Looks better than a window lintel, doesn't it?",
                "Ukraine lurking in the Signal chats.",
                "I’m imagining Hegseth bragging about the upcoming meeting in a Signal chat with his cousin, a makeup artist, his auto mechanic, and some rando nobody remembers adding called “Ukraine Central Intelligence”."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "US prosecutors to seek death penalty against Luigi Mangione in UnitedHealth executive’s murder",
            "external_url": "https://www.reuters.com/world/us/prosecutors-file-formal-notice-plan-seek-death-penalty-luigi-mangione-2025-04-25/",
            "upvotes": 2224,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Mass shooter at a school? Life in prison.\n\n\nKill a rich person? DEATH PENALTY.",
                "They want to make an example out of him. Shame that our government cares more about the life of one CEO than it does about the wellbeing of its citizens who are forced to rely on substandard health insurance coverage and labyrinthian claims processes.",
                "Interesting to note that racially motivated mass shooters don't get the prosecutors this bloodthirsty for a death penalty case (and the cops will take them out for burger king on the way to jail in some cases!)",
                "In justifying their decision, prosecutors wrote in their filing that Mangione \"presents a future danger because he expressed an intent to target an entire industry, and rally political and social opposition to that industry, by engaging in an act of lethal violence.\"",
                ">Mr Mangione is facing 11 state criminal counts in New York, including first-degree murder and murder as a crime of terrorism.\n\n\n>But federal prosecutors have also separately charged Mr Mangione for using a firearm to commit murder and interstate stalking resulting in death. These charges make him eligible for the death penalty.\n\nFar be it from me to want to bring up DOGE, but if the state has a really good case, why is the federal government piling on and wasting taxpayer money? It's possible *if* something jury nullification comes into play and the accused is acquitted on all charges on the state level, the federal government can still step in and charge this man for the crimes listed above. But that's only if something like an acquittal happens at the state level, for something like jury nullification.",
                "Is it normal for the attorney general to taint a trial by calling the defendant a murderer on live TV? You know, before any juries have been selected?",
                "are we even sure he did it",
                "Last i checked a significant amount of school shooters have not gotten the death penalty?",
                "They just gave the highland park shooter life in prison for killing 7 and injuring atleast a dozen others but this dude gets one rich dude and they'll probably chop his head off on live TV",
                "This feels like a quite typical knee jerk reaction from this administration. They’re clearly concerned, and even scared, by the positive response from a lot of people, and so think that the best idea is to get rid of him. Instead, they’re martyring him."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Manhattan DA says attorney raped, electro-shocked, tortured women in his apartment",
            "external_url": "https://gothamist.com/news/manhattan-da-says-attorney-raped-electro-shocked-tortured-women-in-his-apartment",
            "upvotes": 1300,
            "date": "04/25/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350893/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "[More info](https://apnews.com/article/manhattan-private-equity-sexual-assault-93890bd429eaf864407207c55f7a7ee5):\n\n>A private equity executive turned his New York City apartment into a torture chamber of “grotesque sexual violence,” Manhattan prosecutors said Thursday. He is accused of raping six women over five months in a depraved rampage in which he allegedly punched, waterboarded and shocked victims with a cattle prod and kept recordings of the assaults as trophies.\n\n>Ryan Hemphill, who remains jailed after his arrest last month, pleaded not guilty to a 116-count indictment charging him with predatory sexual assault and other crimes dating to last October. The 43-year-old, who is also a lawyer, threatened to have victims arrested or disappeared in a bid to keep them silent, prosecutors said.",
                "Holy shit private equity executive. These people are fucked. ",
                "[removed]",
                "It concerns me that he worked overseas with children. If he's willing to torture and threaten these women here in America, imagine the fucked up crimes he potentially committed in developing countries.",
                "From the comments on the article:\n\n>Zazuum\n>17h ago\n>Outside of his professional endeavors, Ryan Hemphill is a committed philanthropist who is passionate about giving back to his community and others around the world. Ryan operated as Youth Ambassador to the NGO Voices of African Mothers for the former CFO of UN Peacekeeping where he helped initiate the development of a school for young women in Ghana. In 2009, Ryan Hemphill coordinated and directed the Bronx Opera Children’s Program, which performs excerpts of the latest Bronx Opera productions for schoolchildren between the ages of 5 and 15 in order to give them access the arts when they may not be able to experience it otherwise.\n\n>^ Well, someone needs to check both programs",
                "I bet this guy has an amazing business card.",
                "https://ryanhemphill.nyc/",
                "[removed]",
                "How the hell was this able to go on for 6 months with 5 different women?! Cattle prods and shock collars?!",
                "Found a pic of him from the last time he got in trouble for abusing women:\n\n[https://archive.ph/wU24j](https://archive.ph/wU24j)"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "California’s economy surpasses Japan’s as it becomes fourth largest in world",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/24/california-economy-japan-gavin-newsom?utm_source=substack&utm_medium=email",
            "upvotes": 2356,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/938f0112d71adef10ac1e9e9b33960fe42957355/0_92_2774_1665/master/2774.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f42dd3033c917d012c2a14d492480724",
            "top_comments": [
                "But conservatives said that it's a failed state.are you implying that they lied?",
                "California population 40million. Japan population 125 million.\n\nJapanese are known to be some of the hardest working people in the world, yet here we are in California with 1/3 the population and still cranking out numbers to match entire nations. It really is something Californians should be proud of.\n\nOne of the biggest overlooked things is California's education system. Our UC and Cal State system consistently cranks out some of the smartest and brightest young adults in the world. \n\nCalifornia also has some of the best labor laws to protect workers compared to many other states.",
                "And why does California need the other 49 states?",
                "MAGA screams daily (in every possible form of media) that hundreds of thousands of people are leaving California every second.  They scream that California is a dead and broken state.  A poor state.  A place only fit for the criminals that have illegally entered the US.  \n\nAnd yet.....Cali is now the 4th largest economy on the planet. \n\nBoth these things can't be true.  One is instantly and credibly verifiable using financial data.  The other is the slobbering moans of insipid losers.",
                "I'm surprised Trump hasn't started a trade war with California yet.",
                "As a Midwesterner and a lover of my city ...I've lately caught myself asking myself \"hm...can I find a job in Cali that offsets the cost of living? What about other blue states?\" 🤔",
                "Tomorrow, Trump tweets about tariffs on California for a negative trade relationship or what the fuck ever.",
                "Why doesn't Cali just buy it's own SCOTUS judges and Congress critters? If Russia can do it, they can too!",
                "It'll be interesting when they have the next disaster and Benedict Donald says FEMA is broke. I hope they refuse to send their tax money to the taker red states.",
                "Underrated tidbit of info from the article:\n\n\"California is a major contributor to economic growth nationally, with the money it sends to the federal government outpacing what it receives in federal funding by $83bn...\""
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Pete Hegseth had an unsecured internet line set up in his office to connect to Signal, AP sources say",
            "external_url": "https://www.ctvnews.ca/world/article/pete-hegseth-had-an-unsecured-internet-line-set-up-in-his-office-to-connect-to-signal-ap-sources-say/",
            "upvotes": 39479,
            "date": "04/25/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/4YEWSMJAY45CNMAAARZCB6XHPQ.jpg?smart=true&auth=334b1defe62b2a369ef8b3cd017a963865ba09c3918db0420f3c9cfb5b8aa9d9&width=1200&height=630",
            "top_comments": [
                "“U.S. Defense Secretary Pete Hegseth had an internet connection that bypassed the Pentagon’s security protocols set up in his office to use the Signal messaging app on a personal computer, two people familiar with the line told The Associated Press.\n\nThe existence of the unsecured internet connection is the latest revelation about Hegseth’s use of the unclassified app and raises the possibility that sensitive defense information could have been put at risk of potential hacking or surveillance.”",
                "So he's just trying to hide some illegal shit at this point.",
                "What’s this fuckers obsession with signal?",
                "He has also been having a mental breakdown on television, he needs to be removed from his position as soon as possible. He is a danger to the safety of the United States. ",
                "....which synced to his phone though Bluetooth or WiFi. \n\nThe most powerful military leader -has an open internet computer, inside his office, that synced to his phone app everytime he sat down.",
                "But, Hillary’s emails..",
                "Seriously can this dude be arrested or something. This is outright blatant security violations. He should be in GITMO",
                "I mean, just out of curiosity, how do you get an insecure line added in the pentagon? Did they call up and have their ISP drill a new line in? I feel like someone somewhere had to say “yah we can’t really approve this”. It’s not like he dragged a cable through the building himself.",
                ".....\n\nHilarys fucking emails....\n\nHunter Bidens laptop.\n\nJfc I hate these fascists and the dumb sheep that listen to them.",
                "i miss having a government made of even 50% competent upper management"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump pardons Nevada politician who paid for her plastic surgery with funds to honor a slain officer",
            "external_url": "https://apnews.com/article/trump-pardon-michele-fiore-nevada-fraud-cf56ef8b302b8111e47cf52d5a606d19",
            "upvotes": 20304,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "\"Fiore, who does not have a law degree, was [appointed as a judge](https://apnews.com/article/politics-las-vegas-nevada-73278936d0baa571db1174aaf275d4c2) in deep-red Nye County in 2022 shortly after she lost her campaign for state treasurer.\n\nShe was elected last June to complete the unexpired term of a judge who died but had been suspended without pay amid her legal troubles. Pahrump is an hour’s drive west of Las Vegas.\n\nIn her statement Thursday, Fiore also said she plans to return to the bench next week.\"\n\n\n\nwhy indeed",
                "At first I was like \"Why would he pardon her\".. but then..\n\n> President Donald Trump has pardoned a Nevada Republican politician who was awaiting sentencing on federal charges that she used money",
                "A scumbag pardoning a scumbag.",
                "The silence from the right speaks for itself",
                "Of course he did, he stole funds from a veteran’s charity",
                "We're only 4 months into this.",
                "The fraud is one thing, but personally I find this more concerning: \n\n\"Fiore, who does not have a law degree, was appointed as a judge in deep-red Nye County in 2022 shortly after she lost her campaign for state treasurer.\"\n\nFor an administration that howls about DEI, they couldn't install less qualified people to more important positions if they tried.",
                "Republicans do their thing",
                "The Onion and reality are merging and I hate it",
                "Crime is legal. Steal from rich people. Literally just take their shit."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Highland Park shooter Robert Crimo III sentenced to life in prison without parole",
            "external_url": "https://abcnews.go.com/US/highland-park-shooter-robert-crimo-iii-sentenced-wednesday/story?id=121081551",
            "upvotes": 1530,
            "date": "04/25/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/902c2238-fe31-4a8d-81fe-2a06a7d83d6e/CrimoIII1-ap-ml-250303_1741017143820_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Where the hell is his frontal lobe? Dude Looks like he's missing more than a third of his brain, arguably the most important part.",
                "So this is one of those heinous criminals that will be sent to El Salvador, right??\n\nTrump said homegrowns that commit horrible, despicable crimes will be sent to El Salvador.  I can't think of a worse crime, than a mass shooter!",
                "Good thing he didn’t vandalize a Tesla.",
                "It took 3 years to convict him?",
                "Forgot how ugly he is",
                "I didn't remember this one until I looked it up, too many to sort through. 😔💔",
                "Is ABC using AI for images now, or does this guy look so \"uncanny valley\" in real life? That head is built for a 1960s claymation character.",
                "Sad part is I am scratching my head trying to remember “which mass shooting was this one”?",
                "Why did he get a fair trial? Why wasn’t he just deported to El Salvador?",
                "His last name is fitting"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Houthi rebels have shot down 7 US Reaper drones worth $200 million in recent weeks",
            "external_url": "https://apnews.com/article/houthis-us-warships-red-sea-e6e97a7131c48640ccf74b1916628234",
            "upvotes": 1948,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In related news, Signal has leaped to the front of the smartphone top downlads list in Yemen.",
                "Meanwhile, Hegseth needs a makeup chair.",
                "Aren’t we just feeding them reaper drones at this rate",
                "Anyone know who \"Ted Houthi\" is on the text thread? -- Pete Hegseth",
                "Sounds less rebel-ly and a bit more know-what-they're-doing-y.",
                "I have to give up up healthcare for this?",
                "They cost that much, not worth that much. Big diiference.",
                "Military is an absolute joke right now",
                "What would the cost be of losing an F-35? How about two or possibly more? What would the cost be of having a naval aviator or two captured be? What would the political cost be of having a pilot paraded before the cameras of the world be? What intelligence would such captures be able to reveal? Such costs would be far greater. \n\nDrones like these are designed to take the place of manned flights. Such drones are designed to be expendable. The 200 million spent pales in comparison to what it could have cost the nation. They did their job.",
                "didn't happen with the other guy in charge hmm"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Feds accidentally publish secret plan to kill NYC congestion pricing",
            "external_url": "https://gothamist.com/news/feds-accidentally-publish-secret-plan-to-kill-nyc-congestion-pricing",
            "upvotes": 39395,
            "date": "04/24/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350872/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                ">The internal 11-page letter, sent from attorneys in the Southern District of New York to a lawyer for the federal transportation department, was taken down less than an hour after it was erroneously put online.\n\nUh…you can’t put the toothpaste back in the tube.",
                "States' rights, except for those we do not like, amirite?",
                "The one good thing about this administration is they are so unbelievably incompetent.    \n\nImagine the damage they were just as sinister AND competent.",
                "I had to double take that it didn't say congressman.",
                "Anyone know how to be deleted from Signal group chat, I keep getting added",
                "[deleted]",
                "I knew all about this.Someone named Pete texted me about this yesterday! I don’t know how I got on that text chain but I think the poster is pretty tipsy;)",
                "Fitting for an administration that destroys everything and accomplishes nothing.",
                "I'd love to say this is shockingly incompetent, but it's just par for the course at this point. Thankfully their stupidity undercuts the effectiveness of their authoritarianism a bit.",
                "Their administration is so chaotic and unorganized that they can’t keep anything a secret it seems"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "UK scientists to launch outdoor geoengineering experiments | Geoengineering | The Guardian",
            "external_url": "https://www.theguardian.com/environment/2025/apr/22/uk-scientists-outdoor-geoengineering-experiments",
            "upvotes": 23,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/0d5659197e4e05f923549b37886cf810f2fc0f65/275_225_4290_2575/master/4290.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7a43bca3a75e7607bde96789bf46c965",
            "top_comments": [
                "I think we've all seen enough Sci-Fi movies to know how this song and dance goes."
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "NEW",
            "title": "FBI arrests Wisconsin judge for alleged immigration arrest obstruction",
            "external_url": "https://www.cnbc.com/2025/04/25/fbi-arrest-judge-hannah-dugan-milwaukee.html",
            "upvotes": 14263,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108105170-1740079897323-gettyimages-2196799506-_d6a3759_jvu3ubzr.jpeg?v=1745593911&w=1920&h=1080",
            "top_comments": [
                "That's 2 judges in 2 days.",
                "Meanwhile, trump recently pardoned a judge in Nevada who committed fraud related to a veterans charity. \n\nIf that didn’t enrage you enough, that judge had no law degree and said she was looking forward to getting back on the bench.",
                "Is this record time to go from \"Stop overreacting\" to \"we are literally arresting judges\"",
                "Just want to add a historical note that in the Declaration of Independence there is a mention that if a government becomes oppressive, the people have the right to abolish it.",
                "So Trump is sending his crony at the FBI, Kash Patel, to arrest judges standing up to him.\n\n*Yeah, that's definitely the sign of a properly functioning democracy.*",
                "Everyone in this administration deserves to end up in prison when this is all over. ",
                "Guys? You're under reacting. way under reacting",
                ">Patel wrote on X that the FBI believes Milwaukee Circuit Court Judge Hannah Dugan “intentionally misdirected federal agents away” from Eduardo Flores Ruiz as agents were attempting to arrest him at her courthouse last week.\n\nIt’s not what you believe, it’s what you can prove. It will be interesting to see what kind of case they have but my money is on the FBI over reaching here.",
                "Time for the National Strikes to begin. If they are arresting judges now for upholding the law, there is nothing left for this country. Time to shut it all down.",
                "This is deeply concerning. Meant to intimidate. I suppose it's a slight positive that Patel is not that smart and probably has no actual case."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Manhattan DA says attorney raped, electro-shocked, tortured women in his apartment",
            "external_url": "https://gothamist.com/news/manhattan-da-says-attorney-raped-electro-shocked-tortured-women-in-his-apartment",
            "upvotes": 1305,
            "date": "04/25/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350893/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "[More info](https://apnews.com/article/manhattan-private-equity-sexual-assault-93890bd429eaf864407207c55f7a7ee5):\n\n>A private equity executive turned his New York City apartment into a torture chamber of “grotesque sexual violence,” Manhattan prosecutors said Thursday. He is accused of raping six women over five months in a depraved rampage in which he allegedly punched, waterboarded and shocked victims with a cattle prod and kept recordings of the assaults as trophies.\n\n>Ryan Hemphill, who remains jailed after his arrest last month, pleaded not guilty to a 116-count indictment charging him with predatory sexual assault and other crimes dating to last October. The 43-year-old, who is also a lawyer, threatened to have victims arrested or disappeared in a bid to keep them silent, prosecutors said.",
                "Holy shit private equity executive. These people are fucked. ",
                "[removed]",
                "It concerns me that he worked overseas with children. If he's willing to torture and threaten these women here in America, imagine the fucked up crimes he potentially committed in developing countries.",
                "From the comments on the article:\n\n>Zazuum\n>17h ago\n>Outside of his professional endeavors, Ryan Hemphill is a committed philanthropist who is passionate about giving back to his community and others around the world. Ryan operated as Youth Ambassador to the NGO Voices of African Mothers for the former CFO of UN Peacekeeping where he helped initiate the development of a school for young women in Ghana. In 2009, Ryan Hemphill coordinated and directed the Bronx Opera Children’s Program, which performs excerpts of the latest Bronx Opera productions for schoolchildren between the ages of 5 and 15 in order to give them access the arts when they may not be able to experience it otherwise.\n\n>^ Well, someone needs to check both programs",
                "I bet this guy has an amazing business card.",
                "https://ryanhemphill.nyc/",
                "[removed]",
                "How the hell was this able to go on for 6 months with 5 different women?! Cattle prods and shock collars?!",
                "Found a pic of him from the last time he got in trouble for abusing women:\n\n[https://archive.ph/wU24j](https://archive.ph/wU24j)"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Judge orders return of second Maryland man deported to El Salvador in violation of court order",
            "external_url": "https://www.cbsnews.com/baltimore/news/judge-maryland-man-deported-trump-administration-el-salvador/",
            "upvotes": 126,
            "date": "04/25/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/04/07/719341dd-e4d6-4e77-aba4-8c6ed49a4f58/thumbnail/1200x630/1ef3543989e3e812f06ced64dca3057c/gettyimages-2195569279.jpg?v=8e9dede207b29c97b32974c53e32aabc",
            "top_comments": [
                "I'm sure the trump cult will get right on that."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Trump takes executive action targeting ActBlue, the main Democratic fundraising platform",
            "external_url": "https://www.nbcnews.com/politics/trump-administration/trump-expected-sign-memo-targeting-act-blue-rcna202673",
            "upvotes": 633,
            "date": "04/25/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250423-trump-ch-1550-c2f4e3.jpg",
            "top_comments": [
                "Uh huh. So being a Democrat is now equivalent to being a terrorist. Who could have foreseen this outcome?!",
                "Locking up the opposition is the second phase of Hitler’s 1000 year reich plan. Everyone puts me down for this but if you do any ( and I mean any) research you’ll realize that Trump is doing an exact copy of Germany in the late 1920s early 1930s. Most people focus on the war but it all started 10 years earlier.",
                "Vote in the midterms people, if we even make it that far. 😑",
                "You know, like a dictator would.",
                "Republicans are such little bitches. Too scared and incompetent to compete in a fair democracy.  Weak ass soft-handed bitches.",
                "Most authoritarian regimes target their \"enemies\" to sow fear and maintain strongarm control, so it's completely on-brand for Republicans to engage in this behavior as well. Surprised its taken them this long.",
                "So now we know that Republicans are definitely taking foreign contributions",
                "Is he upset that dems have been RIGHT about GOP getting russian money?",
                "It's just a matter of time before Trump just declares Democrats a terrorist organization and starts imprisoning people for politics.",
                "What a freakin' hypocrite."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "US prosecutors to seek death penalty against Luigi Mangione in UnitedHealth executive’s murder",
            "external_url": "https://www.reuters.com/world/us/prosecutors-file-formal-notice-plan-seek-death-penalty-luigi-mangione-2025-04-25/",
            "upvotes": 2230,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Mass shooter at a school? Life in prison.\n\n\nKill a rich person? DEATH PENALTY.",
                "They want to make an example out of him. Shame that our government cares more about the life of one CEO than it does about the wellbeing of its citizens who are forced to rely on substandard health insurance coverage and labyrinthian claims processes.",
                "Interesting to note that racially motivated mass shooters don't get the prosecutors this bloodthirsty for a death penalty case (and the cops will take them out for burger king on the way to jail in some cases!)",
                "In justifying their decision, prosecutors wrote in their filing that Mangione \"presents a future danger because he expressed an intent to target an entire industry, and rally political and social opposition to that industry, by engaging in an act of lethal violence.\"",
                ">Mr Mangione is facing 11 state criminal counts in New York, including first-degree murder and murder as a crime of terrorism.\n\n\n>But federal prosecutors have also separately charged Mr Mangione for using a firearm to commit murder and interstate stalking resulting in death. These charges make him eligible for the death penalty.\n\nFar be it from me to want to bring up DOGE, but if the state has a really good case, why is the federal government piling on and wasting taxpayer money? It's possible *if* something jury nullification comes into play and the accused is acquitted on all charges on the state level, the federal government can still step in and charge this man for the crimes listed above. But that's only if something like an acquittal happens at the state level, for something like jury nullification.",
                "Is it normal for the attorney general to taint a trial by calling the defendant a murderer on live TV? You know, before any juries have been selected?",
                "are we even sure he did it",
                "Last i checked a significant amount of school shooters have not gotten the death penalty?",
                "They just gave the highland park shooter life in prison for killing 7 and injuring atleast a dozen others but this dude gets one rich dude and they'll probably chop his head off on live TV",
                "This feels like a quite typical knee jerk reaction from this administration. They’re clearly concerned, and even scared, by the positive response from a lot of people, and so think that the best idea is to get rid of him. Instead, they’re martyring him."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Hidden magma cap discovered at Yellowstone National Park",
            "external_url": "https://abcnews.go.com/US/hidden-magma-cap-discovered-yellowstone-national-park/story?id=121083908",
            "upvotes": 315,
            "date": "04/25/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8dbdc40f-591f-4937-806c-efad4fa064c1/yellowstone-01-gty-jef-250423_1745423218204_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Geoscientists have discovered a magma cap at Yellowstone National Park that is likely playing a critical role in preventing a massive eruption in one of the largest active volcanic systems in the world.\n\nOh, interesting. That Yellowstone caldera from the movie 2012 seems to be farther from reality.",
                ">Geoscientists have discovered a magma cap at Yellowstone National Park that is likely playing a critical role in preventing a massive eruption in one of the largest active volcanic systems in the world.\n\nThat's interesting.\n\n>The scientists found the cap by using a 53,000-pound vibroseis truck, a device capable of injecting low-frequency vibrations into the Earth to study the geology of the volcanic system. By generating tiny earthquakes that send seismic waves into the ground, the researchers were able to measure how the waves reflected off subsurface layers.\n\nHmmm... if it's really doing what they say it's doing, I hope they stop injecting it with underground earthquakes.",
                "Mr. Yellowstone. Respectfully, please leave your cap on.",
                "Keep JD Vance away from there!",
                "FFS, Yellow Stone, this isn't the time for such delay tactics. Just erupt already and put us out of our misery.\n\n>Volcanic eruptions can then occur as the bubbles accumulate and increase in buoyancy, driving an explosion.\n\n>An eruption at Yellowstone, however, is likely not imminent, the researchers said.\n\n>Data from seismic imaging and advanced computer modeling indicates that the magma reservoir is actively releasing gas and remains in a stable state. The system was described by Schmandt as \"steady breathing,\" with the bubbles rising and releasing through the porous rock of the magma cap.\n\nCan we maybe just pave over some of that to trap the gases?",
                "On first pass I read that as maga ... the Internet has ruined me",
                "For a minute I thought the headline was “MAGA” cap.  Which would be ironic because MAGA is firing much of US forestry staff.  Lol.",
                "magma cap or maga hat?",
                "Ugh I read MAGA cap..... I need to go camping this weekend and leave the phone at home. See y'all Monday 👋",
                "Trump can use it to get the money and melt every city with liquid hot magma! \n\nHonestly, throw me a bone here!"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "China quietly rolls back retaliatory tariffs on some US-made semiconductors, import agencies say",
            "external_url": "https://edition.cnn.com/2025/04/25/business/china-us-tariffs-semiconductors-exemptions-hnk-intl?cid=external-feeds_iluminar_google",
            "upvotes": 324,
            "date": "04/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-15t045902z-1569210894-rc2vcz9qv2nu-rtrmadp-3-usa-trump-taiwan.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> On April 11, Trump exempted imports of electronics such as smartphones and computers from his “reciprocal” tariffs. That exemption has had a major impact on tech giants like Apple, which make iPhones and other products in China.\n\nThis is after Trump's already done the same for some Chinese goods.",
                "Waiting for Trump to declare total victory",
                "How is it quiet if it’s on CNN?",
                "China just ate our lunch",
                "China showed they need these US imports. Trump can use this by increasing export requirements to China of critical semiconductors to pressure China to negotiate.",
                "China is only trying to save face. That is why they will say they aren’t talking when they actually are or roll back tariffs but not publish the information with a large media campaign. It’s all about saving face culturally.\n\nThem showing the “real suppliers” for luxury brands even though they were just dupe factories is a psyop  trying to get people to still buy products. People don’t want a dupe Birkin bag without the Hermes logo…. People want the status symbol of the logo",
                "[deleted]"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "California’s economy surpasses Japan’s as it becomes fourth largest in world",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/24/california-economy-japan-gavin-newsom?utm_source=substack&utm_medium=email",
            "upvotes": 2357,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/938f0112d71adef10ac1e9e9b33960fe42957355/0_92_2774_1665/master/2774.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f42dd3033c917d012c2a14d492480724",
            "top_comments": [
                "But conservatives said that it's a failed state.are you implying that they lied?",
                "California population 40million. Japan population 125 million.\n\nJapanese are known to be some of the hardest working people in the world, yet here we are in California with 1/3 the population and still cranking out numbers to match entire nations. It really is something Californians should be proud of.\n\nOne of the biggest overlooked things is California's education system. Our UC and Cal State system consistently cranks out some of the smartest and brightest young adults in the world. \n\nCalifornia also has some of the best labor laws to protect workers compared to many other states.",
                "And why does California need the other 49 states?",
                "MAGA screams daily (in every possible form of media) that hundreds of thousands of people are leaving California every second.  They scream that California is a dead and broken state.  A poor state.  A place only fit for the criminals that have illegally entered the US.  \n\nAnd yet.....Cali is now the 4th largest economy on the planet. \n\nBoth these things can't be true.  One is instantly and credibly verifiable using financial data.  The other is the slobbering moans of insipid losers.",
                "I'm surprised Trump hasn't started a trade war with California yet.",
                "As a Midwesterner and a lover of my city ...I've lately caught myself asking myself \"hm...can I find a job in Cali that offsets the cost of living? What about other blue states?\" 🤔",
                "Tomorrow, Trump tweets about tariffs on California for a negative trade relationship or what the fuck ever.",
                "Why doesn't Cali just buy it's own SCOTUS judges and Congress critters? If Russia can do it, they can too!",
                "It'll be interesting when they have the next disaster and Benedict Donald says FEMA is broke. I hope they refuse to send their tax money to the taker red states.",
                "Underrated tidbit of info from the article:\n\n\"California is a major contributor to economic growth nationally, with the money it sends to the federal government outpacing what it receives in federal funding by $83bn...\""
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "NEW",
            "title": "Russian general killed in car blast hours before US envoy’s Kremlin meeting",
            "external_url": "https://www.theguardian.com/world/2025/apr/25/russian-general-killed-car-blast-hours-before-us-envoy-kremlin-meeting-yaroslav-moskalik",
            "upvotes": 20320,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4beba3175180dee351a337f00ebd19d16476b431/0_512_7846_4708/master/7846.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=61cb3211834c5c69e12d02d112f966b7",
            "top_comments": [
                "Imagine scheduling peace talks and getting met with *“please hold, your general has exploded.”*",
                "Was he supposed to meet with Vance. He’s the harbinger of death",
                "He shouldn't have provoked the bomb, if he didn't want to be blown up.",
                "Are ya'll just finding out about this? Some dude named Pete texted me about it days ago.",
                "Oh well. No harm done.",
                "First thing I thought was, who did it. Ukrainians, anti war Russians, or Putin himself?",
                "Finally some good news",
                "Looks better than a window lintel, doesn't it?",
                "Ukraine lurking in the Signal chats.",
                "I’m imagining Hegseth bragging about the upcoming meeting in a Signal chat with his cousin, a makeup artist, his auto mechanic, and some rando nobody remembers adding called “Ukraine Central Intelligence”."
            ],
            "aggregate_sentiment": 58.0
        },
        {
            "category": "RISING",
            "title": "FBI arrests Wisconsin judge for alleged immigration arrest obstruction",
            "external_url": "https://www.cnbc.com/2025/04/25/fbi-arrest-judge-hannah-dugan-milwaukee.html",
            "upvotes": 14224,
            "date": "04/25/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108105170-1740079897323-gettyimages-2196799506-_d6a3759_jvu3ubzr.jpeg?v=1745593911&w=1920&h=1080",
            "top_comments": [
                "That's 2 judges in 2 days.",
                "Meanwhile, trump recently pardoned a judge in Nevada who committed fraud related to a veterans charity. \n\nIf that didn’t enrage you enough, that judge had no law degree and said she was looking forward to getting back on the bench.",
                "Is this record time to go from \"Stop overreacting\" to \"we are literally arresting judges\"",
                "Just want to add a historical note that in the Declaration of Independence there is a mention that if a government becomes oppressive, the people have the right to abolish it.",
                "So Trump is sending his crony at the FBI, Kash Patel, to arrest judges standing up to him.\n\n*Yeah, that's definitely the sign of a properly functioning democracy.*",
                "Everyone in this administration deserves to end up in prison when this is all over. ",
                "Guys? You're under reacting. way under reacting",
                ">Patel wrote on X that the FBI believes Milwaukee Circuit Court Judge Hannah Dugan “intentionally misdirected federal agents away” from Eduardo Flores Ruiz as agents were attempting to arrest him at her courthouse last week.\n\nIt’s not what you believe, it’s what you can prove. It will be interesting to see what kind of case they have but my money is on the FBI over reaching here.",
                "Time for the National Strikes to begin. If they are arresting judges now for upholding the law, there is nothing left for this country. Time to shut it all down.",
                "This is deeply concerning. Meant to intimidate. I suppose it's a slight positive that Patel is not that smart and probably has no actual case."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Manhattan DA says attorney raped, electro-shocked, tortured women in his apartment",
            "external_url": "https://gothamist.com/news/manhattan-da-says-attorney-raped-electro-shocked-tortured-women-in-his-apartment",
            "upvotes": 1299,
            "date": "04/25/2025",
            "thumbnail": "https://api-prod.gothamist.com/images/350893/fill-1200x650|format-webp|webpquality-85/",
            "top_comments": [
                "[More info](https://apnews.com/article/manhattan-private-equity-sexual-assault-93890bd429eaf864407207c55f7a7ee5):\n\n>A private equity executive turned his New York City apartment into a torture chamber of “grotesque sexual violence,” Manhattan prosecutors said Thursday. He is accused of raping six women over five months in a depraved rampage in which he allegedly punched, waterboarded and shocked victims with a cattle prod and kept recordings of the assaults as trophies.\n\n>Ryan Hemphill, who remains jailed after his arrest last month, pleaded not guilty to a 116-count indictment charging him with predatory sexual assault and other crimes dating to last October. The 43-year-old, who is also a lawyer, threatened to have victims arrested or disappeared in a bid to keep them silent, prosecutors said.",
                "Holy shit private equity executive. These people are fucked. ",
                "[removed]",
                "It concerns me that he worked overseas with children. If he's willing to torture and threaten these women here in America, imagine the fucked up crimes he potentially committed in developing countries.",
                "From the comments on the article:\n\n>Zazuum\n>17h ago\n>Outside of his professional endeavors, Ryan Hemphill is a committed philanthropist who is passionate about giving back to his community and others around the world. Ryan operated as Youth Ambassador to the NGO Voices of African Mothers for the former CFO of UN Peacekeeping where he helped initiate the development of a school for young women in Ghana. In 2009, Ryan Hemphill coordinated and directed the Bronx Opera Children’s Program, which performs excerpts of the latest Bronx Opera productions for schoolchildren between the ages of 5 and 15 in order to give them access the arts when they may not be able to experience it otherwise.\n\n>^ Well, someone needs to check both programs",
                "I bet this guy has an amazing business card.",
                "https://ryanhemphill.nyc/",
                "[removed]",
                "How the hell was this able to go on for 6 months with 5 different women?! Cattle prods and shock collars?!",
                "Found a pic of him from the last time he got in trouble for abusing women:\n\n[https://archive.ph/wU24j](https://archive.ph/wU24j)"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "California’s economy surpasses Japan’s as it becomes fourth largest in world",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/24/california-economy-japan-gavin-newsom?utm_source=substack&utm_medium=email",
            "upvotes": 2355,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/938f0112d71adef10ac1e9e9b33960fe42957355/0_92_2774_1665/master/2774.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f42dd3033c917d012c2a14d492480724",
            "top_comments": [
                "But conservatives said that it's a failed state.are you implying that they lied?",
                "California population 40million. Japan population 125 million.\n\nJapanese are known to be some of the hardest working people in the world, yet here we are in California with 1/3 the population and still cranking out numbers to match entire nations. It really is something Californians should be proud of.\n\nOne of the biggest overlooked things is California's education system. Our UC and Cal State system consistently cranks out some of the smartest and brightest young adults in the world. \n\nCalifornia also has some of the best labor laws to protect workers compared to many other states.",
                "And why does California need the other 49 states?",
                "MAGA screams daily (in every possible form of media) that hundreds of thousands of people are leaving California every second.  They scream that California is a dead and broken state.  A poor state.  A place only fit for the criminals that have illegally entered the US.  \n\nAnd yet.....Cali is now the 4th largest economy on the planet. \n\nBoth these things can't be true.  One is instantly and credibly verifiable using financial data.  The other is the slobbering moans of insipid losers.",
                "I'm surprised Trump hasn't started a trade war with California yet.",
                "As a Midwesterner and a lover of my city ...I've lately caught myself asking myself \"hm...can I find a job in Cali that offsets the cost of living? What about other blue states?\" 🤔",
                "Tomorrow, Trump tweets about tariffs on California for a negative trade relationship or what the fuck ever.",
                "Why doesn't Cali just buy it's own SCOTUS judges and Congress critters? If Russia can do it, they can too!",
                "It'll be interesting when they have the next disaster and Benedict Donald says FEMA is broke. I hope they refuse to send their tax money to the taker red states.",
                "Underrated tidbit of info from the article:\n\n\"California is a major contributor to economic growth nationally, with the money it sends to the federal government outpacing what it receives in federal funding by $83bn...\""
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "US prosecutors to seek death penalty against Luigi Mangione in UnitedHealth executive’s murder",
            "external_url": "https://www.reuters.com/world/us/prosecutors-file-formal-notice-plan-seek-death-penalty-luigi-mangione-2025-04-25/",
            "upvotes": 2229,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Mass shooter at a school? Life in prison.\n\n\nKill a rich person? DEATH PENALTY.",
                "They want to make an example out of him. Shame that our government cares more about the life of one CEO than it does about the wellbeing of its citizens who are forced to rely on substandard health insurance coverage and labyrinthian claims processes.",
                "Interesting to note that racially motivated mass shooters don't get the prosecutors this bloodthirsty for a death penalty case (and the cops will take them out for burger king on the way to jail in some cases!)",
                "In justifying their decision, prosecutors wrote in their filing that Mangione \"presents a future danger because he expressed an intent to target an entire industry, and rally political and social opposition to that industry, by engaging in an act of lethal violence.\"",
                ">Mr Mangione is facing 11 state criminal counts in New York, including first-degree murder and murder as a crime of terrorism.\n\n\n>But federal prosecutors have also separately charged Mr Mangione for using a firearm to commit murder and interstate stalking resulting in death. These charges make him eligible for the death penalty.\n\nFar be it from me to want to bring up DOGE, but if the state has a really good case, why is the federal government piling on and wasting taxpayer money? It's possible *if* something jury nullification comes into play and the accused is acquitted on all charges on the state level, the federal government can still step in and charge this man for the crimes listed above. But that's only if something like an acquittal happens at the state level, for something like jury nullification.",
                "Is it normal for the attorney general to taint a trial by calling the defendant a murderer on live TV? You know, before any juries have been selected?",
                "are we even sure he did it",
                "Last i checked a significant amount of school shooters have not gotten the death penalty?",
                "They just gave the highland park shooter life in prison for killing 7 and injuring atleast a dozen others but this dude gets one rich dude and they'll probably chop his head off on live TV",
                "This feels like a quite typical knee jerk reaction from this administration. They’re clearly concerned, and even scared, by the positive response from a lot of people, and so think that the best idea is to get rid of him. Instead, they’re martyring him."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Hidden magma cap discovered at Yellowstone National Park",
            "external_url": "https://abcnews.go.com/US/hidden-magma-cap-discovered-yellowstone-national-park/story?id=121083908",
            "upvotes": 312,
            "date": "04/25/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8dbdc40f-591f-4937-806c-efad4fa064c1/yellowstone-01-gty-jef-250423_1745423218204_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Geoscientists have discovered a magma cap at Yellowstone National Park that is likely playing a critical role in preventing a massive eruption in one of the largest active volcanic systems in the world.\n\nOh, interesting. That Yellowstone caldera from the movie 2012 seems to be farther from reality.",
                ">Geoscientists have discovered a magma cap at Yellowstone National Park that is likely playing a critical role in preventing a massive eruption in one of the largest active volcanic systems in the world.\n\nThat's interesting.\n\n>The scientists found the cap by using a 53,000-pound vibroseis truck, a device capable of injecting low-frequency vibrations into the Earth to study the geology of the volcanic system. By generating tiny earthquakes that send seismic waves into the ground, the researchers were able to measure how the waves reflected off subsurface layers.\n\nHmmm... if it's really doing what they say it's doing, I hope they stop injecting it with underground earthquakes.",
                "Mr. Yellowstone. Respectfully, please leave your cap on.",
                "Keep JD Vance away from there!",
                "FFS, Yellow Stone, this isn't the time for such delay tactics. Just erupt already and put us out of our misery.\n\n>Volcanic eruptions can then occur as the bubbles accumulate and increase in buoyancy, driving an explosion.\n\n>An eruption at Yellowstone, however, is likely not imminent, the researchers said.\n\n>Data from seismic imaging and advanced computer modeling indicates that the magma reservoir is actively releasing gas and remains in a stable state. The system was described by Schmandt as \"steady breathing,\" with the bubbles rising and releasing through the porous rock of the magma cap.\n\nCan we maybe just pave over some of that to trap the gases?",
                "On first pass I read that as maga ... the Internet has ruined me",
                "For a minute I thought the headline was “MAGA” cap.  Which would be ironic because MAGA is firing much of US forestry staff.  Lol.",
                "magma cap or maga hat?",
                "Ugh I read MAGA cap..... I need to go camping this weekend and leave the phone at home. See y'all Monday 👋",
                "Trump can use it to get the money and melt every city with liquid hot magma! \n\nHonestly, throw me a bone here!"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "China quietly rolls back retaliatory tariffs on some US-made semiconductors, import agencies say",
            "external_url": "https://edition.cnn.com/2025/04/25/business/china-us-tariffs-semiconductors-exemptions-hnk-intl?cid=external-feeds_iluminar_google",
            "upvotes": 318,
            "date": "04/25/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-15t045902z-1569210894-rc2vcz9qv2nu-rtrmadp-3-usa-trump-taiwan.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "> On April 11, Trump exempted imports of electronics such as smartphones and computers from his “reciprocal” tariffs. That exemption has had a major impact on tech giants like Apple, which make iPhones and other products in China.\n\nThis is after Trump's already done the same for some Chinese goods.",
                "Waiting for Trump to declare total victory",
                "How is it quiet if it’s on CNN?",
                "China just ate our lunch",
                "China showed they need these US imports. Trump can use this by increasing export requirements to China of critical semiconductors to pressure China to negotiate.",
                "China is only trying to save face. That is why they will say they aren’t talking when they actually are or roll back tariffs but not publish the information with a large media campaign. It’s all about saving face culturally.\n\nThem showing the “real suppliers” for luxury brands even though they were just dupe factories is a psyop  trying to get people to still buy products. People don’t want a dupe Birkin bag without the Hermes logo…. People want the status symbol of the logo",
                "[deleted]"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Russian general killed in car blast hours before US envoy’s Kremlin meeting",
            "external_url": "https://www.theguardian.com/world/2025/apr/25/russian-general-killed-car-blast-hours-before-us-envoy-kremlin-meeting-yaroslav-moskalik",
            "upvotes": 20318,
            "date": "04/25/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4beba3175180dee351a337f00ebd19d16476b431/0_512_7846_4708/master/7846.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=61cb3211834c5c69e12d02d112f966b7",
            "top_comments": [
                "Imagine scheduling peace talks and getting met with *“please hold, your general has exploded.”*",
                "Was he supposed to meet with Vance. He’s the harbinger of death",
                "He shouldn't have provoked the bomb, if he didn't want to be blown up.",
                "Are ya'll just finding out about this? Some dude named Pete texted me about it days ago.",
                "Oh well. No harm done.",
                "First thing I thought was, who did it. Ukrainians, anti war Russians, or Putin himself?",
                "Finally some good news",
                "Looks better than a window lintel, doesn't it?",
                "Ukraine lurking in the Signal chats.",
                "I’m imagining Hegseth bragging about the upcoming meeting in a Signal chat with his cousin, a makeup artist, his auto mechanic, and some rando nobody remembers adding called “Ukraine Central Intelligence”."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Highland Park shooter Robert Crimo III sentenced to life in prison without parole",
            "external_url": "https://abcnews.go.com/US/highland-park-shooter-robert-crimo-iii-sentenced-wednesday/story?id=121081551",
            "upvotes": 1531,
            "date": "04/25/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/902c2238-fe31-4a8d-81fe-2a06a7d83d6e/CrimoIII1-ap-ml-250303_1741017143820_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Where the hell is his frontal lobe? Dude Looks like he's missing more than a third of his brain, arguably the most important part.",
                "So this is one of those heinous criminals that will be sent to El Salvador, right??\n\nTrump said homegrowns that commit horrible, despicable crimes will be sent to El Salvador.  I can't think of a worse crime, than a mass shooter!",
                "Good thing he didn’t vandalize a Tesla.",
                "It took 3 years to convict him?",
                "Forgot how ugly he is",
                "I didn't remember this one until I looked it up, too many to sort through. 😔💔",
                "Is ABC using AI for images now, or does this guy look so \"uncanny valley\" in real life? That head is built for a 1960s claymation character.",
                "Sad part is I am scratching my head trying to remember “which mass shooting was this one”?",
                "Why did he get a fair trial? Why wasn’t he just deported to El Salvador?",
                "His last name is fitting"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Houthi rebels have shot down 7 US Reaper drones worth $200 million in recent weeks",
            "external_url": "https://apnews.com/article/houthis-us-warships-red-sea-e6e97a7131c48640ccf74b1916628234",
            "upvotes": 1944,
            "date": "04/25/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "In related news, Signal has leaped to the front of the smartphone top downlads list in Yemen.",
                "Meanwhile, Hegseth needs a makeup chair.",
                "Aren’t we just feeding them reaper drones at this rate",
                "Anyone know who \"Ted Houthi\" is on the text thread? -- Pete Hegseth",
                "Sounds less rebel-ly and a bit more know-what-they're-doing-y.",
                "I have to give up up healthcare for this?",
                "They cost that much, not worth that much. Big diiference.",
                "Military is an absolute joke right now",
                "What would the cost be of losing an F-35? How about two or possibly more? What would the cost be of having a naval aviator or two captured be? What would the political cost be of having a pilot paraded before the cameras of the world be? What intelligence would such captures be able to reveal? Such costs would be far greater. \n\nDrones like these are designed to take the place of manned flights. Such drones are designed to be expendable. The 200 million spent pales in comparison to what it could have cost the nation. They did their job.",
                "didn't happen with the other guy in charge hmm"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Pete Hegseth had an unsecured internet line set up in his office to connect to Signal, AP sources say",
            "external_url": "https://www.ctvnews.ca/world/article/pete-hegseth-had-an-unsecured-internet-line-set-up-in-his-office-to-connect-to-signal-ap-sources-say/",
            "upvotes": 39481,
            "date": "04/25/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/4YEWSMJAY45CNMAAARZCB6XHPQ.jpg?smart=true&auth=334b1defe62b2a369ef8b3cd017a963865ba09c3918db0420f3c9cfb5b8aa9d9&width=1200&height=630",
            "top_comments": [
                "“U.S. Defense Secretary Pete Hegseth had an internet connection that bypassed the Pentagon’s security protocols set up in his office to use the Signal messaging app on a personal computer, two people familiar with the line told The Associated Press.\n\nThe existence of the unsecured internet connection is the latest revelation about Hegseth’s use of the unclassified app and raises the possibility that sensitive defense information could have been put at risk of potential hacking or surveillance.”",
                "So he's just trying to hide some illegal shit at this point.",
                "What’s this fuckers obsession with signal?",
                "He has also been having a mental breakdown on television, he needs to be removed from his position as soon as possible. He is a danger to the safety of the United States. ",
                "....which synced to his phone though Bluetooth or WiFi. \n\nThe most powerful military leader -has an open internet computer, inside his office, that synced to his phone app everytime he sat down.",
                "But, Hillary’s emails..",
                "Seriously can this dude be arrested or something. This is outright blatant security violations. He should be in GITMO",
                "I mean, just out of curiosity, how do you get an insecure line added in the pentagon? Did they call up and have their ISP drill a new line in? I feel like someone somewhere had to say “yah we can’t really approve this”. It’s not like he dragged a cable through the building himself.",
                ".....\n\nHilarys fucking emails....\n\nHunter Bidens laptop.\n\nJfc I hate these fascists and the dumb sheep that listen to them.",
                "i miss having a government made of even 50% competent upper management"
            ],
            "aggregate_sentiment": 58.0
        }
    ],
    "last_updated": "04/25/2025 16:10:45 UTC"
}