{
    "posts": [
        {
            "category": "HOT",
            "title": "Trump signs election order calling for proof of U.S. citizenship to vote",
            "external_url": "https://www.reuters.com/world/us/trump-signs-election-order-calling-proof-us-citizenship-vote-2025-03-26/",
            "upvotes": 22003,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I don't understand, aren't only citizens allowed to vote?",
                "Considering this isn’t a law, that voting is up to the states, this is mostly a Big Mac fueled fart in the wind.",
                "Meanwhile, Elon came over on a student visa. Stayed after it had expired… and now has more power than any US citizen",
                "States rights except when it is against Trumps agenda",
                "Oh hey ... those people who were really upset about overreach of the federal government. Are you all gonna be mad about Trump taking away a right reserved for the states?",
                "They aren't doing this because they expect States to follow the requirements. They are doing it because they expect *certain* states *won't*.\n\nThis is setting up a pretext for invalidating legal votes from registered voters, American citizens, specifically from blue States. \n\nThis needs to be heavily challenged in the courts and we should all hope it is shot down, because hell will break loose if the will of the people of entire States is disregarded.",
                "Article I, Section 4, Clause 1\n\n>The Times, Places and Manner of holding Elections for Senators and Representatives, shall be prescribed in each State by the Legislature thereof; but the Congress may at any time by Law make or alter such Regulations, except as to the Places of chusing Senators.\n\n\nStates or Congress.  The Executive have the power to do change state or federal laws.  This is yet another impeachable offense, yet congress is full of feckless cowards.",
                "Trump will announce that the 2028 election has too many security failures and declare a state of emergency over election interference early in the year. The election may be cancelled.\n\nWe are right in the middle of it, folks. This is not my random redditor theory, this is the discussion being held about Trump trying to subvert term limits and how he'll do it. Prepare your pitchforks now, you'll need them in a few years.",
                "If they provide free, EASILY ATTAINABLE, federal ID for this purpose then I say go ahead. We all know they won’t though",
                "I'd be ok with voter ID if everyone registered to vote was also given an ID for proof of identification."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Exclusive: DOGE staffer, 'Big Balls', provided tech support to cybercrime ring, records show",
            "external_url": "https://www.reuters.com/world/us/doge-staffer-big-balls-provided-tech-support-cybercrime-ring-records-show-2025-03-26/?utm_source=reddit.com",
            "upvotes": 31188,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ok, as a reminder to everyone about \"Big Balls\".  \n\nHe is the grandson of a KGB spy.\n\nHe was fired from an internship at a cyber security company for leaking company info to a competitor. \n\nAnd now we know he's involved with crime rings.",
                "He still does, but he used to, too.",
                "The people involved with modifying code on our most sensitive electronic systems are not only just fresh out of school, but are sketchy as hell. \n\nAs a cybersecurity professional, I'm terrified. \n\nMost people can't comprehend how bad this stuff is.\n\nEdit: \n\nHere's a fun thought experiment:\n\n1) Look at the cybersecurity actions taken by this administration. \n2) Think about what actions a compromised President/Cabinet would take regarding cybersecurity. \n3) Ask yourself, what actions would a foreign agent of Russia take that ARE ANY DIFFERENT than what we all have seen up to this point. \n\nEducate yourself! The ONLY way ANY of this makes sense is with this context. Krasnov is destroying this country.\n\nhttps://www.csoonline.com/article/3829710/firing-of-130-cisa-staff-worries-cybersecurity-industry.html/amp/\n\nhttps://www.cybersecuritydive.com/news/dhs-disbands-advisory-board-csrb/737976/\n\nhttps://gizmodo.com/trumps-defense-secretary-hegseth-orders-cyber-command-to-stand-down-on-all-russia-operations-2000570343\n\nhttps://www.euronews.com/my-europe/2025/03/13/fact-checking-online-claims-that-donald-trump-was-recruited-by-the-kgb-as-krasnov",
                "You mean the guys who use ICE to run the country like a mob hire people from the underworld?",
                "He will work for any cybercrime group. He has chosen DOGE in this case.",
                "I There's something so deeply unsettling about the fact that literally a group of people from 4chan are not only in charge of the US government, but have proceeded to transform said government according to 4chan's ideal of the perfect government and are also implementing 4chan lingo into the government itself. I don't think i'll ever be able to get used to this. Even 60 years from now i feel like i'll still remember this period and continue to wonder \"wtf happened there?\"",
                "If you want to use criminal tactics to be successful criminals, hire criminals.",
                "We already know he's working with Elon and Trump. Nothing new.",
                "This is not the level of professionalism we expect from Big Balls.",
                "SOB ... 28 years, 3 time polygraphed ... friends I hadn't seen in years contacted by Suits & Ray-Bans and they let this little fucker have free reign over entire CRITICAL systems???\n\nI'm fucking pissed.\n\nTHIS should get people out in the streets!"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "The Atlantic publishes additional trove of Signal messages with details of Yemen strike",
            "external_url": "https://www.cnn.com/2025/03/26/politics/the-atlantic-publishes-signal-messages-yemen-strike/index.html",
            "upvotes": 8431,
            "date": "03/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2204323444.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So we already knew every single turd in the committee hearings yesterday straight-up lied, prompting The Atlantic to post the rest of the transcripts.\n\nPlease, Senate Intelligence Committee, lay it on them THICK today.",
                "The Trump admin trying to downplay this is the most pathetic thing they've done in months. 'only the best people'. All Trump supporters are rubes.",
                "Looks like there was one responsible adult in this mess.\n\n>  “We did redact one piece of information because we felt, on our own, that we felt it was best to do. And the CIA asked us, but, you know, at a certain point, the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves,” \n\n-- Jeffrey Goldberg\n\n> “Weather is FAVORABLE. Just CONFIRMED w/CENTCOM we are a GO for mission launch,” Hegseth wrote. \n\n> This entire story was another hoax written by a Trump-hater who is well-known for his sensationalist spin,” White House press secretary Karoline Leavitt said \n\n> “You’re talking about a deceitful and highly discredited so-called journalist who’s made a profession of peddling hoaxes time and time again,” Hegseth said. \n\n> Britt  Hume was quick to point out the glaring flaw in Hegseth’s excuse: It wasn’t a hoax, as the National Security Council confirmed that the messages accidentally sent to Goldberg were legit:",
                "Goldberg is being incredibly patriotic here, he is taking on a great personal risk against a regime that controls the most powerful government in the world. This regime is made up of truly incompetent bad faith actors, we should all remember that moving forward, whatever happens- these people running our country are incredibly dumb. They can be defeated.",
                "*\"the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves\"*\n\nBrilliant. Absolutely calling their bluff.",
                "Not a day goes by that this clown fiesta of an administration fails to blow my mind.",
                "I don't even get what the point of him sharing all these details in real time with that group chat to begin with? Just send a recap when it's over. It's like he was trying to show off or some shit",
                "Funny how the GOP used to have fake outrage fits out of things 1,000 times smaller than this.",
                "Already lots of bots on twitter trying to claim this is all fine. Not sure what else I expected.",
                "I do find it so funny that half of these clowns will wax for hours about how much money we burned in Ukraine or whatever, but these strike packages are big emoji worthy after burning whatever the cost in munitions, fuel and logistics were."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Brazil Supreme Court to put Bolsonaro on trial for alleged coup attempt",
            "external_url": "https://www.reuters.com/world/americas/brazil-top-court-justice-recommends-that-bolsonaro-stand-trial-alleged-coup-2025-03-26/",
            "upvotes": 3632,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Good job Brazil. I like it when people are held accountable for their actions.",
                "That's wild, I thought you were supposed re-elect people who attempt coups...",
                "Wow, just imagine what we could have had if Merrick Garland hadn’t been an absolutely worthless piece of shit.",
                "Accountability for actions?! What’s this nonsense!",
                "So South Korea and Brazil have better democracies than the United States.",
                "Good job brazil 👏🏾 this is what america shouldve done with our felon in chief",
                "Brazil picking up a lot of ground against USA when it comes to accountability and corruption. What’s curious is that Brazil always copies American politics, but now are forging their own path. Good for them and I hope the crime rate gets fixed next.",
                "Thank you Merrick Garland, for showing the world the dangers of a pathetically weak judicial system.  May they learn from our incompetence. \n\nMerrick Garland will go down in history as the enabler of American Fascism .",
                "Be glad to see a resolution to all of this.",
                "Imprison his fascist ass"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "3 teen girls try to stab mom for turning off Wi-Fi: Sheriff",
            "external_url": "https://abcnews.go.com/US/3-teens-stab-mom-turning-off-wi-fi/story?id=120126479",
            "upvotes": 3368,
            "date": "03/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/57abeb79-c721-4134-b0bf-7962bc0fec4b/teens-wifi-stabbing-ktrk-jef-250325_1742907203519_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "> Because the mom turned off the Wi-Fi, the teens allegedly grabbed kitchen knives Sunday night and chased their mother through their Houston home and into the street, according to the sheriff. One of the girls threw a brick that hit their 39-year old mom in the ankle, and the girls' 70-year-old grandmother was knocked over while attempting to protect the mom, the sheriff's office said.\n\nAll three daughters tried to kill their mother over losing the internet. There's something more going on in that family dynamic if this kind of violent outburst happens.",
                "This is the behavior of addicts. I’ve been an addict most of my life. I’ve been clean for years and years but I recognize addictive behavior. Take away my drugs and I would have likely stabbed you at the worst points in my life. Social media is being designed to be addictive and it’s working.",
                "thank god I grew up in the 2000s when phones were only good for calls and texts and riding bikes all day with your friends till the sun set was still the thing to do ",
                "I would say I'm attached to my phone non stop. I am 32 though so for all of my childhood phones were useless, just good enough to call and text on and the odd game of snake. Then as I got into the work place as a young teen smart phones started but they were still \"ok\". Now I know the amount I use my phone is too much, but I'm also an adult that remembers not having one, so in situations where I can't use it, it doesn't bother me. I really do not envy a parent of a child old enough to use a phone.",
                "Bring back mental institutions but with wifi and gaming.  These kids will sign up for it.",
                "I was literally choked by my step son who at the time was 17 because I unplugged the router. He refused to go pick up his mother from work (he had taken her car and dropped her off) because he was in the middle of a League of Legends game. \n\nAt the time I was routinely doing dialysis and very weak, the only way I got him to release me was by biting his hand as hard as I fucking could. And then this little bastard rips the router out of the wall (cable) and throws it in the yard. \n\nThe addiction to the internet is absolutely crazy. Had the same kid punch a hole in my door and assault me again before he was literally thrown out. And then he has the audacity to invite me to his wedding like none of this happened. \n\nI feel for this mom. You love your kids and step kids, but these kids need to learn. Send their asses to jail or juvenile detention before they continue down this path in life.",
                "This seems not very well thought out because who’s going to pay for the WiFi?",
                "...all 3? \n\nLike not one of them said \"wait, what are we doing?\".",
                "As a mom, I would not take them back. They belong to the state now.",
                "The Veldt- Ray Bradbury"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Person in Ohio dies of rabies after contracting virus from organ transplant",
            "external_url": "https://www.whio.com/news/local/person-dies-rabies-after-contracting-virus-organ-transplant/HMS5STBDHZESJJ7FU6464OMN3I/",
            "upvotes": 838,
            "date": "03/26/2025",
            "thumbnail": "https://cmg-cmg-tv-10040-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fcmg%2FYPMX5TX5QVGJJLZSDGUPWR7NGQ.jpg?auth=612d61eb069c04a50f81fce2778338c3c1cbaaf0f16c60a6d2c3cbff7f510de5&width=1200&height=630&smart=true",
            "top_comments": [
                "Wtf. So did the donor die of rabies too or just somehow died before the rabies set in and they didn’t know? So sad",
                "Didn't this happen in an episode of Scrubs?",
                "from the article:\n\n26 March 2025\n\nLUCAS COUNTY — A person died from rabies after receiving a transplanted organ in Lucas County earlier this year:\n\n>The recipient, who had undergone a kidney transplant in December, contracted the viral disease through the donated organ, according to the Toledo-Lucas County Health Department, WTOL reported.\n\n>As the recipient was from Michigan, Michigan’s Department of Health and Human Services worked with the Ohio Department of Health and the Centers for Disease Control and Prevention to investigate the case.\n\n>It marks the first human case of rabies in Michigan since 2009, according to WTOL.\n\n>No additional individuals are at risk of rabies exposure, according to the CDC.\n\n>Kara Steele, a representative from Life Connection of Ohio, could not comment on the specific case but explained to WTOL that a donor risk assessment interview is conducted before any organ donation.\n\n>The identities of both the recipient and the donor have not been released.\n\n>The facility where the transplant took place has also not been disclosed. \n\n>However, according to the University of Toledo Medical Center’s website, it is the only organ transplant center in northwest Ohio.\n\n>Fewer than 10 people in the United States die from rabies each year, according to the CDC.",
                "That's some fuck you in particular level shit.",
                "Real life scrubs episodes.  Poor person",
                "The donor had rabies, but died of something else? This is really bizarre.",
                "The donor was actually 3 raccoons in a trench coat",
                "Someone check on Dr. Cox.",
                "Wow! That's a nightmare.",
                "There are other viruses where this has happened. There was a case that a donor got LCMV from his pet hamster and got into an accident.  7 out of 8 donors who go his organs died of LCMV, which is not considered wildly dangerous in humans.\n\nhttps://www.nejm.org/doi/full/10.1056/NEJMoa053240"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Second woman is strangled during an overnight visit at the same California prison",
            "external_url": "https://www.nbcnews.com/news/us-news/second-woman-strangled-overnight-visit-california-prison-rcna197785",
            "upvotes": 1136,
            "date": "03/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250324-Stephanie-Dowells-se-12313p-58faba.jpg",
            "top_comments": [
                "They might wanna stop these visits altogether.\n\nOr at least give these ladies a f'ng panic button?\n\n\"He's coming in for the kill! AGAIN!\"",
                "from the article:\n\n24 March 2025\n\nThe family of a woman who died of strangulation during an overnight visit with her husband at a California prison is questioning why a man convicted of murdering four people was allowed to have family visits:\n\n>Stephanie Diane Dowells, 62, who also went by the name Stephanie Brinson, was killed in November, making her the second person in a year to die at Mule Creek State Prison in Ione during a family visit, according to the California Department of Corrections and Rehabilitation.\n\n>The other victim, Tania Thomas, 47, was also strangled during a family visit, Amador County District Attorney Todd Riebe said in an interview Monday. The man she was visiting has been charged with murder in connection with her killing, Riebe said.\n\n>Dowells, a hairdresser, was killed while visiting her husband, David Brinson, 54, who was convicted in the 1990s of murdering four men during a robbery, and sentenced to four consecutive life terms without the possibility of parole.\n\n>After Brinson called prison officials at 2:04 a.m. on Nov. 13 to tell them his wife had passed out, officers immediately began life-saving measures and called 911, a spokesperson for the California Department of Corrections and Rehabilitation said. \n\n>But Dowells was pronounced dead a short time later.\n\n>Dowells’ killing remains under investigation by prison officials and the district attorney’s office, the spokesperson said. \n\n>Riebe said charges are pending prison and autopsy reports.",
                "Absolutely insane that someone serving four life sentences for murder was allowed unsupervised overnight visits. Then it happens TWICE at the same prison? The system completely failed these women.\n\nThe fact that her son didn't even know his mom's husband had murdered four people is heartbreaking. They trusted this man enough to let their 3 year old visit him. Like what kind of vetting process is the prison using? The prison needs to answer for this. These weren't random acts they gave violent offenders private access to vulnerable visitors. How many more women need to die before they fix this broken system?",
                "Like someone said in the last thread about this, homeboy is going to end up in a trash bag pretty soon because goodbye conjugal visits!",
                "I know I'm victim blaming here but why would you want to go have sex with someone who's been convicted of murdering 4 people?",
                "It’s almost as if giving serial killers special privileges in prison is a bad idea.",
                "Why are sex visits allowed at all?",
                "[removed]",
                "> visit a murderer, get murdered\n\nQuelle surprise",
                "So many valid questions but I wonder “Why would you kill someone that is still willing to have sex with you?” \nI mean that probably means this also was the last time they will ever have sex."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Supreme Court upholds Biden regulations on 'ghost gun' kits",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-upholds-biden-regulations-ghost-gun-kits-rcna180991",
            "upvotes": 1863,
            "date": "03/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-10/241007-ghost-gun-vl-105p-007c05.jpg",
            "top_comments": [
                "7-2 decision with Neil Gorsuch writing for the majority.",
                "Why hasn't trump abolished the NFA and the defunded ATF at this point?   The right has been against the ATF and has encumbered them at every turn.   Why not target those employees for cuts and effectively cripple the ATF?",
                "So now you have to buy the parts kit and the ~~stripped~~ 80% lower separately?  I can see how legally this could be a justified ruling, but I don't see how this will actually stop people from buying these easy enough to build kits.  \n\nSeems like a huge waste of government resources just to make sure the incomplete lower receiver is in a separate package.",
                "This was a no-brainer ruling with even normally far right judges ruling ghost guns need to be regulated. A kid was shot at a local high school (and survived) with a ghost gun. The 16 year old shooter ordered the kit online and made it himself at home. Why would anyone not think something should be done to prevent this?",
                "What’s the legal status of existing ghost guns? This seems to only talk about the sale of new kits.",
                "Are Ghost Guns that aren’t lethal illegal?",
                "How are the ghost busters gonna kill ghosts",
                "Another poorly thought-out SCOTUS decision.  Without ghost guns, the ghost of King George could just materialize in your home and start bossing you around.",
                "...only because allowing them would cut into corporate profits.  SCOTUS doesn't give two shits about you or your safety.",
                "Bad news for corrupt NRA and MAGA gun lovers."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Illinois returns stolen land to Prairie Band Potawatomi Nation",
            "external_url": "https://abcnews.go.com/US/wireStory/illinois-returns-stolen-land-prairie-band-potawatomi-nation-120144789",
            "upvotes": 1062,
            "date": "03/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/68d4b9ed-826a-487e-9e90-00953dee1db2/wirestory_805f5030d9abbac93ce3da3cec18a636_16x9.jpg?w=1600",
            "top_comments": [
                "I’m still baffled by how little attention our historical treatment and abuse of Native Americans receives in our media and our politics.  They are probably the most marginalized and mistreated of all citizens and very few people seem to care.",
                "[The treaty gave land to some chiefs directly](https://www.archives.gov/news/articles/prairie-du-chien-treaty) and forced the Potawatomi off their lands. The article mentions the chief was visiting family in Kansas when the land was stolen.",
                "This is huge, glad this is happening in my state. ",
                "This is a great step! I hope to see more cooperation with Land Back movements to support the indigenous peoples of this land.",
                "> He did not rule out constructing a hotel, however, noting that the park, 68 miles (109 kilometers) west of Chicago, has 150 campsites, draws 500,000 visitors a year, and the closest lodging is a 20-minute drive away.\n\nAnd once you have a hotel there you'll need some restaurants.  Probably a gas station or a \"Travel Center\" too.  Maybe an events center, like a place where you could hold concerts.  \n\nAt least that's how it goes in California.",
                "Now return the rest of the land",
                "Don't tell Indiana, we'll want it to go along with those Illinois counties that are trying to secede.",
                "Way too little too late, but damn even this small win is nice",
                "The only thing about the us which makes sense. The rest just makes it look like it’s a social experiment"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "HOT",
            "title": "Delaware lawmakers approve corporate bill that critics call giveaway to billionaires",
            "external_url": "https://www.reuters.com/world/us/delaware-lawmakers-vote-corporate-bill-critics-call-giveaway-billionaires-2025-03-25/",
            "upvotes": 644,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What? Delaware catering to corporations? When did this start happening? /s",
                "Delaware exists to cater to corporations and rich people.\n\nBiden knew it, so does Helly R",
                "And as far as Delawareans are concerned, as long as their taxes stay low and they continue to have no sales tax, they’re ok with it.",
                "They've destroyed so many things in the name of \"maximizing shareholders value.\" And now they're taking down shareholders' power over them because it's become an inconvenience. \n\nThis concentration of power and wealth with zero accountability never leads to any good outcomes. \n\nI hope they one day get treated with the same amount of contempt they have for the rest of us.",
                "There was some public outcry over this, but really not much, or nearly enough. I saw some signs posted near roadways...but thats kinda it. The major problems are: \n\n1. That the bill at hand is a little complicated for the average person to understand. Why should the average person care about what rights shareholders have in the Court of Chancery? \n\n 2. A third of the State's revenue come from all the corporations stationed here.\n\nHere's a local Delaware article about the bill: [https://www.delawarepublic.org/politics-government/2025-03-25/delaware-house-passes-corporate-law-overhaul-after-rejecting-five-proposed-changes](https://www.delawarepublic.org/politics-government/2025-03-25/delaware-house-passes-corporate-law-overhaul-after-rejecting-five-proposed-changes)\n\n  \nThis wasn't a MAGA thing, this has been a blue state for awhile, with mostly blue representatives. I don't know if the reps votes were bought for (believable), or that they believe the threat of companies leaving was too great for the state. Shoutout to the few reps (Sophie Phillips, Madinah Wilson-Anton, Frank Burns), that crafted amendments trying to reign the bill back in somewhat, even if they didn't succeed",
                "There are PEOPLE in Delaware?! Not just P.O. Boxes??",
                "> The bill mostly impacts companies with a controlling shareholder, like Meta Platforms (META.O), which is controlled by Zuckerberg. The proposal provides steps that allow for a company and its controlling shareholder to arrange deals, such as selling corporate assets to the controller, **that cannot be challenged in court by the company's other investors.**\n\n...\n\n> The bill prevents shareholders from challenging deals that are approved by a board committee that has a majority of independent directors or by a vote by public shareholders. The bill also limits records available to shareholders who want to investigate a deal for conflicts.\n\n> Numerous amendments were rejected, including one that would have eliminated the law's retroactive effective date. The law will be effective back to February 17, which one lawmaker said would eliminate potential legal liability for unspecified claims that he said shareholders were investigating against the board of Meta Platforms.\n\nSo if a deal (I guess between a company and a controlling shareholder?) was approved by a majority of *independent* directors or by a vote of public shareholders, it can't be challenged in court. That's... gonna be honest, I'm not keen on that. I'm not a big fan of not being able to challenge deals in court. \n\nBut at first glance it doesn't sound like the end of the world, though that may just be me having trouble actually envisioning scenarios like that (help me, corporate lawyers). But at least as long as the deals aren't beholden to conflicts of interest...\n\n...oh. Right. It also limits records available to investigate conflicts.\n\nGotta say, toe-deep knowledge of corporate law though I may have, I don't think it looks good. Especially the retroactive bit seeming to be specifically for Meta.",
                "Delaware: when you want the Canary Islands right here at home…."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Person in Ohio dies of rabies after contracting virus from organ transplant",
            "external_url": "https://www.whio.com/news/local/person-dies-rabies-after-contracting-virus-organ-transplant/HMS5STBDHZESJJ7FU6464OMN3I/",
            "upvotes": 829,
            "date": "03/26/2025",
            "thumbnail": "https://cmg-cmg-tv-10040-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fcmg%2FYPMX5TX5QVGJJLZSDGUPWR7NGQ.jpg?auth=612d61eb069c04a50f81fce2778338c3c1cbaaf0f16c60a6d2c3cbff7f510de5&width=1200&height=630&smart=true",
            "top_comments": [
                "Wtf. So did the donor die of rabies too or just somehow died before the rabies set in and they didn’t know? So sad",
                "Didn't this happen in an episode of Scrubs?",
                "from the article:\n\n26 March 2025\n\nLUCAS COUNTY — A person died from rabies after receiving a transplanted organ in Lucas County earlier this year:\n\n>The recipient, who had undergone a kidney transplant in December, contracted the viral disease through the donated organ, according to the Toledo-Lucas County Health Department, WTOL reported.\n\n>As the recipient was from Michigan, Michigan’s Department of Health and Human Services worked with the Ohio Department of Health and the Centers for Disease Control and Prevention to investigate the case.\n\n>It marks the first human case of rabies in Michigan since 2009, according to WTOL.\n\n>No additional individuals are at risk of rabies exposure, according to the CDC.\n\n>Kara Steele, a representative from Life Connection of Ohio, could not comment on the specific case but explained to WTOL that a donor risk assessment interview is conducted before any organ donation.\n\n>The identities of both the recipient and the donor have not been released.\n\n>The facility where the transplant took place has also not been disclosed. \n\n>However, according to the University of Toledo Medical Center’s website, it is the only organ transplant center in northwest Ohio.\n\n>Fewer than 10 people in the United States die from rabies each year, according to the CDC.",
                "That's some fuck you in particular level shit.",
                "Real life scrubs episodes.  Poor person",
                "The donor had rabies, but died of something else? This is really bizarre.",
                "The donor was actually 3 raccoons in a trench coat",
                "Someone check on Dr. Cox.",
                "Wow! That's a nightmare.",
                "There are other viruses where this has happened. There was a case that a donor got LCMV from his pet hamster and got into an accident.  7 out of 8 donors who go his organs died of LCMV, which is not considered wildly dangerous in humans.\n\nhttps://www.nejm.org/doi/full/10.1056/NEJMoa053240"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Dollar Tree sells Family Dollar to private equity firms",
            "external_url": "https://www.denver7.com/business/company-news/dollar-tree-sells-family-dollar-to-private-equity-firms",
            "upvotes": 120,
            "date": "03/26/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/f8635c0/2147483647/strip/true/crop/4939x2593+0+350/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F77%2Ff4%2F2502043d486aa4c49ca67482fd65%2Fap25085398616989.jpg",
            "top_comments": [
                "Family Dollar is toast. Private equity destroys everything it touches. They sink the ship while looting its hold every time.",
                ">Dollar Tree had been scouting options for Family Dollar for a while and said Wednesday that the sale to Brigade Capital Management and Macellum Capital Management will allow it to focus on its core business.\n\nBrigade Capital won some private equity award in the same year it was defrauded in a Ponzi scheme. Macellum Capital doesn't have a wiki page and LinkedIn shows they have 2-10 employees.",
                "Gonna get saddled with someone elses debt and crumble.",
                ">Dollar Tree sells Family Dollar to private equity firms\n\nIn related news... Family Dollar raises prices to $20.",
                "2 years until closing is my bet ",
                "Family dollar was already doing poorly.  Once Dollar Tree added non-\"dollar\" items it didn't make any sense to be running both brands either so it makes sense.",
                "5 years from now Family Dollar will be a corpse of a business",
                "Sell the land and buildings, then make the rent outrageous, then go bankrupt… investors make big $ folks loose their jobs and the food desert expands… capitalism.",
                "really unfortunate for all the people stuck in food deserts where family dollar is often the only store",
                "Commence shittier service in 3...2...1..."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "4 American soldiers are missing from a training area near Lithuania’s capital, the US military says",
            "external_url": "https://apnews.com/article/lithuania-pabrade-us-soldiers-military-training-c89957fc6a62da8624202095920630e1",
            "upvotes": 35,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Unfortunately [it looks like they didn't make it](https://www.theguardian.com/us-news/2025/mar/26/soldiers-missing-lithuania)",
                "Thanks Trump! So much winning"
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "NEW",
            "title": "Trump takes bid to slash teacher training funds to US Supreme Court",
            "external_url": "https://www.reuters.com/world/us/trump-takes-bid-slash-teacher-training-funds-us-supreme-court-2025-03-26/",
            "upvotes": 364,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump hates americans",
                "From the article:\n\ntrump “says funds promote divisive ideologies.”\n\nThis fucking guy.",
                "Is Trump following orders from Putin to destroy our country?",
                "Conservatives will bend over backwards to tell you that less teachers, and less educated teachers, is a good thing.",
                "Another Trump movie I hadn't heard of,\nIf he does enough stuff maybe we won't notice him stuffing his pockets.",
                "“I love the poorly educated.” -Krasnov",
                "Republicans love the uneducated, and there's no way this could be bad for America, right? Stone age America looks like the next step for the G.O.P.",
                "Dear Supreme Court, please slap down the 🍊🤡. We appreciate it. Sincerely, ethical Americans",
                "Great.  Uneducated educators teaching education.   Just what we need.  A whole generation of lost children.",
                "Here is why it's actually a good thing Trump is fighting tooth and nail to make our teachers worse..."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Delaware lawmakers approve corporate bill that critics call giveaway to billionaires",
            "external_url": "https://www.reuters.com/world/us/delaware-lawmakers-vote-corporate-bill-critics-call-giveaway-billionaires-2025-03-25/",
            "upvotes": 647,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What? Delaware catering to corporations? When did this start happening? /s",
                "Delaware exists to cater to corporations and rich people.\n\nBiden knew it, so does Helly R",
                "And as far as Delawareans are concerned, as long as their taxes stay low and they continue to have no sales tax, they’re ok with it.",
                "They've destroyed so many things in the name of \"maximizing shareholders value.\" And now they're taking down shareholders' power over them because it's become an inconvenience. \n\nThis concentration of power and wealth with zero accountability never leads to any good outcomes. \n\nI hope they one day get treated with the same amount of contempt they have for the rest of us.",
                "There was some public outcry over this, but really not much, or nearly enough. I saw some signs posted near roadways...but thats kinda it. The major problems are: \n\n1. That the bill at hand is a little complicated for the average person to understand. Why should the average person care about what rights shareholders have in the Court of Chancery? \n\n 2. A third of the State's revenue come from all the corporations stationed here.\n\nHere's a local Delaware article about the bill: [https://www.delawarepublic.org/politics-government/2025-03-25/delaware-house-passes-corporate-law-overhaul-after-rejecting-five-proposed-changes](https://www.delawarepublic.org/politics-government/2025-03-25/delaware-house-passes-corporate-law-overhaul-after-rejecting-five-proposed-changes)\n\n  \nThis wasn't a MAGA thing, this has been a blue state for awhile, with mostly blue representatives. I don't know if the reps votes were bought for (believable), or that they believe the threat of companies leaving was too great for the state. Shoutout to the few reps (Sophie Phillips, Madinah Wilson-Anton, Frank Burns), that crafted amendments trying to reign the bill back in somewhat, even if they didn't succeed",
                "There are PEOPLE in Delaware?! Not just P.O. Boxes??",
                "> The bill mostly impacts companies with a controlling shareholder, like Meta Platforms (META.O), which is controlled by Zuckerberg. The proposal provides steps that allow for a company and its controlling shareholder to arrange deals, such as selling corporate assets to the controller, **that cannot be challenged in court by the company's other investors.**\n\n...\n\n> The bill prevents shareholders from challenging deals that are approved by a board committee that has a majority of independent directors or by a vote by public shareholders. The bill also limits records available to shareholders who want to investigate a deal for conflicts.\n\n> Numerous amendments were rejected, including one that would have eliminated the law's retroactive effective date. The law will be effective back to February 17, which one lawmaker said would eliminate potential legal liability for unspecified claims that he said shareholders were investigating against the board of Meta Platforms.\n\nSo if a deal (I guess between a company and a controlling shareholder?) was approved by a majority of *independent* directors or by a vote of public shareholders, it can't be challenged in court. That's... gonna be honest, I'm not keen on that. I'm not a big fan of not being able to challenge deals in court. \n\nBut at first glance it doesn't sound like the end of the world, though that may just be me having trouble actually envisioning scenarios like that (help me, corporate lawyers). But at least as long as the deals aren't beholden to conflicts of interest...\n\n...oh. Right. It also limits records available to investigate conflicts.\n\nGotta say, toe-deep knowledge of corporate law though I may have, I don't think it looks good. Especially the retroactive bit seeming to be specifically for Meta.",
                "Delaware: when you want the Canary Islands right here at home…."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Anti-war protests in Gaza reveal anger at Hamas, as U.S.-designated terror group faces mounting pressure",
            "external_url": "https://www.cbsnews.com/news/israel-war-gaza-protests-show-anger-at-hamas-and-us/",
            "upvotes": 79,
            "date": "03/26/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/26/41a41e70-19b5-4335-a2aa-de6153c98312/thumbnail/1200x630/da8c7d75ede606c651833fe42549c09f/gaza-hamas-protests-2206443142.jpg?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "Just so people understand this isn't the first or only protest that has happened in Gaza but it's usually started by Fatah members who are part of the PLO that is also considered a terrorist organization by Israel and suppressed usually. A second note the leader of the Palestinian Authority that would be the likely successors of Hamas rule is a member of Fatah.",
                "And I'm sure that whoever replaces them will be just as bad.",
                "Hamas believed that Israel would respond in an over the top manner and the world would rally around Hamas and the Palestinian people, demanding change, or at least that's what they said after the October attacks. That really hasn't happened. Yes, people around the world are upset and have protested but not nearly enough to change policy towards Israel in any meaningful way."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Second woman is strangled during an overnight visit at the same California prison",
            "external_url": "https://www.nbcnews.com/news/us-news/second-woman-strangled-overnight-visit-california-prison-rcna197785",
            "upvotes": 1130,
            "date": "03/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250324-Stephanie-Dowells-se-12313p-58faba.jpg",
            "top_comments": [
                "They might wanna stop these visits altogether.\n\nOr at least give these ladies a f'ng panic button?\n\n\"He's coming in for the kill! AGAIN!\"",
                "from the article:\n\n24 March 2025\n\nThe family of a woman who died of strangulation during an overnight visit with her husband at a California prison is questioning why a man convicted of murdering four people was allowed to have family visits:\n\n>Stephanie Diane Dowells, 62, who also went by the name Stephanie Brinson, was killed in November, making her the second person in a year to die at Mule Creek State Prison in Ione during a family visit, according to the California Department of Corrections and Rehabilitation.\n\n>The other victim, Tania Thomas, 47, was also strangled during a family visit, Amador County District Attorney Todd Riebe said in an interview Monday. The man she was visiting has been charged with murder in connection with her killing, Riebe said.\n\n>Dowells, a hairdresser, was killed while visiting her husband, David Brinson, 54, who was convicted in the 1990s of murdering four men during a robbery, and sentenced to four consecutive life terms without the possibility of parole.\n\n>After Brinson called prison officials at 2:04 a.m. on Nov. 13 to tell them his wife had passed out, officers immediately began life-saving measures and called 911, a spokesperson for the California Department of Corrections and Rehabilitation said. \n\n>But Dowells was pronounced dead a short time later.\n\n>Dowells’ killing remains under investigation by prison officials and the district attorney’s office, the spokesperson said. \n\n>Riebe said charges are pending prison and autopsy reports.",
                "Absolutely insane that someone serving four life sentences for murder was allowed unsupervised overnight visits. Then it happens TWICE at the same prison? The system completely failed these women.\n\nThe fact that her son didn't even know his mom's husband had murdered four people is heartbreaking. They trusted this man enough to let their 3 year old visit him. Like what kind of vetting process is the prison using? The prison needs to answer for this. These weren't random acts they gave violent offenders private access to vulnerable visitors. How many more women need to die before they fix this broken system?",
                "Like someone said in the last thread about this, homeboy is going to end up in a trash bag pretty soon because goodbye conjugal visits!",
                "I know I'm victim blaming here but why would you want to go have sex with someone who's been convicted of murdering 4 people?",
                "It’s almost as if giving serial killers special privileges in prison is a bad idea.",
                "Why are sex visits allowed at all?",
                "[removed]",
                "> visit a murderer, get murdered\n\nQuelle surprise",
                "So many valid questions but I wonder “Why would you kill someone that is still willing to have sex with you?” \nI mean that probably means this also was the last time they will ever have sex."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Brazil Supreme Court to put Bolsonaro on trial for alleged coup attempt",
            "external_url": "https://www.reuters.com/world/americas/brazil-top-court-justice-recommends-that-bolsonaro-stand-trial-alleged-coup-2025-03-26/",
            "upvotes": 3639,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Good job Brazil. I like it when people are held accountable for their actions.",
                "That's wild, I thought you were supposed re-elect people who attempt coups...",
                "Wow, just imagine what we could have had if Merrick Garland hadn’t been an absolutely worthless piece of shit.",
                "Accountability for actions?! What’s this nonsense!",
                "So South Korea and Brazil have better democracies than the United States.",
                "Good job brazil 👏🏾 this is what america shouldve done with our felon in chief",
                "Brazil picking up a lot of ground against USA when it comes to accountability and corruption. What’s curious is that Brazil always copies American politics, but now are forging their own path. Good for them and I hope the crime rate gets fixed next.",
                "Thank you Merrick Garland, for showing the world the dangers of a pathetically weak judicial system.  May they learn from our incompetence. \n\nMerrick Garland will go down in history as the enabler of American Fascism .",
                "Be glad to see a resolution to all of this.",
                "Imprison his fascist ass"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Illinois returns stolen land to Prairie Band Potawatomi Nation",
            "external_url": "https://abcnews.go.com/US/wireStory/illinois-returns-stolen-land-prairie-band-potawatomi-nation-120144789",
            "upvotes": 1064,
            "date": "03/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/68d4b9ed-826a-487e-9e90-00953dee1db2/wirestory_805f5030d9abbac93ce3da3cec18a636_16x9.jpg?w=1600",
            "top_comments": [
                "I’m still baffled by how little attention our historical treatment and abuse of Native Americans receives in our media and our politics.  They are probably the most marginalized and mistreated of all citizens and very few people seem to care.",
                "[The treaty gave land to some chiefs directly](https://www.archives.gov/news/articles/prairie-du-chien-treaty) and forced the Potawatomi off their lands. The article mentions the chief was visiting family in Kansas when the land was stolen.",
                "This is huge, glad this is happening in my state. ",
                "This is a great step! I hope to see more cooperation with Land Back movements to support the indigenous peoples of this land.",
                "> He did not rule out constructing a hotel, however, noting that the park, 68 miles (109 kilometers) west of Chicago, has 150 campsites, draws 500,000 visitors a year, and the closest lodging is a 20-minute drive away.\n\nAnd once you have a hotel there you'll need some restaurants.  Probably a gas station or a \"Travel Center\" too.  Maybe an events center, like a place where you could hold concerts.  \n\nAt least that's how it goes in California.",
                "Now return the rest of the land",
                "Don't tell Indiana, we'll want it to go along with those Illinois counties that are trying to secede.",
                "Way too little too late, but damn even this small win is nice",
                "The only thing about the us which makes sense. The rest just makes it look like it’s a social experiment"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Supreme Court upholds Biden regulations on 'ghost gun' kits",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-upholds-biden-regulations-ghost-gun-kits-rcna180991",
            "upvotes": 1863,
            "date": "03/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-10/241007-ghost-gun-vl-105p-007c05.jpg",
            "top_comments": [
                "7-2 decision with Neil Gorsuch writing for the majority.",
                "Why hasn't trump abolished the NFA and the defunded ATF at this point?   The right has been against the ATF and has encumbered them at every turn.   Why not target those employees for cuts and effectively cripple the ATF?",
                "So now you have to buy the parts kit and the ~~stripped~~ 80% lower separately?  I can see how legally this could be a justified ruling, but I don't see how this will actually stop people from buying these easy enough to build kits.  \n\nSeems like a huge waste of government resources just to make sure the incomplete lower receiver is in a separate package.",
                "This was a no-brainer ruling with even normally far right judges ruling ghost guns need to be regulated. A kid was shot at a local high school (and survived) with a ghost gun. The 16 year old shooter ordered the kit online and made it himself at home. Why would anyone not think something should be done to prevent this?",
                "What’s the legal status of existing ghost guns? This seems to only talk about the sale of new kits.",
                "Are Ghost Guns that aren’t lethal illegal?",
                "How are the ghost busters gonna kill ghosts",
                "Another poorly thought-out SCOTUS decision.  Without ghost guns, the ghost of King George could just materialize in your home and start bossing you around.",
                "...only because allowing them would cut into corporate profits.  SCOTUS doesn't give two shits about you or your safety.",
                "Bad news for corrupt NRA and MAGA gun lovers."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Brazil Supreme Court to put Bolsonaro on trial for alleged coup attempt",
            "external_url": "https://www.reuters.com/world/americas/brazil-top-court-justice-recommends-that-bolsonaro-stand-trial-alleged-coup-2025-03-26/",
            "upvotes": 3637,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Good job Brazil. I like it when people are held accountable for their actions.",
                "That's wild, I thought you were supposed re-elect people who attempt coups...",
                "Wow, just imagine what we could have had if Merrick Garland hadn’t been an absolutely worthless piece of shit.",
                "Accountability for actions?! What’s this nonsense!",
                "So South Korea and Brazil have better democracies than the United States.",
                "Good job brazil 👏🏾 this is what america shouldve done with our felon in chief",
                "Brazil picking up a lot of ground against USA when it comes to accountability and corruption. What’s curious is that Brazil always copies American politics, but now are forging their own path. Good for them and I hope the crime rate gets fixed next.",
                "Thank you Merrick Garland, for showing the world the dangers of a pathetically weak judicial system.  May they learn from our incompetence. \n\nMerrick Garland will go down in history as the enabler of American Fascism .",
                "Be glad to see a resolution to all of this.",
                "Imprison his fascist ass"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Person in Ohio dies of rabies after contracting virus from organ transplant",
            "external_url": "https://www.whio.com/news/local/person-dies-rabies-after-contracting-virus-organ-transplant/HMS5STBDHZESJJ7FU6464OMN3I/",
            "upvotes": 839,
            "date": "03/26/2025",
            "thumbnail": "https://cmg-cmg-tv-10040-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fcmg%2FYPMX5TX5QVGJJLZSDGUPWR7NGQ.jpg?auth=612d61eb069c04a50f81fce2778338c3c1cbaaf0f16c60a6d2c3cbff7f510de5&width=1200&height=630&smart=true",
            "top_comments": [
                "Wtf. So did the donor die of rabies too or just somehow died before the rabies set in and they didn’t know? So sad",
                "Didn't this happen in an episode of Scrubs?",
                "from the article:\n\n26 March 2025\n\nLUCAS COUNTY — A person died from rabies after receiving a transplanted organ in Lucas County earlier this year:\n\n>The recipient, who had undergone a kidney transplant in December, contracted the viral disease through the donated organ, according to the Toledo-Lucas County Health Department, WTOL reported.\n\n>As the recipient was from Michigan, Michigan’s Department of Health and Human Services worked with the Ohio Department of Health and the Centers for Disease Control and Prevention to investigate the case.\n\n>It marks the first human case of rabies in Michigan since 2009, according to WTOL.\n\n>No additional individuals are at risk of rabies exposure, according to the CDC.\n\n>Kara Steele, a representative from Life Connection of Ohio, could not comment on the specific case but explained to WTOL that a donor risk assessment interview is conducted before any organ donation.\n\n>The identities of both the recipient and the donor have not been released.\n\n>The facility where the transplant took place has also not been disclosed. \n\n>However, according to the University of Toledo Medical Center’s website, it is the only organ transplant center in northwest Ohio.\n\n>Fewer than 10 people in the United States die from rabies each year, according to the CDC.",
                "That's some fuck you in particular level shit.",
                "Real life scrubs episodes.  Poor person",
                "The donor had rabies, but died of something else? This is really bizarre.",
                "The donor was actually 3 raccoons in a trench coat",
                "Someone check on Dr. Cox.",
                "Wow! That's a nightmare.",
                "There are other viruses where this has happened. There was a case that a donor got LCMV from his pet hamster and got into an accident.  7 out of 8 donors who go his organs died of LCMV, which is not considered wildly dangerous in humans.\n\nhttps://www.nejm.org/doi/full/10.1056/NEJMoa053240"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Illinois returns stolen land to Prairie Band Potawatomi Nation",
            "external_url": "https://abcnews.go.com/US/wireStory/illinois-returns-stolen-land-prairie-band-potawatomi-nation-120144789",
            "upvotes": 1072,
            "date": "03/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/68d4b9ed-826a-487e-9e90-00953dee1db2/wirestory_805f5030d9abbac93ce3da3cec18a636_16x9.jpg?w=1600",
            "top_comments": [
                "I’m still baffled by how little attention our historical treatment and abuse of Native Americans receives in our media and our politics.  They are probably the most marginalized and mistreated of all citizens and very few people seem to care.",
                "[The treaty gave land to some chiefs directly](https://www.archives.gov/news/articles/prairie-du-chien-treaty) and forced the Potawatomi off their lands. The article mentions the chief was visiting family in Kansas when the land was stolen.",
                "This is huge, glad this is happening in my state. ",
                "This is a great step! I hope to see more cooperation with Land Back movements to support the indigenous peoples of this land.",
                "> He did not rule out constructing a hotel, however, noting that the park, 68 miles (109 kilometers) west of Chicago, has 150 campsites, draws 500,000 visitors a year, and the closest lodging is a 20-minute drive away.\n\nAnd once you have a hotel there you'll need some restaurants.  Probably a gas station or a \"Travel Center\" too.  Maybe an events center, like a place where you could hold concerts.  \n\nAt least that's how it goes in California.",
                "Now return the rest of the land",
                "Don't tell Indiana, we'll want it to go along with those Illinois counties that are trying to secede.",
                "Way too little too late, but damn even this small win is nice",
                "The only thing about the us which makes sense. The rest just makes it look like it’s a social experiment"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Delaware lawmakers approve corporate bill that critics call giveaway to billionaires",
            "external_url": "https://www.reuters.com/world/us/delaware-lawmakers-vote-corporate-bill-critics-call-giveaway-billionaires-2025-03-25/",
            "upvotes": 646,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What? Delaware catering to corporations? When did this start happening? /s",
                "Delaware exists to cater to corporations and rich people.\n\nBiden knew it, so does Helly R",
                "And as far as Delawareans are concerned, as long as their taxes stay low and they continue to have no sales tax, they’re ok with it.",
                "They've destroyed so many things in the name of \"maximizing shareholders value.\" And now they're taking down shareholders' power over them because it's become an inconvenience. \n\nThis concentration of power and wealth with zero accountability never leads to any good outcomes. \n\nI hope they one day get treated with the same amount of contempt they have for the rest of us.",
                "There was some public outcry over this, but really not much, or nearly enough. I saw some signs posted near roadways...but thats kinda it. The major problems are: \n\n1. That the bill at hand is a little complicated for the average person to understand. Why should the average person care about what rights shareholders have in the Court of Chancery? \n\n 2. A third of the State's revenue come from all the corporations stationed here.\n\nHere's a local Delaware article about the bill: [https://www.delawarepublic.org/politics-government/2025-03-25/delaware-house-passes-corporate-law-overhaul-after-rejecting-five-proposed-changes](https://www.delawarepublic.org/politics-government/2025-03-25/delaware-house-passes-corporate-law-overhaul-after-rejecting-five-proposed-changes)\n\n  \nThis wasn't a MAGA thing, this has been a blue state for awhile, with mostly blue representatives. I don't know if the reps votes were bought for (believable), or that they believe the threat of companies leaving was too great for the state. Shoutout to the few reps (Sophie Phillips, Madinah Wilson-Anton, Frank Burns), that crafted amendments trying to reign the bill back in somewhat, even if they didn't succeed",
                "There are PEOPLE in Delaware?! Not just P.O. Boxes??",
                "> The bill mostly impacts companies with a controlling shareholder, like Meta Platforms (META.O), which is controlled by Zuckerberg. The proposal provides steps that allow for a company and its controlling shareholder to arrange deals, such as selling corporate assets to the controller, **that cannot be challenged in court by the company's other investors.**\n\n...\n\n> The bill prevents shareholders from challenging deals that are approved by a board committee that has a majority of independent directors or by a vote by public shareholders. The bill also limits records available to shareholders who want to investigate a deal for conflicts.\n\n> Numerous amendments were rejected, including one that would have eliminated the law's retroactive effective date. The law will be effective back to February 17, which one lawmaker said would eliminate potential legal liability for unspecified claims that he said shareholders were investigating against the board of Meta Platforms.\n\nSo if a deal (I guess between a company and a controlling shareholder?) was approved by a majority of *independent* directors or by a vote of public shareholders, it can't be challenged in court. That's... gonna be honest, I'm not keen on that. I'm not a big fan of not being able to challenge deals in court. \n\nBut at first glance it doesn't sound like the end of the world, though that may just be me having trouble actually envisioning scenarios like that (help me, corporate lawyers). But at least as long as the deals aren't beholden to conflicts of interest...\n\n...oh. Right. It also limits records available to investigate conflicts.\n\nGotta say, toe-deep knowledge of corporate law though I may have, I don't think it looks good. Especially the retroactive bit seeming to be specifically for Meta.",
                "Delaware: when you want the Canary Islands right here at home…."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "The Atlantic publishes additional trove of Signal messages with details of Yemen strike",
            "external_url": "https://www.cnn.com/2025/03/26/politics/the-atlantic-publishes-signal-messages-yemen-strike/index.html",
            "upvotes": 8435,
            "date": "03/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2204323444.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So we already knew every single turd in the committee hearings yesterday straight-up lied, prompting The Atlantic to post the rest of the transcripts.\n\nPlease, Senate Intelligence Committee, lay it on them THICK today.",
                "The Trump admin trying to downplay this is the most pathetic thing they've done in months. 'only the best people'. All Trump supporters are rubes.",
                "Goldberg is being incredibly patriotic here, he is taking on a great personal risk against a regime that controls the most powerful government in the world. This regime is made up of truly incompetent bad faith actors, we should all remember that moving forward, whatever happens- these people running our country are incredibly dumb. They can be defeated.",
                "Looks like there was one responsible adult in this mess.\n\n>  “We did redact one piece of information because we felt, on our own, that we felt it was best to do. And the CIA asked us, but, you know, at a certain point, the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves,” \n\n-- Jeffrey Goldberg\n\n> “Weather is FAVORABLE. Just CONFIRMED w/CENTCOM we are a GO for mission launch,” Hegseth wrote. \n\n> This entire story was another hoax written by a Trump-hater who is well-known for his sensationalist spin,” White House press secretary Karoline Leavitt said \n\n> “You’re talking about a deceitful and highly discredited so-called journalist who’s made a profession of peddling hoaxes time and time again,” Hegseth said. \n\n> Britt  Hume was quick to point out the glaring flaw in Hegseth’s excuse: It wasn’t a hoax, as the National Security Council confirmed that the messages accidentally sent to Goldberg were legit:",
                "*\"the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves\"*\n\nBrilliant. Absolutely calling their bluff.",
                "Not a day goes by that this clown fiesta of an administration fails to blow my mind.",
                "I don't even get what the point of him sharing all these details in real time with that group chat to begin with? Just send a recap when it's over. It's like he was trying to show off or some shit",
                "Funny how the GOP used to have fake outrage fits out of things 1,000 times smaller than this.",
                "Already lots of bots on twitter trying to claim this is all fine. Not sure what else I expected.",
                "I do find it so funny that half of these clowns will wax for hours about how much money we burned in Ukraine or whatever, but these strike packages are big emoji worthy after burning whatever the cost in munitions, fuel and logistics were."
            ],
            "aggregate_sentiment": 87.0
        },
        {
            "category": "RISING",
            "title": "Trump takes bid to slash teacher training funds to US Supreme Court",
            "external_url": "https://www.reuters.com/world/us/trump-takes-bid-slash-teacher-training-funds-us-supreme-court-2025-03-26/",
            "upvotes": 365,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump hates americans",
                "From the article:\n\ntrump “says funds promote divisive ideologies.”\n\nThis fucking guy.",
                "Is Trump following orders from Putin to destroy our country?",
                "Conservatives will bend over backwards to tell you that less teachers, and less educated teachers, is a good thing.",
                "Another Trump movie I hadn't heard of,\nIf he does enough stuff maybe we won't notice him stuffing his pockets.",
                "“I love the poorly educated.” -Krasnov",
                "Republicans love the uneducated, and there's no way this could be bad for America, right? Stone age America looks like the next step for the G.O.P.",
                "Dear Supreme Court, please slap down the 🍊🤡. We appreciate it. Sincerely, ethical Americans",
                "Great.  Uneducated educators teaching education.   Just what we need.  A whole generation of lost children.",
                "Here is why it's actually a good thing Trump is fighting tooth and nail to make our teachers worse..."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Second woman is strangled during an overnight visit at the same California prison",
            "external_url": "https://www.nbcnews.com/news/us-news/second-woman-strangled-overnight-visit-california-prison-rcna197785",
            "upvotes": 1132,
            "date": "03/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250324-Stephanie-Dowells-se-12313p-58faba.jpg",
            "top_comments": [
                "They might wanna stop these visits altogether.\n\nOr at least give these ladies a f'ng panic button?\n\n\"He's coming in for the kill! AGAIN!\"",
                "from the article:\n\n24 March 2025\n\nThe family of a woman who died of strangulation during an overnight visit with her husband at a California prison is questioning why a man convicted of murdering four people was allowed to have family visits:\n\n>Stephanie Diane Dowells, 62, who also went by the name Stephanie Brinson, was killed in November, making her the second person in a year to die at Mule Creek State Prison in Ione during a family visit, according to the California Department of Corrections and Rehabilitation.\n\n>The other victim, Tania Thomas, 47, was also strangled during a family visit, Amador County District Attorney Todd Riebe said in an interview Monday. The man she was visiting has been charged with murder in connection with her killing, Riebe said.\n\n>Dowells, a hairdresser, was killed while visiting her husband, David Brinson, 54, who was convicted in the 1990s of murdering four men during a robbery, and sentenced to four consecutive life terms without the possibility of parole.\n\n>After Brinson called prison officials at 2:04 a.m. on Nov. 13 to tell them his wife had passed out, officers immediately began life-saving measures and called 911, a spokesperson for the California Department of Corrections and Rehabilitation said. \n\n>But Dowells was pronounced dead a short time later.\n\n>Dowells’ killing remains under investigation by prison officials and the district attorney’s office, the spokesperson said. \n\n>Riebe said charges are pending prison and autopsy reports.",
                "Absolutely insane that someone serving four life sentences for murder was allowed unsupervised overnight visits. Then it happens TWICE at the same prison? The system completely failed these women.\n\nThe fact that her son didn't even know his mom's husband had murdered four people is heartbreaking. They trusted this man enough to let their 3 year old visit him. Like what kind of vetting process is the prison using? The prison needs to answer for this. These weren't random acts they gave violent offenders private access to vulnerable visitors. How many more women need to die before they fix this broken system?",
                "Like someone said in the last thread about this, homeboy is going to end up in a trash bag pretty soon because goodbye conjugal visits!",
                "I know I'm victim blaming here but why would you want to go have sex with someone who's been convicted of murdering 4 people?",
                "It’s almost as if giving serial killers special privileges in prison is a bad idea.",
                "Why are sex visits allowed at all?",
                "[removed]",
                "> visit a murderer, get murdered\n\nQuelle surprise",
                "So many valid questions but I wonder “Why would you kill someone that is still willing to have sex with you?” \nI mean that probably means this also was the last time they will ever have sex."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court upholds Biden regulations on 'ghost gun' kits",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-upholds-biden-regulations-ghost-gun-kits-rcna180991",
            "upvotes": 1864,
            "date": "03/26/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-10/241007-ghost-gun-vl-105p-007c05.jpg",
            "top_comments": [
                "7-2 decision with Neil Gorsuch writing for the majority.",
                "Why hasn't trump abolished the NFA and the defunded ATF at this point?   The right has been against the ATF and has encumbered them at every turn.   Why not target those employees for cuts and effectively cripple the ATF?",
                "So now you have to buy the parts kit and the ~~stripped~~ 80% lower separately?  I can see how legally this could be a justified ruling, but I don't see how this will actually stop people from buying these easy enough to build kits.  \n\nSeems like a huge waste of government resources just to make sure the incomplete lower receiver is in a separate package.",
                "This was a no-brainer ruling with even normally far right judges ruling ghost guns need to be regulated. A kid was shot at a local high school (and survived) with a ghost gun. The 16 year old shooter ordered the kit online and made it himself at home. Why would anyone not think something should be done to prevent this?",
                "What’s the legal status of existing ghost guns? This seems to only talk about the sale of new kits.",
                "Are Ghost Guns that aren’t lethal illegal?",
                "How are the ghost busters gonna kill ghosts",
                "Another poorly thought-out SCOTUS decision.  Without ghost guns, the ghost of King George could just materialize in your home and start bossing you around.",
                "...only because allowing them would cut into corporate profits.  SCOTUS doesn't give two shits about you or your safety.",
                "Bad news for corrupt NRA and MAGA gun lovers."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Kentucky governor vetoes GOP abortion bill, says it undermines doctors and endangers pregnant women",
            "external_url": "https://apnews.com/article/kentucky-legislature-abortion-beshear-governor-roe-wade-b96d48ba703e765448458bd0d05c691e",
            "upvotes": 1233,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "GOP lawmakers: “umm, yeah. That was the whole point of the bill”",
                "No telling how many peoples lives Beshear just saved 🥰",
                "“It’s not meant to be an exhaustive list but it is the most common issues that physicians and mothers, who are facing a crisis pregnancy, are facing,” Republican state Rep. Kimberly Poore Moser said during a House debate on the measure.\n\nSounds like somebody has never heard of **Expresio unius est exclusio alterius**: “the express mention of one thing excludes all others.” This term is often used to show exclusivity of a list (i.e., if an item is not listed, it is not included).  And this list would absolutely be used this way.",
                "Just so everyone is aware, while Beshear vetoing this and the Medicaid trans ban/allowing conversion therapy is a good thing, overall it means nothing since Kentucky is ruled by a super majority  Republican Congress. It’s one of the reasons the republicans in Kentucky don’t bitch and moan constantly about having a Democratic governor",
                "It's interesting to look at this. When it comes to trump, he inspires both apathy and passion depending on what party you're in. \n\nWhen it comes to literally anyone else, Democrats seem to win on the lower level."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Kidnapped 6-year-old rescued by Kansas trooper during traffic stop",
            "external_url": "https://abcnews.go.com/US/kidnapped-6-year-rescued-kansas-trooper-traffic-stop/story?id=120141588",
            "upvotes": 596,
            "date": "03/26/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/3be774e0-beef-4c53-9efb-9cc639386792/abducted-child-saved-ht-jt-250325_1742928216325_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Officials said the driver of the vehicle had a criminal history that included homicide and numerous weapons violations.\n\n>\"Thankfully the girl was unharmed, and the men were taken into custody,\" officials added.\n\nThe girl had been kidnapped for over a month. Both the men were over 60. I feel like there's more to the story.",
                "Would this have fallen under/triggered an Amber Alert when it happened or are there specific guidelines for that?.\n\nHonest question",
                "[deleted]",
                "There is no way this child was 'unharmed'....but grateful she was recovered with no obvious injuries.",
                "Is it time to start implanting a chip in your child? Like for pets?\n\nAs an adult it would be an easy way to enter a password into my computer."
            ],
            "aggregate_sentiment": 50.0
        }
    ],
    "last_updated": "03/26/2025 20:09:26 UTC"
}