{
    "posts": [
        {
            "category": "HOT",
            "title": "Chinese woman detained by US border patrol in Arizona dies by suicide",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/chinese-woman-border-patrol-arizona-suicide",
            "upvotes": 2312,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4f8803d21e78b9889f3651d55759542f0f3313b0/122_184_3864_2320/master/3864.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e6e0b32190d809a66ec28e3b37cdc695",
            "top_comments": [
                "> The Tucson Sentinel first reported the woman’s death, saying that border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\n\nImagine if someone hadn't made inquiries. How long before anyone who knew her would have gotten answers? She would have just disappeared.",
                "I'm not saying it wasn't suicide, but the article says they didn't even disclose her death until the Tucson Sentinel made inquiries. Seems like they were hoping no one would notice.",
                "So we’re disappearing people and not telling anyone when they die.\n\nCool cool cool. Super cool.",
                "I was told nothing like this would happen.",
                "Not suspicious at all",
                "Either they killed her and are trying to justify her murder, or the conditions in which she was held were so horrible she chose to die rather than bear the pain.\n\nI don't know which is worse.",
                "There is going to be a LOT of this and ICE/DHS will not be accurately reporting it either.",
                "\"A border patrol spokesperson told the Tucson Sentinel that the woman was found “unresponsive in a cell”\n\nAnd that's all we'll hear about that.",
                "I wonder: at what point will everybody agree that the US is a fascist authoritarian country?",
                "What the fuck did they do to her?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Doge’s attack on social security causing ‘complete, utter chaos’, staff says | US social security",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/musk-doge-social-security",
            "upvotes": 22567,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f437b2bfe2b2066194423af11c741ab412c9e650/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4e65814c3655dec53aa09824e402b25e",
            "top_comments": [
                "The GOP has wanted to privatize Social Security since Reagan.",
                "So working people have paid into this their whole lives on the assumption it will be returned to them in retirement, only for it to be demolished without a mandate? How can anyone think this is a good idea?",
                ">Musk has [called](https://www.warren.senate.gov/newsroom/videos/watch/elon-musk-called-social-security-the-biggest-ponzi-scheme-of-all-time) social security “the biggest Ponzi scheme of all time” and has consistently pushed false claims and conspiracies about the program.\n\n>Howard Lutnick claimed in an [interview](https://www.youtube.com/watch?v=182ckTL2KBA) on a podcast earlier this month that only a “fraudster” would complain about missing a social security benefit check.\n\nWhat more do you expect from the team that has these things to say?\n\n*Elect a clown and expect a circus with more un-elected clowns!*",
                "Here’s the plan. Cause havoc. The system breaks down. People lose their minds. “An alternative” happens and Social Security is privatized. I mean sold to a Trump lackey. Service is costlier and totally sucks after that.",
                "How the fuck are we letting an unelected  foreigner dismantle Social Security?\n\nFucking Republicans need to be voted out at every goddamned opportunity.",
                "If this isn’t the most terrifying look yet at the brink of disaster DOGE is speeding us toward, I don’t know what is. Most of its actions have been equally arbitrary or poorly thought out. This is why the government employs well-educated professionals with ethics for these roles. Not only is each agency a creation that resulted because of a law or initiative that Congress passed that needed people to implement and operate it, being a public servant carries an ethical duty (with an oath to the constitution) that few, if any, private sector companies require. It’s because the government knows it’s working with a carefully and time-tested system that impacts every American in some way. It’s not just an app. If you break things in government, people can die.",
                "I wonder how much the average senior's blood pressure has risen. People my age (68) and older do not need this kind of stress.",
                "This would be terrifying under the best of economic times.  So there is no word to describe it given that every expert seems to think we're barreling towards the worst economy since the Great Depression.\n\nBefore the tariff EO last week, I was thinking that if the Trump administration destroys SS, my siblings and me will just pool our resources so that our retired parents don't starve or lose the house.  I just won't go on vacation this year.  It will be OK.\n\nBut now?  I'm scared my siblings and I will be unemployed by the end of the year.",
                "Social Security is NOT part of the budget. It is our money that our employers and ourselves have put towards our retirement. Any bastardized version of that is the fault of our elected officials.",
                "I was part of a large system upgrade at a major bank (one of the biggest in the US) and this was for a system that had been thoroughly tested, not one that was being created on the fly. We had so many problems that in decades of working in IT support, I've done fewer support calls in a month than I would do every day during this project."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Alex Ovechkin breaks Wayne Gretzky’s NHL all-time career goals record | CNN",
            "external_url": "https://www.cnn.com/2025/04/06/sport/alex-ovechkin-surpasses-wayne-gretzky-goals-record-nhl-spt/index.html",
            "upvotes": 1223,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208841308.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Gretzky is one of two athletes that I never thought we'd see someone break their records (Jerry Rice being the other). This is pretty wild.\n\nGretzky's assists record though...no one will ever touch that.\n\nEDIT: Guys, I know there are single record holders that are near impossible to beat. I was talking two players that hold multiple records unlikely to be broken. Two completely dominate players in their respective sport.",
                "Gretzky scored 894 in 1487 games.  Ovi scored 895 in his 1487th game.",
                "Wayne Gretzky is a MAGA clown",
                "I'm only a casual hockey viewer, but was Gretzky's all-time goals record comparable to Kareem's all-time points record or a lot more difficult?",
                "The Great Once up there chilling with Kash Patel.\n\nEvery single person in this current administration is doing anything but actual work during a stock market crash",
                "As some extra context for people who don't follow hockey, Ovi was robbed of 155 games due to NHL lockouts in 2004 and 2013 as well as the shortened covid season. Were it not for that he'd have broken it likely several seasons ago. He also broke his leg this season and missed 5 weeks in recovery. And despite all that, he still scored 42 goals to pass the Great One for the all time lead. Had he not missed time this year, there's a good chance he'd have the lead for most goals on the season too. A truly remarkable player and remarkable moment for the sport.",
                "There honestly isn't a player more deserving of this record.  Ovi never chased the cup, he played his entire career with the Caps and in 2018, the cup came to him. One of the best champions of the game today. Congratulations Ovi, you earned this record and I'm sure it will stand for many years.",
                "Good. Fuck Gretzky.\n\nMAGA piece of shit.",
                "Good. The sooner we can break all Gretsky’s records and let his name fade into obscurity, the better. \n\nThe Great Once. Let his legacy burn to the ground.",
                "Although it just suck to lose one of your records, atleast Gretzky can be happy he lost it to one of his countrymen.."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "HOT",
            "title": "Texas records second measles-related death in a child",
            "external_url": "https://www.reuters.com/world/us/kennedy-travel-texas-after-second-measles-related-death-axios-reports-2025-04-06/",
            "upvotes": 3007,
            "date": "04/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is increased child mortality the new federal strategy for preventing autism?",
                "I wonder if the family will be as similarly cavalier as those of the last victim. If I recall, it was something to the tune of “It’s unfortunate, but these things happen. No, this incident hasn’t changed our views at all. Why would you think that?”",
                "If only there was some way to prevent this. Some sort of perhaps injection you could take to boost your immune system.",
                "> Kennedy planned to attend the funeral scheduled for Sunday.\n\nFucking grim, imagine having the killer at the funeral.",
                "From a different article about how measles impacts children's long term health.\n\n> An estimated 1 out of every 5 kids who catch measles will be hospitalized, and 1 in 20 will get pneumonia, which is what kills most children who die of the disease, according to the Centers for Disease Control and Prevention (CDC). Some of these hospitalized children will need to be put on a ventilator to recover, Stinchfield said.\nIn about 1 in 1,000 cases, measles causes brain swelling, or encephalitis, which can cause seizures. When it's not fatal, the swelling itself can subside, but it can cause permanent brain damage and other lasting side effects, such as blindness or deafness. \nThe measles virus is capable of replicating in the brain, said Ross Kedl, a professor of immunology at the University of Colorado Anschutz Medical Campus. In some cases, the immune system beats the virus back and the person seems to recover, but measles still lurks in their nervous system.\n\n> The nightmarish effect of this long-term persistence is a condition called subacute sclerosing panencephalitis (SSPE). This is a progressive neurological disorder that might start with mood changes and muscle tremors; then, as it progresses, the person starts losing speech, vision and hearing. After about two years, the person falls into a coma and dies. \n\n\nIt can also erase antibodies that their bodies have created to fight other diseases. It's absolutely insane to me people are willing to risk their own children and other immunocompromised people like this.",
                "Why are so many women and children dying in a state that’s “pro-life”?",
                "Now that child will never be at risk for autism. Mission accomplished. ",
                "Yeah, but… you know- at least they didn’t grow up to be autistic!  What would the neighbors say?!",
                "How is this not considered a form of child abuse? Knowingly placing your child’s wellbeing into jeopardy..and then the worst case occurring. \n\nIf mothers are blamed for miscarriages — then wtf is OK with parents choosing to gamble their child’s life with preventable diseases?",
                "My father told me about how sick he was as a boy when he had the measles. He had high fever and it was horrible. If children are dying, others are going through terrible suffering."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Thunderstorms trigger catastrophic flooding across the middle of the US",
            "external_url": "https://edition.cnn.com/2025/04/05/weather/central-us-storms-floods-hnk/index.html",
            "upvotes": 4426,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208554765.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I’m sure what’s left of FEMA will take good care of everybody.",
                "Without NOAA there will be little warning of such situations. But billionaires will get $4.5 trillion in unnecessary tax cuts and that's all that matters. Priorities people, priorities.",
                ">The storms have killed at least 16 people across Tennessee, Missouri, Indiana, Arkansas and Kentucky since Wednesday. In Franklin County, Kentucky, a 9-year-old boy was swept away by floodwaters while walking to his school bus stop, police said. And in Little Rock, Arkansas, a 5–year-old was killed at a home battered by severe weather.\n\nThis is so incredibly sad. Can’t even be safe sheltered at home. Theses states have ample funds to recover and if not the federal govt will help, right? \n\nNot even in the third world would a govt forsake its people like this.",
                "No sign of trump anywhere.  Oh wait...he's golfing.",
                "Executive order to ban thunderstorms incoming?",
                "But why is the Fuhrer using the Weather Weapon against us?",
                "Under normal circumstances, this would activate the full strength of FEMA. It still does, but now it's just two people.",
                "What do the crazy religious republicans love to say when east coast cities get hit, and their followers still donate money and listen to them?\n\n\n\"god is punishing these places because Trump is president and sinful.\"",
                "With tariffs the cost to rebuild will skyrocket for all of these disasters. Insurance which is already sky high is going to get even more expensive.",
                "From Eastern Kentucky. Our river is almost as high from the last 2 days of rain as it was a month ago when the really bad flooding happened in Pike County. The Ohio is on a flood watch as well. This is going to become more and more normal as the climate becomes more volatile."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Recruiters say more U.S doctors, health-care workers are looking to move to Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/nova-scotia/article/recruiters-say-more-us-doctors-health-care-workers-are-looking-to-move-to-canada/",
            "upvotes": 1940,
            "date": "04/06/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2357XRAPZNECLHCPIZJ2W73BIY.jpg?smart=true&auth=3f9898c2959f0ebc77297be145869f970e327ec5d3e5f129048e610ef0e610f4&width=1200&height=630",
            "top_comments": [
                "Good opportunity for Canada to build up the health care system at the US’s expense.\n\n“Come to Canada, serve patients, not insurance CEO’s”",
                "How ? Please tell me how? I’m an experienced ED nurse? Would love to relocate !",
                "Almost two years ago now, I helped a Florida doctor find a position in a hospital and move to canada. \n\nStill friends with them to this day. I'm not sure they'll ever go back to the States now.",
                "now if only ontarians would stop voting for a guy that keeps fucking with our healthcare...",
                "Please come we need more doctors .\nYou don’t have to deny care because they can’t pay.",
                "Of course they would, education matters there. Here our head of health services is anti vax, and is totally okay with the measles outbreak in texas. It’s fucking pathetic.",
                "Ontario is one of the provinces where if you are board certified doctor in the U.S. you are good to go in Ontario.  No additional requirements.\n\nOne of the sites I heard about recently:\n\nhttps://canamrecruiting.com/",
                "Snippet from this news article:”Nova Scotia Health conducted a campaign in November to attract United States health-care workers to the region, generating more than 500 nursing leads and five new hires.“The purpose of the campaign was to heighten our engagement directly with the U.S leads as a direct result of the current political climate. We are seeing this as an opportunity and we have tangible success stories that have confirmed the value that this campaign has,” says Laura O’Brien, Nova Scotia Health manager of recruitment services. \n\n“We are learning from the high interest that our recruitment efforts are working, health-care professionals and nurses are worried about the uncertainties in the American health-care system. The interest has been so, so much more and we are taking advantage of that.”\n\t•\tDownload the CTV News App for breaking news alerts and video on all the top stories\nNova Scotia Health says it received 65 serious inquiries from U.S. health-care workers that asked about licensing“What’s been great so far in seeing the results from this campaign is that we are seeing experienced nurses and experienced health-care workers. As recruiters here in Nova Scotia, student engagement is one of our top priorities but it is great to have as many graduates as we possibly can but we need those experienced professionals as well and this is giving us an opportunity to leverage that,” says O’Brien. \n\nHealth-care workers could be looking to leave the United States for a variety of reasons, but Nova Scotia Health believe politics is playing a part.“The number one reason is they are feeling uncertain, they’re feeling very uncomfortable depending on their current situation and how they are being portrayed. And I think they just don’t see a future for themselves anymore in that country,” says O’Brien. Roughly 30 per cent of the province’s recruitment is international and Nova Scotia Health has seen a recent uptick in interest from the U.S.“It really started in March of 2023 when Nova Scotia became the first province to allow U.S board-certified physicians to practice in Nova Scotia with additional certifications, so we saw an uptick then and really double the numbers of U.S physicians,” says Katrina Philopoulos, Nova Scotia Health physician recruitment director.",
                "I'm an American who moved to Montreal 25 years ago, after service in the US and all. From 18 to 30 years old, I moved from NYC, to service, to DC, to Montreal and the way I like to phrase it, I kept moving new places and each time my income went down while my quality of life went up.  \n\nNow I live upper middle class here, and have seven weeks vacation annually and happily pay about the same taxes I would if I lived in California because I'm in Québec. AMA, Americans.",
                "Honestly, the rate the US is imploding, Canada keeps looking better every day...."
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "HOT",
            "title": "Pope Francis makes surprise public appearance after getting discharged two weeks ago",
            "external_url": "https://edition.cnn.com/2025/04/06/europe/pope-francis-health-public-vatican-intl?Date=20250406&Profile=CNN&utm_content=1743934219&utm_medium=social&utm_source=facebook&fbclid=IwY2xjawJfToJleHRuA2FlbQIxMQABHoP5pJcQROaoRVpqiDTkaJ0vGIM65ybjbzk_adKkzLn7LGt_AiwsTIBpEW5c_aem_L-j25aAUCgGgPtUDbqAPTA",
            "upvotes": 1487,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25096352959850.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I strongly oppose the Catholic Church but I do believe Francis is a good man, and I'm happy to see he's feeling well enough.\n\nI think the movie Conclave (for as much as the Church condemns it) hit the nail on the head. This is a pivotal time for the Church, and it's going to be interesting to see just how measurable the divide that Francis and the other \"liberal\" church members have created. Is there another schism in the works? Could very well be. Catholics can't agree on anything, ever. I should know, I was one for decades.",
                "I'll certainly miss having Pope Francis as the pope when he passes. For all the complaints people seem to have with him, there's no doubt in my mind the Church will swing radically in the opposite direction — as they did after Benedict XVI — and I doubt that'll give the Church any better PR. He's certainly done more to embody core Christian virtues than many popes.",
                "Healthy as a fuckin rhino this guy",
                "I am Christian not Catholic but I wish well and hope he is able to deliver an Easter Sermon. \n\nGod guide him and bless him.",
                "Be nice if he actually did something about the corruption in the Catholic Church.  Just another super rich figurehead",
                "Looks like the cockroach guy from MIB",
                "Please don’t die before my Italy trip in two weeks !",
                "Don't forget kids, do as the Pope asks and pray for the Dugin family.",
                "He heard there were young kids present?",
                "Discharge and pope shouldn’t be in the same sentence."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Galapagos tortoises at Philadelphia Zoo become first-time parents at nearly 100 years old",
            "external_url": "https://www.cbsnews.com/philadelphia/news/galapagos-tortoises-at-philadelphia-zoo-become-first-time-parents-at-nearly-100/",
            "upvotes": 7639,
            "date": "04/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/05/1f31bddb-2587-455e-be25-b4545e7b032f/thumbnail/1200x630/45fda76d5750501e0ee52e44f1570bf6/chopper-3-bug-horizontal-thumbnail-mugshots.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "🤗🤗🤗🤗CONGRATULATIONS MY LOVELY ONES! 🐢🐢🐢🐢🐢🐢",
                "Congratulations to the young couple!",
                "Best vacation I ever had was Galapagos Islands in 2012. Stayed on Isabella Island and there was a tortoise breeding station there. Many tortoises from very small to fairly good size. The workers had never released a tortoise into the wild because they had to wait for adolescence (70 years old) so the tortoises could fend off predators.",
                "I can’t imagine being 118 years old at my son’s graduation.",
                "Foreplay lasted 85 years! 🤣",
                "Feels like about the age I’ll be ready to have kids",
                "Wait till they find out how expensive is it to raise kids.",
                "In this economy??!?!",
                "Isn't this actually amazing news for the species?",
                "I take my son to the zoo every other weekend. Those tortoises are banging EVERYTIME we go."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Canadian parliament on lockdown amid large police presence: ‘Lock all doors and hide’",
            "external_url": "https://www.independent.co.uk/news/world/americas/canada-parliament-lockdown-ottawa-b2728127.html",
            "upvotes": 12144,
            "date": "04/05/2025",
            "thumbnail": "https://static.independent.co.uk/2025/04/05/21/54/Canadian-Parliament-under-lockdown-in-Ottawa-899k7o0a.jpeg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "Weird time to try something.\n\n> ... the East Block houses the offices of senators and their staff, but there is little activity on the Hill because Parliament is dissolved for the ongoing federal election.",
                "“The Canadian Press is reporting police have brought in a robot to deal with the situation as the standoff continues into the evening.”\n\nRobocop!",
                "Yep.... Bit like the bomb threats that occurred during the US election. I'm gonna keep searching about the protesters thanks.",
                "jd vance peeking in the windows",
                ">The barricaded man call at East Block has ended without incident,” Ottawa police said on X. “One man is in custody. The @ottawapolice criminal investigation is ongoing and an update will be provided in the morning. We thank the public for its cooperation.”  \n\n\nokay then.   back to the buying Canadian. ",
                "Probably another right-winger having a tantrum after watching Alex Jones or some other moron YouTuber’s videos.",
                "Pierre Poilievres new campaign strat.",
                "Send in Kevin Vickers!",
                "So the place isn't used as a there's no injuries or hostages yet.",
                "Send for Rowsdower, ON THE DOUBLE!"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Pharmacist accused of hacking computers to stalk co-workers at Maryland medical center",
            "external_url": "https://www.cbsnews.com/baltimore/news/university-maryland-medical-center-pharmacist-cyber-stalking-lawsuit/",
            "upvotes": 207,
            "date": "04/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/04/6ed7b41c-88a3-4360-9de8-81c50db80a33/thumbnail/1200x630/41dec68d0c70b1b5884a5912c13911db/gettyimages-2207236668-1.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "I’m referring to only the cybersecurity aspects of this situation, but none of this would have been possible if the hospital had followed basic IT security procedures. The fact that he was able to install software on computers and computers everything else means that there were no security measures in place. No monitoring measures either.\n\nMore than a handful of people need to be fired for this.",
                "> Bathula allegedly targeted about 80 co-workers, most of whom were women. According to the lawsuit, he used security information from UMMC computers to access his victims' accounts and photos. \nCindy B. Morgan, an attorney with Grant & Eisenhofer, tells WJZ that for at least 8 years, Bathula allegedly used keystroke software on UMMC computers to learn employees' usernames and passwords.  From there, Morgan says he was able to download everything from social security numbers to texts and nude pictures. \n\"Incredibly emotionally traumatic to learn that your iCloud could be hacked by somebody that you work with or that you could be surveyed in your home,\" Morgan said.   \nThe lawsuit further alleges that he spied on his victims using internet-enabled cameras in their homes and at UMMC. \n\nHoly cow this is disturbing, and he did this for possibly decades? I can't even imagine how violated his victims feel.",
                "Why would someone do that? Weird creepy behavior",
                ">tl;dr  \n*>Matthew Bathula*  \n  \n***>for at least 8 years,*** *Bathula allegedly used keystroke software on UMMC computers to learn employees' usernames and passwords.*  \n  \n*>he was able to download everything from social security numbers to texts and nude pictures.*   \n  \n*>he spied on his victims using internet-enabled cameras in their homes and at UMMC.*   \n  \n*>He activated the cameras in treatment rooms to watch co-workers that he knew would be pumping breastmilk and accessed home security cameras to spy on victims as they were undressing or engaged in intimate acts*  \n  \n*>He was able to remotely turn off the green button that would alert them that their camera was on, he was able to change the settings, and then he actively surveyed them in their homes,\" Morgan said. \"He surveyed them breastfeeding, he surveyed them having intimate moments with their spouses, he surveyed them nude, partially nude.\"* \n\npretty disgusting",
                "That's a whole new level of creepy, can't believe someone would do that.",
                "The creep aside, why would you have nudes pic, at least nudes pic **available on an externally accessible media**."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Ibrahim Traoré: Revolutionary Leader of Burkina Faso",
            "external_url": "https://easternherald.com/person/ibrahim-traore/",
            "upvotes": 0,
            "date": "04/06/2025",
            "thumbnail": "https://easternherald.com/wp-content/uploads/2025/04/Ibrahim-Traore.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Exclusive: how the Atlantic’s Jeffrey Goldberg got added to the White House Signal group chat",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/signal-group-chat-leak-how-it-happened",
            "upvotes": 121,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1a5a3d60644c4e4ea0fb3738bbdd6bec2bf08c77/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=848bf874e778d0c8a4eca31451ac6d46",
            "top_comments": [
                "The media has been completely baffled by this story.  Walz saving Goldberg's number under another person's contact is the least important part. The important parts of this story are that they were using signal on their personal phones to discuss classified war plans, and that by using signal they were bypassing federal record keeping laws, probably intentionally. But 90% of the stories frame this as Walz fucking up. He did fuck up, but that's only important in that it lead to the story being reported.",
                "What an idiot, saved his contact info in someone else's name on his phone.  I used to have a clearance, and a fuck up like that would have landed me in prison.",
                "How comforting to know that people who don’t know how to use their own iPhones are making decisions at this scale. ",
                "> According to the White House, the number was erroneously saved during a “contact suggestion update” by Waltz’s iPhone, which one person described as the function where an iPhone algorithm adds a previously unknown number to an existing contact that it detects may be related.\n\nOh yes, the iPhone is totally the problem in this story.  /S",
                "Thank you for this update, Mr Tickle",
                "Get an oligarchy cosplaying government and this is the crap you get."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "Chinese woman detained by US border patrol in Arizona dies by suicide",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/chinese-woman-border-patrol-arizona-suicide",
            "upvotes": 2337,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4f8803d21e78b9889f3651d55759542f0f3313b0/122_184_3864_2320/master/3864.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e6e0b32190d809a66ec28e3b37cdc695",
            "top_comments": [
                "> The Tucson Sentinel first reported the woman’s death, saying that border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\n\nImagine if someone hadn't made inquiries. How long before anyone who knew her would have gotten answers? She would have just disappeared.",
                "I'm not saying it wasn't suicide, but the article says they didn't even disclose her death until the Tucson Sentinel made inquiries. Seems like they were hoping no one would notice.",
                "So we’re disappearing people and not telling anyone when they die.\n\nCool cool cool. Super cool.",
                "I was told nothing like this would happen.",
                "Not suspicious at all",
                "Either they killed her and are trying to justify her murder, or the conditions in which she was held were so horrible she chose to die rather than bear the pain.\n\nI don't know which is worse.",
                "There is going to be a LOT of this and ICE/DHS will not be accurately reporting it either.",
                "\"A border patrol spokesperson told the Tucson Sentinel that the woman was found “unresponsive in a cell”\n\nAnd that's all we'll hear about that.",
                "I wonder: at what point will everybody agree that the US is a fascist authoritarian country?",
                "What the fuck did they do to her?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Alex Ovechkin breaks Wayne Gretzky’s NHL all-time career goals record | CNN",
            "external_url": "https://www.cnn.com/2025/04/06/sport/alex-ovechkin-surpasses-wayne-gretzky-goals-record-nhl-spt/index.html",
            "upvotes": 1216,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208841308.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Gretzky is one of two athletes that I never thought we'd see someone break their records (Jerry Rice being the other). This is pretty wild.\n\nGretzky's assists record though...no one will ever touch that.\n\nEDIT: Guys, I know there are single record holders that are near impossible to beat. I was talking two players that hold multiple records unlikely to be broken. Two completely dominate players in their respective sport.",
                "Gretzky scored 894 in 1487 games.  Ovi scored 895 in his 1487th game.",
                "Wayne Gretzky is a MAGA clown",
                "I'm only a casual hockey viewer, but was Gretzky's all-time goals record comparable to Kareem's all-time points record or a lot more difficult?",
                "The Great Once up there chilling with Kash Patel.\n\nEvery single person in this current administration is doing anything but actual work during a stock market crash",
                "As some extra context for people who don't follow hockey, Ovi was robbed of 155 games due to NHL lockouts in 2004 and 2013 as well as the shortened covid season. Were it not for that he'd have broken it likely several seasons ago. He also broke his leg this season and missed 5 weeks in recovery. And despite all that, he still scored 42 goals to pass the Great One for the all time lead. Had he not missed time this year, there's a good chance he'd have the lead for most goals on the season too. A truly remarkable player and remarkable moment for the sport.",
                "There honestly isn't a player more deserving of this record.  Ovi never chased the cup, he played his entire career with the Caps and in 2018, the cup came to him. One of the best champions of the game today. Congratulations Ovi, you earned this record and I'm sure it will stand for many years.",
                "Good. Fuck Gretzky.\n\nMAGA piece of shit.",
                "Good. The sooner we can break all Gretsky’s records and let his name fade into obscurity, the better. \n\nThe Great Once. Let his legacy burn to the ground.",
                "Although it just suck to lose one of your records, atleast Gretzky can be happy he lost it to one of his countrymen.."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Pharmacist accused of hacking computers to stalk co-workers at Maryland medical center",
            "external_url": "https://www.cbsnews.com/baltimore/news/university-maryland-medical-center-pharmacist-cyber-stalking-lawsuit/",
            "upvotes": 209,
            "date": "04/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/04/6ed7b41c-88a3-4360-9de8-81c50db80a33/thumbnail/1200x630/41dec68d0c70b1b5884a5912c13911db/gettyimages-2207236668-1.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "I’m referring to only the cybersecurity aspects of this situation, but none of this would have been possible if the hospital had followed basic IT security procedures. The fact that he was able to install software on computers and computers everything else means that there were no security measures in place. No monitoring measures either.\n\nMore than a handful of people need to be fired for this.",
                "> Bathula allegedly targeted about 80 co-workers, most of whom were women. According to the lawsuit, he used security information from UMMC computers to access his victims' accounts and photos. \nCindy B. Morgan, an attorney with Grant & Eisenhofer, tells WJZ that for at least 8 years, Bathula allegedly used keystroke software on UMMC computers to learn employees' usernames and passwords.  From there, Morgan says he was able to download everything from social security numbers to texts and nude pictures. \n\"Incredibly emotionally traumatic to learn that your iCloud could be hacked by somebody that you work with or that you could be surveyed in your home,\" Morgan said.   \nThe lawsuit further alleges that he spied on his victims using internet-enabled cameras in their homes and at UMMC. \n\nHoly cow this is disturbing, and he did this for possibly decades? I can't even imagine how violated his victims feel.",
                "Why would someone do that? Weird creepy behavior",
                ">tl;dr  \n*>Matthew Bathula*  \n  \n***>for at least 8 years,*** *Bathula allegedly used keystroke software on UMMC computers to learn employees' usernames and passwords.*  \n  \n*>he was able to download everything from social security numbers to texts and nude pictures.*   \n  \n*>he spied on his victims using internet-enabled cameras in their homes and at UMMC.*   \n  \n*>He activated the cameras in treatment rooms to watch co-workers that he knew would be pumping breastmilk and accessed home security cameras to spy on victims as they were undressing or engaged in intimate acts*  \n  \n*>He was able to remotely turn off the green button that would alert them that their camera was on, he was able to change the settings, and then he actively surveyed them in their homes,\" Morgan said. \"He surveyed them breastfeeding, he surveyed them having intimate moments with their spouses, he surveyed them nude, partially nude.\"* \n\npretty disgusting",
                "That's a whole new level of creepy, can't believe someone would do that.",
                "The creep aside, why would you have nudes pic, at least nudes pic **available on an externally accessible media**."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Recruiters say more U.S doctors, health-care workers are looking to move to Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/nova-scotia/article/recruiters-say-more-us-doctors-health-care-workers-are-looking-to-move-to-canada/",
            "upvotes": 1938,
            "date": "04/06/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2357XRAPZNECLHCPIZJ2W73BIY.jpg?smart=true&auth=3f9898c2959f0ebc77297be145869f970e327ec5d3e5f129048e610ef0e610f4&width=1200&height=630",
            "top_comments": [
                "Good opportunity for Canada to build up the health care system at the US’s expense.\n\n“Come to Canada, serve patients, not insurance CEO’s”",
                "How ? Please tell me how? I’m an experienced ED nurse? Would love to relocate !",
                "Almost two years ago now, I helped a Florida doctor find a position in a hospital and move to canada. \n\nStill friends with them to this day. I'm not sure they'll ever go back to the States now.",
                "now if only ontarians would stop voting for a guy that keeps fucking with our healthcare...",
                "Please come we need more doctors .\nYou don’t have to deny care because they can’t pay.",
                "Of course they would, education matters there. Here our head of health services is anti vax, and is totally okay with the measles outbreak in texas. It’s fucking pathetic.",
                "Ontario is one of the provinces where if you are board certified doctor in the U.S. you are good to go in Ontario.  No additional requirements.\n\nOne of the sites I heard about recently:\n\nhttps://canamrecruiting.com/",
                "Snippet from this news article:”Nova Scotia Health conducted a campaign in November to attract United States health-care workers to the region, generating more than 500 nursing leads and five new hires.“The purpose of the campaign was to heighten our engagement directly with the U.S leads as a direct result of the current political climate. We are seeing this as an opportunity and we have tangible success stories that have confirmed the value that this campaign has,” says Laura O’Brien, Nova Scotia Health manager of recruitment services. \n\n“We are learning from the high interest that our recruitment efforts are working, health-care professionals and nurses are worried about the uncertainties in the American health-care system. The interest has been so, so much more and we are taking advantage of that.”\n\t•\tDownload the CTV News App for breaking news alerts and video on all the top stories\nNova Scotia Health says it received 65 serious inquiries from U.S. health-care workers that asked about licensing“What’s been great so far in seeing the results from this campaign is that we are seeing experienced nurses and experienced health-care workers. As recruiters here in Nova Scotia, student engagement is one of our top priorities but it is great to have as many graduates as we possibly can but we need those experienced professionals as well and this is giving us an opportunity to leverage that,” says O’Brien. \n\nHealth-care workers could be looking to leave the United States for a variety of reasons, but Nova Scotia Health believe politics is playing a part.“The number one reason is they are feeling uncertain, they’re feeling very uncomfortable depending on their current situation and how they are being portrayed. And I think they just don’t see a future for themselves anymore in that country,” says O’Brien. Roughly 30 per cent of the province’s recruitment is international and Nova Scotia Health has seen a recent uptick in interest from the U.S.“It really started in March of 2023 when Nova Scotia became the first province to allow U.S board-certified physicians to practice in Nova Scotia with additional certifications, so we saw an uptick then and really double the numbers of U.S physicians,” says Katrina Philopoulos, Nova Scotia Health physician recruitment director.",
                "I'm an American who moved to Montreal 25 years ago, after service in the US and all. From 18 to 30 years old, I moved from NYC, to service, to DC, to Montreal and the way I like to phrase it, I kept moving new places and each time my income went down while my quality of life went up.  \n\nNow I live upper middle class here, and have seven weeks vacation annually and happily pay about the same taxes I would if I lived in California because I'm in Québec. AMA, Americans.",
                "Honestly, the rate the US is imploding, Canada keeps looking better every day...."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Texas records second measles-related death in a child",
            "external_url": "https://www.reuters.com/world/us/kennedy-travel-texas-after-second-measles-related-death-axios-reports-2025-04-06/",
            "upvotes": 3009,
            "date": "04/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is increased child mortality the new federal strategy for preventing autism?",
                "I wonder if the family will be as similarly cavalier as those of the last victim. If I recall, it was something to the tune of “It’s unfortunate, but these things happen. No, this incident hasn’t changed our views at all. Why would you think that?”",
                "If only there was some way to prevent this. Some sort of perhaps injection you could take to boost your immune system.",
                "> Kennedy planned to attend the funeral scheduled for Sunday.\n\nFucking grim, imagine having the killer at the funeral.",
                "From a different article about how measles impacts children's long term health.\n\n> An estimated 1 out of every 5 kids who catch measles will be hospitalized, and 1 in 20 will get pneumonia, which is what kills most children who die of the disease, according to the Centers for Disease Control and Prevention (CDC). Some of these hospitalized children will need to be put on a ventilator to recover, Stinchfield said.\nIn about 1 in 1,000 cases, measles causes brain swelling, or encephalitis, which can cause seizures. When it's not fatal, the swelling itself can subside, but it can cause permanent brain damage and other lasting side effects, such as blindness or deafness. \nThe measles virus is capable of replicating in the brain, said Ross Kedl, a professor of immunology at the University of Colorado Anschutz Medical Campus. In some cases, the immune system beats the virus back and the person seems to recover, but measles still lurks in their nervous system.\n\n> The nightmarish effect of this long-term persistence is a condition called subacute sclerosing panencephalitis (SSPE). This is a progressive neurological disorder that might start with mood changes and muscle tremors; then, as it progresses, the person starts losing speech, vision and hearing. After about two years, the person falls into a coma and dies. \n\n\nIt can also erase antibodies that their bodies have created to fight other diseases. It's absolutely insane to me people are willing to risk their own children and other immunocompromised people like this.",
                "Why are so many women and children dying in a state that’s “pro-life”?",
                "Now that child will never be at risk for autism. Mission accomplished. ",
                "Yeah, but… you know- at least they didn’t grow up to be autistic!  What would the neighbors say?!",
                "How is this not considered a form of child abuse? Knowingly placing your child’s wellbeing into jeopardy..and then the worst case occurring. \n\nIf mothers are blamed for miscarriages — then wtf is OK with parents choosing to gamble their child’s life with preventable diseases?",
                "My father told me about how sick he was as a boy when he had the measles. He had high fever and it was horrible. If children are dying, others are going through terrible suffering."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Pope Francis makes surprise public appearance after getting discharged two weeks ago",
            "external_url": "https://edition.cnn.com/2025/04/06/europe/pope-francis-health-public-vatican-intl?Date=20250406&Profile=CNN&utm_content=1743934219&utm_medium=social&utm_source=facebook&fbclid=IwY2xjawJfToJleHRuA2FlbQIxMQABHoP5pJcQROaoRVpqiDTkaJ0vGIM65ybjbzk_adKkzLn7LGt_AiwsTIBpEW5c_aem_L-j25aAUCgGgPtUDbqAPTA",
            "upvotes": 1488,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25096352959850.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I strongly oppose the Catholic Church but I do believe Francis is a good man, and I'm happy to see he's feeling well enough.\n\nI think the movie Conclave (for as much as the Church condemns it) hit the nail on the head. This is a pivotal time for the Church, and it's going to be interesting to see just how measurable the divide that Francis and the other \"liberal\" church members have created. Is there another schism in the works? Could very well be. Catholics can't agree on anything, ever. I should know, I was one for decades.",
                "I'll certainly miss having Pope Francis as the pope when he passes. For all the complaints people seem to have with him, there's no doubt in my mind the Church will swing radically in the opposite direction — as they did after Benedict XVI — and I doubt that'll give the Church any better PR. He's certainly done more to embody core Christian virtues than many popes.",
                "Healthy as a fuckin rhino this guy",
                "I am Christian not Catholic but I wish well and hope he is able to deliver an Easter Sermon. \n\nGod guide him and bless him.",
                "Be nice if he actually did something about the corruption in the Catholic Church.  Just another super rich figurehead",
                "Looks like the cockroach guy from MIB",
                "Please don’t die before my Italy trip in two weeks !",
                "Don't forget kids, do as the Pope asks and pray for the Dugin family.",
                "He heard there were young kids present?",
                "Discharge and pope shouldn’t be in the same sentence."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Thunderstorms trigger catastrophic flooding across the middle of the US",
            "external_url": "https://edition.cnn.com/2025/04/05/weather/central-us-storms-floods-hnk/index.html",
            "upvotes": 4433,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208554765.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I’m sure what’s left of FEMA will take good care of everybody.",
                "Without NOAA there will be little warning of such situations. But billionaires will get $4.5 trillion in unnecessary tax cuts and that's all that matters. Priorities people, priorities.",
                ">The storms have killed at least 16 people across Tennessee, Missouri, Indiana, Arkansas and Kentucky since Wednesday. In Franklin County, Kentucky, a 9-year-old boy was swept away by floodwaters while walking to his school bus stop, police said. And in Little Rock, Arkansas, a 5–year-old was killed at a home battered by severe weather.\n\nThis is so incredibly sad. Can’t even be safe sheltered at home. Theses states have ample funds to recover and if not the federal govt will help, right? \n\nNot even in the third world would a govt forsake its people like this.",
                "No sign of trump anywhere.  Oh wait...he's golfing.",
                "Executive order to ban thunderstorms incoming?",
                "But why is the Fuhrer using the Weather Weapon against us?",
                "Under normal circumstances, this would activate the full strength of FEMA. It still does, but now it's just two people.",
                "What do the crazy religious republicans love to say when east coast cities get hit, and their followers still donate money and listen to them?\n\n\n\"god is punishing these places because Trump is president and sinful.\"",
                "With tariffs the cost to rebuild will skyrocket for all of these disasters. Insurance which is already sky high is going to get even more expensive.",
                "From Eastern Kentucky. Our river is almost as high from the last 2 days of rain as it was a month ago when the really bad flooding happened in Pike County. The Ohio is on a flood watch as well. This is going to become more and more normal as the climate becomes more volatile."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Doge’s attack on social security causing ‘complete, utter chaos’, staff says | US social security",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/musk-doge-social-security",
            "upvotes": 22555,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f437b2bfe2b2066194423af11c741ab412c9e650/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4e65814c3655dec53aa09824e402b25e",
            "top_comments": [
                "The GOP has wanted to privatize Social Security since Reagan.",
                "So working people have paid into this their whole lives on the assumption it will be returned to them in retirement, only for it to be demolished without a mandate? How can anyone think this is a good idea?",
                ">Musk has [called](https://www.warren.senate.gov/newsroom/videos/watch/elon-musk-called-social-security-the-biggest-ponzi-scheme-of-all-time) social security “the biggest Ponzi scheme of all time” and has consistently pushed false claims and conspiracies about the program.\n\n>Howard Lutnick claimed in an [interview](https://www.youtube.com/watch?v=182ckTL2KBA) on a podcast earlier this month that only a “fraudster” would complain about missing a social security benefit check.\n\nWhat more do you expect from the team that has these things to say?\n\n*Elect a clown and expect a circus with more un-elected clowns!*",
                "Here’s the plan. Cause havoc. The system breaks down. People lose their minds. “An alternative” happens and Social Security is privatized. I mean sold to a Trump lackey. Service is costlier and totally sucks after that.",
                "How the fuck are we letting an unelected  foreigner dismantle Social Security?\n\nFucking Republicans need to be voted out at every goddamned opportunity.",
                "If this isn’t the most terrifying look yet at the brink of disaster DOGE is speeding us toward, I don’t know what is. Most of its actions have been equally arbitrary or poorly thought out. This is why the government employs well-educated professionals with ethics for these roles. Not only is each agency a creation that resulted because of a law or initiative that Congress passed that needed people to implement and operate it, being a public servant carries an ethical duty (with an oath to the constitution) that few, if any, private sector companies require. It’s because the government knows it’s working with a carefully and time-tested system that impacts every American in some way. It’s not just an app. If you break things in government, people can die.",
                "I wonder how much the average senior's blood pressure has risen. People my age (68) and older do not need this kind of stress.",
                "This would be terrifying under the best of economic times.  So there is no word to describe it given that every expert seems to think we're barreling towards the worst economy since the Great Depression.\n\nBefore the tariff EO last week, I was thinking that if the Trump administration destroys SS, my siblings and me will just pool our resources so that our retired parents don't starve or lose the house.  I just won't go on vacation this year.  It will be OK.\n\nBut now?  I'm scared my siblings and I will be unemployed by the end of the year.",
                "Social Security is NOT part of the budget. It is our money that our employers and ourselves have put towards our retirement. Any bastardized version of that is the fault of our elected officials.",
                "I was part of a large system upgrade at a major bank (one of the biggest in the US) and this was for a system that had been thoroughly tested, not one that was being created on the fly. We had so many problems that in decades of working in IT support, I've done fewer support calls in a month than I would do every day during this project."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Chinese woman detained by US border patrol in Arizona dies by suicide",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/chinese-woman-border-patrol-arizona-suicide",
            "upvotes": 2343,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4f8803d21e78b9889f3651d55759542f0f3313b0/122_184_3864_2320/master/3864.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e6e0b32190d809a66ec28e3b37cdc695",
            "top_comments": [
                "> The Tucson Sentinel first reported the woman’s death, saying that border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\n\nImagine if someone hadn't made inquiries. How long before anyone who knew her would have gotten answers? She would have just disappeared.",
                "I'm not saying it wasn't suicide, but the article says they didn't even disclose her death until the Tucson Sentinel made inquiries. Seems like they were hoping no one would notice.",
                "So we’re disappearing people and not telling anyone when they die.\n\nCool cool cool. Super cool.",
                "I was told nothing like this would happen.",
                "Not suspicious at all",
                "Either they killed her and are trying to justify her murder, or the conditions in which she was held were so horrible she chose to die rather than bear the pain.\n\nI don't know which is worse.",
                "There is going to be a LOT of this and ICE/DHS will not be accurately reporting it either.",
                "\"A border patrol spokesperson told the Tucson Sentinel that the woman was found “unresponsive in a cell”\n\nAnd that's all we'll hear about that.",
                "I wonder: at what point will everybody agree that the US is a fascist authoritarian country?",
                "What the fuck did they do to her?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Alex Ovechkin breaks Wayne Gretzky’s NHL all-time career goals record | CNN",
            "external_url": "https://www.cnn.com/2025/04/06/sport/alex-ovechkin-surpasses-wayne-gretzky-goals-record-nhl-spt/index.html",
            "upvotes": 1225,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208841308.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Gretzky is one of two athletes that I never thought we'd see someone break their records (Jerry Rice being the other). This is pretty wild.\n\nGretzky's assists record though...no one will ever touch that.\n\nEDIT: Guys, I know there are single record holders that are near impossible to beat. I was talking two players that hold multiple records unlikely to be broken. Two completely dominate players in their respective sport.",
                "Gretzky scored 894 in 1487 games.  Ovi scored 895 in his 1487th game.",
                "Wayne Gretzky is a MAGA clown",
                "I'm only a casual hockey viewer, but was Gretzky's all-time goals record comparable to Kareem's all-time points record or a lot more difficult?",
                "The Great Once up there chilling with Kash Patel.\n\nEvery single person in this current administration is doing anything but actual work during a stock market crash",
                "As some extra context for people who don't follow hockey, Ovi was robbed of 155 games due to NHL lockouts in 2004 and 2013 as well as the shortened covid season. Were it not for that he'd have broken it likely several seasons ago. He also broke his leg this season and missed 5 weeks in recovery. And despite all that, he still scored 42 goals to pass the Great One for the all time lead. Had he not missed time this year, there's a good chance he'd have the lead for most goals on the season too. A truly remarkable player and remarkable moment for the sport.",
                "There honestly isn't a player more deserving of this record.  Ovi never chased the cup, he played his entire career with the Caps and in 2018, the cup came to him. One of the best champions of the game today. Congratulations Ovi, you earned this record and I'm sure it will stand for many years.",
                "Good. Fuck Gretzky.\n\nMAGA piece of shit.",
                "Good. The sooner we can break all Gretsky’s records and let his name fade into obscurity, the better. \n\nThe Great Once. Let his legacy burn to the ground.",
                "Although it just suck to lose one of your records, atleast Gretzky can be happy he lost it to one of his countrymen.."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Pharmacist accused of hacking computers to stalk co-workers at Maryland medical center",
            "external_url": "https://www.cbsnews.com/baltimore/news/university-maryland-medical-center-pharmacist-cyber-stalking-lawsuit/",
            "upvotes": 209,
            "date": "04/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/04/6ed7b41c-88a3-4360-9de8-81c50db80a33/thumbnail/1200x630/41dec68d0c70b1b5884a5912c13911db/gettyimages-2207236668-1.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "I’m referring to only the cybersecurity aspects of this situation, but none of this would have been possible if the hospital had followed basic IT security procedures. The fact that he was able to install software on computers and computers everything else means that there were no security measures in place. No monitoring measures either.\n\nMore than a handful of people need to be fired for this.",
                "> Bathula allegedly targeted about 80 co-workers, most of whom were women. According to the lawsuit, he used security information from UMMC computers to access his victims' accounts and photos. \nCindy B. Morgan, an attorney with Grant & Eisenhofer, tells WJZ that for at least 8 years, Bathula allegedly used keystroke software on UMMC computers to learn employees' usernames and passwords.  From there, Morgan says he was able to download everything from social security numbers to texts and nude pictures. \n\"Incredibly emotionally traumatic to learn that your iCloud could be hacked by somebody that you work with or that you could be surveyed in your home,\" Morgan said.   \nThe lawsuit further alleges that he spied on his victims using internet-enabled cameras in their homes and at UMMC. \n\nHoly cow this is disturbing, and he did this for possibly decades? I can't even imagine how violated his victims feel.",
                "Why would someone do that? Weird creepy behavior",
                ">tl;dr  \n*>Matthew Bathula*  \n  \n***>for at least 8 years,*** *Bathula allegedly used keystroke software on UMMC computers to learn employees' usernames and passwords.*  \n  \n*>he was able to download everything from social security numbers to texts and nude pictures.*   \n  \n*>he spied on his victims using internet-enabled cameras in their homes and at UMMC.*   \n  \n*>He activated the cameras in treatment rooms to watch co-workers that he knew would be pumping breastmilk and accessed home security cameras to spy on victims as they were undressing or engaged in intimate acts*  \n  \n*>He was able to remotely turn off the green button that would alert them that their camera was on, he was able to change the settings, and then he actively surveyed them in their homes,\" Morgan said. \"He surveyed them breastfeeding, he surveyed them having intimate moments with their spouses, he surveyed them nude, partially nude.\"* \n\npretty disgusting",
                "That's a whole new level of creepy, can't believe someone would do that.",
                "The creep aside, why would you have nudes pic, at least nudes pic **available on an externally accessible media**."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Recruiters say more U.S doctors, health-care workers are looking to move to Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/nova-scotia/article/recruiters-say-more-us-doctors-health-care-workers-are-looking-to-move-to-canada/",
            "upvotes": 1940,
            "date": "04/06/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2357XRAPZNECLHCPIZJ2W73BIY.jpg?smart=true&auth=3f9898c2959f0ebc77297be145869f970e327ec5d3e5f129048e610ef0e610f4&width=1200&height=630",
            "top_comments": [
                "Good opportunity for Canada to build up the health care system at the US’s expense.\n\n“Come to Canada, serve patients, not insurance CEO’s”",
                "How ? Please tell me how? I’m an experienced ED nurse? Would love to relocate !",
                "Almost two years ago now, I helped a Florida doctor find a position in a hospital and move to canada. \n\nStill friends with them to this day. I'm not sure they'll ever go back to the States now.",
                "now if only ontarians would stop voting for a guy that keeps fucking with our healthcare...",
                "Please come we need more doctors .\nYou don’t have to deny care because they can’t pay.",
                "Of course they would, education matters there. Here our head of health services is anti vax, and is totally okay with the measles outbreak in texas. It’s fucking pathetic.",
                "Ontario is one of the provinces where if you are board certified doctor in the U.S. you are good to go in Ontario.  No additional requirements.\n\nOne of the sites I heard about recently:\n\nhttps://canamrecruiting.com/",
                "Snippet from this news article:”Nova Scotia Health conducted a campaign in November to attract United States health-care workers to the region, generating more than 500 nursing leads and five new hires.“The purpose of the campaign was to heighten our engagement directly with the U.S leads as a direct result of the current political climate. We are seeing this as an opportunity and we have tangible success stories that have confirmed the value that this campaign has,” says Laura O’Brien, Nova Scotia Health manager of recruitment services. \n\n“We are learning from the high interest that our recruitment efforts are working, health-care professionals and nurses are worried about the uncertainties in the American health-care system. The interest has been so, so much more and we are taking advantage of that.”\n\t•\tDownload the CTV News App for breaking news alerts and video on all the top stories\nNova Scotia Health says it received 65 serious inquiries from U.S. health-care workers that asked about licensing“What’s been great so far in seeing the results from this campaign is that we are seeing experienced nurses and experienced health-care workers. As recruiters here in Nova Scotia, student engagement is one of our top priorities but it is great to have as many graduates as we possibly can but we need those experienced professionals as well and this is giving us an opportunity to leverage that,” says O’Brien. \n\nHealth-care workers could be looking to leave the United States for a variety of reasons, but Nova Scotia Health believe politics is playing a part.“The number one reason is they are feeling uncertain, they’re feeling very uncomfortable depending on their current situation and how they are being portrayed. And I think they just don’t see a future for themselves anymore in that country,” says O’Brien. Roughly 30 per cent of the province’s recruitment is international and Nova Scotia Health has seen a recent uptick in interest from the U.S.“It really started in March of 2023 when Nova Scotia became the first province to allow U.S board-certified physicians to practice in Nova Scotia with additional certifications, so we saw an uptick then and really double the numbers of U.S physicians,” says Katrina Philopoulos, Nova Scotia Health physician recruitment director.",
                "I'm an American who moved to Montreal 25 years ago, after service in the US and all. From 18 to 30 years old, I moved from NYC, to service, to DC, to Montreal and the way I like to phrase it, I kept moving new places and each time my income went down while my quality of life went up.  \n\nNow I live upper middle class here, and have seven weeks vacation annually and happily pay about the same taxes I would if I lived in California because I'm in Québec. AMA, Americans.",
                "Honestly, the rate the US is imploding, Canada keeps looking better every day...."
            ],
            "aggregate_sentiment": 90.0
        },
        {
            "category": "RISING",
            "title": "Texas records second measles-related death in a child",
            "external_url": "https://www.reuters.com/world/us/kennedy-travel-texas-after-second-measles-related-death-axios-reports-2025-04-06/",
            "upvotes": 3009,
            "date": "04/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is increased child mortality the new federal strategy for preventing autism?",
                "I wonder if the family will be as similarly cavalier as those of the last victim. If I recall, it was something to the tune of “It’s unfortunate, but these things happen. No, this incident hasn’t changed our views at all. Why would you think that?”",
                "If only there was some way to prevent this. Some sort of perhaps injection you could take to boost your immune system.",
                "> Kennedy planned to attend the funeral scheduled for Sunday.\n\nFucking grim, imagine having the killer at the funeral.",
                "From a different article about how measles impacts children's long term health.\n\n> An estimated 1 out of every 5 kids who catch measles will be hospitalized, and 1 in 20 will get pneumonia, which is what kills most children who die of the disease, according to the Centers for Disease Control and Prevention (CDC). Some of these hospitalized children will need to be put on a ventilator to recover, Stinchfield said.\nIn about 1 in 1,000 cases, measles causes brain swelling, or encephalitis, which can cause seizures. When it's not fatal, the swelling itself can subside, but it can cause permanent brain damage and other lasting side effects, such as blindness or deafness. \nThe measles virus is capable of replicating in the brain, said Ross Kedl, a professor of immunology at the University of Colorado Anschutz Medical Campus. In some cases, the immune system beats the virus back and the person seems to recover, but measles still lurks in their nervous system.\n\n> The nightmarish effect of this long-term persistence is a condition called subacute sclerosing panencephalitis (SSPE). This is a progressive neurological disorder that might start with mood changes and muscle tremors; then, as it progresses, the person starts losing speech, vision and hearing. After about two years, the person falls into a coma and dies. \n\n\nIt can also erase antibodies that their bodies have created to fight other diseases. It's absolutely insane to me people are willing to risk their own children and other immunocompromised people like this.",
                "Why are so many women and children dying in a state that’s “pro-life”?",
                "Now that child will never be at risk for autism. Mission accomplished. ",
                "Yeah, but… you know- at least they didn’t grow up to be autistic!  What would the neighbors say?!",
                "How is this not considered a form of child abuse? Knowingly placing your child’s wellbeing into jeopardy..and then the worst case occurring. \n\nIf mothers are blamed for miscarriages — then wtf is OK with parents choosing to gamble their child’s life with preventable diseases?",
                "My father told me about how sick he was as a boy when he had the measles. He had high fever and it was horrible. If children are dying, others are going through terrible suffering."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Pope Francis makes surprise public appearance after getting discharged two weeks ago",
            "external_url": "https://edition.cnn.com/2025/04/06/europe/pope-francis-health-public-vatican-intl?Date=20250406&Profile=CNN&utm_content=1743934219&utm_medium=social&utm_source=facebook&fbclid=IwY2xjawJfToJleHRuA2FlbQIxMQABHoP5pJcQROaoRVpqiDTkaJ0vGIM65ybjbzk_adKkzLn7LGt_AiwsTIBpEW5c_aem_L-j25aAUCgGgPtUDbqAPTA",
            "upvotes": 1484,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25096352959850.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I strongly oppose the Catholic Church but I do believe Francis is a good man, and I'm happy to see he's feeling well enough.\n\nI think the movie Conclave (for as much as the Church condemns it) hit the nail on the head. This is a pivotal time for the Church, and it's going to be interesting to see just how measurable the divide that Francis and the other \"liberal\" church members have created. Is there another schism in the works? Could very well be. Catholics can't agree on anything, ever. I should know, I was one for decades.",
                "I'll certainly miss having Pope Francis as the pope when he passes. For all the complaints people seem to have with him, there's no doubt in my mind the Church will swing radically in the opposite direction — as they did after Benedict XVI — and I doubt that'll give the Church any better PR. He's certainly done more to embody core Christian virtues than many popes.",
                "Healthy as a fuckin rhino this guy",
                "I am Christian not Catholic but I wish well and hope he is able to deliver an Easter Sermon. \n\nGod guide him and bless him.",
                "Be nice if he actually did something about the corruption in the Catholic Church.  Just another super rich figurehead",
                "Looks like the cockroach guy from MIB",
                "Please don’t die before my Italy trip in two weeks !",
                "Don't forget kids, do as the Pope asks and pray for the Dugin family.",
                "He heard there were young kids present?",
                "Discharge and pope shouldn’t be in the same sentence."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Doge’s attack on social security causing ‘complete, utter chaos’, staff says | US social security",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/musk-doge-social-security",
            "upvotes": 22560,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f437b2bfe2b2066194423af11c741ab412c9e650/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4e65814c3655dec53aa09824e402b25e",
            "top_comments": [
                "The GOP has wanted to privatize Social Security since Reagan.",
                "So working people have paid into this their whole lives on the assumption it will be returned to them in retirement, only for it to be demolished without a mandate? How can anyone think this is a good idea?",
                ">Musk has [called](https://www.warren.senate.gov/newsroom/videos/watch/elon-musk-called-social-security-the-biggest-ponzi-scheme-of-all-time) social security “the biggest Ponzi scheme of all time” and has consistently pushed false claims and conspiracies about the program.\n\n>Howard Lutnick claimed in an [interview](https://www.youtube.com/watch?v=182ckTL2KBA) on a podcast earlier this month that only a “fraudster” would complain about missing a social security benefit check.\n\nWhat more do you expect from the team that has these things to say?\n\n*Elect a clown and expect a circus with more un-elected clowns!*",
                "Here’s the plan. Cause havoc. The system breaks down. People lose their minds. “An alternative” happens and Social Security is privatized. I mean sold to a Trump lackey. Service is costlier and totally sucks after that.",
                "How the fuck are we letting an unelected  foreigner dismantle Social Security?\n\nFucking Republicans need to be voted out at every goddamned opportunity.",
                "If this isn’t the most terrifying look yet at the brink of disaster DOGE is speeding us toward, I don’t know what is. Most of its actions have been equally arbitrary or poorly thought out. This is why the government employs well-educated professionals with ethics for these roles. Not only is each agency a creation that resulted because of a law or initiative that Congress passed that needed people to implement and operate it, being a public servant carries an ethical duty (with an oath to the constitution) that few, if any, private sector companies require. It’s because the government knows it’s working with a carefully and time-tested system that impacts every American in some way. It’s not just an app. If you break things in government, people can die.",
                "I wonder how much the average senior's blood pressure has risen. People my age (68) and older do not need this kind of stress.",
                "This would be terrifying under the best of economic times.  So there is no word to describe it given that every expert seems to think we're barreling towards the worst economy since the Great Depression.\n\nBefore the tariff EO last week, I was thinking that if the Trump administration destroys SS, my siblings and me will just pool our resources so that our retired parents don't starve or lose the house.  I just won't go on vacation this year.  It will be OK.\n\nBut now?  I'm scared my siblings and I will be unemployed by the end of the year.",
                "Social Security is NOT part of the budget. It is our money that our employers and ourselves have put towards our retirement. Any bastardized version of that is the fault of our elected officials.",
                "I was part of a large system upgrade at a major bank (one of the biggest in the US) and this was for a system that had been thoroughly tested, not one that was being created on the fly. We had so many problems that in decades of working in IT support, I've done fewer support calls in a month than I would do every day during this project."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Thunderstorms trigger catastrophic flooding across the middle of the US",
            "external_url": "https://edition.cnn.com/2025/04/05/weather/central-us-storms-floods-hnk/index.html",
            "upvotes": 4434,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208554765.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I’m sure what’s left of FEMA will take good care of everybody.",
                "Without NOAA there will be little warning of such situations. But billionaires will get $4.5 trillion in unnecessary tax cuts and that's all that matters. Priorities people, priorities.",
                ">The storms have killed at least 16 people across Tennessee, Missouri, Indiana, Arkansas and Kentucky since Wednesday. In Franklin County, Kentucky, a 9-year-old boy was swept away by floodwaters while walking to his school bus stop, police said. And in Little Rock, Arkansas, a 5–year-old was killed at a home battered by severe weather.\n\nThis is so incredibly sad. Can’t even be safe sheltered at home. Theses states have ample funds to recover and if not the federal govt will help, right? \n\nNot even in the third world would a govt forsake its people like this.",
                "No sign of trump anywhere.  Oh wait...he's golfing.",
                "Executive order to ban thunderstorms incoming?",
                "But why is the Fuhrer using the Weather Weapon against us?",
                "Under normal circumstances, this would activate the full strength of FEMA. It still does, but now it's just two people.",
                "What do the crazy religious republicans love to say when east coast cities get hit, and their followers still donate money and listen to them?\n\n\n\"god is punishing these places because Trump is president and sinful.\"",
                "With tariffs the cost to rebuild will skyrocket for all of these disasters. Insurance which is already sky high is going to get even more expensive.",
                "From Eastern Kentucky. Our river is almost as high from the last 2 days of rain as it was a month ago when the really bad flooding happened in Pike County. The Ohio is on a flood watch as well. This is going to become more and more normal as the climate becomes more volatile."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "At least 16 dead as storms touch off tornadoes and widespread flooding in central US",
            "external_url": "https://edition.cnn.com/2025/04/06/weather/south-midwest-storm-peak-flooding-hnk/index.html",
            "upvotes": 811,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25095700312819.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Perfect time for President to go golfing!",
                "Hey Americans! Do you think our President will mention anything about our fellow Americans dying this weekend - unprompted!?",
                "The irony is no one in the media is screaming for FEMA or for the president, or anyone….I remember non stop around the clock coverage during Biden presidency when one tornado did any damages…",
                "Curious where all the right wing Christians are, who blame this sort of disaster on the morally corrupt?\nSuddenly nothing to say now that Trump is in the White house 🤔",
                "They should have raked their forest better",
                "Trump didn’t authorize that with his sharpie , so no relief",
                "Good thing they got rid of FEMA and NOAA.",
                "So god is punishing the sinners? Maybe conservatives openly embracing pedophilia was a bad idea. \n\nAm I doing this right Christians?",
                "Guess we should cut FEMA spending.",
                "Central USA equals Trump country. FEMA has all been eliminated so good luck receiving federal money. Unless you kiss the ring."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Galapagos tortoises at Philadelphia Zoo become first-time parents at nearly 100 years old",
            "external_url": "https://www.cbsnews.com/philadelphia/news/galapagos-tortoises-at-philadelphia-zoo-become-first-time-parents-at-nearly-100/",
            "upvotes": 7641,
            "date": "04/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/05/1f31bddb-2587-455e-be25-b4545e7b032f/thumbnail/1200x630/45fda76d5750501e0ee52e44f1570bf6/chopper-3-bug-horizontal-thumbnail-mugshots.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "🤗🤗🤗🤗CONGRATULATIONS MY LOVELY ONES! 🐢🐢🐢🐢🐢🐢",
                "Congratulations to the young couple!",
                "Best vacation I ever had was Galapagos Islands in 2012. Stayed on Isabella Island and there was a tortoise breeding station there. Many tortoises from very small to fairly good size. The workers had never released a tortoise into the wild because they had to wait for adolescence (70 years old) so the tortoises could fend off predators.",
                "I can’t imagine being 118 years old at my son’s graduation.",
                "Foreplay lasted 85 years! 🤣",
                "Feels like about the age I’ll be ready to have kids",
                "Wait till they find out how expensive is it to raise kids.",
                "In this economy??!?!",
                "Isn't this actually amazing news for the species?",
                "I take my son to the zoo every other weekend. Those tortoises are banging EVERYTIME we go."
            ],
            "aggregate_sentiment": 100.0
        }
    ],
    "last_updated": "04/06/2025 20:08:40 UTC"
}