{
    "posts": [
        {
            "category": "HOT",
            "title": "Fears over extremism in US military as soldier revealed as neo-Nazi TikTok follower",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/14/us-military-extremism-the-base",
            "upvotes": 25004,
            "date": "04/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/06022cc5a489574a13f2c0d9f524b425e88a8fef/0_51_1500_900/master/1500.png?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=af364b4fcd4b4a90b875795a970167cf",
            "top_comments": [
                "\"But in February, the DoD issued a memo halting a major counter-extremism initiative rooting out white nationalists and far-right influences among servicemen, citing that it was not in line with Donald Trump’s executive orders.\" \nBig yikes",
                "For the last time, he’s not a soldier, he’s secretary of defense.",
                "For the party that complains about being called Nazis, republicans sure have a lot of Nazis.",
                "I’m more worried about them in the white house",
                "My experience in the military is it made people more tolerant as it was the first time people mingled with different backgrounds. \n\nThat said, when your job is to protect/kill, you can't be surprised when your governments sanctioned killers got a few screws loose and turn to poisonous warrior-coded ideologies. \n\nNot sure what the answer is, but when your whole being is demonizing and finding faults in certain areas/culture so you can look at terrorism in a shrewd lens, you eventually demonize the population.",
                "As a euro nobody, let me tell you : this kind of idiot exists in every first world armed forces. To varying degrees. The issue is really how organized and dedicated to their cause they are.",
                "[removed]",
                "Ive seen a lot of people express hope that the military will step up when Trump eventually crosses a line with regards to annexation.\n\nStuff like this should reinforce that is unlikely to happen",
                "Meanwhile Joe Kent is awaiting senate confirmation. Look him up. How does one expect right wing extremism to be tamped down when white christian nationalists are in charge of major intelligence and defense institutions",
                "The article forgot to mention that the Neo-Nazi group in the article, The Base is linked to the Kremlin. The founder and leader currently lives in Saint Petersburg and the European based members have fought for Russia in Ukraine. The Kremlin offers financial support and likely offers material support to the group. \n\nSide note the group's name is literally the English version of al-Qaeda."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "4 Months Into the Year, Chicago Set to Exhaust $82M Annual Budget for Police Misconduct Settlements",
            "external_url": "https://news.wttw.com/2025/04/14/chicago-set-exhaust-annual-budget-police-misconduct-settlements",
            "upvotes": 3287,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The fact that there is an annual budget for that in the first place.",
                "Absolutely bonkers to me that we haven’t forced police unions to maintain misconduct insurance. Doctors and lawyers have to have malpractice insurance. Why the fuck should taxpayers have to bear the cost of vindicating their rights? And how to we expect to incentivize less misconduct if the actors don’t bear the cost of bad apples?",
                "End qualified immunity, make officers carry their own liability insurance. You know just like nurses, doctors and other \"professionals\". Always remember this is not $ that falls from the sky, these are YOUR tax paid $$'s.",
                "Guess they should tap in to the police pension fund right?",
                "This is why every other country in the world trains their police force for more than 6 months before giving them a badge and a gun and letting them go play cowboys",
                "That’s insane. \n\nAnd it’s all tax payers money, paying for these things. It should come from the cops only. Either their “union” or they need to lay people off by using their own, SET budget for the year. ",
                "The fix for this is to have each police officer required to carry an insurance against it.  Calculate what the median insurance cost is for all the officers on the force, give everyone a raise to include that amount and let nature takes it course. \n\n\nGood officers will have lower premiums and effectively get a raise out of the deal. \n\n\nBad officers will quickly work themselves out of a job as they are literally uninsurable without using half their pay or more.  ",
                "$82M set aside to make a violent gang seem like a legitimate law enforcement agency. Not enough lipstick for that pig. ",
                "Make the cops carry their own misconduct insurance like we do for Medical professionals. If a cop is too expensive to insure because they constant abuse their authority and harm citizens, said cop shouldn’t have a job enforcing the law. ",
                "Start pulling from the pensions and retirements."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "China, Vietnam sign deals as Xi visits Hanoi amid US tariff tensions",
            "external_url": "https://www.reuters.com/world/asia-pacific/chinas-xi-meet-vietnam-leaders-kick-off-southeast-asia-tour-amid-us-tariffs-2025-04-14/",
            "upvotes": 722,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Holy crap trump is uniting the world....",
                "Good job, dumbass. You drove one of the best alternatives to China into China's arms.",
                "That's the art of the deal,, if donny don't want to play nice,, he's out of the game.",
                "Trump said Vietnam was begging please sir please sir. He is just full of shit.",
                "This is actually hilarious",
                "Liberation day was for the world, not the Americans 😂",
                "It’s so funny watching Trump suck so much that he is turning long time geopolitical rivals like Vietnam and China together. Masterful gambit sir.",
                "Title should read “China shores up trade routes with Vietnam to circumnavigate US tariffs.”",
                "Two net exporters signing a deal to export more to each other.  Lol.",
                "Please, stop Mr. Trump, I can’t handle all this winning"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Pennsylvania school shooting was planned for Columbine anniversary, police say",
            "external_url": "https://www.denver7.com/us-news/crime/pennsylvania-school-shooting-was-planned-for-columbine-anniversary-police-say",
            "upvotes": 708,
            "date": "04/14/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/e4a8cb0/2147483647/strip/true/crop/5071x2662+0+148/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F0f%2F3c%2Fe6d5816b4dd7ac65121fda2329b3%2Fap24166569232381.jpg",
            "top_comments": [
                ">Police allege Phillips initially planned to carry out the shooting on April 20, which would have been the 26th anniversary of the Columbine shooting, but that he changed the date because April 20 falls on a Sunday this year.\n\nI kind of want to know how far along his plans were before he looked at the calendar. Either way, good thing he was stopped.",
                ">“State College Police would like to recognize that the success of this investigation would not have been possible without the initial report made by a concerned citizen. This illustrates the importance of ‘see something, say something.’”\n\nIt's honestly a relief to hear that someone took action and alerted authorities, because, well, the situation could've been catastrophic. It really emphasizes the power of community vigilance, a concerned citizen's tip saved lives. And, to be honest, I'm glad it turned out this way... it's a reminder that paying attention and speaking up can make a world of difference.",
                "Some fucked up shit going on in Pennsylvania lately.",
                "People are so evil man.",
                "Nearly every mass shooter has subsequently been found to have researched media coverage of previous mass shootings. I'm glad that media outlets have belatedly recognized this form of the contagion effect and adjusted the way that they cover those incidents. We shouldn't be told anything about the motives of the shooter, and preferably have minimal mention of their name.",
                "What's going on Pennsylvania, damn.",
                "I'm also worried about April 19th, which marks the 30th anniversary of the Oklahoma City Bombing. And, of course, there's speculation that Trump may invoke the insurrection act this weekend. I'm so tired, y'all.",
                "ya know, for all the shit that's happening in that country, it's nice to not hear about school shootings once every couple of weeks.\n\nnot sure if actual shootings are down or just not reported.",
                "Yikes. I went to school here in 2001. Glad they caught him"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "FAA says company whose sightseeing chopper crashed, killing 6, is ceasing operations immediately",
            "external_url": "https://apnews.com/article/helicopter-new-york-tour-industry-crash-bcd2e4ed8143d50d550b8d88ce77496e",
            "upvotes": 6018,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The company has had some accidents in the past.  But you have to figure that losing the rotors in flight has to be a blatant maintenance failure.",
                "That was fast. Guess they don’t have big lawyer money?\n\nOr is it easy enough to shutdown this company with a bad reputation, then the owners open a new one in a couple years?",
                "Can they avoid a civil suit by dissolving the company?",
                "Soon to open under a new and untarnished name:(",
                "A video I saw on the  YouTube channel seemed to show the rotor with the transmission still attached. If that is correct then it wasn’t the Jesus nut.\nEdit 1. Broncolirio YouTube channel.",
                "[removed]",
                "It's just awful to see this happen, particularly given that the article points out five helicopters have fallen into the rivers in recent years, and the situation is made worse because attempts to restrict these flights haven't really succeeded, I mean, it's something we need to really address, but apparently it's been a difficult fight... and to be honest, it's just sad that something like this keeps happening.",
                "Without the internet, I might have gotten into a helicopter one day. Now, that is never happening.",
                "They do the same when someone gets killed at the club. They close briefly and re-open as a new club with a new name and continue operating with the same owners under a new company.",
                "Can’t sue us if we don’t exist!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Wisconsin teen allegedly killed parents in extremist plot to assassinate Trump, FBI says",
            "external_url": "https://abcnews.go.com/US/wisconsin-teen-allegedly-killed-parents-extremist-plot-assassinate/story?id=120750496",
            "upvotes": 14749,
            "date": "04/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/434debed-e7fb-439e-8ca2-a049d72f56af/waukesha-shooter-02-ht-jt-250412_1744482092946_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "hearing the story on the news yesterday was wild because each sentence just got weirder than the last 😭\n\n1. killed his parents\n\n2. plots against trump\n\n3. wrote a manifesto discussing plans to take over america\n\n4. loved hitler and wants a new order of neo nazism",
                "They conveniently leave the other half of the headline out. That he wanted to kill Trump to start a race war.",
                ">The sheriff's department issued a search warrant and say they found material on the teen's phone related to \"The Order of Nine Angles,\" which is \"a network of individuals holding new-Nazi racially motivated extremist views,\" according to investigators.\n\nWhy can't we say \"gang\"? If 'a network of individuals' isn't gang or a mob then what is it? Call them an anti-american Nazi gang.",
                "It’s crazy how many of these mass shooters fall into white nationalism rabbit holes. \n\nI watched Frontline’s documentary on Terrorgram, and it’s really scary how effective it is playing out in real time.",
                "These headlines keep leaving of the white supremacist part.",
                "Might we also remember that a relatively young man beheaded his father in 2024 as a message to the Biden administration? Something is so deeply broken in our nation.",
                "\"Wisconsin NEO-NAZI & WHITE SUPREMACIST killed parents, aspired to assassination and instigate a race war.\"\n\n- Fixed the title for you",
                "> And he paid for, at least in part, a drone and explosives to be used as a weapon of mass destruction to commit an attack.\n\nI feel like it's just a matter of time until we start seeing drones being used in terror attacks or assassination plots. We've all seen how effectively they are being used now in combat.",
                "Interesting that all those who have plotted to kill him so far have been fellow right-wingers.",
                "A nazi who thinks fat donny isn't enough of nazi\n\nThe absolute state of the right, holy fucking shit"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Cody Balmer was \"harboring hatred\" toward Shapiro before setting fire at Governor's Residence, documents say",
            "external_url": "https://www.cbsnews.com/philadelphia/news/cody-balmer-governors-residence-fire-josh-shapiro-harrisburg/",
            "upvotes": 278,
            "date": "04/14/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/13/a35e635d-1a6b-4478-a65d-dce499693915/thumbnail/1200x630/72eef0eac0b2ba0def67ecf4f2bbb49e/shapiro1.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "What’s with the hammer attack thing? Nancy Pelosi’s husband was also attacked with a hammer",
                "I would imagine most people who set fire to someone's house and plan to assault them with a hammer probably harbor hatred for them.",
                "I mean, fire bombing is rarely an act of love. Despite what my ex told the judge.",
                "Attacking a Jewish governor during Passover, yet the administration has been eerily quiet about “antisemitism” regarding this event. Interesting given they’re actively arguing they must deport people who organize anti-Israel protests because it’s “antisemitic”.",
                "Of course he was but the real question is Why? What did the Governer do to make him so angry he thought his only recourse was assault and burning down his house.",
                "These stories should talk more about which 'influencers' encouraged him to do this.",
                "Woah, I would never have guessed…",
                "It's okay everyone, he just has mental health needs /s",
                "Where's the president condemning this as terrorism?  \n\nOh, right.  It's not a tesla dealership, but a political rival.  I'm sure he condones it.",
                "So here's the question I wish was asked after all of these homegrown terrorism cases:\n\nWho radicized him? And what are we going to do to prevent more from becoming hopelessly radicalized into committing acts of violence?"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "Menendez brothers' aunt hospitalized after DA shares graphic photos in court: 'We are devastated'",
            "external_url": "https://abcnews.go.com/US/menendez-brothers-aunt-hospitalized-after-da-shares-graphic/story?id=120782064",
            "upvotes": 211,
            "date": "04/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d30f3f98-a280-432f-8c7d-c05a7b00d053/terry-baralt-abc-jef-250414_1744637652867_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "She is 85 years old and battling cancer. I mean it could be that too",
                ">The family said the graphic display violated Marsy's Law -- California's bill of rights for victims -- specifically noting it states that a victim is entitled \"to be treated with fairness and respect\" and be \"free from intimidation, harassment, and abuse.\"\n\nShe's a victim because her sister died. But she's there to support the accused. Did she never see the evidence in the 30 years before hand?",
                "I mean... it's an investigation into whether or not they should be let out of prison after brutally murdering their parents. Whether or not you believe they should be released or not, you have to expect to see or hear some really intense things in that courtroom. \n\nAlso, the woman is battling cancer. I am sure that has nothing to do with her hospitalization. Absolutely nothing to do with it at all. /s",
                "Why would you attend a hearing on whether two murderers are ready for release and not expect an audit of their crimes? Obviously the other lawyer wants to show that the crimes were so serious, they shouldn't get an early release. I sympathize with old ladies with cancer, but she made the decision to walk into the courtroom which of course isn't an \"ambush.\"",
                "She's advocating to let the people who did that shit out of prison, so she should be able to see what they did.",
                "This is strange because on a normal basis, family members are warned of graphic nature of photos beforehand and are given the choice to step out during that time.  So I am assuming she chose to stay inside the courtroom",
                "Hochman ran on a \"tough on crime\" platform as the DA candidate and has made the Menendez case his cornerstone.",
                "Shotgun your mom and the photos are going to be gory, sorry grandma",
                "The victims have been dead for quite a while. Crime scene photos are just part of the evidence. The fact is the brothers killed their parents and then went on a spending spree. They tried to say it was because of abuse, and silencing a witness to the murder of their father, which we have proper avenues for that. But they took it into their own hands. So we can go only and really judge by the killing of their parents. ",
                "This article is dripping with bias"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "China Halts Critical Exports as Trade War Intensifies",
            "external_url": "https://www.nytimes.com/2025/04/13/business/china-rare-earths-exports.html?unlocked_article_code=1._U4.oI-5.uzRy92ofA0b5&smid=nytcore-android-share",
            "upvotes": 8377,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The metals, and special magnets made with them, can now be shipped out of China only with special export licenses.\n\n>But China has barely started setting up a system for issuing the licenses. That has caused consternation among industry executives that the process could drag on and that current supplies of minerals and products outside of China could run low.\n\nAnd I'm betting they're in no great hurry.",
                "Has Trump tried tariffing 1000%? Maybe that'll do it.",
                "China probably had always wanted to restrict these exports and now have a very good legitimate reason for doing so. DJT totally played into their hands.",
                "Any entry-level frat boy at a hedgie would be gone by now, and replaced.",
                "They’ll sell it somewhere else.",
                "Thanks, as always, Trump. Always finding new and exciting ways to fuck everyone over.",
                "trump, playing 1-D chess",
                "It's almost funny that Trump THINKS he can try to fuck up other countries expecting them to not retaliate.\nUSA doesn't produce everything it consumes. In fact, if every country stopped selling everything to USA, it would crumble. Maybe that should be a plan...",
                "So when China said earlier to stop the nonsense, they meant in that they’ll make it fucking worse if they don’t.",
                "China is beating the felon to a pulp. He’s no match for them and neither are his advisors."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "DHS Mistakenly tells attorney US Citizen to leave the US",
            "external_url": "https://www.nbcboston.com/news/local/massachusetts-immigration-attorney-dhs-parole-termination/3684504/",
            "upvotes": 24698,
            "date": "04/13/2025",
            "thumbnail": "https://media.nbcboston.com/2025/04/dhs-parole-termination-notice-attorney.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "NPR last week interviewed a US attorney who is a US citizen, and he said the Trump administration is targeting US immigration attorneys. He was coming back from vacation and crossed the border checkpoint.That is when border patrol targeted him and detained him, then tried to confiscate his phone. They told him he was on a list for terrorists. He told them he had over ten years of attorney client privilege communications on his phone.  He told them absolutely not in confiscating his phone.  He said there are other immigration attorneys he personally knows that are also being harrassed by ICE and border patrol.\nhttps://www.npr.org/2025/04/09/nx-s1-5357455/attorney-detained-by-immigration-authorities",
                "This isn’t a mistake it’s a trial balloon",
                ">Mistakenly\n\nYeah, I’m sure it was. No veiled threats here, guys.",
                "*CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients.*\n\nYep, totally explains why the American citizen contact was the only one named in the notice. Sure guys, makes total sense.",
                "An immigration attorney….seems suspicious.",
                "It's ridiculous that they think sending an email is adequate for such communication, even if it were legit. \"Oh, it went to your spam, so you didn't see it? Well, it's off to El Salvador for you.\"",
                "What dehumanizing language\n\n “ CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients”",
                "Quick question - where the fuck would a native born US citizen with no connections to any other nation go?",
                "I have a bridge to sell you if you think it was a mistake",
                "Mistakenly telling people to leave. Mistakenly deporting people. Mistakenly firing people. \nMistakenly doing Nazi salutes"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Cody Balmer was \"harboring hatred\" toward Shapiro before setting fire at Governor's Residence, documents say",
            "external_url": "https://www.cbsnews.com/philadelphia/news/cody-balmer-governors-residence-fire-josh-shapiro-harrisburg/",
            "upvotes": 280,
            "date": "04/14/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/13/a35e635d-1a6b-4478-a65d-dce499693915/thumbnail/1200x630/72eef0eac0b2ba0def67ecf4f2bbb49e/shapiro1.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "What’s with the hammer attack thing? Nancy Pelosi’s husband was also attacked with a hammer",
                "I would imagine most people who set fire to someone's house and plan to assault them with a hammer probably harbor hatred for them.",
                "I mean, fire bombing is rarely an act of love. Despite what my ex told the judge.",
                "Attacking a Jewish governor during Passover, yet the administration has been eerily quiet about “antisemitism” regarding this event. Interesting given they’re actively arguing they must deport people who organize anti-Israel protests because it’s “antisemitic”.",
                "Of course he was but the real question is Why? What did the Governer do to make him so angry he thought his only recourse was assault and burning down his house.",
                "These stories should talk more about which 'influencers' encouraged him to do this.",
                "Woah, I would never have guessed…",
                "It's okay everyone, he just has mental health needs /s",
                "Where's the president condemning this as terrorism?  \n\nOh, right.  It's not a tesla dealership, but a political rival.  I'm sure he condones it.",
                "So here's the question I wish was asked after all of these homegrown terrorism cases:\n\nWho radicized him? And what are we going to do to prevent more from becoming hopelessly radicalized into committing acts of violence?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Menendez brothers' aunt hospitalized after DA shares graphic photos in court: 'We are devastated'",
            "external_url": "https://abcnews.go.com/US/menendez-brothers-aunt-hospitalized-after-da-shares-graphic/story?id=120782064",
            "upvotes": 210,
            "date": "04/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d30f3f98-a280-432f-8c7d-c05a7b00d053/terry-baralt-abc-jef-250414_1744637652867_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "She is 85 years old and battling cancer. I mean it could be that too",
                ">The family said the graphic display violated Marsy's Law -- California's bill of rights for victims -- specifically noting it states that a victim is entitled \"to be treated with fairness and respect\" and be \"free from intimidation, harassment, and abuse.\"\n\nShe's a victim because her sister died. But she's there to support the accused. Did she never see the evidence in the 30 years before hand?",
                "I mean... it's an investigation into whether or not they should be let out of prison after brutally murdering their parents. Whether or not you believe they should be released or not, you have to expect to see or hear some really intense things in that courtroom. \n\nAlso, the woman is battling cancer. I am sure that has nothing to do with her hospitalization. Absolutely nothing to do with it at all. /s",
                "Why would you attend a hearing on whether two murderers are ready for release and not expect an audit of their crimes? Obviously the other lawyer wants to show that the crimes were so serious, they shouldn't get an early release. I sympathize with old ladies with cancer, but she made the decision to walk into the courtroom which of course isn't an \"ambush.\"",
                "She's advocating to let the people who did that shit out of prison, so she should be able to see what they did.",
                "This is strange because on a normal basis, family members are warned of graphic nature of photos beforehand and are given the choice to step out during that time.  So I am assuming she chose to stay inside the courtroom",
                "Hochman ran on a \"tough on crime\" platform as the DA candidate and has made the Menendez case his cornerstone.",
                "Shotgun your mom and the photos are going to be gory, sorry grandma",
                "The victims have been dead for quite a while. Crime scene photos are just part of the evidence. The fact is the brothers killed their parents and then went on a spending spree. They tried to say it was because of abuse, and silencing a witness to the murder of their father, which we have proper avenues for that. But they took it into their own hands. So we can go only and really judge by the killing of their parents. ",
                "This article is dripping with bias"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "NEW",
            "title": "China, Vietnam sign deals as Xi visits Hanoi amid US tariff tensions",
            "external_url": "https://www.reuters.com/world/asia-pacific/chinas-xi-meet-vietnam-leaders-kick-off-southeast-asia-tour-amid-us-tariffs-2025-04-14/",
            "upvotes": 724,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Holy crap trump is uniting the world....",
                "Good job, dumbass. You drove one of the best alternatives to China into China's arms.",
                "That's the art of the deal,, if donny don't want to play nice,, he's out of the game.",
                "Trump said Vietnam was begging please sir please sir. He is just full of shit.",
                "This is actually hilarious",
                "Liberation day was for the world, not the Americans 😂",
                "It’s so funny watching Trump suck so much that he is turning long time geopolitical rivals like Vietnam and China together. Masterful gambit sir.",
                "Title should read “China shores up trade routes with Vietnam to circumnavigate US tariffs.”",
                "Two net exporters signing a deal to export more to each other.  Lol.",
                "Please, stop Mr. Trump, I can’t handle all this winning"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "4 Months Into the Year, Chicago Set to Exhaust $82M Annual Budget for Police Misconduct Settlements",
            "external_url": "https://news.wttw.com/2025/04/14/chicago-set-exhaust-annual-budget-police-misconduct-settlements",
            "upvotes": 3285,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The fact that there is an annual budget for that in the first place.",
                "Absolutely bonkers to me that we haven’t forced police unions to maintain misconduct insurance. Doctors and lawyers have to have malpractice insurance. Why the fuck should taxpayers have to bear the cost of vindicating their rights? And how to we expect to incentivize less misconduct if the actors don’t bear the cost of bad apples?",
                "End qualified immunity, make officers carry their own liability insurance. You know just like nurses, doctors and other \"professionals\". Always remember this is not $ that falls from the sky, these are YOUR tax paid $$'s.",
                "Guess they should tap in to the police pension fund right?",
                "This is why every other country in the world trains their police force for more than 6 months before giving them a badge and a gun and letting them go play cowboys",
                "That’s insane. \n\nAnd it’s all tax payers money, paying for these things. It should come from the cops only. Either their “union” or they need to lay people off by using their own, SET budget for the year. ",
                "The fix for this is to have each police officer required to carry an insurance against it.  Calculate what the median insurance cost is for all the officers on the force, give everyone a raise to include that amount and let nature takes it course. \n\n\nGood officers will have lower premiums and effectively get a raise out of the deal. \n\n\nBad officers will quickly work themselves out of a job as they are literally uninsurable without using half their pay or more.  ",
                "$82M set aside to make a violent gang seem like a legitimate law enforcement agency. Not enough lipstick for that pig. ",
                "Make the cops carry their own misconduct insurance like we do for Medical professionals. If a cop is too expensive to insure because they constant abuse their authority and harm citizens, said cop shouldn’t have a job enforcing the law. ",
                "Start pulling from the pensions and retirements."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Pennsylvania school shooting was planned for Columbine anniversary, police say",
            "external_url": "https://www.denver7.com/us-news/crime/pennsylvania-school-shooting-was-planned-for-columbine-anniversary-police-say",
            "upvotes": 712,
            "date": "04/14/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/e4a8cb0/2147483647/strip/true/crop/5071x2662+0+148/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F0f%2F3c%2Fe6d5816b4dd7ac65121fda2329b3%2Fap24166569232381.jpg",
            "top_comments": [
                ">Police allege Phillips initially planned to carry out the shooting on April 20, which would have been the 26th anniversary of the Columbine shooting, but that he changed the date because April 20 falls on a Sunday this year.\n\nI kind of want to know how far along his plans were before he looked at the calendar. Either way, good thing he was stopped.",
                ">“State College Police would like to recognize that the success of this investigation would not have been possible without the initial report made by a concerned citizen. This illustrates the importance of ‘see something, say something.’”\n\nIt's honestly a relief to hear that someone took action and alerted authorities, because, well, the situation could've been catastrophic. It really emphasizes the power of community vigilance, a concerned citizen's tip saved lives. And, to be honest, I'm glad it turned out this way... it's a reminder that paying attention and speaking up can make a world of difference.",
                "Some fucked up shit going on in Pennsylvania lately.",
                "People are so evil man.",
                "Nearly every mass shooter has subsequently been found to have researched media coverage of previous mass shootings. I'm glad that media outlets have belatedly recognized this form of the contagion effect and adjusted the way that they cover those incidents. We shouldn't be told anything about the motives of the shooter, and preferably have minimal mention of their name.",
                "What's going on Pennsylvania, damn.",
                "I'm also worried about April 19th, which marks the 30th anniversary of the Oklahoma City Bombing. And, of course, there's speculation that Trump may invoke the insurrection act this weekend. I'm so tired, y'all.",
                "ya know, for all the shit that's happening in that country, it's nice to not hear about school shootings once every couple of weeks.\n\nnot sure if actual shootings are down or just not reported.",
                "Yikes. I went to school here in 2001. Glad they caught him"
            ],
            "aggregate_sentiment": 92.0
        },
        {
            "category": "NEW",
            "title": "Fears over extremism in US military as soldier revealed as neo-Nazi TikTok follower",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/14/us-military-extremism-the-base",
            "upvotes": 24999,
            "date": "04/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/06022cc5a489574a13f2c0d9f524b425e88a8fef/0_51_1500_900/master/1500.png?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=af364b4fcd4b4a90b875795a970167cf",
            "top_comments": [
                "\"But in February, the DoD issued a memo halting a major counter-extremism initiative rooting out white nationalists and far-right influences among servicemen, citing that it was not in line with Donald Trump’s executive orders.\" \nBig yikes",
                "For the last time, he’s not a soldier, he’s secretary of defense.",
                "For the party that complains about being called Nazis, republicans sure have a lot of Nazis.",
                "I’m more worried about them in the white house",
                "My experience in the military is it made people more tolerant as it was the first time people mingled with different backgrounds. \n\nThat said, when your job is to protect/kill, you can't be surprised when your governments sanctioned killers got a few screws loose and turn to poisonous warrior-coded ideologies. \n\nNot sure what the answer is, but when your whole being is demonizing and finding faults in certain areas/culture so you can look at terrorism in a shrewd lens, you eventually demonize the population.",
                "As a euro nobody, let me tell you : this kind of idiot exists in every first world armed forces. To varying degrees. The issue is really how organized and dedicated to their cause they are.",
                "[removed]",
                "Ive seen a lot of people express hope that the military will step up when Trump eventually crosses a line with regards to annexation.\n\nStuff like this should reinforce that is unlikely to happen",
                "Meanwhile Joe Kent is awaiting senate confirmation. Look him up. How does one expect right wing extremism to be tamped down when white christian nationalists are in charge of major intelligence and defense institutions",
                "The article forgot to mention that the Neo-Nazi group in the article, The Base is linked to the Kremlin. The founder and leader currently lives in Saint Petersburg and the European based members have fought for Russia in Ukraine. The Kremlin offers financial support and likely offers material support to the group. \n\nSide note the group's name is literally the English version of al-Qaeda."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "FAA says company whose sightseeing chopper crashed, killing 6, is ceasing operations immediately",
            "external_url": "https://apnews.com/article/helicopter-new-york-tour-industry-crash-bcd2e4ed8143d50d550b8d88ce77496e",
            "upvotes": 6022,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The company has had some accidents in the past.  But you have to figure that losing the rotors in flight has to be a blatant maintenance failure.",
                "That was fast. Guess they don’t have big lawyer money?\n\nOr is it easy enough to shutdown this company with a bad reputation, then the owners open a new one in a couple years?",
                "Can they avoid a civil suit by dissolving the company?",
                "Soon to open under a new and untarnished name:(",
                "A video I saw on the  YouTube channel seemed to show the rotor with the transmission still attached. If that is correct then it wasn’t the Jesus nut.\nEdit 1. Broncolirio YouTube channel.",
                "[removed]",
                "It's just awful to see this happen, particularly given that the article points out five helicopters have fallen into the rivers in recent years, and the situation is made worse because attempts to restrict these flights haven't really succeeded, I mean, it's something we need to really address, but apparently it's been a difficult fight... and to be honest, it's just sad that something like this keeps happening.",
                "Without the internet, I might have gotten into a helicopter one day. Now, that is never happening.",
                "They do the same when someone gets killed at the club. They close briefly and re-open as a new club with a new name and continue operating with the same owners under a new company.",
                "Can’t sue us if we don’t exist!"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Bomb goes off outside Hellenic Train offices in Athens",
            "external_url": "https://www.cnn.com/2025/04/12/europe/bomb-greece-hellenic-train-athens-intl/index.html",
            "upvotes": 1102,
            "date": "04/13/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2209120782.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "There are so many unique Greek terrorist groups that it could be literally anyone.",
                "If it's the one that comes up on Google maps, this wasn't far from the Acropolis Museum and that area in general. Do they know if they bomb was intended to go off when more people would be around?",
                "Terrifying. Sending good energy to everyone there"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Wisconsin teen allegedly killed parents in extremist plot to assassinate Trump, FBI says",
            "external_url": "https://abcnews.go.com/US/wisconsin-teen-allegedly-killed-parents-extremist-plot-assassinate/story?id=120750496",
            "upvotes": 14752,
            "date": "04/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/434debed-e7fb-439e-8ca2-a049d72f56af/waukesha-shooter-02-ht-jt-250412_1744482092946_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "hearing the story on the news yesterday was wild because each sentence just got weirder than the last 😭\n\n1. killed his parents\n\n2. plots against trump\n\n3. wrote a manifesto discussing plans to take over america\n\n4. loved hitler and wants a new order of neo nazism",
                "They conveniently leave the other half of the headline out. That he wanted to kill Trump to start a race war.",
                ">The sheriff's department issued a search warrant and say they found material on the teen's phone related to \"The Order of Nine Angles,\" which is \"a network of individuals holding new-Nazi racially motivated extremist views,\" according to investigators.\n\nWhy can't we say \"gang\"? If 'a network of individuals' isn't gang or a mob then what is it? Call them an anti-american Nazi gang.",
                "It’s crazy how many of these mass shooters fall into white nationalism rabbit holes. \n\nI watched Frontline’s documentary on Terrorgram, and it’s really scary how effective it is playing out in real time.",
                "These headlines keep leaving of the white supremacist part.",
                "Might we also remember that a relatively young man beheaded his father in 2024 as a message to the Biden administration? Something is so deeply broken in our nation.",
                "\"Wisconsin NEO-NAZI & WHITE SUPREMACIST killed parents, aspired to assassination and instigate a race war.\"\n\n- Fixed the title for you",
                "> And he paid for, at least in part, a drone and explosives to be used as a weapon of mass destruction to commit an attack.\n\nI feel like it's just a matter of time until we start seeing drones being used in terror attacks or assassination plots. We've all seen how effectively they are being used now in combat.",
                "Interesting that all those who have plotted to kill him so far have been fellow right-wingers.",
                "A nazi who thinks fat donny isn't enough of nazi\n\nThe absolute state of the right, holy fucking shit"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Suspect in custody after overnight fire at Pennsylvania Gov. Josh Shapiro's residence",
            "external_url": "https://www.nbcnews.com/news/us-news/gov-josh-shapiro-residence-arson-investigation-rcna201044",
            "upvotes": 2908,
            "date": "04/13/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250213-josh-shapiro-lm-1045-122cc2.jpg",
            "top_comments": [
                "Fits the bill of a domestic terrorist.",
                "What does he think the governor has to do with foreclosures?",
                "So this person will be charged federally with domestic terrorism, right? Or is that only if you vandalize a Tesla?",
                "Supposedly angry about his property being seized and auctioned off.  \n\nhttps://www.timesnownews.com/world/us/us-news/was-cody-balmer-upset-with-gov-josh-shapiro-over-property-seizure-court-document-surfaces-article-151411593",
                "I’m sort of relieved that this guy is just your normal run of the mill asshole. I was expecting the worst.",
                "It’s called arson, or attempted murder. Overnight fire just downplays what took place",
                "everyone is so quick to attach their pet cause to the reason (the arsonist must be anti-israel, maga, trans, etc.) and it ends up being some dude who has a personal beef. Go figure.",
                "Literally charged with terrorism but the media is too chicken shit to use the word for a white right winger.",
                "Domestic terrorism. Its funny how Trump supporters do dumb shit that conflicts with what Trump says. One of his own patriots is a pedophile. Another tried to kill a cop. Patriots indeed, colonel sanders.",
                "Add hate crime.  \n\nDone on Passover in the same room as the Seder. \n\nBe sure to hit him with multiple STATE crimes too so Trump can’t pardon him."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "4 Months Into the Year, Chicago Set to Exhaust $82M Annual Budget for Police Misconduct Settlements",
            "external_url": "https://news.wttw.com/2025/04/14/chicago-set-exhaust-annual-budget-police-misconduct-settlements",
            "upvotes": 3284,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The fact that there is an annual budget for that in the first place.",
                "Absolutely bonkers to me that we haven’t forced police unions to maintain misconduct insurance. Doctors and lawyers have to have malpractice insurance. Why the fuck should taxpayers have to bear the cost of vindicating their rights? And how to we expect to incentivize less misconduct if the actors don’t bear the cost of bad apples?",
                "End qualified immunity, make officers carry their own liability insurance. You know just like nurses, doctors and other \"professionals\". Always remember this is not $ that falls from the sky, these are YOUR tax paid $$'s.",
                "Guess they should tap in to the police pension fund right?",
                "This is why every other country in the world trains their police force for more than 6 months before giving them a badge and a gun and letting them go play cowboys",
                "That’s insane. \n\nAnd it’s all tax payers money, paying for these things. It should come from the cops only. Either their “union” or they need to lay people off by using their own, SET budget for the year. ",
                "The fix for this is to have each police officer required to carry an insurance against it.  Calculate what the median insurance cost is for all the officers on the force, give everyone a raise to include that amount and let nature takes it course. \n\n\nGood officers will have lower premiums and effectively get a raise out of the deal. \n\n\nBad officers will quickly work themselves out of a job as they are literally uninsurable without using half their pay or more.  ",
                "$82M set aside to make a violent gang seem like a legitimate law enforcement agency. Not enough lipstick for that pig. ",
                "Make the cops carry their own misconduct insurance like we do for Medical professionals. If a cop is too expensive to insure because they constant abuse their authority and harm citizens, said cop shouldn’t have a job enforcing the law. ",
                "Start pulling from the pensions and retirements."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "China, Vietnam sign deals as Xi visits Hanoi amid US tariff tensions",
            "external_url": "https://www.reuters.com/world/asia-pacific/chinas-xi-meet-vietnam-leaders-kick-off-southeast-asia-tour-amid-us-tariffs-2025-04-14/",
            "upvotes": 724,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Holy crap trump is uniting the world....",
                "Good job, dumbass. You drove one of the best alternatives to China into China's arms.",
                "That's the art of the deal,, if donny don't want to play nice,, he's out of the game.",
                "Trump said Vietnam was begging please sir please sir. He is just full of shit.",
                "This is actually hilarious",
                "Liberation day was for the world, not the Americans 😂",
                "It’s so funny watching Trump suck so much that he is turning long time geopolitical rivals like Vietnam and China together. Masterful gambit sir.",
                "Title should read “China shores up trade routes with Vietnam to circumnavigate US tariffs.”",
                "Two net exporters signing a deal to export more to each other.  Lol.",
                "Please, stop Mr. Trump, I can’t handle all this winning"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "RISING",
            "title": "Cody Balmer was \"harboring hatred\" toward Shapiro before setting fire at Governor's Residence, documents say",
            "external_url": "https://www.cbsnews.com/philadelphia/news/cody-balmer-governors-residence-fire-josh-shapiro-harrisburg/",
            "upvotes": 275,
            "date": "04/14/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/04/13/a35e635d-1a6b-4478-a65d-dce499693915/thumbnail/1200x630/72eef0eac0b2ba0def67ecf4f2bbb49e/shapiro1.jpg?v=653dd6912cdd8596c9bfea812c355f95",
            "top_comments": [
                "What’s with the hammer attack thing? Nancy Pelosi’s husband was also attacked with a hammer",
                "I would imagine most people who set fire to someone's house and plan to assault them with a hammer probably harbor hatred for them.",
                "I mean, fire bombing is rarely an act of love. Despite what my ex told the judge.",
                "Attacking a Jewish governor during Passover, yet the administration has been eerily quiet about “antisemitism” regarding this event. Interesting given they’re actively arguing they must deport people who organize anti-Israel protests because it’s “antisemitic”.",
                "Of course he was but the real question is Why? What did the Governer do to make him so angry he thought his only recourse was assault and burning down his house.",
                "These stories should talk more about which 'influencers' encouraged him to do this.",
                "Woah, I would never have guessed…",
                "It's okay everyone, he just has mental health needs /s",
                "Where's the president condemning this as terrorism?  \n\nOh, right.  It's not a tesla dealership, but a political rival.  I'm sure he condones it.",
                "So here's the question I wish was asked after all of these homegrown terrorism cases:\n\nWho radicized him? And what are we going to do to prevent more from becoming hopelessly radicalized into committing acts of violence?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Pennsylvania school shooting was planned for Columbine anniversary, police say",
            "external_url": "https://www.denver7.com/us-news/crime/pennsylvania-school-shooting-was-planned-for-columbine-anniversary-police-say",
            "upvotes": 712,
            "date": "04/14/2025",
            "thumbnail": "https://ewscripps.brightspotcdn.com/dims4/default/e4a8cb0/2147483647/strip/true/crop/5071x2662+0+148/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F0f%2F3c%2Fe6d5816b4dd7ac65121fda2329b3%2Fap24166569232381.jpg",
            "top_comments": [
                ">Police allege Phillips initially planned to carry out the shooting on April 20, which would have been the 26th anniversary of the Columbine shooting, but that he changed the date because April 20 falls on a Sunday this year.\n\nI kind of want to know how far along his plans were before he looked at the calendar. Either way, good thing he was stopped.",
                ">“State College Police would like to recognize that the success of this investigation would not have been possible without the initial report made by a concerned citizen. This illustrates the importance of ‘see something, say something.’”\n\nIt's honestly a relief to hear that someone took action and alerted authorities, because, well, the situation could've been catastrophic. It really emphasizes the power of community vigilance, a concerned citizen's tip saved lives. And, to be honest, I'm glad it turned out this way... it's a reminder that paying attention and speaking up can make a world of difference.",
                "Some fucked up shit going on in Pennsylvania lately.",
                "People are so evil man.",
                "Nearly every mass shooter has subsequently been found to have researched media coverage of previous mass shootings. I'm glad that media outlets have belatedly recognized this form of the contagion effect and adjusted the way that they cover those incidents. We shouldn't be told anything about the motives of the shooter, and preferably have minimal mention of their name.",
                "What's going on Pennsylvania, damn.",
                "I'm also worried about April 19th, which marks the 30th anniversary of the Oklahoma City Bombing. And, of course, there's speculation that Trump may invoke the insurrection act this weekend. I'm so tired, y'all.",
                "ya know, for all the shit that's happening in that country, it's nice to not hear about school shootings once every couple of weeks.\n\nnot sure if actual shootings are down or just not reported.",
                "Yikes. I went to school here in 2001. Glad they caught him"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Menendez brothers' aunt hospitalized after DA shares graphic photos in court: 'We are devastated'",
            "external_url": "https://abcnews.go.com/US/menendez-brothers-aunt-hospitalized-after-da-shares-graphic/story?id=120782064",
            "upvotes": 210,
            "date": "04/14/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d30f3f98-a280-432f-8c7d-c05a7b00d053/terry-baralt-abc-jef-250414_1744637652867_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "She is 85 years old and battling cancer. I mean it could be that too",
                ">The family said the graphic display violated Marsy's Law -- California's bill of rights for victims -- specifically noting it states that a victim is entitled \"to be treated with fairness and respect\" and be \"free from intimidation, harassment, and abuse.\"\n\nShe's a victim because her sister died. But she's there to support the accused. Did she never see the evidence in the 30 years before hand?",
                "I mean... it's an investigation into whether or not they should be let out of prison after brutally murdering their parents. Whether or not you believe they should be released or not, you have to expect to see or hear some really intense things in that courtroom. \n\nAlso, the woman is battling cancer. I am sure that has nothing to do with her hospitalization. Absolutely nothing to do with it at all. /s",
                "Why would you attend a hearing on whether two murderers are ready for release and not expect an audit of their crimes? Obviously the other lawyer wants to show that the crimes were so serious, they shouldn't get an early release. I sympathize with old ladies with cancer, but she made the decision to walk into the courtroom which of course isn't an \"ambush.\"",
                "She's advocating to let the people who did that shit out of prison, so she should be able to see what they did.",
                "This is strange because on a normal basis, family members are warned of graphic nature of photos beforehand and are given the choice to step out during that time.  So I am assuming she chose to stay inside the courtroom",
                "Hochman ran on a \"tough on crime\" platform as the DA candidate and has made the Menendez case his cornerstone.",
                "Shotgun your mom and the photos are going to be gory, sorry grandma",
                "The victims have been dead for quite a while. Crime scene photos are just part of the evidence. The fact is the brothers killed their parents and then went on a spending spree. They tried to say it was because of abuse, and silencing a witness to the murder of their father, which we have proper avenues for that. But they took it into their own hands. So we can go only and really judge by the killing of their parents. ",
                "This article is dripping with bias"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Fears over extremism in US military as soldier revealed as neo-Nazi TikTok follower",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/14/us-military-extremism-the-base",
            "upvotes": 24996,
            "date": "04/14/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/06022cc5a489574a13f2c0d9f524b425e88a8fef/0_51_1500_900/master/1500.png?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=af364b4fcd4b4a90b875795a970167cf",
            "top_comments": [
                "\"But in February, the DoD issued a memo halting a major counter-extremism initiative rooting out white nationalists and far-right influences among servicemen, citing that it was not in line with Donald Trump’s executive orders.\" \nBig yikes",
                "For the last time, he’s not a soldier, he’s secretary of defense.",
                "For the party that complains about being called Nazis, republicans sure have a lot of Nazis.",
                "I’m more worried about them in the white house",
                "My experience in the military is it made people more tolerant as it was the first time people mingled with different backgrounds. \n\nThat said, when your job is to protect/kill, you can't be surprised when your governments sanctioned killers got a few screws loose and turn to poisonous warrior-coded ideologies. \n\nNot sure what the answer is, but when your whole being is demonizing and finding faults in certain areas/culture so you can look at terrorism in a shrewd lens, you eventually demonize the population.",
                "As a euro nobody, let me tell you : this kind of idiot exists in every first world armed forces. To varying degrees. The issue is really how organized and dedicated to their cause they are.",
                "[removed]",
                "Ive seen a lot of people express hope that the military will step up when Trump eventually crosses a line with regards to annexation.\n\nStuff like this should reinforce that is unlikely to happen",
                "Meanwhile Joe Kent is awaiting senate confirmation. Look him up. How does one expect right wing extremism to be tamped down when white christian nationalists are in charge of major intelligence and defense institutions",
                "The article forgot to mention that the Neo-Nazi group in the article, The Base is linked to the Kremlin. The founder and leader currently lives in Saint Petersburg and the European based members have fought for Russia in Ukraine. The Kremlin offers financial support and likely offers material support to the group. \n\nSide note the group's name is literally the English version of al-Qaeda."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "FAA says company whose sightseeing chopper crashed, killing 6, is ceasing operations immediately",
            "external_url": "https://apnews.com/article/helicopter-new-york-tour-industry-crash-bcd2e4ed8143d50d550b8d88ce77496e",
            "upvotes": 6011,
            "date": "04/14/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The company has had some accidents in the past.  But you have to figure that losing the rotors in flight has to be a blatant maintenance failure.",
                "That was fast. Guess they don’t have big lawyer money?\n\nOr is it easy enough to shutdown this company with a bad reputation, then the owners open a new one in a couple years?",
                "Can they avoid a civil suit by dissolving the company?",
                "Soon to open under a new and untarnished name:(",
                "A video I saw on the  YouTube channel seemed to show the rotor with the transmission still attached. If that is correct then it wasn’t the Jesus nut.\nEdit 1. Broncolirio YouTube channel.",
                "[removed]",
                "It's just awful to see this happen, particularly given that the article points out five helicopters have fallen into the rivers in recent years, and the situation is made worse because attempts to restrict these flights haven't really succeeded, I mean, it's something we need to really address, but apparently it's been a difficult fight... and to be honest, it's just sad that something like this keeps happening.",
                "Without the internet, I might have gotten into a helicopter one day. Now, that is never happening.",
                "They do the same when someone gets killed at the club. They close briefly and re-open as a new club with a new name and continue operating with the same owners under a new company.",
                "Can’t sue us if we don’t exist!"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Wisconsin teen allegedly killed parents in extremist plot to assassinate Trump, FBI says",
            "external_url": "https://abcnews.go.com/US/wisconsin-teen-allegedly-killed-parents-extremist-plot-assassinate/story?id=120750496",
            "upvotes": 14744,
            "date": "04/13/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/434debed-e7fb-439e-8ca2-a049d72f56af/waukesha-shooter-02-ht-jt-250412_1744482092946_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "hearing the story on the news yesterday was wild because each sentence just got weirder than the last 😭\n\n1. killed his parents\n\n2. plots against trump\n\n3. wrote a manifesto discussing plans to take over america\n\n4. loved hitler and wants a new order of neo nazism",
                "They conveniently leave the other half of the headline out. That he wanted to kill Trump to start a race war.",
                ">The sheriff's department issued a search warrant and say they found material on the teen's phone related to \"The Order of Nine Angles,\" which is \"a network of individuals holding new-Nazi racially motivated extremist views,\" according to investigators.\n\nWhy can't we say \"gang\"? If 'a network of individuals' isn't gang or a mob then what is it? Call them an anti-american Nazi gang.",
                "It’s crazy how many of these mass shooters fall into white nationalism rabbit holes. \n\nI watched Frontline’s documentary on Terrorgram, and it’s really scary how effective it is playing out in real time.",
                "These headlines keep leaving of the white supremacist part.",
                "Might we also remember that a relatively young man beheaded his father in 2024 as a message to the Biden administration? Something is so deeply broken in our nation.",
                "\"Wisconsin NEO-NAZI & WHITE SUPREMACIST killed parents, aspired to assassination and instigate a race war.\"\n\n- Fixed the title for you",
                "> And he paid for, at least in part, a drone and explosives to be used as a weapon of mass destruction to commit an attack.\n\nI feel like it's just a matter of time until we start seeing drones being used in terror attacks or assassination plots. We've all seen how effectively they are being used now in combat.",
                "Interesting that all those who have plotted to kill him so far have been fellow right-wingers.",
                "A nazi who thinks fat donny isn't enough of nazi\n\nThe absolute state of the right, holy fucking shit"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "China Halts Critical Exports as Trade War Intensifies",
            "external_url": "https://www.nytimes.com/2025/04/13/business/china-rare-earths-exports.html?unlocked_article_code=1._U4.oI-5.uzRy92ofA0b5&smid=nytcore-android-share",
            "upvotes": 8375,
            "date": "04/13/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The metals, and special magnets made with them, can now be shipped out of China only with special export licenses.\n\n>But China has barely started setting up a system for issuing the licenses. That has caused consternation among industry executives that the process could drag on and that current supplies of minerals and products outside of China could run low.\n\nAnd I'm betting they're in no great hurry.",
                "Has Trump tried tariffing 1000%? Maybe that'll do it.",
                "China probably had always wanted to restrict these exports and now have a very good legitimate reason for doing so. DJT totally played into their hands.",
                "Any entry-level frat boy at a hedgie would be gone by now, and replaced.",
                "They’ll sell it somewhere else.",
                "Thanks, as always, Trump. Always finding new and exciting ways to fuck everyone over.",
                "trump, playing 1-D chess",
                "It's almost funny that Trump THINKS he can try to fuck up other countries expecting them to not retaliate.\nUSA doesn't produce everything it consumes. In fact, if every country stopped selling everything to USA, it would crumble. Maybe that should be a plan...",
                "So when China said earlier to stop the nonsense, they meant in that they’ll make it fucking worse if they don’t.",
                "China is beating the felon to a pulp. He’s no match for them and neither are his advisors."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "DHS Mistakenly tells attorney US Citizen to leave the US",
            "external_url": "https://www.nbcboston.com/news/local/massachusetts-immigration-attorney-dhs-parole-termination/3684504/",
            "upvotes": 24701,
            "date": "04/13/2025",
            "thumbnail": "https://media.nbcboston.com/2025/04/dhs-parole-termination-notice-attorney.png?resize=1200%2C675&quality=85&strip=all",
            "top_comments": [
                "NPR last week interviewed a US attorney who is a US citizen, and he said the Trump administration is targeting US immigration attorneys. He was coming back from vacation and crossed the border checkpoint.That is when border patrol targeted him and detained him, then tried to confiscate his phone. They told him he was on a list for terrorists. He told them he had over ten years of attorney client privilege communications on his phone.  He told them absolutely not in confiscating his phone.  He said there are other immigration attorneys he personally knows that are also being harrassed by ICE and border patrol.\nhttps://www.npr.org/2025/04/09/nx-s1-5357455/attorney-detained-by-immigration-authorities",
                "This isn’t a mistake it’s a trial balloon",
                ">Mistakenly\n\nYeah, I’m sure it was. No veiled threats here, guys.",
                "*CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients.*\n\nYep, totally explains why the American citizen contact was the only one named in the notice. Sure guys, makes total sense.",
                "An immigration attorney….seems suspicious.",
                "It's ridiculous that they think sending an email is adequate for such communication, even if it were legit. \"Oh, it went to your spam, so you didn't see it? Well, it's off to El Salvador for you.\"",
                "What dehumanizing language\n\n “ CBP used the known email addresses of the alien to send notifications. If a non-personal email-such as an American citizen contact-was provided by the alien, notices may have been sent to unintended recipients”",
                "Quick question - where the fuck would a native born US citizen with no connections to any other nation go?",
                "I have a bridge to sell you if you think it was a mistake",
                "Mistakenly telling people to leave. Mistakenly deporting people. Mistakenly firing people. \nMistakenly doing Nazi salutes"
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/14/2025 16:10:45 UTC"
}