{
    "posts": [
        {
            "category": "HOT",
            "title": "A man spent 45 days in jail, accused of trying to abduct a child at Walmart. A judge granted a bond after lawyer shows video | CNN",
            "external_url": "https://www.cnn.com/2025/05/06/us/mahendra-patel-walmart-georgia-update",
            "upvotes": 5592,
            "date": "05/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25126618023242.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Why did it take 45 days for the judge to see the video ?",
                "> “I’m not worried about that. I don’t believe he poses a risk to the community,” said Poole. “The evidence from the video, and I won’t comment on what I think the video really shows, as far as guilt or innocence. It’s not my job today. But the facts do show me that he hung around, and I don’t find that he’s a flight risk based upon what I saw in the video,” Poole said.\n\nSo they claim he tried to snatch a child, but then he just stuck around the store continuing his shopping? The footage seems pretty in line with his statement.",
                "So some prosecutor has definitely seen this video of him clearly not doing what he is accused of and continued to hold charges for over a month, and is continuing with the case?",
                "For those interested in the full video from the court hearing:\nhttps://www.youtube.com/live/brDmaeE5DKo?si=p_GRA25_DRWH402n&t=1009",
                "Now the woman crying wolf needs to go to JAIL for lying to police and filing a false police report....and needs to be sued",
                "Judges tend to be pretty resistant to examining evidence at bond hearings. I have got them to do it, but it's definitely a matter of pointing at the rule and barging ahead. \n\nThe presumption that the State's version of events is true is extremely strong for most judges. The presumption of innocence is something you get from a jury.",
                "I don’t understand the woman, like what did she just realize that she had the opportunity to frame a man or has she been looking for this situation? Like it’s such an insane thing to do.",
                "I once read an article explaining the 'do not get involved' culture of China because it was SO common for people to sue people whom tried to help them. People eventually felt the risk was too great and will walk by someone in an emergency. It's stuff like this that worries me we could be headed that way.",
                "Bond? Shit should be thrown out and the girl should be arrested \n\nShe has another lawsuit ongoing where she sued Lyft for being raped",
                "Should have a nice fat settlement from multiple agencies after this clusterfuck."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Supreme Court upholds Trump's ban on transgender military members while appeals continue.",
            "external_url": "https://www.npr.org/2025/05/06/nx-s1-5388507/supreme-court-transgender-military",
            "upvotes": 13359,
            "date": "05/06/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5566x3131+0+290/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F09%2F5f%2F69ad07ce43bfb90d1e44c599d837%2Fgettyimages-2157829281-10.jpg",
            "top_comments": [
                "Says the draft dodger",
                "This ruling is far more insidious than it seems too. They didn't ban us on the basis of being \"mentally ill\" or something. They argued that we are inherently incapable of exhibiting honor, discipline, honesty, selflessness, and humility that is expected of service members.\n\nArguing that we shouldn't serve because we're mentally ill would still horrendous and incorrect, but they're arguing that we are *morally inferior and unfit* to serve. \n\nIt is *insane* that the SCOTUS rubber stamped this.",
                "Trump reinstated service members who refused to take the COVID-19 vaccine. (The same vaccine Donald Trump, himself, took) Nearly 100 service members died. A half a million were infected. But, lets kick out transgendered troops.",
                "[deleted]",
                "So they’re too weak to be in our military but too strong for sports?",
                "Funny how SCOTUS typically leans on the side of allowing harm when it benefits the prejudices of their base.",
                "Transgender people are the canary in the coal mine. However you may feel, if they are not free to be themselves, then none of us are... Fun fact: All those books the Nazis began with burning was transgender medical research. Up until that time, Berlin was the world leader in healthcare. We know what they ended with burning...",
                "According to their logic it is arrogant and selfish to be trans, thus disqualifying, so I guess 100% of the Trump admin are also unfit to serve in the military.",
                "So, the next time that the US will need conscripts, bone spurs will be out and “I identify as….” will be in and they’ll wonder why they can’t feed the war machine.",
                "You can’t have trans people in the military when the military starts rounding up trans people. It’s a conflict of interest you see…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Another fighter jet is lost at sea after it falls off USS Harry S. Truman aircraft carrier",
            "external_url": "https://www.nbcnews.com/news/rcna205266",
            "upvotes": 1698,
            "date": "05/07/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250506-uss-hARRY-s-tRUMAN-F-A-18F-Super-Hornet-laning-2024-ac-939p-e5a633.jpg",
            "top_comments": [
                "Wouldn’t quite equate an arresting gear failure as “falling off”",
                "There's going to be more to this story.  Missing the wires is not rare and not a big deal.  Pilots always go to full power at touchdown whether they catch a wire or not.  Then if they miss they simply climb out and go around.  It's called a bolter.  Since that didn't happen here, something else was going on.",
                "They’ve lost more money dropping planes into the Red Sea than they’ve saved with all the DOGE bullshit.",
                "By dumping planes into the ocean it saves the government money because they no longer have to maintain the plane. Government efficiency!",
                "Two Class-A mishaps in eight days and that captain is gonna lose his job.",
                "Snippet from this news article:\n“For the second time in eight days, a fighter jet was lost after falling over the side of the USS Harry S. Truman aircraft carrier and into the Red Sea on Tuesday, two U.S. officials told NBC News.\nThere were only minor injuries after the two-seater, F-18 Super Hornet fell off the aircraft carrier as it was landing around 9:45 p.m. local time Tuesday (early afternoon East Coast time), the officials said.\n\nThe two aviators aboard ejected after the failed landing, in which the aircraft failed to catch the wire, known as a \"failed arrestment,\" one of the officials said.",
                ">“The buck stops here.  Fighter jets?  Not so much.”\n\n- The USS Harry Truman.",
                "I wonder how many they lose in an average year.   \n\n I'm guessing this carrier is involved with Yemen and the Houthis.",
                "This is not a \"fall\". This was effectively a crash.",
                "Who is getting the planes we drop in the water?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "More than 25 protesters arrested after taking over University of Washington building",
            "external_url": "https://abcnews.go.com/US/protesters-university-washington-building/story?id=121505881",
            "upvotes": 11138,
            "date": "05/06/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/8b79e615-2538-4cc9-b752-cde7df424dcd/uw-police_1746525294015_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Demanding that UW cut ties with Boeing is insane, the joke among engineering students was that there were secret WW2 tunnels from the engineering department directly to Boeing because of how many graduates went there.  You might as well ask the Colorado School of Mines to divest from the mining industry.",
                ">In order to accomplish these demands, we are willing to engage in meetings with the university. We will engage in meetings on our terms. Representatives of SUPER at these meetings must be ensured anonymity. Personal contact information of any of the negotiators will not be shared with administration and no one else is qualified to speak on behalf of our action except those who we send.\n\nYeah, that's gonna be a 'No' from me dawg.",
                "You're not going to get any support by calling what happened on Oct. 7th a \"heroic victory\".",
                "From UW this morning:\nDear UW community,\n\nLate yesterday afternoon, a group identifying themselves as the suspended student organization SUPER UW posted on social media that they were occupying the Interdisciplinary Engineering Building on the Seattle campus and asked for other groups to join them. These groups temporarily occupied and vandalized the building before being arrested by law enforcement officers from UWPD, the Seattle Police Department and the Washington State Patrol. They also set fire to dumpsters in a nearby street after blocking exits in the IEB and blocking nearby streets to delay firefighters’ access.\n\nThis was no peaceful protest in support of Palestinian rights or against the war in Gaza. I condemn this dangerous, violent and illegal building occupation and related vandalism. I also condemn in the strongest terms the group’s statement celebrating the Oct. 7, 2023, Hamas terrorist attacks against Israeli civilians. The University will not be intimidated by this sort of horrific and destructive behavior and will not engage in dialogue with any group using or condoning such destructive tactics. We will continue our actions to oppose antisemitism, racism and all forms of biases so that ALL our students, faculty, staff and visitors can feel safe and welcome on our campuses.\n\nKing County jail staff are working to identify the roughly 30 people who were arrested, so at the moment we do not know how many are UW students or community members. We are working with law enforcement and through our own disciplinary processes to ensure those responsible face appropriate consequences for their actions. And we will continue to stand strong against violent and illegal activities that create a hostile environment for any and all members of our community. I want to thank the members of UWPD and our law enforcement partners for their assistance in bringing this situation to a swift resolution.",
                "I won't shed a tear for a group that has glorified the Oct 7th attack. They do a disservice to the pro=Palestine movement.\n\n  \n[source](https://medium.com/@super.uw.seattle/we-demand-uw-will-no-longer-be-complicit-in-genocide-0099dc761f92)",
                "Fuck these people. Glorifying October 7th into a good thing. Hope they get the entire book thrown at them. They’ve turned Palestine support into straight up terrorist support. Fucking disgusting. ",
                "I know we were all still dumbasses in college, but I just refuse to believe we were this dumb.",
                "They also set a fire 🔥 so I'm a little less empathetic.",
                "Boeing is so intertwined into Washington States economy and especially the Seattle region. They are literally the heart and soul of that place. Thousands at UW and all over the country are working hard to hopefully work there one day. This is crazy.",
                "[removed]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "India says it attacked Pakistan, Pakistani Kashmir",
            "external_url": "https://www.reuters.com/world/asia-pacific/multiple-loud-explosions-heard-pakistani-kashmir-reuters-witness-2025-05-06/",
            "upvotes": 2962,
            "date": "05/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I picked the wrong week to quit sniffing glue",
                "So we have an escalating conflict between two nuclear powers. \n\nThe talibans will probably take the opportunity to attack from the north. Making Pakistan even more nervous. \n\nCombine that with the already high tensions between China and India.",
                "Since this occurred on Wednesday, if we just stay in Tuesday forever we won’t hit WW3 right? Right?",
                "Nothing happens until it does",
                "Someone get a mineral deal sorted out asap",
                "Wait, Trump supporters said Trump would end all the wars and conflicts when he would become president.",
                "Pax Americana is over",
                "Glad we have measured, wise leadership in the US during these troubled times.",
                "Republicans claimed it was Biden's fault Russia invaded Ukraine. They suggested it was proof of Biden's weakness. Does that mean this attack is Trump's fault and evidence of his weakness?",
                "“MODI STOP IT!!! PLEASE!”\n\nWorked on Putin right?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Falsified records, fake donations: Credit Suisse fined for helping rich Americans hide over $4 billion from the taxman",
            "external_url": "https://edition.cnn.com/2025/05/06/business/credit-suisse-fine-americans-tax-evasion-intl",
            "upvotes": 6640,
            "date": "05/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2184011222.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "If the profits exceed the fine amount than its just the cost of doing business and nothing will be changed.",
                "They'd rather pay a crooked banker to doctor the records than let anyone needy benefit from their hoarded wealth.\n\nEveryone who participated in this should be in jail.",
                "Rich Americans will just do anything to avoid paying their fair share. Sure they like to sing about how \"great\" America is while funding non-stop disinformation campaigns (see: Fox News, OANN, etc) trying to the convince American people that the problem is anything, everything but *them*. Billionaires who use this country to make their fortune but then hide their money in offshore accounts are the least patriotic citizens among us - and now we have an administration made up entirely of these leeches.",
                "Who went to jail for these crimes?",
                "I doubt the fine will approach the $4 billion. Why would they stop doing this if they still profit?",
                ">UBS, which acquired Credit Suisse in 2023, said Monday that Credit Suisse Services pleaded guilty to one count of conspiracy to aid and assist in the preparation of false income tax returns.\n\nOkay so now go after those who filed false income tax returns.",
                "Should send the rich Americans to prison. Oh wait that's for the poor.",
                "Slap on the wrist. Go back to laundering money for the elite and wait for your next slap on the wrist.",
                "And the “Americans” hiding the money? Pardoned by our anti-American “president” no doubt",
                "There is no Credit Suisse anymore."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "FBI has opened 250 investigations tied to violent online network '764' that preys on teens, top official says",
            "external_url": "https://abcnews.go.com/US/fbi-opened-250-investigations-tied-violent-online-network/story?id=121480884",
            "upvotes": 5450,
            "date": "05/06/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/03cf45c4-04fd-47e9-aa47-8575d204265d/Barbie-Doll-ht-er-250505_1746474142203_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "> Reflecting what her family described as a typical 764-related encounter, the girl met him on the popular online gaming platform Roblox, and then they began communicating more regularly online, including on Discord, which caters to gamers.\nThe man convinced her he was her boyfriend, and she sent him sexual photos of herself -- the types of images that 764 adherents threaten to share widely if victims don't comply with their escalating demands.\nAccording to police, she had produced an assortment of 764-related content, including a photo of a nude Barbie doll marked with \"764\" on its forehead; photos depicting her cutting herself; and a note, written in her blood, calling her supposed boyfriend \"a god.\"\nAccording to her family, the Connecticut girl was trained to hack into Roblox accounts and lock them -- which allowed her to make demands of account owners if they wanted their accounts back. And she allegedly helped direct a series of threats that rattled Vernon-area schools for three months in late 2023 and early last year.\n\nThis is so disturbing. If these kids say no, they get threatened or their family gets swatted. Unmonitored internet usage is far more dangerous than so many parents realize. People will find creative and horrible ways to contact kids online.",
                "Yeah, this is the type of online grooming I’m highly concerned about, and I’d much rather time and effort be funneled here.",
                "I've never understood why they don't investigate more about the people calling in the SWAT raids. I'm really unfamiliar with how the process works, but there seem to be way too many stories of raids on regular people's homes without much seeming to be done about the false SWATters.",
                "surprise! One of the kids on DOGE is affiliated with Com/764. https://krebsonsecurity.com/2025/02/teen-on-musks-doge-team-graduated-from-the-com/",
                "It must be a weird environment at the FBI right now. Some branches are going after criminals like normal, some are letting crypto scammers off because Trump's one of them, and others are arresting judges and political opponents. Will your whole investigation be a complete waste of time because the criminal/organization buys a pardon off of Trump? Is the guy at the next desk over part of the secret police? Who knows!",
                "“In another federal case, 19-year-old Jack Rocker of Tampa amassed a collection of more than 8,300 videos and images that the Justice Department called \"some of the most horrific, evil content available on the Internet.\" He pleaded guilty in January to possessing child sexual abuse material and was sentenced to seven years in prison.” \n7 years does not seem to be long enough for this type of crime. 8300 videos and images?? And only 7 years?? Make it make sense!!!",
                "JFC, this is nuts. One more reason to keep my kid off social media and away from shit like Roblox.",
                "If they prey on teens and the FBI considers them domestic terrorists, then a presidential pardon shouldn't be far behind.",
                "It's a good thing the administration is planning to cut the FBI budget.  As they always say, \"Won't you please stop thinking about the children!?\".",
                "> Followers of the 764 network share all sorts of violent content with their victims, while some also glorify past mass-casualty attacks such as the 1999 Columbine High School shooting, or introduce victims to other extreme ideologies like neo-Nazism or Satanism, according to authorities.\n\nOh good, we're doing Satanic Panic again and lumping them in with nazis and mass murderers."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump directs Department of Justice to try to free Tina Peters from prison in social media post",
            "external_url": "https://www.cpr.org/2025/05/05/trump-directs-department-of-justice-to-try-to-free-tina-peters-from-prison-in-social-media-post/",
            "upvotes": 4706,
            "date": "05/06/2025",
            "thumbnail": "https://wp-cpr.s3.amazonaws.com/uploads/2022/04/220409-GOP-ASSEMBLY-PETERS-HV-0002.jpg",
            "top_comments": [
                "A couple of reminders:\n\nTina Peters was convicted of Colorado state law felonies by a Colorado jury and sentenced by a Colorado judge and is serving nine years in a Colorado prison.  \n\nShe has never professed innocence:  instead, she has asserted falsely that her interference in the elections she was entrusted with administering was justified by large-scale fraud by others.\n\nToday's social-media fart by the President is inflammatory, but not wholly insane.\n\nDOJ is pursuing a Federal habeas corpus writ to get Peters out of prison while she pursues appeals.  That writ keeps getting denied because her state level appeals are not exhausted.\n\nPeters has not applied for state clemency.",
                "She was convicted on state charges. You know. Like the state's right to enforce, properly try and convict a citizen of that state when it runs afoul of a proper law?",
                ">“Tina is an innocent Political Prisoner being horribly and unjustly punished in the form of Cruel and Unusual Punishment,” he wrote.\n\nOh you mean like Kilmar Abrego Garcia, you dementia addled twit?",
                "Trump himself has 34 felony convictions. One felon trying to jailbreak another felon. And no one seems to have the basic sense to see that this is what is going on!",
                "Trump is such a corrupt sleaze bag. Trying to destroy our rule of law.",
                "They should be happy we applied the rule of law and she had her due process rights and was properly convicted.",
                "Tries to free a felon and lets an innocent man rot in an El Salvadoran torture prison.\n\nThe Republican party for you.",
                "He keeps calling his detractors “communists”.  I think we all know who the communists are. \n\nSic Semper Tyrannis.",
                "He is like:  she backed my lie",
                "He’s going to facilitate her release, is that what I’m hearing?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Exclusive: Order by Hegseth to cancel Ukraine weapons caught White House off guard",
            "external_url": "https://www.reuters.com/world/us/order-by-hegseth-cancel-ukraine-weapons-caught-white-house-off-guard-2025-05-06/",
            "upvotes": 14151,
            "date": "05/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Hegseth has seriously cured my imposter syndrome.",
                "The president was unaware. \n\nGet used to hearing that one.",
                "Probably not a good idea to cheat countries while trying to make trade deals with every other country in the world.",
                "The Associated Press reports that the savings will be used to implement \"unlimited jello shots\" at all future DoD meetings.",
                "I don’t understand how everything these dudes do materially helps the Russians and our media is all 🤷",
                "Ooh, this one makes Trump look bad. That will prob get him replaced.",
                "I don't think the mineral deal will still be valid if Russia conquers Ukraine.",
                "What's wild is that the DOD is running on his impulses. Alcoholism also brings erratic and impulsive behavior. America is so cooked if this regime ever steps down, so much relation building that will forever be at arms distance and the amount of money that will go towards contractors to assess what happened across the entire government in this 4 year period is going to last 2-3 president's at least.\n\nYall fucked",
                "I feel like unilaterally derailing your bosses negotiations is a good way for him to make you disappear from professional life. \n\nTbh this sort of feels like there are some obvious Putin sympathizers Trump appointed (for obvious reasons) and now that Trump is turning on Putin (in some aspects) the strings are being pulled to gum things up.",
                "**This article is talking about a unilateral stop of Aid in February but Hegseth:**\n\n\n\nThe president was unaware of Hegseth’s order, as were other top national security officials in the meeting, according to two sources briefed on the private White House discussions and another with direct knowledge of the matter.\n\nAsked to comment on this report, the White House told Reuters that Hegseth had followed a directive from Trump to pause aid to Ukraine, which it said was the administration's position at the time. It did not explain why, according to those who spoke to Reuters, top national security officials in the normal decision making process didn’t know about the order or why it was so swiftly reversed.\n\n“Negotiating an end to the Russia-Ukraine War has been a complex and fluid situation. We are not going to detail every conversation among top administration officials throughout the process,” said Karoline Leavitt, the White House spokeswoman. “The bottom line is the war is much closer to an end today than it was when President Trump took office.”\n\nThe cancelations cost TRANSCOM $2.2 million, according to the records reviewed by Reuters. In response to a request for comment, TRANSCOM said that the total cost was $1.6 million – 11 flights were canceled but one incurred no charge.\n\nAn order halting military aid authorized under the Biden administration went into effect officially a month later, on March 4, with a White House announcement.\n\nThe story of how flights were canceled, detailed by Reuters for the first time, points to an at-times haphazard policy-making process within the Trump administration and a command structure that is unclear even to its own ranking members.\n\nThe multiday pause of the flights, confirmed by five people with knowledge of it, also shows confusion in how the administration has created and implemented national security policy. At the Pentagon, the disarray is an open secret, with many current and former officials saying the department is plagued by internal disagreements on foreign policy, deep-seated grudges, and inexperienced staff.\n\nReuters couldn’t establish exactly when Hegseth’s office ordered the freight flights canceled. Two sources said Ukrainian and European officials began asking about the pause on February 2. The TRANSCOM records indicate that there was a verbal order from “SECDEF” – the secretary of defense – that stopped the flights and that they had resumed by February 5.\n\n“This is consistent with the administration's policy to move fast, break things and sort it out later. That is their managing philosophy,” said Mark Cancian, a retired Marine officer and defense expert with the Center for Strategic and International Studies think tank. “That is great for Silicon Valley. But when you’re talking about institutions that have been around for hundreds of years, you are going to run into problems.”\nThe stop in shipments caused consternation in Kyiv.\nThe Ukrainians quickly asked the administration through multiple channels but had difficulty obtaining any useful information, according to a Ukrainian official with direct knowledge of the situation. In later conversations with the Ukrainians, the administration wrote off the pause as “internal politics,” said the source. Ukrainian officials did not respond to requests for comment.\n\nThe shipping of American weapons to Ukraine requires sign-off from multiple agencies and can take weeks or even months to complete, depending on the size of the cargo. The majority of US military assistance goes through a logistics hub in Poland before being picked up by Ukrainian representatives and transported into the country.\n\nThat hub can hold shipments for extended periods of time. It’s not clear if the 11 canceled flights were the only ones scheduled that week in February, how much aid was already stockpiled in Poland and if it continued to flow into Ukraine despite the TRANSCOM orders.\n\nThe revelations come at a time of upheaval in the department. Several of Hegseth’s top advisers were escorted from the building April 15 after being accused of unauthorized disclosure of classified information. The secretary continues to face scrutiny, including from Congress, about his own communications. Previously he’s attributed allegations of upheaval to disgruntled employees.\n\nThe canceled flights contained weapons that had long been approved by the Biden administration, authorized by lawmakers on Capitol Hill.\n\nReuters couldn’t determine if Hegseth or his team knew how the order to TRANSCOM would play out or that the order would be a substantial change in U.S. policy on Ukraine. Three sources familiar with the situation said Hegseth misinterpreted discussions with the president about Ukraine policy and aid shipments without elaborating further.\n\nFour other people briefed on the situation said a small cadre of staffers inside the Pentagon, many of whom have never held a government job and who have for years spoken out against U.S. aid to Ukraine, advised Hegseth to consider pausing aid to the country.\n\nTwo people familiar with the matter denied there was a true cutoff in aid. One of them described it as a logistical pause.\n“(They) just wanted to get a handle on what was going on and people, as a result, misinterpreted that as: ‘You need to stop everything,’” said one."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Judge orders Trump administration to admit roughly 12,000 refugees",
            "external_url": "https://apnews.com/article/trump-refugee-admissions-suspension-ruling-aa8d219b8ad771eb6c034c45476a7ab3",
            "upvotes": 1469,
            "date": "05/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "A court order you say?  I'm sure the Trump Admin will be concerned by that.",
                "Oh lord he’s gonna bus them to a random location and leave them stranded isn’t he",
                "Hey how about we uphold our promises and obligations without the court having to force us to?",
                "I've been following this story since it broke for personal reasons; I came to the US as a refugee in 1996. \nI so feel for people who were ready to move on with their lives but have been in limbo for months not knowing what will happen to them. My flight was delayed from July to September and I was going mad from worrying. I cannot even imagine sitting in the refugee camp not having the slightest idea what will happen. \nBut then again, looking from the inside out, I totally got it. President promised he was gonna do it and refugees are the easiest target. \nIn any case this paragraph is quite disheartening:\n\"The 9th U.S. Circuit Court of Appeals largely put Whitehead’s decision on hold in March, finding that the administration was likely to win the case\"\nI hope justice department, administration and courts figure out something to help those poor people. Soon.",
                "Remember when we put a cap on refugees and turned away a boat load of jews seeking asylum from the nazis?  Then they had to go back and most ended up dying in the holocaust?  If you don't then US education did its job and hid the bad parts from you...",
                "I think I know the next judge that is going to get arrested !",
                "Well we have seen thus far how well Dipshit Donnie follows court orders."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Three fighter jets crashed in India's Jammu and Kashmir, local govt sources say",
            "external_url": "https://www.reuters.com/world/asia-pacific/three-fighter-jets-crashed-indias-jammu-kashmir-local-govt-sources-say-2025-05-07/",
            "upvotes": 137,
            "date": "05/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So Pakistan really did shoot down Indian fighters.",
                "Early reports are that Pakistan shot down these jets in Indian airspace from across the border. Curious to see how India responds to what I’m sure they will say is an escalation.",
                "If there’s anything the war in Ukraine has shown, it’s that most modern armies are not as modern as we think.",
                "The article shows images of one of the three. Below I've linked what I believe are videos of the other two crashed planes - albeit from somewhat biased sources favoring Pakistan. That said, I do believe at least one of them is an Indian Rafael since the markings match. If someone could share more videos that might help identify them, that would be good.\n\n&nbsp;\n\n## Plane 2\n\nhttps://nitter.net/AsfandBhittani/status/1919884934614863922\n\nI was able to find it here - though keep in mind its a Pakistani source so the bias in the other direction is there.\n\n## Plane 3\n\nHere's some more wreckage that may or may not be a different plane:\n\nhttps://nitter.net/clashreport/status/1919917195225636964\n\n&nbsp;\n\nI want to emphasize though that we can't say for sure whose jets these are, only guess based on wreckage/location.",
                "Wasn't India using missiles?",
                "Isnt the Rafael supposed to be comparable to most US fighters, and Pakistan uses old Chinese anti air systems like the HQ9P? If true this means older Chinese systems have killed cutting edge modern western tech. \n\nDoesnt bode well for the US vs China in the pacific.",
                "....🎶🎶and nothing could go wrong🎶🎶..",
                "Imagine if rafales are downed, what would france's reaction be. Regrets for selling it to a part that ruined it's reputation."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump Administration Plans to Send Migrants to Libya on a Military Flight",
            "external_url": "https://www.nytimes.com/2025/05/06/us/politics/trump-libya-migrants.html?unlocked_article_code=1.FU8.QiKK.NVy7O5rAJsXh&smid=nytcore-android-share",
            "upvotes": 488,
            "date": "05/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They plan to TRAFFIC migrants to Libya. This is human trafficking.",
                "What, did El Salvador get tired of murdering people for us already?",
                "Imagine you’re from Guatemala and here on protected status and ICE picks you up and sends you to fucking Libya.  What are the odds you ever make it out of there?   Say Libya even releases you, now you’re trapped on the other side of the fucking world.  \n\nFucking human trafficking.",
                "Is he just selling these people to labor camps?",
                "We are just creating enemies left and right, plus alienating our allies. We are so cooked. \"What's your villian origin story? America deported me to Libya.\"",
                "Why is he not just deporting them back to their country of origin?  WTF?",
                "The complexities that this is going to create downstream are going to be nearly impossible to unravel. And this will be the source of huge expense for the next administration to undo. What a goat rope.",
                "Stephen Miller is insane.",
                "This is tantamount to putting Jews on a train to Dachau. ",
                "This is fucking horrible and I’m sure not cost effective whatsoever \n\nAlso important to note that the EU has been sending migrants to Libya for a couple of years now. Despite proof that the migrants are being sold into slavery, under the eye of the Libyan “government”"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Another fighter jet is lost at sea after it falls off USS Harry S. Truman aircraft carrier",
            "external_url": "https://www.nbcnews.com/news/rcna205266",
            "upvotes": 1691,
            "date": "05/07/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250506-uss-hARRY-s-tRUMAN-F-A-18F-Super-Hornet-laning-2024-ac-939p-e5a633.jpg",
            "top_comments": [
                "Wouldn’t quite equate an arresting gear failure as “falling off”",
                "There's going to be more to this story.  Missing the wires is not rare and not a big deal.  Pilots always go to full power at touchdown whether they catch a wire or not.  Then if they miss they simply climb out and go around.  It's called a bolter.  Since that didn't happen here, something else was going on.",
                "They’ve lost more money dropping planes into the Red Sea than they’ve saved with all the DOGE bullshit.",
                "By dumping planes into the ocean it saves the government money because they no longer have to maintain the plane. Government efficiency!",
                "Two Class-A mishaps in eight days and that captain is gonna lose his job.",
                "Snippet from this news article:\n“For the second time in eight days, a fighter jet was lost after falling over the side of the USS Harry S. Truman aircraft carrier and into the Red Sea on Tuesday, two U.S. officials told NBC News.\nThere were only minor injuries after the two-seater, F-18 Super Hornet fell off the aircraft carrier as it was landing around 9:45 p.m. local time Tuesday (early afternoon East Coast time), the officials said.\n\nThe two aviators aboard ejected after the failed landing, in which the aircraft failed to catch the wire, known as a \"failed arrestment,\" one of the officials said.",
                ">“The buck stops here.  Fighter jets?  Not so much.”\n\n- The USS Harry Truman.",
                "I wonder how many they lose in an average year.   \n\n I'm guessing this carrier is involved with Yemen and the Houthis.",
                "This is not a \"fall\". This was effectively a crash.",
                "Who is getting the planes we drop in the water?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "A man spent 45 days in jail, accused of trying to abduct a child at Walmart. A judge granted a bond after lawyer shows video | CNN",
            "external_url": "https://www.cnn.com/2025/05/06/us/mahendra-patel-walmart-georgia-update",
            "upvotes": 5590,
            "date": "05/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25126618023242.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Why did it take 45 days for the judge to see the video ?",
                "> “I’m not worried about that. I don’t believe he poses a risk to the community,” said Poole. “The evidence from the video, and I won’t comment on what I think the video really shows, as far as guilt or innocence. It’s not my job today. But the facts do show me that he hung around, and I don’t find that he’s a flight risk based upon what I saw in the video,” Poole said.\n\nSo they claim he tried to snatch a child, but then he just stuck around the store continuing his shopping? The footage seems pretty in line with his statement.",
                "So some prosecutor has definitely seen this video of him clearly not doing what he is accused of and continued to hold charges for over a month, and is continuing with the case?",
                "For those interested in the full video from the court hearing:\nhttps://www.youtube.com/live/brDmaeE5DKo?si=p_GRA25_DRWH402n&t=1009",
                "Now the woman crying wolf needs to go to JAIL for lying to police and filing a false police report....and needs to be sued",
                "Judges tend to be pretty resistant to examining evidence at bond hearings. I have got them to do it, but it's definitely a matter of pointing at the rule and barging ahead. \n\nThe presumption that the State's version of events is true is extremely strong for most judges. The presumption of innocence is something you get from a jury.",
                "I don’t understand the woman, like what did she just realize that she had the opportunity to frame a man or has she been looking for this situation? Like it’s such an insane thing to do.",
                "I once read an article explaining the 'do not get involved' culture of China because it was SO common for people to sue people whom tried to help them. People eventually felt the risk was too great and will walk by someone in an emergency. It's stuff like this that worries me we could be headed that way.",
                "Bond? Shit should be thrown out and the girl should be arrested \n\nShe has another lawsuit ongoing where she sued Lyft for being raped",
                "Should have a nice fat settlement from multiple agencies after this clusterfuck."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Jurors deadlocked in ex-police officer Christopher Schurr’s murder trial",
            "external_url": "https://www.mlive.com/news/grand-rapids/2025/05/jurors-deadlocked-in-ex-police-officer-christopher-schurrs-murder-trial.html?outputType=amp",
            "upvotes": 44,
            "date": "05/06/2025",
            "thumbnail": "https://www.mlive.com/resizer/v2/PRTLPYRCQ5HYLDH2QHUQNASR2M.JPG?auth=4896adc4aca3569ae2acf6e7503576de90a28e8458da2f64b1d6569258ecb92c&width=1280&quality=90",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Bessent, Greer to meet with Chinese officials in Switzerland this week",
            "external_url": "https://www.reuters.com/world/bessent-greer-meet-with-chinese-officials-switzerland-this-week-2025-05-06/",
            "upvotes": 104,
            "date": "05/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Chinese delegation:  Hey, your boss is stupid, what can we do about this?\n\nBessent:  Best I can do is a lifetime discount at Arby’s",
                "Why? To surrender? Because we've got no leverage on China now, and nothing they want or need, either.",
                "Bessent and Greer are going to have grown up discussions with He Lifeng, and the day after will breathe a deep sigh of relief feeling they managed to get a good deal hammered out that makes all parties happy\n\nOnly for Trump post something like \"WE WILL NEVER MAKE DEALS WITH THE CHINESE IT'S TERRIBLE FOR THE AMERICAN PEOPLE NO DEAL!! ANY DEALS WITH CHINA IS TRAITOR STUFF, BAD GUY STUFF! WE WILL NEVER DO IT CHINA NEEDS TO BEG\" and Lutnick to go to a press conference and say \"we had no intention of ever agreeing to a deal with the Chinese, and Bessent and Greer had been manipulated by the Chinese.\" \n\nAnd then everything Bessent and Greer did will be moot.",
                "Xi has ignored T's call for talks.  Sending his Vice Premier to Switzerland to speak with Bessent is his preferred approach to tariff discussions.",
                "Oh look.\n\nFutures shows the market gaining all the loses from today because of this.\n\nPurely coincidental I’m sure.",
                "Trump's case has more holes than what you can find in a block of Emmentaler",
                "Do they need to show them where to deposit the bribes?",
                "I’m sure this will go swimmingly",
                "This is gonna end badly",
                "Bessent is a total lackey.. no morals"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "India says it attacked Pakistan, Pakistani Kashmir",
            "external_url": "https://www.reuters.com/world/asia-pacific/multiple-loud-explosions-heard-pakistani-kashmir-reuters-witness-2025-05-06/",
            "upvotes": 2965,
            "date": "05/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I picked the wrong week to quit sniffing glue",
                "So we have an escalating conflict between two nuclear powers. \n\nThe talibans will probably take the opportunity to attack from the north. Making Pakistan even more nervous. \n\nCombine that with the already high tensions between China and India.",
                "Since this occurred on Wednesday, if we just stay in Tuesday forever we won’t hit WW3 right? Right?",
                "Nothing happens until it does",
                "Someone get a mineral deal sorted out asap",
                "Wait, Trump supporters said Trump would end all the wars and conflicts when he would become president.",
                "Pax Americana is over",
                "Glad we have measured, wise leadership in the US during these troubled times.",
                "Republicans claimed it was Biden's fault Russia invaded Ukraine. They suggested it was proof of Biden's weakness. Does that mean this attack is Trump's fault and evidence of his weakness?",
                "“MODI STOP IT!!! PLEASE!”\n\nWorked on Putin right?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump says US to stop attacking Houthis in Yemen as group has 'capitulated'",
            "external_url": "https://www.bbc.com/news/articles/c5y5yd08wy7o",
            "upvotes": 1050,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/bdf1/live/a2c66e60-2aa1-11f0-a5e6-f95f9086d96f.jpg",
            "top_comments": [
                "I do not believe for a second Trump knows what the word capitulated means",
                "We'll see how long _that_ lasts. Trump just says the facts are what he wants them to be. He doesn't actually live in reality.",
                "Didn't a Houthi missile hit Tel Aviv yesterday?",
                "In a nutshell, Oman reached a ceasefire with the Houthis and they've agreed to stop attacking shipping lanes.",
                "He needs a win, even if it's against peasants.",
                "Havent they downed like $350m of american drones? In addition to the man hours, equipment, and ammunition costs, how is that saving money for taxpayers again? And what was the point of it all",
                "Yemen's President [states on Twitter](https://x.com/Presidentt_Ye) that Trump is a liar 🤦‍♂️",
                "1. Do something unnecessary and counterproductive. \n\n2. Achieve less than nothing. \n\n3. Declare victory. \n\nWash, rinse, repeat for the foreseeable future.",
                "Did Trump say that or did another signal chat say that?",
                "Are they aware they have?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Judge orders Trump administration to admit roughly 12,000 refugees",
            "external_url": "https://apnews.com/article/trump-refugee-admissions-suspension-ruling-aa8d219b8ad771eb6c034c45476a7ab3",
            "upvotes": 1477,
            "date": "05/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "A court order you say?  I'm sure the Trump Admin will be concerned by that.",
                "Oh lord he’s gonna bus them to a random location and leave them stranded isn’t he",
                "Hey how about we uphold our promises and obligations without the court having to force us to?",
                "I've been following this story since it broke for personal reasons; I came to the US as a refugee in 1996. \nI so feel for people who were ready to move on with their lives but have been in limbo for months not knowing what will happen to them. My flight was delayed from July to September and I was going mad from worrying. I cannot even imagine sitting in the refugee camp not having the slightest idea what will happen. \nBut then again, looking from the inside out, I totally got it. President promised he was gonna do it and refugees are the easiest target. \nIn any case this paragraph is quite disheartening:\n\"The 9th U.S. Circuit Court of Appeals largely put Whitehead’s decision on hold in March, finding that the administration was likely to win the case\"\nI hope justice department, administration and courts figure out something to help those poor people. Soon.",
                "Remember when we put a cap on refugees and turned away a boat load of jews seeking asylum from the nazis?  Then they had to go back and most ended up dying in the holocaust?  If you don't then US education did its job and hid the bad parts from you...",
                "I think I know the next judge that is going to get arrested !",
                "Well we have seen thus far how well Dipshit Donnie follows court orders."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Controllers briefly lost contact with Newark planes before wider flight disruptions",
            "external_url": "https://apnews.com/article/newark-airport-flight-delays-cancellations-united-4d3a3e226608583df5c292389f3c3b37",
            "upvotes": 560,
            "date": "05/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Anyone else feel like we still aren't getting the full story about what happened?",
                "Last night, Rachel Maddow did an excellent segment about this event and the general deterioration of air traffic control (especially at Newark) as an example of a government that isn't getting the basics done.\n\nIf Trump is so interested in manufacturing in America, what about American manufacturing and construction of American infrastructure? The fair conclusion based on Maddow's report is that Newark Liberty is not a safe destination.",
                "Wasn’t there a report of an air traffic controller saying flying in or out of Newark wasn’t safe like 3 days ago?",
                "I don't think I'd be flying there anytime soon.",
                "Can hardly stand all this winning 🙄",
                "Maybe they should keep the Doge boys out of safety related stuff",
                "This is scary shit and it’s not going to get better in the Trump Admin chaos storm.",
                "Call Sean from The Real World! Right away!",
                "I’m planning a trip to Italy in Sept and the connecting flight is in Newark 😭"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Another fighter jet is lost at sea after it falls off USS Harry S. Truman aircraft carrier",
            "external_url": "https://www.nbcnews.com/news/rcna205266",
            "upvotes": 1694,
            "date": "05/07/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250506-uss-hARRY-s-tRUMAN-F-A-18F-Super-Hornet-laning-2024-ac-939p-e5a633.jpg",
            "top_comments": [
                "Wouldn’t quite equate an arresting gear failure as “falling off”",
                "There's going to be more to this story.  Missing the wires is not rare and not a big deal.  Pilots always go to full power at touchdown whether they catch a wire or not.  Then if they miss they simply climb out and go around.  It's called a bolter.  Since that didn't happen here, something else was going on.",
                "They’ve lost more money dropping planes into the Red Sea than they’ve saved with all the DOGE bullshit.",
                "By dumping planes into the ocean it saves the government money because they no longer have to maintain the plane. Government efficiency!",
                "Two Class-A mishaps in eight days and that captain is gonna lose his job.",
                "Snippet from this news article:\n“For the second time in eight days, a fighter jet was lost after falling over the side of the USS Harry S. Truman aircraft carrier and into the Red Sea on Tuesday, two U.S. officials told NBC News.\nThere were only minor injuries after the two-seater, F-18 Super Hornet fell off the aircraft carrier as it was landing around 9:45 p.m. local time Tuesday (early afternoon East Coast time), the officials said.\n\nThe two aviators aboard ejected after the failed landing, in which the aircraft failed to catch the wire, known as a \"failed arrestment,\" one of the officials said.",
                ">“The buck stops here.  Fighter jets?  Not so much.”\n\n- The USS Harry Truman.",
                "I wonder how many they lose in an average year.   \n\n I'm guessing this carrier is involved with Yemen and the Houthis.",
                "This is not a \"fall\". This was effectively a crash.",
                "Who is getting the planes we drop in the water?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump Administration Plans to Send Migrants to Libya on a Military Flight",
            "external_url": "https://www.nytimes.com/2025/05/06/us/politics/trump-libya-migrants.html?unlocked_article_code=1.FU8.QiKK.NVy7O5rAJsXh&smid=nytcore-android-share",
            "upvotes": 487,
            "date": "05/07/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "They plan to TRAFFIC migrants to Libya. This is human trafficking.",
                "What, did El Salvador get tired of murdering people for us already?",
                "Imagine you’re from Guatemala and here on protected status and ICE picks you up and sends you to fucking Libya.  What are the odds you ever make it out of there?   Say Libya even releases you, now you’re trapped on the other side of the fucking world.  \n\nFucking human trafficking.",
                "Is he just selling these people to labor camps?",
                "We are just creating enemies left and right, plus alienating our allies. We are so cooked. \"What's your villian origin story? America deported me to Libya.\"",
                "Why is he not just deporting them back to their country of origin?  WTF?",
                "The complexities that this is going to create downstream are going to be nearly impossible to unravel. And this will be the source of huge expense for the next administration to undo. What a goat rope.",
                "Stephen Miller is insane.",
                "This is tantamount to putting Jews on a train to Dachau. ",
                "This is fucking horrible and I’m sure not cost effective whatsoever \n\nAlso important to note that the EU has been sending migrants to Libya for a couple of years now. Despite proof that the migrants are being sold into slavery, under the eye of the Libyan “government”"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "A man spent 45 days in jail, accused of trying to abduct a child at Walmart. A judge granted a bond after lawyer shows video | CNN",
            "external_url": "https://www.cnn.com/2025/05/06/us/mahendra-patel-walmart-georgia-update",
            "upvotes": 5600,
            "date": "05/07/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25126618023242.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Why did it take 45 days for the judge to see the video ?",
                "> “I’m not worried about that. I don’t believe he poses a risk to the community,” said Poole. “The evidence from the video, and I won’t comment on what I think the video really shows, as far as guilt or innocence. It’s not my job today. But the facts do show me that he hung around, and I don’t find that he’s a flight risk based upon what I saw in the video,” Poole said.\n\nSo they claim he tried to snatch a child, but then he just stuck around the store continuing his shopping? The footage seems pretty in line with his statement.",
                "So some prosecutor has definitely seen this video of him clearly not doing what he is accused of and continued to hold charges for over a month, and is continuing with the case?",
                "For those interested in the full video from the court hearing:\nhttps://www.youtube.com/live/brDmaeE5DKo?si=p_GRA25_DRWH402n&t=1009",
                "Now the woman crying wolf needs to go to JAIL for lying to police and filing a false police report....and needs to be sued",
                "Judges tend to be pretty resistant to examining evidence at bond hearings. I have got them to do it, but it's definitely a matter of pointing at the rule and barging ahead. \n\nThe presumption that the State's version of events is true is extremely strong for most judges. The presumption of innocence is something you get from a jury.",
                "I don’t understand the woman, like what did she just realize that she had the opportunity to frame a man or has she been looking for this situation? Like it’s such an insane thing to do.",
                "I once read an article explaining the 'do not get involved' culture of China because it was SO common for people to sue people whom tried to help them. People eventually felt the risk was too great and will walk by someone in an emergency. It's stuff like this that worries me we could be headed that way.",
                "Bond? Shit should be thrown out and the girl should be arrested \n\nShe has another lawsuit ongoing where she sued Lyft for being raped",
                "Should have a nice fat settlement from multiple agencies after this clusterfuck."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Judge orders Trump administration to admit roughly 12,000 refugees",
            "external_url": "https://apnews.com/article/trump-refugee-admissions-suspension-ruling-aa8d219b8ad771eb6c034c45476a7ab3",
            "upvotes": 1474,
            "date": "05/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "A court order you say?  I'm sure the Trump Admin will be concerned by that.",
                "Oh lord he’s gonna bus them to a random location and leave them stranded isn’t he",
                "Hey how about we uphold our promises and obligations without the court having to force us to?",
                "I've been following this story since it broke for personal reasons; I came to the US as a refugee in 1996. \nI so feel for people who were ready to move on with their lives but have been in limbo for months not knowing what will happen to them. My flight was delayed from July to September and I was going mad from worrying. I cannot even imagine sitting in the refugee camp not having the slightest idea what will happen. \nBut then again, looking from the inside out, I totally got it. President promised he was gonna do it and refugees are the easiest target. \nIn any case this paragraph is quite disheartening:\n\"The 9th U.S. Circuit Court of Appeals largely put Whitehead’s decision on hold in March, finding that the administration was likely to win the case\"\nI hope justice department, administration and courts figure out something to help those poor people. Soon.",
                "Remember when we put a cap on refugees and turned away a boat load of jews seeking asylum from the nazis?  Then they had to go back and most ended up dying in the holocaust?  If you don't then US education did its job and hid the bad parts from you...",
                "I think I know the next judge that is going to get arrested !",
                "Well we have seen thus far how well Dipshit Donnie follows court orders."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "India says it attacked Pakistan, Pakistani Kashmir",
            "external_url": "https://www.reuters.com/world/asia-pacific/multiple-loud-explosions-heard-pakistani-kashmir-reuters-witness-2025-05-06/",
            "upvotes": 2964,
            "date": "05/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I picked the wrong week to quit sniffing glue",
                "So we have an escalating conflict between two nuclear powers. \n\nThe talibans will probably take the opportunity to attack from the north. Making Pakistan even more nervous. \n\nCombine that with the already high tensions between China and India.",
                "Since this occurred on Wednesday, if we just stay in Tuesday forever we won’t hit WW3 right? Right?",
                "Nothing happens until it does",
                "Someone get a mineral deal sorted out asap",
                "Wait, Trump supporters said Trump would end all the wars and conflicts when he would become president.",
                "Pax Americana is over",
                "Glad we have measured, wise leadership in the US during these troubled times.",
                "Republicans claimed it was Biden's fault Russia invaded Ukraine. They suggested it was proof of Biden's weakness. Does that mean this attack is Trump's fault and evidence of his weakness?",
                "“MODI STOP IT!!! PLEASE!”\n\nWorked on Putin right?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Controllers briefly lost contact with Newark planes before wider flight disruptions",
            "external_url": "https://apnews.com/article/newark-airport-flight-delays-cancellations-united-4d3a3e226608583df5c292389f3c3b37",
            "upvotes": 562,
            "date": "05/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Anyone else feel like we still aren't getting the full story about what happened?",
                "Last night, Rachel Maddow did an excellent segment about this event and the general deterioration of air traffic control (especially at Newark) as an example of a government that isn't getting the basics done.\n\nIf Trump is so interested in manufacturing in America, what about American manufacturing and construction of American infrastructure? The fair conclusion based on Maddow's report is that Newark Liberty is not a safe destination.",
                "Wasn’t there a report of an air traffic controller saying flying in or out of Newark wasn’t safe like 3 days ago?",
                "I don't think I'd be flying there anytime soon.",
                "Can hardly stand all this winning 🙄",
                "Maybe they should keep the Doge boys out of safety related stuff",
                "This is scary shit and it’s not going to get better in the Trump Admin chaos storm.",
                "Call Sean from The Real World! Right away!",
                "I’m planning a trip to Italy in Sept and the connecting flight is in Newark 😭"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump says US to stop attacking Houthis in Yemen as group has 'capitulated'",
            "external_url": "https://www.bbc.com/news/articles/c5y5yd08wy7o",
            "upvotes": 1049,
            "date": "05/06/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/bdf1/live/a2c66e60-2aa1-11f0-a5e6-f95f9086d96f.jpg",
            "top_comments": [
                "I do not believe for a second Trump knows what the word capitulated means",
                "We'll see how long _that_ lasts. Trump just says the facts are what he wants them to be. He doesn't actually live in reality.",
                "Didn't a Houthi missile hit Tel Aviv yesterday?",
                "In a nutshell, Oman reached a ceasefire with the Houthis and they've agreed to stop attacking shipping lanes.",
                "He needs a win, even if it's against peasants.",
                "Havent they downed like $350m of american drones? In addition to the man hours, equipment, and ammunition costs, how is that saving money for taxpayers again? And what was the point of it all",
                "Yemen's President [states on Twitter](https://x.com/Presidentt_Ye) that Trump is a liar 🤦‍♂️",
                "1. Do something unnecessary and counterproductive. \n\n2. Achieve less than nothing. \n\n3. Declare victory. \n\nWash, rinse, repeat for the foreseeable future.",
                "Did Trump say that or did another signal chat say that?",
                "Are they aware they have?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Supreme Court upholds Trump's ban on transgender military members while appeals continue.",
            "external_url": "https://www.npr.org/2025/05/06/nx-s1-5388507/supreme-court-transgender-military",
            "upvotes": 13365,
            "date": "05/06/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5566x3131+0+290/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F09%2F5f%2F69ad07ce43bfb90d1e44c599d837%2Fgettyimages-2157829281-10.jpg",
            "top_comments": [
                "Says the draft dodger",
                "This ruling is far more insidious than it seems too. They didn't ban us on the basis of being \"mentally ill\" or something. They argued that we are inherently incapable of exhibiting honor, discipline, honesty, selflessness, and humility that is expected of service members.\n\nArguing that we shouldn't serve because we're mentally ill would still horrendous and incorrect, but they're arguing that we are *morally inferior and unfit* to serve. \n\nIt is *insane* that the SCOTUS rubber stamped this.",
                "Trump reinstated service members who refused to take the COVID-19 vaccine. (The same vaccine Donald Trump, himself, took) Nearly 100 service members died. A half a million were infected. But, lets kick out transgendered troops.",
                "[deleted]",
                "So they’re too weak to be in our military but too strong for sports?",
                "Funny how SCOTUS typically leans on the side of allowing harm when it benefits the prejudices of their base.",
                "Transgender people are the canary in the coal mine. However you may feel, if they are not free to be themselves, then none of us are... Fun fact: All those books the Nazis began with burning was transgender medical research. Up until that time, Berlin was the world leader in healthcare. We know what they ended with burning...",
                "According to their logic it is arrogant and selfish to be trans, thus disqualifying, so I guess 100% of the Trump admin are also unfit to serve in the military.",
                "So, the next time that the US will need conscripts, bone spurs will be out and “I identify as….” will be in and they’ll wonder why they can’t feed the war machine.",
                "You can’t have trans people in the military when the military starts rounding up trans people. It’s a conflict of interest you see…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "El Salvador president orders arrest of bus company heads for defying free ride policy",
            "external_url": "https://www.npr.org/2025/05/06/nx-s1-5388197/el-salvador-president-bukele-bus-free-transport",
            "upvotes": 1006,
            "date": "05/06/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+430/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F62%2F63%2Ffaf7dc964ba998fdb39ae419d08c%2Fap25104613817402.jpg",
            "top_comments": [
                "So according to the article they didn’t even defy the order. They just got overwhelmed with demand and couldn’t physically fit everybody on the buses. Believe it or not, straight to jail.",
                "This guy is a dictator .. he is planning to be President for life",
                "He’s beginning his dictator arc. I thought he was going to just stick with tough on crime and be normal about everything else (other than allowing our president traffic people into his prisons)",
                "Good luck El Salvador. This only ends in a coup as we know",
                "He's a budding Saddam Hussein.",
                "..and while you are at it how about returning our people for due processing?",
                "\"Straight to jail. Right away.\"",
                "Can't tell if the president has a low IQ or if the chaos is intentional."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Scientists explore the anatomy of a ‘zombie volcano’ that’s showing signs of activity",
            "external_url": "https://www.cnn.com/2025/05/05/science/uturuncu-zombie-volcano-erupt",
            "upvotes": 214,
            "date": "05/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/cn7cj3.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "tl;dr volcano that has not shown any activity for 250,000 years is shifting, gassing out, and rumbling.",
                "“Uturuncu, a lofty peak in the Central Andes mountain range, is what’s known as a “zombie volcano.””\n\nThis was all I wanted to know. Also, it is in Bolivia.",
                "Has been happening there for at least thirty years",
                "Id 100% watch a movie called Zombie Volcano",
                "The earth is warming so fast that thermal expansion (more volcanic activity as a result) is going to wipe whoever survives the climate change famines out",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/07/2025 04:12:04 UTC"
}