{
    "posts": [
        {
            "category": "HOT",
            "title": "Private Data and Passwords of Senior U.S. Security Officials Found Online",
            "external_url": "https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7?sara_ref=re-so-app-sh",
            "upvotes": 18137,
            "date": "03/26/2025",
            "thumbnail": "https://cdn.prod.www.spiegel.de/images/87ac326a-da00-4ba1-b643-d410f8595cbe_w1200_r1.778_fpx60.66_fpy45.jpg",
            "top_comments": [
                "The clown show continues.\n\nI watch in amazement as the US won the cold war and now a bunch of village idiots absolutely wreck national security and long standing alliances in a couple of weeks.",
                ">To do so, the reporters used commercial people search engines along with hacked customer data that has been published on the web. Those affected by the leaks include National Security Adviser Mike Waltz, Director of National Intelligence Tulsi Gabbard and Secretary of Defense Pete Hegseth.  \n>  \n>Most of these numbers and email addresses are apparently still in use, with some of them linked to profiles on social media platforms like Instagram and LinkedIn. They were used to create Dropbox accounts and profiles in apps that track running data. There are also WhatsApp profiles for the respective phone numbers and even Signal accounts in some cases.  \n>  \n>[...]  \n>National Intelligence Director Gabbard was seemingly more careful with her data than her two male colleagues. She apparently had her own data blocked in the commercial contact search engines that contained the data of Hegseth and Waltz. But her email address was to be found on WikiLeaks and Reddit.  \n>  \n>Gabbard’s email address is available in more than 10 leaks. One of those also contains a partial telephone number, which, when completed, leads to an active WhatsApp account and a Signal profile.  \n>\n>src: https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7  \n  \nI can see quite a few people being very interested in exploiting this.",
                "😂😂😂😂😂\nOf course they are. Why would anyone with empathy or common sense expect competence from this administration???",
                "I bet Trump has a sticky note with passwords on his computer monitor",
                "*Hostile intelligence services could use this publicly available data to hack the communications of those affected by installing spyware on their devices. It is thus conceivable that foreign agents were privy to the Signal chat group in which Gabbard, Waltz and Hegseth discussed a military strike.*\n\nThe headlines come fast and furious from T's desk, but the incompetence of the Admin seems equally propelled.",
                "You just know the clowns in Trump's cabinet answer phishing emails all the time and have probably already infected multiple government systems with malware.",
                "We are seeing the fall of America in real time. Thanks Republicans!",
                "Is now a good time to remind everyone that during the 2016 DNC hack, the Republicans were also hacked but WikiLeaks chose not to release any of that information? That decision led the public to believe that Democrats were insecure with how they handle their data while Republicans were not - which of course we all know now (and knew then, tbh) is the exact opposite.",
                "The soundtrack of the US Government is \"Yackety Sax\"",
                "Maga - Morons Are Governing America."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Person in Ohio dies of rabies after contracting virus from organ transplant",
            "external_url": "https://www.whio.com/news/local/person-dies-rabies-after-contracting-virus-organ-transplant/HMS5STBDHZESJJ7FU6464OMN3I/",
            "upvotes": 29496,
            "date": "03/26/2025",
            "thumbnail": "https://cmg-cmg-tv-10040-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fcmg%2FYPMX5TX5QVGJJLZSDGUPWR7NGQ.jpg?auth=612d61eb069c04a50f81fce2778338c3c1cbaaf0f16c60a6d2c3cbff7f510de5&width=1200&height=630&smart=true",
            "top_comments": [
                "Wtf. So did the donor die of rabies too or just somehow died before the rabies set in and they didn’t know? So sad",
                "Didn't this happen in an episode of Scrubs?",
                "from the article:\n\n26 March 2025\n\nLUCAS COUNTY — A person died from rabies after receiving a transplanted organ in Lucas County earlier this year:\n\n>The recipient, who had undergone a kidney transplant in December, contracted the viral disease through the donated organ, according to the Toledo-Lucas County Health Department, WTOL reported.\n\n>As the recipient was from Michigan, Michigan’s Department of Health and Human Services worked with the Ohio Department of Health and the Centers for Disease Control and Prevention to investigate the case.\n\n>It marks the first human case of rabies in Michigan since 2009, according to WTOL.\n\n>No additional individuals are at risk of rabies exposure, according to the CDC.\n\n>Kara Steele, a representative from Life Connection of Ohio, could not comment on the specific case but explained to WTOL that a donor risk assessment interview is conducted before any organ donation.\n\n>The identities of both the recipient and the donor have not been released.\n\n>The facility where the transplant took place has also not been disclosed. \n\n>However, according to the University of Toledo Medical Center’s website, it is the only organ transplant center in northwest Ohio.\n\n>Fewer than 10 people in the United States die from rabies each year, according to the CDC.",
                "That's some fuck you in particular level shit.",
                "There are other viruses where this has happened. There was a case that a donor got LCMV from his pet hamster and got into an accident.  7 out of 8 donors who go his organs died of LCMV, which is not considered wildly dangerous in humans.\n\nhttps://www.nejm.org/doi/full/10.1056/NEJMoa053240",
                "Maybe this is a question for a different subreddit.\n\nIf they figured this out shortly after the transplant could the recipient be saved by getting the rabies vaccine?    I am wondering if this is similar to having been bitten... it is in your body but is hasn't gotten into... the nerves(?) enough that the vaccine can help.  Maybe a transplant would be too much rabies all at once or in the wrong part of your body for the rabies treatment to be effective.",
                "first comment on the article:\n\nsandytratt1 hour ago\n\nIn 2012 at this same hospital they threw a donor kidney into the trash during a transplant surgery. The poor woman eventually managed to get her transplant months later but the organ accidentally thrown out had been a perfect match donated by her brother.",
                "That is absolutely tragic. And one of THE WORST ways to die :( \n\nImagine having your brain literally liquified in real-time, as you lose all comprehension of the people and world around you, except for intense and overwhelming fear and confusion.",
                "The donor had rabies, but died of something else? This is really bizarre.",
                "Wow that seems insanely unlucky. You get an organ transplant from someone who was so unlucky they caught rabies and then died from something else before developing symptoms (usually happens in months rarely years) and that something else was something that let them donate organs!"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Turkish student at Tufts University detained, video shows masked people handcuffing her",
            "external_url": "https://apnews.com/article/tufts-student-detained-massachusetts-immigration-6c3978da98a8d0f39ab311e092ffd892",
            "upvotes": 11722,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What are you even supposed to do in this case? Masked unidentified men claiming to be police with unmarked vehicles come to try to take you. Would calling 911 even help? What about self defense? ",
                "Gestapo level shit.  Her lawyer has no idea where she is.",
                "this is INSANE! the article said she wasn't an activist or member of any pro-Palestinian organization. She simply wrote an op-ed article for her campus paper, not even a national media outlet. She didn't organize protests or sit-ins or never was accused of harrassing or accosting Jewish students on campus. And the scary thing about it is that she hasn't even been accused of any crime. Her grad student visa (in the psychology department no less) was terminated on the whims of the Administration.",
                "People need to stop being complacent about this kind of stuff. They are detaining people with no due process. It's essentially kidnapping people who don't agree with the government's foreign policies. Whatever the fuck happened to free speech. They allow Nazis to walk around waving Swastika flags, but someone who criticizes Israel gets arrested like this? The double standards and hypocrisy of this government is pathetic. I wouldn't be surprised if the people who criticize Elon and Tesla end up getting kidnapped like this too.",
                "Why are they given till Friday to provide information?\n\nI understand if people disagree with someone’s opinion but they are literally violating the first amendment. And before you say she’s not a us citizen, the first amendment applies to all humans. If they can prove she violated some other law then prove it! Due process exists to protect the government and its people. It’s sad that there are Americans who don’t understand this and worse that there are Americans willing to participate.",
                "Individuals here on visas should start considering wearing AirTags in the undergarments so their whereabouts can be traced to some extent. Phones are the first thing they go for.",
                "Trumps secret police. Extinguish all freedom of speech.",
                "So pretend for a moment that you get rolled up on by a group of masked people in street garb that jump out of a car an accountant would be driving. And you also have a gun...\n\nIf you start blasting when they try to kidnap you, how does that ultimately play out?",
                "Unfortunately this is going to give some people evil ideas. You could iterally have 4 or 6 guys walk up to a woman, say they are from ICE and kidnap a person. Just put on a mask, and add a halfway believable badge from your neck....the entire video is less than 2 minutes. How many times a day does this happen?",
                "“First they came for” shit, on stanza two already."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Former ND Sen. Ray Holmberg sentenced to 10 years in prison for sex crime",
            "external_url": "https://northdakotamonitor.com/2025/03/26/former-nd-sen-ray-holmberg-sentenced-to-10-years-in-prison-for-sex-crime/",
            "upvotes": 1708,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Some highlights here, though I do encourage everyone to read the article in full. \n\n* Prosecutors allege Holmberg traveled to Prague in the Czech Republic 14 times between 2011 and 2021 to pay for sex with boys. \n\n* Though not part of the charges against Holmberg, two men who said they met him in North Dakota and were victimized by him gave emotional testimony at the hearing. One said Holmberg gave him money to film sex acts in the 1990s. The other man who spoke at the hearing was a cooperating witness who said Holmberg used his political power to groom them for sex. \n\n* Holmberg said in court that he traveled to Prague with the intent of having sexual contact with minors, that he liked massages and some involved sexual contact. He said he might have received a sexual massage from someone under 18, but he’s not sure.\n\n* In one message, Holmberg sent a cooperating witness a link to a brothel in Prague with the comment, “The boys rent at around $60 … (sex is extra).”\n\n* Holmberg was linked to the investigation of Nicholas Morgan-Derosier, a Grand Forks man who was sentenced in May to 40 years on child pornography charges.\n\n* Holmberg, a Republican who held the powerful positions of Senate Appropriations Committee chair and head of Legislative Management, resigned from the Legislature in 2022. He was indicted on federal charges in October 2023.\n\n* Ray Holmberg, 81, was a Grand Forks state senator for 45 years, and received a sentence that is longer than federal sentencing guidelines. \n\n* U.S. District Judge Daniel Hovland characterized Holmberg’s conduct as “egregious and despicable” and said he didn’t think the guideline sentence of more than three years was adequate.\n\n* “From my perspective, this was not an isolated case and this is not a victimless crime,” Hovland said. “It displays a pattern of very vile, sickening criminal behavior.”\n\n* Holmberg was sentenced to *10* years. At age 81, it's likely he will die in prison.\n\n* Holmberg is not trans nor a drag queen.",
                ">Holmberg, a Republican who held the powerful positions of Senate Appropriations Committee chair and head of Legislative Management.\n\nYet again, the danger to children are the very people who fear monger about trans people or immigrants or whatever else can deflect attention away from themselves.",
                "Wait does this one get sent to El Salvador too?",
                "Take one guess which party he represented…",
                "Yes.  He was a Republican.\n\nAnd a school counselor.",
                "Republican anti-abortion activist Howard Scott Heldreth is a convicted child rapist in Florida.\n\nRepublican County Commissioner David Swartz pleaded guilty to molesting two girls under the age of 11 and was sentenced to 8 years in prison.\n\nRepublican judge Mark Pazuhanich pleaded no contest to fondling a 10-year old girl and was sentenced to 10 years probation.\n\nRepublican anti-abortion activist Nicholas Morency pleaded guilty to possessing child pornography on his computer and offering a bounty to anybody who murders an abortion doctor.\n\nRepublican legislator Edison Misla Aldarondo was sentenced to 10 years in prison for raping his daughter between the ages of 9 and 17.\n\nRepublican Mayor Philip Giordano is serving a 37-year sentence in federal prison for sexually abusing 8- and 10-year old girls.\n\nRepublican campaign consultant Tom Shortridge was sentenced to three years probation for taking nude photographs of a 15-year old girl.\n\nRepublican racist pedophile and United States Senator Strom Thurmond had sex with a 15-year old black girl which produced a child.\n\nRepublican pastor Mike Hintz, whom George W. Bush commended during the 2004 presidential campaign, surrendered to police after admitting to a sexual affair with a female juvenile.\n\nRepublican legislator Peter Dibble pleaded no contest to having an inappropriate relationship with a 13-year-old girl.\n\nRepublican activist Lawrence E. King, Jr. organized child sex parties at the White House during the 1980s.\n\nRepublican lobbyist Craig J. Spence organized child sex parties at the White House during the 1980s.\n\nRepublican Congressman Donald “Buz” Lukens was found guilty of having sex with a female minor and sentenced to one month in jail.\n\nRepublican fundraiser Richard A. Delgaudio was found guilty of child porn charges and paying two teenage girls to pose for sexual photos.\n\nRepublican activist Mark A. Grethen convicted on six counts of sex crimes involving children.\n\nRepublican activist Randal David Ankeney pleaded guilty to attempted sexual assault on a child.\n\nRepublican Congressman Dan Crane had sex with a female minor working as a congressional page.\n\nRepublican activist and Christian Coalition leader Beverly Russell admitted to an incestuous relationship with his step daughter.\n\nRepublican congressman and anti-gay activist Robert Bauman was charged with having sex with a 16-year-old boy he picked up at a gay bar.\n\nRepublican Committee Chairman Jeffrey Patti was arrested for distributing a video clip of a 5-year-old girl being raped.\n\nRepublican activist Marty Glickman (a.k.a. “Republican Marty”), was taken into custody by Florida police on four counts of unlawful sexual activity with an underage girl and one count of delivering the drug LSD.\n\nRepublican legislative aide Howard L. Brooks was charged with molesting a 12-year old boy and possession of child pornography.\n\nRepublican Senate candidate John Hathaway was accused of having sex with his 12-year old baby sitter and withdrew his candidacy after the allegations were reported in the media.\n\nRepublican preacher Stephen White, who demanded a return to traditional values, was sentenced to jail after offering $20 to a 14-year-old boy for permission to perform oral sex on him.\n\nRepublican talk show host Jon Matthews pleaded guilty to exposing his genitals to an 11 year old girl.\n\nRepublican anti-gay activist Earl “Butch” Kimmerling was sentenced to 40 years in prison for molesting an 8-year old girl after he attempted to stop a gay couple from adopting her.\n\nRepublican Party leader Paul Ingram pleaded guilty to six counts of raping his daughters and served 14 years in federal prison.\n\nRepublican election board official Kevin Coan was sentenced to two years probation for soliciting sex over the internet from a 14-year old girl.\n\nRepublican politician Andrew Buhr was charged with two counts of first degree sodomy with a 13-year old boy.\n\nRepublican politician Keith Westmoreland was arrested on seven felony counts of lewd and lascivious exhibition to girls under the age of 16 (i.e. exposing himself to children).\n\nRepublican anti-abortion activist John Allen Burt was charged with sexual misconduct involving a 15-year old girl.\n\nRepublican County Councilman Keola Childs pleaded guilty to molesting a male child.\n\nRepublican activist John Butler was charged with criminal sexual assault on a teenage girl.\n\nRepublican candidate Richard Gardner admitted to molesting his two daughters.\n\nRepublican Councilman and former Marine Jack W. Gardner was convicted of molesting a 13-year old girl.\n\nRepublican County Commissioner Merrill Robert Barter pleaded guilty to unlawful sexual contact and assault on a teenage boy.\n\nRepublican City Councilman Fred C. Smeltzer, Jr. pleaded no contest to raping a 15 year-old girl and served 6-months in prison.\n\nRepublican activist Parker J. Bena pleaded guilty to possession of child pornography on his home computer and was sentenced to 30 months in federal prison and fined $18,000.\n\nRepublican parole board officer and former Colorado state representative, Larry Jack Schwarz, was fired after child pornography was found in his possession.\n\nRepublican strategist and Citadel Military College graduate Robin Vanderwall was convicted in Virginia on five counts of soliciting sex from boys and girls over the internet.\n\nRepublican city councilman Mark Harris, who is described as a “good military man” and “church goer,” was convicted of repeatedly having sex with an 11-year-old girl and sentenced to 12 years in prison.\n\nRepublican businessman Jon Grunseth withdrew his candidacy for Minnesota governor after allegations surfaced that he went swimming in the nude with four underage girls, including his daughter.\n\nRepublican director of the “Young Republican Federation” Nicholas Elizondo molested his 6-year old daughter and was sentenced to six years in prison.\n\nRepublican benefactor of conservative Christian groups, Richard A. Dasen Sr., was charged with rape for allegedly paying a 15-year old girl for sex. Dasen, 62, who is married with grown children and several grandchildren, has allegedly told police that over the past decade he paid more than $1 million to have sex with a large number of young women\n\nDennis Hastert served as Republican Speaker of the House (so, 3rd in line for the Presidency) for all 8 years of W. Bush’s two terms. He also sexually molested at least 5 boys when he was a HS wrestling coach, all of them underage with the youngest victim being 14. The victims only finally saw justice when Hastert was caught by the FBI trying to falsify payments for hush money.\n\nDonald Trump walked into Miss Teen USA change rooms with girls as young as 14 changing. 26 women have spoken publicly about Trump’s pattern of sexual assualt. In 2023, he was found legally liable for the rape of E. Jean Carroll by unanimous jury\n\nAnton “Tony” Lazzaro, a former Republican donor and political strategist from Minnesota, was convicted in March 2023 on federal charges of sex trafficking minors. He was found guilty of conspiring to recruit and pay teenage girls, aged 15 and 16, for sex between May and December 2020. In August 2023, Lazzaro was sentenced to 21 years in prison for these offenses.\n\nPrior to his arrest, Lazzaro was a prominent figure in Minnesota Republican circles, donating over $270,000 to various Republican campaigns and political committees. His indictment led to significant turmoil within the Minnesota Republican Party, culminating in the resignation of then-party chair Jennifer",
                "sick fuck, rot in hell",
                "Trump will pardon him and invite him to Mar-a-Lago.",
                "So, why is it that Republican isn’t in the forefront? I’d get it if it weren’t pertinent information. But Child SA and Republicans go together like peanut butter and jelly.",
                "Imagine going to the federal pen for pedophilia at 81. This is not the way to spend your golden years...."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Trump places 25% tariff on imported autos, expecting to raise $100 billion in tax revenues",
            "external_url": "https://apnews.com/article/autos-tariffs-trump-tax-imports-ford-gm-e53823ef7bbb7b3c46d11eca90aaa638",
            "upvotes": 6855,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Didn't he say tariffs aren't a tax?",
                "Last year, my parents bought a new car, installed solar panels, upgraded their phones and laptops, and bought a new TV, all because they thought Trump might win and implement tariffs and these things would become more expensive. \n\nThey also voted for Trump.",
                "Boy that’ll put a nice dent in the **$500 billion** in projected tax reduction next year all because he doesn’t want to fund the IRS adequately.",
                "tax revenues from whom exactly?",
                "Americans mad at Biden because stuff's too expensive, elect a guy who adds a 25% tax on everything.\n\nDidn't think the leopards would eat *their* face.",
                "Does this mean it’ll cost more to buy cars? And that extra money will go to the US government, so they can lower the taxes of billionaires. Thats kinda lame.",
                "Another scandal to cover up with more bad governance. This regime is really a human fucking centipede of government",
                "Oof. This is going to back fire.",
                "\"The United States last year imported nearly 8 million cars and light trucks worth $244 billion. Mexico, Japan and South Korea were the top sources of foreign vehicles. Imports of auto parts came to more than $197 billion, led by Mexico, Canada and China, according to the Commerce Department.\"\n\nThis man is going to war with the world and the next President will be left with a first term cleaning up all of this non-sense.",
                "Fool. Everyone knows that he should place a 50% tariff to generate $200 billion in tax revenues."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "HOT",
            "title": "Trump signs election order calling for proof of U.S. citizenship to vote",
            "external_url": "https://www.reuters.com/world/us/trump-signs-election-order-calling-proof-us-citizenship-vote-2025-03-26/",
            "upvotes": 40617,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I don't understand, aren't only citizens allowed to vote?",
                "Considering this isn’t a law, that voting is up to the states, this is mostly a Big Mac fueled fart in the wind.",
                "Meanwhile, Elon came over on a student visa. Stayed after it had expired… and now has more power than any US citizen",
                "Oh hey ... those people who were really upset about overreach of the federal government. Are you all gonna be mad about Trump taking away a right reserved for the states?",
                "States rights except when it is against Trumps agenda",
                "They aren't doing this because they expect States to follow the requirements. They are doing it because they expect *certain* states *won't*.\n\nThis is setting up a pretext for invalidating legal votes from registered voters, American citizens, specifically from blue States. \n\nThis needs to be heavily challenged in the courts and we should all hope it is shot down, because hell will break loose if the will of the people of entire States is disregarded.",
                "Article I, Section 4, Clause 1\n\n>The Times, Places and Manner of holding Elections for Senators and Representatives, shall be prescribed in each State by the Legislature thereof; but the Congress may at any time by Law make or alter such Regulations, except as to the Places of chusing Senators.\n\n\nStates or Congress.  The Executive have the power to do change state or federal laws.  This is yet another impeachable offense, yet congress is full of feckless cowards.",
                "I'd be ok with voter ID if everyone registered to vote was also given an ID for proof of identification.",
                "If they provide free, EASILY ATTAINABLE, federal ID for this purpose then I say go ahead. We all know they won’t though",
                "Trump will announce that the 2028 election has too many security failures and declare a state of emergency over election interference early in the year. The election may be cancelled.\n\nWe are right in the middle of it, folks. This is not my random redditor theory, this is the discussion being held about Trump trying to subvert term limits and how he'll do it. Prepare your pitchforks now, you'll need them in a few years."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Brazil Supreme Court to put Bolsonaro on trial for alleged coup attempt",
            "external_url": "https://www.reuters.com/world/americas/brazil-top-court-justice-recommends-that-bolsonaro-stand-trial-alleged-coup-2025-03-26/",
            "upvotes": 7269,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Good job Brazil. I like it when people are held accountable for their actions.",
                "Wow, just imagine what we could have had if Merrick Garland hadn’t been an absolutely worthless piece of shit.",
                "That's wild, I thought you were supposed re-elect people who attempt coups...",
                "So South Korea and Brazil have better democracies than the United States.",
                "Accountability for actions?! What’s this nonsense!",
                "Good job brazil 👏🏾 this is what america shouldve done with our felon in chief",
                "Hey look, a real country with a functioning legal system.",
                "Brazil picking up a lot of ground against USA when it comes to accountability and corruption. What’s curious is that Brazil always copies American politics, but now are forging their own path. Good for them and I hope the crime rate gets fixed next.",
                "Thank you Merrick Garland, for showing the world the dangers of a pathetically weak judicial system.  May they learn from our incompetence. \n\nMerrick Garland will go down in history as the enabler of American Fascism .",
                "Brazil showing the world how is done. A great example."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "The Atlantic publishes additional trove of Signal messages with details of Yemen strike",
            "external_url": "https://www.cnn.com/2025/03/26/politics/the-atlantic-publishes-signal-messages-yemen-strike/index.html",
            "upvotes": 13865,
            "date": "03/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2204323444.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So we already knew every single turd in the committee hearings yesterday straight-up lied, prompting The Atlantic to post the rest of the transcripts.\n\nPlease, Senate Intelligence Committee, lay it on them THICK today.",
                "The Trump admin trying to downplay this is the most pathetic thing they've done in months. 'only the best people'. All Trump supporters are rubes.",
                "Looks like there was one responsible adult in this mess.\n\n>  “We did redact one piece of information because we felt, on our own, that we felt it was best to do. And the CIA asked us, but, you know, at a certain point, the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves,” \n\n-- Jeffrey Goldberg\n\n> “Weather is FAVORABLE. Just CONFIRMED w/CENTCOM we are a GO for mission launch,” Hegseth wrote. \n\n> This entire story was another hoax written by a Trump-hater who is well-known for his sensationalist spin,” White House press secretary Karoline Leavitt said \n\n> “You’re talking about a deceitful and highly discredited so-called journalist who’s made a profession of peddling hoaxes time and time again,” Hegseth said. \n\n> Britt  Hume was quick to point out the glaring flaw in Hegseth’s excuse: It wasn’t a hoax, as the National Security Council confirmed that the messages accidentally sent to Goldberg were legit:",
                "Goldberg is being incredibly patriotic here, he is taking on a great personal risk against a regime that controls the most powerful government in the world. This regime is made up of truly incompetent bad faith actors, we should all remember that moving forward, whatever happens- these people running our country are incredibly dumb. They can be defeated.",
                "Not a day goes by that this clown fiesta of an administration fails to blow my mind.",
                "Funny how the GOP used to have fake outrage fits out of things 1,000 times smaller than this.",
                "I don't even get what the point of him sharing all these details in real time with that group chat to begin with? Just send a recap when it's over. It's like he was trying to show off or some shit",
                "*\"the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves\"*\n\nBrilliant. Absolutely calling their bluff.",
                "Already lots of bots on twitter trying to claim this is all fine. Not sure what else I expected.",
                "I do find it so funny that half of these clowns will wax for hours about how much money we burned in Ukraine or whatever, but these strike packages are big emoji worthy after burning whatever the cost in munitions, fuel and logistics were."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Exclusive: DOGE staffer, 'Big Balls', provided tech support to cybercrime ring, records show",
            "external_url": "https://www.reuters.com/world/us/doge-staffer-big-balls-provided-tech-support-cybercrime-ring-records-show-2025-03-26/?utm_source=reddit.com",
            "upvotes": 38629,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ok, as a reminder to everyone about \"Big Balls\".  \n\nHe is the grandson of a KGB spy.\n\nHe was fired from an internship at a cyber security company for leaking company info to a competitor. \n\nAnd now we know he's involved with crime rings.",
                "He still does, but he used to, too.",
                "The people involved with modifying code on our most sensitive electronic systems are not only just fresh out of school, but are sketchy as hell. \n\nAs a cybersecurity professional, I'm terrified. \n\nMost people can't comprehend how bad this stuff is.\n\nEdit: \n\nHere's a fun thought experiment:\n\n1) Look at the cybersecurity actions taken by this administration. \n2) Think about what actions a compromised President/Cabinet would take regarding cybersecurity. \n3) Ask yourself, what actions would a foreign agent of Russia take that ARE ANY DIFFERENT than what we all have seen up to this point. \n\nEducate yourself! The ONLY way ANY of this makes sense is with this context. Krasnov is destroying this country.\n\nhttps://www.csoonline.com/article/3829710/firing-of-130-cisa-staff-worries-cybersecurity-industry.html/amp/\n\nhttps://www.cybersecuritydive.com/news/dhs-disbands-advisory-board-csrb/737976/\n\nhttps://gizmodo.com/trumps-defense-secretary-hegseth-orders-cyber-command-to-stand-down-on-all-russia-operations-2000570343\n\nhttps://www.euronews.com/my-europe/2025/03/13/fact-checking-online-claims-that-donald-trump-was-recruited-by-the-kgb-as-krasnov",
                "You mean, the guys who use ICE to run the country like a mob, hire people from the underworld?",
                "If you want to use criminal tactics to be successful criminals, hire criminals.",
                "[deleted]",
                "He will work for any cybercrime group. He has chosen DOGE in this case.",
                "SOB ... 28 years, 3 time polygraphed ... friends I hadn't seen in years contacted by Suits & Ray-Bans and they let this little fucker have free reign over entire CRITICAL systems???\n\nI'm fucking pissed.\n\nTHIS should get people out in the streets!",
                "We already know he's working with Elon and Trump. Nothing new.",
                "This is not the level of professionalism we expect from Big Balls."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "Trump takes bid to slash teacher training funds to US Supreme Court",
            "external_url": "https://www.reuters.com/world/us/trump-takes-bid-slash-teacher-training-funds-us-supreme-court-2025-03-26/",
            "upvotes": 4873,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the article:\n\ntrump “says funds promote divisive ideologies.”\n\nThis fucking guy.",
                "Trump hates americans",
                "Is Trump following orders from Putin to destroy our country?",
                "Conservatives will bend over backwards to tell you that less teachers, and less educated teachers, is a good thing.",
                "Republicans love the uneducated, and there's no way this could be bad for America, right? Stone age America looks like the next step for the G.O.P.",
                "Great.  Uneducated educators teaching education.   Just what we need.  A whole generation of lost children.",
                "“I love the poorly educated.” -Krasnov",
                "They say they’re for the working class. Why does that never include teachers?",
                "WHAT TF IS GOING ON... how are we all just sitting around and letting this happen",
                "Another Trump movie I hadn't heard of,\nIf he does enough stuff maybe we won't notice him stuffing his pockets."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Egypt submarine live updates: At least six feared dead as tourist submarine sinks in Red Sea",
            "external_url": "https://www.bbc.co.uk/news/live/clynd93449kt",
            "upvotes": 75,
            "date": "03/27/2025",
            "thumbnail": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png",
            "top_comments": [
                "After hearing about oceangate, I will stay out of submersibles.",
                "Genuine question, what is even down there in Egypt that you want to see? The Titanic I can sorta understand. ",
                "I've been on one of the other 12 (now 11, I guess) in November operating out of Lanzarote.  A truly memorable experience where we got to see the local marine life, ship wrecks, and crates of the local wine conditioning on the sea floor.\n\nIt must be terrifying to be trapped in one if there is water ingress though.",
                "dying in a submarine....hard pass for me.",
                "There was a sub tour in Barbados that I always wanted to go to when I visit family.\n\n\nBut I never did it because of fear of something like this. ",
                "Aw shit, here we go again"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "South Korea battles worst ever wildfires as death toll hits 26",
            "external_url": "https://www.reuters.com/world/asia-pacific/south-korea-battles-worst-ever-wildfires-death-toll-hits-26-2025-03-27/",
            "upvotes": 110,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Let me guess dangerous California liberals strike again?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Former ND Sen. Ray Holmberg sentenced to 10 years in prison for sex crime",
            "external_url": "https://northdakotamonitor.com/2025/03/26/former-nd-sen-ray-holmberg-sentenced-to-10-years-in-prison-for-sex-crime/",
            "upvotes": 1711,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Some highlights here, though I do encourage everyone to read the article in full. \n\n* Prosecutors allege Holmberg traveled to Prague in the Czech Republic 14 times between 2011 and 2021 to pay for sex with boys. \n\n* Though not part of the charges against Holmberg, two men who said they met him in North Dakota and were victimized by him gave emotional testimony at the hearing. One said Holmberg gave him money to film sex acts in the 1990s. The other man who spoke at the hearing was a cooperating witness who said Holmberg used his political power to groom them for sex. \n\n* Holmberg said in court that he traveled to Prague with the intent of having sexual contact with minors, that he liked massages and some involved sexual contact. He said he might have received a sexual massage from someone under 18, but he’s not sure.\n\n* In one message, Holmberg sent a cooperating witness a link to a brothel in Prague with the comment, “The boys rent at around $60 … (sex is extra).”\n\n* Holmberg was linked to the investigation of Nicholas Morgan-Derosier, a Grand Forks man who was sentenced in May to 40 years on child pornography charges.\n\n* Holmberg, a Republican who held the powerful positions of Senate Appropriations Committee chair and head of Legislative Management, resigned from the Legislature in 2022. He was indicted on federal charges in October 2023.\n\n* Ray Holmberg, 81, was a Grand Forks state senator for 45 years, and received a sentence that is longer than federal sentencing guidelines. \n\n* U.S. District Judge Daniel Hovland characterized Holmberg’s conduct as “egregious and despicable” and said he didn’t think the guideline sentence of more than three years was adequate.\n\n* “From my perspective, this was not an isolated case and this is not a victimless crime,” Hovland said. “It displays a pattern of very vile, sickening criminal behavior.”\n\n* Holmberg was sentenced to *10* years. At age 81, it's likely he will die in prison.\n\n* Holmberg is not trans nor a drag queen.",
                ">Holmberg, a Republican who held the powerful positions of Senate Appropriations Committee chair and head of Legislative Management.\n\nYet again, the danger to children are the very people who fear monger about trans people or immigrants or whatever else can deflect attention away from themselves.",
                "Wait does this one get sent to El Salvador too?",
                "Take one guess which party he represented…",
                "Yes.  He was a Republican.\n\nAnd a school counselor.",
                "Republican anti-abortion activist Howard Scott Heldreth is a convicted child rapist in Florida.\n\nRepublican County Commissioner David Swartz pleaded guilty to molesting two girls under the age of 11 and was sentenced to 8 years in prison.\n\nRepublican judge Mark Pazuhanich pleaded no contest to fondling a 10-year old girl and was sentenced to 10 years probation.\n\nRepublican anti-abortion activist Nicholas Morency pleaded guilty to possessing child pornography on his computer and offering a bounty to anybody who murders an abortion doctor.\n\nRepublican legislator Edison Misla Aldarondo was sentenced to 10 years in prison for raping his daughter between the ages of 9 and 17.\n\nRepublican Mayor Philip Giordano is serving a 37-year sentence in federal prison for sexually abusing 8- and 10-year old girls.\n\nRepublican campaign consultant Tom Shortridge was sentenced to three years probation for taking nude photographs of a 15-year old girl.\n\nRepublican racist pedophile and United States Senator Strom Thurmond had sex with a 15-year old black girl which produced a child.\n\nRepublican pastor Mike Hintz, whom George W. Bush commended during the 2004 presidential campaign, surrendered to police after admitting to a sexual affair with a female juvenile.\n\nRepublican legislator Peter Dibble pleaded no contest to having an inappropriate relationship with a 13-year-old girl.\n\nRepublican activist Lawrence E. King, Jr. organized child sex parties at the White House during the 1980s.\n\nRepublican lobbyist Craig J. Spence organized child sex parties at the White House during the 1980s.\n\nRepublican Congressman Donald “Buz” Lukens was found guilty of having sex with a female minor and sentenced to one month in jail.\n\nRepublican fundraiser Richard A. Delgaudio was found guilty of child porn charges and paying two teenage girls to pose for sexual photos.\n\nRepublican activist Mark A. Grethen convicted on six counts of sex crimes involving children.\n\nRepublican activist Randal David Ankeney pleaded guilty to attempted sexual assault on a child.\n\nRepublican Congressman Dan Crane had sex with a female minor working as a congressional page.\n\nRepublican activist and Christian Coalition leader Beverly Russell admitted to an incestuous relationship with his step daughter.\n\nRepublican congressman and anti-gay activist Robert Bauman was charged with having sex with a 16-year-old boy he picked up at a gay bar.\n\nRepublican Committee Chairman Jeffrey Patti was arrested for distributing a video clip of a 5-year-old girl being raped.\n\nRepublican activist Marty Glickman (a.k.a. “Republican Marty”), was taken into custody by Florida police on four counts of unlawful sexual activity with an underage girl and one count of delivering the drug LSD.\n\nRepublican legislative aide Howard L. Brooks was charged with molesting a 12-year old boy and possession of child pornography.\n\nRepublican Senate candidate John Hathaway was accused of having sex with his 12-year old baby sitter and withdrew his candidacy after the allegations were reported in the media.\n\nRepublican preacher Stephen White, who demanded a return to traditional values, was sentenced to jail after offering $20 to a 14-year-old boy for permission to perform oral sex on him.\n\nRepublican talk show host Jon Matthews pleaded guilty to exposing his genitals to an 11 year old girl.\n\nRepublican anti-gay activist Earl “Butch” Kimmerling was sentenced to 40 years in prison for molesting an 8-year old girl after he attempted to stop a gay couple from adopting her.\n\nRepublican Party leader Paul Ingram pleaded guilty to six counts of raping his daughters and served 14 years in federal prison.\n\nRepublican election board official Kevin Coan was sentenced to two years probation for soliciting sex over the internet from a 14-year old girl.\n\nRepublican politician Andrew Buhr was charged with two counts of first degree sodomy with a 13-year old boy.\n\nRepublican politician Keith Westmoreland was arrested on seven felony counts of lewd and lascivious exhibition to girls under the age of 16 (i.e. exposing himself to children).\n\nRepublican anti-abortion activist John Allen Burt was charged with sexual misconduct involving a 15-year old girl.\n\nRepublican County Councilman Keola Childs pleaded guilty to molesting a male child.\n\nRepublican activist John Butler was charged with criminal sexual assault on a teenage girl.\n\nRepublican candidate Richard Gardner admitted to molesting his two daughters.\n\nRepublican Councilman and former Marine Jack W. Gardner was convicted of molesting a 13-year old girl.\n\nRepublican County Commissioner Merrill Robert Barter pleaded guilty to unlawful sexual contact and assault on a teenage boy.\n\nRepublican City Councilman Fred C. Smeltzer, Jr. pleaded no contest to raping a 15 year-old girl and served 6-months in prison.\n\nRepublican activist Parker J. Bena pleaded guilty to possession of child pornography on his home computer and was sentenced to 30 months in federal prison and fined $18,000.\n\nRepublican parole board officer and former Colorado state representative, Larry Jack Schwarz, was fired after child pornography was found in his possession.\n\nRepublican strategist and Citadel Military College graduate Robin Vanderwall was convicted in Virginia on five counts of soliciting sex from boys and girls over the internet.\n\nRepublican city councilman Mark Harris, who is described as a “good military man” and “church goer,” was convicted of repeatedly having sex with an 11-year-old girl and sentenced to 12 years in prison.\n\nRepublican businessman Jon Grunseth withdrew his candidacy for Minnesota governor after allegations surfaced that he went swimming in the nude with four underage girls, including his daughter.\n\nRepublican director of the “Young Republican Federation” Nicholas Elizondo molested his 6-year old daughter and was sentenced to six years in prison.\n\nRepublican benefactor of conservative Christian groups, Richard A. Dasen Sr., was charged with rape for allegedly paying a 15-year old girl for sex. Dasen, 62, who is married with grown children and several grandchildren, has allegedly told police that over the past decade he paid more than $1 million to have sex with a large number of young women\n\nDennis Hastert served as Republican Speaker of the House (so, 3rd in line for the Presidency) for all 8 years of W. Bush’s two terms. He also sexually molested at least 5 boys when he was a HS wrestling coach, all of them underage with the youngest victim being 14. The victims only finally saw justice when Hastert was caught by the FBI trying to falsify payments for hush money.\n\nDonald Trump walked into Miss Teen USA change rooms with girls as young as 14 changing. 26 women have spoken publicly about Trump’s pattern of sexual assualt. In 2023, he was found legally liable for the rape of E. Jean Carroll by unanimous jury\n\nAnton “Tony” Lazzaro, a former Republican donor and political strategist from Minnesota, was convicted in March 2023 on federal charges of sex trafficking minors. He was found guilty of conspiring to recruit and pay teenage girls, aged 15 and 16, for sex between May and December 2020. In August 2023, Lazzaro was sentenced to 21 years in prison for these offenses.\n\nPrior to his arrest, Lazzaro was a prominent figure in Minnesota Republican circles, donating over $270,000 to various Republican campaigns and political committees. His indictment led to significant turmoil within the Minnesota Republican Party, culminating in the resignation of then-party chair Jennifer",
                "sick fuck, rot in hell",
                "Trump will pardon him and invite him to Mar-a-Lago.",
                "So, why is it that Republican isn’t in the forefront? I’d get it if it weren’t pertinent information. But Child SA and Republicans go together like peanut butter and jelly.",
                "Imagine going to the federal pen for pedophilia at 81. This is not the way to spend your golden years...."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Copper prices surge to record high amid tariff anxiety",
            "external_url": "https://www.cnn.com/2025/03/26/investing/copper-record-high-tariff-anxiety/index.html",
            "upvotes": 711,
            "date": "03/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2202952611.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Yeah. Some billionaires just made more money.",
                "> Copper prices have outpaced gold, which has gained 16%, and far outpaced the major US stock indexes this year. \n\nSo, TINA...to the crackhead strat of pulling copper pipes from abandoned houses.\n\nTrump's America, everyone.",
                "Oh I get it now. This is to curb inflation. See… if copper is expensive then pennies can buy more goods. There are 100 pennies in a dollar, so that must be true for paper dollars too. and boom national debt is gone! \n\nThere is the plan folks!",
                "#Copper’s on Fire as Trump Tariff Talk Sparks Record-Breaking Price Surge\n\nCopper, usually the quieter cousin to gold in the metals world, has suddenly stolen the spotlight. Prices for the red metal have rocketed to an all-time high in New York, fuelled by whispers that President Donald Trump may slap tariffs on copper imports far sooner than markets had expected.\n\nTraders had been banking on autumn for any big changes, but reports on Wednesday suggested tariffs might land within weeks. That was all the spark Wall Street needed. Copper futures leapt to an eye-watering $5.374 per pound before cooling slightly to settle at $5.24, still a record. For context, copper has surged 30 per cent this year alone, outpacing even gold, which is having a strong year itself. The stock markets, meanwhile, are still playing catch-up.\n\nThe surge is being driven less by traditional demand and more by panic buying. US firms, anxious to get ahead of any new import charges, are snapping up copper as quickly as they can. Analysts believe around 500,000 tons are being shipped to American ports this month, a massive jump from the usual 70,000 tons. Goldman Sachs thinks that figure could rise by another 200,000 tons in April.\n\nIt’s a classic case of buy now, worry later. Traders are front-running the tariffs, trying to stockpile before prices go even higher. As one analyst put it, the mere suggestion of tariffs has sent copper into a frenzy. The result is a growing gap between copper prices in New York and London, where the metal has also climbed but not nearly as dramatically.\n\nCopper may not be classed as a rare earth mineral, nor does it feature among the US’s 50 “critical minerals”, but it remains vital. It is used everywhere from electronics to energy systems to national defence. The US Department of Energy even called it a “critical material for energy” back in 2023. With such wide-ranging uses, any disruption to supply has ripple effects.\n\nInterestingly, this price spike is not being driven by ordinary consumer demand. It is more about shifting stockpiles and geopolitical chess moves. Trump recently signed an executive order to investigate the national security risks of importing copper, a move that many see as paving the way for yet another tariff.\n\nThe frenzy is already having global consequences. Analysts warn that the US copper grab could leave other countries short, and with the world expected to meet only 70 per cent of copper demand by 2035, that is a real concern. Throw in a recent production cut from Glencore in Chile, and the copper market looks increasingly tight.\n\nDespite the buzz, not everyone is convinced the price surge will last. Once the stockpiling rush subsides, we may see a correction. But for now, copper is having its moment, and the markets are watching every move from the White House with bated breath.",
                "The copper was stolen out of the parking lot lights at my gym twice in one year. It’s about to happen again. Hopefully the weld the access covers in preparation.",
                "Ea Nasir ready to make some deals.",
                "So much for brining house prices down.",
                "So many vacant, overpriced apartments in the Portland metro area. So many homeless people. Sounds like a new opportunity for entrepreneurial-minded homeless people to make a fast dollar.",
                "Time to buy copper of low quality",
                "Ea-nāṣir would be slaying it right now."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Federal judge who drew Trump's anger picks up new case against administration",
            "external_url": "https://www.npr.org/2025/03/26/nx-s1-5341540/boasberg-trump-signal-national-security-atlantic-lawsuit",
            "upvotes": 746,
            "date": "03/26/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7717x4341+0+403/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9e%2Fd0%2Fdda890584c71ae6f922d4d089619%2Fgettyimages-2206891765.jpg",
            "top_comments": [
                "There are about 25 judges in the DC Federal District Court. Cases are ordinarily assigned randomly to a judge when they are filed. There are dozens of cases filed every day. \n\nThis isnt surprising.",
                "I have a sinking feeling that he should invest in some bodyguards",
                "I did not know that 13yo bullies could be president.",
                "is this another judge I'm going to be disappointed in?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Trump places 25% tariff on imported autos, expecting to raise $100 billion in tax revenues",
            "external_url": "https://apnews.com/article/autos-tariffs-trump-tax-imports-ford-gm-e53823ef7bbb7b3c46d11eca90aaa638",
            "upvotes": 6876,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Didn't he say tariffs aren't a tax?",
                "Last year, my parents bought a new car, installed solar panels, upgraded their phones and laptops, and bought a new TV, all because they thought Trump might win and implement tariffs and these things would become more expensive. \n\nThey also voted for Trump.",
                "Boy that’ll put a nice dent in the **$500 billion** in projected tax reduction next year all because he doesn’t want to fund the IRS adequately.",
                "tax revenues from whom exactly?",
                "Americans mad at Biden because stuff's too expensive, elect a guy who adds a 25% tax on everything.\n\nDidn't think the leopards would eat *their* face.",
                "Does this mean it’ll cost more to buy cars? And that extra money will go to the US government, so they can lower the taxes of billionaires. Thats kinda lame.",
                "Another scandal to cover up with more bad governance. This regime is really a human fucking centipede of government",
                "Oof. This is going to back fire.",
                "\"The United States last year imported nearly 8 million cars and light trucks worth $244 billion. Mexico, Japan and South Korea were the top sources of foreign vehicles. Imports of auto parts came to more than $197 billion, led by Mexico, Canada and China, according to the Commerce Department.\"\n\nThis man is going to war with the world and the next President will be left with a first term cleaning up all of this non-sense.",
                "Fool. Everyone knows that he should place a 50% tariff to generate $200 billion in tax revenues."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Ukraine’s clandestine book club defies Russia’s push to rewrite history",
            "external_url": "https://www.theguardian.com/world/2025/mar/22/ukraine-clandestine-book-club-defies-russia-push-rewrite-history",
            "upvotes": 407,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/896b995e0cdeffe910df83663974f493652d215d/0_193_5787_3472/master/5787.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=72fc51639e66ad3a0558aeef9f34cdba",
            "top_comments": [
                "So glad they're highlighting it, thereby exposing it to attack.\n\n*eye roll*\n\nSLAVA UKRAINI!"
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "Neptune's auroras are captured in great detail by NASA's Webb telescope",
            "external_url": "https://apnews.com/article/neptune-auroras-webb-telescope-ffac7282bc5ced7e90759728d1d0b96a",
            "upvotes": 166,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Aurora Borealis!? At this time of year, at this time of day, in this part of the solar system, localized entirely within Neptune??",
                "\"great detail\"\n\n*Adds some green low res noise.*",
                "I read that aromas, and was really confused understanding that this is not the year 3000 yet",
                "Not for long"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Turkish student at Tufts University detained, video shows masked people handcuffing her",
            "external_url": "https://apnews.com/article/tufts-student-detained-massachusetts-immigration-6c3978da98a8d0f39ab311e092ffd892",
            "upvotes": 11724,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What are you even supposed to do in this case? Masked unidentified men claiming to be police with unmarked vehicles come to try to take you. Would calling 911 even help? What about self defense? ",
                "Gestapo level shit.  Her lawyer has no idea where she is.",
                "this is INSANE! the article said she wasn't an activist or member of any pro-Palestinian organization. She simply wrote an op-ed article for her campus paper, not even a national media outlet. She didn't organize protests or sit-ins or never was accused of harrassing or accosting Jewish students on campus. And the scary thing about it is that she hasn't even been accused of any crime. Her grad student visa (in the psychology department no less) was terminated on the whims of the Administration.",
                "People need to stop being complacent about this kind of stuff. They are detaining people with no due process. It's essentially kidnapping people who don't agree with the government's foreign policies. Whatever the fuck happened to free speech. They allow Nazis to walk around waving Swastika flags, but someone who criticizes Israel gets arrested like this? The double standards and hypocrisy of this government is pathetic. I wouldn't be surprised if the people who criticize Elon and Tesla end up getting kidnapped like this too.",
                "Why are they given till Friday to provide information?\n\nI understand if people disagree with someone’s opinion but they are literally violating the first amendment. And before you say she’s not a us citizen, the first amendment applies to all humans. If they can prove she violated some other law then prove it! Due process exists to protect the government and its people. It’s sad that there are Americans who don’t understand this and worse that there are Americans willing to participate.",
                "Individuals here on visas should start considering wearing AirTags in the undergarments so their whereabouts can be traced to some extent. Phones are the first thing they go for.",
                "Trumps secret police. Extinguish all freedom of speech.",
                "So pretend for a moment that you get rolled up on by a group of masked people in street garb that jump out of a car an accountant would be driving. And you also have a gun...\n\nIf you start blasting when they try to kidnap you, how does that ultimately play out?",
                "Unfortunately this is going to give some people evil ideas. You could iterally have 4 or 6 guys walk up to a woman, say they are from ICE and kidnap a person. Just put on a mask, and add a halfway believable badge from your neck....the entire video is less than 2 minutes. How many times a day does this happen?",
                "“First they came for” shit, on stanza two already."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Private Data and Passwords of Senior U.S. Security Officials Found Online",
            "external_url": "https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7?sara_ref=re-so-app-sh",
            "upvotes": 18130,
            "date": "03/26/2025",
            "thumbnail": "https://cdn.prod.www.spiegel.de/images/87ac326a-da00-4ba1-b643-d410f8595cbe_w1200_r1.778_fpx60.66_fpy45.jpg",
            "top_comments": [
                "The clown show continues.\n\nI watch in amazement as the US won the cold war and now a bunch of village idiots absolutely wreck national security and long standing alliances in a couple of weeks.",
                ">To do so, the reporters used commercial people search engines along with hacked customer data that has been published on the web. Those affected by the leaks include National Security Adviser Mike Waltz, Director of National Intelligence Tulsi Gabbard and Secretary of Defense Pete Hegseth.  \n>  \n>Most of these numbers and email addresses are apparently still in use, with some of them linked to profiles on social media platforms like Instagram and LinkedIn. They were used to create Dropbox accounts and profiles in apps that track running data. There are also WhatsApp profiles for the respective phone numbers and even Signal accounts in some cases.  \n>  \n>[...]  \n>National Intelligence Director Gabbard was seemingly more careful with her data than her two male colleagues. She apparently had her own data blocked in the commercial contact search engines that contained the data of Hegseth and Waltz. But her email address was to be found on WikiLeaks and Reddit.  \n>  \n>Gabbard’s email address is available in more than 10 leaks. One of those also contains a partial telephone number, which, when completed, leads to an active WhatsApp account and a Signal profile.  \n>\n>src: https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7  \n  \nI can see quite a few people being very interested in exploiting this.",
                "😂😂😂😂😂\nOf course they are. Why would anyone with empathy or common sense expect competence from this administration???",
                "I bet Trump has a sticky note with passwords on his computer monitor",
                "*Hostile intelligence services could use this publicly available data to hack the communications of those affected by installing spyware on their devices. It is thus conceivable that foreign agents were privy to the Signal chat group in which Gabbard, Waltz and Hegseth discussed a military strike.*\n\nThe headlines come fast and furious from T's desk, but the incompetence of the Admin seems equally propelled.",
                "You just know the clowns in Trump's cabinet answer phishing emails all the time and have probably already infected multiple government systems with malware.",
                "We are seeing the fall of America in real time. Thanks Republicans!",
                "Is now a good time to remind everyone that during the 2016 DNC hack, the Republicans were also hacked but WikiLeaks chose not to release any of that information? That decision led the public to believe that Democrats were insecure with how they handle their data while Republicans were not - which of course we all know now (and knew then, tbh) is the exact opposite.",
                "The soundtrack of the US Government is \"Yackety Sax\"",
                "Maga - Morons Are Governing America."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Former ND Sen. Ray Holmberg sentenced to 10 years in prison for sex crime",
            "external_url": "https://northdakotamonitor.com/2025/03/26/former-nd-sen-ray-holmberg-sentenced-to-10-years-in-prison-for-sex-crime/",
            "upvotes": 1713,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Some highlights here, though I do encourage everyone to read the article in full. \n\n* Prosecutors allege Holmberg traveled to Prague in the Czech Republic 14 times between 2011 and 2021 to pay for sex with boys. \n\n* Though not part of the charges against Holmberg, two men who said they met him in North Dakota and were victimized by him gave emotional testimony at the hearing. One said Holmberg gave him money to film sex acts in the 1990s. The other man who spoke at the hearing was a cooperating witness who said Holmberg used his political power to groom them for sex. \n\n* Holmberg said in court that he traveled to Prague with the intent of having sexual contact with minors, that he liked massages and some involved sexual contact. He said he might have received a sexual massage from someone under 18, but he’s not sure.\n\n* In one message, Holmberg sent a cooperating witness a link to a brothel in Prague with the comment, “The boys rent at around $60 … (sex is extra).”\n\n* Holmberg was linked to the investigation of Nicholas Morgan-Derosier, a Grand Forks man who was sentenced in May to 40 years on child pornography charges.\n\n* Holmberg, a Republican who held the powerful positions of Senate Appropriations Committee chair and head of Legislative Management, resigned from the Legislature in 2022. He was indicted on federal charges in October 2023.\n\n* Ray Holmberg, 81, was a Grand Forks state senator for 45 years, and received a sentence that is longer than federal sentencing guidelines. \n\n* U.S. District Judge Daniel Hovland characterized Holmberg’s conduct as “egregious and despicable” and said he didn’t think the guideline sentence of more than three years was adequate.\n\n* “From my perspective, this was not an isolated case and this is not a victimless crime,” Hovland said. “It displays a pattern of very vile, sickening criminal behavior.”\n\n* Holmberg was sentenced to *10* years. At age 81, it's likely he will die in prison.\n\n* Holmberg is not trans nor a drag queen.",
                ">Holmberg, a Republican who held the powerful positions of Senate Appropriations Committee chair and head of Legislative Management.\n\nYet again, the danger to children are the very people who fear monger about trans people or immigrants or whatever else can deflect attention away from themselves.",
                "Wait does this one get sent to El Salvador too?",
                "Take one guess which party he represented…",
                "Yes.  He was a Republican.\n\nAnd a school counselor.",
                "Republican anti-abortion activist Howard Scott Heldreth is a convicted child rapist in Florida.\n\nRepublican County Commissioner David Swartz pleaded guilty to molesting two girls under the age of 11 and was sentenced to 8 years in prison.\n\nRepublican judge Mark Pazuhanich pleaded no contest to fondling a 10-year old girl and was sentenced to 10 years probation.\n\nRepublican anti-abortion activist Nicholas Morency pleaded guilty to possessing child pornography on his computer and offering a bounty to anybody who murders an abortion doctor.\n\nRepublican legislator Edison Misla Aldarondo was sentenced to 10 years in prison for raping his daughter between the ages of 9 and 17.\n\nRepublican Mayor Philip Giordano is serving a 37-year sentence in federal prison for sexually abusing 8- and 10-year old girls.\n\nRepublican campaign consultant Tom Shortridge was sentenced to three years probation for taking nude photographs of a 15-year old girl.\n\nRepublican racist pedophile and United States Senator Strom Thurmond had sex with a 15-year old black girl which produced a child.\n\nRepublican pastor Mike Hintz, whom George W. Bush commended during the 2004 presidential campaign, surrendered to police after admitting to a sexual affair with a female juvenile.\n\nRepublican legislator Peter Dibble pleaded no contest to having an inappropriate relationship with a 13-year-old girl.\n\nRepublican activist Lawrence E. King, Jr. organized child sex parties at the White House during the 1980s.\n\nRepublican lobbyist Craig J. Spence organized child sex parties at the White House during the 1980s.\n\nRepublican Congressman Donald “Buz” Lukens was found guilty of having sex with a female minor and sentenced to one month in jail.\n\nRepublican fundraiser Richard A. Delgaudio was found guilty of child porn charges and paying two teenage girls to pose for sexual photos.\n\nRepublican activist Mark A. Grethen convicted on six counts of sex crimes involving children.\n\nRepublican activist Randal David Ankeney pleaded guilty to attempted sexual assault on a child.\n\nRepublican Congressman Dan Crane had sex with a female minor working as a congressional page.\n\nRepublican activist and Christian Coalition leader Beverly Russell admitted to an incestuous relationship with his step daughter.\n\nRepublican congressman and anti-gay activist Robert Bauman was charged with having sex with a 16-year-old boy he picked up at a gay bar.\n\nRepublican Committee Chairman Jeffrey Patti was arrested for distributing a video clip of a 5-year-old girl being raped.\n\nRepublican activist Marty Glickman (a.k.a. “Republican Marty”), was taken into custody by Florida police on four counts of unlawful sexual activity with an underage girl and one count of delivering the drug LSD.\n\nRepublican legislative aide Howard L. Brooks was charged with molesting a 12-year old boy and possession of child pornography.\n\nRepublican Senate candidate John Hathaway was accused of having sex with his 12-year old baby sitter and withdrew his candidacy after the allegations were reported in the media.\n\nRepublican preacher Stephen White, who demanded a return to traditional values, was sentenced to jail after offering $20 to a 14-year-old boy for permission to perform oral sex on him.\n\nRepublican talk show host Jon Matthews pleaded guilty to exposing his genitals to an 11 year old girl.\n\nRepublican anti-gay activist Earl “Butch” Kimmerling was sentenced to 40 years in prison for molesting an 8-year old girl after he attempted to stop a gay couple from adopting her.\n\nRepublican Party leader Paul Ingram pleaded guilty to six counts of raping his daughters and served 14 years in federal prison.\n\nRepublican election board official Kevin Coan was sentenced to two years probation for soliciting sex over the internet from a 14-year old girl.\n\nRepublican politician Andrew Buhr was charged with two counts of first degree sodomy with a 13-year old boy.\n\nRepublican politician Keith Westmoreland was arrested on seven felony counts of lewd and lascivious exhibition to girls under the age of 16 (i.e. exposing himself to children).\n\nRepublican anti-abortion activist John Allen Burt was charged with sexual misconduct involving a 15-year old girl.\n\nRepublican County Councilman Keola Childs pleaded guilty to molesting a male child.\n\nRepublican activist John Butler was charged with criminal sexual assault on a teenage girl.\n\nRepublican candidate Richard Gardner admitted to molesting his two daughters.\n\nRepublican Councilman and former Marine Jack W. Gardner was convicted of molesting a 13-year old girl.\n\nRepublican County Commissioner Merrill Robert Barter pleaded guilty to unlawful sexual contact and assault on a teenage boy.\n\nRepublican City Councilman Fred C. Smeltzer, Jr. pleaded no contest to raping a 15 year-old girl and served 6-months in prison.\n\nRepublican activist Parker J. Bena pleaded guilty to possession of child pornography on his home computer and was sentenced to 30 months in federal prison and fined $18,000.\n\nRepublican parole board officer and former Colorado state representative, Larry Jack Schwarz, was fired after child pornography was found in his possession.\n\nRepublican strategist and Citadel Military College graduate Robin Vanderwall was convicted in Virginia on five counts of soliciting sex from boys and girls over the internet.\n\nRepublican city councilman Mark Harris, who is described as a “good military man” and “church goer,” was convicted of repeatedly having sex with an 11-year-old girl and sentenced to 12 years in prison.\n\nRepublican businessman Jon Grunseth withdrew his candidacy for Minnesota governor after allegations surfaced that he went swimming in the nude with four underage girls, including his daughter.\n\nRepublican director of the “Young Republican Federation” Nicholas Elizondo molested his 6-year old daughter and was sentenced to six years in prison.\n\nRepublican benefactor of conservative Christian groups, Richard A. Dasen Sr., was charged with rape for allegedly paying a 15-year old girl for sex. Dasen, 62, who is married with grown children and several grandchildren, has allegedly told police that over the past decade he paid more than $1 million to have sex with a large number of young women\n\nDennis Hastert served as Republican Speaker of the House (so, 3rd in line for the Presidency) for all 8 years of W. Bush’s two terms. He also sexually molested at least 5 boys when he was a HS wrestling coach, all of them underage with the youngest victim being 14. The victims only finally saw justice when Hastert was caught by the FBI trying to falsify payments for hush money.\n\nDonald Trump walked into Miss Teen USA change rooms with girls as young as 14 changing. 26 women have spoken publicly about Trump’s pattern of sexual assualt. In 2023, he was found legally liable for the rape of E. Jean Carroll by unanimous jury\n\nAnton “Tony” Lazzaro, a former Republican donor and political strategist from Minnesota, was convicted in March 2023 on federal charges of sex trafficking minors. He was found guilty of conspiring to recruit and pay teenage girls, aged 15 and 16, for sex between May and December 2020. In August 2023, Lazzaro was sentenced to 21 years in prison for these offenses.\n\nPrior to his arrest, Lazzaro was a prominent figure in Minnesota Republican circles, donating over $270,000 to various Republican campaigns and political committees. His indictment led to significant turmoil within the Minnesota Republican Party, culminating in the resignation of then-party chair Jennifer",
                "sick fuck, rot in hell",
                "Trump will pardon him and invite him to Mar-a-Lago.",
                "So, why is it that Republican isn’t in the forefront? I’d get it if it weren’t pertinent information. But Child SA and Republicans go together like peanut butter and jelly.",
                "Imagine going to the federal pen for pedophilia at 81. This is not the way to spend your golden years...."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Copper prices surge to record high amid tariff anxiety",
            "external_url": "https://www.cnn.com/2025/03/26/investing/copper-record-high-tariff-anxiety/index.html",
            "upvotes": 711,
            "date": "03/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2202952611.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Yeah. Some billionaires just made more money.",
                "> Copper prices have outpaced gold, which has gained 16%, and far outpaced the major US stock indexes this year. \n\nSo, TINA...to the crackhead strat of pulling copper pipes from abandoned houses.\n\nTrump's America, everyone.",
                "Oh I get it now. This is to curb inflation. See… if copper is expensive then pennies can buy more goods. There are 100 pennies in a dollar, so that must be true for paper dollars too. and boom national debt is gone! \n\nThere is the plan folks!",
                "#Copper’s on Fire as Trump Tariff Talk Sparks Record-Breaking Price Surge\n\nCopper, usually the quieter cousin to gold in the metals world, has suddenly stolen the spotlight. Prices for the red metal have rocketed to an all-time high in New York, fuelled by whispers that President Donald Trump may slap tariffs on copper imports far sooner than markets had expected.\n\nTraders had been banking on autumn for any big changes, but reports on Wednesday suggested tariffs might land within weeks. That was all the spark Wall Street needed. Copper futures leapt to an eye-watering $5.374 per pound before cooling slightly to settle at $5.24, still a record. For context, copper has surged 30 per cent this year alone, outpacing even gold, which is having a strong year itself. The stock markets, meanwhile, are still playing catch-up.\n\nThe surge is being driven less by traditional demand and more by panic buying. US firms, anxious to get ahead of any new import charges, are snapping up copper as quickly as they can. Analysts believe around 500,000 tons are being shipped to American ports this month, a massive jump from the usual 70,000 tons. Goldman Sachs thinks that figure could rise by another 200,000 tons in April.\n\nIt’s a classic case of buy now, worry later. Traders are front-running the tariffs, trying to stockpile before prices go even higher. As one analyst put it, the mere suggestion of tariffs has sent copper into a frenzy. The result is a growing gap between copper prices in New York and London, where the metal has also climbed but not nearly as dramatically.\n\nCopper may not be classed as a rare earth mineral, nor does it feature among the US’s 50 “critical minerals”, but it remains vital. It is used everywhere from electronics to energy systems to national defence. The US Department of Energy even called it a “critical material for energy” back in 2023. With such wide-ranging uses, any disruption to supply has ripple effects.\n\nInterestingly, this price spike is not being driven by ordinary consumer demand. It is more about shifting stockpiles and geopolitical chess moves. Trump recently signed an executive order to investigate the national security risks of importing copper, a move that many see as paving the way for yet another tariff.\n\nThe frenzy is already having global consequences. Analysts warn that the US copper grab could leave other countries short, and with the world expected to meet only 70 per cent of copper demand by 2035, that is a real concern. Throw in a recent production cut from Glencore in Chile, and the copper market looks increasingly tight.\n\nDespite the buzz, not everyone is convinced the price surge will last. Once the stockpiling rush subsides, we may see a correction. But for now, copper is having its moment, and the markets are watching every move from the White House with bated breath.",
                "The copper was stolen out of the parking lot lights at my gym twice in one year. It’s about to happen again. Hopefully the weld the access covers in preparation.",
                "Ea Nasir ready to make some deals.",
                "So much for brining house prices down.",
                "So many vacant, overpriced apartments in the Portland metro area. So many homeless people. Sounds like a new opportunity for entrepreneurial-minded homeless people to make a fast dollar.",
                "Time to buy copper of low quality",
                "Ea-nāṣir would be slaying it right now."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Private Data and Passwords of Senior U.S. Security Officials Found Online",
            "external_url": "https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7?sara_ref=re-so-app-sh",
            "upvotes": 18140,
            "date": "03/26/2025",
            "thumbnail": "https://cdn.prod.www.spiegel.de/images/87ac326a-da00-4ba1-b643-d410f8595cbe_w1200_r1.778_fpx60.66_fpy45.jpg",
            "top_comments": [
                "The clown show continues.\n\nI watch in amazement as the US won the cold war and now a bunch of village idiots absolutely wreck national security and long standing alliances in a couple of weeks.",
                ">To do so, the reporters used commercial people search engines along with hacked customer data that has been published on the web. Those affected by the leaks include National Security Adviser Mike Waltz, Director of National Intelligence Tulsi Gabbard and Secretary of Defense Pete Hegseth.  \n>  \n>Most of these numbers and email addresses are apparently still in use, with some of them linked to profiles on social media platforms like Instagram and LinkedIn. They were used to create Dropbox accounts and profiles in apps that track running data. There are also WhatsApp profiles for the respective phone numbers and even Signal accounts in some cases.  \n>  \n>[...]  \n>National Intelligence Director Gabbard was seemingly more careful with her data than her two male colleagues. She apparently had her own data blocked in the commercial contact search engines that contained the data of Hegseth and Waltz. But her email address was to be found on WikiLeaks and Reddit.  \n>  \n>Gabbard’s email address is available in more than 10 leaks. One of those also contains a partial telephone number, which, when completed, leads to an active WhatsApp account and a Signal profile.  \n>\n>src: https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7  \n  \nI can see quite a few people being very interested in exploiting this.",
                "😂😂😂😂😂\nOf course they are. Why would anyone with empathy or common sense expect competence from this administration???",
                "I bet Trump has a sticky note with passwords on his computer monitor",
                "*Hostile intelligence services could use this publicly available data to hack the communications of those affected by installing spyware on their devices. It is thus conceivable that foreign agents were privy to the Signal chat group in which Gabbard, Waltz and Hegseth discussed a military strike.*\n\nThe headlines come fast and furious from T's desk, but the incompetence of the Admin seems equally propelled.",
                "You just know the clowns in Trump's cabinet answer phishing emails all the time and have probably already infected multiple government systems with malware.",
                "We are seeing the fall of America in real time. Thanks Republicans!",
                "Is now a good time to remind everyone that during the 2016 DNC hack, the Republicans were also hacked but WikiLeaks chose not to release any of that information? That decision led the public to believe that Democrats were insecure with how they handle their data while Republicans were not - which of course we all know now (and knew then, tbh) is the exact opposite.",
                "The soundtrack of the US Government is \"Yackety Sax\"",
                "Maga - Morons Are Governing America."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Person in Ohio dies of rabies after contracting virus from organ transplant",
            "external_url": "https://www.whio.com/news/local/person-dies-rabies-after-contracting-virus-organ-transplant/HMS5STBDHZESJJ7FU6464OMN3I/",
            "upvotes": 29495,
            "date": "03/26/2025",
            "thumbnail": "https://cmg-cmg-tv-10040-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fcmg%2FYPMX5TX5QVGJJLZSDGUPWR7NGQ.jpg?auth=612d61eb069c04a50f81fce2778338c3c1cbaaf0f16c60a6d2c3cbff7f510de5&width=1200&height=630&smart=true",
            "top_comments": [
                "Wtf. So did the donor die of rabies too or just somehow died before the rabies set in and they didn’t know? So sad",
                "Didn't this happen in an episode of Scrubs?",
                "from the article:\n\n26 March 2025\n\nLUCAS COUNTY — A person died from rabies after receiving a transplanted organ in Lucas County earlier this year:\n\n>The recipient, who had undergone a kidney transplant in December, contracted the viral disease through the donated organ, according to the Toledo-Lucas County Health Department, WTOL reported.\n\n>As the recipient was from Michigan, Michigan’s Department of Health and Human Services worked with the Ohio Department of Health and the Centers for Disease Control and Prevention to investigate the case.\n\n>It marks the first human case of rabies in Michigan since 2009, according to WTOL.\n\n>No additional individuals are at risk of rabies exposure, according to the CDC.\n\n>Kara Steele, a representative from Life Connection of Ohio, could not comment on the specific case but explained to WTOL that a donor risk assessment interview is conducted before any organ donation.\n\n>The identities of both the recipient and the donor have not been released.\n\n>The facility where the transplant took place has also not been disclosed. \n\n>However, according to the University of Toledo Medical Center’s website, it is the only organ transplant center in northwest Ohio.\n\n>Fewer than 10 people in the United States die from rabies each year, according to the CDC.",
                "That's some fuck you in particular level shit.",
                "There are other viruses where this has happened. There was a case that a donor got LCMV from his pet hamster and got into an accident.  7 out of 8 donors who go his organs died of LCMV, which is not considered wildly dangerous in humans.\n\nhttps://www.nejm.org/doi/full/10.1056/NEJMoa053240",
                "Maybe this is a question for a different subreddit.\n\nIf they figured this out shortly after the transplant could the recipient be saved by getting the rabies vaccine?    I am wondering if this is similar to having been bitten... it is in your body but is hasn't gotten into... the nerves(?) enough that the vaccine can help.  Maybe a transplant would be too much rabies all at once or in the wrong part of your body for the rabies treatment to be effective.",
                "first comment on the article:\n\nsandytratt1 hour ago\n\nIn 2012 at this same hospital they threw a donor kidney into the trash during a transplant surgery. The poor woman eventually managed to get her transplant months later but the organ accidentally thrown out had been a perfect match donated by her brother.",
                "That is absolutely tragic. And one of THE WORST ways to die :( \n\nImagine having your brain literally liquified in real-time, as you lose all comprehension of the people and world around you, except for intense and overwhelming fear and confusion.",
                "The donor had rabies, but died of something else? This is really bizarre.",
                "Wow that seems insanely unlucky. You get an organ transplant from someone who was so unlucky they caught rabies and then died from something else before developing symptoms (usually happens in months rarely years) and that something else was something that let them donate organs!"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Turkish student at Tufts University detained, video shows masked people handcuffing her",
            "external_url": "https://apnews.com/article/tufts-student-detained-massachusetts-immigration-6c3978da98a8d0f39ab311e092ffd892",
            "upvotes": 11718,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What are you even supposed to do in this case? Masked unidentified men claiming to be police with unmarked vehicles come to try to take you. Would calling 911 even help? What about self defense? ",
                "Gestapo level shit.  Her lawyer has no idea where she is.",
                "this is INSANE! the article said she wasn't an activist or member of any pro-Palestinian organization. She simply wrote an op-ed article for her campus paper, not even a national media outlet. She didn't organize protests or sit-ins or never was accused of harrassing or accosting Jewish students on campus. And the scary thing about it is that she hasn't even been accused of any crime. Her grad student visa (in the psychology department no less) was terminated on the whims of the Administration.",
                "People need to stop being complacent about this kind of stuff. They are detaining people with no due process. It's essentially kidnapping people who don't agree with the government's foreign policies. Whatever the fuck happened to free speech. They allow Nazis to walk around waving Swastika flags, but someone who criticizes Israel gets arrested like this? The double standards and hypocrisy of this government is pathetic. I wouldn't be surprised if the people who criticize Elon and Tesla end up getting kidnapped like this too.",
                "Why are they given till Friday to provide information?\n\nI understand if people disagree with someone’s opinion but they are literally violating the first amendment. And before you say she’s not a us citizen, the first amendment applies to all humans. If they can prove she violated some other law then prove it! Due process exists to protect the government and its people. It’s sad that there are Americans who don’t understand this and worse that there are Americans willing to participate.",
                "Individuals here on visas should start considering wearing AirTags in the undergarments so their whereabouts can be traced to some extent. Phones are the first thing they go for.",
                "Trumps secret police. Extinguish all freedom of speech.",
                "So pretend for a moment that you get rolled up on by a group of masked people in street garb that jump out of a car an accountant would be driving. And you also have a gun...\n\nIf you start blasting when they try to kidnap you, how does that ultimately play out?",
                "Unfortunately this is going to give some people evil ideas. You could iterally have 4 or 6 guys walk up to a woman, say they are from ICE and kidnap a person. Just put on a mask, and add a halfway believable badge from your neck....the entire video is less than 2 minutes. How many times a day does this happen?",
                "“First they came for” shit, on stanza two already."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Trump places 25% tariff on imported autos, expecting to raise $100 billion in tax revenues",
            "external_url": "https://apnews.com/article/autos-tariffs-trump-tax-imports-ford-gm-e53823ef7bbb7b3c46d11eca90aaa638",
            "upvotes": 6863,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Didn't he say tariffs aren't a tax?",
                "Last year, my parents bought a new car, installed solar panels, upgraded their phones and laptops, and bought a new TV, all because they thought Trump might win and implement tariffs and these things would become more expensive. \n\nThey also voted for Trump.",
                "Boy that’ll put a nice dent in the **$500 billion** in projected tax reduction next year all because he doesn’t want to fund the IRS adequately.",
                "tax revenues from whom exactly?",
                "Americans mad at Biden because stuff's too expensive, elect a guy who adds a 25% tax on everything.\n\nDidn't think the leopards would eat *their* face.",
                "Does this mean it’ll cost more to buy cars? And that extra money will go to the US government, so they can lower the taxes of billionaires. Thats kinda lame.",
                "Another scandal to cover up with more bad governance. This regime is really a human fucking centipede of government",
                "Oof. This is going to back fire.",
                "\"The United States last year imported nearly 8 million cars and light trucks worth $244 billion. Mexico, Japan and South Korea were the top sources of foreign vehicles. Imports of auto parts came to more than $197 billion, led by Mexico, Canada and China, according to the Commerce Department.\"\n\nThis man is going to war with the world and the next President will be left with a first term cleaning up all of this non-sense.",
                "Fool. Everyone knows that he should place a 50% tariff to generate $200 billion in tax revenues."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Trump signs election order calling for proof of U.S. citizenship to vote",
            "external_url": "https://www.reuters.com/world/us/trump-signs-election-order-calling-proof-us-citizenship-vote-2025-03-26/",
            "upvotes": 40610,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I don't understand, aren't only citizens allowed to vote?",
                "Considering this isn’t a law, that voting is up to the states, this is mostly a Big Mac fueled fart in the wind.",
                "Meanwhile, Elon came over on a student visa. Stayed after it had expired… and now has more power than any US citizen",
                "Oh hey ... those people who were really upset about overreach of the federal government. Are you all gonna be mad about Trump taking away a right reserved for the states?",
                "States rights except when it is against Trumps agenda",
                "They aren't doing this because they expect States to follow the requirements. They are doing it because they expect *certain* states *won't*.\n\nThis is setting up a pretext for invalidating legal votes from registered voters, American citizens, specifically from blue States. \n\nThis needs to be heavily challenged in the courts and we should all hope it is shot down, because hell will break loose if the will of the people of entire States is disregarded.",
                "Article I, Section 4, Clause 1\n\n>The Times, Places and Manner of holding Elections for Senators and Representatives, shall be prescribed in each State by the Legislature thereof; but the Congress may at any time by Law make or alter such Regulations, except as to the Places of chusing Senators.\n\n\nStates or Congress.  The Executive have the power to do change state or federal laws.  This is yet another impeachable offense, yet congress is full of feckless cowards.",
                "I'd be ok with voter ID if everyone registered to vote was also given an ID for proof of identification.",
                "If they provide free, EASILY ATTAINABLE, federal ID for this purpose then I say go ahead. We all know they won’t though",
                "Trump will announce that the 2028 election has too many security failures and declare a state of emergency over election interference early in the year. The election may be cancelled.\n\nWe are right in the middle of it, folks. This is not my random redditor theory, this is the discussion being held about Trump trying to subvert term limits and how he'll do it. Prepare your pitchforks now, you'll need them in a few years."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Brazil Supreme Court to put Bolsonaro on trial for alleged coup attempt",
            "external_url": "https://www.reuters.com/world/americas/brazil-top-court-justice-recommends-that-bolsonaro-stand-trial-alleged-coup-2025-03-26/",
            "upvotes": 7275,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Good job Brazil. I like it when people are held accountable for their actions.",
                "Wow, just imagine what we could have had if Merrick Garland hadn’t been an absolutely worthless piece of shit.",
                "That's wild, I thought you were supposed re-elect people who attempt coups...",
                "So South Korea and Brazil have better democracies than the United States.",
                "Accountability for actions?! What’s this nonsense!",
                "Good job brazil 👏🏾 this is what america shouldve done with our felon in chief",
                "Hey look, a real country with a functioning legal system.",
                "Brazil picking up a lot of ground against USA when it comes to accountability and corruption. What’s curious is that Brazil always copies American politics, but now are forging their own path. Good for them and I hope the crime rate gets fixed next.",
                "Thank you Merrick Garland, for showing the world the dangers of a pathetically weak judicial system.  May they learn from our incompetence. \n\nMerrick Garland will go down in history as the enabler of American Fascism .",
                "Brazil showing the world how is done. A great example."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "The Atlantic publishes additional trove of Signal messages with details of Yemen strike",
            "external_url": "https://www.cnn.com/2025/03/26/politics/the-atlantic-publishes-signal-messages-yemen-strike/index.html",
            "upvotes": 13868,
            "date": "03/26/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2204323444.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "So we already knew every single turd in the committee hearings yesterday straight-up lied, prompting The Atlantic to post the rest of the transcripts.\n\nPlease, Senate Intelligence Committee, lay it on them THICK today.",
                "The Trump admin trying to downplay this is the most pathetic thing they've done in months. 'only the best people'. All Trump supporters are rubes.",
                "Looks like there was one responsible adult in this mess.\n\n>  “We did redact one piece of information because we felt, on our own, that we felt it was best to do. And the CIA asked us, but, you know, at a certain point, the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves,” \n\n-- Jeffrey Goldberg\n\n> “Weather is FAVORABLE. Just CONFIRMED w/CENTCOM we are a GO for mission launch,” Hegseth wrote. \n\n> This entire story was another hoax written by a Trump-hater who is well-known for his sensationalist spin,” White House press secretary Karoline Leavitt said \n\n> “You’re talking about a deceitful and highly discredited so-called journalist who’s made a profession of peddling hoaxes time and time again,” Hegseth said. \n\n> Britt  Hume was quick to point out the glaring flaw in Hegseth’s excuse: It wasn’t a hoax, as the National Security Council confirmed that the messages accidentally sent to Goldberg were legit:",
                "Goldberg is being incredibly patriotic here, he is taking on a great personal risk against a regime that controls the most powerful government in the world. This regime is made up of truly incompetent bad faith actors, we should all remember that moving forward, whatever happens- these people running our country are incredibly dumb. They can be defeated.",
                "Not a day goes by that this clown fiesta of an administration fails to blow my mind.",
                "Funny how the GOP used to have fake outrage fits out of things 1,000 times smaller than this.",
                "I don't even get what the point of him sharing all these details in real time with that group chat to begin with? Just send a recap when it's over. It's like he was trying to show off or some shit",
                "*\"the administration is saying that there’s nothing classified or secret or sensitive in these so at a certain point, I just felt, you know, let our readers decide for themselves\"*\n\nBrilliant. Absolutely calling their bluff.",
                "Already lots of bots on twitter trying to claim this is all fine. Not sure what else I expected.",
                "I do find it so funny that half of these clowns will wax for hours about how much money we burned in Ukraine or whatever, but these strike packages are big emoji worthy after burning whatever the cost in munitions, fuel and logistics were."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Exclusive: DOGE staffer, 'Big Balls', provided tech support to cybercrime ring, records show",
            "external_url": "https://www.reuters.com/world/us/doge-staffer-big-balls-provided-tech-support-cybercrime-ring-records-show-2025-03-26/?utm_source=reddit.com",
            "upvotes": 38636,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ok, as a reminder to everyone about \"Big Balls\".  \n\nHe is the grandson of a KGB spy.\n\nHe was fired from an internship at a cyber security company for leaking company info to a competitor. \n\nAnd now we know he's involved with crime rings.",
                "He still does, but he used to, too.",
                "The people involved with modifying code on our most sensitive electronic systems are not only just fresh out of school, but are sketchy as hell. \n\nAs a cybersecurity professional, I'm terrified. \n\nMost people can't comprehend how bad this stuff is.\n\nEdit: \n\nHere's a fun thought experiment:\n\n1) Look at the cybersecurity actions taken by this administration. \n2) Think about what actions a compromised President/Cabinet would take regarding cybersecurity. \n3) Ask yourself, what actions would a foreign agent of Russia take that ARE ANY DIFFERENT than what we all have seen up to this point. \n\nEducate yourself! The ONLY way ANY of this makes sense is with this context. Krasnov is destroying this country.\n\nhttps://www.csoonline.com/article/3829710/firing-of-130-cisa-staff-worries-cybersecurity-industry.html/amp/\n\nhttps://www.cybersecuritydive.com/news/dhs-disbands-advisory-board-csrb/737976/\n\nhttps://gizmodo.com/trumps-defense-secretary-hegseth-orders-cyber-command-to-stand-down-on-all-russia-operations-2000570343\n\nhttps://www.euronews.com/my-europe/2025/03/13/fact-checking-online-claims-that-donald-trump-was-recruited-by-the-kgb-as-krasnov",
                "You mean, the guys who use ICE to run the country like a mob, hire people from the underworld?",
                "If you want to use criminal tactics to be successful criminals, hire criminals.",
                "[deleted]",
                "He will work for any cybercrime group. He has chosen DOGE in this case.",
                "SOB ... 28 years, 3 time polygraphed ... friends I hadn't seen in years contacted by Suits & Ray-Bans and they let this little fucker have free reign over entire CRITICAL systems???\n\nI'm fucking pissed.\n\nTHIS should get people out in the streets!",
                "We already know he's working with Elon and Trump. Nothing new.",
                "This is not the level of professionalism we expect from Big Balls."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "03/27/2025 12:16:06 UTC"
}