{
    "posts": [
        {
            "category": "HOT",
            "title": "Cigma denies man life-saving lung transplant shortly before scheduled operation.",
            "external_url": "https://abc7.la/44oVLpE",
            "upvotes": 11195,
            "date": "05/09/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16348273_050625-kabc-11pm-lung-transplant-denial-vid.jpg?w=1600",
            "top_comments": [
                "\"Our coverage guidelines are grounded in national clinical standards to help ensure the best possible outcomes for patients.\"\n\n…and we’ve decided that the best possible outcome for this patient would be for him to just fucking die already.  ",
                "A man battling stage 4 lung cancer was preparing to fly across the country for a life-changing double-lung transplant when his insurance company denied him coverage.",
                "I had a knee surgery denied because I didn’t try not having knee surgery long enough. My meniscus was shredded and stuck between the joint. Fuck these ghouls.",
                "I’m enjoying the fact that several people are calling it Cigma because the title had a typo",
                "Cigna has done this *exact same thing before* in 2023, but changed their mind after a social media outcry: https://clearhealthcosts.com/blog/2023/11/cigna-denies-transplant-then-approves-after-social-media-campaign/\n\nUnfortunately the lungs were no longer available for transplant after they changed their mind. She did eventually get the transplant and was reported to be cancer free several months later in 2024. \n\nSupporters of the woman who was denied care emailed the CEO directly: david.cordani@cigna.com.",
                "For the record, the company is Cigna, not Cigma.  It’s the same company that *my* company uses to provide our health insurance with the $5,000 deductible.  It’s fucking worthless.",
                "The U.S. is alone among wealthy nations in making its citizens fear the doctor financially. Other countries may struggle with wait times or regional gaps in access, but not the constant anxiety over whether care will bankrupt you or be denied all together.",
                "Who’s the Cigna CEO again? ",
                "Just tell 'em you'll pay cash. Then, pat your gown and say, \"oops, I guess my wallet is in the car still\" and offer to grab it quick after the surgery.",
                "Not surprised. My mother's insurance denied her radiation for her cancer today. If I knew their name I would name and shame."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Two arrested after neighbors try to stop ICE agents from detaining Worcester mother",
            "external_url": "https://www.boston.com/news/local-news/2025/05/08/two-arrested-after-neighbors-try-to-stop-ice-agents-from-detaining-worcester-mother/",
            "upvotes": 13778,
            "date": "05/09/2025",
            "thumbnail": "https://bdc2020.o0bc.com/wp-content/uploads/2025/05/Police_Civil_Rights_Violations_53988-681d42cba076d-768x432.jpg",
            "top_comments": [
                "Something tells me it's going to be a hot, hot summer.",
                "\"Terrible things are happening outside. At any time of night and day, poor helpless people are being dragged out of their homes. They’re allowed to take only a knapsack and a little cash with them, and even then, they’re robbed of these possessions on the way. Families are torn apart; men, women and children are separated. Children come home from school to find that their parents have disappeared. Women return from shopping to find their houses sealed, their families gone.\" - Anne Frank, The Diary of a Young Girl.",
                "I like how this neighborhood is full of people that are ride-or-die, should serve as an example for us all. I want to see some videos of this.",
                "They're charging her with assault and battery with a dangerous weapon for throwing a drink at the cops. What a fucking crock of shit.",
                "Not unprecedented. [Boston, 1834](https://newenglandhistoricalsociety.com/boston-slave-riot-1854/)",
                "Video of it here:\n\n[https://www.reddit.com/r/PublicFreakout/comments/1ki292o/crowd\\_in\\_worcester\\_ma\\_tries\\_to\\_interfere\\_with\\_ice/](https://www.reddit.com/r/PublicFreakout/comments/1ki292o/crowd_in_worcester_ma_tries_to_interfere_with_ice/)\n\nIt's a chaotic scene, but it looks like one of the arrests is happening as they pull a woman away. Crazy how many cops they had out there--totally intimidating and unnecessary.",
                "This is how “hiding people in the attic” began…",
                "May they be blessed forever doing what was right when it was not easy.",
                "Getting arrested for protecting the people who are being illegally detained and sent to concentration camps by gestapo sure sounds fucking familiar. This is some straight up Anne Frank shit.",
                "My great grandmother once held off US Army troops with a broom to buy time for her Japanese neighbors to put their house in trust, thus keeping it out of government hands; they were some of the few who had a home to come back to after the war thanks in part to her. \n\nI hope that I'll be as brave as she was and these people are when the time comes."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "UnitedHealthcare sued by shareholders over reaction to CEO's killing",
            "external_url": "https://www.cnbc.com/2025/05/08/unitedhealthcare-sued-by-shareholders-over-reaction-to-ceos-killing.html",
            "upvotes": 13444,
            "date": "05/08/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108071136-1733320864176-horizontal-Brian-Thompson.png?v=1733766690&w=1920&h=1080",
            "top_comments": [
                "The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\n\nThat's all you really need to know about this company and its shareholders.",
                "From the Article \n\n> A group of investors sued UnitedHealthcare Group on Wednesday, accusing the company of misleading them after the killing of its CEO, Brian Thompson.\n\n> The class action lawsuit — filed in the Southern District of New York — accuses the health insurance company of not initially adjusting their 2025 net earning outlook to factor in how Thompson’s killing would affect their operations.\n\n> The investors described this as “materially false and misleading,” pointing to the immense public scrutiny the company and the broader health insurance industry experienced in the wake of Thompson’s killing.\n\n> The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.",
                "I am wondering what this means\n\n\"argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\"\n\nAre they angry they can't be assholes? Am I missing something?",
                "I suspect the problem. causing the loss of income, is not because the CEO is dead, but because of the bad publicity that people now see about United Healthcare.",
                "Who are these shareholders and where do they live? So we can avoid them at all costs.",
                "> On Dec. 3 — a day before Thompson was fatally shot — the company issued guidance that included net earnings of $28.15 to $28.65 per share and adjusted net earnings of $29.50 to $30.00 per share, the suit notes. And on January 16, the company announced that it was sticking with its old forecast.\n\n> The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\n\n\nThey are arguing that UnitedHealth should have adjusted their earnings forecast in response to the shooting.",
                "Why would they phrase it as anti-consumer instead of something like “cost preserving“ tactics, or “waste reduction“ tactics like they would usually do. Does it help their case to phrase it that way? Is it directly referencing something UHC did after the ceo was killed?",
                "Sure is a bold move to see someone killed for anti-consumer tactics and sue because they weren't anti-consumer enough. Someone feels too safe",
                "And I thought the new pope would be the least interesting story of the day \n\n>The legal defense fund for Mangione surpassed the $1 million mark in donations on Tuesday\n\nBut at least it has a happy ending",
                "> The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\n\nr/nottheonion"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "The Catholic Church has elected Cardinal Robert Prevost as pope",
            "external_url": "https://www.houstonpublicmedia.org/npr/2025/05/08/nx-s1-5385327/the-catholic-church-has-elected-cardinal-robert-prevost-as-pope/",
            "upvotes": 28660,
            "date": "05/08/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2648x1766+0+0/resize/2648x1766!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc4%2Fbc%2Ff80295a6417489396fcd93f99957%2Fap25128626700383.jpg",
            "top_comments": [
                "From [CBS News last week](https://www.cbsnews.com/news/who-will-be-the-next-pope-list-of-possible-candidates/):\n\n> Chicago-born Cardinal Robert Prevost is seen as having many of the qualities desired in a pope, and if elected, he would become the first U.S. pope in the church's history.\n\n> Prevost is the head of the church's Dicastery for Bishops, meaning he oversees the selection of new bishops. It's a powerful position, and for any cardinal electors who may be turned off by his American nationality, it's not his only one. Prevost is a dual citizen of the U.S. and Peru, where he served for many years.\n\n> Overall, **he's considered a centrist**, but on many social issues he's seen as progressive, embracing marginalized groups like Francis, who championed migrants and the poor. But Prevost opposes ordaining women as deacons, for instance, so he's seen as conservative on church doctrine.\n\n> His age could also be a factor — at 69 some may consider him too young to hold the church's highest office.",
                "He is a staunch advocate for climate change action and environmental issues",
                "From Chicago? Da Bears have God on their side now!",
                "Took Shadeur Sanders three days to get drafted but the pope was selected in two",
                "Deep dish pizza is about to be the national food of the Vatican.",
                "First American. Pope Leo XIV",
                "WOW. This was COMPLETELY unexpected. He wasn't even talked about as one of the frontrunners. Just to put it into perspective - he had 1-2% betting chance before today",
                "This could be a Pope John Paul II situation, where the Pope is elected from a country specifically to contrast and oppose that country's particularly worrisome regime",
                "For those wondering, it's sort of a continuation of the previous Pope's idealogical leanings - champions the poor/migrants but is against ordaining women. He's also a dual US-Peru citizen.",
                "Papal names are often chosen for a reason or to send a message, so it's good to look at what other popes with that name did, as it can often give a hint at the new pope's views. In this case, Leo XIII was famous for issuing one of the Catholic Church's most famous edicts, ***Rerum novarum***, which criticized capitalism for its tendency toward greed, concentration of wealth, and mistreatment of workers. It strongly advocated for organizations like labor unions. At the same time, it also criticized socialism for rejecting private property and the under-emphasis of the importance of the individual."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Nearly 60 cases dismissed due to corruption in Alabama police department",
            "external_url": "https://apnews.com/article/hanceville-alabama-police-department-corruption-grand-jury-6ed5dadf25bc6b2b38d0b755e6e71cf2",
            "upvotes": 3868,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The grand jury determined that 58 felony criminal cases had been tainted by corruption in the Hanceville Police Department in northern Alabama, after four officers and the police chief were indicted on a variety of charges related to mishandling or removing evidence from the department’s evidence room.\n\nSeems like the evidence room was their junk drawer. \n\n>There was also a wide array of evidence that appeared to be missing, including firearms, cash and illicit drugs.\n\nI wonder if they were drug tested before they were fired. I wonder if they got jobs down the road already.",
                "Corruption in an Alabama police department? No way....",
                "*most of the cases were drug-related and only a few were personal crimes with victims.*\n\nHow does a town of 3,200 pop have 60 felony cases pending??  I would guess that most would have to be trumped up charges (against mainly black residents, i'm guessing)",
                "Just a few bad apples, I'm sure.",
                "No worries, Trump will pardon them, like the giant douche he is",
                "All these small maga towns are run by crooks",
                "That's a lot of bad apples",
                "The only part of this I find surprising is that any Alabama or current federal court would consider blatant corruption and/or falsified evidence grounds for dismissal, rather than business as usual.",
                "Im surprised anything happened. At least they are trying",
                "Are they going to return all of the cash & property they seized from the victims?  Or is that gone too?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US will stop tracking the costs of extreme weather fueled by climate change",
            "external_url": "https://apnews.com/article/climate-weather-service-disaster-flood-wildfire-cost-53b9d8f5dc8563e2e70804d9c67b9404",
            "upvotes": 6606,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I expect more insurance companies to pull out of states like Florida.",
                "Well, as all great businessmen know, if you stop tracking costs, the costs no longer exist. This means that Trump has effectively ended the costs of climate-change catastrophes, only a little bit after his first 100 days. Amazing work.",
                "\"The US is choosing to bury its head in the sand so it doesn't know about things and can then avoid dealing with them.\"\n\nWe may need to change the national bird to the ostrich.",
                "This was the same approach that Trump wanted to use with covid. He seemed to think that it wouldn't be a problem if we just stopped testing for it.",
                "Have a friend who just got laid off at NOAA. He says they're getting to delete decades of climate data so they support their rhetoric of \"drill baby drill\" and similar. Literally setting back humanity decades.",
                "Just like the covid rates - if we stop the testing/reporting, the problem goes away. It's just like magic.",
                "this fucker needs to be stripped of his presidency and incarcerated (along with his regime) for the rest of his miserable life.",
                "That's fine, insurance will be collecting it on their own since you know... They are paying.",
                "Because they've realized that if some future leader suspends sovereign immunity and lets the US be sued for it, they are providing the data which will incriminate their heirs.",
                "So no FEMA or NOAA. Totally suck for all the states that have hurricane, tornadoes, floods or fires…oh wait that’s all of them!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Bill Gates to give away $200 billion by 2045, accuses Musk of harming world's poor",
            "external_url": "https://www.reuters.com/business/bill-gates-give-away-fortune-by-2045-200bn-worlds-poorest-2025-05-08/",
            "upvotes": 55145,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Reminder: Elon Musk once claimed homelessness was a conspiracy made up by the government.",
                "\"Yes, and what's your point?\" - Elon Musk\n\nWhen you grow up rich, you don't see poor people as unfortunate. You see them as lazy parasites. You also don't see working class people as the ones who make and do. You see them as unimaginative cowards. People who didn't have the guts to be entrepreneurs, and need to be punished for their failings. \n\nAt Musk and Trump's level, either you're the boss or you're the help. Chief Financial Officer? Head of counsel? Groundbreaking inventor? Fuck you, you're the help.",
                "*\"The picture of the world's richest man killing the world’s poorest children is not a pretty one,”*\n\nGates with an awesome slam of Musk for cutting the US Aid budget.",
                "Musk bragged he could end world hunger and has since then done absolutely nothing to benefit the world's most vulnerable. Bill actually puts his money out into the world in multiple ways. There are levels to this human thing.",
                "I looked up Steve Ballmer, Bill Gates right hand man back in the days and Clippers owner. \n\nBallmer is worth 127 Billion vs 112B for Gates. \n\nGates been giving away a lot of money even before this.",
                "Putting aside what I feel about billionaires in general, *if* we're going to have to have them around, I'd prefer they're more similar to Gates than to Musk.",
                "Anyone recall the time musk said money wouldn't solve the would hunger issues and like the UN or something called his bluff and submitted a open report on how the money would be spent to resolve said issue. And musk fell silent on the matter? Fun time's indeed.",
                "Good. Finally someone has the balls to speak up and show Musky weiner boy who knows what’s what.",
                "Musk will kill this planet just so he can colonize a different dead planet.",
                "Where is Musk anyway? Is already keeping a low profile."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Virginia teenager shot and killed by homeowner while recording TikTok prank video",
            "external_url": "https://www.nbcnews.com/news/us-news/virginia-teenager-shot-killed-homeowner-filming-tiktok-prank-video-rcna205218",
            "upvotes": 10587,
            "date": "05/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250506-Spotsylvania-County-virginia-teen-fatal-shooting-WRC-snip-ac-427p-b545f1.jpg",
            "top_comments": [
                "I’m surprised that doesn’t happen more often.",
                "At 3am? Yeah, I can see why the homeowner would think they were trying to break in.",
                "Oops. . .\n\nThe platforms need to demonitize these videos.  They're harassment.  A prank is putting googly eyes on all the photos in your mothers house or replacing the soap with potatoes.  It's not scaring the shit out of people or breaking the law.",
                "We've had teens do this to our house. They are not ringing the doorbell and running. They are full force hitting or kicking the front doors several times often until someone opens the door before they run. I live in a split level so they would also pound on the ground floor windows. \n\nWe basically staged a stake out one night. Saw them coming and called the cops. They got caught and we don't get \"ding dong ditched* anymore. \n\nThey're lucky we don't own any guns. I can 100% see these kids getting shot. It was terrifying.",
                "Similar thing just happened to our neighbor. The kids didn't just ding dong ditch tho. I have no idea what the viral tik Tok challenge is specifically, but these kids kicked in his storm door. Like he had to replace it. Then a month later, attempted to do it again. This time he was prepared, and proceeded to tackle one of the kids, and sat on him til the police arrived. He was furious and saw only red, and if they were a touch older, I wouldn't have been surprised for him to have pummelled them. They were 10 years old, and I think that was their saving grace. All these kids need to knock it off. Loss of life here is tragic. A lot of people are on edge these days, and I'm not surprised this happened. Terrible outcome",
                "\"The shooting happened around 3 a.m. Saturday, the Spotsylvania County Sheriff’s Office said in a news release. Deputies were sent to a home near McKenzie Lane in the Washington, D.C., suburb following a call for a residential burglary in progress, in which a resident had fired shots.\n\nBosworth and another person had gunshot wounds, the sheriff's office said. Bosworth was taken to the hospital, where he died from his injuries. The other person, a juvenile, was treated and released. A third juvenile with them was unharmed, authorities said.\n\nButler, 27, told investigators that he believed the teens were trying to break into his home, NBC Washington reported.\n\nAccording to a search warrant affidavit obtained by NBC News, one of the teens told detectives that they were recording ding-dong ditch pranks for a TikTok video, in which they ring people's doorbells and then run away. The teen said that they had been to a couple of homes in the neighborhood and that he was not familiar with the area.\"\n\nAt 3am? They decide it's a good idea to ring people's doorbells? Not saying they should have been shot but how dumb can people be???",
                "I remember playing ding dong ditch as a kid with some friends. Lived in a country area where homes were further apart. One of the homeowners fired a few shots off after we had ditched their home and were running away. We didn’t know if it was at us or in the air, but we def stopped playing after that day.",
                "You mean while kicking in his back door at 3 am?",
                "I have weird military-related PTSD that triggers when unexpected people come to my house. \n\nI’m ashamed to say I yelled at an old Jehova’s Witness woman once for coming back after I told her not to. The unadulterated pure white-hot panic I feel when a loud knock hits my front door gives me days of depression. \n\nSo… I get it. You don’t know what battles people fight in their private homes.",
                "to give some context this \"prank\" is common here where i live. this isn't simple ding dong ditch you guys simplify it. \n\nwhen it happened to us it was a group of four teens they rotated running  up to the door and kicking it. they know about the ring cameras and they know how to evade them. i was woken up at 3am with kids upstairs and my fight or flight kicked in guys. you don't have time to look on your ring. \n\nsometimes they also ring the doorbell but again many of these kids don't want to be identified so they cover their faces. again looking like a burglar. \n\ni'm not condoning the shooting i'm just setting some context for people to process what happened on both sides. \n\nit has shaken me and my family up. it's been almost a year and i still get ptsd and we have to check all the doors are locked constantly in what you would consider a safe suburb. \n\nit's not just a prank."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "White smoke billows from Sistine Chapel as new pope elected",
            "external_url": "https://www.reuters.com/world/europe/cardinals-set-second-day-conclave-elect-new-pope-2025-05-08/",
            "upvotes": 5682,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the NYT, commentating while they waited: \"With no smoke coming out of the chimney yet, all eyes were again on the birds strolling on the Sistine Chapel’s roof. After seagulls largely dominated the scene, a pigeon briefly took center stage.\"",
                "\"Sister Mona Lisa, a Brazilian nun, was in the square waving a Brazilian flag, in tears. 'I am so happy we have a pope,' she said.\"\n\n\nHow many comments do you think she gets on her name tho",
                "Genuinely surprised it went this quick",
                "why did I learn about this from an ESPN notification",
                "The Cardinals have chosen ...... Albert Pujols?",
                "they picked a pope quicker than a team picked Shedeur Sanders damn",
                "Imagine planning your European vacation and having this go down on your Vatican day.",
                "Robert Francis Prevost is the new Pope. He is American.\n\n>A member of the influential Augustinian order his main appeal may be that he is an expert in canon law. There have been concerns over Francis that the Church moved away from a reliance on canon law and the traditional institutions. This makes Prevost a compromise candidate for Francis inspired reformers and those who want some traditional order restored.\n\n[Source](https://www.independent.co.uk/news/world/europe/new-pope-conclave-cardinals-candidates-b2747161.html?callback=in&code=Y2QZN2E2NTITYTMXYI0ZZTLKLWIWY2YTOWEZN2UWOWY0NDYY&state=b0073a5d0a0d4c9d89c964618c3d2509)\n\n>While Prevost is seen overall as a centrist, on some key social issues he's viewed as progressive. He has long embraced marginalized groups, a lot like Francis, who championed migrants and the poor. But, also like Pope Francis, the Illinois native opposes ordaining women as deacons, for instance, so on that point he's seen as conservative on church doctrine\n\n[Source](https://www.cbsnews.com/news/new-pope-could-it-be-american-cardinal-robert-prevost/)",
                "Please be a good Pope, please be such a good Pope that Marjorie Taylor Green gets an exorcism just by looking at him",
                "As a Catholic man who will lose my job soon as NIOSH's funding dries up, I'm crossing my fingers it's me!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Pakistan’s Chinese-made jet brought down two Indian fighter aircraft, US officials say",
            "external_url": "https://www.reuters.com/world/pakistans-chinese-made-jet-brought-down-two-indian-fighter-aircraft-us-officials-2025-05-08/",
            "upvotes": 2341,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "All the hulaboo about who shot down who’s jet and how many has been crazy. If either of these countries attack each other with potentially 50+ jets at a time, it’s all but guaranteed some will be shot down. \n\nThey both have fairly advanced 4th generation fighters, which are not stealth fighters. Both countries have capable anti aircraft systems and air to air shoot down capabilities. \n\nNeither of these countries air forces are even remotely invulnerable.",
                "[removed]",
                "[removed]",
                "Well, that isn't good press for Dassault.",
                "Number of conveniently found perfectly maintained F14s shot down while being flown by a permanently demoted test pilot who can’t stay above the hard deck and still hasn’t gotten over the tragic loss of his navigator? 0",
                "Pakistan got a complete system: radar, sam, jets etc from China. India's military equipment are from all over the world. it's not just J10 VS Rafale, more like J10+PL15+whatever radar system vs Rafale.",
                "[removed]",
                "Ah, but how many of those elite motorcycle observation spinny teams did they take out?",
                "It's not about the aircraft. It's about the man in the box.\n\nOr so I learned from Maverick.\n\nReposting my own comment from another thread because I think the joke is apt.",
                "Someone didn't respect their BVR timelines and got overconfident in their technology. More of a pilot/training/doctrine issue than any real measure of equipment."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "NHS plans 'unthinkable' cuts to balance books",
            "external_url": "https://www.bbc.co.uk/news/articles/cgle2xkg3wpo",
            "upvotes": 55,
            "date": "05/09/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b061/live/11d1be00-2c8b-11f0-8ff1-59f5dcf8e9f5.jpg",
            "top_comments": [
                "Brexit didn't fix that??",
                "Now the waiting list for diagnosis of certain conditions will increase from 3 years to 7!\n\nFucking wonderful",
                "Maybe the NHS should enforce discharges to care in a more aggressive manner. Why should private contractors be this inefficient."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Pakistan says Economic Affairs Ministry’s X account hacked",
            "external_url": "https://www.aljazeera.com/news/liveblog/2025/5/9/live-india-pakistan-tensions-surge-as-both-sides-trade-attack-claims?update=3697996",
            "upvotes": 75,
            "date": "05/09/2025",
            "thumbnail": "https://www.aljazeera.com/wp-content/uploads/2025/05/AP25129165558168-1746771548.jpg?resize=1920%2C1440",
            "top_comments": [
                "This is hilarious on another level because that tweet is so believable.",
                "Mate that sounded right up their alley. I believed it",
                "[deleted]"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Narva Standoff: Estonians raise “Putler” sign as Russians plan Victory Day propaganda concert",
            "external_url": "https://www.delfi.ee/artikkel/120376102/video-ja-fotod-narva-linnusele-pandi-plakat-putler",
            "upvotes": 243,
            "date": "05/09/2025",
            "thumbnail": "https://images.delfi.ee/media-api-image-cropper/v1/e3d43c46-7c4b-402e-8ac7-8b2ff3120900.jpg?w=1200&h=800",
            "top_comments": [
                "made an overview about the whole situation on the border with Russia since 2022, if anyone is interested what really is happening there, backstory and all [Substack](https://open.substack.com/pub/journalistkarl/p/the-frontline-fortress-how-narva?r=555t98&utm_medium=ios)"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Indian Army says Pakistan's overnight attacks involved drones",
            "external_url": "https://edition.cnn.com/world/live-news/india-pakistan-operation-sindoor-05-08-25-intl-hnk",
            "upvotes": 119,
            "date": "05/09/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/08-ap25127173310720.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Twitter/x is full of drone and missile interception videos. Though there s almost a complete blackout of media footage so that capabilities are not shown completely. Some videos look very similar to Iron Dome footage from Iran vs Israel.",
                "Let's see some debris then",
                "Drones eh? In this day and age? You don't say!",
                "Using drones really makes the war more unfair. Not even a trench \"protects\" you now.",
                "Show the wreckage then 😂"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Cigma denies man life-saving lung transplant shortly before scheduled operation.",
            "external_url": "https://abc7.la/44oVLpE",
            "upvotes": 11199,
            "date": "05/09/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16348273_050625-kabc-11pm-lung-transplant-denial-vid.jpg?w=1600",
            "top_comments": [
                "\"Our coverage guidelines are grounded in national clinical standards to help ensure the best possible outcomes for patients.\"\n\n…and we’ve decided that the best possible outcome for this patient would be for him to just fucking die already.  ",
                "A man battling stage 4 lung cancer was preparing to fly across the country for a life-changing double-lung transplant when his insurance company denied him coverage.",
                "I had a knee surgery denied because I didn’t try not having knee surgery long enough. My meniscus was shredded and stuck between the joint. Fuck these ghouls.",
                "I’m enjoying the fact that several people are calling it Cigma because the title had a typo",
                "Cigna has done this *exact same thing before* in 2023, but changed their mind after a social media outcry: https://clearhealthcosts.com/blog/2023/11/cigna-denies-transplant-then-approves-after-social-media-campaign/\n\nUnfortunately the lungs were no longer available for transplant after they changed their mind. She did eventually get the transplant and was reported to be cancer free several months later in 2024. \n\nSupporters of the woman who was denied care emailed the CEO directly: david.cordani@cigna.com.",
                "For the record, the company is Cigna, not Cigma.  It’s the same company that *my* company uses to provide our health insurance with the $5,000 deductible.  It’s fucking worthless.",
                "The U.S. is alone among wealthy nations in making its citizens fear the doctor financially. Other countries may struggle with wait times or regional gaps in access, but not the constant anxiety over whether care will bankrupt you or be denied all together.",
                "Who’s the Cigna CEO again? ",
                "Just tell 'em you'll pay cash. Then, pat your gown and say, \"oops, I guess my wallet is in the car still\" and offer to grab it quick after the surgery.",
                "Not surprised. My mother's insurance denied her radiation for her cancer today. If I knew their name I would name and shame."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Two arrested after neighbors try to stop ICE agents from detaining Worcester mother",
            "external_url": "https://www.boston.com/news/local-news/2025/05/08/two-arrested-after-neighbors-try-to-stop-ice-agents-from-detaining-worcester-mother/",
            "upvotes": 13783,
            "date": "05/09/2025",
            "thumbnail": "https://bdc2020.o0bc.com/wp-content/uploads/2025/05/Police_Civil_Rights_Violations_53988-681d42cba076d-768x432.jpg",
            "top_comments": [
                "Something tells me it's going to be a hot, hot summer.",
                "\"Terrible things are happening outside. At any time of night and day, poor helpless people are being dragged out of their homes. They’re allowed to take only a knapsack and a little cash with them, and even then, they’re robbed of these possessions on the way. Families are torn apart; men, women and children are separated. Children come home from school to find that their parents have disappeared. Women return from shopping to find their houses sealed, their families gone.\" - Anne Frank, The Diary of a Young Girl.",
                "I like how this neighborhood is full of people that are ride-or-die, should serve as an example for us all. I want to see some videos of this.",
                "They're charging her with assault and battery with a dangerous weapon for throwing a drink at the cops. What a fucking crock of shit.",
                "Not unprecedented. [Boston, 1834](https://newenglandhistoricalsociety.com/boston-slave-riot-1854/)",
                "Video of it here:\n\n[https://www.reddit.com/r/PublicFreakout/comments/1ki292o/crowd\\_in\\_worcester\\_ma\\_tries\\_to\\_interfere\\_with\\_ice/](https://www.reddit.com/r/PublicFreakout/comments/1ki292o/crowd_in_worcester_ma_tries_to_interfere_with_ice/)\n\nIt's a chaotic scene, but it looks like one of the arrests is happening as they pull a woman away. Crazy how many cops they had out there--totally intimidating and unnecessary.",
                "This is how “hiding people in the attic” began…",
                "May they be blessed forever doing what was right when it was not easy.",
                "Getting arrested for protecting the people who are being illegally detained and sent to concentration camps by gestapo sure sounds fucking familiar. This is some straight up Anne Frank shit.",
                "My great grandmother once held off US Army troops with a broom to buy time for her Japanese neighbors to put their house in trust, thus keeping it out of government hands; they were some of the few who had a home to come back to after the war thanks in part to her. \n\nI hope that I'll be as brave as she was and these people are when the time comes."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Nearly 60 cases dismissed due to corruption in Alabama police department",
            "external_url": "https://apnews.com/article/hanceville-alabama-police-department-corruption-grand-jury-6ed5dadf25bc6b2b38d0b755e6e71cf2",
            "upvotes": 3878,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The grand jury determined that 58 felony criminal cases had been tainted by corruption in the Hanceville Police Department in northern Alabama, after four officers and the police chief were indicted on a variety of charges related to mishandling or removing evidence from the department’s evidence room.\n\nSeems like the evidence room was their junk drawer. \n\n>There was also a wide array of evidence that appeared to be missing, including firearms, cash and illicit drugs.\n\nI wonder if they were drug tested before they were fired. I wonder if they got jobs down the road already.",
                "Corruption in an Alabama police department? No way....",
                "*most of the cases were drug-related and only a few were personal crimes with victims.*\n\nHow does a town of 3,200 pop have 60 felony cases pending??  I would guess that most would have to be trumped up charges (against mainly black residents, i'm guessing)",
                "Just a few bad apples, I'm sure.",
                "No worries, Trump will pardon them, like the giant douche he is",
                "All these small maga towns are run by crooks",
                "That's a lot of bad apples",
                "The only part of this I find surprising is that any Alabama or current federal court would consider blatant corruption and/or falsified evidence grounds for dismissal, rather than business as usual.",
                "Im surprised anything happened. At least they are trying",
                "Are they going to return all of the cash & property they seized from the victims?  Or is that gone too?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US will stop tracking the costs of extreme weather fueled by climate change",
            "external_url": "https://apnews.com/article/climate-weather-service-disaster-flood-wildfire-cost-53b9d8f5dc8563e2e70804d9c67b9404",
            "upvotes": 6609,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I expect more insurance companies to pull out of states like Florida.",
                "Well, as all great businessmen know, if you stop tracking costs, the costs no longer exist. This means that Trump has effectively ended the costs of climate-change catastrophes, only a little bit after his first 100 days. Amazing work.",
                "\"The US is choosing to bury its head in the sand so it doesn't know about things and can then avoid dealing with them.\"\n\nWe may need to change the national bird to the ostrich.",
                "This was the same approach that Trump wanted to use with covid. He seemed to think that it wouldn't be a problem if we just stopped testing for it.",
                "Have a friend who just got laid off at NOAA. He says they're getting to delete decades of climate data so they support their rhetoric of \"drill baby drill\" and similar. Literally setting back humanity decades.",
                "Just like the covid rates - if we stop the testing/reporting, the problem goes away. It's just like magic.",
                "this fucker needs to be stripped of his presidency and incarcerated (along with his regime) for the rest of his miserable life.",
                "That's fine, insurance will be collecting it on their own since you know... They are paying.",
                "Because they've realized that if some future leader suspends sovereign immunity and lets the US be sued for it, they are providing the data which will incriminate their heirs.",
                "So no FEMA or NOAA. Totally suck for all the states that have hurricane, tornadoes, floods or fires…oh wait that’s all of them!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "UnitedHealthcare sued by shareholders over reaction to CEO's killing",
            "external_url": "https://www.cnbc.com/2025/05/08/unitedhealthcare-sued-by-shareholders-over-reaction-to-ceos-killing.html",
            "upvotes": 13448,
            "date": "05/08/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108071136-1733320864176-horizontal-Brian-Thompson.png?v=1733766690&w=1920&h=1080",
            "top_comments": [
                "The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\n\nThat's all you really need to know about this company and its shareholders.",
                "From the Article \n\n> A group of investors sued UnitedHealthcare Group on Wednesday, accusing the company of misleading them after the killing of its CEO, Brian Thompson.\n\n> The class action lawsuit — filed in the Southern District of New York — accuses the health insurance company of not initially adjusting their 2025 net earning outlook to factor in how Thompson’s killing would affect their operations.\n\n> The investors described this as “materially false and misleading,” pointing to the immense public scrutiny the company and the broader health insurance industry experienced in the wake of Thompson’s killing.\n\n> The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.",
                "I am wondering what this means\n\n\"argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\"\n\nAre they angry they can't be assholes? Am I missing something?",
                "I suspect the problem. causing the loss of income, is not because the CEO is dead, but because of the bad publicity that people now see about United Healthcare.",
                "Who are these shareholders and where do they live? So we can avoid them at all costs.",
                "> On Dec. 3 — a day before Thompson was fatally shot — the company issued guidance that included net earnings of $28.15 to $28.65 per share and adjusted net earnings of $29.50 to $30.00 per share, the suit notes. And on January 16, the company announced that it was sticking with its old forecast.\n\n> The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\n\n\nThey are arguing that UnitedHealth should have adjusted their earnings forecast in response to the shooting.",
                "Why would they phrase it as anti-consumer instead of something like “cost preserving“ tactics, or “waste reduction“ tactics like they would usually do. Does it help their case to phrase it that way? Is it directly referencing something UHC did after the ceo was killed?",
                "Sure is a bold move to see someone killed for anti-consumer tactics and sue because they weren't anti-consumer enough. Someone feels too safe",
                "And I thought the new pope would be the least interesting story of the day \n\n>The legal defense fund for Mangione surpassed the $1 million mark in donations on Tuesday\n\nBut at least it has a happy ending",
                "> The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\n\nr/nottheonion"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "The Catholic Church has elected Cardinal Robert Prevost as pope",
            "external_url": "https://www.houstonpublicmedia.org/npr/2025/05/08/nx-s1-5385327/the-catholic-church-has-elected-cardinal-robert-prevost-as-pope/",
            "upvotes": 28654,
            "date": "05/08/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2648x1766+0+0/resize/2648x1766!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc4%2Fbc%2Ff80295a6417489396fcd93f99957%2Fap25128626700383.jpg",
            "top_comments": [
                "From [CBS News last week](https://www.cbsnews.com/news/who-will-be-the-next-pope-list-of-possible-candidates/):\n\n> Chicago-born Cardinal Robert Prevost is seen as having many of the qualities desired in a pope, and if elected, he would become the first U.S. pope in the church's history.\n\n> Prevost is the head of the church's Dicastery for Bishops, meaning he oversees the selection of new bishops. It's a powerful position, and for any cardinal electors who may be turned off by his American nationality, it's not his only one. Prevost is a dual citizen of the U.S. and Peru, where he served for many years.\n\n> Overall, **he's considered a centrist**, but on many social issues he's seen as progressive, embracing marginalized groups like Francis, who championed migrants and the poor. But Prevost opposes ordaining women as deacons, for instance, so he's seen as conservative on church doctrine.\n\n> His age could also be a factor — at 69 some may consider him too young to hold the church's highest office.",
                "He is a staunch advocate for climate change action and environmental issues",
                "From Chicago? Da Bears have God on their side now!",
                "Took Shadeur Sanders three days to get drafted but the pope was selected in two",
                "Deep dish pizza is about to be the national food of the Vatican.",
                "First American. Pope Leo XIV",
                "WOW. This was COMPLETELY unexpected. He wasn't even talked about as one of the frontrunners. Just to put it into perspective - he had 1-2% betting chance before today",
                "This could be a Pope John Paul II situation, where the Pope is elected from a country specifically to contrast and oppose that country's particularly worrisome regime",
                "For those wondering, it's sort of a continuation of the previous Pope's idealogical leanings - champions the poor/migrants but is against ordaining women. He's also a dual US-Peru citizen.",
                "Papal names are often chosen for a reason or to send a message, so it's good to look at what other popes with that name did, as it can often give a hint at the new pope's views. In this case, Leo XIII was famous for issuing one of the Catholic Church's most famous edicts, ***Rerum novarum***, which criticized capitalism for its tendency toward greed, concentration of wealth, and mistreatment of workers. It strongly advocated for organizations like labor unions. At the same time, it also criticized socialism for rejecting private property and the under-emphasis of the importance of the individual."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Narva Standoff: Estonians raise “Putler” sign as Russians plan Victory Day propaganda concert",
            "external_url": "https://www.delfi.ee/artikkel/120376102/video-ja-fotod-narva-linnusele-pandi-plakat-putler",
            "upvotes": 246,
            "date": "05/09/2025",
            "thumbnail": "https://images.delfi.ee/media-api-image-cropper/v1/e3d43c46-7c4b-402e-8ac7-8b2ff3120900.jpg?w=1200&h=800",
            "top_comments": [
                "made an overview about the whole situation on the border with Russia since 2022, if anyone is interested what really is happening there, backstory and all [Substack](https://open.substack.com/pub/journalistkarl/p/the-frontline-fortress-how-narva?r=555t98&utm_medium=ios)"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Cigma denies man life-saving lung transplant shortly before scheduled operation.",
            "external_url": "https://abc7.la/44oVLpE",
            "upvotes": 11198,
            "date": "05/09/2025",
            "thumbnail": "https://cdn.abcotvs.com/dip/images/16348273_050625-kabc-11pm-lung-transplant-denial-vid.jpg?w=1600",
            "top_comments": [
                "\"Our coverage guidelines are grounded in national clinical standards to help ensure the best possible outcomes for patients.\"\n\n…and we’ve decided that the best possible outcome for this patient would be for him to just fucking die already.  ",
                "A man battling stage 4 lung cancer was preparing to fly across the country for a life-changing double-lung transplant when his insurance company denied him coverage.",
                "I had a knee surgery denied because I didn’t try not having knee surgery long enough. My meniscus was shredded and stuck between the joint. Fuck these ghouls.",
                "I’m enjoying the fact that several people are calling it Cigma because the title had a typo",
                "Cigna has done this *exact same thing before* in 2023, but changed their mind after a social media outcry: https://clearhealthcosts.com/blog/2023/11/cigna-denies-transplant-then-approves-after-social-media-campaign/\n\nUnfortunately the lungs were no longer available for transplant after they changed their mind. She did eventually get the transplant and was reported to be cancer free several months later in 2024. \n\nSupporters of the woman who was denied care emailed the CEO directly: david.cordani@cigna.com.",
                "For the record, the company is Cigna, not Cigma.  It’s the same company that *my* company uses to provide our health insurance with the $5,000 deductible.  It’s fucking worthless.",
                "The U.S. is alone among wealthy nations in making its citizens fear the doctor financially. Other countries may struggle with wait times or regional gaps in access, but not the constant anxiety over whether care will bankrupt you or be denied all together.",
                "Who’s the Cigna CEO again? ",
                "Just tell 'em you'll pay cash. Then, pat your gown and say, \"oops, I guess my wallet is in the car still\" and offer to grab it quick after the surgery.",
                "Not surprised. My mother's insurance denied her radiation for her cancer today. If I knew their name I would name and shame."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Nearly 60 cases dismissed due to corruption in Alabama police department",
            "external_url": "https://apnews.com/article/hanceville-alabama-police-department-corruption-grand-jury-6ed5dadf25bc6b2b38d0b755e6e71cf2",
            "upvotes": 3875,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The grand jury determined that 58 felony criminal cases had been tainted by corruption in the Hanceville Police Department in northern Alabama, after four officers and the police chief were indicted on a variety of charges related to mishandling or removing evidence from the department’s evidence room.\n\nSeems like the evidence room was their junk drawer. \n\n>There was also a wide array of evidence that appeared to be missing, including firearms, cash and illicit drugs.\n\nI wonder if they were drug tested before they were fired. I wonder if they got jobs down the road already.",
                "Corruption in an Alabama police department? No way....",
                "*most of the cases were drug-related and only a few were personal crimes with victims.*\n\nHow does a town of 3,200 pop have 60 felony cases pending??  I would guess that most would have to be trumped up charges (against mainly black residents, i'm guessing)",
                "Just a few bad apples, I'm sure.",
                "No worries, Trump will pardon them, like the giant douche he is",
                "All these small maga towns are run by crooks",
                "That's a lot of bad apples",
                "The only part of this I find surprising is that any Alabama or current federal court would consider blatant corruption and/or falsified evidence grounds for dismissal, rather than business as usual.",
                "Im surprised anything happened. At least they are trying",
                "Are they going to return all of the cash & property they seized from the victims?  Or is that gone too?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Two arrested after neighbors try to stop ICE agents from detaining Worcester mother",
            "external_url": "https://www.boston.com/news/local-news/2025/05/08/two-arrested-after-neighbors-try-to-stop-ice-agents-from-detaining-worcester-mother/",
            "upvotes": 13785,
            "date": "05/09/2025",
            "thumbnail": "https://bdc2020.o0bc.com/wp-content/uploads/2025/05/Police_Civil_Rights_Violations_53988-681d42cba076d-768x432.jpg",
            "top_comments": [
                "Something tells me it's going to be a hot, hot summer.",
                "\"Terrible things are happening outside. At any time of night and day, poor helpless people are being dragged out of their homes. They’re allowed to take only a knapsack and a little cash with them, and even then, they’re robbed of these possessions on the way. Families are torn apart; men, women and children are separated. Children come home from school to find that their parents have disappeared. Women return from shopping to find their houses sealed, their families gone.\" - Anne Frank, The Diary of a Young Girl.",
                "I like how this neighborhood is full of people that are ride-or-die, should serve as an example for us all. I want to see some videos of this.",
                "They're charging her with assault and battery with a dangerous weapon for throwing a drink at the cops. What a fucking crock of shit.",
                "Not unprecedented. [Boston, 1834](https://newenglandhistoricalsociety.com/boston-slave-riot-1854/)",
                "Video of it here:\n\n[https://www.reddit.com/r/PublicFreakout/comments/1ki292o/crowd\\_in\\_worcester\\_ma\\_tries\\_to\\_interfere\\_with\\_ice/](https://www.reddit.com/r/PublicFreakout/comments/1ki292o/crowd_in_worcester_ma_tries_to_interfere_with_ice/)\n\nIt's a chaotic scene, but it looks like one of the arrests is happening as they pull a woman away. Crazy how many cops they had out there--totally intimidating and unnecessary.",
                "This is how “hiding people in the attic” began…",
                "May they be blessed forever doing what was right when it was not easy.",
                "Getting arrested for protecting the people who are being illegally detained and sent to concentration camps by gestapo sure sounds fucking familiar. This is some straight up Anne Frank shit.",
                "My great grandmother once held off US Army troops with a broom to buy time for her Japanese neighbors to put their house in trust, thus keeping it out of government hands; they were some of the few who had a home to come back to after the war thanks in part to her. \n\nI hope that I'll be as brave as she was and these people are when the time comes."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US will stop tracking the costs of extreme weather fueled by climate change",
            "external_url": "https://apnews.com/article/climate-weather-service-disaster-flood-wildfire-cost-53b9d8f5dc8563e2e70804d9c67b9404",
            "upvotes": 6614,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I expect more insurance companies to pull out of states like Florida.",
                "Well, as all great businessmen know, if you stop tracking costs, the costs no longer exist. This means that Trump has effectively ended the costs of climate-change catastrophes, only a little bit after his first 100 days. Amazing work.",
                "\"The US is choosing to bury its head in the sand so it doesn't know about things and can then avoid dealing with them.\"\n\nWe may need to change the national bird to the ostrich.",
                "This was the same approach that Trump wanted to use with covid. He seemed to think that it wouldn't be a problem if we just stopped testing for it.",
                "Have a friend who just got laid off at NOAA. He says they're getting to delete decades of climate data so they support their rhetoric of \"drill baby drill\" and similar. Literally setting back humanity decades.",
                "Just like the covid rates - if we stop the testing/reporting, the problem goes away. It's just like magic.",
                "this fucker needs to be stripped of his presidency and incarcerated (along with his regime) for the rest of his miserable life.",
                "That's fine, insurance will be collecting it on their own since you know... They are paying.",
                "Because they've realized that if some future leader suspends sovereign immunity and lets the US be sued for it, they are providing the data which will incriminate their heirs.",
                "So no FEMA or NOAA. Totally suck for all the states that have hurricane, tornadoes, floods or fires…oh wait that’s all of them!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "UnitedHealthcare sued by shareholders over reaction to CEO's killing",
            "external_url": "https://www.cnbc.com/2025/05/08/unitedhealthcare-sued-by-shareholders-over-reaction-to-ceos-killing.html",
            "upvotes": 13442,
            "date": "05/08/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108071136-1733320864176-horizontal-Brian-Thompson.png?v=1733766690&w=1920&h=1080",
            "top_comments": [
                "The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\n\nThat's all you really need to know about this company and its shareholders.",
                "From the Article \n\n> A group of investors sued UnitedHealthcare Group on Wednesday, accusing the company of misleading them after the killing of its CEO, Brian Thompson.\n\n> The class action lawsuit — filed in the Southern District of New York — accuses the health insurance company of not initially adjusting their 2025 net earning outlook to factor in how Thompson’s killing would affect their operations.\n\n> The investors described this as “materially false and misleading,” pointing to the immense public scrutiny the company and the broader health insurance industry experienced in the wake of Thompson’s killing.\n\n> The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.",
                "I am wondering what this means\n\n\"argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\"\n\nAre they angry they can't be assholes? Am I missing something?",
                "I suspect the problem. causing the loss of income, is not because the CEO is dead, but because of the bad publicity that people now see about United Healthcare.",
                "Who are these shareholders and where do they live? So we can avoid them at all costs.",
                "> On Dec. 3 — a day before Thompson was fatally shot — the company issued guidance that included net earnings of $28.15 to $28.65 per share and adjusted net earnings of $29.50 to $30.00 per share, the suit notes. And on January 16, the company announced that it was sticking with its old forecast.\n\n> The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\n\n\nThey are arguing that UnitedHealth should have adjusted their earnings forecast in response to the shooting.",
                "Why would they phrase it as anti-consumer instead of something like “cost preserving“ tactics, or “waste reduction“ tactics like they would usually do. Does it help their case to phrase it that way? Is it directly referencing something UHC did after the ceo was killed?",
                "Sure is a bold move to see someone killed for anti-consumer tactics and sue because they weren't anti-consumer enough. Someone feels too safe",
                "And I thought the new pope would be the least interesting story of the day \n\n>The legal defense fund for Mangione surpassed the $1 million mark in donations on Tuesday\n\nBut at least it has a happy ending",
                "> The group, which is seeking unspecified damages, argued that the public backlash prevented the company from pursuing “the aggressive, anti-consumer tactics that it would need to achieve” its earnings goals.\n\nr/nottheonion"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "The Catholic Church has elected Cardinal Robert Prevost as pope",
            "external_url": "https://www.houstonpublicmedia.org/npr/2025/05/08/nx-s1-5385327/the-catholic-church-has-elected-cardinal-robert-prevost-as-pope/",
            "upvotes": 28657,
            "date": "05/08/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2648x1766+0+0/resize/2648x1766!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc4%2Fbc%2Ff80295a6417489396fcd93f99957%2Fap25128626700383.jpg",
            "top_comments": [
                "From [CBS News last week](https://www.cbsnews.com/news/who-will-be-the-next-pope-list-of-possible-candidates/):\n\n> Chicago-born Cardinal Robert Prevost is seen as having many of the qualities desired in a pope, and if elected, he would become the first U.S. pope in the church's history.\n\n> Prevost is the head of the church's Dicastery for Bishops, meaning he oversees the selection of new bishops. It's a powerful position, and for any cardinal electors who may be turned off by his American nationality, it's not his only one. Prevost is a dual citizen of the U.S. and Peru, where he served for many years.\n\n> Overall, **he's considered a centrist**, but on many social issues he's seen as progressive, embracing marginalized groups like Francis, who championed migrants and the poor. But Prevost opposes ordaining women as deacons, for instance, so he's seen as conservative on church doctrine.\n\n> His age could also be a factor — at 69 some may consider him too young to hold the church's highest office.",
                "He is a staunch advocate for climate change action and environmental issues",
                "From Chicago? Da Bears have God on their side now!",
                "Took Shadeur Sanders three days to get drafted but the pope was selected in two",
                "Deep dish pizza is about to be the national food of the Vatican.",
                "First American. Pope Leo XIV",
                "WOW. This was COMPLETELY unexpected. He wasn't even talked about as one of the frontrunners. Just to put it into perspective - he had 1-2% betting chance before today",
                "This could be a Pope John Paul II situation, where the Pope is elected from a country specifically to contrast and oppose that country's particularly worrisome regime",
                "For those wondering, it's sort of a continuation of the previous Pope's idealogical leanings - champions the poor/migrants but is against ordaining women. He's also a dual US-Peru citizen.",
                "Papal names are often chosen for a reason or to send a message, so it's good to look at what other popes with that name did, as it can often give a hint at the new pope's views. In this case, Leo XIII was famous for issuing one of the Catholic Church's most famous edicts, ***Rerum novarum***, which criticized capitalism for its tendency toward greed, concentration of wealth, and mistreatment of workers. It strongly advocated for organizations like labor unions. At the same time, it also criticized socialism for rejecting private property and the under-emphasis of the importance of the individual."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Bill Gates to give away $200 billion by 2045, accuses Musk of harming world's poor",
            "external_url": "https://www.reuters.com/business/bill-gates-give-away-fortune-by-2045-200bn-worlds-poorest-2025-05-08/",
            "upvotes": 55148,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Reminder: Elon Musk once claimed homelessness was a conspiracy made up by the government.",
                "\"Yes, and what's your point?\" - Elon Musk\n\nWhen you grow up rich, you don't see poor people as unfortunate. You see them as lazy parasites. You also don't see working class people as the ones who make and do. You see them as unimaginative cowards. People who didn't have the guts to be entrepreneurs, and need to be punished for their failings. \n\nAt Musk and Trump's level, either you're the boss or you're the help. Chief Financial Officer? Head of counsel? Groundbreaking inventor? Fuck you, you're the help.",
                "*\"The picture of the world's richest man killing the world’s poorest children is not a pretty one,”*\n\nGates with an awesome slam of Musk for cutting the US Aid budget.",
                "Musk bragged he could end world hunger and has since then done absolutely nothing to benefit the world's most vulnerable. Bill actually puts his money out into the world in multiple ways. There are levels to this human thing.",
                "I looked up Steve Ballmer, Bill Gates right hand man back in the days and Clippers owner. \n\nBallmer is worth 127 Billion vs 112B for Gates. \n\nGates been giving away a lot of money even before this.",
                "Putting aside what I feel about billionaires in general, *if* we're going to have to have them around, I'd prefer they're more similar to Gates than to Musk.",
                "Anyone recall the time musk said money wouldn't solve the would hunger issues and like the UN or something called his bluff and submitted a open report on how the money would be spent to resolve said issue. And musk fell silent on the matter? Fun time's indeed.",
                "Good. Finally someone has the balls to speak up and show Musky weiner boy who knows what’s what.",
                "Musk will kill this planet just so he can colonize a different dead planet.",
                "Where is Musk anyway? Is already keeping a low profile."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Virginia teenager shot and killed by homeowner while recording TikTok prank video",
            "external_url": "https://www.nbcnews.com/news/us-news/virginia-teenager-shot-killed-homeowner-filming-tiktok-prank-video-rcna205218",
            "upvotes": 10585,
            "date": "05/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250506-Spotsylvania-County-virginia-teen-fatal-shooting-WRC-snip-ac-427p-b545f1.jpg",
            "top_comments": [
                "I’m surprised that doesn’t happen more often.",
                "At 3am? Yeah, I can see why the homeowner would think they were trying to break in.",
                "Oops. . .\n\nThe platforms need to demonitize these videos.  They're harassment.  A prank is putting googly eyes on all the photos in your mothers house or replacing the soap with potatoes.  It's not scaring the shit out of people or breaking the law.",
                "We've had teens do this to our house. They are not ringing the doorbell and running. They are full force hitting or kicking the front doors several times often until someone opens the door before they run. I live in a split level so they would also pound on the ground floor windows. \n\nWe basically staged a stake out one night. Saw them coming and called the cops. They got caught and we don't get \"ding dong ditched* anymore. \n\nThey're lucky we don't own any guns. I can 100% see these kids getting shot. It was terrifying.",
                "Similar thing just happened to our neighbor. The kids didn't just ding dong ditch tho. I have no idea what the viral tik Tok challenge is specifically, but these kids kicked in his storm door. Like he had to replace it. Then a month later, attempted to do it again. This time he was prepared, and proceeded to tackle one of the kids, and sat on him til the police arrived. He was furious and saw only red, and if they were a touch older, I wouldn't have been surprised for him to have pummelled them. They were 10 years old, and I think that was their saving grace. All these kids need to knock it off. Loss of life here is tragic. A lot of people are on edge these days, and I'm not surprised this happened. Terrible outcome",
                "\"The shooting happened around 3 a.m. Saturday, the Spotsylvania County Sheriff’s Office said in a news release. Deputies were sent to a home near McKenzie Lane in the Washington, D.C., suburb following a call for a residential burglary in progress, in which a resident had fired shots.\n\nBosworth and another person had gunshot wounds, the sheriff's office said. Bosworth was taken to the hospital, where he died from his injuries. The other person, a juvenile, was treated and released. A third juvenile with them was unharmed, authorities said.\n\nButler, 27, told investigators that he believed the teens were trying to break into his home, NBC Washington reported.\n\nAccording to a search warrant affidavit obtained by NBC News, one of the teens told detectives that they were recording ding-dong ditch pranks for a TikTok video, in which they ring people's doorbells and then run away. The teen said that they had been to a couple of homes in the neighborhood and that he was not familiar with the area.\"\n\nAt 3am? They decide it's a good idea to ring people's doorbells? Not saying they should have been shot but how dumb can people be???",
                "I remember playing ding dong ditch as a kid with some friends. Lived in a country area where homes were further apart. One of the homeowners fired a few shots off after we had ditched their home and were running away. We didn’t know if it was at us or in the air, but we def stopped playing after that day.",
                "You mean while kicking in his back door at 3 am?",
                "I have weird military-related PTSD that triggers when unexpected people come to my house. \n\nI’m ashamed to say I yelled at an old Jehova’s Witness woman once for coming back after I told her not to. The unadulterated pure white-hot panic I feel when a loud knock hits my front door gives me days of depression. \n\nSo… I get it. You don’t know what battles people fight in their private homes.",
                "to give some context this \"prank\" is common here where i live. this isn't simple ding dong ditch you guys simplify it. \n\nwhen it happened to us it was a group of four teens they rotated running  up to the door and kicking it. they know about the ring cameras and they know how to evade them. i was woken up at 3am with kids upstairs and my fight or flight kicked in guys. you don't have time to look on your ring. \n\nsometimes they also ring the doorbell but again many of these kids don't want to be identified so they cover their faces. again looking like a burglar. \n\ni'm not condoning the shooting i'm just setting some context for people to process what happened on both sides. \n\nit has shaken me and my family up. it's been almost a year and i still get ptsd and we have to check all the doors are locked constantly in what you would consider a safe suburb. \n\nit's not just a prank."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "White smoke billows from Sistine Chapel as new pope elected",
            "external_url": "https://www.reuters.com/world/europe/cardinals-set-second-day-conclave-elect-new-pope-2025-05-08/",
            "upvotes": 5674,
            "date": "05/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From the NYT, commentating while they waited: \"With no smoke coming out of the chimney yet, all eyes were again on the birds strolling on the Sistine Chapel’s roof. After seagulls largely dominated the scene, a pigeon briefly took center stage.\"",
                "\"Sister Mona Lisa, a Brazilian nun, was in the square waving a Brazilian flag, in tears. 'I am so happy we have a pope,' she said.\"\n\n\nHow many comments do you think she gets on her name tho",
                "Genuinely surprised it went this quick",
                "why did I learn about this from an ESPN notification",
                "The Cardinals have chosen ...... Albert Pujols?",
                "they picked a pope quicker than a team picked Shedeur Sanders damn",
                "Imagine planning your European vacation and having this go down on your Vatican day.",
                "Robert Francis Prevost is the new Pope. He is American.\n\n>A member of the influential Augustinian order his main appeal may be that he is an expert in canon law. There have been concerns over Francis that the Church moved away from a reliance on canon law and the traditional institutions. This makes Prevost a compromise candidate for Francis inspired reformers and those who want some traditional order restored.\n\n[Source](https://www.independent.co.uk/news/world/europe/new-pope-conclave-cardinals-candidates-b2747161.html?callback=in&code=Y2QZN2E2NTITYTMXYI0ZZTLKLWIWY2YTOWEZN2UWOWY0NDYY&state=b0073a5d0a0d4c9d89c964618c3d2509)\n\n>While Prevost is seen overall as a centrist, on some key social issues he's viewed as progressive. He has long embraced marginalized groups, a lot like Francis, who championed migrants and the poor. But, also like Pope Francis, the Illinois native opposes ordaining women as deacons, for instance, so on that point he's seen as conservative on church doctrine\n\n[Source](https://www.cbsnews.com/news/new-pope-could-it-be-american-cardinal-robert-prevost/)",
                "Please be a good Pope, please be such a good Pope that Marjorie Taylor Green gets an exorcism just by looking at him",
                "As a Catholic man who will lose my job soon as NIOSH's funding dries up, I'm crossing my fingers it's me!"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/09/2025 08:12:36 UTC"
}