{
    "posts": [
        {
            "category": "HOT",
            "title": "US honeybee deaths hit record high as scientists scramble to find main cause",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/25/honeybees-deaths-record-high",
            "upvotes": 10919,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ddbb4889fe4a8b0686f7bdaf1b74cc7a365ba0df/0_200_3000_1799/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2e9dd540a3f847f4f714379735a3b6bf",
            "top_comments": [
                "Half of America thinking climate change and environmental science is woke might have something to do with it.",
                "Stop using weed killer. It's toxic to them and destroys their main food sources.",
                "Well there’s the whole saturate the country in pesticides and glyphosate to start…",
                "> Commercial beekeepers have reported losing more than 60% of their colonies, on average, over the winter, according to an ongoing Project Apis m. survey that covers more than two-thirds of America’s managed bees.\n\nThe average winter loss used to be 10-20% until colony collapse began. They pollinate half our crops. This should freak everyone out.",
                "It's us. \"Us\" is the main cause",
                "Nothing will change without strict regulations on pesticides. It's not just agriculture sterilizing the countryside. Any idiot with a credit card can buy a barrel of poison and sterilize not just their yard but everything downwind and downstream of it for miles. \n\nWe thought we fixed everything by banning DDT, but that first Silent Spring was just the beginning. We're about to lose even more birds and wildlife in our world as insect populations continue to collapse.",
                "Who is scrambling?\n\nAnyone who has any amount of time greater than 30 seconds researching the decline in insect populations in the US know that insecticides and herbicides are the leading cause for the destruction of almost every single insect species.\n\nThese articles either try to shock people into thinking “omg how unexpected! Surely the big companies aren’t at fault and didn’t see this coming!” or the “scientists” they’re referring to are categorical fucking morons.\n\n\nMake no mistake, almost all insects are surprisingly integral to our ecosystems that we literally need to survive but Honeybees are some of, if not the, most important.\n\nWe lose them, we’re in serious trouble.",
                "neonicitinoids by agra biotech firms for crop pesticides- banned elsewhere, not in usa.",
                "People spraying their yards with mosquito killer. Kills everything.\nHerbicide and pesticides being used everywhere. Little critters have no chance.",
                "Scientists aren't scrambling to find the main cause, the people just don't like the answer."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Yale professor who studies fascism fleeing US to work in Canada",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/26/yale-professor-fascism-canada?CMP=Share_AndroidApp_Other",
            "upvotes": 2313,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4ca5fca8e505ad4e446eed6c79a9a958f0d89e2f/0_72_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1b62264f6b12cd17697d55043a02c080",
            "top_comments": [
                "A poignant quote from the article:  \"Social media posts spread on Wednesday, noting the alarm sounded by a scholar of fascism leaving the country over its political climate. Nikole Hannah-Jones, the journalist and creator of the 1619 Project,[wrote](https://bsky.app/profile/nhannahjones.bsky.social/post/3llakwvszts2c) on the social media platform Bluesky: “When scholars of authoritarianism and fascism leave US universities because of the deteriorating political situation here, we should really worry.”",
                "\"Those who do not learn from history are doomed to repeat it\"\n\nThis is simply an example of the inverse being true.",
                "This is one of the few silver linings for Canada - a reverse brain drain.\n\nStill, I'd rather have a sane southern neighbor.",
                "The vast majority of U.S. residents cannot leave. They either lack the resources or no one would be willing to take them on due to factors such as age, education, and others reasons. Protected is our freedom to travel, and essentially to leave has been our right. However, with a passport costing $250 and roughly 60% of Americans being a single paycheck away from homelessness, the majority have no freedom to travel or leave.  Trickle-down only worked for billionaires. The middle class has been significantly eroded over the past few decades. We are now stuck with our makings.",
                "He'll be back when he has to do his fieldwork.",
                "Fleeing from Germany to France vibes.",
                "Red flag: Those that study Fascism are leaving the US.\n\nTake note, MAGA. You’re the reason and you’re in a fascist cult.",
                "\"Out here, nobody knows where I am, and I’m believed to be away on a trip. Here are brewing economically and politically dark times, so I’m happy to be able to get away from everything.\" \n\n-Einstein hiding in Northern Germany in 1922, eleven years before he renounced his German citizenship following Hitlers rise to chancellor.",
                "I've read his books. When I saw this in the news yesterday, it really bummed me out. We're not headed in a good direction.",
                "This guy knows history, saw the signals early on, smart man."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "HOT",
            "title": "Scientists find 18 million tons of 'white gold' beneath California's Salton Sea worth $540 billion: Report",
            "external_url": "https://www.deccanherald.com/world/scientists-find-18-million-tons-of-white-gold-beneath-californias-salton-sea-worth-540-billion-report-3463540",
            "upvotes": 2548,
            "date": "03/27/2025",
            "thumbnail": "https://images.deccanherald.com/deccanherald%2F2025-03-26%2F1polbv4b%2FiStock-1272885374.jpg?rect=0%2C137%2C3644%2C1913&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
            "top_comments": [
                "Lithium. It's lithium. And it's double the amount estimated underneath Greenland.\n\nEdit: my math was a bit off lol...not double the amount....*it's WAY MORE*. A 2023 geological survey estimated 235,000 tonnes of lithium resources. 18,000,000 tonnes is more than that.",
                "I hate journalism these days. Just call it fucking Lithium and don't make me click to figure out what the hell you are talking about. \n\n\nMaybe I'm out of the loop but I've never heard it called white gold before",
                "Dam i should have bought the land years back when it was like 5k an acre.",
                "How long before Elon buys the Salton Sea for his battery operations?",
                "White gold?  So cocaine?",
                "A substantial Lithium deposit in the United States is a big deal.",
                "This means Greenland doesn’t need protecting by America?",
                "At less than $1 / oz, is 'gold' really the right comparable?",
                "Well good, maybe if they find cobalt and nickel somewhere they won't want Canada anymore.",
                "How long before Trump invades California?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Former ND Sen. Ray Holmberg sentenced to 10 years in prison for sex crime",
            "external_url": "https://northdakotamonitor.com/2025/03/26/former-nd-sen-ray-holmberg-sentenced-to-10-years-in-prison-for-sex-crime/",
            "upvotes": 3997,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Some highlights here, though I do encourage everyone to read the article in full. \n\n* Prosecutors allege Holmberg traveled to Prague in the Czech Republic 14 times between 2011 and 2021 to pay for sex with boys. \n\n* Though not part of the charges against Holmberg, two men who said they met him in North Dakota and were victimized by him gave emotional testimony at the hearing. One said Holmberg gave him money to film sex acts in the 1990s. The other man who spoke at the hearing was a cooperating witness who said Holmberg used his political power to groom them for sex. \n\n* Holmberg said in court that he traveled to Prague with the intent of having sexual contact with minors, that he liked massages and some involved sexual contact. He said he might have received a sexual massage from someone under 18, but he’s not sure.\n\n* In one message, Holmberg sent a cooperating witness a link to a brothel in Prague with the comment, “The boys rent at around $60 … (sex is extra).”\n\n* Holmberg was linked to the investigation of Nicholas Morgan-Derosier, a Grand Forks man who was sentenced in May to 40 years on child pornography charges.\n\n* Holmberg, a Republican who held the powerful positions of Senate Appropriations Committee chair and head of Legislative Management, resigned from the Legislature in 2022. He was indicted on federal charges in October 2023.\n\n* Ray Holmberg, 81, was a Grand Forks state senator for 45 years, and received a sentence that is longer than federal sentencing guidelines. \n\n* U.S. District Judge Daniel Hovland characterized Holmberg’s conduct as “egregious and despicable” and said he didn’t think the guideline sentence of more than three years was adequate.\n\n* “From my perspective, this was not an isolated case and this is not a victimless crime,” Hovland said. “It displays a pattern of very vile, sickening criminal behavior.”\n\n* Holmberg was sentenced to *10* years. At age 81, it's likely he will die in prison.\n\n* Holmberg is not trans nor a drag queen.",
                ">Holmberg, a Republican who held the powerful positions of Senate Appropriations Committee chair and head of Legislative Management.\n\nYet again, the danger to children are the very people who fear monger about trans people or immigrants or whatever else can deflect attention away from themselves.",
                "Take one guess which party he represented…",
                "Wait does this one get sent to El Salvador too?",
                "Yes.  He was a Republican.\n\nAnd a school counselor.",
                "Republican anti-abortion activist Howard Scott Heldreth is a convicted child rapist in Florida.\n\nRepublican County Commissioner David Swartz pleaded guilty to molesting two girls under the age of 11 and was sentenced to 8 years in prison.\n\nRepublican judge Mark Pazuhanich pleaded no contest to fondling a 10-year old girl and was sentenced to 10 years probation.\n\nRepublican anti-abortion activist Nicholas Morency pleaded guilty to possessing child pornography on his computer and offering a bounty to anybody who murders an abortion doctor.\n\nRepublican legislator Edison Misla Aldarondo was sentenced to 10 years in prison for raping his daughter between the ages of 9 and 17.\n\nRepublican Mayor Philip Giordano is serving a 37-year sentence in federal prison for sexually abusing 8- and 10-year old girls.\n\nRepublican campaign consultant Tom Shortridge was sentenced to three years probation for taking nude photographs of a 15-year old girl.\n\nRepublican racist pedophile and United States Senator Strom Thurmond had sex with a 15-year old black girl which produced a child.\n\nRepublican pastor Mike Hintz, whom George W. Bush commended during the 2004 presidential campaign, surrendered to police after admitting to a sexual affair with a female juvenile.\n\nRepublican legislator Peter Dibble pleaded no contest to having an inappropriate relationship with a 13-year-old girl.\n\nRepublican activist Lawrence E. King, Jr. organized child sex parties at the White House during the 1980s.\n\nRepublican lobbyist Craig J. Spence organized child sex parties at the White House during the 1980s.\n\nRepublican Congressman Donald “Buz” Lukens was found guilty of having sex with a female minor and sentenced to one month in jail.\n\nRepublican fundraiser Richard A. Delgaudio was found guilty of child porn charges and paying two teenage girls to pose for sexual photos.\n\nRepublican activist Mark A. Grethen convicted on six counts of sex crimes involving children.\n\nRepublican activist Randal David Ankeney pleaded guilty to attempted sexual assault on a child.\n\nRepublican Congressman Dan Crane had sex with a female minor working as a congressional page.\n\nRepublican activist and Christian Coalition leader Beverly Russell admitted to an incestuous relationship with his step daughter.\n\nRepublican congressman and anti-gay activist Robert Bauman was charged with having sex with a 16-year-old boy he picked up at a gay bar.\n\nRepublican Committee Chairman Jeffrey Patti was arrested for distributing a video clip of a 5-year-old girl being raped.\n\nRepublican activist Marty Glickman (a.k.a. “Republican Marty”), was taken into custody by Florida police on four counts of unlawful sexual activity with an underage girl and one count of delivering the drug LSD.\n\nRepublican legislative aide Howard L. Brooks was charged with molesting a 12-year old boy and possession of child pornography.\n\nRepublican Senate candidate John Hathaway was accused of having sex with his 12-year old baby sitter and withdrew his candidacy after the allegations were reported in the media.\n\nRepublican preacher Stephen White, who demanded a return to traditional values, was sentenced to jail after offering $20 to a 14-year-old boy for permission to perform oral sex on him.\n\nRepublican talk show host Jon Matthews pleaded guilty to exposing his genitals to an 11 year old girl.\n\nRepublican anti-gay activist Earl “Butch” Kimmerling was sentenced to 40 years in prison for molesting an 8-year old girl after he attempted to stop a gay couple from adopting her.\n\nRepublican Party leader Paul Ingram pleaded guilty to six counts of raping his daughters and served 14 years in federal prison.\n\nRepublican election board official Kevin Coan was sentenced to two years probation for soliciting sex over the internet from a 14-year old girl.\n\nRepublican politician Andrew Buhr was charged with two counts of first degree sodomy with a 13-year old boy.\n\nRepublican politician Keith Westmoreland was arrested on seven felony counts of lewd and lascivious exhibition to girls under the age of 16 (i.e. exposing himself to children).\n\nRepublican anti-abortion activist John Allen Burt was charged with sexual misconduct involving a 15-year old girl.\n\nRepublican County Councilman Keola Childs pleaded guilty to molesting a male child.\n\nRepublican activist John Butler was charged with criminal sexual assault on a teenage girl.\n\nRepublican candidate Richard Gardner admitted to molesting his two daughters.\n\nRepublican Councilman and former Marine Jack W. Gardner was convicted of molesting a 13-year old girl.\n\nRepublican County Commissioner Merrill Robert Barter pleaded guilty to unlawful sexual contact and assault on a teenage boy.\n\nRepublican City Councilman Fred C. Smeltzer, Jr. pleaded no contest to raping a 15 year-old girl and served 6-months in prison.\n\nRepublican activist Parker J. Bena pleaded guilty to possession of child pornography on his home computer and was sentenced to 30 months in federal prison and fined $18,000.\n\nRepublican parole board officer and former Colorado state representative, Larry Jack Schwarz, was fired after child pornography was found in his possession.\n\nRepublican strategist and Citadel Military College graduate Robin Vanderwall was convicted in Virginia on five counts of soliciting sex from boys and girls over the internet.\n\nRepublican city councilman Mark Harris, who is described as a “good military man” and “church goer,” was convicted of repeatedly having sex with an 11-year-old girl and sentenced to 12 years in prison.\n\nRepublican businessman Jon Grunseth withdrew his candidacy for Minnesota governor after allegations surfaced that he went swimming in the nude with four underage girls, including his daughter.\n\nRepublican director of the “Young Republican Federation” Nicholas Elizondo molested his 6-year old daughter and was sentenced to six years in prison.\n\nRepublican benefactor of conservative Christian groups, Richard A. Dasen Sr., was charged with rape for allegedly paying a 15-year old girl for sex. Dasen, 62, who is married with grown children and several grandchildren, has allegedly told police that over the past decade he paid more than $1 million to have sex with a large number of young women\n\nDennis Hastert served as Republican Speaker of the House (so, 3rd in line for the Presidency) for all 8 years of W. Bush’s two terms. He also sexually molested at least 5 boys when he was a HS wrestling coach, all of them underage with the youngest victim being 14. The victims only finally saw justice when Hastert was caught by the FBI trying to falsify payments for hush money.\n\nDonald Trump walked into Miss Teen USA change rooms with girls as young as 14 changing. 26 women have spoken publicly about Trump’s pattern of sexual assualt. In 2023, he was found legally liable for the rape of E. Jean Carroll by unanimous jury\n\nAnton “Tony” Lazzaro, a former Republican donor and political strategist from Minnesota, was convicted in March 2023 on federal charges of sex trafficking minors. He was found guilty of conspiring to recruit and pay teenage girls, aged 15 and 16, for sex between May and December 2020. In August 2023, Lazzaro was sentenced to 21 years in prison for these offenses.\n\nPrior to his arrest, Lazzaro was a prominent figure in Minnesota Republican circles, donating over $270,000 to various Republican campaigns and political committees. His indictment led to significant turmoil within the Minnesota Republican Party, culminating in the resignation of then-party chair Jennifer",
                "I know it's in the article, but the headline should have Republican in it.\n\n\nAs it's almost always a republican politicain.",
                "sick fuck, rot in hell",
                "Trump will pardon him and invite him to Mar-a-Lago.",
                "So, why is it that Republican isn’t in the forefront? I’d get it if it weren’t pertinent information. But Child SA and Republicans go together like peanut butter and jelly."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "HHS to cut 10,000 employees in major overhaul of health agencies",
            "external_url": "https://www.cnn.com/2025/03/27/health/hhs-rfk-job-cuts",
            "upvotes": 638,
            "date": "03/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2204184566.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "What could possibly go wrong?",
                "Are we great yet? Are enough people unemployed now?",
                "'Overhaul' is a very polite way of saying 'decimation'",
                "Once again. This saves the American people zero dollars because any money saved is to help pay off the (lack of) taxes for the rich. \n\nWe are essentially paying for services we no longer will receive.\n\nThat’s not “government efficiency”. That’s a scam.",
                "How many people has Trump laid off now? He really is trying to speed run crashing the economy.",
                "\"Overhaul\"? \n\nIt's the DESTRUCTION of health agencies. They are trying to fix or change anything. They want to dismantle the entire system.",
                "> The workforce reduction will save $1.8 billion per year, the agency said. \n\nThey're literally saving pennies in the grand scheme of government spending.",
                "It's a very bad time to be a scientist in the United States right now. Even more depressing is watching Republicans cheer on the destruction of literally tens of thousands of livelihoods.",
                "Clean water and clean air? How? Do these people talk to each other?",
                "who needs health am i right?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Private Data and Passwords of Senior U.S. Security Officials Found Online",
            "external_url": "https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7?sara_ref=re-so-app-sh",
            "upvotes": 20316,
            "date": "03/26/2025",
            "thumbnail": "https://cdn.prod.www.spiegel.de/images/87ac326a-da00-4ba1-b643-d410f8595cbe_w1200_r1.778_fpx60.66_fpy45.jpg",
            "top_comments": [
                "The clown show continues.\n\nI watch in amazement as the US won the cold war and now a bunch of village idiots absolutely wreck national security and long standing alliances in a couple of weeks.",
                ">To do so, the reporters used commercial people search engines along with hacked customer data that has been published on the web. Those affected by the leaks include National Security Adviser Mike Waltz, Director of National Intelligence Tulsi Gabbard and Secretary of Defense Pete Hegseth.  \n>  \n>Most of these numbers and email addresses are apparently still in use, with some of them linked to profiles on social media platforms like Instagram and LinkedIn. They were used to create Dropbox accounts and profiles in apps that track running data. There are also WhatsApp profiles for the respective phone numbers and even Signal accounts in some cases.  \n>  \n>[...]  \n>National Intelligence Director Gabbard was seemingly more careful with her data than her two male colleagues. She apparently had her own data blocked in the commercial contact search engines that contained the data of Hegseth and Waltz. But her email address was to be found on WikiLeaks and Reddit.  \n>  \n>Gabbard’s email address is available in more than 10 leaks. One of those also contains a partial telephone number, which, when completed, leads to an active WhatsApp account and a Signal profile.  \n>\n>src: https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7  \n  \nI can see quite a few people being very interested in exploiting this.",
                "😂😂😂😂😂\nOf course they are. Why would anyone with empathy or common sense expect competence from this administration???",
                "*Hostile intelligence services could use this publicly available data to hack the communications of those affected by installing spyware on their devices. It is thus conceivable that foreign agents were privy to the Signal chat group in which Gabbard, Waltz and Hegseth discussed a military strike.*\n\nThe headlines come fast and furious from T's desk, but the incompetence of the Admin seems equally propelled.",
                "I bet Trump has a sticky note with passwords on his computer monitor",
                "You just know the clowns in Trump's cabinet answer phishing emails all the time and have probably already infected multiple government systems with malware.",
                "We are seeing the fall of America in real time. Thanks Republicans!",
                "The soundtrack of the US Government is \"Yackety Sax\"",
                "Maga - Morons Are Governing America.",
                "Is now a good time to remind everyone that during the 2016 DNC hack, the Republicans were also hacked but WikiLeaks chose not to release any of that information? That decision led the public to believe that Democrats were insecure with how they handle their data while Republicans were not - which of course we all know now (and knew then, tbh) is the exact opposite."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Turkish student at Tufts University detained, video shows masked people handcuffing her",
            "external_url": "https://apnews.com/article/tufts-student-detained-massachusetts-immigration-6c3978da98a8d0f39ab311e092ffd892",
            "upvotes": 14504,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What are you even supposed to do in this case? Masked unidentified men claiming to be police with unmarked vehicles come to try to take you. Would calling 911 even help? What about self defense? ",
                "this is INSANE! the article said she wasn't an activist or member of any pro-Palestinian organization. She simply wrote an op-ed article for her campus paper, not even a national media outlet. She didn't organize protests or sit-ins or never was accused of harrassing or accosting Jewish students on campus. And the scary thing about it is that she hasn't even been accused of any crime. Her grad student visa (in the psychology department no less) was terminated on the whims of the Administration.",
                "Gestapo level shit.  Her lawyer has no idea where she is.",
                "People need to stop being complacent about this kind of stuff. They are detaining people with no due process. It's essentially kidnapping people who don't agree with the government's foreign policies. Whatever the fuck happened to free speech. They allow Nazis to walk around waving Swastika flags, but someone who criticizes Israel gets arrested like this? The double standards and hypocrisy of this government is pathetic. I wouldn't be surprised if the people who criticize Elon and Tesla end up getting kidnapped like this too.",
                "Why are they given till Friday to provide information?\n\nI understand if people disagree with someone’s opinion but they are literally violating the first amendment. And before you say she’s not a us citizen, the first amendment applies to all humans. If they can prove she violated some other law then prove it! Due process exists to protect the government and its people. It’s sad that there are Americans who don’t understand this and worse that there are Americans willing to participate.",
                "Individuals here on visas should start considering wearing AirTags in the undergarments so their whereabouts can be traced to some extent. Phones are the first thing they go for.",
                "Unfortunately this is going to give some people evil ideas. You could iterally have 4 or 6 guys walk up to a woman, say they are from ICE and kidnap a person. Just put on a mask, and add a halfway believable badge from your neck....the entire video is less than 2 minutes. How many times a day does this happen?",
                "Trumps secret police. Extinguish all freedom of speech.",
                "I never thought I'd see this in the USA.   Police showing up with masks.   Taking her like she's trash.  No due process.  No excuses.  She had no opportunity to appeal her condition.   And she was here legally.  Committed no crime.   Still not charged, but now in a hell hole.\n\nYou A-holes who voted for Trump...if you're still celebrating, then you show what you have become.   And you know.  It didn't end well for the Nazis either as I recall.",
                "They wore facial masks, so they can’t be identified as cowards because cameras are rolling. Simp cowards."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Trump places 25% tariff on imported autos, expecting to raise $100 billion in tax revenues",
            "external_url": "https://apnews.com/article/autos-tariffs-trump-tax-imports-ford-gm-e53823ef7bbb7b3c46d11eca90aaa638",
            "upvotes": 11052,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Didn't he say tariffs aren't a tax?",
                "Last year, my parents bought a new car, installed solar panels, upgraded their phones and laptops, and bought a new TV, all because they thought Trump might win and implement tariffs and these things would become more expensive. \n\nThey also voted for Trump.",
                "tax revenues from whom exactly?",
                "Boy that’ll put a nice dent in the **$500 billion** in projected tax reduction next year all because he doesn’t want to fund the IRS adequately.",
                "Does this mean it’ll cost more to buy cars? And that extra money will go to the US government, so they can lower the taxes of billionaires. Thats kinda lame.",
                "Another scandal to cover up with more bad governance. This regime is really a human fucking centipede of government",
                "This is a distraction from the Signal chat room. He'll take it away tomorrow or before markets close for the week ",
                "Oof. This is going to back fire.",
                "Americans mad at Biden because stuff's too expensive, elect a guy who adds a 25% tax on everything.\n\nDidn't think the leopards would eat *their* face.",
                "Fool. Everyone knows that he should place a 50% tariff to generate $200 billion in tax revenues."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Person in Ohio dies of rabies after contracting virus from organ transplant",
            "external_url": "https://www.whio.com/news/local/person-dies-rabies-after-contracting-virus-organ-transplant/HMS5STBDHZESJJ7FU6464OMN3I/",
            "upvotes": 32343,
            "date": "03/26/2025",
            "thumbnail": "https://cmg-cmg-tv-10040-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fcmg%2FYPMX5TX5QVGJJLZSDGUPWR7NGQ.jpg?auth=612d61eb069c04a50f81fce2778338c3c1cbaaf0f16c60a6d2c3cbff7f510de5&width=1200&height=630&smart=true",
            "top_comments": [
                "Wtf. So did the donor die of rabies too or just somehow died before the rabies set in and they didn’t know? So sad",
                "from the article:\n\n26 March 2025\n\nLUCAS COUNTY — A person died from rabies after receiving a transplanted organ in Lucas County earlier this year:\n\n>The recipient, who had undergone a kidney transplant in December, contracted the viral disease through the donated organ, according to the Toledo-Lucas County Health Department, WTOL reported.\n\n>As the recipient was from Michigan, Michigan’s Department of Health and Human Services worked with the Ohio Department of Health and the Centers for Disease Control and Prevention to investigate the case.\n\n>It marks the first human case of rabies in Michigan since 2009, according to WTOL.\n\n>No additional individuals are at risk of rabies exposure, according to the CDC.\n\n>Kara Steele, a representative from Life Connection of Ohio, could not comment on the specific case but explained to WTOL that a donor risk assessment interview is conducted before any organ donation.\n\n>The identities of both the recipient and the donor have not been released.\n\n>The facility where the transplant took place has also not been disclosed. \n\n>However, according to the University of Toledo Medical Center’s website, it is the only organ transplant center in northwest Ohio.\n\n>Fewer than 10 people in the United States die from rabies each year, according to the CDC.",
                "Didn't this happen in an episode of Scrubs?",
                "That's some fuck you in particular level shit.",
                "Maybe this is a question for a different subreddit.\n\nIf they figured this out shortly after the transplant could the recipient be saved by getting the rabies vaccine?    I am wondering if this is similar to having been bitten... it is in your body but is hasn't gotten into... the nerves(?) enough that the vaccine can help.  Maybe a transplant would be too much rabies all at once or in the wrong part of your body for the rabies treatment to be effective.",
                "There are other viruses where this has happened. There was a case that a donor got LCMV from his pet hamster and got into an accident.  7 out of 8 donors who go his organs died of LCMV, which is not considered wildly dangerous in humans.\n\nhttps://www.nejm.org/doi/full/10.1056/NEJMoa053240",
                "first comment on the article:\n\nsandytratt1 hour ago\n\nIn 2012 at this same hospital they threw a donor kidney into the trash during a transplant surgery. The poor woman eventually managed to get her transplant months later but the organ accidentally thrown out had been a perfect match donated by her brother.",
                "That is absolutely tragic. And one of THE WORST ways to die :( \n\nImagine having your brain literally liquified in real-time, as you lose all comprehension of the people and world around you, except for intense and overwhelming fear and confusion.",
                "The donor had rabies, but died of something else? This is really bizarre.",
                "Wow that seems insanely unlucky. You get an organ transplant from someone who was so unlucky they caught rabies and then died from something else before developing symptoms (usually happens in months rarely years) and that something else was something that let them donate organs!"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Figure skater whose parents died in D.C. plane crash says they changed their flight",
            "external_url": "https://www.nbcnews.com/sports/sports/figure-skater-whose-parents-died-dc-plane-crash-says-changed-flight-rcna198332",
            "upvotes": 345,
            "date": "03/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/max-naumov-mc-250327-copy-ec5088.jpg",
            "top_comments": [
                "Ugh, awful--that's an added level of shit to process on top of a whole lot of already difficult grief and shock that he must be going through. \n\nI fly a lot for work and tend to change my flights a lot on the fly when new meetings come up or get moved I need to still be able to make. Every time I do I always wonder if it's going to mean I either have changed into a flight that's destined to crash, or changed away from one that was going to crash.",
                "In plane crash stories, there are always some unfortunate incidences of people who changed their flight to be on the plane that crashed or relieving stories where someone changed their flight or missed the flight that crashed. Just the nature of it I suppose",
                "just so sad. I hope he has a strong support system, I can’t imagine how you even begin to process this kind of loss",
                "A meeting got canceled at my dad's work so he decided to go to the airport and get on standby for an earlier flight. He was flying from London to New York, to join the rest of us who had flown a day earlier to visit family. That was Dec 21, 1988. His original plane was bombed over Lockerbie, Scotland killing 270 people. \n\nWe didn't know he'd gotten the earlier flight. And when he landed in New York 3 hours earlier than expected, he decided to meet up with his best friend rather than go directly to his mom's house where we all were. It wasn't until someone called the best friend to inform him my dad was dead that dad found out about the crash."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Yale professor who studies fascism fleeing US to work in Canada",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/26/yale-professor-fascism-canada?CMP=Share_AndroidApp_Other",
            "upvotes": 2337,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4ca5fca8e505ad4e446eed6c79a9a958f0d89e2f/0_72_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1b62264f6b12cd17697d55043a02c080",
            "top_comments": [
                "A poignant quote from the article:  \"Social media posts spread on Wednesday, noting the alarm sounded by a scholar of fascism leaving the country over its political climate. Nikole Hannah-Jones, the journalist and creator of the 1619 Project,[wrote](https://bsky.app/profile/nhannahjones.bsky.social/post/3llakwvszts2c) on the social media platform Bluesky: “When scholars of authoritarianism and fascism leave US universities because of the deteriorating political situation here, we should really worry.”",
                "\"Those who do not learn from history are doomed to repeat it\"\n\nThis is simply an example of the inverse being true.",
                "This is one of the few silver linings for Canada - a reverse brain drain.\n\nStill, I'd rather have a sane southern neighbor.",
                "The vast majority of U.S. residents cannot leave. They either lack the resources or no one would be willing to take them on due to factors such as age, education, and others reasons. Protected is our freedom to travel, and essentially to leave has been our right. However, with a passport costing $250 and roughly 60% of Americans being a single paycheck away from homelessness, the majority have no freedom to travel or leave.  Trickle-down only worked for billionaires. The middle class has been significantly eroded over the past few decades. We are now stuck with our makings.",
                "He'll be back when he has to do his fieldwork.",
                "Fleeing from Germany to France vibes.",
                "Red flag: Those that study Fascism are leaving the US.\n\nTake note, MAGA. You’re the reason and you’re in a fascist cult.",
                "\"Out here, nobody knows where I am, and I’m believed to be away on a trip. Here are brewing economically and politically dark times, so I’m happy to be able to get away from everything.\" \n\n-Einstein hiding in Northern Germany in 1922, eleven years before he renounced his German citizenship following Hitlers rise to chancellor.",
                "I've read his books. When I saw this in the news yesterday, it really bummed me out. We're not headed in a good direction.",
                "This guy knows history, saw the signals early on, smart man."
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Six dead and dozens rescued after tourist submarine sinks off Egypt",
            "external_url": "https://news.sky.com/story/six-dead-and-dozens-rescued-after-tourist-submarine-sinks-off-egypt-13336566",
            "upvotes": 222,
            "date": "03/27/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-egypt-submarine-sinks_6868536.jpg?20250327143914",
            "top_comments": [
                "I've been in one of these and will never need to do it again. While it was a fun experience, the view isn't great. You need much larger windows to enjoy it as much as you think you will.",
                "Submarines are bad news, man. If nature wanted us down there, we’d have gills.",
                "Sounds like a bizarre adventure.",
                "Recent years have taught me not to go into tourist subs.",
                "Um, aren't submarines designed to sink?",
                "Well, That was a stoopid idea!"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "NEW",
            "title": "Scientists find 18 million tons of 'white gold' beneath California's Salton Sea worth $540 billion: Report",
            "external_url": "https://www.deccanherald.com/world/scientists-find-18-million-tons-of-white-gold-beneath-californias-salton-sea-worth-540-billion-report-3463540",
            "upvotes": 2554,
            "date": "03/27/2025",
            "thumbnail": "https://images.deccanherald.com/deccanherald%2F2025-03-26%2F1polbv4b%2FiStock-1272885374.jpg?rect=0%2C137%2C3644%2C1913&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
            "top_comments": [
                "Lithium. It's lithium. And it's double the amount estimated underneath Greenland.\n\nEdit: my math was a bit off lol...not double the amount....*it's WAY MORE*. A 2023 geological survey estimated 235,000 tonnes of lithium resources. 18,000,000 tonnes is more than that.",
                "I hate journalism these days. Just call it fucking Lithium and don't make me click to figure out what the hell you are talking about. \n\n\nMaybe I'm out of the loop but I've never heard it called white gold before",
                "Dam i should have bought the land years back when it was like 5k an acre.",
                "How long before Elon buys the Salton Sea for his battery operations?",
                "White gold?  So cocaine?",
                "A substantial Lithium deposit in the United States is a big deal.",
                "This means Greenland doesn’t need protecting by America?",
                "At less than $1 / oz, is 'gold' really the right comparable?",
                "Well good, maybe if they find cobalt and nickel somewhere they won't want Canada anymore.",
                "How long before Trump invades California?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Figure skater whose parents died in D.C. plane crash says they changed their flight",
            "external_url": "https://www.nbcnews.com/sports/sports/figure-skater-whose-parents-died-dc-plane-crash-says-changed-flight-rcna198332",
            "upvotes": 351,
            "date": "03/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/max-naumov-mc-250327-copy-ec5088.jpg",
            "top_comments": [
                "Ugh, awful--that's an added level of shit to process on top of a whole lot of already difficult grief and shock that he must be going through. \n\nI fly a lot for work and tend to change my flights a lot on the fly when new meetings come up or get moved I need to still be able to make. Every time I do I always wonder if it's going to mean I either have changed into a flight that's destined to crash, or changed away from one that was going to crash.",
                "In plane crash stories, there are always some unfortunate incidences of people who changed their flight to be on the plane that crashed or relieving stories where someone changed their flight or missed the flight that crashed. Just the nature of it I suppose",
                "just so sad. I hope he has a strong support system, I can’t imagine how you even begin to process this kind of loss",
                "A meeting got canceled at my dad's work so he decided to go to the airport and get on standby for an earlier flight. He was flying from London to New York, to join the rest of us who had flown a day earlier to visit family. That was Dec 21, 1988. His original plane was bombed over Lockerbie, Scotland killing 270 people. \n\nWe didn't know he'd gotten the earlier flight. And when he landed in New York 3 hours earlier than expected, he decided to meet up with his best friend rather than go directly to his mom's house where we all were. It wasn't until someone called the best friend to inform him my dad was dead that dad found out about the crash."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "HHS to cut 10,000 employees in major overhaul of health agencies",
            "external_url": "https://www.cnn.com/2025/03/27/health/hhs-rfk-job-cuts",
            "upvotes": 637,
            "date": "03/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2204184566.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "What could possibly go wrong?",
                "Are we great yet? Are enough people unemployed now?",
                "'Overhaul' is a very polite way of saying 'decimation'",
                "Once again. This saves the American people zero dollars because any money saved is to help pay off the (lack of) taxes for the rich. \n\nWe are essentially paying for services we no longer will receive.\n\nThat’s not “government efficiency”. That’s a scam.",
                "How many people has Trump laid off now? He really is trying to speed run crashing the economy.",
                "\"Overhaul\"? \n\nIt's the DESTRUCTION of health agencies. They are trying to fix or change anything. They want to dismantle the entire system.",
                "> The workforce reduction will save $1.8 billion per year, the agency said. \n\nThey're literally saving pennies in the grand scheme of government spending.",
                "It's a very bad time to be a scientist in the United States right now. Even more depressing is watching Republicans cheer on the destruction of literally tens of thousands of livelihoods.",
                "Clean water and clean air? How? Do these people talk to each other?",
                "who needs health am i right?"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "US honeybee deaths hit record high as scientists scramble to find main cause",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/25/honeybees-deaths-record-high",
            "upvotes": 10925,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ddbb4889fe4a8b0686f7bdaf1b74cc7a365ba0df/0_200_3000_1799/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2e9dd540a3f847f4f714379735a3b6bf",
            "top_comments": [
                "Half of America thinking climate change and environmental science is woke might have something to do with it.",
                "Stop using weed killer. It's toxic to them and destroys their main food sources.",
                "Well there’s the whole saturate the country in pesticides and glyphosate to start…",
                "> Commercial beekeepers have reported losing more than 60% of their colonies, on average, over the winter, according to an ongoing Project Apis m. survey that covers more than two-thirds of America’s managed bees.\n\nThe average winter loss used to be 10-20% until colony collapse began. They pollinate half our crops. This should freak everyone out.",
                "It's us. \"Us\" is the main cause",
                "Nothing will change without strict regulations on pesticides. It's not just agriculture sterilizing the countryside. Any idiot with a credit card can buy a barrel of poison and sterilize not just their yard but everything downwind and downstream of it for miles. \n\nWe thought we fixed everything by banning DDT, but that first Silent Spring was just the beginning. We're about to lose even more birds and wildlife in our world as insect populations continue to collapse.",
                "Who is scrambling?\n\nAnyone who has any amount of time greater than 30 seconds researching the decline in insect populations in the US know that insecticides and herbicides are the leading cause for the destruction of almost every single insect species.\n\nThese articles either try to shock people into thinking “omg how unexpected! Surely the big companies aren’t at fault and didn’t see this coming!” or the “scientists” they’re referring to are categorical fucking morons.\n\n\nMake no mistake, almost all insects are surprisingly integral to our ecosystems that we literally need to survive but Honeybees are some of, if not the, most important.\n\nWe lose them, we’re in serious trouble.",
                "neonicitinoids by agra biotech firms for crop pesticides- banned elsewhere, not in usa.",
                "People spraying their yards with mosquito killer. Kills everything.\nHerbicide and pesticides being used everywhere. Little critters have no chance.",
                "Scientists aren't scrambling to find the main cause, the people just don't like the answer."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "South Korea battles worst ever wildfires as death toll hits 26",
            "external_url": "https://www.reuters.com/world/asia-pacific/south-korea-battles-worst-ever-wildfires-death-toll-hits-26-2025-03-27/",
            "upvotes": 303,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That Gavin Newsom knows no bounds",
                "Let me guess dangerous California liberals strike again?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Former ND Sen. Ray Holmberg sentenced to 10 years in prison for sex crime",
            "external_url": "https://northdakotamonitor.com/2025/03/26/former-nd-sen-ray-holmberg-sentenced-to-10-years-in-prison-for-sex-crime/",
            "upvotes": 4001,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Some highlights here, though I do encourage everyone to read the article in full. \n\n* Prosecutors allege Holmberg traveled to Prague in the Czech Republic 14 times between 2011 and 2021 to pay for sex with boys. \n\n* Though not part of the charges against Holmberg, two men who said they met him in North Dakota and were victimized by him gave emotional testimony at the hearing. One said Holmberg gave him money to film sex acts in the 1990s. The other man who spoke at the hearing was a cooperating witness who said Holmberg used his political power to groom them for sex. \n\n* Holmberg said in court that he traveled to Prague with the intent of having sexual contact with minors, that he liked massages and some involved sexual contact. He said he might have received a sexual massage from someone under 18, but he’s not sure.\n\n* In one message, Holmberg sent a cooperating witness a link to a brothel in Prague with the comment, “The boys rent at around $60 … (sex is extra).”\n\n* Holmberg was linked to the investigation of Nicholas Morgan-Derosier, a Grand Forks man who was sentenced in May to 40 years on child pornography charges.\n\n* Holmberg, a Republican who held the powerful positions of Senate Appropriations Committee chair and head of Legislative Management, resigned from the Legislature in 2022. He was indicted on federal charges in October 2023.\n\n* Ray Holmberg, 81, was a Grand Forks state senator for 45 years, and received a sentence that is longer than federal sentencing guidelines. \n\n* U.S. District Judge Daniel Hovland characterized Holmberg’s conduct as “egregious and despicable” and said he didn’t think the guideline sentence of more than three years was adequate.\n\n* “From my perspective, this was not an isolated case and this is not a victimless crime,” Hovland said. “It displays a pattern of very vile, sickening criminal behavior.”\n\n* Holmberg was sentenced to *10* years. At age 81, it's likely he will die in prison.\n\n* Holmberg is not trans nor a drag queen.",
                ">Holmberg, a Republican who held the powerful positions of Senate Appropriations Committee chair and head of Legislative Management.\n\nYet again, the danger to children are the very people who fear monger about trans people or immigrants or whatever else can deflect attention away from themselves.",
                "Take one guess which party he represented…",
                "Wait does this one get sent to El Salvador too?",
                "Yes.  He was a Republican.\n\nAnd a school counselor.",
                "Republican anti-abortion activist Howard Scott Heldreth is a convicted child rapist in Florida.\n\nRepublican County Commissioner David Swartz pleaded guilty to molesting two girls under the age of 11 and was sentenced to 8 years in prison.\n\nRepublican judge Mark Pazuhanich pleaded no contest to fondling a 10-year old girl and was sentenced to 10 years probation.\n\nRepublican anti-abortion activist Nicholas Morency pleaded guilty to possessing child pornography on his computer and offering a bounty to anybody who murders an abortion doctor.\n\nRepublican legislator Edison Misla Aldarondo was sentenced to 10 years in prison for raping his daughter between the ages of 9 and 17.\n\nRepublican Mayor Philip Giordano is serving a 37-year sentence in federal prison for sexually abusing 8- and 10-year old girls.\n\nRepublican campaign consultant Tom Shortridge was sentenced to three years probation for taking nude photographs of a 15-year old girl.\n\nRepublican racist pedophile and United States Senator Strom Thurmond had sex with a 15-year old black girl which produced a child.\n\nRepublican pastor Mike Hintz, whom George W. Bush commended during the 2004 presidential campaign, surrendered to police after admitting to a sexual affair with a female juvenile.\n\nRepublican legislator Peter Dibble pleaded no contest to having an inappropriate relationship with a 13-year-old girl.\n\nRepublican activist Lawrence E. King, Jr. organized child sex parties at the White House during the 1980s.\n\nRepublican lobbyist Craig J. Spence organized child sex parties at the White House during the 1980s.\n\nRepublican Congressman Donald “Buz” Lukens was found guilty of having sex with a female minor and sentenced to one month in jail.\n\nRepublican fundraiser Richard A. Delgaudio was found guilty of child porn charges and paying two teenage girls to pose for sexual photos.\n\nRepublican activist Mark A. Grethen convicted on six counts of sex crimes involving children.\n\nRepublican activist Randal David Ankeney pleaded guilty to attempted sexual assault on a child.\n\nRepublican Congressman Dan Crane had sex with a female minor working as a congressional page.\n\nRepublican activist and Christian Coalition leader Beverly Russell admitted to an incestuous relationship with his step daughter.\n\nRepublican congressman and anti-gay activist Robert Bauman was charged with having sex with a 16-year-old boy he picked up at a gay bar.\n\nRepublican Committee Chairman Jeffrey Patti was arrested for distributing a video clip of a 5-year-old girl being raped.\n\nRepublican activist Marty Glickman (a.k.a. “Republican Marty”), was taken into custody by Florida police on four counts of unlawful sexual activity with an underage girl and one count of delivering the drug LSD.\n\nRepublican legislative aide Howard L. Brooks was charged with molesting a 12-year old boy and possession of child pornography.\n\nRepublican Senate candidate John Hathaway was accused of having sex with his 12-year old baby sitter and withdrew his candidacy after the allegations were reported in the media.\n\nRepublican preacher Stephen White, who demanded a return to traditional values, was sentenced to jail after offering $20 to a 14-year-old boy for permission to perform oral sex on him.\n\nRepublican talk show host Jon Matthews pleaded guilty to exposing his genitals to an 11 year old girl.\n\nRepublican anti-gay activist Earl “Butch” Kimmerling was sentenced to 40 years in prison for molesting an 8-year old girl after he attempted to stop a gay couple from adopting her.\n\nRepublican Party leader Paul Ingram pleaded guilty to six counts of raping his daughters and served 14 years in federal prison.\n\nRepublican election board official Kevin Coan was sentenced to two years probation for soliciting sex over the internet from a 14-year old girl.\n\nRepublican politician Andrew Buhr was charged with two counts of first degree sodomy with a 13-year old boy.\n\nRepublican politician Keith Westmoreland was arrested on seven felony counts of lewd and lascivious exhibition to girls under the age of 16 (i.e. exposing himself to children).\n\nRepublican anti-abortion activist John Allen Burt was charged with sexual misconduct involving a 15-year old girl.\n\nRepublican County Councilman Keola Childs pleaded guilty to molesting a male child.\n\nRepublican activist John Butler was charged with criminal sexual assault on a teenage girl.\n\nRepublican candidate Richard Gardner admitted to molesting his two daughters.\n\nRepublican Councilman and former Marine Jack W. Gardner was convicted of molesting a 13-year old girl.\n\nRepublican County Commissioner Merrill Robert Barter pleaded guilty to unlawful sexual contact and assault on a teenage boy.\n\nRepublican City Councilman Fred C. Smeltzer, Jr. pleaded no contest to raping a 15 year-old girl and served 6-months in prison.\n\nRepublican activist Parker J. Bena pleaded guilty to possession of child pornography on his home computer and was sentenced to 30 months in federal prison and fined $18,000.\n\nRepublican parole board officer and former Colorado state representative, Larry Jack Schwarz, was fired after child pornography was found in his possession.\n\nRepublican strategist and Citadel Military College graduate Robin Vanderwall was convicted in Virginia on five counts of soliciting sex from boys and girls over the internet.\n\nRepublican city councilman Mark Harris, who is described as a “good military man” and “church goer,” was convicted of repeatedly having sex with an 11-year-old girl and sentenced to 12 years in prison.\n\nRepublican businessman Jon Grunseth withdrew his candidacy for Minnesota governor after allegations surfaced that he went swimming in the nude with four underage girls, including his daughter.\n\nRepublican director of the “Young Republican Federation” Nicholas Elizondo molested his 6-year old daughter and was sentenced to six years in prison.\n\nRepublican benefactor of conservative Christian groups, Richard A. Dasen Sr., was charged with rape for allegedly paying a 15-year old girl for sex. Dasen, 62, who is married with grown children and several grandchildren, has allegedly told police that over the past decade he paid more than $1 million to have sex with a large number of young women\n\nDennis Hastert served as Republican Speaker of the House (so, 3rd in line for the Presidency) for all 8 years of W. Bush’s two terms. He also sexually molested at least 5 boys when he was a HS wrestling coach, all of them underage with the youngest victim being 14. The victims only finally saw justice when Hastert was caught by the FBI trying to falsify payments for hush money.\n\nDonald Trump walked into Miss Teen USA change rooms with girls as young as 14 changing. 26 women have spoken publicly about Trump’s pattern of sexual assualt. In 2023, he was found legally liable for the rape of E. Jean Carroll by unanimous jury\n\nAnton “Tony” Lazzaro, a former Republican donor and political strategist from Minnesota, was convicted in March 2023 on federal charges of sex trafficking minors. He was found guilty of conspiring to recruit and pay teenage girls, aged 15 and 16, for sex between May and December 2020. In August 2023, Lazzaro was sentenced to 21 years in prison for these offenses.\n\nPrior to his arrest, Lazzaro was a prominent figure in Minnesota Republican circles, donating over $270,000 to various Republican campaigns and political committees. His indictment led to significant turmoil within the Minnesota Republican Party, culminating in the resignation of then-party chair Jennifer",
                "I know it's in the article, but the headline should have Republican in it.\n\n\nAs it's almost always a republican politicain.",
                "sick fuck, rot in hell",
                "Trump will pardon him and invite him to Mar-a-Lago.",
                "So, why is it that Republican isn’t in the forefront? I’d get it if it weren’t pertinent information. But Child SA and Republicans go together like peanut butter and jelly."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "NEW",
            "title": "Federal judge who drew Trump's anger picks up new case against administration",
            "external_url": "https://www.npr.org/2025/03/26/nx-s1-5341540/boasberg-trump-signal-national-security-atlantic-lawsuit",
            "upvotes": 1155,
            "date": "03/26/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7717x4341+0+403/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9e%2Fd0%2Fdda890584c71ae6f922d4d089619%2Fgettyimages-2206891765.jpg",
            "top_comments": [
                "There are about 25 judges in the DC Federal District Court. Cases are ordinarily assigned randomly to a judge when they are filed. There are dozens of cases filed every day. \n\nThis isnt surprising.",
                "And so now Republicans are pivoting to the message that the federal judiciary needs to be abolished. \n\nWhy is it so hard to just not be a fucking criminal? This whole administration, worst than his last, is just like that guy at work who spends 110% of their effort avoiding having to do any real work when it would've been easier to just do the damn job and go home. \n\nBut no, instead of working within the confines of the law they are putting themselves into a position where they have to make truly radical statements like abolishing the federal judiciary because they've cornered themselves and its the only way out. \n\nFucking toddlers can't deal with getting their hand caught in the cookie jar and are going to murder the nation to get away with it instead of confessing and dealing with the consequences.",
                "I have a sinking feeling that he should invest in some bodyguards",
                " They’ll go after him again because being shitbags is all they know how to do.",
                "All the judges should adhere to the rules of law. Not distorting the law.",
                "This judge was pretty right on the spectrum iirc, it will be interesting and a good temperature check to follow how he proceeds with these cases.",
                "I did not know that 13yo bullies could be president.",
                "There's some clerk who is responsible for random assignments somewhere who can't stop laughing, I'm sure.",
                "is this another judge I'm going to be disappointed in?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Trump places 25% tariff on imported autos, expecting to raise $100 billion in tax revenues",
            "external_url": "https://apnews.com/article/autos-tariffs-trump-tax-imports-ford-gm-e53823ef7bbb7b3c46d11eca90aaa638",
            "upvotes": 11045,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Didn't he say tariffs aren't a tax?",
                "Last year, my parents bought a new car, installed solar panels, upgraded their phones and laptops, and bought a new TV, all because they thought Trump might win and implement tariffs and these things would become more expensive. \n\nThey also voted for Trump.",
                "tax revenues from whom exactly?",
                "Boy that’ll put a nice dent in the **$500 billion** in projected tax reduction next year all because he doesn’t want to fund the IRS adequately.",
                "Does this mean it’ll cost more to buy cars? And that extra money will go to the US government, so they can lower the taxes of billionaires. Thats kinda lame.",
                "Another scandal to cover up with more bad governance. This regime is really a human fucking centipede of government",
                "This is a distraction from the Signal chat room. He'll take it away tomorrow or before markets close for the week ",
                "Oof. This is going to back fire.",
                "Americans mad at Biden because stuff's too expensive, elect a guy who adds a 25% tax on everything.\n\nDidn't think the leopards would eat *their* face.",
                "Fool. Everyone knows that he should place a 50% tariff to generate $200 billion in tax revenues."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Yale professor who studies fascism fleeing US to work in Canada",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/26/yale-professor-fascism-canada?CMP=Share_AndroidApp_Other",
            "upvotes": 2318,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4ca5fca8e505ad4e446eed6c79a9a958f0d89e2f/0_72_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1b62264f6b12cd17697d55043a02c080",
            "top_comments": [
                "A poignant quote from the article:  \"Social media posts spread on Wednesday, noting the alarm sounded by a scholar of fascism leaving the country over its political climate. Nikole Hannah-Jones, the journalist and creator of the 1619 Project,[wrote](https://bsky.app/profile/nhannahjones.bsky.social/post/3llakwvszts2c) on the social media platform Bluesky: “When scholars of authoritarianism and fascism leave US universities because of the deteriorating political situation here, we should really worry.”",
                "\"Those who do not learn from history are doomed to repeat it\"\n\nThis is simply an example of the inverse being true.",
                "This is one of the few silver linings for Canada - a reverse brain drain.\n\nStill, I'd rather have a sane southern neighbor.",
                "The vast majority of U.S. residents cannot leave. They either lack the resources or no one would be willing to take them on due to factors such as age, education, and others reasons. Protected is our freedom to travel, and essentially to leave has been our right. However, with a passport costing $250 and roughly 60% of Americans being a single paycheck away from homelessness, the majority have no freedom to travel or leave.  Trickle-down only worked for billionaires. The middle class has been significantly eroded over the past few decades. We are now stuck with our makings.",
                "He'll be back when he has to do his fieldwork.",
                "Fleeing from Germany to France vibes.",
                "Red flag: Those that study Fascism are leaving the US.\n\nTake note, MAGA. You’re the reason and you’re in a fascist cult.",
                "\"Out here, nobody knows where I am, and I’m believed to be away on a trip. Here are brewing economically and politically dark times, so I’m happy to be able to get away from everything.\" \n\n-Einstein hiding in Northern Germany in 1922, eleven years before he renounced his German citizenship following Hitlers rise to chancellor.",
                "I've read his books. When I saw this in the news yesterday, it really bummed me out. We're not headed in a good direction.",
                "This guy knows history, saw the signals early on, smart man."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "US honeybee deaths hit record high as scientists scramble to find main cause",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/25/honeybees-deaths-record-high",
            "upvotes": 10950,
            "date": "03/27/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ddbb4889fe4a8b0686f7bdaf1b74cc7a365ba0df/0_200_3000_1799/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2e9dd540a3f847f4f714379735a3b6bf",
            "top_comments": [
                "Half of America thinking climate change and environmental science is woke might have something to do with it.",
                "Stop using weed killer. It's toxic to them and destroys their main food sources.",
                "Well there’s the whole saturate the country in pesticides and glyphosate to start…",
                "> Commercial beekeepers have reported losing more than 60% of their colonies, on average, over the winter, according to an ongoing Project Apis m. survey that covers more than two-thirds of America’s managed bees.\n\nThe average winter loss used to be 10-20% until colony collapse began. They pollinate half our crops. This should freak everyone out.",
                "It's us. \"Us\" is the main cause",
                "Nothing will change without strict regulations on pesticides. It's not just agriculture sterilizing the countryside. Any idiot with a credit card can buy a barrel of poison and sterilize not just their yard but everything downwind and downstream of it for miles. \n\nWe thought we fixed everything by banning DDT, but that first Silent Spring was just the beginning. We're about to lose even more birds and wildlife in our world as insect populations continue to collapse.",
                "Who is scrambling?\n\nAnyone who has any amount of time greater than 30 seconds researching the decline in insect populations in the US know that insecticides and herbicides are the leading cause for the destruction of almost every single insect species.\n\nThese articles either try to shock people into thinking “omg how unexpected! Surely the big companies aren’t at fault and didn’t see this coming!” or the “scientists” they’re referring to are categorical fucking morons.\n\n\nMake no mistake, almost all insects are surprisingly integral to our ecosystems that we literally need to survive but Honeybees are some of, if not the, most important.\n\nWe lose them, we’re in serious trouble.",
                "neonicitinoids by agra biotech firms for crop pesticides- banned elsewhere, not in usa.",
                "People spraying their yards with mosquito killer. Kills everything.\nHerbicide and pesticides being used everywhere. Little critters have no chance.",
                "Scientists aren't scrambling to find the main cause, the people just don't like the answer."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Scientists find 18 million tons of 'white gold' beneath California's Salton Sea worth $540 billion: Report",
            "external_url": "https://www.deccanherald.com/world/scientists-find-18-million-tons-of-white-gold-beneath-californias-salton-sea-worth-540-billion-report-3463540",
            "upvotes": 2550,
            "date": "03/27/2025",
            "thumbnail": "https://images.deccanherald.com/deccanherald%2F2025-03-26%2F1polbv4b%2FiStock-1272885374.jpg?rect=0%2C137%2C3644%2C1913&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
            "top_comments": [
                "Lithium. It's lithium. And it's double the amount estimated underneath Greenland.\n\nEdit: my math was a bit off lol...not double the amount....*it's WAY MORE*. A 2023 geological survey estimated 235,000 tonnes of lithium resources. 18,000,000 tonnes is more than that.",
                "I hate journalism these days. Just call it fucking Lithium and don't make me click to figure out what the hell you are talking about. \n\n\nMaybe I'm out of the loop but I've never heard it called white gold before",
                "Dam i should have bought the land years back when it was like 5k an acre.",
                "How long before Elon buys the Salton Sea for his battery operations?",
                "White gold?  So cocaine?",
                "A substantial Lithium deposit in the United States is a big deal.",
                "This means Greenland doesn’t need protecting by America?",
                "At less than $1 / oz, is 'gold' really the right comparable?",
                "Well good, maybe if they find cobalt and nickel somewhere they won't want Canada anymore.",
                "How long before Trump invades California?"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "HHS to cut 10,000 employees in major overhaul of health agencies",
            "external_url": "https://www.cnn.com/2025/03/27/health/hhs-rfk-job-cuts",
            "upvotes": 641,
            "date": "03/27/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2204184566.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "What could possibly go wrong?",
                "Are we great yet? Are enough people unemployed now?",
                "'Overhaul' is a very polite way of saying 'decimation'",
                "Once again. This saves the American people zero dollars because any money saved is to help pay off the (lack of) taxes for the rich. \n\nWe are essentially paying for services we no longer will receive.\n\nThat’s not “government efficiency”. That’s a scam.",
                "How many people has Trump laid off now? He really is trying to speed run crashing the economy.",
                "\"Overhaul\"? \n\nIt's the DESTRUCTION of health agencies. They are trying to fix or change anything. They want to dismantle the entire system.",
                "> The workforce reduction will save $1.8 billion per year, the agency said. \n\nThey're literally saving pennies in the grand scheme of government spending.",
                "It's a very bad time to be a scientist in the United States right now. Even more depressing is watching Republicans cheer on the destruction of literally tens of thousands of livelihoods.",
                "Clean water and clean air? How? Do these people talk to each other?",
                "who needs health am i right?"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Six dead and dozens rescued after tourist submarine sinks off Egypt",
            "external_url": "https://news.sky.com/story/six-dead-and-dozens-rescued-after-tourist-submarine-sinks-off-egypt-13336566",
            "upvotes": 221,
            "date": "03/27/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-egypt-submarine-sinks_6868536.jpg?20250327143914",
            "top_comments": [
                "I've been in one of these and will never need to do it again. While it was a fun experience, the view isn't great. You need much larger windows to enjoy it as much as you think you will.",
                "Submarines are bad news, man. If nature wanted us down there, we’d have gills.",
                "Sounds like a bizarre adventure.",
                "Recent years have taught me not to go into tourist subs.",
                "Um, aren't submarines designed to sink?",
                "Well, That was a stoopid idea!"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Figure skater whose parents died in D.C. plane crash says they changed their flight",
            "external_url": "https://www.nbcnews.com/sports/sports/figure-skater-whose-parents-died-dc-plane-crash-says-changed-flight-rcna198332",
            "upvotes": 345,
            "date": "03/27/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/max-naumov-mc-250327-copy-ec5088.jpg",
            "top_comments": [
                "Ugh, awful--that's an added level of shit to process on top of a whole lot of already difficult grief and shock that he must be going through. \n\nI fly a lot for work and tend to change my flights a lot on the fly when new meetings come up or get moved I need to still be able to make. Every time I do I always wonder if it's going to mean I either have changed into a flight that's destined to crash, or changed away from one that was going to crash.",
                "In plane crash stories, there are always some unfortunate incidences of people who changed their flight to be on the plane that crashed or relieving stories where someone changed their flight or missed the flight that crashed. Just the nature of it I suppose",
                "just so sad. I hope he has a strong support system, I can’t imagine how you even begin to process this kind of loss",
                "A meeting got canceled at my dad's work so he decided to go to the airport and get on standby for an earlier flight. He was flying from London to New York, to join the rest of us who had flown a day earlier to visit family. That was Dec 21, 1988. His original plane was bombed over Lockerbie, Scotland killing 270 people. \n\nWe didn't know he'd gotten the earlier flight. And when he landed in New York 3 hours earlier than expected, he decided to meet up with his best friend rather than go directly to his mom's house where we all were. It wasn't until someone called the best friend to inform him my dad was dead that dad found out about the crash."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "South Korea battles worst ever wildfires as death toll hits 26",
            "external_url": "https://www.reuters.com/world/asia-pacific/south-korea-battles-worst-ever-wildfires-death-toll-hits-26-2025-03-27/",
            "upvotes": 304,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "That Gavin Newsom knows no bounds",
                "Let me guess dangerous California liberals strike again?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Former ND Sen. Ray Holmberg sentenced to 10 years in prison for sex crime",
            "external_url": "https://northdakotamonitor.com/2025/03/26/former-nd-sen-ray-holmberg-sentenced-to-10-years-in-prison-for-sex-crime/",
            "upvotes": 4003,
            "date": "03/27/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Some highlights here, though I do encourage everyone to read the article in full. \n\n* Prosecutors allege Holmberg traveled to Prague in the Czech Republic 14 times between 2011 and 2021 to pay for sex with boys. \n\n* Though not part of the charges against Holmberg, two men who said they met him in North Dakota and were victimized by him gave emotional testimony at the hearing. One said Holmberg gave him money to film sex acts in the 1990s. The other man who spoke at the hearing was a cooperating witness who said Holmberg used his political power to groom them for sex. \n\n* Holmberg said in court that he traveled to Prague with the intent of having sexual contact with minors, that he liked massages and some involved sexual contact. He said he might have received a sexual massage from someone under 18, but he’s not sure.\n\n* In one message, Holmberg sent a cooperating witness a link to a brothel in Prague with the comment, “The boys rent at around $60 … (sex is extra).”\n\n* Holmberg was linked to the investigation of Nicholas Morgan-Derosier, a Grand Forks man who was sentenced in May to 40 years on child pornography charges.\n\n* Holmberg, a Republican who held the powerful positions of Senate Appropriations Committee chair and head of Legislative Management, resigned from the Legislature in 2022. He was indicted on federal charges in October 2023.\n\n* Ray Holmberg, 81, was a Grand Forks state senator for 45 years, and received a sentence that is longer than federal sentencing guidelines. \n\n* U.S. District Judge Daniel Hovland characterized Holmberg’s conduct as “egregious and despicable” and said he didn’t think the guideline sentence of more than three years was adequate.\n\n* “From my perspective, this was not an isolated case and this is not a victimless crime,” Hovland said. “It displays a pattern of very vile, sickening criminal behavior.”\n\n* Holmberg was sentenced to *10* years. At age 81, it's likely he will die in prison.\n\n* Holmberg is not trans nor a drag queen.",
                ">Holmberg, a Republican who held the powerful positions of Senate Appropriations Committee chair and head of Legislative Management.\n\nYet again, the danger to children are the very people who fear monger about trans people or immigrants or whatever else can deflect attention away from themselves.",
                "Take one guess which party he represented…",
                "Wait does this one get sent to El Salvador too?",
                "Yes.  He was a Republican.\n\nAnd a school counselor.",
                "Republican anti-abortion activist Howard Scott Heldreth is a convicted child rapist in Florida.\n\nRepublican County Commissioner David Swartz pleaded guilty to molesting two girls under the age of 11 and was sentenced to 8 years in prison.\n\nRepublican judge Mark Pazuhanich pleaded no contest to fondling a 10-year old girl and was sentenced to 10 years probation.\n\nRepublican anti-abortion activist Nicholas Morency pleaded guilty to possessing child pornography on his computer and offering a bounty to anybody who murders an abortion doctor.\n\nRepublican legislator Edison Misla Aldarondo was sentenced to 10 years in prison for raping his daughter between the ages of 9 and 17.\n\nRepublican Mayor Philip Giordano is serving a 37-year sentence in federal prison for sexually abusing 8- and 10-year old girls.\n\nRepublican campaign consultant Tom Shortridge was sentenced to three years probation for taking nude photographs of a 15-year old girl.\n\nRepublican racist pedophile and United States Senator Strom Thurmond had sex with a 15-year old black girl which produced a child.\n\nRepublican pastor Mike Hintz, whom George W. Bush commended during the 2004 presidential campaign, surrendered to police after admitting to a sexual affair with a female juvenile.\n\nRepublican legislator Peter Dibble pleaded no contest to having an inappropriate relationship with a 13-year-old girl.\n\nRepublican activist Lawrence E. King, Jr. organized child sex parties at the White House during the 1980s.\n\nRepublican lobbyist Craig J. Spence organized child sex parties at the White House during the 1980s.\n\nRepublican Congressman Donald “Buz” Lukens was found guilty of having sex with a female minor and sentenced to one month in jail.\n\nRepublican fundraiser Richard A. Delgaudio was found guilty of child porn charges and paying two teenage girls to pose for sexual photos.\n\nRepublican activist Mark A. Grethen convicted on six counts of sex crimes involving children.\n\nRepublican activist Randal David Ankeney pleaded guilty to attempted sexual assault on a child.\n\nRepublican Congressman Dan Crane had sex with a female minor working as a congressional page.\n\nRepublican activist and Christian Coalition leader Beverly Russell admitted to an incestuous relationship with his step daughter.\n\nRepublican congressman and anti-gay activist Robert Bauman was charged with having sex with a 16-year-old boy he picked up at a gay bar.\n\nRepublican Committee Chairman Jeffrey Patti was arrested for distributing a video clip of a 5-year-old girl being raped.\n\nRepublican activist Marty Glickman (a.k.a. “Republican Marty”), was taken into custody by Florida police on four counts of unlawful sexual activity with an underage girl and one count of delivering the drug LSD.\n\nRepublican legislative aide Howard L. Brooks was charged with molesting a 12-year old boy and possession of child pornography.\n\nRepublican Senate candidate John Hathaway was accused of having sex with his 12-year old baby sitter and withdrew his candidacy after the allegations were reported in the media.\n\nRepublican preacher Stephen White, who demanded a return to traditional values, was sentenced to jail after offering $20 to a 14-year-old boy for permission to perform oral sex on him.\n\nRepublican talk show host Jon Matthews pleaded guilty to exposing his genitals to an 11 year old girl.\n\nRepublican anti-gay activist Earl “Butch” Kimmerling was sentenced to 40 years in prison for molesting an 8-year old girl after he attempted to stop a gay couple from adopting her.\n\nRepublican Party leader Paul Ingram pleaded guilty to six counts of raping his daughters and served 14 years in federal prison.\n\nRepublican election board official Kevin Coan was sentenced to two years probation for soliciting sex over the internet from a 14-year old girl.\n\nRepublican politician Andrew Buhr was charged with two counts of first degree sodomy with a 13-year old boy.\n\nRepublican politician Keith Westmoreland was arrested on seven felony counts of lewd and lascivious exhibition to girls under the age of 16 (i.e. exposing himself to children).\n\nRepublican anti-abortion activist John Allen Burt was charged with sexual misconduct involving a 15-year old girl.\n\nRepublican County Councilman Keola Childs pleaded guilty to molesting a male child.\n\nRepublican activist John Butler was charged with criminal sexual assault on a teenage girl.\n\nRepublican candidate Richard Gardner admitted to molesting his two daughters.\n\nRepublican Councilman and former Marine Jack W. Gardner was convicted of molesting a 13-year old girl.\n\nRepublican County Commissioner Merrill Robert Barter pleaded guilty to unlawful sexual contact and assault on a teenage boy.\n\nRepublican City Councilman Fred C. Smeltzer, Jr. pleaded no contest to raping a 15 year-old girl and served 6-months in prison.\n\nRepublican activist Parker J. Bena pleaded guilty to possession of child pornography on his home computer and was sentenced to 30 months in federal prison and fined $18,000.\n\nRepublican parole board officer and former Colorado state representative, Larry Jack Schwarz, was fired after child pornography was found in his possession.\n\nRepublican strategist and Citadel Military College graduate Robin Vanderwall was convicted in Virginia on five counts of soliciting sex from boys and girls over the internet.\n\nRepublican city councilman Mark Harris, who is described as a “good military man” and “church goer,” was convicted of repeatedly having sex with an 11-year-old girl and sentenced to 12 years in prison.\n\nRepublican businessman Jon Grunseth withdrew his candidacy for Minnesota governor after allegations surfaced that he went swimming in the nude with four underage girls, including his daughter.\n\nRepublican director of the “Young Republican Federation” Nicholas Elizondo molested his 6-year old daughter and was sentenced to six years in prison.\n\nRepublican benefactor of conservative Christian groups, Richard A. Dasen Sr., was charged with rape for allegedly paying a 15-year old girl for sex. Dasen, 62, who is married with grown children and several grandchildren, has allegedly told police that over the past decade he paid more than $1 million to have sex with a large number of young women\n\nDennis Hastert served as Republican Speaker of the House (so, 3rd in line for the Presidency) for all 8 years of W. Bush’s two terms. He also sexually molested at least 5 boys when he was a HS wrestling coach, all of them underage with the youngest victim being 14. The victims only finally saw justice when Hastert was caught by the FBI trying to falsify payments for hush money.\n\nDonald Trump walked into Miss Teen USA change rooms with girls as young as 14 changing. 26 women have spoken publicly about Trump’s pattern of sexual assualt. In 2023, he was found legally liable for the rape of E. Jean Carroll by unanimous jury\n\nAnton “Tony” Lazzaro, a former Republican donor and political strategist from Minnesota, was convicted in March 2023 on federal charges of sex trafficking minors. He was found guilty of conspiring to recruit and pay teenage girls, aged 15 and 16, for sex between May and December 2020. In August 2023, Lazzaro was sentenced to 21 years in prison for these offenses.\n\nPrior to his arrest, Lazzaro was a prominent figure in Minnesota Republican circles, donating over $270,000 to various Republican campaigns and political committees. His indictment led to significant turmoil within the Minnesota Republican Party, culminating in the resignation of then-party chair Jennifer",
                "I know it's in the article, but the headline should have Republican in it.\n\n\nAs it's almost always a republican politicain.",
                "sick fuck, rot in hell",
                "Trump will pardon him and invite him to Mar-a-Lago.",
                "So, why is it that Republican isn’t in the forefront? I’d get it if it weren’t pertinent information. But Child SA and Republicans go together like peanut butter and jelly."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Private Data and Passwords of Senior U.S. Security Officials Found Online",
            "external_url": "https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7?sara_ref=re-so-app-sh",
            "upvotes": 20314,
            "date": "03/26/2025",
            "thumbnail": "https://cdn.prod.www.spiegel.de/images/87ac326a-da00-4ba1-b643-d410f8595cbe_w1200_r1.778_fpx60.66_fpy45.jpg",
            "top_comments": [
                "The clown show continues.\n\nI watch in amazement as the US won the cold war and now a bunch of village idiots absolutely wreck national security and long standing alliances in a couple of weeks.",
                ">To do so, the reporters used commercial people search engines along with hacked customer data that has been published on the web. Those affected by the leaks include National Security Adviser Mike Waltz, Director of National Intelligence Tulsi Gabbard and Secretary of Defense Pete Hegseth.  \n>  \n>Most of these numbers and email addresses are apparently still in use, with some of them linked to profiles on social media platforms like Instagram and LinkedIn. They were used to create Dropbox accounts and profiles in apps that track running data. There are also WhatsApp profiles for the respective phone numbers and even Signal accounts in some cases.  \n>  \n>[...]  \n>National Intelligence Director Gabbard was seemingly more careful with her data than her two male colleagues. She apparently had her own data blocked in the commercial contact search engines that contained the data of Hegseth and Waltz. But her email address was to be found on WikiLeaks and Reddit.  \n>  \n>Gabbard’s email address is available in more than 10 leaks. One of those also contains a partial telephone number, which, when completed, leads to an active WhatsApp account and a Signal profile.  \n>\n>src: https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7  \n  \nI can see quite a few people being very interested in exploiting this.",
                "😂😂😂😂😂\nOf course they are. Why would anyone with empathy or common sense expect competence from this administration???",
                "*Hostile intelligence services could use this publicly available data to hack the communications of those affected by installing spyware on their devices. It is thus conceivable that foreign agents were privy to the Signal chat group in which Gabbard, Waltz and Hegseth discussed a military strike.*\n\nThe headlines come fast and furious from T's desk, but the incompetence of the Admin seems equally propelled.",
                "I bet Trump has a sticky note with passwords on his computer monitor",
                "You just know the clowns in Trump's cabinet answer phishing emails all the time and have probably already infected multiple government systems with malware.",
                "We are seeing the fall of America in real time. Thanks Republicans!",
                "The soundtrack of the US Government is \"Yackety Sax\"",
                "Maga - Morons Are Governing America.",
                "Is now a good time to remind everyone that during the 2016 DNC hack, the Republicans were also hacked but WikiLeaks chose not to release any of that information? That decision led the public to believe that Democrats were insecure with how they handle their data while Republicans were not - which of course we all know now (and knew then, tbh) is the exact opposite."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Turkish student at Tufts University detained, video shows masked people handcuffing her",
            "external_url": "https://apnews.com/article/tufts-student-detained-massachusetts-immigration-6c3978da98a8d0f39ab311e092ffd892",
            "upvotes": 14508,
            "date": "03/26/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "What are you even supposed to do in this case? Masked unidentified men claiming to be police with unmarked vehicles come to try to take you. Would calling 911 even help? What about self defense? ",
                "this is INSANE! the article said she wasn't an activist or member of any pro-Palestinian organization. She simply wrote an op-ed article for her campus paper, not even a national media outlet. She didn't organize protests or sit-ins or never was accused of harrassing or accosting Jewish students on campus. And the scary thing about it is that she hasn't even been accused of any crime. Her grad student visa (in the psychology department no less) was terminated on the whims of the Administration.",
                "Gestapo level shit.  Her lawyer has no idea where she is.",
                "People need to stop being complacent about this kind of stuff. They are detaining people with no due process. It's essentially kidnapping people who don't agree with the government's foreign policies. Whatever the fuck happened to free speech. They allow Nazis to walk around waving Swastika flags, but someone who criticizes Israel gets arrested like this? The double standards and hypocrisy of this government is pathetic. I wouldn't be surprised if the people who criticize Elon and Tesla end up getting kidnapped like this too.",
                "Why are they given till Friday to provide information?\n\nI understand if people disagree with someone’s opinion but they are literally violating the first amendment. And before you say she’s not a us citizen, the first amendment applies to all humans. If they can prove she violated some other law then prove it! Due process exists to protect the government and its people. It’s sad that there are Americans who don’t understand this and worse that there are Americans willing to participate.",
                "Individuals here on visas should start considering wearing AirTags in the undergarments so their whereabouts can be traced to some extent. Phones are the first thing they go for.",
                "Unfortunately this is going to give some people evil ideas. You could iterally have 4 or 6 guys walk up to a woman, say they are from ICE and kidnap a person. Just put on a mask, and add a halfway believable badge from your neck....the entire video is less than 2 minutes. How many times a day does this happen?",
                "Trumps secret police. Extinguish all freedom of speech.",
                "I never thought I'd see this in the USA.   Police showing up with masks.   Taking her like she's trash.  No due process.  No excuses.  She had no opportunity to appeal her condition.   And she was here legally.  Committed no crime.   Still not charged, but now in a hell hole.\n\nYou A-holes who voted for Trump...if you're still celebrating, then you show what you have become.   And you know.  It didn't end well for the Nazis either as I recall.",
                "They wore facial masks, so they can’t be identified as cowards because cameras are rolling. Simp cowards."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "03/27/2025 16:10:56 UTC"
}