{
    "posts": [
        {
            "category": "HOT",
            "title": "Trump fires director of U.S. Copyright Office, sources say",
            "external_url": "https://www.cbsnews.com/news/trump-fires-director-of-u-s-copyright-office-shira-perlmutter-sources/",
            "upvotes": 9988,
            "date": "05/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/10/a3bf9ec7-3ddf-4570-bdff-eafb746800a4/thumbnail/1200x630/4e1e701b4e0cf5c481072b89781d79bc/gettyimages-2213647884.jpg?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "\"...Perlmutter's firing was \"a brazen, unprecedented power grab with no legal basis.... surely no coincidence he acted less than a day after she refused to rubber-stamp Elon Musk's efforts to mine troves of copyrighted works to train AI models,\" in reference to the report released by the Copyright Office this week.  \n\nLast month, Musk took to his social media platform X to seemingly express support for the abolition of intellectual property laws...\"",
                "He sure is firing people left and right. Is there a website that tracks all the government heads that are being fired? I know I posted earlier that he fired the Librarian for Congress Friday. [https://federalnewsnetwork.com/workforce/2025/05/president-donald-trump-fires-librarian-of-congress-carla-hayden/](https://federalnewsnetwork.com/workforce/2025/05/president-donald-trump-fires-librarian-of-congress-carla-hayden/)\n\nEdit: Added another name and more details who has been fired..Earlier Thursday, the [acting administrator of the Federal Emergency Management Agency](https://apnews.com/article/fema-trump-administrator-replaced-emergency-b9ae5e6a7e1c09e51de99c5148f45eb2) was pushed out one day after he had testified that he did not agree with proposals to dismantle the organization. Trump has suggested that individual states, not FEMA, should take the lead on responding to hurricanes, tornadoes and other crises.\n\nAt the Pentagon, more than a half-dozen [top general officers have been fired](https://apnews.com/article/trump-brown-joint-chiefs-of-staff-firing-fa428cc1508a583b3bf5e7a5a58f6acf) since January, including the chairman of the Joint Chiefs of Staff, Gen. CQ Brown Jr. The only two women serving as four-star officers, as well as a disproportionate number of other senior female officers, have also been fired.",
                "We all know the intellectual property laws are only going to be suspended for the rich and corporations",
                "We're cooked.  Elon can just steal whatever he wants now",
                "Damn I was half joking when I said this office was going to be fired for denying Elons copyright claims and it happens less than a week later. This is going into banana republic levels of corruption.",
                "Strikes me as an admission that Elon's underlings weren't skilled enough to steal copyrighted work like every other major AI company does.",
                "Wasn’t this the issue that started the first Trade War with China?",
                "Trump, gutting US civilization.",
                "Musk had to stop the director’s report that his xAI training is copyright infringement.",
                "Y'know...ordinarily, if an administration does its job well enough to keep a government by of and for the people running properly, I can tolerate ideological differences within reason. But you have to do a good job first. You have to preserve the system of people-run governance. You have to maintain the integrity of the Constitution--not just in word, but in spirit. You have to keep the ship running and in, more or less, the right direction. \n\n  \nBut what I can't tolerate, is what *this* administration is doing. It has nothing to do with ideology. This is a recklessly harmful thing to do and I wish someone within this administration had the courage and sense enough to recommend against acts like these. Putting an ill-suited, inexperienced crony loyalist in charge of the copyright office is a ruinously dumb headed thing to do. And it speaks ill of the administration's competency and utter disregard for practical or moral consideration in restraining the chief executive's impulsive desire for revenge against every person and every institution which already *has* made America great.\n\n\n\nIt is simply wrong to do."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump to accept luxury jet from Qatar to use as Air Force One",
            "external_url": "https://edition.cnn.com/2025/05/11/politics/trump-luxury-jet-qatar-air-force-one",
            "upvotes": 32358,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21615401-2114540-75-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "It's funny he says Americans should give up having so many dolls but he has to have a new plane",
                "Nothing says state secrets for sale, like a free jet.",
                "Air Force One is more than a \"luxury jet\". It's a flying command center for the U.S. government.",
                "He does not need any security against spying.  \nAlso, this is his friend in Qatar giving trump a $400 million bribe.  \nTrump says at the end his presidency this $400 million plane will transfer to Trump as his personal property.  \nThe bribes dont stop. ",
                "It’s ok everyone because it was not Biden accepting the gift. It is only corruption if Biden does it.",
                "How the hell is this acceptable to all those farm boys and joe six packs?  Fuckin dumbass morons.  Clearly a violation of the emoluments clause.",
                "He's incapable of doing a single thing worthy of the office.",
                "Yo trumpers. He getting a 400 million dollar bribe, you get $9 eggs to eat with dirt.",
                "Perhaps we should make a provision in the Constitution to prohibit this? We could call it the Emoluments Clause or something.",
                "Change that to Biden or Obama and watch the shit storm conservatives *should* have about this."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "'Children handcuffed and shot' - ex-UK Special Forces break silence on war crime claims",
            "external_url": "https://www.bbc.com/news/articles/cj3j5gxgz0do",
            "upvotes": 1772,
            "date": "05/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8442/live/4af02840-2efa-11f0-8f57-b7237f6a66e6.jpg",
            "top_comments": [
                "\"Former members of UK Special Forces have broken years of silence to give BBC Panorama eyewitness accounts of alleged war crimes committed by colleagues in Iraq and Afghanistan.\n\nGiving their accounts publicly for the first time, the veterans described seeing members of the SAS murder unarmed people in their sleep and execute handcuffed detainees, including children.\n\n\"They handcuffed a young boy and shot him,\" recalled one veteran who served with the SAS in Afghanistan. \"He was clearly a child, not even close to fighting age.\"\n\nKilling of detainees \"became routine\", the veteran said. \"They'd search someone, handcuff them, then shoot them\", before cutting off the plastic handcuffs used to restrain people and \"planting a pistol\" by the body, he said.\n\n...\n\nKnowledge of the alleged crimes was not confined to small teams or individual squadrons, according to the testimony. Within the UK Special Forces command structure, \"everyone knew\" what was happening, said one veteran.\n\n...\n\n\"There was a fake grenade they'd take with them onto target, it couldn't detonate,\" said a former SAS operator. Another veteran said operators would carry AK-47 rifles which had a folding stock because they were easier to fit into their rucksacks and \"easier to bring onto a target and plant by a body\".\n\nOfficers would then help to falsify post-operational reports in order to avoid scrutiny for the actions of assault teams on the ground, according to the testimony.\n\n...\n\n\"If it looked like a shooting could represent a breach of the rules of conflict, you'd get a phone call from the legal adviser or one of the staff officers in HQ. They'd pick you up on it and help you to clarify the language. 'Do you remember someone making a sudden move?' 'Oh yeah, I do now.' That sort of thing. It was built into the way we operated.\"\n\nThe reports were \"a fiction\", another UKSF veteran said.\n\nAn intelligence officer who worked with the SBS described reports which said they had been caught in a firefight, while the photos showed bodies with \"multiple clean headshots\".\n\n...\n\nThe Afghan president was \"so consistent with his complaints about night raids, civilian casualties and detentions that there was no senior Western diplomat or military leader who would have missed the fact that this was a major irritant for him,\" said Gen Douglas Lute, a former US ambassador to Nato.\n\n...\"",
                "We are outraged when Russian troops do stuff like this, and rightly so. We should be similarly outraged when friendly forces do such things. This wasn’t a small bunch of soldiers going rogue, this was an institutionalised disregard for the ethics of warfare and established military protocol.",
                "This is horrifying. All these people should be brought to justice. No whitewashing for european armies if they behave like bloodthirsty monster on the field. \n\nAn army that behaves like a mad beast should be restrained and reformed and the leaders that allowed it should be imprisoned and be made to paid for their complicity if not outright orders to do this. For all the supposed \"responsibilities\" of command that justifiers their higher salaries and benefits, they don't seem to accept the consequences of their failed leadership when the chickens come home to roost.",
                "At this point, we should all understand that these kinds of things will be happening any time we're sending people into these sorts of situations. War makes monsters of people, or at least lets monsters thrive. Is whatever we're doing with those boots on the ground worth that price?",
                "As humans our capacity for inhumane violence is impressive and 100% depressing.",
                "It was a blatant and abhorrent invasion from day one:\n\n1. The sorry excuse of WMD to invade a foreign country by a set of countries playing games for their own personal gains.\n2. Studies say that around 0.5 Million people died due to the invasion and many more injured.\n3. Not to mention the damage to the infrastructure, political structures and the economic impact on the country invaded.\n\nThe media is complicit in all of this as the coverage was shameful to say the least. They have parroted the official propagandized versions for so long. The UN, for what its worth did not authorize the invasion.\n\nDid any of the true decision makers face the law due to this? Is there any guilt shown at the very least? Did some of them line-up their own pockets throughout this ordeal?\n\nThis will answer why massive \"mistakes\" of this ilk are being repeated at an alarming frequency.\n\nSources:\n\n[https://www.bbc.com/news/world-middle-east-24547256](https://www.bbc.com/news/world-middle-east-24547256)\n\n[https://watson.brown.edu/costsofwar/costs/human/civilians](https://watson.brown.edu/costsofwar/costs/human/civilians)",
                "You can bet this would be front page and headline news everywhere if it was a Middle Eastern country.  Especially a certain one being blitzed to hell by a western ally, where it’s already been proven that said ally does this sort of thing.",
                "They’ve been at it for centuries. Thank you to the brave people telling the truth.",
                "British forces have been murdering people in Ireland for generations. You won't find many here shocked by this news",
                "Why are people surprised. Give weapons (arms or just power) to any group of people, and they will abuse it. Torture, murders and rapes have been long standing traditions of any armed forces (or militants/ terrorists). Whether the war was justified or not is completely irrelevant. If anyone believes their armed forces are above all this and are the good guys…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US and China are set to drastically roll back tariffs",
            "external_url": "https://www.cnn.com/2025/05/12/business/us-china-trade-deal-announcement-intl-hnk",
            "upvotes": 780,
            "date": "05/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2214092889.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "A *temporary reduction* for 90 days. This administration is going to run 3 month pump and dump cycles on the entire market for the foreseeable future.",
                "He starts a fire and waits till the house is nearly burnt down then he puts it out and expects everyone to thank him with roaring applause for putting it out.",
                "So -- it was all political theatre  this whole time?",
                "Note how it says “temporary reduction” so he’ll just pull the same shit and manipulate the stock market again in a couple months.",
                "Imagine fucking things over only to claim you fixed things and think he did something great? Fuck him. He’s trying to make himself look like some sort of savior when he created this goddamn problem.",
                "Everything about MAGA is a performance. They are acting out what it means to do things. Then they don't do them and act as if it was effective because they stopped it from being worse, though it was worse because they did something.",
                "create the problem and then pat yourself on the back for fixing it.",
                "\\> 90 days pause\n\n\\>still tariffs,just cuts\n\nOh fantastic, So instead of empty shelves just  in June and July. We'll have more empty shelves in fall or winter",
                "Huh? I thought the US was. Getting ripped off by China and tariffs needed so they could build factories so China wasn’t needed?",
                "So the US decided to backtrack once literally nothing was being imported from China and they realized the devastation this would cause to the US economy? What did they get out of this?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Turkiye discovers 20bn barrels of crude oil in Somalia",
            "external_url": "https://www.middleeastmonitor.com/20250509-turkiye-discovers-20bn-barrels-of-crude-oil-in-somalia/",
            "upvotes": 466,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "We gonna get a sequel to Black Hawk Down soon",
                "Who put all those barrels there???",
                "Look! I \"discovered\" 30 gallons of gasoline in my neighbor's car! Well, I *say* \"neighbor;\" he lives a few blocks down the street. Any takers?",
                "If you are sick of reading a variation of the same joke in every comment and want some context:\n\n“Turkey secures rights to 90 percent of oil and gas output in Somalia deal”\n\nFull article: https://nordicmonitor.com/2025/04/turkey-secures-exceptional-rights-in-somalia-oil-agreement-documents-show/",
                "US \"liberation\" of Somalia in 3... 2... 1...",
                "And I'm sure the impoverished people of Somalia will be getting their share of the profits... right? Right???",
                "Perfect!  Because Somalia already has war, now they have the oil to ensure it continues.",
                "And I’m sure Somalia will be properly compensated. /s",
                "Leave it in the ground, it's dirty.",
                "Keep it underground and give Somali people 20bn dollar to create a sustainable economy instead."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Equipment issue again disrupts air traffic at Newark Liberty airport: FAA",
            "external_url": "https://abcnews.go.com/US/equipment-issue-disrupts-air-traffic-newark/story?id=121689373",
            "upvotes": 1656,
            "date": "05/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/803ced13-8a83-42f6-b0f4-5b7a3ade37b3/newark-airport-gty-bh-250511_1746973704002_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "So Newark has been blinded 4 times, the Harry S Truman has lost 3 multimillion dollar jets, and there have been multiple near misses near Reagan. Not a great week for aviation.",
                "Do they just not have it support there anymore?",
                "*The incident marks the fourth time in the past two weeks that technical problems have disrupted air traffic at Newark Liberty*.\n\nWell, if any worker speaks out, he or she may get a few lines of coverage and then vanish both from a job and further coverage.",
                "Article by Bill Hutchinson, Sam Sweeney, and Ayesha Ali \n\n>Air traffic control [problems](https://www.goodmorningamerica.com/News/video/major-flight-disruptions-newark-airport-air-traffic-controllers-121463611) continued at Newark Liberty International Airport on Sunday morning after an equipment issue prompted the Federal Aviation Administration to order a 45-minute ground stop at the New Jersey airport, officials said.\n\n>The FAA said in a statement that a telecommunications issue at the Philadelphia TRACON (terminal radar approach control) Area C facility, which guides aircraft in and out of Newark, caused the agency to issue a ground stop.\n\n>\"The FAA briefly slowed aircraft in and out of the airport while we ensured redundancies were working as designed,\" the FAA said in its [statement](https://x.com/FAANews/status/1921578482863104259).\n\n>As of 11 a.m. ET, the FAA said, \"operations have returned to normal\" at Newark Liberty.\n\n>On Sunday afternoon, the FAA released updated information, saying an audio issue, not an outage, prompted the ground stop at Newark. The agency said there were popping sounds on an unspecified number of radio frequencies. While air traffic controllers were able to communicate with aircraft, the radio system was not working correctly, prompting the switch to a backup system, the FAA said.\n\n>The incident marks the fourth time in the past two weeks that technical problems have disrupted air traffic at Newark Liberty.\n\n>On Friday morning, [radar screens at the airport went black](https://abcnews.go.com/US/radar-screens-newark-airport-black-overnight/story?id=121638395) for approximately 90 seconds, according to the FAA. During the outage, which occurred at about 3:55 a.m. ET, air traffic controllers could be heard telling a FedEx plane that their screens had gone dark and then asking the aircraft to tell their company to apply pressure to get the problem fixed.\n\n>In another transmission, a controller told an arriving private jet that the airport just had experienced a brief radar outage and to stay at or above 3,000 feet in case the controllers couldn't get in touch during the aircraft's descent.\n\n>The FAA said that the Friday outage stemmed from a \"telecommunications outage that impacted communications and radar display at Philadelphia TRACON Area C,\" which is the facility that covers the airspace around Newark.\n\n>On April 28, an [outage at Newark Liberty](https://abcnews.go.com/US/newark-airport-outage-week-lasted-60-90-seconds/story?id=121484044) caused air traffic control computer screens to go dark for roughly 60 to 90 seconds and also prevented the controllers from talking to aircraft during the outage, multiple sources with knowledge of the incident told ABC News. As a result, the FAA halted all departures to the Newark airport, citing \"telecommunications and equipment issues at Philadelphia TRACON.\"\n\n>ABC News also confirmed a minor outage at Newark Liberty that occurred on April 30.\n\n>Following the April 29 outage, several controllers went on medical leave, calling the experience a traumatic event. The controllers are entitled to at least 45 days away from the job and must be evaluated by a doctor before they can return to work.",
                "Where are the whistleblowers to tell us about how all the jobs that were cut are one of the reasons for this?",
                "The Republicans talk out both sides of their ass, they canceled all of Biden’s plans in place to improve infrastructure so they could put the cash into their pockets and then they start blaming everybody else for the situation.",
                "Is there actually anything wrong with the equipment, or is this just being done to justify Trump's \"upgrade\" and privatization of the air traffic control system?",
                "This is what happens when you fire institutional knowledge.",
                "Years of neglect has taken its toll and now the chickens have come to roost.",
                "Don’t worry, it’s Phil Murphy’s fault according to the blowhards in my Newark suburb neighborhood facebook group"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "The FDA approves first U.S. at-home tool as a Pap-smear alternative",
            "external_url": "https://www.npr.org/2025/05/10/nx-s1-5394446/fda-cervical-cancer-screening-at-home-tool-pap-smear",
            "upvotes": 3416,
            "date": "05/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2500x1406+0+130/resize/1400/quality/100/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4f%2F9a%2Fd177b2534555b2b79a3e860ac46f%2Fimage-1.png",
            "top_comments": [
                "This tiny spot of good news is like when it rains *very lightly* for like 6 seconds, during a raging hellfire inferno that's destroying everything around you. ",
                "Sweet fuck thank you. I had an iud put in that went terribly wrong, leading to the Dr having to caulderize my cervix. Since then, even pap smears are too much for me. I put them off as long as I can due to anxiety, clenching, and pain. I'll definitely be using this as soon as it's available.",
                "*Article Text by Jennifer Ludden:* \n\nThe Food and Drug administration has approved the U.S.'s first at-home alternative to the Pap smear, a procedure generations of women have dreaded and often found painful.\n\nThe new device by Teal Health will offer a \"much preferred experience,\" the company said in its announcement, and also aims to increase screening rates by making the procedure more convenient.\n\nTraditionally, gynecologists have inserted a cold metal speculum deep into a woman's vagina to scrape cells from the cervix.\n\nThe Teal Wand — \"built with empathy,\" the company said — uses a swab to collect a vaginal sample. Women will then mail the sample to a lab that will screen for HPV (human papillomavirus), the virus that causes nearly all cervical cancers. A growing body of research has found HPV testing to be highly accurate.\n\nThe FDA approval Friday follows a U.S.-based study that found at-home screening was just as effective as that done in a doctor's office. The study also found women overwhelmingly preferred self–screening at home, and said they'd be more likely to stay up to date with cervical cancer screenings that way.\n\nEvery year, about 13,000 cases of cervical cancer are diagnosed, and more than 4,000 women die from the disease. Rates are down dramatically since Dr. Georgios Papanicolaou published a 1943 paper on how to use the Pap smear for screening, and it then became common.\n\nBut about a quarter of women in the U.S. are behind on such screenings, and medical experts say reducing that is key to the ultimate goal of eliminating cervical cancer. There's also a racial gap, with Black and Native American women far more likely to die from cervical cancer than white women. The HPV vaccine for teen and preteen girls, introduced in 2007, has also led to a global push to tackle the disease that way.\n\nAt-home cervical cancer screenings are already available in several other countries, including Australia and Sweden.\n\nTeal Health says its self-testing device will be available starting next month, in California first and then expanding. It will be by prescription, through a telehealth service, for women 25-65 years old who are \"at average risk.\" The company says it's working with insurance companies to provide coverage.",
                "Canada’s had this for a while. Much better alternative.",
                "Is much rather do it myself because I can slow down or stop when I feel pain or discomfort. Someone else just rams it in there and the whole process doesn’t go fast enough so the discomfort and pain last longer. \n\nAlso, I had an inexperienced doctor react like she was revolted because she mistook what is a backed up sebaceous gland for an HPV wart. She literally jumped back from me and treated me like I was diseased. The HPV test was negative. I never went back to her and the last I heard she moved to the urgent care clinic where she belongs.",
                "So is it for vaginal samples or cervical, or both? The article flip-flops and it's not clear which it is.",
                "Women's healthcare choices often feel like cutting off your hand or cutting off your finger.",
                "Finally!",
                "This is great. I have had two paps in my life and I'm 35. I got them both out of necessity for birth control and have since been sterilized. I'd prefer to do this at home in private than have someone else staring into the abyss, ya know. I'm very (to a fault) protective over my dignity.",
                "I've been avoiding my pap smear like the plague because of the gender dysphoria. Looking forward to this being available in AZ"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Hamas official says group holding direct talks with US in Qatar",
            "external_url": "https://www.bbc.com/news/articles/cx2q7749dxlo",
            "upvotes": 2379,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2d86/live/c593b780-2ec6-11f0-b3e4-b7df0c3c542b.jpg",
            "top_comments": [
                "\"stop the fighting and ill build the most magnificent trump tower right on the gaza strip, it will have the best hotels and on-site gambling floor of all the casinos there!\"",
                "Amazing what a $300M gifted private jet can do.",
                "I thought we don’t negotiate with terrorists",
                "They must have minerals....",
                "They won’t reach a deal. Trump wants a win and switched tracks from Ukraine to Israel/Palestine after Putin kept snubbing him.\n\nThere’s a non-insignificant chance Putin calls up Iran and tells it to tell Hamas not to accept or at least honor any deal. Putin loves humiliating his stooge in the White House.",
                "member, that one time, when Trump negotiated the withdrawal of the US from Afghanistan without involving the Afghan government in the negotiations that caused a cluskerf*ck when Biden followed Trump's timetable and withdrawal settlement.... I member.",
                "Imagine their response if Obama or Biden had done this",
                "So Hamas bought Trump a plane, and Qatar delivered it?",
                "Pay for play politics",
                "MAGA Official:  'We're going to take Gaza completely, and build resort casinos on every inch of the land - and, in exchange, you and all the Palestinians can go elsewhere!'\n\nHamas:  'Death to Israel and the Great Satan!!!  Wait, what???  Elsewhere???  Where exactly is elsewhere?'\n\nMAGA Official:  'Doesn't matter!  Anywhere else is fine...  Well, you're going to want to avoid Israel - and don't even think of coming to the USA!'\n\nHamas:  'And what exactly do we get for giving you absolutely everything?'\n\nMAGA Official:  'I already told you!  You get to go elsewhere!  We get Gaza, and you get to F right off!'\n\nHamas:  [Throws up hands and shrugs.]\n\nMAGA Official:  'And, next time, instead of traditional formal-robes, you should probably put on suits and say 'Thank You!'"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "4 dead, hundreds displaced by Milwaukee apartment building fire",
            "external_url": "https://www.cnn.com/2025/05/11/us/milwaukee-apartment-fire",
            "upvotes": 568,
            "date": "05/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21616207-55742-184-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "That is terrible.  I feel so bad for everyone there.",
                "Such a tragedy, and on Mother’s Day is so heartbreaking. It’s horrifying to find out just how preventable these deaths were. \n\nThere are so many apartment buildings here in Milwaukee built before 1974 that may also not be required to have sprinkler systems. I hope something is done to address this loophole. \n\nReminds me of [another incident](https://www.fox6now.com/news/uwm-carbon-monoxide-code-loophole) in Milwaukee a few years ago where several students in a UW Milwaukee dorm almost died from carbon monoxide poisoning, the dorm building was not required to have co2 alarms due to a loophole.",
                "“Regulations are written in blood”\n\nWords to live by\n\nEdit:\n\n> Both affiliates quoted crews as saying the building did not have a working sprinkler system but did not require one, as it was built before 1974, WTMJ reported.\n\n\nWhy is this building still stand? Which carve-out allow this?",
                "If a building is too expensive to retrofit to make safe than it should not rented out to people."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Massive explosion levels New Jersey home, rocks neighborhood",
            "external_url": "https://abcnews.go.com/US/massive-explosion-levels-new-jersey-home-rocks-neighborhood/story?id=121693970",
            "upvotes": 936,
            "date": "05/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1acfee5d-55c3-4773-815a-15a32f55b004/house-explosion1-nj-hd-bh-250511_1746992055023_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "This happened in my hometown 20 years ago or so. We lived well over a mile away, I thought someone had rammed their car into our house.  \nA coworker lived across the street and down a couple from the house that exploded, he was walking up his basement stairs at the time, the blast knocked him back down the stairs.",
                "I got 50/50 it was either a gas leak or a meth lab.",
                "“The explosion occurred at 2pm” then two paragraphs later, “the blast happened at 2:02am”\n\nNice job, news",
                "> A massive explosion that leveled a New Jersey home early Sunday and reportedly killed two people was so powerful that neighbors said it sounded like a bomb going off.\n\n\nThe explosion sounded like a bomb? You don’t say.",
                "So for those of you also absolutely terrified what are things a home owner can do to assure that their gas line is not a ticking time bomb",
                "This sounds scary similar to that explosion in Texas that was caused by a leaking natural gas line.",
                "\"Tranquility Court\" doesn't live up to its name",
                "Every time this happens I'm happy my home doesn't have a gas line.",
                "That's sad. Two people died.  they were probably talking about what to do for dinner that night or maybe going to Target soon.",
                "I've seen this episode of Aqua Teen Hunger Force"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Convicted killer falls to death from Milan's famed Duomo cathedral after allegedly stabbing man, reports say",
            "external_url": "https://www.cbsnews.com/news/convicted-killer-dies-duomo-cathedral-reports/",
            "upvotes": 120,
            "date": "05/12/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/12/06c6669d-46ee-4f3d-9379-a39b6247b183/thumbnail/1200x630/45ea0028decb97b2fa0eeb6e1d5516f2/gettyimages-2211700674.jpg?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "> One witness, a bar owner named Emanuele Sanità, told the outlet that De Maria landed right next to a boy who was holding a stuffed animal.\n\n> \"He fell next to him. He was in shock. He sat there for twenty minutes without speaking,\" Sanità said\n\nHope they get that kid some therapy.",
                "From CBS:\n\n>A convicted murderer permitted to work outside prison threw himself from Milan's famed Duomo cathedral on Sunday, killing himself, after allegedly stabbing a colleague, local news reports said.\n\n>[ANSA news agency](https://www.ansa.it/lombardia/notizie/2025/05/11/emanuele-de-maria-suicida-dal-duomo-di-milano_4b25c690-d646-44f6-8dfd-c02d80d364ec.html) and other outlets reported said the Italian man, whom they identified as Emanuele De Maria, 35, fell \"dozens of meters\" after reportedly throwing himself from the Gothic cathedral into the square below.\n\n>The area surrounding the Duomo, Milan's most famed landmark, is usually teeming with people but news reports did not cite any injuries among passersby.\n\n>Television images showed police blocking off the area surrounding one of the sides of the cathedral.\n\n>Authorities identified De Maria — who went on television last year to describe his life — from an ID in his pocket and his tattoos, according to several reports, including Milan's [Corriere della Sera daily](https://milano.corriere.it/notizie/cronaca/25_maggio_11/emanuele-de-maria-suicida-in-piazza-duomo-i-testimoni-si-e-buttato-tra-la-folla-cadendo-ha-sfiorato-un-ragazzino-e-poteva-5ced10e4-ab7c-4950-8d0a-8176428efxlk.shtml).\n\n>One witness, a bar owner named Emanuele Sanità, [told the outlet](https://milano.corriere.it/notizie/cronaca/25_maggio_11/emanuele-de-maria-suicida-in-piazza-duomo-i-testimoni-si-e-buttato-tra-la-folla-cadendo-ha-sfiorato-un-ragazzino-e-poteva-5ced10e4-ab7c-4950-8d0a-8176428efxlk.shtml) that De Maria landed right next to a boy who was holding a stuffed animal.\n\n>\"He fell next to him. He was in shock. He sat there for twenty minutes without speaking,\" Sanità said.\n\n>De Maria had been serving a 14-year sentence after being convicted for the 2016 murder of a woman, according to reports. He was arrested in Germany in 2018 after hiding as a fugitive in the Netherlands, Milano Today [reported](https://www.milanotoday.it/cronaca/emanuele-de-maria-suicidio-duomo.html).\n\n>But for nearly two years he had been working part-time at a hotel near Milan's central train station.\n\n>Police had been searching for him since Friday, when he allegedly stabbed a work colleague. The condition of that man, identified as a 50-year-old Italian-Egyptian, was improving Sunday after emergency surgery on his neck and chest, Milano Today reported.",
                "I hope the kid that was close get some mental health check.",
                "I only know this cathedral as the one that Berlusconi got hit in the face with (scale model souvenir)",
                "JFC. This sounds like a weird tragic Italian opera."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Residents jump from windows during Milwaukee apartment fire that kills 4",
            "external_url": "https://www.nbcnews.com/news/us-news/residents-jump-windows-milwaukee-apartment-fire-kills-4-rcna206195",
            "upvotes": 118,
            "date": "05/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250512-milwaukee-fire-mb-0923-0604d1.jpg",
            "top_comments": [
                "Sprinkler systems save lives, period.",
                "From AP:\n\n>MILWAUKEE — Residents jumped from the windows of a four-story apartment building in Milwaukee during a Mother’s Day fire that killed four people, critically injured four others and grew so intense that the blaze outmatched the first firefighters to arrive, authorities said.\n\n>Ladder trucks were used to rescue other residents from windows while some firefighters inside the burning building crawled on hands and knees to get people out, Milwaukee Fire Chief Aaron Lipski said Sunday. In all, about 30 people were rescued.\n\n>Authorities have not said how the fire might have started.\n\n>Lipski said the building did not have a sprinkler system and was built in 1968, predating a law that would have required one, according to the fire chief.\n\n>“If we had sprinklers in the buidling we would have stopped the fire very, very small. We would not of had to have people jumping out of windows,” he said.\n\n>Several other residents were treated for lesser injuries in the fire that began sometime before 8 a.m. The blaze rendered the 85-unit building uninhabitable, displacing an estimated 200 people.\n\n>James Rubinstein, a resident in the building, said he jumped to the ground floor.\n\n>“There was so much smoke. I climbed out the courtyard with my cat in my backpack,” Rubinstein told television station FOX6 Milwaukee.\n\n>Emergency operaters received calls that people were trapped and jumping to escape. The first firefighters to arrive were “far, far outmatched” by intense flames, Lipski said.\n\n>Authorities did not immediately release the identities or ages of the victims. Lipski said the fire began in a common area and spread to multiple floors.\n\n>Eddie Edwards, another resident of the building, said he also jumped to escape.\n\n>“I wasn’t thinking about nothing but getting away,” he told Milwaukee television station WISN. “Getting out and saving everyone’s life. It was a scary moment.”",
                "> We would **not of had** to have people jumping out of windows,” he said.\n\nGreat job NBC news",
                "There’s an update that arson is suspected.",
                "RIP, panic is a big enemy in those cases."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Turkiye discovers 20bn barrels of crude oil in Somalia",
            "external_url": "https://www.middleeastmonitor.com/20250509-turkiye-discovers-20bn-barrels-of-crude-oil-in-somalia/",
            "upvotes": 465,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "We gonna get a sequel to Black Hawk Down soon",
                "Who put all those barrels there???",
                "Look! I \"discovered\" 30 gallons of gasoline in my neighbor's car! Well, I *say* \"neighbor;\" he lives a few blocks down the street. Any takers?",
                "If you are sick of reading a variation of the same joke in every comment and want some context:\n\n“Turkey secures rights to 90 percent of oil and gas output in Somalia deal”\n\nFull article: https://nordicmonitor.com/2025/04/turkey-secures-exceptional-rights-in-somalia-oil-agreement-documents-show/",
                "US \"liberation\" of Somalia in 3... 2... 1...",
                "And I'm sure the impoverished people of Somalia will be getting their share of the profits... right? Right???",
                "Perfect!  Because Somalia already has war, now they have the oil to ensure it continues.",
                "And I’m sure Somalia will be properly compensated. /s",
                "Leave it in the ground, it's dirty.",
                "Keep it underground and give Somali people 20bn dollar to create a sustainable economy instead."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "1 dead, 4 hikers rescued after heat-related emergency at Arizona's Gold Canyon",
            "external_url": "https://abcnews.go.com/US/1-dead-4-hikers-rescued-after-heat-related/story?id=121699358",
            "upvotes": 118,
            "date": "05/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/a6d67c0f-36f9-4197-987b-477c10326808/SFMD_1747008470648_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Article by Tristan Maglunog and T. Michelle Murphy\n\n>One person died on Sunday afternoon after suffering a heat-related medical emergency on the Wave Cave Trail at Gold Canyon, which is located just over 40 miles east of Phoenix, officials said, noting that four others from the hiking party were rescued.\n\n>Rescue teams responded to what they described as a \"1st alarm Mountain rescue\" after receiving a call from hikers just before 1 p.m. local time.\n\n>The hikers had been on the trails for some six hours when the rescue was initiated. One of the five -- a 33-year-old man -- was experiencing a medical emergency, according to the Pinal County Sheriff's Office.\n\n>Civilians from within the hiking party attempted to initiate CPR, according to the Superstition Fire and Medical District, which serves Gold Canyon.\n\n>Rescue teams took over CPR efforts upon reaching the scene, but \"unfortunately the patient did not survive,\" SFMD said in a statement.\n\n>Temperatures in the area were close to 100 degrees on Sunday, and the medical emergency was linked to the heat.\n\n>\"No foul play is suspected,\" PCSO said. \"The Pinal County Medical Examiner will determine the cause of death.\"\n\n>\"Tragically this mountain rescue resulted in one fatality,\" SFDM said in a statement on Facebook, adding that the other four in the group were assisted down the mountain but \"refused transport to the hospital.\"\n\n>Officials encouraged people to avoid Wave Cave Trail for the remainder of the day on Sunday.\n\n>SFMD added an advisory to its social media post, saying that Arizona summers can reach upward of 110 F and \"heat exhaustion or heat stroke can occur in under an hour.\"\n\n>\"Most heat deaths happen on trails between 10 a.m. and 4 p.m., the hottest part of the day,\" the post continued.\n\n>\"If you feel dizzy, nauseous, stop sweating, or become confused, get help immediately,\" SFMD added. \"Please stay safe and plan wisely. No hike is worth your life.\"",
                "After reading news stories like this, I'm genuinely curious if/why hikers either didn't check weather or didn't care.  It seems really asinine to go hiking in the middle of nowhere in this sort of heat.",
                "Summer is not the time to be cavorting about the hot states. There's a reason trips are cheaper in the months that might kill you.",
                "Usually it's the Superstition Mountains that claim hikers."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "US and China are set to drastically roll back tariffs",
            "external_url": "https://www.cnn.com/2025/05/12/business/us-china-trade-deal-announcement-intl-hnk",
            "upvotes": 788,
            "date": "05/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2214092889.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "A *temporary reduction* for 90 days. This administration is going to run 3 month pump and dump cycles on the entire market for the foreseeable future.",
                "He starts a fire and waits till the house is nearly burnt down then he puts it out and expects everyone to thank him with roaring applause for putting it out.",
                "So -- it was all political theatre  this whole time?",
                "Note how it says “temporary reduction” so he’ll just pull the same shit and manipulate the stock market again in a couple months.",
                "Imagine fucking things over only to claim you fixed things and think he did something great? Fuck him. He’s trying to make himself look like some sort of savior when he created this goddamn problem.",
                "Everything about MAGA is a performance. They are acting out what it means to do things. Then they don't do them and act as if it was effective because they stopped it from being worse, though it was worse because they did something.",
                "create the problem and then pat yourself on the back for fixing it.",
                "\\> 90 days pause\n\n\\>still tariffs,just cuts\n\nOh fantastic, So instead of empty shelves just  in June and July. We'll have more empty shelves in fall or winter",
                "Huh? I thought the US was. Getting ripped off by China and tariffs needed so they could build factories so China wasn’t needed?",
                "So the US decided to backtrack once literally nothing was being imported from China and they realized the devastation this would cause to the US economy? What did they get out of this?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "'Children handcuffed and shot' - ex-UK Special Forces break silence on war crime claims",
            "external_url": "https://www.bbc.com/news/articles/cj3j5gxgz0do",
            "upvotes": 1774,
            "date": "05/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8442/live/4af02840-2efa-11f0-8f57-b7237f6a66e6.jpg",
            "top_comments": [
                "\"Former members of UK Special Forces have broken years of silence to give BBC Panorama eyewitness accounts of alleged war crimes committed by colleagues in Iraq and Afghanistan.\n\nGiving their accounts publicly for the first time, the veterans described seeing members of the SAS murder unarmed people in their sleep and execute handcuffed detainees, including children.\n\n\"They handcuffed a young boy and shot him,\" recalled one veteran who served with the SAS in Afghanistan. \"He was clearly a child, not even close to fighting age.\"\n\nKilling of detainees \"became routine\", the veteran said. \"They'd search someone, handcuff them, then shoot them\", before cutting off the plastic handcuffs used to restrain people and \"planting a pistol\" by the body, he said.\n\n...\n\nKnowledge of the alleged crimes was not confined to small teams or individual squadrons, according to the testimony. Within the UK Special Forces command structure, \"everyone knew\" what was happening, said one veteran.\n\n...\n\n\"There was a fake grenade they'd take with them onto target, it couldn't detonate,\" said a former SAS operator. Another veteran said operators would carry AK-47 rifles which had a folding stock because they were easier to fit into their rucksacks and \"easier to bring onto a target and plant by a body\".\n\nOfficers would then help to falsify post-operational reports in order to avoid scrutiny for the actions of assault teams on the ground, according to the testimony.\n\n...\n\n\"If it looked like a shooting could represent a breach of the rules of conflict, you'd get a phone call from the legal adviser or one of the staff officers in HQ. They'd pick you up on it and help you to clarify the language. 'Do you remember someone making a sudden move?' 'Oh yeah, I do now.' That sort of thing. It was built into the way we operated.\"\n\nThe reports were \"a fiction\", another UKSF veteran said.\n\nAn intelligence officer who worked with the SBS described reports which said they had been caught in a firefight, while the photos showed bodies with \"multiple clean headshots\".\n\n...\n\nThe Afghan president was \"so consistent with his complaints about night raids, civilian casualties and detentions that there was no senior Western diplomat or military leader who would have missed the fact that this was a major irritant for him,\" said Gen Douglas Lute, a former US ambassador to Nato.\n\n...\"",
                "We are outraged when Russian troops do stuff like this, and rightly so. We should be similarly outraged when friendly forces do such things. This wasn’t a small bunch of soldiers going rogue, this was an institutionalised disregard for the ethics of warfare and established military protocol.",
                "This is horrifying. All these people should be brought to justice. No whitewashing for european armies if they behave like bloodthirsty monster on the field. \n\nAn army that behaves like a mad beast should be restrained and reformed and the leaders that allowed it should be imprisoned and be made to paid for their complicity if not outright orders to do this. For all the supposed \"responsibilities\" of command that justifiers their higher salaries and benefits, they don't seem to accept the consequences of their failed leadership when the chickens come home to roost.",
                "At this point, we should all understand that these kinds of things will be happening any time we're sending people into these sorts of situations. War makes monsters of people, or at least lets monsters thrive. Is whatever we're doing with those boots on the ground worth that price?",
                "As humans our capacity for inhumane violence is impressive and 100% depressing.",
                "It was a blatant and abhorrent invasion from day one:\n\n1. The sorry excuse of WMD to invade a foreign country by a set of countries playing games for their own personal gains.\n2. Studies say that around 0.5 Million people died due to the invasion and many more injured.\n3. Not to mention the damage to the infrastructure, political structures and the economic impact on the country invaded.\n\nThe media is complicit in all of this as the coverage was shameful to say the least. They have parroted the official propagandized versions for so long. The UN, for what its worth did not authorize the invasion.\n\nDid any of the true decision makers face the law due to this? Is there any guilt shown at the very least? Did some of them line-up their own pockets throughout this ordeal?\n\nThis will answer why massive \"mistakes\" of this ilk are being repeated at an alarming frequency.\n\nSources:\n\n[https://www.bbc.com/news/world-middle-east-24547256](https://www.bbc.com/news/world-middle-east-24547256)\n\n[https://watson.brown.edu/costsofwar/costs/human/civilians](https://watson.brown.edu/costsofwar/costs/human/civilians)",
                "You can bet this would be front page and headline news everywhere if it was a Middle Eastern country.  Especially a certain one being blitzed to hell by a western ally, where it’s already been proven that said ally does this sort of thing.",
                "They’ve been at it for centuries. Thank you to the brave people telling the truth.",
                "British forces have been murdering people in Ireland for generations. You won't find many here shocked by this news",
                "Why are people surprised. Give weapons (arms or just power) to any group of people, and they will abuse it. Torture, murders and rapes have been long standing traditions of any armed forces (or militants/ terrorists). Whether the war was justified or not is completely irrelevant. If anyone believes their armed forces are above all this and are the good guys…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "2 bodies found in New Jersey home that neighbors say exploded",
            "external_url": "https://www.nbcnews.com/news/us-news/2-bodies-found-new-jersey-home-neighbors-say-exploded-rcna206163",
            "upvotes": 413,
            "date": "05/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250511-new-jersey-explosion-wm-425p-f83f45.jpg",
            "top_comments": [
                "\"that neighbors say exploded\"",
                "Did the home explode, or the two bodies? Feels like there's a bit a misplaced modifier here...",
                "Tragic if it turns out to be gas leak or something they had nothing to do with.",
                "Did the house explode or not? Such a weird headline.",
                "Trying to cover up two homicides?",
                "Was either of them a fridge magnate?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump fires director of U.S. Copyright Office, sources say",
            "external_url": "https://www.cbsnews.com/news/trump-fires-director-of-u-s-copyright-office-shira-perlmutter-sources/",
            "upvotes": 9986,
            "date": "05/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/10/a3bf9ec7-3ddf-4570-bdff-eafb746800a4/thumbnail/1200x630/4e1e701b4e0cf5c481072b89781d79bc/gettyimages-2213647884.jpg?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "\"...Perlmutter's firing was \"a brazen, unprecedented power grab with no legal basis.... surely no coincidence he acted less than a day after she refused to rubber-stamp Elon Musk's efforts to mine troves of copyrighted works to train AI models,\" in reference to the report released by the Copyright Office this week.  \n\nLast month, Musk took to his social media platform X to seemingly express support for the abolition of intellectual property laws...\"",
                "He sure is firing people left and right. Is there a website that tracks all the government heads that are being fired? I know I posted earlier that he fired the Librarian for Congress Friday. [https://federalnewsnetwork.com/workforce/2025/05/president-donald-trump-fires-librarian-of-congress-carla-hayden/](https://federalnewsnetwork.com/workforce/2025/05/president-donald-trump-fires-librarian-of-congress-carla-hayden/)\n\nEdit: Added another name and more details who has been fired..Earlier Thursday, the [acting administrator of the Federal Emergency Management Agency](https://apnews.com/article/fema-trump-administrator-replaced-emergency-b9ae5e6a7e1c09e51de99c5148f45eb2) was pushed out one day after he had testified that he did not agree with proposals to dismantle the organization. Trump has suggested that individual states, not FEMA, should take the lead on responding to hurricanes, tornadoes and other crises.\n\nAt the Pentagon, more than a half-dozen [top general officers have been fired](https://apnews.com/article/trump-brown-joint-chiefs-of-staff-firing-fa428cc1508a583b3bf5e7a5a58f6acf) since January, including the chairman of the Joint Chiefs of Staff, Gen. CQ Brown Jr. The only two women serving as four-star officers, as well as a disproportionate number of other senior female officers, have also been fired.",
                "We all know the intellectual property laws are only going to be suspended for the rich and corporations",
                "We're cooked.  Elon can just steal whatever he wants now",
                "Damn I was half joking when I said this office was going to be fired for denying Elons copyright claims and it happens less than a week later. This is going into banana republic levels of corruption.",
                "Strikes me as an admission that Elon's underlings weren't skilled enough to steal copyrighted work like every other major AI company does.",
                "Wasn’t this the issue that started the first Trade War with China?",
                "Trump, gutting US civilization.",
                "Musk had to stop the director’s report that his xAI training is copyright infringement.",
                "Y'know...ordinarily, if an administration does its job well enough to keep a government by of and for the people running properly, I can tolerate ideological differences within reason. But you have to do a good job first. You have to preserve the system of people-run governance. You have to maintain the integrity of the Constitution--not just in word, but in spirit. You have to keep the ship running and in, more or less, the right direction. \n\n  \nBut what I can't tolerate, is what *this* administration is doing. It has nothing to do with ideology. This is a recklessly harmful thing to do and I wish someone within this administration had the courage and sense enough to recommend against acts like these. Putting an ill-suited, inexperienced crony loyalist in charge of the copyright office is a ruinously dumb headed thing to do. And it speaks ill of the administration's competency and utter disregard for practical or moral consideration in restraining the chief executive's impulsive desire for revenge against every person and every institution which already *has* made America great.\n\n\n\nIt is simply wrong to do."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "4 dead, hundreds displaced by Milwaukee apartment building fire",
            "external_url": "https://www.cnn.com/2025/05/11/us/milwaukee-apartment-fire",
            "upvotes": 569,
            "date": "05/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21616207-55742-184-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "That is terrible.  I feel so bad for everyone there.",
                "Such a tragedy, and on Mother’s Day is so heartbreaking. It’s horrifying to find out just how preventable these deaths were. \n\nThere are so many apartment buildings here in Milwaukee built before 1974 that may also not be required to have sprinkler systems. I hope something is done to address this loophole. \n\nReminds me of [another incident](https://www.fox6now.com/news/uwm-carbon-monoxide-code-loophole) in Milwaukee a few years ago where several students in a UW Milwaukee dorm almost died from carbon monoxide poisoning, the dorm building was not required to have co2 alarms due to a loophole.",
                "“Regulations are written in blood”\n\nWords to live by\n\nEdit:\n\n> Both affiliates quoted crews as saying the building did not have a working sprinkler system but did not require one, as it was built before 1974, WTMJ reported.\n\n\nWhy is this building still stand? Which carve-out allow this?",
                "If a building is too expensive to retrofit to make safe than it should not rented out to people."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Massive explosion levels New Jersey home, rocks neighborhood",
            "external_url": "https://abcnews.go.com/US/massive-explosion-levels-new-jersey-home-rocks-neighborhood/story?id=121693970",
            "upvotes": 928,
            "date": "05/12/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/1acfee5d-55c3-4773-815a-15a32f55b004/house-explosion1-nj-hd-bh-250511_1746992055023_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "This happened in my hometown 20 years ago or so. We lived well over a mile away, I thought someone had rammed their car into our house.  \nA coworker lived across the street and down a couple from the house that exploded, he was walking up his basement stairs at the time, the blast knocked him back down the stairs.",
                "I got 50/50 it was either a gas leak or a meth lab.",
                "“The explosion occurred at 2pm” then two paragraphs later, “the blast happened at 2:02am”\n\nNice job, news",
                "> A massive explosion that leveled a New Jersey home early Sunday and reportedly killed two people was so powerful that neighbors said it sounded like a bomb going off.\n\n\nThe explosion sounded like a bomb? You don’t say.",
                "So for those of you also absolutely terrified what are things a home owner can do to assure that their gas line is not a ticking time bomb",
                "This sounds scary similar to that explosion in Texas that was caused by a leaking natural gas line.",
                "\"Tranquility Court\" doesn't live up to its name",
                "Every time this happens I'm happy my home doesn't have a gas line.",
                "That's sad. Two people died.  they were probably talking about what to do for dinner that night or maybe going to Target soon.",
                "I've seen this episode of Aqua Teen Hunger Force"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Turkiye discovers 20bn barrels of crude oil in Somalia",
            "external_url": "https://www.middleeastmonitor.com/20250509-turkiye-discovers-20bn-barrels-of-crude-oil-in-somalia/",
            "upvotes": 467,
            "date": "05/12/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "We gonna get a sequel to Black Hawk Down soon",
                "Who put all those barrels there???",
                "Look! I \"discovered\" 30 gallons of gasoline in my neighbor's car! Well, I *say* \"neighbor;\" he lives a few blocks down the street. Any takers?",
                "If you are sick of reading a variation of the same joke in every comment and want some context:\n\n“Turkey secures rights to 90 percent of oil and gas output in Somalia deal”\n\nFull article: https://nordicmonitor.com/2025/04/turkey-secures-exceptional-rights-in-somalia-oil-agreement-documents-show/",
                "US \"liberation\" of Somalia in 3... 2... 1...",
                "And I'm sure the impoverished people of Somalia will be getting their share of the profits... right? Right???",
                "Perfect!  Because Somalia already has war, now they have the oil to ensure it continues.",
                "And I’m sure Somalia will be properly compensated. /s",
                "Leave it in the ground, it's dirty.",
                "Keep it underground and give Somali people 20bn dollar to create a sustainable economy instead."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "'Children handcuffed and shot' - ex-UK Special Forces break silence on war crime claims",
            "external_url": "https://www.bbc.com/news/articles/cj3j5gxgz0do",
            "upvotes": 1776,
            "date": "05/12/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/8442/live/4af02840-2efa-11f0-8f57-b7237f6a66e6.jpg",
            "top_comments": [
                "\"Former members of UK Special Forces have broken years of silence to give BBC Panorama eyewitness accounts of alleged war crimes committed by colleagues in Iraq and Afghanistan.\n\nGiving their accounts publicly for the first time, the veterans described seeing members of the SAS murder unarmed people in their sleep and execute handcuffed detainees, including children.\n\n\"They handcuffed a young boy and shot him,\" recalled one veteran who served with the SAS in Afghanistan. \"He was clearly a child, not even close to fighting age.\"\n\nKilling of detainees \"became routine\", the veteran said. \"They'd search someone, handcuff them, then shoot them\", before cutting off the plastic handcuffs used to restrain people and \"planting a pistol\" by the body, he said.\n\n...\n\nKnowledge of the alleged crimes was not confined to small teams or individual squadrons, according to the testimony. Within the UK Special Forces command structure, \"everyone knew\" what was happening, said one veteran.\n\n...\n\n\"There was a fake grenade they'd take with them onto target, it couldn't detonate,\" said a former SAS operator. Another veteran said operators would carry AK-47 rifles which had a folding stock because they were easier to fit into their rucksacks and \"easier to bring onto a target and plant by a body\".\n\nOfficers would then help to falsify post-operational reports in order to avoid scrutiny for the actions of assault teams on the ground, according to the testimony.\n\n...\n\n\"If it looked like a shooting could represent a breach of the rules of conflict, you'd get a phone call from the legal adviser or one of the staff officers in HQ. They'd pick you up on it and help you to clarify the language. 'Do you remember someone making a sudden move?' 'Oh yeah, I do now.' That sort of thing. It was built into the way we operated.\"\n\nThe reports were \"a fiction\", another UKSF veteran said.\n\nAn intelligence officer who worked with the SBS described reports which said they had been caught in a firefight, while the photos showed bodies with \"multiple clean headshots\".\n\n...\n\nThe Afghan president was \"so consistent with his complaints about night raids, civilian casualties and detentions that there was no senior Western diplomat or military leader who would have missed the fact that this was a major irritant for him,\" said Gen Douglas Lute, a former US ambassador to Nato.\n\n...\"",
                "We are outraged when Russian troops do stuff like this, and rightly so. We should be similarly outraged when friendly forces do such things. This wasn’t a small bunch of soldiers going rogue, this was an institutionalised disregard for the ethics of warfare and established military protocol.",
                "This is horrifying. All these people should be brought to justice. No whitewashing for european armies if they behave like bloodthirsty monster on the field. \n\nAn army that behaves like a mad beast should be restrained and reformed and the leaders that allowed it should be imprisoned and be made to paid for their complicity if not outright orders to do this. For all the supposed \"responsibilities\" of command that justifiers their higher salaries and benefits, they don't seem to accept the consequences of their failed leadership when the chickens come home to roost.",
                "At this point, we should all understand that these kinds of things will be happening any time we're sending people into these sorts of situations. War makes monsters of people, or at least lets monsters thrive. Is whatever we're doing with those boots on the ground worth that price?",
                "As humans our capacity for inhumane violence is impressive and 100% depressing.",
                "It was a blatant and abhorrent invasion from day one:\n\n1. The sorry excuse of WMD to invade a foreign country by a set of countries playing games for their own personal gains.\n2. Studies say that around 0.5 Million people died due to the invasion and many more injured.\n3. Not to mention the damage to the infrastructure, political structures and the economic impact on the country invaded.\n\nThe media is complicit in all of this as the coverage was shameful to say the least. They have parroted the official propagandized versions for so long. The UN, for what its worth did not authorize the invasion.\n\nDid any of the true decision makers face the law due to this? Is there any guilt shown at the very least? Did some of them line-up their own pockets throughout this ordeal?\n\nThis will answer why massive \"mistakes\" of this ilk are being repeated at an alarming frequency.\n\nSources:\n\n[https://www.bbc.com/news/world-middle-east-24547256](https://www.bbc.com/news/world-middle-east-24547256)\n\n[https://watson.brown.edu/costsofwar/costs/human/civilians](https://watson.brown.edu/costsofwar/costs/human/civilians)",
                "You can bet this would be front page and headline news everywhere if it was a Middle Eastern country.  Especially a certain one being blitzed to hell by a western ally, where it’s already been proven that said ally does this sort of thing.",
                "They’ve been at it for centuries. Thank you to the brave people telling the truth.",
                "British forces have been murdering people in Ireland for generations. You won't find many here shocked by this news",
                "Why are people surprised. Give weapons (arms or just power) to any group of people, and they will abuse it. Torture, murders and rapes have been long standing traditions of any armed forces (or militants/ terrorists). Whether the war was justified or not is completely irrelevant. If anyone believes their armed forces are above all this and are the good guys…"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump fires director of U.S. Copyright Office, sources say",
            "external_url": "https://www.cbsnews.com/news/trump-fires-director-of-u-s-copyright-office-shira-perlmutter-sources/",
            "upvotes": 9985,
            "date": "05/12/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/10/a3bf9ec7-3ddf-4570-bdff-eafb746800a4/thumbnail/1200x630/4e1e701b4e0cf5c481072b89781d79bc/gettyimages-2213647884.jpg?v=e61856d8e666e7ed5709adc37bb2d465",
            "top_comments": [
                "\"...Perlmutter's firing was \"a brazen, unprecedented power grab with no legal basis.... surely no coincidence he acted less than a day after she refused to rubber-stamp Elon Musk's efforts to mine troves of copyrighted works to train AI models,\" in reference to the report released by the Copyright Office this week.  \n\nLast month, Musk took to his social media platform X to seemingly express support for the abolition of intellectual property laws...\"",
                "He sure is firing people left and right. Is there a website that tracks all the government heads that are being fired? I know I posted earlier that he fired the Librarian for Congress Friday. [https://federalnewsnetwork.com/workforce/2025/05/president-donald-trump-fires-librarian-of-congress-carla-hayden/](https://federalnewsnetwork.com/workforce/2025/05/president-donald-trump-fires-librarian-of-congress-carla-hayden/)\n\nEdit: Added another name and more details who has been fired..Earlier Thursday, the [acting administrator of the Federal Emergency Management Agency](https://apnews.com/article/fema-trump-administrator-replaced-emergency-b9ae5e6a7e1c09e51de99c5148f45eb2) was pushed out one day after he had testified that he did not agree with proposals to dismantle the organization. Trump has suggested that individual states, not FEMA, should take the lead on responding to hurricanes, tornadoes and other crises.\n\nAt the Pentagon, more than a half-dozen [top general officers have been fired](https://apnews.com/article/trump-brown-joint-chiefs-of-staff-firing-fa428cc1508a583b3bf5e7a5a58f6acf) since January, including the chairman of the Joint Chiefs of Staff, Gen. CQ Brown Jr. The only two women serving as four-star officers, as well as a disproportionate number of other senior female officers, have also been fired.",
                "We all know the intellectual property laws are only going to be suspended for the rich and corporations",
                "We're cooked.  Elon can just steal whatever he wants now",
                "Damn I was half joking when I said this office was going to be fired for denying Elons copyright claims and it happens less than a week later. This is going into banana republic levels of corruption.",
                "Strikes me as an admission that Elon's underlings weren't skilled enough to steal copyrighted work like every other major AI company does.",
                "Wasn’t this the issue that started the first Trade War with China?",
                "Trump, gutting US civilization.",
                "Musk had to stop the director’s report that his xAI training is copyright infringement.",
                "Y'know...ordinarily, if an administration does its job well enough to keep a government by of and for the people running properly, I can tolerate ideological differences within reason. But you have to do a good job first. You have to preserve the system of people-run governance. You have to maintain the integrity of the Constitution--not just in word, but in spirit. You have to keep the ship running and in, more or less, the right direction. \n\n  \nBut what I can't tolerate, is what *this* administration is doing. It has nothing to do with ideology. This is a recklessly harmful thing to do and I wish someone within this administration had the courage and sense enough to recommend against acts like these. Putting an ill-suited, inexperienced crony loyalist in charge of the copyright office is a ruinously dumb headed thing to do. And it speaks ill of the administration's competency and utter disregard for practical or moral consideration in restraining the chief executive's impulsive desire for revenge against every person and every institution which already *has* made America great.\n\n\n\nIt is simply wrong to do."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US and China are set to drastically roll back tariffs",
            "external_url": "https://www.cnn.com/2025/05/12/business/us-china-trade-deal-announcement-intl-hnk",
            "upvotes": 785,
            "date": "05/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2214092889.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "A *temporary reduction* for 90 days. This administration is going to run 3 month pump and dump cycles on the entire market for the foreseeable future.",
                "He starts a fire and waits till the house is nearly burnt down then he puts it out and expects everyone to thank him with roaring applause for putting it out.",
                "So -- it was all political theatre  this whole time?",
                "Note how it says “temporary reduction” so he’ll just pull the same shit and manipulate the stock market again in a couple months.",
                "Imagine fucking things over only to claim you fixed things and think he did something great? Fuck him. He’s trying to make himself look like some sort of savior when he created this goddamn problem.",
                "Everything about MAGA is a performance. They are acting out what it means to do things. Then they don't do them and act as if it was effective because they stopped it from being worse, though it was worse because they did something.",
                "create the problem and then pat yourself on the back for fixing it.",
                "\\> 90 days pause\n\n\\>still tariffs,just cuts\n\nOh fantastic, So instead of empty shelves just  in June and July. We'll have more empty shelves in fall or winter",
                "Huh? I thought the US was. Getting ripped off by China and tariffs needed so they could build factories so China wasn’t needed?",
                "So the US decided to backtrack once literally nothing was being imported from China and they realized the devastation this would cause to the US economy? What did they get out of this?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "4 dead, hundreds displaced by Milwaukee apartment building fire",
            "external_url": "https://www.cnn.com/2025/05/11/us/milwaukee-apartment-fire",
            "upvotes": 569,
            "date": "05/12/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21616207-55742-184-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "That is terrible.  I feel so bad for everyone there.",
                "Such a tragedy, and on Mother’s Day is so heartbreaking. It’s horrifying to find out just how preventable these deaths were. \n\nThere are so many apartment buildings here in Milwaukee built before 1974 that may also not be required to have sprinkler systems. I hope something is done to address this loophole. \n\nReminds me of [another incident](https://www.fox6now.com/news/uwm-carbon-monoxide-code-loophole) in Milwaukee a few years ago where several students in a UW Milwaukee dorm almost died from carbon monoxide poisoning, the dorm building was not required to have co2 alarms due to a loophole.",
                "“Regulations are written in blood”\n\nWords to live by\n\nEdit:\n\n> Both affiliates quoted crews as saying the building did not have a working sprinkler system but did not require one, as it was built before 1974, WTMJ reported.\n\n\nWhy is this building still stand? Which carve-out allow this?",
                "If a building is too expensive to retrofit to make safe than it should not rented out to people."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "2 bodies found in New Jersey home that neighbors say exploded",
            "external_url": "https://www.nbcnews.com/news/us-news/2-bodies-found-new-jersey-home-neighbors-say-exploded-rcna206163",
            "upvotes": 416,
            "date": "05/12/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250511-new-jersey-explosion-wm-425p-f83f45.jpg",
            "top_comments": [
                "\"that neighbors say exploded\"",
                "Did the home explode, or the two bodies? Feels like there's a bit a misplaced modifier here...",
                "Tragic if it turns out to be gas leak or something they had nothing to do with.",
                "Did the house explode or not? Such a weird headline.",
                "Trying to cover up two homicides?",
                "Was either of them a fridge magnate?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump to accept luxury jet from Qatar to use as Air Force One",
            "external_url": "https://edition.cnn.com/2025/05/11/politics/trump-luxury-jet-qatar-air-force-one",
            "upvotes": 32354,
            "date": "05/11/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/still-21615401-2114540-75-still.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "It's funny he says Americans should give up having so many dolls but he has to have a new plane",
                "Nothing says state secrets for sale, like a free jet.",
                "Air Force One is more than a \"luxury jet\". It's a flying command center for the U.S. government.",
                "He does not need any security against spying.  \nAlso, this is his friend in Qatar giving trump a $400 million bribe.  \nTrump says at the end his presidency this $400 million plane will transfer to Trump as his personal property.  \nThe bribes dont stop. ",
                "It’s ok everyone because it was not Biden accepting the gift. It is only corruption if Biden does it.",
                "How the hell is this acceptable to all those farm boys and joe six packs?  Fuckin dumbass morons.  Clearly a violation of the emoluments clause.",
                "He's incapable of doing a single thing worthy of the office.",
                "Yo trumpers. He getting a 400 million dollar bribe, you get $9 eggs to eat with dirt.",
                "Perhaps we should make a provision in the Constitution to prohibit this? We could call it the Emoluments Clause or something.",
                "Change that to Biden or Obama and watch the shit storm conservatives *should* have about this."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Equipment issue again disrupts air traffic at Newark Liberty airport: FAA",
            "external_url": "https://abcnews.go.com/US/equipment-issue-disrupts-air-traffic-newark/story?id=121689373",
            "upvotes": 1651,
            "date": "05/11/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/803ced13-8a83-42f6-b0f4-5b7a3ade37b3/newark-airport-gty-bh-250511_1746973704002_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "So Newark has been blinded 4 times, the Harry S Truman has lost 3 multimillion dollar jets, and there have been multiple near misses near Reagan. Not a great week for aviation.",
                "Do they just not have it support there anymore?",
                "*The incident marks the fourth time in the past two weeks that technical problems have disrupted air traffic at Newark Liberty*.\n\nWell, if any worker speaks out, he or she may get a few lines of coverage and then vanish both from a job and further coverage.",
                "Article by Bill Hutchinson, Sam Sweeney, and Ayesha Ali \n\n>Air traffic control [problems](https://www.goodmorningamerica.com/News/video/major-flight-disruptions-newark-airport-air-traffic-controllers-121463611) continued at Newark Liberty International Airport on Sunday morning after an equipment issue prompted the Federal Aviation Administration to order a 45-minute ground stop at the New Jersey airport, officials said.\n\n>The FAA said in a statement that a telecommunications issue at the Philadelphia TRACON (terminal radar approach control) Area C facility, which guides aircraft in and out of Newark, caused the agency to issue a ground stop.\n\n>\"The FAA briefly slowed aircraft in and out of the airport while we ensured redundancies were working as designed,\" the FAA said in its [statement](https://x.com/FAANews/status/1921578482863104259).\n\n>As of 11 a.m. ET, the FAA said, \"operations have returned to normal\" at Newark Liberty.\n\n>On Sunday afternoon, the FAA released updated information, saying an audio issue, not an outage, prompted the ground stop at Newark. The agency said there were popping sounds on an unspecified number of radio frequencies. While air traffic controllers were able to communicate with aircraft, the radio system was not working correctly, prompting the switch to a backup system, the FAA said.\n\n>The incident marks the fourth time in the past two weeks that technical problems have disrupted air traffic at Newark Liberty.\n\n>On Friday morning, [radar screens at the airport went black](https://abcnews.go.com/US/radar-screens-newark-airport-black-overnight/story?id=121638395) for approximately 90 seconds, according to the FAA. During the outage, which occurred at about 3:55 a.m. ET, air traffic controllers could be heard telling a FedEx plane that their screens had gone dark and then asking the aircraft to tell their company to apply pressure to get the problem fixed.\n\n>In another transmission, a controller told an arriving private jet that the airport just had experienced a brief radar outage and to stay at or above 3,000 feet in case the controllers couldn't get in touch during the aircraft's descent.\n\n>The FAA said that the Friday outage stemmed from a \"telecommunications outage that impacted communications and radar display at Philadelphia TRACON Area C,\" which is the facility that covers the airspace around Newark.\n\n>On April 28, an [outage at Newark Liberty](https://abcnews.go.com/US/newark-airport-outage-week-lasted-60-90-seconds/story?id=121484044) caused air traffic control computer screens to go dark for roughly 60 to 90 seconds and also prevented the controllers from talking to aircraft during the outage, multiple sources with knowledge of the incident told ABC News. As a result, the FAA halted all departures to the Newark airport, citing \"telecommunications and equipment issues at Philadelphia TRACON.\"\n\n>ABC News also confirmed a minor outage at Newark Liberty that occurred on April 30.\n\n>Following the April 29 outage, several controllers went on medical leave, calling the experience a traumatic event. The controllers are entitled to at least 45 days away from the job and must be evaluated by a doctor before they can return to work.",
                "Where are the whistleblowers to tell us about how all the jobs that were cut are one of the reasons for this?",
                "The Republicans talk out both sides of their ass, they canceled all of Biden’s plans in place to improve infrastructure so they could put the cash into their pockets and then they start blaming everybody else for the situation.",
                "Is there actually anything wrong with the equipment, or is this just being done to justify Trump's \"upgrade\" and privatization of the air traffic control system?",
                "This is what happens when you fire institutional knowledge.",
                "Years of neglect has taken its toll and now the chickens have come to roost.",
                "Don’t worry, it’s Phil Murphy’s fault according to the blowhards in my Newark suburb neighborhood facebook group"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "The FDA approves first U.S. at-home tool as a Pap-smear alternative",
            "external_url": "https://www.npr.org/2025/05/10/nx-s1-5394446/fda-cervical-cancer-screening-at-home-tool-pap-smear",
            "upvotes": 3418,
            "date": "05/11/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2500x1406+0+130/resize/1400/quality/100/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4f%2F9a%2Fd177b2534555b2b79a3e860ac46f%2Fimage-1.png",
            "top_comments": [
                "This tiny spot of good news is like when it rains *very lightly* for like 6 seconds, during a raging hellfire inferno that's destroying everything around you. ",
                "Sweet fuck thank you. I had an iud put in that went terribly wrong, leading to the Dr having to caulderize my cervix. Since then, even pap smears are too much for me. I put them off as long as I can due to anxiety, clenching, and pain. I'll definitely be using this as soon as it's available.",
                "*Article Text by Jennifer Ludden:* \n\nThe Food and Drug administration has approved the U.S.'s first at-home alternative to the Pap smear, a procedure generations of women have dreaded and often found painful.\n\nThe new device by Teal Health will offer a \"much preferred experience,\" the company said in its announcement, and also aims to increase screening rates by making the procedure more convenient.\n\nTraditionally, gynecologists have inserted a cold metal speculum deep into a woman's vagina to scrape cells from the cervix.\n\nThe Teal Wand — \"built with empathy,\" the company said — uses a swab to collect a vaginal sample. Women will then mail the sample to a lab that will screen for HPV (human papillomavirus), the virus that causes nearly all cervical cancers. A growing body of research has found HPV testing to be highly accurate.\n\nThe FDA approval Friday follows a U.S.-based study that found at-home screening was just as effective as that done in a doctor's office. The study also found women overwhelmingly preferred self–screening at home, and said they'd be more likely to stay up to date with cervical cancer screenings that way.\n\nEvery year, about 13,000 cases of cervical cancer are diagnosed, and more than 4,000 women die from the disease. Rates are down dramatically since Dr. Georgios Papanicolaou published a 1943 paper on how to use the Pap smear for screening, and it then became common.\n\nBut about a quarter of women in the U.S. are behind on such screenings, and medical experts say reducing that is key to the ultimate goal of eliminating cervical cancer. There's also a racial gap, with Black and Native American women far more likely to die from cervical cancer than white women. The HPV vaccine for teen and preteen girls, introduced in 2007, has also led to a global push to tackle the disease that way.\n\nAt-home cervical cancer screenings are already available in several other countries, including Australia and Sweden.\n\nTeal Health says its self-testing device will be available starting next month, in California first and then expanding. It will be by prescription, through a telehealth service, for women 25-65 years old who are \"at average risk.\" The company says it's working with insurance companies to provide coverage.",
                "Canada’s had this for a while. Much better alternative.",
                "Is much rather do it myself because I can slow down or stop when I feel pain or discomfort. Someone else just rams it in there and the whole process doesn’t go fast enough so the discomfort and pain last longer. \n\nAlso, I had an inexperienced doctor react like she was revolted because she mistook what is a backed up sebaceous gland for an HPV wart. She literally jumped back from me and treated me like I was diseased. The HPV test was negative. I never went back to her and the last I heard she moved to the urgent care clinic where she belongs.",
                "So is it for vaginal samples or cervical, or both? The article flip-flops and it's not clear which it is.",
                "Women's healthcare choices often feel like cutting off your hand or cutting off your finger.",
                "Finally!",
                "This is great. I have had two paps in my life and I'm 35. I got them both out of necessity for birth control and have since been sterilized. I'd prefer to do this at home in private than have someone else staring into the abyss, ya know. I'm very (to a fault) protective over my dignity.",
                "I've been avoiding my pap smear like the plague because of the gender dysphoria. Looking forward to this being available in AZ"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Hamas official says group holding direct talks with US in Qatar",
            "external_url": "https://www.bbc.com/news/articles/cx2q7749dxlo",
            "upvotes": 2385,
            "date": "05/11/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/2d86/live/c593b780-2ec6-11f0-b3e4-b7df0c3c542b.jpg",
            "top_comments": [
                "\"stop the fighting and ill build the most magnificent trump tower right on the gaza strip, it will have the best hotels and on-site gambling floor of all the casinos there!\"",
                "Amazing what a $300M gifted private jet can do.",
                "I thought we don’t negotiate with terrorists",
                "They must have minerals....",
                "They won’t reach a deal. Trump wants a win and switched tracks from Ukraine to Israel/Palestine after Putin kept snubbing him.\n\nThere’s a non-insignificant chance Putin calls up Iran and tells it to tell Hamas not to accept or at least honor any deal. Putin loves humiliating his stooge in the White House.",
                "member, that one time, when Trump negotiated the withdrawal of the US from Afghanistan without involving the Afghan government in the negotiations that caused a cluskerf*ck when Biden followed Trump's timetable and withdrawal settlement.... I member.",
                "Imagine their response if Obama or Biden had done this",
                "So Hamas bought Trump a plane, and Qatar delivered it?",
                "Pay for play politics",
                "MAGA Official:  'We're going to take Gaza completely, and build resort casinos on every inch of the land - and, in exchange, you and all the Palestinians can go elsewhere!'\n\nHamas:  'Death to Israel and the Great Satan!!!  Wait, what???  Elsewhere???  Where exactly is elsewhere?'\n\nMAGA Official:  'Doesn't matter!  Anywhere else is fine...  Well, you're going to want to avoid Israel - and don't even think of coming to the USA!'\n\nHamas:  'And what exactly do we get for giving you absolutely everything?'\n\nMAGA Official:  'I already told you!  You get to go elsewhere!  We get Gaza, and you get to F right off!'\n\nHamas:  [Throws up hands and shrugs.]\n\nMAGA Official:  'And, next time, instead of traditional formal-robes, you should probably put on suits and say 'Thank You!'"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/12/2025 12:16:56 UTC"
}