{
    "posts": [
        {
            "category": "HOT",
            "title": "DOJ says it has charged N.J. congresswoman with assaulting law enforcement at ICE facility",
            "external_url": "https://www.nbcnews.com/politics/justice-department/lamonica-mciver-ras-baraka-alina-habba-ice-new-jersey-newark-rcna207842",
            "upvotes": 5130,
            "date": "05/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-LaMonica-McIver-ac-810p-ede87e.jpg",
            "top_comments": [
                "[But have also dropped the charges against Newark mayor](https://www.cbsnews.com/newyork/news/ras-baraka-charge-dropped-alina-habba/)",
                "Funny how there are media reports from a couple of days ago that they’re changing how they’re charging public officials (https://thehill.com/homenews/administration/5307294-doj-key-review-elected-officials-prosecutions/amp/). \n\nAlso funny how they made a big deal of not weaponizing the DOJ; only to blatantly weaponize it.",
                "[removed]",
                ">Acting U.S. Attorney for the District of New Jersey Alina Habba made the announcement on X, where she accused the Democratic lawmaker of “assaulting, impeding and interfering with law enforcement.”\n\nThis is what they're going to do to anyone and everyone who stands in ICE's way.",
                "Fascists are trying to instill fear into the opposition. Never back down. This is a slam dunk case for her.",
                "The visit to the ICE facility was an official act as part of her legislative oversight authority. She has legislative immunity. Supreme Court said so.",
                "Ah, the classic tactic of using a headline to create a chilling effect! Another classic example of government waste.",
                "Arresting the political opposition is full on Russia, China shit.",
                "Fox is analyzing the video of this “assault” this like it’s the Zapruder film. Such bullshit. Know who was really assaulted ? The Capital Police on January 6.",
                "Assaulted by LEO? Charged with assaulting LEO."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump administration to pay $5 million to family of Jan. 6 rioter Ashli Babbitt",
            "external_url": "https://www.cbsnews.com/news/trump-administration-5-million-ashli-babbitt-jan-6-rioter-who-was-killed/",
            "upvotes": 11893,
            "date": "05/19/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/19/9ffec37c-c692-4567-94a2-5e37a1afe9eb/thumbnail/1200x630g3/eb119d6ad53eb10ffb3b667fe65772e7/gettyimages-1471239701.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "Hey look, actual government spending waste.",
                "My taxes are going to a fucking domestic terrorist\n\nWhat a fucked up timeline",
                "That's American taxpayer dollars going to someone who was trying to overthrow our government.  Our country is so fucked.",
                "No, the American Taxpayers will pay $5M to her family. \n\nAsk yourself if you’re okay with sending money to the family of a domestic terrorist.",
                "This action is 100% designed to convince fanatics to willfully sacrifice themselves in the future.",
                "Fuck this administration and that traitor Babbitt",
                "She was a domestic terrorist. Donald trump is a domestic terrorist. MAGA is a domestic terrorist organization.",
                "God damn outrage.\n\nThere are 140 LEOs injured on January 6 who should now sue the Babbit family.\n\nHow much is the Trump Administration offering to the family of Capitol Police Officer Brian Sicknick?",
                "Oh fuck this. Don't storm a government building then try to climb through a window to get at legislators, or they're gonna shoot you.",
                "Officer Brian sticknick should get 50 million for protecting this country with his life."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US closes Office of Palestinian Affairs, dedicated channel to Washington",
            "external_url": "https://www.theguardian.com/world/2025/may/19/office-of-palestinian-affairs-closed",
            "upvotes": 12574,
            "date": "05/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3637f60b69807ee2b0628f5e1bd71070e7dd3b08/418_0_4164_3333/master/4164.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1861c1df7f652e1053209e6b7688f987",
            "top_comments": [
                "' i want to be known as a peacekeeper' the idiot said",
                "\\*taps head\\*\n\n\"There's no need for an Office of Palestinian Affairs [when there's no Palestinians.](https://www.nbcnews.com/politics/national-security/trump-administration-working-plan-move-1-million-palestinians-libya-rcna207224)\"",
                "No need to pretend anymore.",
                "America elected the dumbest idiot in the history of the nation",
                "\"Don't need an Office of Palestinian Affairs if there are no Palestinians.\"\n\n- This administration",
                "well he is trying to get rid of palestine",
                "Sure am glad that all those purists who voted \"third party\" or stayed home because Kamala was a \"war criminal\" were able to keep their principles!\n\nOtherwise we might be in a situation far worse for the Palestinians than the current, stark utopia that awaits them with this government.\n\nEdit: added \"stayed home\"",
                "Isn't this why Dearborn voted for Trump?",
                "This is just cruelty for cruelty's sake.",
                "So the protest votes against Harris didn’t work?! How could anyone see this coming?? /s"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Netflix strikes deal to bring Sesame Street to streaming giant",
            "external_url": "https://www.bbc.co.uk/news/articles/c80k7z8z77yo",
            "upvotes": 1742,
            "date": "05/20/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ee2f/live/016629a0-3525-11f0-8d66-cd233f41fe78.jpg",
            "top_comments": [
                "Joking aside, I like that this gives them some financial stability while still allowing the episodes to air on PBS. If that side of it eventually stops, however, it would be terrible to put something as beneficial as Sesame Street behind a paywall.",
                "Sounds good. They get continue to on PBS with same day release on Netflix",
                "A is for Are You Still Watching",
                "So it'll get cancelled in a couple seasons after getting rave reviews?",
                "Jim Henson is rolling in his grave over the private takeover of a public learning experience for children",
                "P is for Pay your fucking subscription fees",
                "Is Netflix paying their taxes yet?  I'm not giving them money until they finally pay their fair share of taxes.  Here they are again (as with the Internet on which they depend) benefitting from something created in part by taxpayer money.  I expect Netflix to pay their taxes.",
                "This is really scary because I don’t want Sesame Street to go away. And with Netflix reputation it’ll air for one season and then go away maybe two if we’re lucky hopefully they’re just bringing back all the old episodes and playing those.",
                "Elmo doing a sketch as Eleven from Stranger Things is definitely something I'd watch.",
                "Am I the only one that thinks this is kind of gross?  Another public asset gobbled up by a faceless corporation to be bent to their will?  Suddenly Elmo will have politics that just so happen to align with Netflix’s board."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "U.S. attorney drops case against Newark Mayor Ras Baraka, charges Rep. LaMonica McIver for ICE protest",
            "external_url": "https://www.cbsnews.com/newyork/news/ras-baraka-charge-dropped-alina-habba/",
            "upvotes": 1296,
            "date": "05/20/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/09/689bd000-6611-40fe-a9ee-8565bdb639fd/thumbnail/1200x630/fed1cdf3473bbf947e0da1d35ffaa584/gettyimages-2213144885.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "So just curious, do congresspersons have the right to access these facilities as part of their oversight role?",
                ">Habba also announced her office [charged](https://x.com/USAttyHabba/status/1924615111198576645) U.S. Rep. LaMonica McIver for \"assaulting, impeding and interfering with law enforcement\" during the Delaney Hall visit. \n\nSo they're going to resume prosecuting all the J6 seditionists?",
                "Oh how the tables will turn. I just hope that in the next dem administration there is a call to action to get these people before committees and investigate their unlawful activities, but most of all hold them accountable for their abuse of power. (Wishful thinking)",
                "“Speak up, speak out, get in the way. Get in good trouble, necessary trouble, and help redeem the soul of America.” - John Lewis\n\nI hope some of these people who are being arrested see it as a badge of honor to be arrested. They are on the right side of history and what the United States should be.",
                "Fascist political theater.  ICE and the AG are the enemy, not Rep. McIver.",
                "Now sue those fuckers.",
                "Are they suggesting she assaulted someone? Is there evidence of that? My understanding is that the Congresspeople were the ones being subjected to physical confrontation.",
                "So... Basically, the legal equivalent of duck duck go but for black representatives 😂\n\nClown regime 🤡"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Shipment of thousands of chicks left in USPS truck. Overwhelmed shelter needs help adopting them",
            "external_url": "https://www.cbsnews.com/news/chicks-usps-truck-delaware-abandoned/",
            "upvotes": 1818,
            "date": "05/19/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/19/83c47a02-76c4-47dd-a056-f3e03f16693d/thumbnail/1200x630/3d0e05b0c6d415b01c30d29222c12a95/ap25139635835352.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "This is brutal.\n\n>A Delaware animal shelter is trying to care for and rehome thousands of chicks that survived being left in a postal service truck for three days. **Trapped in a warm enclosure, without food and water, thousands died before they were discovered on May 2**, [CBS affiliate WBOC](https://www.wboc.com/news/delaware-shelter-caring-for-thousands-of-birds-after-shipping-mishap/article_002f58bc-db85-4203-99af-0a2a363308cf.html) reported.",
                ">Some have inquired about buying the birds for meat, but, as a no-kill shelter and SPCA, those were refused.\n\nI've got just under a hundred assorted breeds that are free to come and go as they please. I keep them solely for the eggs, the company (plus they make good sentries for my other critters re predators etc) and because they eat bugs. But almost all my chickens eventually die of old age. \n\nJust sayin, chickens are pretty awesome.",
                "Horrible timeline for eyes, ears, and a heart",
                "We have 8 chicks in the hands of USPS as we speak. We will be first time chicken parents. This isn’t exactly encouraging.",
                "Oh geez, one of my good friends has a farm in the area — texting her to see if they can take some of them in.",
                "Humans really suck, huh",
                "I ordered several turkey poults one year and a snow storm hit. They sat on an unheated truck for an extra day. I lost so many, it was truly devastating. \n\nI only buy hatching eggs now. I’ll never order live chicks again. I don’t know how some do it. It just feels so inhumane to do that to the poor birds. They can’t control their environment at all.",
                "I don't understand how this happens. I worked for fedex for a time, at a ramp that saw lots of different live animals in conveyance, including often hundreds, and sometimes thousands of chicks in a day. The live animals are checked by 3 parties wherever they move on property, including usps, especially if held at the end and beginning of each work day, excluding multiple people in management who also took concern to make sure those boxes were checked. Unfortunately, there are sometimes a dozen or more DoA anyway from chicks escaping mid flight -probably 10% of all the flights inbound with lives in the aft cargo- but nothing compared to this. A shame those customers also probably just reordered the chicks on insurance or something and just rejected the order of \"defective chicks to die or try to be rescued by someone else.",
                "On LaJoy's watch? Color me shocked...",
                "> Some have inquired about buying the birds for meat, but, as a no-kill shelter and SPCA, those were refused.\n\nThis seems like a pointless line drawn in the sand."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Regeneron to buy bankrupt DNA testing firm 23andMe for $256 million",
            "external_url": "https://www.cnn.com/2025/05/19/business/regeneron-23-and-me?utm_medium=social&utm_source=igCNN&utm_content=2025-05-19T12%3A31%3A59",
            "upvotes": 19168,
            "date": "05/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/231207110123-23andme-testing-kit-file.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Delete Your Data From 23andMe\n\nhttps://www.nytimes.com/wirecutter/reviews/wirecutter-show-podcast-20250328-23andme-data-bankrupt/",
                "Can't wait to fight my genetically upgraded evil clone, designed to replace me!!",
                "$256 million/15 million customers = $17.\n\nYour DNA is worth $17.",
                "IMO the biggest miss with 23&Me is them not buying Ancestry.com, etc, to help build a collaborative genealogical chart system families could use and edit, or expanding on it with local family related news and documents available throughout the generations to better piece together familial history and even photos, etc.\n\nAside from selling biological info to ad companies or insurers or other seedy profiteers, I don’t see why they couldn’t have made money from a reduced priced option for current members / entrants to access the “plus” member benefits or used the genetic data and self reports, combined with localized double blind studies ofc, to confirm data trends that could be profitable while also not selling discreet information.\n\nI feel like they just didn’t broaden the definition of what was possible under their company’s umbrella.",
                "I am a former Regeneron employee (retired).  I can say they are not buying the failing business. They are buying the genetic database to use in the development of new monoclonal antibody therapeutic proteins.  There is an arms race to get to good candidates first to stake out patents to prevent competitors access to whole categories of potential therapies. They have lost several lawsuits to others who got there first metaphorically speaking.  They have technology to rapidly test candidates with Velocogene and could theoretically get dozens of billion dollar drugs from this dataset without any patent fights. The money spent is peanuts to its potential value.  While I am not a huge fan of the cost of these therapies , I personally know the tens to hundreds of thousands of man hours that go into developing these drugs, and they can be astonishingly effective.  It’s not popular to say you worked in big pharma but I’m very proud of the work I did there and how it has affected patients, including members of my own extended family.",
                "I never did a DNA test because I always felt it was going to be used for transactional reasons. This is exactly why; Your information is whoever buys it.",
                "I sent my DNA in knowing all the pitfalls (to Ancestry, not 23andMe, but same thing) because I'm adopted and wanted to find my biological family. I actually found them, and now have a solid relationship with my full biological brother, which has been well worth any horrors that might occur from my DNA being in a database. Otherwise, I wouldn't do this.",
                "Ok, I guess I need to brace for the downvotes given the current comments here. \n\nHonestly, this is worlds better than an insurance company or some random tech startup with undescribed end goals, guys. This is a legitimate big pharmaceutical company who has a lot of R&D around genetic disease and has made a lot of therapeutic advances. They want the data to develop new therapies, probably ones for genetic based disease. Being the first to do this will make them so much money. That’s their goal here, I think. It’s new massively growing space in R&D. And this much genetic data is research treasure trove for them.\n\nThey are also going to have pre-designed protocols and standards when it comes to handling this data. I know people side eye big pharma (rightfully in most circumstances) but this is a much better outcome than many other situations.\n\nAm I saying don’t delete your data? No. Am I saying this is better than pretty much any other potential buyer? Absolutely.\n\nI also want to add one thing: All the stuff about Trump ties is wild. Pretty much every pharma company (and  many of the academic researchers that Trump is now black listing from NIH funding due to their coronavirus research) got Project Warp Speed funding during the pandemic. Monoclonal antibody treatment was an absolute scientific miracle. So were the other rapid vaccine developments during the pandemic. It saved so many lives.",
                "What are the downsides of them having our dna data. I keep seeing everyone saying delete it.",
                "Forgive me for being dumb but isn't a drug maker buying 23 and me a good thing? \n\nI'm just happy it's not an insurance company so now this data can be used to actually help people."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Trump signs bill cracking down on explicit deepfakes",
            "external_url": "https://www.nbcnews.com/politics/white-house/trump-sign-bill-cracking-deepfake-pornography-rcna207693",
            "upvotes": 2251,
            "date": "05/19/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-donald-trump-melania-deepfakes-mn-1602-30d2e6.jpg",
            "top_comments": [
                "Wouldn't this violate the order to not regulate the AI market for the next 10 years?",
                "Isn't he fooled by MS paint letters on someone's knuckle",
                "Start with that bullshit video of him playing the piano and guitar he reposted over the weekend.  \n\n18 people dead from Tornados and he is tweeting ego driven fakes.  What a POS",
                "This is highkey just because of that AI-generated video of him sucking on Elon's toes.",
                "Please add AI-generated photos that are in poor taste to the bill. So the world sees less of them om his socials.",
                "I'm guessing to crack down on videos he doesn't like.  But videos from him will be legal",
                "C'mon!\n\nWho did that Gaza Trump/Musk promotion vid? \n\nCan't \"crack down\" on one with out cracking down on all.",
                "He’s gonna use it to force removal of anything online he doesn’t like.",
                "Note that this will affect more than explicit deepfakes. There are no provisions against using this law in bad faith. Trump has [already said](https://www.eff.org/deeplinks/2025/03/trump-calls-congress-pass-overbroad-take-it-down-act-so-he-can-use-it-censor) that he will take advantage of this law to censor online speech critical of him. The EFF is [opposed to it](https://www.eff.org/deeplinks/2025/04/congress-passes-take-it-down-act-despite-major-flaws) for numerous reasons.",
                "You mean he wants the government to have a monopoly on disinformation."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "70% of the DOJ's Civil Rights Division lawyers are leaving because of Trump's reshaping",
            "external_url": "https://www.npr.org/2025/05/19/g-s1-66906/trump-civil-rights-justice-exodus",
            "upvotes": 4756,
            "date": "05/19/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7495x4216+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbe%2F5b%2Fffb7ca6c4105945ceb2403174df8%2Fgettyimages-2202122201-1.jpg",
            "top_comments": [
                "“Reshaping”\n\nNever knew that was a synonym for “corruption-driven vendetta”.",
                "Great. Now the DOJ is going to be filled with Fox News employees",
                "Shockingly, people who have dedicated their lives to advancing civil rights don't want to be part of an administration hell bent on reversing them.",
                "Trump is in the process of removing all opposition. It couldn't be any more obvious. Everyone should have a red light flashing in their brain.",
                "Will take 10 years to recover - a lost decade ",
                "It’s like Putin is in the white house and he’s just destroying as much as possible",
                "This 4th of July will be no flag for me the country is dead and I am completely disgusted with so much about it , it makes me sick . My husband , a proud WWll vet , celebrated every year and I kept it up for him , but it is a total farce and I refuse to pretend .",
                "Just as it was intended to",
                "Trump keeps losing in the courts because he is running out of lawyers. \n\nMalevolence tempered by incompetence.",
                "That's most likely the goal; to get them to leave."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "CBS News chief steps down amid tension over Trump lawsuit",
            "external_url": "https://www.nbcnews.com/business/media/cbs-news-chief-steps-down-over-trump-tensions-rcna207700",
            "upvotes": 5426,
            "date": "05/19/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-wendy-mcmahon-mb-1605-cf1d81.jpg",
            "top_comments": [
                "Another example as to why independent media is important",
                "From the article:\n\n//\nThe president and CEO of CBS News said Monday that she is stepping down, marking the second high-profile departure from the organization within the past month as it contends with a $20 billion lawsuit from President Donald Trump and a high-profile merger.\n\nWendy McMahon, who took over the stalwart news brand in 2023, said in a memo that her time atop the company has been \"a privilege and joy,\" but that the past few months had been \"challenging.\"\n\n\"It’s become clear that the company and I do not agree on the path forward,\" McMahon wrote in a memo to CBS News staff. \"It’s time for me to move on and for this organization to move forward with new leadership.\"\n//",
                "I'm not even sure what the main problem is with mainstream news organizations are, cowardice, greed, avarice, or stupidity.\n\nAt this point I'm convinced we as a society are better off without giant corporations controlling all aspects of news and entertainment. \n\nBreak them all up.",
                "Super fun to watch all the news orgs capitulate to the fascist fuck. I'm sure this bodes well for our future. 4 months in and you can see just how primed the wealthy are to abandon entire groups of people and democracy itself to ensure they keep making money.",
                "Last night on Last Week Tonight.",
                "Another brick in the wall against fascism has crumbled.",
                "There goes the reporting, what’s left? A scattered, frayed court system. Coming Soon Amerirussa 🤷‍♂️",
                "CBS: Cave-in Broadcasting System",
                "People in the US are so weak",
                "It's all about the Benjamins. News left the room when it was placed under \"entertainment\" management years ago. Rich people are trying to make more money while pissing on the proletariat."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Sir Keir Starmer joins condemnation of Israel over Gaza actions",
            "external_url": "https://www.bbc.co.uk/news/articles/czxy19n4kpyo",
            "upvotes": 229,
            "date": "05/20/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6ff1/live/2c5c1430-3516-11f0-925a-0f71ca151aef.jpg",
            "top_comments": [
                "\"UK Labour approved more weapons to Israel in three months than Tories did in four years\"\n\nhttps://www.middleeastmonitor.com/20250517-uk-labour-approved-more-weapons-to-israel-in-three-months-than-tories-did-in-four-years/",
                "Oh look, the fucking human rights lawyer has finally realised that cutting off food, water and power to millions of people is a crime against humanity. \n\nDon't worry, all Israel needs to do to get Captain Capitulation on side again is send someone who might be percieved to be slightly more popular than him and he'll roll over.",
                "I don't believe the guy has a genuine bone in his body. This is likely a move after a recent disastrous poll and an advisor thinks this might make him show a little humanity. ",
                "frozen pigs must be flying over hell"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Netflix strikes deal to bring Sesame Street to streaming giant",
            "external_url": "https://www.bbc.co.uk/news/articles/c80k7z8z77yo",
            "upvotes": 1741,
            "date": "05/20/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ee2f/live/016629a0-3525-11f0-8d66-cd233f41fe78.jpg",
            "top_comments": [
                "Joking aside, I like that this gives them some financial stability while still allowing the episodes to air on PBS. If that side of it eventually stops, however, it would be terrible to put something as beneficial as Sesame Street behind a paywall.",
                "Sounds good. They get continue to on PBS with same day release on Netflix",
                "A is for Are You Still Watching",
                "So it'll get cancelled in a couple seasons after getting rave reviews?",
                "Jim Henson is rolling in his grave over the private takeover of a public learning experience for children",
                "P is for Pay your fucking subscription fees",
                "Is Netflix paying their taxes yet?  I'm not giving them money until they finally pay their fair share of taxes.  Here they are again (as with the Internet on which they depend) benefitting from something created in part by taxpayer money.  I expect Netflix to pay their taxes.",
                "This is really scary because I don’t want Sesame Street to go away. And with Netflix reputation it’ll air for one season and then go away maybe two if we’re lucky hopefully they’re just bringing back all the old episodes and playing those.",
                "Elmo doing a sketch as Eleven from Stranger Things is definitely something I'd watch.",
                "Am I the only one that thinks this is kind of gross?  Another public asset gobbled up by a faceless corporation to be bent to their will?  Suddenly Elmo will have politics that just so happen to align with Netflix’s board."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Fourth New Orleans jail escapee, charged with murder, captured as manhunt for 6 others continues",
            "external_url": "https://www.nbcnews.com/news/us-news/fourth-new-orleans-jail-escapee-captured-manhunt-6-others-continues-rcna207846",
            "upvotes": 298,
            "date": "05/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-Orleans-Parish-Justice-Center-ew-100p-d8ee69.jpg",
            "top_comments": [
                "One of the guys was pre-trial on second degree battery and obstruction. Seems crazy to try to escape when you’re facing a sentence of maybe a few months.",
                "The \"To easy\" graffiti on the wall made me giggle.",
                "Yay, they capture 4 escapees. Now they just gotta figure out where to put them. LOL.\n\nIf yer gonna just throw people in jail, ya gotta pay for the jail. They're really expensive, yo. And guess what? If you work for the jail, guess where you spend most of your day . . . in jail. Gotta be one of the shitiest jobs in the world."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "U.S. attorney drops case against Newark Mayor Ras Baraka, charges Rep. LaMonica McIver for ICE protest",
            "external_url": "https://www.cbsnews.com/newyork/news/ras-baraka-charge-dropped-alina-habba/",
            "upvotes": 1296,
            "date": "05/20/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/09/689bd000-6611-40fe-a9ee-8565bdb639fd/thumbnail/1200x630/fed1cdf3473bbf947e0da1d35ffaa584/gettyimages-2213144885.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "So just curious, do congresspersons have the right to access these facilities as part of their oversight role?",
                ">Habba also announced her office [charged](https://x.com/USAttyHabba/status/1924615111198576645) U.S. Rep. LaMonica McIver for \"assaulting, impeding and interfering with law enforcement\" during the Delaney Hall visit. \n\nSo they're going to resume prosecuting all the J6 seditionists?",
                "Oh how the tables will turn. I just hope that in the next dem administration there is a call to action to get these people before committees and investigate their unlawful activities, but most of all hold them accountable for their abuse of power. (Wishful thinking)",
                "“Speak up, speak out, get in the way. Get in good trouble, necessary trouble, and help redeem the soul of America.” - John Lewis\n\nI hope some of these people who are being arrested see it as a badge of honor to be arrested. They are on the right side of history and what the United States should be.",
                "Fascist political theater.  ICE and the AG are the enemy, not Rep. McIver.",
                "Now sue those fuckers.",
                "Are they suggesting she assaulted someone? Is there evidence of that? My understanding is that the Congresspeople were the ones being subjected to physical confrontation.",
                "So... Basically, the legal equivalent of duck duck go but for black representatives 😂\n\nClown regime 🤡"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Alphabet's Waymo gets California nod for robotaxi expansion in San Francisco Bay Area",
            "external_url": "https://www.reuters.com/business/autos-transportation/alphabets-waymo-gets-california-nod-expansion-san-francisco-bay-area-2025-05-20/",
            "upvotes": 126,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Get ready for waymo Waymo taxis",
                "They seem to be popping up in alot more places. Had to go to DC for work last week and I saw like 12 of them roaming the streets.",
                "I’d love to take a driverless Waymo. That’s gotta be interesting. Probably a bit unnerving your first time.",
                "This is what the techbros want to replace BART, and sadly a lot of the people in the bay area are receptive to the idea. People are mad that BART has been in decline for a while now, and they think that the best solution to that is to cut BART's funding. Of course, that will just make things worse, so the fantasy is that self-driving taxis will take its place as the primary \"public transportation\" system."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "DOJ says it has charged N.J. congresswoman with assaulting law enforcement at ICE facility",
            "external_url": "https://www.nbcnews.com/politics/justice-department/lamonica-mciver-ras-baraka-alina-habba-ice-new-jersey-newark-rcna207842",
            "upvotes": 5128,
            "date": "05/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-LaMonica-McIver-ac-810p-ede87e.jpg",
            "top_comments": [
                "[But have also dropped the charges against Newark mayor](https://www.cbsnews.com/newyork/news/ras-baraka-charge-dropped-alina-habba/)",
                "Funny how there are media reports from a couple of days ago that they’re changing how they’re charging public officials (https://thehill.com/homenews/administration/5307294-doj-key-review-elected-officials-prosecutions/amp/). \n\nAlso funny how they made a big deal of not weaponizing the DOJ; only to blatantly weaponize it.",
                "[removed]",
                ">Acting U.S. Attorney for the District of New Jersey Alina Habba made the announcement on X, where she accused the Democratic lawmaker of “assaulting, impeding and interfering with law enforcement.”\n\nThis is what they're going to do to anyone and everyone who stands in ICE's way.",
                "Fascists are trying to instill fear into the opposition. Never back down. This is a slam dunk case for her.",
                "The visit to the ICE facility was an official act as part of her legislative oversight authority. She has legislative immunity. Supreme Court said so.",
                "Ah, the classic tactic of using a headline to create a chilling effect! Another classic example of government waste.",
                "Arresting the political opposition is full on Russia, China shit.",
                "Fox is analyzing the video of this “assault” this like it’s the Zapruder film. Such bullshit. Know who was really assaulted ? The Capital Police on January 6.",
                "Assaulted by LEO? Charged with assaulting LEO."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Retired Navy Admiral Is Convicted on Bribery Charges",
            "external_url": "https://www.nytimes.com/2025/05/19/us/navy-admiral-convicted-bribery.html?unlocked_article_code=1.Ik8.nnMW._6nonwkeEqo9&smid=re-share",
            "upvotes": 686,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">> In a statement on Monday, Jeanine Pirro, the interim United States attorney for Washington, said that the verdict sent a message.\n\n“When you abuse your position and betray the public trust to line your own pockets, it undermines the confidence in the government you represent,” Ms. Pirro said. “Our office, with our law enforcement partners, will root out corruption — be it bribes or illegal contracts — and hold accountable the perpetrators, no matter what title or rank they hold.”<<\n\n**sigh**",
                "Oh wow.  I assumed this would be another in the long line of Naval officers to fall prey to the wiles of Fat Leonard.  I guess the deterrent effect of that operation didn’t dissuade this admiral from taking the same bribery plunge as his fellow seamen.  Thank you for your service.  \n\nAlso it’s a real hoot to see a Pirro quote in a DOJ press release. This must be one of the first actions she’s been able to comment on!",
                "So originally arrested under Biden. \n\n\nI was also surprised to read he wasn't part of the Pacific fleet and Fat Leonard.",
                "Tsk tsk tsk, if you want to take bribe you got to run for POTUS ma dude.",
                "Sadly he will probable get a slap on the wrist because of his rank. \n\nHe should get jail, reduced rank and never be allowed to work with a government contractor ever again. \n\nIt is amazing how greedy people can be. Making all that money as a 4 star officer and still looking for bribes.",
                "That guy already had a fucking banger of a pension.\n\nOh well, play stupid games, win stupid prizes.  I hope he enjoys jail and the loss of his pension and medical benefits.",
                "Did someone also offer him an airplane?",
                "“I expect the evidence will show that Burke and others at the Navy misled Charlie and Meghan in material ways, and **they’re not liable for bribing the guy who lied to them**,” Mr. Brodsky said. \n\n\\- The defense lawyer is stating publicly that his clients bribed the Admiral.",
                "These people are so unserious",
                "Anyone on reddit wanna tell me how this is any different than what Admiral Bobby R. Inman or General Michael V. Hayden did after they retired? Or anyone with a clearance that then joins a private company with over 200k salary?\n\nNot joking.\nReally wanna know how it's different because this shit is as common as Trump’s real estate fraud."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Shipment of thousands of chicks left in USPS truck. Overwhelmed shelter needs help adopting them",
            "external_url": "https://www.cbsnews.com/news/chicks-usps-truck-delaware-abandoned/",
            "upvotes": 1821,
            "date": "05/19/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/19/83c47a02-76c4-47dd-a056-f3e03f16693d/thumbnail/1200x630/3d0e05b0c6d415b01c30d29222c12a95/ap25139635835352.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "This is brutal.\n\n>A Delaware animal shelter is trying to care for and rehome thousands of chicks that survived being left in a postal service truck for three days. **Trapped in a warm enclosure, without food and water, thousands died before they were discovered on May 2**, [CBS affiliate WBOC](https://www.wboc.com/news/delaware-shelter-caring-for-thousands-of-birds-after-shipping-mishap/article_002f58bc-db85-4203-99af-0a2a363308cf.html) reported.",
                ">Some have inquired about buying the birds for meat, but, as a no-kill shelter and SPCA, those were refused.\n\nI've got just under a hundred assorted breeds that are free to come and go as they please. I keep them solely for the eggs, the company (plus they make good sentries for my other critters re predators etc) and because they eat bugs. But almost all my chickens eventually die of old age. \n\nJust sayin, chickens are pretty awesome.",
                "Horrible timeline for eyes, ears, and a heart",
                "We have 8 chicks in the hands of USPS as we speak. We will be first time chicken parents. This isn’t exactly encouraging.",
                "Oh geez, one of my good friends has a farm in the area — texting her to see if they can take some of them in.",
                "Humans really suck, huh",
                "I ordered several turkey poults one year and a snow storm hit. They sat on an unheated truck for an extra day. I lost so many, it was truly devastating. \n\nI only buy hatching eggs now. I’ll never order live chicks again. I don’t know how some do it. It just feels so inhumane to do that to the poor birds. They can’t control their environment at all.",
                "I don't understand how this happens. I worked for fedex for a time, at a ramp that saw lots of different live animals in conveyance, including often hundreds, and sometimes thousands of chicks in a day. The live animals are checked by 3 parties wherever they move on property, including usps, especially if held at the end and beginning of each work day, excluding multiple people in management who also took concern to make sure those boxes were checked. Unfortunately, there are sometimes a dozen or more DoA anyway from chicks escaping mid flight -probably 10% of all the flights inbound with lives in the aft cargo- but nothing compared to this. A shame those customers also probably just reordered the chicks on insurance or something and just rejected the order of \"defective chicks to die or try to be rescued by someone else.",
                "On LaJoy's watch? Color me shocked...",
                "> Some have inquired about buying the birds for meat, but, as a no-kill shelter and SPCA, those were refused.\n\nThis seems like a pointless line drawn in the sand."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Trump signs bill cracking down on explicit deepfakes",
            "external_url": "https://www.nbcnews.com/politics/white-house/trump-sign-bill-cracking-deepfake-pornography-rcna207693",
            "upvotes": 2247,
            "date": "05/19/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-donald-trump-melania-deepfakes-mn-1602-30d2e6.jpg",
            "top_comments": [
                "Wouldn't this violate the order to not regulate the AI market for the next 10 years?",
                "Isn't he fooled by MS paint letters on someone's knuckle",
                "Start with that bullshit video of him playing the piano and guitar he reposted over the weekend.  \n\n18 people dead from Tornados and he is tweeting ego driven fakes.  What a POS",
                "This is highkey just because of that AI-generated video of him sucking on Elon's toes.",
                "Please add AI-generated photos that are in poor taste to the bill. So the world sees less of them om his socials.",
                "I'm guessing to crack down on videos he doesn't like.  But videos from him will be legal",
                "C'mon!\n\nWho did that Gaza Trump/Musk promotion vid? \n\nCan't \"crack down\" on one with out cracking down on all.",
                "He’s gonna use it to force removal of anything online he doesn’t like.",
                "Note that this will affect more than explicit deepfakes. There are no provisions against using this law in bad faith. Trump has [already said](https://www.eff.org/deeplinks/2025/03/trump-calls-congress-pass-overbroad-take-it-down-act-so-he-can-use-it-censor) that he will take advantage of this law to censor online speech critical of him. The EFF is [opposed to it](https://www.eff.org/deeplinks/2025/04/congress-passes-take-it-down-act-despite-major-flaws) for numerous reasons.",
                "You mean he wants the government to have a monopoly on disinformation."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "‘A family is torn apart’: Three children in family killed after vehicle struck by allegedly impaired driver",
            "external_url": "https://www.thestar.com/news/gta/a-family-is-torn-apart-three-children-killed-after-vehicle-struck-by-allegedly-impaired-driver/article_e84e863d-dd03-4ffb-ba79-1afab4dcc31b.html",
            "upvotes": 162,
            "date": "05/19/2025",
            "thumbnail": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/f/1a/f1a8f5b8-6c8d-5b94-b117-bd65043bdd0a/682a016e07720.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "top_comments": [
                "Absolute nightmare; what do you even do after something like this? Grieve? That word feels totally worthless to describe what this family's going through. You grieve for your grandmother, your beloved family pet, your troubled uncle who overdosed. What do you do when it feels like Hell itself has opened up before you, and swallowed up everything you loved?\n\nI don't have an answer, but I hope they find peace - and, if they're a far better person than I, forgiveness.",
                "That asshole should serve 3 consecutive life sentences!",
                "It's crazy how many families are ripped apart like this. Four of the five fatalities while I was in school were from cars. \n\nI still find it crazy how dangerous driving is compared to how everyday it is. It's by far the biggest cause of death for young people (38% for car accidents, 13% for the next one, homicide) https://www.cdc.gov/nchs/products/databriefs/db37.htm#sum",
                "To think this selfish person only had to use an app probably already set up on their phone. \n\nIn situations like this if they can trace the drunk back to a bar, that bar should also be in trouble. \n\nBartenders, please cut people off if they are driving.\n\nEdit\n\nI have been made aware that the drunk is only 19 so probably not at a bar. The headline was upsetting enough and I didn't read the article out of self preservation of my mental health. \n\nThis situation just sucks."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Sir Keir Starmer joins condemnation of Israel over Gaza actions",
            "external_url": "https://www.bbc.co.uk/news/articles/czxy19n4kpyo",
            "upvotes": 230,
            "date": "05/20/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6ff1/live/2c5c1430-3516-11f0-925a-0f71ca151aef.jpg",
            "top_comments": [
                "\"UK Labour approved more weapons to Israel in three months than Tories did in four years\"\n\nhttps://www.middleeastmonitor.com/20250517-uk-labour-approved-more-weapons-to-israel-in-three-months-than-tories-did-in-four-years/",
                "Oh look, the fucking human rights lawyer has finally realised that cutting off food, water and power to millions of people is a crime against humanity. \n\nDon't worry, all Israel needs to do to get Captain Capitulation on side again is send someone who might be percieved to be slightly more popular than him and he'll roll over.",
                "I don't believe the guy has a genuine bone in his body. This is likely a move after a recent disastrous poll and an advisor thinks this might make him show a little humanity. ",
                "frozen pigs must be flying over hell"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Netflix strikes deal to bring Sesame Street to streaming giant",
            "external_url": "https://www.bbc.co.uk/news/articles/c80k7z8z77yo",
            "upvotes": 1743,
            "date": "05/20/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ee2f/live/016629a0-3525-11f0-8d66-cd233f41fe78.jpg",
            "top_comments": [
                "Joking aside, I like that this gives them some financial stability while still allowing the episodes to air on PBS. If that side of it eventually stops, however, it would be terrible to put something as beneficial as Sesame Street behind a paywall.",
                "Sounds good. They get continue to on PBS with same day release on Netflix",
                "A is for Are You Still Watching",
                "So it'll get cancelled in a couple seasons after getting rave reviews?",
                "Jim Henson is rolling in his grave over the private takeover of a public learning experience for children",
                "P is for Pay your fucking subscription fees",
                "Is Netflix paying their taxes yet?  I'm not giving them money until they finally pay their fair share of taxes.  Here they are again (as with the Internet on which they depend) benefitting from something created in part by taxpayer money.  I expect Netflix to pay their taxes.",
                "This is really scary because I don’t want Sesame Street to go away. And with Netflix reputation it’ll air for one season and then go away maybe two if we’re lucky hopefully they’re just bringing back all the old episodes and playing those.",
                "Elmo doing a sketch as Eleven from Stranger Things is definitely something I'd watch.",
                "Am I the only one that thinks this is kind of gross?  Another public asset gobbled up by a faceless corporation to be bent to their will?  Suddenly Elmo will have politics that just so happen to align with Netflix’s board."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "U.S. attorney drops case against Newark Mayor Ras Baraka, charges Rep. LaMonica McIver for ICE protest",
            "external_url": "https://www.cbsnews.com/newyork/news/ras-baraka-charge-dropped-alina-habba/",
            "upvotes": 1298,
            "date": "05/20/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/09/689bd000-6611-40fe-a9ee-8565bdb639fd/thumbnail/1200x630/fed1cdf3473bbf947e0da1d35ffaa584/gettyimages-2213144885.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "So just curious, do congresspersons have the right to access these facilities as part of their oversight role?",
                ">Habba also announced her office [charged](https://x.com/USAttyHabba/status/1924615111198576645) U.S. Rep. LaMonica McIver for \"assaulting, impeding and interfering with law enforcement\" during the Delaney Hall visit. \n\nSo they're going to resume prosecuting all the J6 seditionists?",
                "Oh how the tables will turn. I just hope that in the next dem administration there is a call to action to get these people before committees and investigate their unlawful activities, but most of all hold them accountable for their abuse of power. (Wishful thinking)",
                "“Speak up, speak out, get in the way. Get in good trouble, necessary trouble, and help redeem the soul of America.” - John Lewis\n\nI hope some of these people who are being arrested see it as a badge of honor to be arrested. They are on the right side of history and what the United States should be.",
                "Fascist political theater.  ICE and the AG are the enemy, not Rep. McIver.",
                "Now sue those fuckers.",
                "Are they suggesting she assaulted someone? Is there evidence of that? My understanding is that the Congresspeople were the ones being subjected to physical confrontation.",
                "So... Basically, the legal equivalent of duck duck go but for black representatives 😂\n\nClown regime 🤡"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "DOJ says it has charged N.J. congresswoman with assaulting law enforcement at ICE facility",
            "external_url": "https://www.nbcnews.com/politics/justice-department/lamonica-mciver-ras-baraka-alina-habba-ice-new-jersey-newark-rcna207842",
            "upvotes": 5124,
            "date": "05/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-LaMonica-McIver-ac-810p-ede87e.jpg",
            "top_comments": [
                "[But have also dropped the charges against Newark mayor](https://www.cbsnews.com/newyork/news/ras-baraka-charge-dropped-alina-habba/)",
                "Funny how there are media reports from a couple of days ago that they’re changing how they’re charging public officials (https://thehill.com/homenews/administration/5307294-doj-key-review-elected-officials-prosecutions/amp/). \n\nAlso funny how they made a big deal of not weaponizing the DOJ; only to blatantly weaponize it.",
                "[removed]",
                ">Acting U.S. Attorney for the District of New Jersey Alina Habba made the announcement on X, where she accused the Democratic lawmaker of “assaulting, impeding and interfering with law enforcement.”\n\nThis is what they're going to do to anyone and everyone who stands in ICE's way.",
                "Fascists are trying to instill fear into the opposition. Never back down. This is a slam dunk case for her.",
                "The visit to the ICE facility was an official act as part of her legislative oversight authority. She has legislative immunity. Supreme Court said so.",
                "Ah, the classic tactic of using a headline to create a chilling effect! Another classic example of government waste.",
                "Arresting the political opposition is full on Russia, China shit.",
                "Fox is analyzing the video of this “assault” this like it’s the Zapruder film. Such bullshit. Know who was really assaulted ? The Capital Police on January 6.",
                "Assaulted by LEO? Charged with assaulting LEO."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Shipment of thousands of chicks left in USPS truck. Overwhelmed shelter needs help adopting them",
            "external_url": "https://www.cbsnews.com/news/chicks-usps-truck-delaware-abandoned/",
            "upvotes": 1821,
            "date": "05/19/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/19/83c47a02-76c4-47dd-a056-f3e03f16693d/thumbnail/1200x630/3d0e05b0c6d415b01c30d29222c12a95/ap25139635835352.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "This is brutal.\n\n>A Delaware animal shelter is trying to care for and rehome thousands of chicks that survived being left in a postal service truck for three days. **Trapped in a warm enclosure, without food and water, thousands died before they were discovered on May 2**, [CBS affiliate WBOC](https://www.wboc.com/news/delaware-shelter-caring-for-thousands-of-birds-after-shipping-mishap/article_002f58bc-db85-4203-99af-0a2a363308cf.html) reported.",
                ">Some have inquired about buying the birds for meat, but, as a no-kill shelter and SPCA, those were refused.\n\nI've got just under a hundred assorted breeds that are free to come and go as they please. I keep them solely for the eggs, the company (plus they make good sentries for my other critters re predators etc) and because they eat bugs. But almost all my chickens eventually die of old age. \n\nJust sayin, chickens are pretty awesome.",
                "Horrible timeline for eyes, ears, and a heart",
                "We have 8 chicks in the hands of USPS as we speak. We will be first time chicken parents. This isn’t exactly encouraging.",
                "Oh geez, one of my good friends has a farm in the area — texting her to see if they can take some of them in.",
                "Humans really suck, huh",
                "I ordered several turkey poults one year and a snow storm hit. They sat on an unheated truck for an extra day. I lost so many, it was truly devastating. \n\nI only buy hatching eggs now. I’ll never order live chicks again. I don’t know how some do it. It just feels so inhumane to do that to the poor birds. They can’t control their environment at all.",
                "I don't understand how this happens. I worked for fedex for a time, at a ramp that saw lots of different live animals in conveyance, including often hundreds, and sometimes thousands of chicks in a day. The live animals are checked by 3 parties wherever they move on property, including usps, especially if held at the end and beginning of each work day, excluding multiple people in management who also took concern to make sure those boxes were checked. Unfortunately, there are sometimes a dozen or more DoA anyway from chicks escaping mid flight -probably 10% of all the flights inbound with lives in the aft cargo- but nothing compared to this. A shame those customers also probably just reordered the chicks on insurance or something and just rejected the order of \"defective chicks to die or try to be rescued by someone else.",
                "On LaJoy's watch? Color me shocked...",
                "> Some have inquired about buying the birds for meat, but, as a no-kill shelter and SPCA, those were refused.\n\nThis seems like a pointless line drawn in the sand."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Fourth New Orleans jail escapee, charged with murder, captured as manhunt for 6 others continues",
            "external_url": "https://www.nbcnews.com/news/us-news/fourth-new-orleans-jail-escapee-captured-manhunt-6-others-continues-rcna207846",
            "upvotes": 303,
            "date": "05/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250516-Orleans-Parish-Justice-Center-ew-100p-d8ee69.jpg",
            "top_comments": [
                "One of the guys was pre-trial on second degree battery and obstruction. Seems crazy to try to escape when you’re facing a sentence of maybe a few months.",
                "The \"To easy\" graffiti on the wall made me giggle.",
                "Yay, they capture 4 escapees. Now they just gotta figure out where to put them. LOL.\n\nIf yer gonna just throw people in jail, ya gotta pay for the jail. They're really expensive, yo. And guess what? If you work for the jail, guess where you spend most of your day . . . in jail. Gotta be one of the shitiest jobs in the world."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Retired Navy Admiral Is Convicted on Bribery Charges",
            "external_url": "https://www.nytimes.com/2025/05/19/us/navy-admiral-convicted-bribery.html?unlocked_article_code=1.Ik8.nnMW._6nonwkeEqo9&smid=re-share",
            "upvotes": 688,
            "date": "05/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">> In a statement on Monday, Jeanine Pirro, the interim United States attorney for Washington, said that the verdict sent a message.\n\n“When you abuse your position and betray the public trust to line your own pockets, it undermines the confidence in the government you represent,” Ms. Pirro said. “Our office, with our law enforcement partners, will root out corruption — be it bribes or illegal contracts — and hold accountable the perpetrators, no matter what title or rank they hold.”<<\n\n**sigh**",
                "Oh wow.  I assumed this would be another in the long line of Naval officers to fall prey to the wiles of Fat Leonard.  I guess the deterrent effect of that operation didn’t dissuade this admiral from taking the same bribery plunge as his fellow seamen.  Thank you for your service.  \n\nAlso it’s a real hoot to see a Pirro quote in a DOJ press release. This must be one of the first actions she’s been able to comment on!",
                "So originally arrested under Biden. \n\n\nI was also surprised to read he wasn't part of the Pacific fleet and Fat Leonard.",
                "Tsk tsk tsk, if you want to take bribe you got to run for POTUS ma dude.",
                "Sadly he will probable get a slap on the wrist because of his rank. \n\nHe should get jail, reduced rank and never be allowed to work with a government contractor ever again. \n\nIt is amazing how greedy people can be. Making all that money as a 4 star officer and still looking for bribes.",
                "That guy already had a fucking banger of a pension.\n\nOh well, play stupid games, win stupid prizes.  I hope he enjoys jail and the loss of his pension and medical benefits.",
                "Did someone also offer him an airplane?",
                "“I expect the evidence will show that Burke and others at the Navy misled Charlie and Meghan in material ways, and **they’re not liable for bribing the guy who lied to them**,” Mr. Brodsky said. \n\n\\- The defense lawyer is stating publicly that his clients bribed the Admiral.",
                "These people are so unserious",
                "Anyone on reddit wanna tell me how this is any different than what Admiral Bobby R. Inman or General Michael V. Hayden did after they retired? Or anyone with a clearance that then joins a private company with over 200k salary?\n\nNot joking.\nReally wanna know how it's different because this shit is as common as Trump’s real estate fraud."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump signs bill cracking down on explicit deepfakes",
            "external_url": "https://www.nbcnews.com/politics/white-house/trump-sign-bill-cracking-deepfake-pornography-rcna207693",
            "upvotes": 2249,
            "date": "05/19/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250519-donald-trump-melania-deepfakes-mn-1602-30d2e6.jpg",
            "top_comments": [
                "Wouldn't this violate the order to not regulate the AI market for the next 10 years?",
                "Isn't he fooled by MS paint letters on someone's knuckle",
                "Start with that bullshit video of him playing the piano and guitar he reposted over the weekend.  \n\n18 people dead from Tornados and he is tweeting ego driven fakes.  What a POS",
                "This is highkey just because of that AI-generated video of him sucking on Elon's toes.",
                "Please add AI-generated photos that are in poor taste to the bill. So the world sees less of them om his socials.",
                "I'm guessing to crack down on videos he doesn't like.  But videos from him will be legal",
                "C'mon!\n\nWho did that Gaza Trump/Musk promotion vid? \n\nCan't \"crack down\" on one with out cracking down on all.",
                "He’s gonna use it to force removal of anything online he doesn’t like.",
                "Note that this will affect more than explicit deepfakes. There are no provisions against using this law in bad faith. Trump has [already said](https://www.eff.org/deeplinks/2025/03/trump-calls-congress-pass-overbroad-take-it-down-act-so-he-can-use-it-censor) that he will take advantage of this law to censor online speech critical of him. The EFF is [opposed to it](https://www.eff.org/deeplinks/2025/04/congress-passes-take-it-down-act-despite-major-flaws) for numerous reasons.",
                "You mean he wants the government to have a monopoly on disinformation."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Trump administration to pay $5 million to family of Jan. 6 rioter Ashli Babbitt",
            "external_url": "https://www.cbsnews.com/news/trump-administration-5-million-ashli-babbitt-jan-6-rioter-who-was-killed/",
            "upvotes": 11894,
            "date": "05/19/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/19/9ffec37c-c692-4567-94a2-5e37a1afe9eb/thumbnail/1200x630g3/eb119d6ad53eb10ffb3b667fe65772e7/gettyimages-1471239701.jpg?v=f20aa8902dce18e45d5824503b07db36",
            "top_comments": [
                "Hey look, actual government spending waste.",
                "My taxes are going to a fucking domestic terrorist\n\nWhat a fucked up timeline",
                "That's American taxpayer dollars going to someone who was trying to overthrow our government.  Our country is so fucked.",
                "No, the American Taxpayers will pay $5M to her family. \n\nAsk yourself if you’re okay with sending money to the family of a domestic terrorist.",
                "This action is 100% designed to convince fanatics to willfully sacrifice themselves in the future.",
                "Fuck this administration and that traitor Babbitt",
                "She was a domestic terrorist. Donald trump is a domestic terrorist. MAGA is a domestic terrorist organization.",
                "God damn outrage.\n\nThere are 140 LEOs injured on January 6 who should now sue the Babbit family.\n\nHow much is the Trump Administration offering to the family of Capitol Police Officer Brian Sicknick?",
                "Oh fuck this. Don't storm a government building then try to climb through a window to get at legislators, or they're gonna shoot you.",
                "Officer Brian sticknick should get 50 million for protecting this country with his life."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US closes Office of Palestinian Affairs, dedicated channel to Washington",
            "external_url": "https://www.theguardian.com/world/2025/may/19/office-of-palestinian-affairs-closed",
            "upvotes": 12572,
            "date": "05/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3637f60b69807ee2b0628f5e1bd71070e7dd3b08/418_0_4164_3333/master/4164.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1861c1df7f652e1053209e6b7688f987",
            "top_comments": [
                "' i want to be known as a peacekeeper' the idiot said",
                "\\*taps head\\*\n\n\"There's no need for an Office of Palestinian Affairs [when there's no Palestinians.](https://www.nbcnews.com/politics/national-security/trump-administration-working-plan-move-1-million-palestinians-libya-rcna207224)\"",
                "No need to pretend anymore.",
                "America elected the dumbest idiot in the history of the nation",
                "\"Don't need an Office of Palestinian Affairs if there are no Palestinians.\"\n\n- This administration",
                "well he is trying to get rid of palestine",
                "Sure am glad that all those purists who voted \"third party\" or stayed home because Kamala was a \"war criminal\" were able to keep their principles!\n\nOtherwise we might be in a situation far worse for the Palestinians than the current, stark utopia that awaits them with this government.\n\nEdit: added \"stayed home\"",
                "Isn't this why Dearborn voted for Trump?",
                "This is just cruelty for cruelty's sake.",
                "So the protest votes against Harris didn’t work?! How could anyone see this coming?? /s"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/20/2025 08:13:32 UTC"
}