{
    "posts": [
        {
            "category": "HOT",
            "title": "US deports hundreds of Venezuelans despite court order",
            "external_url": "https://www.bbc.co.uk/news/articles/cp9yv1gnzyvo",
            "upvotes": 20445,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3465/live/53f1c740-0287-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "How? I thought by avoiding shutdown the courts would still be functioning and they would stop Trump in his tracks. Schumer said so.\n\nHow can he just ignore the court orders, that's not following the rules. I guess no one could have anticipated that.",
                "We didn’t deport them to Venezuela though. We paid El Salvador to imprison them in some sort of work camp super max prison site situation\n\n[bet the range of people and dissidents exported here grows](https://x.com/nayibbukele/status/1901245427216978290?s=46)",
                "Fine, we can't arrest the president for giving illegal order? Arrest the people that carry them out.",
                "Time to start holding people in prison for contempt. When there are worse repercussions to the lawyers and administrators defying court orders than possibly losing their jobs, they'll stop defying them. Checks and balances, the executive can't be free to ignore the judiciary.",
                "Our government ultimately relies on the assumption that the POTUS will fulfill his Constitutional obligations. We do not have that now. We have a criminal.",
                "Ladies and gentlemen: the \"Party of Law and Order\", once more fully displaying that they do not, in fact, give a shit about laws.",
                "Wouldn’t the Alien Enemies Act of 1798 require the US to be at war for this to be legal deportations? Does this mean then that Congress gave a declaration of war to both Mexico and Venezuela which is what the constitution requires or is Trump violating the U.S. constitution that he swore to uphold?",
                "Looks like we got a good ol' fashioned constitutional crisis on our hands. Grab the pitchforks.",
                "I think we are burying the lede\n\n>Bukele wrote that the detainees were immediately transferred to El Salvador’s Terrorism Confinement Center (Cecot) “for a period of one year”, something that was “renewable” - suggesting they could be held there for longer.\n>“The United States will pay a very low fee for them, but a high one for us,” he added.\n\nWe are paying (a lot it sounds like) for other countries to run our internment camps",
                "When the President says he and his office don't have to follow the law and that his followers who commit crimes can walk free without consequences and pledges to use the DOJ against his political enemies, we have a full blown Constitutional crisis and are at risk of losing our democracy completely."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Finland turns down US request for eggs",
            "external_url": "https://yle.fi/a/74-20149786",
            "upvotes": 1199,
            "date": "03/16/2025",
            "thumbnail": "https://images.cdn.yle.fi/image/upload/c_crop,x_0,y_0,w_1597,h_901/w_1200,ar_1.91,c_fill/q_auto:eco,f_auto,fl_lossy/v1723193249/39-133049966b5d6a6d2abd",
            "top_comments": [
                "So let me get this straight....\n\nYou expect to get something you need from someone you've pissed off?",
                "”US authorities have turned to Europe for help with the country's severe egg shortage. The shortfall is due to bird flu, which has plagued the United States for several years.\n\nThe Finnish Poultry Association says it has been contacted about exporting eggs to the US. The organisation's executive director, Veera Lehtilä, told Yle on Saturday that exporting eggs does not seem to be possible at the moment because no market access negotiations have been held with US authorities. This can be a drawn-out process involving extensive inspections and studies.”",
                "Maybe JD didn’t say please",
                "There is little to no goodwill left for the US in Europe. No eggs for you. \n\n\nThe US spent 80 years building up their role as a big brother to the western world, recognized as the leader of the free world.\n\n\nIt took Trump 3 weeks to destroy its reputation, and it will probably take several generations to make it \"great again\" ",
                "Any dealings in that magnitude has to be done through an EU negotiated trade agreement. \nAnd considering that the US has just started a trade war with the EU and threatens to invade EU territory.. that's gonna be a no from us dawg.",
                "You don’t have the cards",
                "Coming soon: *\"Nasty people in Finland, maybe we're looking at it becoming a US state...\"*",
                "The entire Republican Party is full of chickens. \n\nEggs should be no problem. ",
                "Finland: go suck eggs, oh wait you don't have enough for that. Lol, I'm kind of glad other countries are telling us to piss off because we're acting like bullies.",
                "Good. No free county should help the US while it’s under the grip of fascism."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "At least 32 Dead as Monster Storm System Sweeps across US South with Multiple Tornadoes",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/15/massive-storm-system-south-tornado-warnings-extreme-weather",
            "upvotes": 5728,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ecb1e814a589538afde609d31570f2f6e89dcc17/0_79_1796_1078/master/1796.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e5aaf03d42cc6335c886d36342ebfe59",
            "top_comments": [
                "NOAA cut. NWS cut. FEMA cut. Tariffs on metals, wood, and other raw materials impact the cost of repairs and rebuilding. Eliminating immigrants from the labor pool so there aren't enough workers to repair and rebuild.\n\nAt least they're owning the libs.",
                "FEMA defunded, government officials cannot travel with $1 credit card limit, and no leadership.",
                "Given the nature of climate change, this is only going to get worse, much worse.",
                "It'll be that non-existent climate change up to its old tricks! I'm sure he'll blame FEMA for it and cut their funding even more.",
                "Thoughts and tariffs <3",
                "[removed]",
                "God is punishing them, amirite trumpers?",
                "A good time to gut NOAA.",
                "Damn DEI and trans people making them storms!\n\n/s",
                "That's very sad and the number may rise after the fact, too. I hope those injured recover and the people impacted are able to repair/rebuild. \n\nAs an aside, Republicans like to go on about the government controlling the weather. Why didn't they just turn off the tornadoes? Weird that the republican-controlled government would do this to their own people, but i doubt you'll hear about this conspiracy theory like we did last hurricane season"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Fishermen sue San Diego’s Bumble Bee Foods for forced labor, abuse",
            "external_url": "https://www.nbcsandiego.com/news/local/fishermen-sue-san-diegos-bumble-bee-foods-for-forced-labor-abuse/3779868/",
            "upvotes": 715,
            "date": "03/16/2025",
            "thumbnail": "https://media.nbcsandiego.com/2019/09/Bumble-Bee-Tuna-AP_643616039433.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "So, to save some people a click... Bumble Bee Foods itself isn't the one that is accused of wrongdoing, but one of the companies in its supply chain. Specifically some boat captain around Indonesia. \n\nAssuming the reports that the people were beaten, stabbed, and suffered various other injuries, they absolutely are owed some justice, but going after Bumble Bee Foods in this specific instance seems like an effort to go after the deeper pockets. Now, if they have evidence Bumble Bee knew about these practices and didn't cut ties with the company, then that would definitely change things. Of course the Foreign Corrupt Practices Act doesn't really make a distinction between whether you knew someone you were doing business with was doing something illegal. \n\nI just hope the people who did the actual beating and stabbing were subjected to the full extent of the law.",
                "I will always stand by labor in their struggle against industry. ",
                "That’s why we at Schooner Tuna are reducing the price of our tuna by 50 cents a can.",
                "As god as my witness, I saw the headline and immediately thought of Bee Movie."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "HOT",
            "title": "US launches wave of air strikes on Yemen's Houthis",
            "external_url": "https://www.bbc.com/news/articles/c05mvr3j3yro",
            "upvotes": 576,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e143/live/2f8cd9f0-024e-11f0-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "It appears as though we may be about to strike [Iranian targets](https://bsky.app/profile/maks23.bsky.social/post/3lkj5kqsji22t) in Yemen too.",
                "I can't believe how many Republicans (and similar) kept saying that Trump would end US foreign involvement. How they came to that belief was really beyond me.",
                "How about a wave of strikes on Putins goblins?",
                "And he’s talking about military action to take the Panama Canal. WTF?!",
                "Gee.. nobody has ever tried bombing Yemen before.",
                "He wants a war so he claim even more powers.",
                "So the attack on ships will continue",
                "As a liberal I am so, utterly and devastatingly owned by Trump blowing up this genocidal pirate death cult.",
                "Somebody please give this man a Nobel peace prize already /s",
                "Y'all are mental I'll if you support the Houthis."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Judge blocks Trump from using 18th-century wartime act for deportations",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/15/trump-alien-enemies-act-deportations",
            "upvotes": 21198,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/73483f3a79cba03193f7a0a334cd26d1f4a35747/0_6_6500_3900/master/6500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=94edb165e99f97e6bdc1a4868b50cbed",
            "top_comments": [
                "Thank goodness the court still have some sway against president pushing the limit of executive action.",
                "Hope the judiciary holds  against this power grab",
                "Like he’ll listen. This country has emboldened the biggest anus on the planet to realize he really only hast to listen to himself.",
                "I'm 51, and I simply can't comprehend having that amount of anger at near 80.\n\nOnce you get to an age like mine, you really do start to understand that reacting and being spiteful is pointless. The world will carry on without you doing that just fine, better in fact.",
                "Trump is literally too stupid to know about that, so someone else has to be feeding him these insane instructions.",
                "I bet Stephen Miller is behind all this. There is no way this orange buffoon would know about an 18th-century wartime act if no one told him about it. He also probably thinks Venezuela is a type of cheese put on pizza.",
                "Surely he won't just do it anyway.",
                "Imagine being a born and raised “American” and you voted to destroy the country.\n\nReal Patriots used to call that Treason.",
                "The courts have been outstanding in the last few weeks",
                "They deported them anyway."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Olympic boxing gender row a result of Russian fake news, says IOC chief | Olympic Games",
            "external_url": "https://www.theguardian.com/sport/2025/mar/15/olympic-boxing-transgender-russian-fake-news-thomas-bach",
            "upvotes": 2026,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a05e39a7d9ec3658b41efd8c7282d6b7a47d1c68/597_749_6956_4173/master/6956.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=6d374ca1c5ed9ea414f8bc2d47eb893a",
            "top_comments": [
                "yea, no shit. Russia and the IBA are intertwined and the IBA is still pissed they lost control over the Olympics. Of course they were gonna start shit. And now that World Boxing is taking over, we can expect Russia and the IBA to start fake news crap with them too.\n\nThe Imane Khelif thing was especially bullshit when women who had fought her (Amy Broadhurst, Kellie Harrington) not only defeated her in matches but also supported her and said she didn't fight any differently from any other woman. But nobody listened to them or cared to watch those matches that showed it was just a regular female boxer fighting just like every other female boxer.",
                "Cool. So is Piers Morgan going to retract all previous accusations that he spent months hammering his panelists about? Or should Imane just sue him for half his net worth in a defamation suit?",
                "Literally everyone pointed this out when it was happening",
                "Yea, no shit, and the dumb motherfuckers bought it yet again.",
                "The hysteria surrounding transgender people in sports is so ridiculous. A bunch of gray haired politicians are bitching about rights and fairness for athletes and the purity of the sport! \n\nIt’s weird how the athletes aren’t up in arms about this. Almost like it’s not a real problem.",
                "Of course it was and came out of Russia.\n\n\nRussia has been playing the American public on both thr right and left since Trump came on scene. \n\n\nBut republicans politicians are perfectly fine with using that Russian propaganda to fuck I've America as long as they get power. ",
                "It may have started from russia but let's not shove under a rug the deplorable contributions of right wing pundits from the west like JK Rowling or american media, they are just as guilty for peddling this.",
                "You mean JK Rowling and other TERFs were wrong ***yet again***!? Such a surprise!",
                "No shit. The IOC never entertained any of this anyway.",
                "Yeah and idiots like Trump and Rowling fell for it or continued to spread this news. Trump we get, he is an asset. People like Rowling and Joe Rogan have personal issues on it and them go crazy when someone pushes it in the news."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Nightclub fire in North Macedonia leaves 51 dead, over 100 injured",
            "external_url": "https://www.reuters.com/world/europe/fire-north-macedonia-night-club-leaves-several-dead-media-reports-say-2025-03-16/",
            "upvotes": 1421,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From another article.\n\n>Interior Minister Pance Toskovski said initial reports suggested the fire started from sparks caused by pyrotechnic devices.\nSpeaking outside the Kocani police station, he said the sparks had hit the ceiling, which was made of highly flammable material.\n\nYeah that's a frightening lapse in safety, and it's sad so many people died because of it.",
                "We had something similar in Romania a few years ago. The whole thing was also a big signal for deep corruption:  https://en.wikipedia.org/wiki/Colectiv_nightclub_fire The fire started almost identically to what's in this Reuters article. A lot of people died during the crowd crush at the single smallish exit. Many others died after the fire due to injuries (burns) and infections.",
                "It is so eerie how literally the same thing happened 10 years ago in Romania, at club \"Colectiv\". Pyrotechnics, highly inflamabile ceiling, poorly managed exits. 64 people died and 146 were severely injured, countless lives and families ruined. It is the deadliest fire accident in Romanian history and one of our biggest national tragedies.\n\nhttps://en.m.wikipedia.org/wiki/Colectiv_nightclub_fire\n\nHere's a video of the moment the fire starts (warning: disturbing). https://youtu.be/t-Cgw4jj0u8\n\nThe macedonian fire looks like an exact copy of this..",
                "Not only do you have the same safety lapses as The Station, but you're called Pulse. It's like you're asking to have your patrons massacred.",
                "What a fucking mess. Rip to the victims.",
                "Based on the comments, there have been at least four deadly fires in nightclubs (before this one) that were because of indoor pyrotechnics:\n\nThe Station nightclub fire in West Warwick, Rhode Island, USA on February 20, 2003. Deaths: 100.\n\nThe Lame Horse nightclub fire in Perm, Russia, on December 5, 2009. Deaths: 156.\n\nThe Kiss nightclub fire in Rio Grande do Sul, Brazil, on January 27, 2013. Deaths: 242.\n\nThe Colectiv nightclub fire in Bucharest, Romania, on October 30, 2015. Deaths: 64.\n\nI can’t believe by now there hasn’t been a ban on using pyrotechnics inside nightclubs or other indoor concert venues. Shouldn’t every country pass legislation to prevent this? At the very least, owners of the clubs should forbid them from being used. There’s no reason for this to keep happening.",
                "The fact that people [appear to be just standing around](https://x.com/KalendarNews/status/1901168339705123143) as the place burns in it's early stages probably didn't help.",
                "My friend growing up Matt Pickett died in The Station fire. Video he shot is still lurking out on the internet (don't watch it)\n\nHe had just gotten married and had a little kid\n\nMatty just loved music. Always did, since he was 10\n\nfuck :' (",
                "Same thing happened at The Station nightclub in Rhode Island at a Great White show in 2003.  100 people died.",
                "That really reminds me of the Station Nightclub fire..."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Peru: Fisherman rescued after 95 days adrift, surviving on turtles - BBC News",
            "external_url": "https://www.bbc.com/news/articles/cj92438d3xmo.amp",
            "upvotes": 301,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c60d/live/734788b0-0281-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "I wonder what percentage of these people rescued at sea just say fuck it and never get on a boat again...",
                "I think I read this book",
                "Wait, were they EATING them, or just, ya know, surviving ON (top of) them?",
                "Cockroaches, birds and turtles.  I wonder if he was able to cook this stuff on his boat?  As a fisherman I wonder why he didn’t just catch and eat fish.",
                "Think I'd just sit there and call it a day on my life rather than eat a turtle",
                "Pretty much  fat left on his body..",
                "I prefer to hear this fantastic story over hearing the real one."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "HOT",
            "title": "Fredericksburg Fire Today: Massive Blaze Engulfs Thousands of Acres",
            "external_url": "https://luxlira.com/world-news/fredericksburg-fire-today-massive-blaze-engulfs-thousands-of-acres/",
            "upvotes": 436,
            "date": "03/16/2025",
            "thumbnail": "https://luxlira.com/wp-content/uploads/2025/03/Fredericksburg-Fire-Today.png",
            "top_comments": [
                "Why would Greg Abbott do this",
                "Did they forget to rake the forest?",
                "Fredericksburg, Texas\n\n “A large grass fire, which started yesterday near Fredericksburg, Texas, continues to burn today, having already spread to over 8,600 acres. The Fredericksburg fire today, known as the Crabapple Fire, has led to the evacuation of dozens of homes and the closure of key roads as firefighters from across the region work tirelessly to gain control of the situation. This article provides the latest updates on the ongoing blaze.”",
                "Just turn on the ocean, problem solved",
                "Have trump open your faucet, ya dummies.",
                "No Canadian bucket planes or Mexican firefighters for you.",
                "What if we drop a nuke on the fire?",
                "Gonna burn those measles out of existence",
                "God’s punishment. Am I doing this right?",
                "Glad FEMA will be able to come help them…. Oh wait"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Finland turns down US request for eggs",
            "external_url": "https://yle.fi/a/74-20149786",
            "upvotes": 1185,
            "date": "03/16/2025",
            "thumbnail": "https://images.cdn.yle.fi/image/upload/c_crop,x_0,y_0,w_1597,h_901/w_1200,ar_1.91,c_fill/q_auto:eco,f_auto,fl_lossy/v1723193249/39-133049966b5d6a6d2abd",
            "top_comments": [
                "So let me get this straight....\n\nYou expect to get something you need from someone you've pissed off?",
                "”US authorities have turned to Europe for help with the country's severe egg shortage. The shortfall is due to bird flu, which has plagued the United States for several years.\n\nThe Finnish Poultry Association says it has been contacted about exporting eggs to the US. The organisation's executive director, Veera Lehtilä, told Yle on Saturday that exporting eggs does not seem to be possible at the moment because no market access negotiations have been held with US authorities. This can be a drawn-out process involving extensive inspections and studies.”",
                "Maybe JD didn’t say please",
                "There is little to no goodwill left for the US in Europe. No eggs for you. \n\n\nThe US spent 80 years building up their role as a big brother to the western world, recognized as the leader of the free world.\n\n\nIt took Trump 3 weeks to destroy its reputation, and it will probably take several generations to make it \"great again\" ",
                "Any dealings in that magnitude has to be done through an EU negotiated trade agreement. \nAnd considering that the US has just started a trade war with the EU and threatens to invade EU territory.. that's gonna be a no from us dawg.",
                "You don’t have the cards",
                "Coming soon: *\"Nasty people in Finland, maybe we're looking at it becoming a US state...\"*",
                "The entire Republican Party is full of chickens. \n\nEggs should be no problem. ",
                "Finland: go suck eggs, oh wait you don't have enough for that. Lol, I'm kind of glad other countries are telling us to piss off because we're acting like bullies.",
                "Good. No free county should help the US while it’s under the grip of fascism."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Peru: Fisherman rescued after 95 days adrift, surviving on turtles - BBC News",
            "external_url": "https://www.bbc.com/news/articles/cj92438d3xmo.amp",
            "upvotes": 299,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c60d/live/734788b0-0281-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "I wonder what percentage of these people rescued at sea just say fuck it and never get on a boat again...",
                "I think I read this book",
                "Wait, were they EATING them, or just, ya know, surviving ON (top of) them?",
                "Cockroaches, birds and turtles.  I wonder if he was able to cook this stuff on his boat?  As a fisherman I wonder why he didn’t just catch and eat fish.",
                "Think I'd just sit there and call it a day on my life rather than eat a turtle",
                "Pretty much  fat left on his body..",
                "I prefer to hear this fantastic story over hearing the real one."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US launches wave of air strikes on Yemen's Houthis",
            "external_url": "https://www.bbc.com/news/articles/c05mvr3j3yro",
            "upvotes": 580,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e143/live/2f8cd9f0-024e-11f0-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "It appears as though we may be about to strike [Iranian targets](https://bsky.app/profile/maks23.bsky.social/post/3lkj5kqsji22t) in Yemen too.",
                "I can't believe how many Republicans (and similar) kept saying that Trump would end US foreign involvement. How they came to that belief was really beyond me.",
                "How about a wave of strikes on Putins goblins?",
                "And he’s talking about military action to take the Panama Canal. WTF?!",
                "Gee.. nobody has ever tried bombing Yemen before.",
                "He wants a war so he claim even more powers.",
                "So the attack on ships will continue",
                "As a liberal I am so, utterly and devastatingly owned by Trump blowing up this genocidal pirate death cult.",
                "Somebody please give this man a Nobel peace prize already /s",
                "Y'all are mental I'll if you support the Houthis."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Fishermen sue San Diego’s Bumble Bee Foods for forced labor, abuse",
            "external_url": "https://www.nbcsandiego.com/news/local/fishermen-sue-san-diegos-bumble-bee-foods-for-forced-labor-abuse/3779868/",
            "upvotes": 713,
            "date": "03/16/2025",
            "thumbnail": "https://media.nbcsandiego.com/2019/09/Bumble-Bee-Tuna-AP_643616039433.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "So, to save some people a click... Bumble Bee Foods itself isn't the one that is accused of wrongdoing, but one of the companies in its supply chain. Specifically some boat captain around Indonesia. \n\nAssuming the reports that the people were beaten, stabbed, and suffered various other injuries, they absolutely are owed some justice, but going after Bumble Bee Foods in this specific instance seems like an effort to go after the deeper pockets. Now, if they have evidence Bumble Bee knew about these practices and didn't cut ties with the company, then that would definitely change things. Of course the Foreign Corrupt Practices Act doesn't really make a distinction between whether you knew someone you were doing business with was doing something illegal. \n\nI just hope the people who did the actual beating and stabbing were subjected to the full extent of the law.",
                "I will always stand by labor in their struggle against industry. ",
                "That’s why we at Schooner Tuna are reducing the price of our tuna by 50 cents a can.",
                "As god as my witness, I saw the headline and immediately thought of Bee Movie."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "NEW",
            "title": "US deports hundreds of Venezuelans despite court order",
            "external_url": "https://www.bbc.co.uk/news/articles/cp9yv1gnzyvo",
            "upvotes": 20436,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3465/live/53f1c740-0287-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "How? I thought by avoiding shutdown the courts would still be functioning and they would stop Trump in his tracks. Schumer said so.\n\nHow can he just ignore the court orders, that's not following the rules. I guess no one could have anticipated that.",
                "We didn’t deport them to Venezuela though. We paid El Salvador to imprison them in some sort of work camp super max prison site situation\n\n[bet the range of people and dissidents exported here grows](https://x.com/nayibbukele/status/1901245427216978290?s=46)",
                "Fine, we can't arrest the president for giving illegal order? Arrest the people that carry them out.",
                "Time to start holding people in prison for contempt. When there are worse repercussions to the lawyers and administrators defying court orders than possibly losing their jobs, they'll stop defying them. Checks and balances, the executive can't be free to ignore the judiciary.",
                "Our government ultimately relies on the assumption that the POTUS will fulfill his Constitutional obligations. We do not have that now. We have a criminal.",
                "Ladies and gentlemen: the \"Party of Law and Order\", once more fully displaying that they do not, in fact, give a shit about laws.",
                "Wouldn’t the Alien Enemies Act of 1798 require the US to be at war for this to be legal deportations? Does this mean then that Congress gave a declaration of war to both Mexico and Venezuela which is what the constitution requires or is Trump violating the U.S. constitution that he swore to uphold?",
                "Looks like we got a good ol' fashioned constitutional crisis on our hands. Grab the pitchforks.",
                "I think we are burying the lede\n\n>Bukele wrote that the detainees were immediately transferred to El Salvador’s Terrorism Confinement Center (Cecot) “for a period of one year”, something that was “renewable” - suggesting they could be held there for longer.\n>“The United States will pay a very low fee for them, but a high one for us,” he added.\n\nWe are paying (a lot it sounds like) for other countries to run our internment camps",
                "When the President says he and his office don't have to follow the law and that his followers who commit crimes can walk free without consequences and pledges to use the DOJ against his political enemies, we have a full blown Constitutional crisis and are at risk of losing our democracy completely."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Fredericksburg Fire Today: Massive Blaze Engulfs Thousands of Acres",
            "external_url": "https://luxlira.com/world-news/fredericksburg-fire-today-massive-blaze-engulfs-thousands-of-acres/",
            "upvotes": 441,
            "date": "03/16/2025",
            "thumbnail": "https://luxlira.com/wp-content/uploads/2025/03/Fredericksburg-Fire-Today.png",
            "top_comments": [
                "Why would Greg Abbott do this",
                "Did they forget to rake the forest?",
                "Fredericksburg, Texas\n\n “A large grass fire, which started yesterday near Fredericksburg, Texas, continues to burn today, having already spread to over 8,600 acres. The Fredericksburg fire today, known as the Crabapple Fire, has led to the evacuation of dozens of homes and the closure of key roads as firefighters from across the region work tirelessly to gain control of the situation. This article provides the latest updates on the ongoing blaze.”",
                "Just turn on the ocean, problem solved",
                "Have trump open your faucet, ya dummies.",
                "No Canadian bucket planes or Mexican firefighters for you.",
                "What if we drop a nuke on the fire?",
                "Gonna burn those measles out of existence",
                "God’s punishment. Am I doing this right?",
                "Glad FEMA will be able to come help them…. Oh wait"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Ordnance from Syria's 13-year conflict explodes in port city, killing at least 16 people",
            "external_url": "https://apnews.com/article/syria-lattakia-ordnance-explosion-mines-white-helmets-84bdc4b9d11ea38d662829cf3259eb39",
            "upvotes": 277,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Unfortunately this is going to continue for a long time. Germany still finds unexploded bombs from WW2.",
                "Why were they storing bombs on the ground floor of a 4 story building?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Nightclub fire in North Macedonia leaves 51 dead, over 100 injured",
            "external_url": "https://www.reuters.com/world/europe/fire-north-macedonia-night-club-leaves-several-dead-media-reports-say-2025-03-16/",
            "upvotes": 1419,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From another article.\n\n>Interior Minister Pance Toskovski said initial reports suggested the fire started from sparks caused by pyrotechnic devices.\nSpeaking outside the Kocani police station, he said the sparks had hit the ceiling, which was made of highly flammable material.\n\nYeah that's a frightening lapse in safety, and it's sad so many people died because of it.",
                "We had something similar in Romania a few years ago. The whole thing was also a big signal for deep corruption:  https://en.wikipedia.org/wiki/Colectiv_nightclub_fire The fire started almost identically to what's in this Reuters article. A lot of people died during the crowd crush at the single smallish exit. Many others died after the fire due to injuries (burns) and infections.",
                "It is so eerie how literally the same thing happened 10 years ago in Romania, at club \"Colectiv\". Pyrotechnics, highly inflamabile ceiling, poorly managed exits. 64 people died and 146 were severely injured, countless lives and families ruined. It is the deadliest fire accident in Romanian history and one of our biggest national tragedies.\n\nhttps://en.m.wikipedia.org/wiki/Colectiv_nightclub_fire\n\nHere's a video of the moment the fire starts (warning: disturbing). https://youtu.be/t-Cgw4jj0u8\n\nThe macedonian fire looks like an exact copy of this..",
                "Not only do you have the same safety lapses as The Station, but you're called Pulse. It's like you're asking to have your patrons massacred.",
                "What a fucking mess. Rip to the victims.",
                "Based on the comments, there have been at least four deadly fires in nightclubs (before this one) that were because of indoor pyrotechnics:\n\nThe Station nightclub fire in West Warwick, Rhode Island, USA on February 20, 2003. Deaths: 100.\n\nThe Lame Horse nightclub fire in Perm, Russia, on December 5, 2009. Deaths: 156.\n\nThe Kiss nightclub fire in Rio Grande do Sul, Brazil, on January 27, 2013. Deaths: 242.\n\nThe Colectiv nightclub fire in Bucharest, Romania, on October 30, 2015. Deaths: 64.\n\nI can’t believe by now there hasn’t been a ban on using pyrotechnics inside nightclubs or other indoor concert venues. Shouldn’t every country pass legislation to prevent this? At the very least, owners of the clubs should forbid them from being used. There’s no reason for this to keep happening.",
                "The fact that people [appear to be just standing around](https://x.com/KalendarNews/status/1901168339705123143) as the place burns in it's early stages probably didn't help.",
                "My friend growing up Matt Pickett died in The Station fire. Video he shot is still lurking out on the internet (don't watch it)\n\nHe had just gotten married and had a little kid\n\nMatty just loved music. Always did, since he was 10\n\nfuck :' (",
                "Same thing happened at The Station nightclub in Rhode Island at a Great White show in 2003.  100 people died.",
                "That really reminds me of the Station Nightclub fire..."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Olympic boxing gender row a result of Russian fake news, says IOC chief | Olympic Games",
            "external_url": "https://www.theguardian.com/sport/2025/mar/15/olympic-boxing-transgender-russian-fake-news-thomas-bach",
            "upvotes": 2024,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a05e39a7d9ec3658b41efd8c7282d6b7a47d1c68/597_749_6956_4173/master/6956.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=6d374ca1c5ed9ea414f8bc2d47eb893a",
            "top_comments": [
                "yea, no shit. Russia and the IBA are intertwined and the IBA is still pissed they lost control over the Olympics. Of course they were gonna start shit. And now that World Boxing is taking over, we can expect Russia and the IBA to start fake news crap with them too.\n\nThe Imane Khelif thing was especially bullshit when women who had fought her (Amy Broadhurst, Kellie Harrington) not only defeated her in matches but also supported her and said she didn't fight any differently from any other woman. But nobody listened to them or cared to watch those matches that showed it was just a regular female boxer fighting just like every other female boxer.",
                "Cool. So is Piers Morgan going to retract all previous accusations that he spent months hammering his panelists about? Or should Imane just sue him for half his net worth in a defamation suit?",
                "Literally everyone pointed this out when it was happening",
                "Yea, no shit, and the dumb motherfuckers bought it yet again.",
                "The hysteria surrounding transgender people in sports is so ridiculous. A bunch of gray haired politicians are bitching about rights and fairness for athletes and the purity of the sport! \n\nIt’s weird how the athletes aren’t up in arms about this. Almost like it’s not a real problem.",
                "Of course it was and came out of Russia.\n\n\nRussia has been playing the American public on both thr right and left since Trump came on scene. \n\n\nBut republicans politicians are perfectly fine with using that Russian propaganda to fuck I've America as long as they get power. ",
                "It may have started from russia but let's not shove under a rug the deplorable contributions of right wing pundits from the west like JK Rowling or american media, they are just as guilty for peddling this.",
                "You mean JK Rowling and other TERFs were wrong ***yet again***!? Such a surprise!",
                "No shit. The IOC never entertained any of this anyway.",
                "Yeah and idiots like Trump and Rowling fell for it or continued to spread this news. Trump we get, he is an asset. People like Rowling and Joe Rogan have personal issues on it and them go crazy when someone pushes it in the news."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "At least 32 Dead as Monster Storm System Sweeps across US South with Multiple Tornadoes",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/15/massive-storm-system-south-tornado-warnings-extreme-weather",
            "upvotes": 5738,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ecb1e814a589538afde609d31570f2f6e89dcc17/0_79_1796_1078/master/1796.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e5aaf03d42cc6335c886d36342ebfe59",
            "top_comments": [
                "NOAA cut. NWS cut. FEMA cut. Tariffs on metals, wood, and other raw materials impact the cost of repairs and rebuilding. Eliminating immigrants from the labor pool so there aren't enough workers to repair and rebuild.\n\nAt least they're owning the libs.",
                "FEMA defunded, government officials cannot travel with $1 credit card limit, and no leadership.",
                "Given the nature of climate change, this is only going to get worse, much worse.",
                "It'll be that non-existent climate change up to its old tricks! I'm sure he'll blame FEMA for it and cut their funding even more.",
                "Thoughts and tariffs <3",
                "[removed]",
                "God is punishing them, amirite trumpers?",
                "A good time to gut NOAA.",
                "Damn DEI and trans people making them storms!\n\n/s",
                "That's very sad and the number may rise after the fact, too. I hope those injured recover and the people impacted are able to repair/rebuild. \n\nAs an aside, Republicans like to go on about the government controlling the weather. Why didn't they just turn off the tornadoes? Weird that the republican-controlled government would do this to their own people, but i doubt you'll hear about this conspiracy theory like we did last hurricane season"
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "RISING",
            "title": "Finland turns down US request for eggs",
            "external_url": "https://yle.fi/a/74-20149786",
            "upvotes": 1188,
            "date": "03/16/2025",
            "thumbnail": "https://images.cdn.yle.fi/image/upload/c_crop,x_0,y_0,w_1597,h_901/w_1200,ar_1.91,c_fill/q_auto:eco,f_auto,fl_lossy/v1723193249/39-133049966b5d6a6d2abd",
            "top_comments": [
                "So let me get this straight....\n\nYou expect to get something you need from someone you've pissed off?",
                "”US authorities have turned to Europe for help with the country's severe egg shortage. The shortfall is due to bird flu, which has plagued the United States for several years.\n\nThe Finnish Poultry Association says it has been contacted about exporting eggs to the US. The organisation's executive director, Veera Lehtilä, told Yle on Saturday that exporting eggs does not seem to be possible at the moment because no market access negotiations have been held with US authorities. This can be a drawn-out process involving extensive inspections and studies.”",
                "Maybe JD didn’t say please",
                "There is little to no goodwill left for the US in Europe. No eggs for you. \n\n\nThe US spent 80 years building up their role as a big brother to the western world, recognized as the leader of the free world.\n\n\nIt took Trump 3 weeks to destroy its reputation, and it will probably take several generations to make it \"great again\" ",
                "Any dealings in that magnitude has to be done through an EU negotiated trade agreement. \nAnd considering that the US has just started a trade war with the EU and threatens to invade EU territory.. that's gonna be a no from us dawg.",
                "You don’t have the cards",
                "Coming soon: *\"Nasty people in Finland, maybe we're looking at it becoming a US state...\"*",
                "The entire Republican Party is full of chickens. \n\nEggs should be no problem. ",
                "Finland: go suck eggs, oh wait you don't have enough for that. Lol, I'm kind of glad other countries are telling us to piss off because we're acting like bullies.",
                "Good. No free county should help the US while it’s under the grip of fascism."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Fishermen sue San Diego’s Bumble Bee Foods for forced labor, abuse",
            "external_url": "https://www.nbcsandiego.com/news/local/fishermen-sue-san-diegos-bumble-bee-foods-for-forced-labor-abuse/3779868/",
            "upvotes": 714,
            "date": "03/16/2025",
            "thumbnail": "https://media.nbcsandiego.com/2019/09/Bumble-Bee-Tuna-AP_643616039433.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                "So, to save some people a click... Bumble Bee Foods itself isn't the one that is accused of wrongdoing, but one of the companies in its supply chain. Specifically some boat captain around Indonesia. \n\nAssuming the reports that the people were beaten, stabbed, and suffered various other injuries, they absolutely are owed some justice, but going after Bumble Bee Foods in this specific instance seems like an effort to go after the deeper pockets. Now, if they have evidence Bumble Bee knew about these practices and didn't cut ties with the company, then that would definitely change things. Of course the Foreign Corrupt Practices Act doesn't really make a distinction between whether you knew someone you were doing business with was doing something illegal. \n\nI just hope the people who did the actual beating and stabbing were subjected to the full extent of the law.",
                "I will always stand by labor in their struggle against industry. ",
                "That’s why we at Schooner Tuna are reducing the price of our tuna by 50 cents a can.",
                "As god as my witness, I saw the headline and immediately thought of Bee Movie."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "RISING",
            "title": "Peru: Fisherman rescued after 95 days adrift, surviving on turtles - BBC News",
            "external_url": "https://www.bbc.com/news/articles/cj92438d3xmo.amp",
            "upvotes": 299,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c60d/live/734788b0-0281-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "I wonder what percentage of these people rescued at sea just say fuck it and never get on a boat again...",
                "I think I read this book",
                "Wait, were they EATING them, or just, ya know, surviving ON (top of) them?",
                "Cockroaches, birds and turtles.  I wonder if he was able to cook this stuff on his boat?  As a fisherman I wonder why he didn’t just catch and eat fish.",
                "Think I'd just sit there and call it a day on my life rather than eat a turtle",
                "Pretty much  fat left on his body..",
                "I prefer to hear this fantastic story over hearing the real one."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "US deports hundreds of Venezuelans despite court order",
            "external_url": "https://www.bbc.co.uk/news/articles/cp9yv1gnzyvo",
            "upvotes": 20426,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3465/live/53f1c740-0287-11f0-b50e-9d086302645f.jpg",
            "top_comments": [
                "How? I thought by avoiding shutdown the courts would still be functioning and they would stop Trump in his tracks. Schumer said so.\n\nHow can he just ignore the court orders, that's not following the rules. I guess no one could have anticipated that.",
                "We didn’t deport them to Venezuela though. We paid El Salvador to imprison them in some sort of work camp super max prison site situation\n\n[bet the range of people and dissidents exported here grows](https://x.com/nayibbukele/status/1901245427216978290?s=46)",
                "Fine, we can't arrest the president for giving illegal order? Arrest the people that carry them out.",
                "Time to start holding people in prison for contempt. When there are worse repercussions to the lawyers and administrators defying court orders than possibly losing their jobs, they'll stop defying them. Checks and balances, the executive can't be free to ignore the judiciary.",
                "Our government ultimately relies on the assumption that the POTUS will fulfill his Constitutional obligations. We do not have that now. We have a criminal.",
                "Ladies and gentlemen: the \"Party of Law and Order\", once more fully displaying that they do not, in fact, give a shit about laws.",
                "Wouldn’t the Alien Enemies Act of 1798 require the US to be at war for this to be legal deportations? Does this mean then that Congress gave a declaration of war to both Mexico and Venezuela which is what the constitution requires or is Trump violating the U.S. constitution that he swore to uphold?",
                "Looks like we got a good ol' fashioned constitutional crisis on our hands. Grab the pitchforks.",
                "I think we are burying the lede\n\n>Bukele wrote that the detainees were immediately transferred to El Salvador’s Terrorism Confinement Center (Cecot) “for a period of one year”, something that was “renewable” - suggesting they could be held there for longer.\n>“The United States will pay a very low fee for them, but a high one for us,” he added.\n\nWe are paying (a lot it sounds like) for other countries to run our internment camps",
                "When the President says he and his office don't have to follow the law and that his followers who commit crimes can walk free without consequences and pledges to use the DOJ against his political enemies, we have a full blown Constitutional crisis and are at risk of losing our democracy completely."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "US launches wave of air strikes on Yemen's Houthis",
            "external_url": "https://www.bbc.com/news/articles/c05mvr3j3yro",
            "upvotes": 575,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/e143/live/2f8cd9f0-024e-11f0-8c3d-b7dcc7510cb1.jpg",
            "top_comments": [
                "It appears as though we may be about to strike [Iranian targets](https://bsky.app/profile/maks23.bsky.social/post/3lkj5kqsji22t) in Yemen too.",
                "I can't believe how many Republicans (and similar) kept saying that Trump would end US foreign involvement. How they came to that belief was really beyond me.",
                "How about a wave of strikes on Putins goblins?",
                "And he’s talking about military action to take the Panama Canal. WTF?!",
                "Gee.. nobody has ever tried bombing Yemen before.",
                "He wants a war so he claim even more powers.",
                "So the attack on ships will continue",
                "As a liberal I am so, utterly and devastatingly owned by Trump blowing up this genocidal pirate death cult.",
                "Somebody please give this man a Nobel peace prize already /s",
                "Y'all are mental I'll if you support the Houthis."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Ordnance from Syria's 13-year conflict explodes in port city, killing at least 16 people",
            "external_url": "https://apnews.com/article/syria-lattakia-ordnance-explosion-mines-white-helmets-84bdc4b9d11ea38d662829cf3259eb39",
            "upvotes": 279,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Unfortunately this is going to continue for a long time. Germany still finds unexploded bombs from WW2.",
                "Why were they storing bombs on the ground floor of a 4 story building?"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Olympic boxing gender row a result of Russian fake news, says IOC chief | Olympic Games",
            "external_url": "https://www.theguardian.com/sport/2025/mar/15/olympic-boxing-transgender-russian-fake-news-thomas-bach",
            "upvotes": 2025,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a05e39a7d9ec3658b41efd8c7282d6b7a47d1c68/597_749_6956_4173/master/6956.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=6d374ca1c5ed9ea414f8bc2d47eb893a",
            "top_comments": [
                "yea, no shit. Russia and the IBA are intertwined and the IBA is still pissed they lost control over the Olympics. Of course they were gonna start shit. And now that World Boxing is taking over, we can expect Russia and the IBA to start fake news crap with them too.\n\nThe Imane Khelif thing was especially bullshit when women who had fought her (Amy Broadhurst, Kellie Harrington) not only defeated her in matches but also supported her and said she didn't fight any differently from any other woman. But nobody listened to them or cared to watch those matches that showed it was just a regular female boxer fighting just like every other female boxer.",
                "Cool. So is Piers Morgan going to retract all previous accusations that he spent months hammering his panelists about? Or should Imane just sue him for half his net worth in a defamation suit?",
                "Literally everyone pointed this out when it was happening",
                "Yea, no shit, and the dumb motherfuckers bought it yet again.",
                "The hysteria surrounding transgender people in sports is so ridiculous. A bunch of gray haired politicians are bitching about rights and fairness for athletes and the purity of the sport! \n\nIt’s weird how the athletes aren’t up in arms about this. Almost like it’s not a real problem.",
                "Of course it was and came out of Russia.\n\n\nRussia has been playing the American public on both thr right and left since Trump came on scene. \n\n\nBut republicans politicians are perfectly fine with using that Russian propaganda to fuck I've America as long as they get power. ",
                "It may have started from russia but let's not shove under a rug the deplorable contributions of right wing pundits from the west like JK Rowling or american media, they are just as guilty for peddling this.",
                "You mean JK Rowling and other TERFs were wrong ***yet again***!? Such a surprise!",
                "No shit. The IOC never entertained any of this anyway.",
                "Yeah and idiots like Trump and Rowling fell for it or continued to spread this news. Trump we get, he is an asset. People like Rowling and Joe Rogan have personal issues on it and them go crazy when someone pushes it in the news."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Nightclub fire in North Macedonia leaves 51 dead, over 100 injured",
            "external_url": "https://www.reuters.com/world/europe/fire-north-macedonia-night-club-leaves-several-dead-media-reports-say-2025-03-16/",
            "upvotes": 1420,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From another article.\n\n>Interior Minister Pance Toskovski said initial reports suggested the fire started from sparks caused by pyrotechnic devices.\nSpeaking outside the Kocani police station, he said the sparks had hit the ceiling, which was made of highly flammable material.\n\nYeah that's a frightening lapse in safety, and it's sad so many people died because of it.",
                "We had something similar in Romania a few years ago. The whole thing was also a big signal for deep corruption:  https://en.wikipedia.org/wiki/Colectiv_nightclub_fire The fire started almost identically to what's in this Reuters article. A lot of people died during the crowd crush at the single smallish exit. Many others died after the fire due to injuries (burns) and infections.",
                "It is so eerie how literally the same thing happened 10 years ago in Romania, at club \"Colectiv\". Pyrotechnics, highly inflamabile ceiling, poorly managed exits. 64 people died and 146 were severely injured, countless lives and families ruined. It is the deadliest fire accident in Romanian history and one of our biggest national tragedies.\n\nhttps://en.m.wikipedia.org/wiki/Colectiv_nightclub_fire\n\nHere's a video of the moment the fire starts (warning: disturbing). https://youtu.be/t-Cgw4jj0u8\n\nThe macedonian fire looks like an exact copy of this..",
                "Not only do you have the same safety lapses as The Station, but you're called Pulse. It's like you're asking to have your patrons massacred.",
                "What a fucking mess. Rip to the victims.",
                "Based on the comments, there have been at least four deadly fires in nightclubs (before this one) that were because of indoor pyrotechnics:\n\nThe Station nightclub fire in West Warwick, Rhode Island, USA on February 20, 2003. Deaths: 100.\n\nThe Lame Horse nightclub fire in Perm, Russia, on December 5, 2009. Deaths: 156.\n\nThe Kiss nightclub fire in Rio Grande do Sul, Brazil, on January 27, 2013. Deaths: 242.\n\nThe Colectiv nightclub fire in Bucharest, Romania, on October 30, 2015. Deaths: 64.\n\nI can’t believe by now there hasn’t been a ban on using pyrotechnics inside nightclubs or other indoor concert venues. Shouldn’t every country pass legislation to prevent this? At the very least, owners of the clubs should forbid them from being used. There’s no reason for this to keep happening.",
                "The fact that people [appear to be just standing around](https://x.com/KalendarNews/status/1901168339705123143) as the place burns in it's early stages probably didn't help.",
                "My friend growing up Matt Pickett died in The Station fire. Video he shot is still lurking out on the internet (don't watch it)\n\nHe had just gotten married and had a little kid\n\nMatty just loved music. Always did, since he was 10\n\nfuck :' (",
                "Same thing happened at The Station nightclub in Rhode Island at a Great White show in 2003.  100 people died.",
                "That really reminds me of the Station Nightclub fire..."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "Fredericksburg Fire Today: Massive Blaze Engulfs Thousands of Acres",
            "external_url": "https://luxlira.com/world-news/fredericksburg-fire-today-massive-blaze-engulfs-thousands-of-acres/",
            "upvotes": 441,
            "date": "03/16/2025",
            "thumbnail": "https://luxlira.com/wp-content/uploads/2025/03/Fredericksburg-Fire-Today.png",
            "top_comments": [
                "Why would Greg Abbott do this",
                "Did they forget to rake the forest?",
                "Fredericksburg, Texas\n\n “A large grass fire, which started yesterday near Fredericksburg, Texas, continues to burn today, having already spread to over 8,600 acres. The Fredericksburg fire today, known as the Crabapple Fire, has led to the evacuation of dozens of homes and the closure of key roads as firefighters from across the region work tirelessly to gain control of the situation. This article provides the latest updates on the ongoing blaze.”",
                "Just turn on the ocean, problem solved",
                "Have trump open your faucet, ya dummies.",
                "No Canadian bucket planes or Mexican firefighters for you.",
                "What if we drop a nuke on the fire?",
                "Gonna burn those measles out of existence",
                "God’s punishment. Am I doing this right?",
                "Glad FEMA will be able to come help them…. Oh wait"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "At least 32 Dead as Monster Storm System Sweeps across US South with Multiple Tornadoes",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/15/massive-storm-system-south-tornado-warnings-extreme-weather",
            "upvotes": 5741,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ecb1e814a589538afde609d31570f2f6e89dcc17/0_79_1796_1078/master/1796.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e5aaf03d42cc6335c886d36342ebfe59",
            "top_comments": [
                "NOAA cut. NWS cut. FEMA cut. Tariffs on metals, wood, and other raw materials impact the cost of repairs and rebuilding. Eliminating immigrants from the labor pool so there aren't enough workers to repair and rebuild.\n\nAt least they're owning the libs.",
                "FEMA defunded, government officials cannot travel with $1 credit card limit, and no leadership.",
                "Given the nature of climate change, this is only going to get worse, much worse.",
                "It'll be that non-existent climate change up to its old tricks! I'm sure he'll blame FEMA for it and cut their funding even more.",
                "Thoughts and tariffs <3",
                "[removed]",
                "God is punishing them, amirite trumpers?",
                "A good time to gut NOAA.",
                "Damn DEI and trans people making them storms!\n\n/s",
                "That's very sad and the number may rise after the fact, too. I hope those injured recover and the people impacted are able to repair/rebuild. \n\nAs an aside, Republicans like to go on about the government controlling the weather. Why didn't they just turn off the tornadoes? Weird that the republican-controlled government would do this to their own people, but i doubt you'll hear about this conspiracy theory like we did last hurricane season"
            ],
            "aggregate_sentiment": 0.0
        }
    ],
    "last_updated": "03/16/2025 20:07:52 UTC"
}