{
    "posts": [
        {
            "category": "HOT",
            "title": "White House Correspondents’ Association cancels plans to have a comedian headline annual dinner",
            "external_url": "https://www.cnn.com/2025/03/29/media/white-house-correspondents-association-dinner-comedian/index.html",
            "upvotes": 15763,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/220430231320-23-white-house-correspondents-dinner.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Instead, the association says it will celebrate the First Amendment and the free press.\n\nAlso irony.",
                "I always find it hilarious the man who bullies everyone under the guise of a joke can’t take one himself. I’m sure it’s a narcissist thing.",
                ">\"At this consequential moment for journalism, I want to ensure the focus is not on the politics of division but entirely on awarding our colleagues for their outstanding work and providing scholarship and mentorship to the next generation of journalists\"\n\nSit, lie down, play dead. Good doggy.",
                "They're too chicken to have a real comedian, and comedians on their side of the aisle are probably gonna say a lot of really racist shit.",
                "lol any comedian worth their salt would have absolutely brutally buried this administration with joke after joke. I can’t blame them for canceling. The roast would have been REAL!",
                "Cancel this fucking dinner. No respectable journalist should show up to rub elbows with this authoritarian administration.",
                "She told hosts comedian Samantha Bee and Beast Chief Content Officer Joanna Coles that the Trump administration are “kind of a bunch of murderers,” adding that playing to both sides “makes them feel like human beings, but they shouldn’t get to feel that way, ‘cause they’re not.”\n\nHA",
                "Softer than baby shit.",
                "Get Bill Burr you cowards",
                "Elon: “the left killed comedy”\nThe right: “no comedy this year.”"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Protests hit Tesla dealerships across the world in challenge to Elon Musk",
            "external_url": "https://www.theguardian.com/world/2025/mar/29/tesla-protests-elon-musk-doge",
            "upvotes": 6259,
            "date": "03/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/35ea73a65fc7a315f860de5cf6c1a41aaeb375a1/0_120_1600_961/master/1600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f512a33f02abb7923975fb836120a1f9",
            "top_comments": [
                "Just a friendly reminder that he views these protests as a form of economic warfare and would prosecute everyone there if he could. He absolutely hates this stuff. Look at how emotional he got when someone made fun of the stock prices, he called him evil lol.\n\nKeep it up everybody.",
                "That's ok...seems like Nikola may be making a comeback. /s\n\nThis shit is getting obscene...listen to Trump explain his Pardon...\n\n\" I think...\"\n\n\" I think he was exonerated\"\n\n\" I don't know but I got lotsa references \"",
                "*On Saturday, with more than 200 events planned worldwide, protests kicked off midday in front of Tesla showrooms in Australia and New Zealand and then rippled across Europe in countries including Finland, Norway, Denmark, Germany, France, the Netherlands and the UK. Each rally was locally organized with original themes. In Ireland, it was “Smash the Fash”, and Switzerland had “Down with Doge...”*\n\nAnd, of course, from coast to coast in the US Tesla dealerships were closed down because of all the demonstrations, actions, and angry displays.",
                "Take the stock all the way down. Mediocre products waaaaaaay overvalued .",
                "The smartest thing Tesla can do is remove Elon and any association for the sake of the company.\n\nUnless Elon holds a majority in the company, in that case id ditch the stock now before it goes any lower.",
                "The whole world hates you Elon. You are universally despised.",
                "The world cannot wait for Elon to Occupy Mars.",
                "Just left one in Sunnyvale, CA, which might have the highest concentration of Teslas anywhere in the world. In fact, I would bet on it. Conservatively guessing 700+ protesters and four very lonely pro-Trump counterprotesters.",
                "I am reminded of the generosity of humans all over the world after 911 when they all came together to support us, for they saw it as an attack on democracy.\n\nThat is exactly what is going on now. With their demonstrations against  Tesla and other American corporations, they are once again showing their support for democracy.\n\nAmericans thank all of you for your support. Yes, these Nazis will be defeated again, and this time no one will give a shit, what SCOTUS has to say in support of these fucking Nazis. All states will refuse to follow SCOTUS  orders and keep these motherfuckers, where they belong, in JAIL.",
                "Great, hit him where it hurts, his wealth."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Hegseth’s younger brother is serving in a key role as liaison and senior adviser inside the Pentagon",
            "external_url": "https://apnews.com/article/hegseth-brother-signal-dhs-hired-68678a8a653c79a4c6ae31a8bee64836",
            "upvotes": 10831,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Obviously a merit-based hire.",
                "Awful lot of nepotism in this swamp. Someone should think about draining it. ",
                "Nepotism in a Trump administration?  NO WAY.  They have too much integrity for that.",
                "Another DUI hire like his old brother?",
                "This is like the 1000000th most questionable thing the Trump administration has done",
                "I really hope a motivated reporter gets a bunch of info through FOIA about this dude's hiring process.\n\n\nConsidering how much info the government expects contractors to track and report around OFCCP compliance, it would be neat to find out if his hiring was nothing but an order from up top. You know, because merit and not anything else this could possibly be.\n\n\nNot that conservatives give two shits about blatant hypocrisy.",
                "So you can just put “Started my own podcast company” and “I do social media” on your resume now and people don’t laugh at you?",
                "He sneaks the scotch around for big bro.",
                "My friends hate “DEI” because “merit based!” (Which is its own false argument by itself) but when I bring these kinds of blatant nepotism hires up they go “nothing wrong with wanting people you trust working with you”\n\nSo yeah that’s where we’re at. The mental gymnastics know no bounds.",
                "Is he the one tasked with downsizing it into a trigon?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Meat packing plant workers worried over USDA allowing faster line speeds",
            "external_url": "https://www.mprnews.org/story/2025/03/28/meat-packing-plant-workers-worried-over-faster-line-speeds",
            "upvotes": 651,
            "date": "03/29/2025",
            "thumbnail": "https://img.apmcdn.org/d2513a1442c4be0a45fcc07d1cad749bce9fc2b5/widescreen/49bae7-2021-06-gettyimages-1233224268-2000.jpg",
            "top_comments": [
                "The United Food and Commercial Workers Union is against this.\n\nThe National Pork Producers Council supports this.\n\nTells you everything you need to know about this policy change.\n\nWho benefits, the corporate leaders who can force higher output or the workers physically on the actual line?",
                "And see an increase in workplace injuries in 3...2...\n\nOops, I can't do 1.\n\nThe saw just cut my finger off.",
                "Dudes read The Jungle like an instruction manual.",
                "Biden refused to speed up the poultry processing lines even more because of the risk of increasing that all ready increased food borne outbreaks.",
                "A lot of safety regulations are built on the suffering, pain, anguish, maiming, and deaths from past tragedies.\n\n[This channel is great for learning about the instances that caused such innovations.](https://www.youtube.com/@FascinatingHorror)\n\nThis shit is also why I say Libertarianism is the act of relearning history the hard stupid painful way. You could look at a regulation, crack open a history book, and read about why it exists. \n\nOr you can deregulate shit blindly then cause the same accident or tragedy to happen  again and again until the victims and community demand the regulation gets reinstated.",
                "In the early 1900s, Henry Ford started very slightly speeding up assembly/production lines every week. Employees caught on quickly, but injuries skyrocketed. \n\nWe’ve known for over 100 years that this is a bad idea.",
                "First ones on the line should be the 🐷 advocating for it.",
                "Isn't most packing factories having issues w staffing for some reason...   The speed of the line might not be the problem.",
                "The Jungle was not a map to success.",
                "Sausage fingers and just plain old fingers in your meal from now on!\n\nAnd now introducing the fingers of the 14 year olds who will be pushed into the factories to replace the immigrant populations."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Curiosity rover makes ‘arguably the most exciting organic detection to date on Mars’",
            "external_url": "https://www.cnn.com/2025/03/29/science/mars-curiosity-large-organic-molecules/index.html",
            "upvotes": 1331,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/nasa-mars-hydrocarbons-2025.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "\"Some scientists believe that fatty acids such as decanoic acid and dodecanoic acid formed the membranes of the first simple cell-like structures on Earth, Pearce said.\"\n\n\n\n\n\n“(This is) the closest we’ve come to detecting a major biomolecule-related signal — something potentially tied to membrane structure, which is a key feature of life,” Pearce said via email. “Organics on their own are intriguing, but not evidence of life. In contrast, biomolecules like membranes, amino acids, nucleotides, and sugars are central components of biology as we know it, and finding any of them would be groundbreaking (we haven’t yet).”",
                "Too bad there's no one left at NASA to study it.",
                "It’s cool to see the life on mars theory continue to gain validation. There’s a pretty convincing theory that as the core of Mars cooled it lost its global magnetic field which allowed solar winds to wreck the are, and turned what could’ve been a planet that supported life into what it is today.",
                "With the US going to shit at least this some good news",
                "Just say oil. Just say it’s oil and nasa will get a budget of fifty trillion next year",
                "Well poop, the great filter vid from kurzgesagt says something to the effect of if we found even microbial life on mars it would mean we have yet to pass the filter.  So self made apocalypse here we come!",
                "> decane, undecane and dodecane\n\ndamn, was hoping they were gonna say cocaine! Mars is made of COCAINE!",
                "What a discovery, chipmunks dig up lawns on Mars too.\n\nedit: you downvoters are no fucking fun losers who didn't look at the article.",
                "Sounds like Mars needs some Freedom🦅",
                "Bad news for the great filter theory"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Luigi Mangione may get a laptop in jail to work on his defense in CEO murder case",
            "external_url": "https://apnews.com/article/luigi-mangione-trial-laptop-jail-unitedhealthcare-8bed30b120f57942cd24fdb91b61d210",
            "upvotes": 301,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I know he won’t have internet but will he have a webcam?"
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "HOT",
            "title": "Small plane crashes in Minneapolis suburb, FAA says",
            "external_url": "https://abcnews.go.com/US/small-plane-crashes-minneapolis-suburb-faa/story?id=120298494",
            "upvotes": 349,
            "date": "03/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/19daad38-9af0-4161-a580-af151d91483c/minnesota-plane-crash-01-ht-jt-250329_1743276433188_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Wow this looks really bad.",
                "At least they survived."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Elon Musk must face Twitter shareholders’ lawsuit over alleged securities fraud",
            "external_url": "https://www.cnbc.com/2025/03/28/elon-musk-must-face-twitter-shareholders-lawsuit-over-alleged-securities-fraud.html",
            "upvotes": 23236,
            "date": "03/29/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/107044713-1649676192257-107044713-1649676075485-gettyimages-1239883418-porzycki-economic220409_npT8D.jpg?v=1650040148&w=1920&h=1080",
            "top_comments": [
                "\"Musk’s attorneys have argued that while his disclosure was filed after an SEC-mandated deadline, this was merely an error and that the tech magnate did not commit nor intend securities fraud.\"\n\nLook your honor, I may be a simple a simple country hyper-chicken, but my client did not intend to commit securities fraud, just did.",
                "I like how Musk portrays himself as the most detail-oriented guy when trying to pretend like he knows what the fuck is going on with SpaceX rockets but then he commits an \"oopsie\" like this. As if he doesn't have somebody on his staff who's job is to deal with this.",
                "I get the feeling that lawsuits against Musk won't amount to much. Buying the last election is really paying out for him.",
                "Never knew this detail:\n\n\n\n\n\"In his 43-page opinion, the judge also noted that Musk had posted a tweet on March 26, 2022 indicating he was thinking about buying a different social network, not Twitter, although he had already amassed millions of shares in Twitter as of March 25, 2022.\n\nHe wrote, it was “reasonable” to read Musk’s tweet “as a statement meant to misdirect the public to think that buying Twitter was just a fantasy.” The judge also wrote that, “it is more likely than not that Musk issued a material misleading representation,” with those tweets.\n\nMusk ultimately bid on and led a leveraged buyout of Twitter in 2022 in a deal worth about $44 billion. He made sweeping changes to the business, the social platform and later renamed it X.\"",
                "It was announced today DOGE was going through onboarding with the SEC. So this will be dismissed at some point",
                "\"In the wallet\" is his weak point.",
                "That turd needs to face all the people he’s screwing over.",
                "We need to start applying violent criminal punishments to 'white collar' crimes in this Country.  \nThis is ridiculous.",
                "This has to be why 🍑🍑 pardoned that other guy today… lying to investors to get money is just what these amoral people do, and they have no qualms about using the “if you’re stupid enough to believe me then it’s your own fault” mentality.  They have no business whatsoever being in the Oval Office, too bad their voters cannot seem to see past their aggrieved mentality to see that.",
                "Are laws still a thing in the US?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Briton praised for tackling Amsterdam knife attack suspect",
            "external_url": "https://www.bbc.co.uk/news/articles/cz030jm2z5zo",
            "upvotes": 739,
            "date": "03/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b11c/live/fbc2fb70-0c72-11f0-b234-07dc7691c360.jpg",
            "top_comments": [
                "A British man has been praised for tackling a suspected knifeman to the ground in central Amsterdam.\n\nThe tourist, who does not wish to be named, restrained the suspect after five people were stabbed near the Dutch capital’s Dam Square on Thursday.\n\nVideo of the incident shows the Briton, wearing jeans and a black hoodie, kneeling on his back and twisting his arm until police arrived.\n\nAmsterdam’s Mayor Femke Halsema said she was impressed by his decisive action, telling local broadcasters he showed “exceptional” instinct.",
                "Glad they recognized him. He did a great thing.",
                "A news on a British tourist that doesn't involve embarrassing behavior?\n\nThis is eerie. Something is up and we should get ready.",
                "Good job River Cartwright.",
                "That guys needs some real love. Hopefully he Atleast gets a gofundme. Considering how much money is spent on antiterrorism then give him a few million atleast. We really need to reward the right people.",
                "He should receive a medal. This kind of bravery should be rewarded",
                "“I’m Millwall, mate”. Probably",
                "2025 where British blokes on holidays abroad are being heroes. Worlds gone absolutely bloody mad, this settles it lol",
                "What? No good guy with a gun was involved? How can this be possible?",
                "The bravery shown by the British tourist in Amsterdam is truly remarkable. In a tense and dangerous situation, he didn’t hesitate to act when a knife attack occurred in a busy public space. Tackling the suspect to the ground and restraining him until the police arrived was an incredibly courageous and quick-thinking move. It's easy to imagine how panic could set in during such an attack, but this individual’s instincts and actions helped prevent what could have been a much worse scenario.\n\nWhat stands out here is not only the tourist’s bravery but his humility in staying anonymous despite the praise he received. In a world where heroes often seek recognition, it's refreshing to see someone act purely out of selflessness and a desire to help. The acknowledgment from Amsterdam’s Mayor, calling his actions \"exceptional,\" speaks volumes about the positive impact one individual can have in an unpredictable and dangerous situation."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Red Cross gravely concerned for nine missing medics in Gaza",
            "external_url": "https://www.reuters.com/world/middle-east/red-cross-gravely-concerned-nine-missing-medics-gaza-2025-03-29/",
            "upvotes": 861,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Weird, I wonder who killed them.",
                "I read a novel about a society of flying lizard people in which one of, if not the worst crimes a person could commit was to kill a healer. I wish humans thought that way",
                "Israel breaks international law like Snoop Dogg smokes weed",
                "For people who are paywalled, mirror from [USNews](https://www.usnews.com/news/world/articles/2025-03-29/red-cross-gravely-concerned-for-nine-missing-medics-in-gaza).",
                "*Everyone* is concerned except for Zionists and the American politicians they pay for.",
                "[removed]",
                "I admire the optimism to be concerned about missing medics rather than just writing them off as murdered five minutes after the were late checking in.",
                "Ask BIBI, I’m sure he knows",
                "[deleted]",
                "The medics are probably loading their rifles as they hide in tunnels under a kindergarten class"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "US orders French companies to comply with Trump's diversity ban",
            "external_url": "https://www.reuters.com/world/us-warns-french-companies-they-must-comply-with-trumps-diversity-ban-2025-03-29/",
            "upvotes": 207,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Apparently he doesn't realize he doesn't own the whole planet.",
                "The WORST president of ALL TIME.",
                "And their response will likely be “fuck off” in French.",
                "Oh boy, this definitely won't sour another relationship with an ally more",
                "He doesn’t get the French. Most Americans have zero idea about French culture. The French go hard and they don’t suffer fools. \n\nAs they say FAFO.",
                "I hope they tell the Turd Reich to F themselves.",
                "And also, send eggs. \n\nWonder how long til the USA figures out they aren’t welcome anywhere and no one gives a fuck what you “order”",
                "French don't get shit from their government, so if you believe they take shit from FOREIGN governments you're sorely mistaken...",
                "The French said \"va te faire foutre\".",
                "Hmm, maybe American companies should comply with French labor laws."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Luigi Mangione may get a laptop in jail to work on his defense in CEO murder case",
            "external_url": "https://apnews.com/article/luigi-mangione-trial-laptop-jail-unitedhealthcare-8bed30b120f57942cd24fdb91b61d210",
            "upvotes": 301,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I know he won’t have internet but will he have a webcam?"
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "NEW",
            "title": "Small plane crashes in Minneapolis suburb, FAA says",
            "external_url": "https://abcnews.go.com/US/small-plane-crashes-minneapolis-suburb-faa/story?id=120298494",
            "upvotes": 344,
            "date": "03/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/19daad38-9af0-4161-a580-af151d91483c/minnesota-plane-crash-01-ht-jt-250329_1743276433188_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Wow this looks really bad.",
                "At least they survived."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Meat packing plant workers worried over USDA allowing faster line speeds",
            "external_url": "https://www.mprnews.org/story/2025/03/28/meat-packing-plant-workers-worried-over-faster-line-speeds",
            "upvotes": 651,
            "date": "03/29/2025",
            "thumbnail": "https://img.apmcdn.org/d2513a1442c4be0a45fcc07d1cad749bce9fc2b5/widescreen/49bae7-2021-06-gettyimages-1233224268-2000.jpg",
            "top_comments": [
                "The United Food and Commercial Workers Union is against this.\n\nThe National Pork Producers Council supports this.\n\nTells you everything you need to know about this policy change.\n\nWho benefits, the corporate leaders who can force higher output or the workers physically on the actual line?",
                "And see an increase in workplace injuries in 3...2...\n\nOops, I can't do 1.\n\nThe saw just cut my finger off.",
                "Dudes read The Jungle like an instruction manual.",
                "Biden refused to speed up the poultry processing lines even more because of the risk of increasing that all ready increased food borne outbreaks.",
                "A lot of safety regulations are built on the suffering, pain, anguish, maiming, and deaths from past tragedies.\n\n[This channel is great for learning about the instances that caused such innovations.](https://www.youtube.com/@FascinatingHorror)\n\nThis shit is also why I say Libertarianism is the act of relearning history the hard stupid painful way. You could look at a regulation, crack open a history book, and read about why it exists. \n\nOr you can deregulate shit blindly then cause the same accident or tragedy to happen  again and again until the victims and community demand the regulation gets reinstated.",
                "In the early 1900s, Henry Ford started very slightly speeding up assembly/production lines every week. Employees caught on quickly, but injuries skyrocketed. \n\nWe’ve known for over 100 years that this is a bad idea.",
                "First ones on the line should be the 🐷 advocating for it.",
                "Isn't most packing factories having issues w staffing for some reason...   The speed of the line might not be the problem.",
                "The Jungle was not a map to success.",
                "Sausage fingers and just plain old fingers in your meal from now on!\n\nAnd now introducing the fingers of the 14 year olds who will be pushed into the factories to replace the immigrant populations."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "Protests hit Tesla dealerships across the world in challenge to Elon Musk",
            "external_url": "https://www.theguardian.com/world/2025/mar/29/tesla-protests-elon-musk-doge",
            "upvotes": 6258,
            "date": "03/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/35ea73a65fc7a315f860de5cf6c1a41aaeb375a1/0_120_1600_961/master/1600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f512a33f02abb7923975fb836120a1f9",
            "top_comments": [
                "Just a friendly reminder that he views these protests as a form of economic warfare and would prosecute everyone there if he could. He absolutely hates this stuff. Look at how emotional he got when someone made fun of the stock prices, he called him evil lol.\n\nKeep it up everybody.",
                "That's ok...seems like Nikola may be making a comeback. /s\n\nThis shit is getting obscene...listen to Trump explain his Pardon...\n\n\" I think...\"\n\n\" I think he was exonerated\"\n\n\" I don't know but I got lotsa references \"",
                "*On Saturday, with more than 200 events planned worldwide, protests kicked off midday in front of Tesla showrooms in Australia and New Zealand and then rippled across Europe in countries including Finland, Norway, Denmark, Germany, France, the Netherlands and the UK. Each rally was locally organized with original themes. In Ireland, it was “Smash the Fash”, and Switzerland had “Down with Doge...”*\n\nAnd, of course, from coast to coast in the US Tesla dealerships were closed down because of all the demonstrations, actions, and angry displays.",
                "Take the stock all the way down. Mediocre products waaaaaaay overvalued .",
                "The smartest thing Tesla can do is remove Elon and any association for the sake of the company.\n\nUnless Elon holds a majority in the company, in that case id ditch the stock now before it goes any lower.",
                "The whole world hates you Elon. You are universally despised.",
                "The world cannot wait for Elon to Occupy Mars.",
                "Just left one in Sunnyvale, CA, which might have the highest concentration of Teslas anywhere in the world. In fact, I would bet on it. Conservatively guessing 700+ protesters and four very lonely pro-Trump counterprotesters.",
                "I am reminded of the generosity of humans all over the world after 911 when they all came together to support us, for they saw it as an attack on democracy.\n\nThat is exactly what is going on now. With their demonstrations against  Tesla and other American corporations, they are once again showing their support for democracy.\n\nAmericans thank all of you for your support. Yes, these Nazis will be defeated again, and this time no one will give a shit, what SCOTUS has to say in support of these fucking Nazis. All states will refuse to follow SCOTUS  orders and keep these motherfuckers, where they belong, in JAIL.",
                "Great, hit him where it hurts, his wealth."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "White House Correspondents’ Association cancels plans to have a comedian headline annual dinner",
            "external_url": "https://www.cnn.com/2025/03/29/media/white-house-correspondents-association-dinner-comedian/index.html",
            "upvotes": 15772,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/220430231320-23-white-house-correspondents-dinner.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Instead, the association says it will celebrate the First Amendment and the free press.\n\nAlso irony.",
                "I always find it hilarious the man who bullies everyone under the guise of a joke can’t take one himself. I’m sure it’s a narcissist thing.",
                ">\"At this consequential moment for journalism, I want to ensure the focus is not on the politics of division but entirely on awarding our colleagues for their outstanding work and providing scholarship and mentorship to the next generation of journalists\"\n\nSit, lie down, play dead. Good doggy.",
                "They're too chicken to have a real comedian, and comedians on their side of the aisle are probably gonna say a lot of really racist shit.",
                "lol any comedian worth their salt would have absolutely brutally buried this administration with joke after joke. I can’t blame them for canceling. The roast would have been REAL!",
                "Cancel this fucking dinner. No respectable journalist should show up to rub elbows with this authoritarian administration.",
                "She told hosts comedian Samantha Bee and Beast Chief Content Officer Joanna Coles that the Trump administration are “kind of a bunch of murderers,” adding that playing to both sides “makes them feel like human beings, but they shouldn’t get to feel that way, ‘cause they’re not.”\n\nHA",
                "Softer than baby shit.",
                "Get Bill Burr you cowards",
                "Elon: “the left killed comedy”\nThe right: “no comedy this year.”"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Artificial sweetener surcralose (aka E955) confuses brain and increases hunger, study says | CNN",
            "external_url": "https://www.cnn.com/2025/03/29/health/artificial-sweetener-sucralose-hunger-signals-wellness/index.html",
            "upvotes": 60,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2162322149.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Study funded by Big Sugar",
                "it also can cause migraines"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Harvard Dismisses Leaders of Center for Middle Eastern Studies | News | The Harvard Crimson",
            "external_url": "https://www.thecrimson.com/article/2025/3/29/harvard-cmes-director-departure/",
            "upvotes": 47,
            "date": "03/29/2025",
            "thumbnail": "https://s3.amazonaws.com/thumbnails.thecrimson.com/photos/2017/01/24/195101_1319860.jpg.1999x1750_q95_crop-smart_upscale.jpg",
            "top_comments": [
                "Have to cave to the fascists or risk having to dip into the endowment to offset the potential loss of federal money. \n\nSo much for the school's motto: Veritas.",
                "“The departures come after the CMES has repeatedly faced public criticism from Harvard affiliates who have alleged that some of the center’s programming has been antisemitic and has failed to represent Israeli perspectives.”\n\nIn other news, the Holocaust Museum has repeatedly faced public criticism for failing to represent the Nazi perspective.",
                "Our institutions will not stand against fascism. It must be us",
                "That was an antisemitic propaganda center anyways."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Briton praised for tackling Amsterdam knife attack suspect",
            "external_url": "https://www.bbc.co.uk/news/articles/cz030jm2z5zo",
            "upvotes": 737,
            "date": "03/29/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b11c/live/fbc2fb70-0c72-11f0-b234-07dc7691c360.jpg",
            "top_comments": [
                "A British man has been praised for tackling a suspected knifeman to the ground in central Amsterdam.\n\nThe tourist, who does not wish to be named, restrained the suspect after five people were stabbed near the Dutch capital’s Dam Square on Thursday.\n\nVideo of the incident shows the Briton, wearing jeans and a black hoodie, kneeling on his back and twisting his arm until police arrived.\n\nAmsterdam’s Mayor Femke Halsema said she was impressed by his decisive action, telling local broadcasters he showed “exceptional” instinct.",
                "Glad they recognized him. He did a great thing.",
                "A news on a British tourist that doesn't involve embarrassing behavior?\n\nThis is eerie. Something is up and we should get ready.",
                "Good job River Cartwright.",
                "That guys needs some real love. Hopefully he Atleast gets a gofundme. Considering how much money is spent on antiterrorism then give him a few million atleast. We really need to reward the right people.",
                "He should receive a medal. This kind of bravery should be rewarded",
                "“I’m Millwall, mate”. Probably",
                "2025 where British blokes on holidays abroad are being heroes. Worlds gone absolutely bloody mad, this settles it lol",
                "What? No good guy with a gun was involved? How can this be possible?",
                "The bravery shown by the British tourist in Amsterdam is truly remarkable. In a tense and dangerous situation, he didn’t hesitate to act when a knife attack occurred in a busy public space. Tackling the suspect to the ground and restraining him until the police arrived was an incredibly courageous and quick-thinking move. It's easy to imagine how panic could set in during such an attack, but this individual’s instincts and actions helped prevent what could have been a much worse scenario.\n\nWhat stands out here is not only the tourist’s bravery but his humility in staying anonymous despite the praise he received. In a world where heroes often seek recognition, it's refreshing to see someone act purely out of selflessness and a desire to help. The acknowledgment from Amsterdam’s Mayor, calling his actions \"exceptional,\" speaks volumes about the positive impact one individual can have in an unpredictable and dangerous situation."
            ],
            "aggregate_sentiment": 80.0
        },
        {
            "category": "NEW",
            "title": "Curiosity rover makes ‘arguably the most exciting organic detection to date on Mars’",
            "external_url": "https://www.cnn.com/2025/03/29/science/mars-curiosity-large-organic-molecules/index.html",
            "upvotes": 1333,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/nasa-mars-hydrocarbons-2025.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "\"Some scientists believe that fatty acids such as decanoic acid and dodecanoic acid formed the membranes of the first simple cell-like structures on Earth, Pearce said.\"\n\n\n\n\n\n“(This is) the closest we’ve come to detecting a major biomolecule-related signal — something potentially tied to membrane structure, which is a key feature of life,” Pearce said via email. “Organics on their own are intriguing, but not evidence of life. In contrast, biomolecules like membranes, amino acids, nucleotides, and sugars are central components of biology as we know it, and finding any of them would be groundbreaking (we haven’t yet).”",
                "Too bad there's no one left at NASA to study it.",
                "It’s cool to see the life on mars theory continue to gain validation. There’s a pretty convincing theory that as the core of Mars cooled it lost its global magnetic field which allowed solar winds to wreck the are, and turned what could’ve been a planet that supported life into what it is today.",
                "With the US going to shit at least this some good news",
                "Just say oil. Just say it’s oil and nasa will get a budget of fifty trillion next year",
                "Well poop, the great filter vid from kurzgesagt says something to the effect of if we found even microbial life on mars it would mean we have yet to pass the filter.  So self made apocalypse here we come!",
                "> decane, undecane and dodecane\n\ndamn, was hoping they were gonna say cocaine! Mars is made of COCAINE!",
                "What a discovery, chipmunks dig up lawns on Mars too.\n\nedit: you downvoters are no fucking fun losers who didn't look at the article.",
                "Sounds like Mars needs some Freedom🦅",
                "Bad news for the great filter theory"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "RISING",
            "title": "Luigi Mangione may get a laptop in jail to work on his defense in CEO murder case",
            "external_url": "https://apnews.com/article/luigi-mangione-trial-laptop-jail-unitedhealthcare-8bed30b120f57942cd24fdb91b61d210",
            "upvotes": 302,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I know he won’t have internet but will he have a webcam?"
            ],
            "aggregate_sentiment": 55.0
        },
        {
            "category": "RISING",
            "title": "Protests hit Tesla dealerships across the world in challenge to Elon Musk",
            "external_url": "https://www.theguardian.com/world/2025/mar/29/tesla-protests-elon-musk-doge",
            "upvotes": 6272,
            "date": "03/29/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/35ea73a65fc7a315f860de5cf6c1a41aaeb375a1/0_120_1600_961/master/1600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f512a33f02abb7923975fb836120a1f9",
            "top_comments": [
                "Just a friendly reminder that he views these protests as a form of economic warfare and would prosecute everyone there if he could. He absolutely hates this stuff. Look at how emotional he got when someone made fun of the stock prices, he called him evil lol.\n\nKeep it up everybody.",
                "That's ok...seems like Nikola may be making a comeback. /s\n\nThis shit is getting obscene...listen to Trump explain his Pardon...\n\n\" I think...\"\n\n\" I think he was exonerated\"\n\n\" I don't know but I got lotsa references \"",
                "*On Saturday, with more than 200 events planned worldwide, protests kicked off midday in front of Tesla showrooms in Australia and New Zealand and then rippled across Europe in countries including Finland, Norway, Denmark, Germany, France, the Netherlands and the UK. Each rally was locally organized with original themes. In Ireland, it was “Smash the Fash”, and Switzerland had “Down with Doge...”*\n\nAnd, of course, from coast to coast in the US Tesla dealerships were closed down because of all the demonstrations, actions, and angry displays.",
                "Take the stock all the way down. Mediocre products waaaaaaay overvalued .",
                "The smartest thing Tesla can do is remove Elon and any association for the sake of the company.\n\nUnless Elon holds a majority in the company, in that case id ditch the stock now before it goes any lower.",
                "The whole world hates you Elon. You are universally despised.",
                "The world cannot wait for Elon to Occupy Mars.",
                "Just left one in Sunnyvale, CA, which might have the highest concentration of Teslas anywhere in the world. In fact, I would bet on it. Conservatively guessing 700+ protesters and four very lonely pro-Trump counterprotesters.",
                "I am reminded of the generosity of humans all over the world after 911 when they all came together to support us, for they saw it as an attack on democracy.\n\nThat is exactly what is going on now. With their demonstrations against  Tesla and other American corporations, they are once again showing their support for democracy.\n\nAmericans thank all of you for your support. Yes, these Nazis will be defeated again, and this time no one will give a shit, what SCOTUS has to say in support of these fucking Nazis. All states will refuse to follow SCOTUS  orders and keep these motherfuckers, where they belong, in JAIL.",
                "Great, hit him where it hurts, his wealth."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Meat packing plant workers worried over USDA allowing faster line speeds",
            "external_url": "https://www.mprnews.org/story/2025/03/28/meat-packing-plant-workers-worried-over-faster-line-speeds",
            "upvotes": 650,
            "date": "03/29/2025",
            "thumbnail": "https://img.apmcdn.org/d2513a1442c4be0a45fcc07d1cad749bce9fc2b5/widescreen/49bae7-2021-06-gettyimages-1233224268-2000.jpg",
            "top_comments": [
                "The United Food and Commercial Workers Union is against this.\n\nThe National Pork Producers Council supports this.\n\nTells you everything you need to know about this policy change.\n\nWho benefits, the corporate leaders who can force higher output or the workers physically on the actual line?",
                "And see an increase in workplace injuries in 3...2...\n\nOops, I can't do 1.\n\nThe saw just cut my finger off.",
                "Dudes read The Jungle like an instruction manual.",
                "Biden refused to speed up the poultry processing lines even more because of the risk of increasing that all ready increased food borne outbreaks.",
                "A lot of safety regulations are built on the suffering, pain, anguish, maiming, and deaths from past tragedies.\n\n[This channel is great for learning about the instances that caused such innovations.](https://www.youtube.com/@FascinatingHorror)\n\nThis shit is also why I say Libertarianism is the act of relearning history the hard stupid painful way. You could look at a regulation, crack open a history book, and read about why it exists. \n\nOr you can deregulate shit blindly then cause the same accident or tragedy to happen  again and again until the victims and community demand the regulation gets reinstated.",
                "In the early 1900s, Henry Ford started very slightly speeding up assembly/production lines every week. Employees caught on quickly, but injuries skyrocketed. \n\nWe’ve known for over 100 years that this is a bad idea.",
                "First ones on the line should be the 🐷 advocating for it.",
                "Isn't most packing factories having issues w staffing for some reason...   The speed of the line might not be the problem.",
                "The Jungle was not a map to success.",
                "Sausage fingers and just plain old fingers in your meal from now on!\n\nAnd now introducing the fingers of the 14 year olds who will be pushed into the factories to replace the immigrant populations."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Small plane crashes in Minneapolis suburb, FAA says",
            "external_url": "https://abcnews.go.com/US/small-plane-crashes-minneapolis-suburb-faa/story?id=120298494",
            "upvotes": 347,
            "date": "03/29/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/19daad38-9af0-4161-a580-af151d91483c/minnesota-plane-crash-01-ht-jt-250329_1743276433188_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Wow this looks really bad.",
                "At least they survived."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "White House Correspondents’ Association cancels plans to have a comedian headline annual dinner",
            "external_url": "https://www.cnn.com/2025/03/29/media/white-house-correspondents-association-dinner-comedian/index.html",
            "upvotes": 15779,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/220430231320-23-white-house-correspondents-dinner.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                ">Instead, the association says it will celebrate the First Amendment and the free press.\n\nAlso irony.",
                "I always find it hilarious the man who bullies everyone under the guise of a joke can’t take one himself. I’m sure it’s a narcissist thing.",
                ">\"At this consequential moment for journalism, I want to ensure the focus is not on the politics of division but entirely on awarding our colleagues for their outstanding work and providing scholarship and mentorship to the next generation of journalists\"\n\nSit, lie down, play dead. Good doggy.",
                "They're too chicken to have a real comedian, and comedians on their side of the aisle are probably gonna say a lot of really racist shit.",
                "lol any comedian worth their salt would have absolutely brutally buried this administration with joke after joke. I can’t blame them for canceling. The roast would have been REAL!",
                "Cancel this fucking dinner. No respectable journalist should show up to rub elbows with this authoritarian administration.",
                "She told hosts comedian Samantha Bee and Beast Chief Content Officer Joanna Coles that the Trump administration are “kind of a bunch of murderers,” adding that playing to both sides “makes them feel like human beings, but they shouldn’t get to feel that way, ‘cause they’re not.”\n\nHA",
                "Softer than baby shit.",
                "Get Bill Burr you cowards",
                "Elon: “the left killed comedy”\nThe right: “no comedy this year.”"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "US orders French companies to comply with Trump's diversity ban",
            "external_url": "https://www.reuters.com/world/us-warns-french-companies-they-must-comply-with-trumps-diversity-ban-2025-03-29/",
            "upvotes": 212,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Apparently he doesn't realize he doesn't own the whole planet.",
                "The WORST president of ALL TIME.",
                "And their response will likely be “fuck off” in French.",
                "Oh boy, this definitely won't sour another relationship with an ally more",
                "He doesn’t get the French. Most Americans have zero idea about French culture. The French go hard and they don’t suffer fools. \n\nAs they say FAFO.",
                "I hope they tell the Turd Reich to F themselves.",
                "And also, send eggs. \n\nWonder how long til the USA figures out they aren’t welcome anywhere and no one gives a fuck what you “order”",
                "French don't get shit from their government, so if you believe they take shit from FOREIGN governments you're sorely mistaken...",
                "The French said \"va te faire foutre\".",
                "Hmm, maybe American companies should comply with French labor laws."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Red Cross gravely concerned for nine missing medics in Gaza",
            "external_url": "https://www.reuters.com/world/middle-east/red-cross-gravely-concerned-nine-missing-medics-gaza-2025-03-29/",
            "upvotes": 864,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Weird, I wonder who killed them.",
                "I read a novel about a society of flying lizard people in which one of, if not the worst crimes a person could commit was to kill a healer. I wish humans thought that way",
                "Israel breaks international law like Snoop Dogg smokes weed",
                "For people who are paywalled, mirror from [USNews](https://www.usnews.com/news/world/articles/2025-03-29/red-cross-gravely-concerned-for-nine-missing-medics-in-gaza).",
                "*Everyone* is concerned except for Zionists and the American politicians they pay for.",
                "[removed]",
                "I admire the optimism to be concerned about missing medics rather than just writing them off as murdered five minutes after the were late checking in.",
                "Ask BIBI, I’m sure he knows",
                "[deleted]",
                "The medics are probably loading their rifles as they hide in tunnels under a kindergarten class"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Hegseth’s younger brother is serving in a key role as liaison and senior adviser inside the Pentagon",
            "external_url": "https://apnews.com/article/hegseth-brother-signal-dhs-hired-68678a8a653c79a4c6ae31a8bee64836",
            "upvotes": 10832,
            "date": "03/29/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Obviously a merit-based hire.",
                "Awful lot of nepotism in this swamp. Someone should think about draining it. ",
                "Nepotism in a Trump administration?  NO WAY.  They have too much integrity for that.",
                "Another DUI hire like his old brother?",
                "This is like the 1000000th most questionable thing the Trump administration has done",
                "I really hope a motivated reporter gets a bunch of info through FOIA about this dude's hiring process.\n\n\nConsidering how much info the government expects contractors to track and report around OFCCP compliance, it would be neat to find out if his hiring was nothing but an order from up top. You know, because merit and not anything else this could possibly be.\n\n\nNot that conservatives give two shits about blatant hypocrisy.",
                "So you can just put “Started my own podcast company” and “I do social media” on your resume now and people don’t laugh at you?",
                "He sneaks the scotch around for big bro.",
                "My friends hate “DEI” because “merit based!” (Which is its own false argument by itself) but when I bring these kinds of blatant nepotism hires up they go “nothing wrong with wanting people you trust working with you”\n\nSo yeah that’s where we’re at. The mental gymnastics know no bounds.",
                "Is he the one tasked with downsizing it into a trigon?"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "Airman who was shot down, imprisoned in Japan during World War II accounted for",
            "external_url": "https://www.cbsnews.com/news/world-war-ii-airman-tokyo-prison-fire-accounted-for/",
            "upvotes": 705,
            "date": "03/29/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/27/967af4aa-c473-4418-bd2c-425f83459f2c/thumbnail/1200x630g8/4a8e7242c096130e2350b6bc14d572d4/screenshot-2025-03-27-at-10-40-32-am.png?v=95354023eeb6141c58c08d9a5716f291",
            "top_comments": [
                "I marvel at tenacity of organization geared to search and identify missing US military members lost in the fog of war.\n\nAnother missing is now identified and will return home.\n\nThank you very much for your service to US.",
                "Total accounting for every soldier, sailor, airman and Marine. Leave no man behind.",
                "I find it ironic that the people he came to bomb merely put him in prison, then his own country killed him."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "Curiosity rover makes ‘arguably the most exciting organic detection to date on Mars’",
            "external_url": "https://www.cnn.com/2025/03/29/science/mars-curiosity-large-organic-molecules/index.html",
            "upvotes": 1336,
            "date": "03/29/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/nasa-mars-hydrocarbons-2025.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "\"Some scientists believe that fatty acids such as decanoic acid and dodecanoic acid formed the membranes of the first simple cell-like structures on Earth, Pearce said.\"\n\n\n\n\n\n“(This is) the closest we’ve come to detecting a major biomolecule-related signal — something potentially tied to membrane structure, which is a key feature of life,” Pearce said via email. “Organics on their own are intriguing, but not evidence of life. In contrast, biomolecules like membranes, amino acids, nucleotides, and sugars are central components of biology as we know it, and finding any of them would be groundbreaking (we haven’t yet).”",
                "Too bad there's no one left at NASA to study it.",
                "It’s cool to see the life on mars theory continue to gain validation. There’s a pretty convincing theory that as the core of Mars cooled it lost its global magnetic field which allowed solar winds to wreck the are, and turned what could’ve been a planet that supported life into what it is today.",
                "With the US going to shit at least this some good news",
                "Just say oil. Just say it’s oil and nasa will get a budget of fifty trillion next year",
                "Well poop, the great filter vid from kurzgesagt says something to the effect of if we found even microbial life on mars it would mean we have yet to pass the filter.  So self made apocalypse here we come!",
                "> decane, undecane and dodecane\n\ndamn, was hoping they were gonna say cocaine! Mars is made of COCAINE!",
                "What a discovery, chipmunks dig up lawns on Mars too.\n\nedit: you downvoters are no fucking fun losers who didn't look at the article.",
                "Sounds like Mars needs some Freedom🦅",
                "Bad news for the great filter theory"
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "03/30/2025 00:44:31 UTC"
}