{
    "posts": [
        {
            "category": "HOT",
            "title": "Brussels police arrest US State Secretary Rubio's bodyguard",
            "external_url": "https://www.brusselstimes.com/brussels/1526014/brussels-police-arrest-us-state-secretary-rubios-bodyguard-tbtb",
            "upvotes": 13119,
            "date": "04/08/2025",
            "thumbnail": "https://api.brusselstimes.com/wp-content/uploads/2025/04/ad995448-belgaimage-116320348-1024x683.jpg",
            "top_comments": [
                ">Two sources with direct knowledge of the situation told the Washington Examiner that the agent in question was \"behaving erratically\" and \"became irate\" when hotel staff refused to reopen the bar beyond its normal hours, the US media reports.\n\nAnd here I thought it was going to be about some professional disagreement that got out of hand.",
                "These guys are so used to getting away with breaking the law in the USA.\n\nThey take that mindset and ego to other places in the world and get arrested. \n\nGlad there is still integrity elsewhere.",
                "Needed some liquor at 3:00 a.m. just to live with himself.",
                "The party of “law and order” strikes again.",
                "Wait I thought Pete Hegseth ran the Pentagon not a security detail???",
                "These cavemen have a lot of trouble hearing the word NO.",
                "Violence. Rape. Alcohol. Child Porn. Tinder. Greed. Threats. Abuse. \n\nThe party of Christianity needs to stop “protecting the world from the evil libs” and start looking at what they are supporting.",
                "“I have diplomatic immunity!”\n\n>It’s just been revoked.",
                "Was this a \"merit\" hire? Because this shit show of administration keeps showing they aren't hiring the best people in the slightest.",
                "A government of the Karens, by the Karens, for the Karens.\n\n\nI *guarantee* this guy demanded to see the bar's manager."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Chinese soldiers captured fighting alongside Russians in Ukraine, says Zelenskyy",
            "external_url": "https://www.abc.net.au/news/2025-04-08/zelenskyy-claims-army-has-captured-chinese-soldiers-in-ukraine/105153948?utm_source=abc_news_app&utm_medium=content_shared&utm_campaign=abc_news_app&utm_content=other",
            "upvotes": 18457,
            "date": "04/08/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/34cd7307c49584a150f2bad7aae83273?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=200&width=862&height=485&imformat=generic",
            "top_comments": [
                "There have been Chinese mercenaries in Ukraine since the start of the war, that’s nothing new. I even saw a PLA veteran filming and doing some sort of video blog on his Chinese social media account.",
                "It’s Chinese mercs enlisting to the Russian army. Not actual Chinese soldiers",
                "so it's like, soldiers born in china, not *chinese soldiers*. that's important.",
                "Big difference between capturing Chinese citizens and capturing Chinese soldiers.\n\nAs stated (several paragraphs deep) in the article, citizens from all over the world have gallavanted off to Ukraine to fight.\n\nShame on ABC for that headline.",
                "I mean there have been fighters from many nations on both sides for a while now",
                "It's nothing new,several russian PMCs and military units have been hiring chinese mercenaries since the beginning of the war,some have even fought in the [Pyatnashka Brigade](https://en.wikipedia.org/wiki/Pyatnashka_Brigade)",
                "It is illegal to desert your post in the army in all countries pretty much. Chinese citizens not soldiers obviously.",
                "Regardless of the nature of the situation, this announcement is clearly a ploy to appeal to the US, given they’ve announced that China is the only foe they care about.",
                "Brits and americans are fighting at Ukrainian side..",
                "But why? I heard russians are lining up to enlistment offices everyday"
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "HOT",
            "title": "US Justice Dept disbands crypto enforcement team, citing Trump order",
            "external_url": "https://www.reuters.com/world/us/us-justice-dept-disbands-cryptocurrency-enforcement-unit-2025-04-08/",
            "upvotes": 7115,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Can't have people looking into crypto scams when the President and his family are the ones running the crypto scams.",
                "I'm guessing the SBF pardon will be coming on Friday at around 7 PM.",
                "He certainly likes dismantling consumer protection agencies.",
                "It's things like this that will cause the Great Depression to repeat.\n\nThe SEC was created to regulate stock to ensure people didn't do stupid things to buy overpriced stock.\n\nInstead, we're going to have people spending their life savings on meme coins, only to have it get magically wiped out.\n\nCombine that with tariffs and the inevitable ecological disasters that won't be properly responded to... and you have the Great Depression.",
                "What is the point of congress anymore? Trump seems to have the power to do everything himself.",
                "Trump can't have his grifting being investigated.",
                "New trump shitcoin launching in 3… 2…",
                "\"US Justice Department disbands fraud enforcement team, citing Trump order\".",
                "You're safe to assume all crypto is a scam. \n\nIt's funny to me that the same people who want to bring back sweatshop manufacturing also push crypto.",
                "we had a crypto enforcement team? What the fuck have they been doing this whole time??"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Musk's DOGE using AI to snoop on U.S. federal workers, sources say",
            "external_url": "https://www.reuters.com/technology/artificial-intelligence/musks-doge-using-ai-snoop-us-federal-workers-sources-say-2025-04-08/",
            "upvotes": 5237,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Big Brother is watching.\n\nIsn't this exactly the kind of thing that conservatives worried about? The government monitoring you?\n\nWhat do trump supporters have to say about this? My guess is they will deny it or say if you're not doing anything wrong why worry about it.",
                "I think it goes, or at least is going to go, far beyond federal workers.\n\nhttps://www.upi.com/Voices/2025/03/06/DOGE-government-data-danger/2551741269965/",
                "This is **not** your standard company snooping to check you’re at your desk!\n\n> Trump administration officials have told some U.S. government employees that Elon Musk’s DOGE team of technologists is using artificial intelligence to **surveil at least one federal agency’s communications for hostility to President Donald Trump and his agenda**, said two people with knowledge of the matter.\n\n> At the Environmental Protection Agency, for instance, some EPA managers were told by Trump appointees that Musk’s team is **rolling out AI to monitor workers, including looking for language in communications considered hostile to Trump or Musk**, the two people said.\n\nSummary:\n\n> - DOGE uses AI to monitor communications for anti-Trump sentiment, sources say\n> - DOGE’s use of Signal app raises data security and transparency concerns\n> - Musk’s DOGE team accused of bypassing vetting processes, operating in secrecy\n\nYes, ‘sources say’. This is Reuters, I can guarantee they’ve vetted those sources.",
                "I hear Signal is now an approved messaging app for discussing special plans. Maybe federal workers could look into a Signal chat group to escape DOGE's Big Brother.",
                "Very normal events happening in a very normal country.",
                "Seems like an easy win in a wrongful termination lawsuit since federal employees can't be discriminated against based on beliefs. \n\nThese guys are so dumb actually making this policy. It's the most un-American stuff ever.\n\nCan you imagine Harris doing this to conservatives? It's all the stuff they accused the democrats of doing but way worse. Remember, \"liberal hive mind\"? These Maga morons are all about projection.",
                "Someday soon grok is going to reveal itself as a mole and blow this whole thing wide open",
                "Musk is so pathetic. I've never seen a billionaire fail in nearly every aspect of life.",
                "How much is too fucking far??\n\nGoogle fucking docs for government work...\n\nMore delete-after Signal shit...\n\n“Be careful what you say, what you type and what you do,”\n\nWhat's next, thought crimes?\n\nRemember when Obama wore a tan suit??\n\nFucking christ, every single fucking day, day after day after day after day - more fucking batshit crazy looney tunes shit.\n\nGovernment loaded with cowards and on-the-take yes-men. Not enough good ones to stand up and put an end to all this shit. God fucking cursed America, if you believe in that sort of thing.\n\nFor perspective, as bad as this is, remember we're actively funding a full-scale genocide on top of all this other horseshit.\n\nNoah get the boat.",
                "Realistically, Trump+Musk now easily have access to the tools to dox every poster here."
            ],
            "aggregate_sentiment": 4.0
        },
        {
            "category": "HOT",
            "title": "Keystone Pipeline ruptures near Fort Ransom",
            "external_url": "https://www.kvrr.com/2025/04/08/keystone-pipeline-ruptures-near-fort-ransom/",
            "upvotes": 2808,
            "date": "04/08/2025",
            "thumbnail": "https://wpcdn.us-midwest-1.vip.tn-cloud.net/www.kvrr.com/content/uploads/2018/06/KEYSTONE-STILL-jpg.jpg",
            "top_comments": [
                "Literally nobody could have seen this coming /s",
                "Good thing that Republicans are okay with oil pollution, this area couldn't be more Red.",
                "This is from a story in 2012\n\n\"Even after causing more than a dozen spills in 2011 from its newest tar sands pipeline — including a six story “geyser” of crude — Canadian energy developer TransCanada claimed its planned Keystone XL pipeline would “exceed” safety standards.\n\nBut according to a new investigation of TransCanada’s development plans, the company does not plan to use advanced spill prevention technologies on a section of pipeline that would cross an underground reservoir providing nearly 30 percent of America’s irrigation water.\n\nInsideClimate Newsreported this week that TransCanada would only use standard leak detection technologies across a 19-mile stretch of the pristine Ogallala Aquifer, making bigger leaks more likely.\"\n\n  \nWe were told these pipelines were leakproof which led to the idea it doesnt need monitoring. Remember when gigantic corporations say \"Regulations are killing their buisness\" theyre saying spending money on technology to prevent problems lowers profits.",
                "Funny how the oil disasters always happens right after the price of oil goes below $60.",
                "Shutdown in two minutes is the only good thing about this.",
                "They must’ve used the same kind of glue that Tesla used to attach the body panels to the cyber truck",
                "Wow, exactly the thing protesters were saying was going to happen fucking happened",
                "This was the reason that the SCOTUS shut down this project during the first Trump term in response to multiple lawsuits regarding the danger of allowing this to run through one of the world's biggest fresh water aquifers supplying water to millions of people - a single major leak could pollute the entire aquifer.\n\nbut now SCOTUS is a division of the oil industry and the Trump Org. so drinkable water is for losers.",
                "It's not \"if\" a pipeline will leak, it's \"when.\" Americans don't care about the \"when\" as long as it's not in their backyard.",
                "Shocking how much the Keystone pipeline and it's surrounding terrain looks like the Trans-Alaska Pipeline"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "Supreme Court halts a judge’s order to reinstate federal probationary workers",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-pauses-judges-order-reinstate-federal-probationary-worke-rcna197840?taid=67f54b6f2263bc0001301365",
            "upvotes": 1407,
            "date": "04/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250324-donald-trump-ew-250p-8e2284.jpg",
            "top_comments": [
                "I can't imagine the rollercoaster these employees are going through",
                "The administration argued that the agencies made the decision to fire these employees “by themselves”, which I find strange because every single instance of these happening they say they were following either an executive order OR Trump’s agenda. Like that should have been the easiest thing to call bullshit on…",
                "FWIW they ruled here on lack of standing as this case was brought by non profit groups. There are other cases brought by the affected employees and unions that are still ongoing.",
                "What sucks is many \"probationary\" employees are just employees who have been promoted. So they aren't new, and they may actually have a lot of necessary experience. And sometimes those employees invested in themselves by paying to get certificates and degrees to make themselves better assets worthy of promotion.",
                "They're 100% going to say he can rewrite the Constitution via Executive Order.",
                "The Supreme Court of United States are there to cooperate with the terrorist Donald Trump.\n\nThat is how a mafia organization works.",
                "It’s amazing how corrupt this administration is right now.",
                "All federal workers should all go on strike. This is unacceptable. If this happened in France people would be on strike and in the streets. Americans, learn from the French. The FAA, the IRS, let the government grind to a halt and show that your work is indispensable.",
                "And now we see why McConnell was willing to shell out so much political capital to buy the supreme court",
                "Of course they do. The SCOTUS signs off on _everything_ the Trump admin does."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Ontario's measles outbreak is so big, even New York health officials are taking notice",
            "external_url": "https://www.cbc.ca/news/canada/toronto/new-york-state-department-of-health-measles-travel-advisory-ontario-1.7504085",
            "upvotes": 857,
            "date": "04/08/2025",
            "thumbnail": "https://i.cbc.ca/1.5343106.1708113693!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/measles-virus.jpg?im=Resize%3D620",
            "top_comments": [
                "This outbreak in southwestern Ontario, like the Texas outbreak, is concentrated in a very conservative group of Mennonites. It's been ongoing since October.",
                "Im going to guess that most of them are unvaccinated",
                "\"Measles can be a serious disease,' N.Y. official says\"\n\n\nWe carry computers in our pockets. Information has never been easier to access and verify.\n\n\nDumb mother fuckers always seem to find a way.",
                "Disease doesn't care about borders",
                "Hey!!! We here in the US have the market cornered on stupid, Canada!! Don’t try and steal our thunder!!",
                "We are all inter-connected.  \n\nAbolishing vaccines aid to other poor countries would affect Americans as well.",
                "Too bad you can’t tariff stupidity, which is America’s greatest export.",
                "The US still has health officials? ",
                "The fact that Ontario’s measles outbreak has drawn concern from New York health officials highlights just how interconnected our public health systems truly are. Measles is a preventable disease, and its resurgence points to dangerous gaps in vaccination coverage and public trust. This isn’t just a local issue — it’s a cross-border wake-up call for stronger immunization strategies and coordinated public health responses.",
                "So this is larger than the Texas outbreak?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "US auto tariffs apply to all computers and hard disks",
            "external_url": "https://www.heise.de/en/news/US-auto-tariffs-apply-to-all-computers-and-hard-disks-10343085.html",
            "upvotes": 2047,
            "date": "04/08/2025",
            "thumbnail": "https://heise.cloudimg.io/bound/1200x1200/q85.png-lossy-85.webp-lossy-85.foil1/_www-heise-de_/imgs/18/4/8/3/2/9/7/6/21957edc41622975ec65a255d7811fd4cddb4437e9ad70e33545c6f5fbe1d99b-2418542ff81df561-aade4c4bf327bc2a.jpeg",
            "top_comments": [
                "Majority of Americans especially Trump's voters have not yet fully realized the gravity of tariffs.\n\nTrump promised tariffs before election.  Why are people not taking him seriously?",
                "this is from a German tech-news source that digged into the tariff papers and found that HTSUS code 8471 (Computers, HDDs, Certain Hardware Comps.) is actually listed in the recently provided Automobile + Parts tariffs paper.\n\nShould this not be revised by the gov admin, any computer hardware imported to and sold in the US should raise in price pretty immediately. \n\nIf this is an oversight or deliberate intent is to be seen.\n\n**Other sources (look for number 8471):**\n\n**Included Product Categories in Automobile Tariffs**\nhttps://www.thompsonhinesmartrade.com/2025/04/annex-identifying-scope-of-automobile-and-automobile-parts-subject-to-section-232-tariffs-is-released/\n\n**HTS (Harmonized Tariff Schedule) codes**\nhttps://www.hts-code.com/code/hts_result?code=471",
                "PC Players Rise up, you're not gonna be able to say \"Buy a steam deck\" as easily as you've been saying following thr Switch 2 price reveal",
                "Any brand affected by these tariffs needs to add that in the pricing structure, just like how some stores show the tax on the price tag and the base price. It won't help everybody, but it will directly show that the tariffs are responsible for the price increase.",
                "Everything’s computer!  I love Tessler",
                "You might even say everything's... all computers.",
                "Man I am fucking *glad.* I bought my new computer back in Feb…\n\nI hate this fucking bullshit circus of a country",
                "\"Wow, everything computer!\"",
                "New update on the article backtracks and says this actually is unlikely to be true, that importers can specify on the import documents whether the computer chip is destined to be included in a car or not.",
                "Make America use floppy disks again?"
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "HOT",
            "title": "Trump administration fires senior Navy female officer at NATO. She appeared on a 'woke' list",
            "external_url": "https://apnews.com/article/pentagon-hegseth-trump-dei-chatfield-nato-23df15b59766458d106567ba782d2f15",
            "upvotes": 28827,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "*The letter said Chatfield posted supportive comments on LinkedIn about a diversity summit and gave a speech in 2015 at Women’s Equality Day. The group quoted her as saying that investing in empowering women can unlock human potential.*\n\n*And they also said she was quoted as saying, “our diversity is our strength” — a phrase that Hegseth has repeatedly condemned.*\n\n\nShe was fired for years old comments that didn't draw any ire if you are a rational adult.",
                "This is the administration blatantly being assholes in broad daylight and seemingly getting away with it. \n\nTrump and the GOP are making a mockery of this once great country.\nTheir pettiness knows no bounds, they are off the leash, shitting and pissing on everything, pandering to the MAGA weirdos and destroying any goodwill with our allies. \nHow is anyone OK with this?",
                "When this is over, they need to mount a plaque at the Pentagon with the names of all the service members that were sacrificed in the name of MAGA's woke phobia.",
                "Admiraling while female is enough to get you fired these days.",
                ">  “purging the woke from the military is imperative.”\n\n\"We need to purge the Jews\" vibes. Genuinely uncomfortable to read.",
                "I assume denounciations, false accusations by right wing influencers and grifters will slowly deplete our government and armed forces of competent employees and leaders. What could possibly go wrong?",
                "This is a wild and scary timeline! For as long as I've been working (20 years) making openly discriminatory statements would (rightfully) get you fired. Now saying you SHOULDN'T discriminate is a reason to be fired? When will \"hate quotas\" become a requirement for employment? Will people start getting fired if they DON'T  use slurs against others? Will employees have to organize group harassment initiatives against people considered \"other\"? Where is the line?",
                "Evangelicals are worried about the persecution of Christians.\n\nJesus reached out to the marginalized. He’d be considered ‘woke’.\n\nAnd woke is now being persecuted.",
                "When you look at this woman's resume and experience she's 100 times more qualified and and competent to lead than Hegseth.   So pretty much the US military if you're not a white male you get either clean the latrines, work the kitchens or get the fuck out.  Let's see how long it remains an effective fighting force.",
                "What I do not understand and probably never will is how any active or retired military can support Trump. He’s all talk. I am sure there are countless soldiers who worked with and under her that would literally go through hell for her and with her. I am also sure that many of those same people voted for Trump and would still vote for Trump. It’s sick and unbelievable that we’re this broken."
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Tariffs on China set to rise to at least 104% on Wednesday, White House says",
            "external_url": "https://edition.cnn.com/2025/04/08/business/trump-china-tariff/index.html",
            "upvotes": 612,
            "date": "04/08/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25098577604664.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Is this thread going to stay up? This has been posted a few times and keeps getting deleted. Let me ask this one more time: \n\nWhy is there no actual plan from the White House to actually spur new factories in the US? Why is the CHIP Act being dismantled? Where is the effort to actually do anything other than random tariff announcements that feel like they are being shot from the hip? If they were serious, there would be something like the CHIP act for all kinds of on-shoring manufacturing opportunities. They also need to address the US steel industry, rare earth metals (not by invading Greenland, lol), and so many other things.",
                "This is the end of my career and industry.  It's now more cost effective for us to abandon product in china than it is to import it and distribute at a massive loss.\n\nWe're all probably going to lose our jobs.",
                "* October 2024 - [Trump’s Tariffs Could Push S&P 500 Down 10% Next Year, UBS Says](https://www.forbes.com/sites/dereksaul/2024/10/10/trumps-tariffs-could-push-sp-500-down-10-next-year-ubs-says/)\n* September 2024 - [These 5 parts of the stock market are most at risk if Trump wins the election and implements wide-reaching tariffs, Barclays says](https://markets.businessinsider.com/news/stocks/trump-tariff-trade-policy-stock-market-outlook-risk-election-china-2024-9) \n* May 2024 - [Trump’s new trade war would cost middle-class families at least $1,700 a year, report warns](https://www.cnn.com/2024/05/21/business/trump-trade-war-tariffs-china/index.html)\n* December 2023 - [Tariffs Are for Losers](https://www.wsj.com/opinion/tariffs-are-for-losers-global-economy-protectionism-trade-jake-sullivan-hawley-585c4175)\n* September 2023 - [Pence trashes Trump’s tax plan, says 10% tariff would ‘increase inflation at the worst possible time’](https://www.cnbc.com/2023/09/21/pence-trashes-trump-tax-plan-says-tariffs-would-worsen-inflation.html)",
                "The fallout from this will be felt decades from now.",
                "Those MAGA hats and tshirts are going to be expensive.",
                "By mid-may the layoffs will be hitting if movement doesn't occur by then. At this point best to save as much as you can since it will be hard to say he will be effected directly, or by knock on effects as consumers cut back.",
                "Trump has to make everybody his enemy before he negotiates. He is a child.",
                "we’re at “ban all direct trade with China” territory now",
                "Mr Trump and the Republicans are hell bent of crashing the economy, increasing the prices of everything exponentially, and making the life of the working class Americans worse. Sad.",
                "Is America winning yet?"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Keystone Pipeline ruptures in North Dakota",
            "external_url": "https://apnews.com/article/keystone-oil-pipeline-north-dakota-spill-36e86142566763a5464e1dd132eede56",
            "upvotes": 58,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I wonder who could have seen this coming.  Like.....who could've known?  Why weren't there protests over this risk?",
                "Sounds like the worker who shut it down quickly should get a raise, could have been way worse."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Woman rescued from storm drain through manhole days after she was reported missing",
            "external_url": "https://abcnews.go.com/US/woman-rescued-storm-drain-manhole-days-after-reported/story?id=120592313",
            "upvotes": 56,
            "date": "04/08/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/9a281ada-692c-4e08-b4f9-671e4c66cbfa/rescue-1-abc-er-250408_1744124795855_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                ">Yafang Zhou, 59, was reported missing on April 3, according to San Diego police. She hadn't been seen since March 25, police said.\n\nIt's amazing she's alive. She's in serious condition right now.",
                "Definitely curious how she got into the storm drain but good for the fire fighters to check every manhole and eventually find her",
                "> Yafang Zhou, 59, was reported missing on April 3, according to San Diego police. She hadn't been seen since March 25, police said.\nOn Monday, officials searching for her by a hiking trail in Poway \"heard a woman’s voice coming from the area of a maintenance hole cover,\" police said.\nFirefighters, paramedics and search-and-rescue teams rushed to the scene and rescued Zhou, who was hospitalized in serious condition, police said.\n\"There were no removed manhole covers when our crews got here,\" he said. \"It is possible that she entered into the storm drain system from one of the outlets, which would naturally be open where water would flow out into the creek, or some other way.\"\n\nOmg poor woman, this sounds like a horrifying ordeal. Thank goodness someone heard her calling out and they found her in time.",
                "I am very happy that she survived ) Good things happens"
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "NEW",
            "title": "Ontario's measles outbreak is so big, even New York health officials are taking notice",
            "external_url": "https://www.cbc.ca/news/canada/toronto/new-york-state-department-of-health-measles-travel-advisory-ontario-1.7504085",
            "upvotes": 853,
            "date": "04/08/2025",
            "thumbnail": "https://i.cbc.ca/1.5343106.1708113693!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/measles-virus.jpg?im=Resize%3D620",
            "top_comments": [
                "This outbreak in southwestern Ontario, like the Texas outbreak, is concentrated in a very conservative group of Mennonites. It's been ongoing since October.",
                "Im going to guess that most of them are unvaccinated",
                "\"Measles can be a serious disease,' N.Y. official says\"\n\n\nWe carry computers in our pockets. Information has never been easier to access and verify.\n\n\nDumb mother fuckers always seem to find a way.",
                "Disease doesn't care about borders",
                "Hey!!! We here in the US have the market cornered on stupid, Canada!! Don’t try and steal our thunder!!",
                "We are all inter-connected.  \n\nAbolishing vaccines aid to other poor countries would affect Americans as well.",
                "Too bad you can’t tariff stupidity, which is America’s greatest export.",
                "The US still has health officials? ",
                "The fact that Ontario’s measles outbreak has drawn concern from New York health officials highlights just how interconnected our public health systems truly are. Measles is a preventable disease, and its resurgence points to dangerous gaps in vaccination coverage and public trust. This isn’t just a local issue — it’s a cross-border wake-up call for stronger immunization strategies and coordinated public health responses.",
                "So this is larger than the Texas outbreak?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Tariffs on China set to rise to at least 104% on Wednesday, White House says",
            "external_url": "https://edition.cnn.com/2025/04/08/business/trump-china-tariff/index.html",
            "upvotes": 616,
            "date": "04/08/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25098577604664.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Is this thread going to stay up? This has been posted a few times and keeps getting deleted. Let me ask this one more time: \n\nWhy is there no actual plan from the White House to actually spur new factories in the US? Why is the CHIP Act being dismantled? Where is the effort to actually do anything other than random tariff announcements that feel like they are being shot from the hip? If they were serious, there would be something like the CHIP act for all kinds of on-shoring manufacturing opportunities. They also need to address the US steel industry, rare earth metals (not by invading Greenland, lol), and so many other things.",
                "This is the end of my career and industry.  It's now more cost effective for us to abandon product in china than it is to import it and distribute at a massive loss.\n\nWe're all probably going to lose our jobs.",
                "* October 2024 - [Trump’s Tariffs Could Push S&P 500 Down 10% Next Year, UBS Says](https://www.forbes.com/sites/dereksaul/2024/10/10/trumps-tariffs-could-push-sp-500-down-10-next-year-ubs-says/)\n* September 2024 - [These 5 parts of the stock market are most at risk if Trump wins the election and implements wide-reaching tariffs, Barclays says](https://markets.businessinsider.com/news/stocks/trump-tariff-trade-policy-stock-market-outlook-risk-election-china-2024-9) \n* May 2024 - [Trump’s new trade war would cost middle-class families at least $1,700 a year, report warns](https://www.cnn.com/2024/05/21/business/trump-trade-war-tariffs-china/index.html)\n* December 2023 - [Tariffs Are for Losers](https://www.wsj.com/opinion/tariffs-are-for-losers-global-economy-protectionism-trade-jake-sullivan-hawley-585c4175)\n* September 2023 - [Pence trashes Trump’s tax plan, says 10% tariff would ‘increase inflation at the worst possible time’](https://www.cnbc.com/2023/09/21/pence-trashes-trump-tax-plan-says-tariffs-would-worsen-inflation.html)",
                "The fallout from this will be felt decades from now.",
                "Those MAGA hats and tshirts are going to be expensive.",
                "By mid-may the layoffs will be hitting if movement doesn't occur by then. At this point best to save as much as you can since it will be hard to say he will be effected directly, or by knock on effects as consumers cut back.",
                "Trump has to make everybody his enemy before he negotiates. He is a child.",
                "we’re at “ban all direct trade with China” territory now",
                "Mr Trump and the Republicans are hell bent of crashing the economy, increasing the prices of everything exponentially, and making the life of the working class Americans worse. Sad.",
                "Is America winning yet?"
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "NJ woman accused of trying to hire guy she met on Tinder to kill ex, his daughter",
            "external_url": "https://www.nbcnewyork.com/news/national-international/murder-for-hire-plot-nj-philly-police/6216751/",
            "upvotes": 115,
            "date": "04/08/2025",
            "thumbnail": "https://media.nbcnewyork.com/2025/04/Money-covered-in-blood.jpg?quality=85&strip=all&resize=1200%2C675",
            "top_comments": [
                ">Diiorio offered the man $12,000 to kill not just her ex, but also his 19-year-old daughter, the informant told investigators. She said she would pay the man $500 up front and the rest of the money in installments.\n\nWho pays their hitman in installments? Isn't it always half upfront and half after. Or so I've heard.",
                "So dumb to get a random guy off tinder to do it when she could have just gone to https://rentahitman.com and hired a professional.",
                "Paying an assassin in installments of $500 is bananas.",
                "I expect this behavior out of North Jersey, but for this to be a South Jersey woman is a disappoint.\n\nGet over your ex, gas up at the Wawa, grab some McMillan’s and a panzerotti (preferably from Franco’s) and move on.",
                "\"Excellent work, Agent 47. Proceed to the extraction point and sign up for Klarna.com and for a series of 4 interest-free payments.\"",
                "this headline… \n\n… “hire guy she met on tinder to”….. to kill her ex, his ex, to kill her ex who is also his daughter, or to kill his ex who is also his own daughter?\n\nJust terrible.",
                "Potential hitman sequel?",
                "So much missing from this. Smells like entrapment"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "At least 18 dead, over 120 injured in roof collapse at Dominican Republic nightclub",
            "external_url": "https://abcnews.go.com/International/wireStory/13-dead-70-injured-roof-collapse-dominican-republic-120588708",
            "upvotes": 112,
            "date": "04/08/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/4cc61642-b661-43b0-bca9-839ac3c62231/wirestory_518f9e7b7b212ce90c430139b82c4a18_16x9.jpg?w=1600",
            "top_comments": [
                "Headline already changed to 27 dead and 160 injured.",
                "Very sad to hear this. What a terrible accident.",
                "Building and fire codes are written in blood."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Cases in Texas measles outbreak surpass 500",
            "external_url": "https://abcnews.go.com/Health/measles-cases-texas-outbreak-surpass-500-24-new/story?id=120588600",
            "upvotes": 623,
            "date": "04/08/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5c0b432-75a4-415d-ba52-ce0606bcc4a2/measles-testing-sign-gty-jt-250311_1741733337889_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "This update adds 24 cases to the number of reported cases in Texas associated with the outbreak. Friday's update added 59 cases. Last Tuesday's update added 22 cases. The previous Friday’s update added 78 cases.\n\nOne new hospitalization (up to 57 from 56) was reported. Two deaths have now been reported in Texas.",
                "I firmly believe RFK has become a meat suit for his brain worm overlords, trying to get rid of dewormer and vaccines world wide, then one day, the worms will rule the mother fucking world. ",
                "Like covid, the way they will fix this is to stop publishing numbers.\n\n:(\n\nedit: trump morons, not ABC..",
                "New Mexico and Oklahoma have not yet posted updates today. Kansas, which has also had cases associated with the Texas outbreak, updates on Wednesdays.\n\nETA: Oklahoma is reporting no new cases. They only update on Tuesdays so that means none for the past week. They have had 10 cases total.\n\nETA 2: New Mexico is reporting 2 new cases. That is an increase to 56 cases from 54.\n\nETA 3: Kansas is currently at 24 cases that have been reported to be likely associated with the Texas outbreak.",
                "Amazing in the year 2025!",
                "They really need to give numbers of how many were unvaxxed with each update. Nothing proves the efficacy of vaccines more than this.",
                "Texas is now the cautionary tale for what happens when anti-vax politics override public health. Measles was *eliminated*in 2000 — and now we’re burying kids again because “freedom” apparently includes the freedom to ignore science and kill your neighbors.",
                "While I am sure we know the answer are the majority of the infected vaccinated or Unvaccinated?",
                "Darwin loves red hats!",
                "If you want to remain healthy, get every vaccine you could possibly need, especially if you’re 65 and older. Just got my second MMR shot just in case. Let the true believer anti-vaxxers learn science lessons the hard way. Stay safe, folks!"
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "NEW",
            "title": "American academic faces years in jail after being charged with insulting Thai monarchy",
            "external_url": "https://www.cnn.com/2025/04/08/asia/thailand-lese-majeste-paul-chambers-intl-hnk/index.html",
            "upvotes": 735,
            "date": "04/08/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2187484622.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "My Thai friend told me that under his predecessors, people would voluntarily stand up to honour the King\n\nThey don't do it anymore",
                "Is that the same monarch that tried to scrub the Internet of his very unflattering photo?",
                "This just makes me want to insult the Thai monarchy even more. \n\nThe Thai monarchy is so ugly, it's seven years good luck to break a mirror they looked in to.",
                "\"A prominent American academic working in Thailand could face years in jail after being charged with insulting the monarchy, in a rare case of a foreign national allegedly falling foul of the kingdom’s strict lese majeste law.\" \n\nDon't move to a place that has these kinds of laws.",
                "Why on earth would you do that? Like going to Dubai as a gay couple",
                "How long until the USA passes la majeste legislation barring criticism of Dear Leader Trump?",
                "Visited thailand this summer, locals were very careful with how they spoke about the royal family. Even if it was just the two of us with no one else in sight they would still speak in a hushed tone if saying anything even slightly critical of them. \n\nNo one tell Trump about this or he’ll try to make the same law in the US",
                "As awful as this kind of law is, it's one of those things you should be very aware of and very careful of to stay out of trouble. I don't agree with the law to be clear",
                "\"If you Come to our country, respect our culture\" folks when they leave their country, and have to respect the other country's culture",
                "Not entirely related, but my grandpa met and shook hands with the king of Thailand back in the day."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Supreme Court halts a judge’s order to reinstate federal probationary workers",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-pauses-judges-order-reinstate-federal-probationary-worke-rcna197840?taid=67f54b6f2263bc0001301365",
            "upvotes": 1402,
            "date": "04/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250324-donald-trump-ew-250p-8e2284.jpg",
            "top_comments": [
                "I can't imagine the rollercoaster these employees are going through",
                "The administration argued that the agencies made the decision to fire these employees “by themselves”, which I find strange because every single instance of these happening they say they were following either an executive order OR Trump’s agenda. Like that should have been the easiest thing to call bullshit on…",
                "FWIW they ruled here on lack of standing as this case was brought by non profit groups. There are other cases brought by the affected employees and unions that are still ongoing.",
                "What sucks is many \"probationary\" employees are just employees who have been promoted. So they aren't new, and they may actually have a lot of necessary experience. And sometimes those employees invested in themselves by paying to get certificates and degrees to make themselves better assets worthy of promotion.",
                "They're 100% going to say he can rewrite the Constitution via Executive Order.",
                "The Supreme Court of United States are there to cooperate with the terrorist Donald Trump.\n\nThat is how a mafia organization works.",
                "It’s amazing how corrupt this administration is right now.",
                "All federal workers should all go on strike. This is unacceptable. If this happened in France people would be on strike and in the streets. Americans, learn from the French. The FAA, the IRS, let the government grind to a halt and show that your work is indispensable.",
                "And now we see why McConnell was willing to shell out so much political capital to buy the supreme court",
                "Of course they do. The SCOTUS signs off on _everything_ the Trump admin does."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Keystone Pipeline ruptures near Fort Ransom",
            "external_url": "https://www.kvrr.com/2025/04/08/keystone-pipeline-ruptures-near-fort-ransom/",
            "upvotes": 2802,
            "date": "04/08/2025",
            "thumbnail": "https://wpcdn.us-midwest-1.vip.tn-cloud.net/www.kvrr.com/content/uploads/2018/06/KEYSTONE-STILL-jpg.jpg",
            "top_comments": [
                "Literally nobody could have seen this coming /s",
                "Good thing that Republicans are okay with oil pollution, this area couldn't be more Red.",
                "This is from a story in 2012\n\n\"Even after causing more than a dozen spills in 2011 from its newest tar sands pipeline — including a six story “geyser” of crude — Canadian energy developer TransCanada claimed its planned Keystone XL pipeline would “exceed” safety standards.\n\nBut according to a new investigation of TransCanada’s development plans, the company does not plan to use advanced spill prevention technologies on a section of pipeline that would cross an underground reservoir providing nearly 30 percent of America’s irrigation water.\n\nInsideClimate Newsreported this week that TransCanada would only use standard leak detection technologies across a 19-mile stretch of the pristine Ogallala Aquifer, making bigger leaks more likely.\"\n\n  \nWe were told these pipelines were leakproof which led to the idea it doesnt need monitoring. Remember when gigantic corporations say \"Regulations are killing their buisness\" theyre saying spending money on technology to prevent problems lowers profits.",
                "Funny how the oil disasters always happens right after the price of oil goes below $60.",
                "Shutdown in two minutes is the only good thing about this.",
                "They must’ve used the same kind of glue that Tesla used to attach the body panels to the cyber truck",
                "Wow, exactly the thing protesters were saying was going to happen fucking happened",
                "This was the reason that the SCOTUS shut down this project during the first Trump term in response to multiple lawsuits regarding the danger of allowing this to run through one of the world's biggest fresh water aquifers supplying water to millions of people - a single major leak could pollute the entire aquifer.\n\nbut now SCOTUS is a division of the oil industry and the Trump Org. so drinkable water is for losers.",
                "It's not \"if\" a pipeline will leak, it's \"when.\" Americans don't care about the \"when\" as long as it's not in their backyard.",
                "Shocking how much the Keystone pipeline and it's surrounding terrain looks like the Trans-Alaska Pipeline"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Ontario's measles outbreak is so big, even New York health officials are taking notice",
            "external_url": "https://www.cbc.ca/news/canada/toronto/new-york-state-department-of-health-measles-travel-advisory-ontario-1.7504085",
            "upvotes": 851,
            "date": "04/08/2025",
            "thumbnail": "https://i.cbc.ca/1.5343106.1708113693!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/measles-virus.jpg?im=Resize%3D620",
            "top_comments": [
                "This outbreak in southwestern Ontario, like the Texas outbreak, is concentrated in a very conservative group of Mennonites. It's been ongoing since October.",
                "Im going to guess that most of them are unvaccinated",
                "\"Measles can be a serious disease,' N.Y. official says\"\n\n\nWe carry computers in our pockets. Information has never been easier to access and verify.\n\n\nDumb mother fuckers always seem to find a way.",
                "Disease doesn't care about borders",
                "Hey!!! We here in the US have the market cornered on stupid, Canada!! Don’t try and steal our thunder!!",
                "We are all inter-connected.  \n\nAbolishing vaccines aid to other poor countries would affect Americans as well.",
                "Too bad you can’t tariff stupidity, which is America’s greatest export.",
                "The US still has health officials? ",
                "The fact that Ontario’s measles outbreak has drawn concern from New York health officials highlights just how interconnected our public health systems truly are. Measles is a preventable disease, and its resurgence points to dangerous gaps in vaccination coverage and public trust. This isn’t just a local issue — it’s a cross-border wake-up call for stronger immunization strategies and coordinated public health responses.",
                "So this is larger than the Texas outbreak?"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "US Justice Dept disbands crypto enforcement team, citing Trump order",
            "external_url": "https://www.reuters.com/world/us/us-justice-dept-disbands-cryptocurrency-enforcement-unit-2025-04-08/",
            "upvotes": 7104,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Can't have people looking into crypto scams when the President and his family are the ones running the crypto scams.",
                "I'm guessing the SBF pardon will be coming on Friday at around 7 PM.",
                "He certainly likes dismantling consumer protection agencies.",
                "It's things like this that will cause the Great Depression to repeat.\n\nThe SEC was created to regulate stock to ensure people didn't do stupid things to buy overpriced stock.\n\nInstead, we're going to have people spending their life savings on meme coins, only to have it get magically wiped out.\n\nCombine that with tariffs and the inevitable ecological disasters that won't be properly responded to... and you have the Great Depression.",
                "What is the point of congress anymore? Trump seems to have the power to do everything himself.",
                "Trump can't have his grifting being investigated.",
                "New trump shitcoin launching in 3… 2…",
                "\"US Justice Department disbands fraud enforcement team, citing Trump order\".",
                "You're safe to assume all crypto is a scam. \n\nIt's funny to me that the same people who want to bring back sweatshop manufacturing also push crypto.",
                "we had a crypto enforcement team? What the fuck have they been doing this whole time??"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Cases in Texas measles outbreak surpass 500",
            "external_url": "https://abcnews.go.com/Health/measles-cases-texas-outbreak-surpass-500-24-new/story?id=120588600",
            "upvotes": 625,
            "date": "04/08/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c5c0b432-75a4-415d-ba52-ce0606bcc4a2/measles-testing-sign-gty-jt-250311_1741733337889_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "This update adds 24 cases to the number of reported cases in Texas associated with the outbreak. Friday's update added 59 cases. Last Tuesday's update added 22 cases. The previous Friday’s update added 78 cases.\n\nOne new hospitalization (up to 57 from 56) was reported. Two deaths have now been reported in Texas.",
                "I firmly believe RFK has become a meat suit for his brain worm overlords, trying to get rid of dewormer and vaccines world wide, then one day, the worms will rule the mother fucking world. ",
                "Like covid, the way they will fix this is to stop publishing numbers.\n\n:(\n\nedit: trump morons, not ABC..",
                "New Mexico and Oklahoma have not yet posted updates today. Kansas, which has also had cases associated with the Texas outbreak, updates on Wednesdays.\n\nETA: Oklahoma is reporting no new cases. They only update on Tuesdays so that means none for the past week. They have had 10 cases total.\n\nETA 2: New Mexico is reporting 2 new cases. That is an increase to 56 cases from 54.\n\nETA 3: Kansas is currently at 24 cases that have been reported to be likely associated with the Texas outbreak.",
                "Amazing in the year 2025!",
                "They really need to give numbers of how many were unvaxxed with each update. Nothing proves the efficacy of vaccines more than this.",
                "Texas is now the cautionary tale for what happens when anti-vax politics override public health. Measles was *eliminated*in 2000 — and now we’re burying kids again because “freedom” apparently includes the freedom to ignore science and kill your neighbors.",
                "While I am sure we know the answer are the majority of the infected vaccinated or Unvaccinated?",
                "Darwin loves red hats!",
                "If you want to remain healthy, get every vaccine you could possibly need, especially if you’re 65 and older. Just got my second MMR shot just in case. Let the true believer anti-vaxxers learn science lessons the hard way. Stay safe, folks!"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Supreme Court halts a judge’s order to reinstate federal probationary workers",
            "external_url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-pauses-judges-order-reinstate-federal-probationary-worke-rcna197840?taid=67f54b6f2263bc0001301365",
            "upvotes": 1400,
            "date": "04/08/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250324-donald-trump-ew-250p-8e2284.jpg",
            "top_comments": [
                "I can't imagine the rollercoaster these employees are going through",
                "The administration argued that the agencies made the decision to fire these employees “by themselves”, which I find strange because every single instance of these happening they say they were following either an executive order OR Trump’s agenda. Like that should have been the easiest thing to call bullshit on…",
                "FWIW they ruled here on lack of standing as this case was brought by non profit groups. There are other cases brought by the affected employees and unions that are still ongoing.",
                "What sucks is many \"probationary\" employees are just employees who have been promoted. So they aren't new, and they may actually have a lot of necessary experience. And sometimes those employees invested in themselves by paying to get certificates and degrees to make themselves better assets worthy of promotion.",
                "They're 100% going to say he can rewrite the Constitution via Executive Order.",
                "The Supreme Court of United States are there to cooperate with the terrorist Donald Trump.\n\nThat is how a mafia organization works.",
                "It’s amazing how corrupt this administration is right now.",
                "All federal workers should all go on strike. This is unacceptable. If this happened in France people would be on strike and in the streets. Americans, learn from the French. The FAA, the IRS, let the government grind to a halt and show that your work is indispensable.",
                "And now we see why McConnell was willing to shell out so much political capital to buy the supreme court",
                "Of course they do. The SCOTUS signs off on _everything_ the Trump admin does."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Musk's DOGE using AI to snoop on U.S. federal workers, sources say",
            "external_url": "https://www.reuters.com/technology/artificial-intelligence/musks-doge-using-ai-snoop-us-federal-workers-sources-say-2025-04-08/",
            "upvotes": 5240,
            "date": "04/08/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Big Brother is watching.\n\nIsn't this exactly the kind of thing that conservatives worried about? The government monitoring you?\n\nWhat do trump supporters have to say about this? My guess is they will deny it or say if you're not doing anything wrong why worry about it.",
                "I think it goes, or at least is going to go, far beyond federal workers.\n\nhttps://www.upi.com/Voices/2025/03/06/DOGE-government-data-danger/2551741269965/",
                "This is **not** your standard company snooping to check you’re at your desk!\n\n> Trump administration officials have told some U.S. government employees that Elon Musk’s DOGE team of technologists is using artificial intelligence to **surveil at least one federal agency’s communications for hostility to President Donald Trump and his agenda**, said two people with knowledge of the matter.\n\n> At the Environmental Protection Agency, for instance, some EPA managers were told by Trump appointees that Musk’s team is **rolling out AI to monitor workers, including looking for language in communications considered hostile to Trump or Musk**, the two people said.\n\nSummary:\n\n> - DOGE uses AI to monitor communications for anti-Trump sentiment, sources say\n> - DOGE’s use of Signal app raises data security and transparency concerns\n> - Musk’s DOGE team accused of bypassing vetting processes, operating in secrecy\n\nYes, ‘sources say’. This is Reuters, I can guarantee they’ve vetted those sources.",
                "I hear Signal is now an approved messaging app for discussing special plans. Maybe federal workers could look into a Signal chat group to escape DOGE's Big Brother.",
                "Very normal events happening in a very normal country.",
                "Seems like an easy win in a wrongful termination lawsuit since federal employees can't be discriminated against based on beliefs. \n\nThese guys are so dumb actually making this policy. It's the most un-American stuff ever.\n\nCan you imagine Harris doing this to conservatives? It's all the stuff they accused the democrats of doing but way worse. Remember, \"liberal hive mind\"? These Maga morons are all about projection.",
                "Someday soon grok is going to reveal itself as a mole and blow this whole thing wide open",
                "Musk is so pathetic. I've never seen a billionaire fail in nearly every aspect of life.",
                "How much is too fucking far??\n\nGoogle fucking docs for government work...\n\nMore delete-after Signal shit...\n\n“Be careful what you say, what you type and what you do,”\n\nWhat's next, thought crimes?\n\nRemember when Obama wore a tan suit??\n\nFucking christ, every single fucking day, day after day after day after day - more fucking batshit crazy looney tunes shit.\n\nGovernment loaded with cowards and on-the-take yes-men. Not enough good ones to stand up and put an end to all this shit. God fucking cursed America, if you believe in that sort of thing.\n\nFor perspective, as bad as this is, remember we're actively funding a full-scale genocide on top of all this other horseshit.\n\nNoah get the boat.",
                "Realistically, Trump+Musk now easily have access to the tools to dox every poster here."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Tariffs on China set to rise to at least 104% on Wednesday, White House says",
            "external_url": "https://edition.cnn.com/2025/04/08/business/trump-china-tariff/index.html",
            "upvotes": 616,
            "date": "04/08/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25098577604664.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Is this thread going to stay up? This has been posted a few times and keeps getting deleted. Let me ask this one more time: \n\nWhy is there no actual plan from the White House to actually spur new factories in the US? Why is the CHIP Act being dismantled? Where is the effort to actually do anything other than random tariff announcements that feel like they are being shot from the hip? If they were serious, there would be something like the CHIP act for all kinds of on-shoring manufacturing opportunities. They also need to address the US steel industry, rare earth metals (not by invading Greenland, lol), and so many other things.",
                "This is the end of my career and industry.  It's now more cost effective for us to abandon product in china than it is to import it and distribute at a massive loss.\n\nWe're all probably going to lose our jobs.",
                "* October 2024 - [Trump’s Tariffs Could Push S&P 500 Down 10% Next Year, UBS Says](https://www.forbes.com/sites/dereksaul/2024/10/10/trumps-tariffs-could-push-sp-500-down-10-next-year-ubs-says/)\n* September 2024 - [These 5 parts of the stock market are most at risk if Trump wins the election and implements wide-reaching tariffs, Barclays says](https://markets.businessinsider.com/news/stocks/trump-tariff-trade-policy-stock-market-outlook-risk-election-china-2024-9) \n* May 2024 - [Trump’s new trade war would cost middle-class families at least $1,700 a year, report warns](https://www.cnn.com/2024/05/21/business/trump-trade-war-tariffs-china/index.html)\n* December 2023 - [Tariffs Are for Losers](https://www.wsj.com/opinion/tariffs-are-for-losers-global-economy-protectionism-trade-jake-sullivan-hawley-585c4175)\n* September 2023 - [Pence trashes Trump’s tax plan, says 10% tariff would ‘increase inflation at the worst possible time’](https://www.cnbc.com/2023/09/21/pence-trashes-trump-tax-plan-says-tariffs-would-worsen-inflation.html)",
                "The fallout from this will be felt decades from now.",
                "Those MAGA hats and tshirts are going to be expensive.",
                "By mid-may the layoffs will be hitting if movement doesn't occur by then. At this point best to save as much as you can since it will be hard to say he will be effected directly, or by knock on effects as consumers cut back.",
                "Trump has to make everybody his enemy before he negotiates. He is a child.",
                "we’re at “ban all direct trade with China” territory now",
                "Mr Trump and the Republicans are hell bent of crashing the economy, increasing the prices of everything exponentially, and making the life of the working class Americans worse. Sad.",
                "Is America winning yet?"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Brussels police arrest US State Secretary Rubio's bodyguard",
            "external_url": "https://www.brusselstimes.com/brussels/1526014/brussels-police-arrest-us-state-secretary-rubios-bodyguard-tbtb",
            "upvotes": 13130,
            "date": "04/08/2025",
            "thumbnail": "https://api.brusselstimes.com/wp-content/uploads/2025/04/ad995448-belgaimage-116320348-1024x683.jpg",
            "top_comments": [
                ">Two sources with direct knowledge of the situation told the Washington Examiner that the agent in question was \"behaving erratically\" and \"became irate\" when hotel staff refused to reopen the bar beyond its normal hours, the US media reports.\n\nAnd here I thought it was going to be about some professional disagreement that got out of hand.",
                "These guys are so used to getting away with breaking the law in the USA.\n\nThey take that mindset and ego to other places in the world and get arrested. \n\nGlad there is still integrity elsewhere.",
                "Needed some liquor at 3:00 a.m. just to live with himself.",
                "The party of “law and order” strikes again.",
                "Wait I thought Pete Hegseth ran the Pentagon not a security detail???",
                "These cavemen have a lot of trouble hearing the word NO.",
                "Violence. Rape. Alcohol. Child Porn. Tinder. Greed. Threats. Abuse. \n\nThe party of Christianity needs to stop “protecting the world from the evil libs” and start looking at what they are supporting.",
                "“I have diplomatic immunity!”\n\n>It’s just been revoked.",
                "Was this a \"merit\" hire? Because this shit show of administration keeps showing they aren't hiring the best people in the slightest.",
                "A government of the Karens, by the Karens, for the Karens.\n\n\nI *guarantee* this guy demanded to see the bar's manager."
            ],
            "aggregate_sentiment": 62.0
        },
        {
            "category": "RISING",
            "title": "Keystone Pipeline ruptures near Fort Ransom",
            "external_url": "https://www.kvrr.com/2025/04/08/keystone-pipeline-ruptures-near-fort-ransom/",
            "upvotes": 2805,
            "date": "04/08/2025",
            "thumbnail": "https://wpcdn.us-midwest-1.vip.tn-cloud.net/www.kvrr.com/content/uploads/2018/06/KEYSTONE-STILL-jpg.jpg",
            "top_comments": [
                "Literally nobody could have seen this coming /s",
                "Good thing that Republicans are okay with oil pollution, this area couldn't be more Red.",
                "This is from a story in 2012\n\n\"Even after causing more than a dozen spills in 2011 from its newest tar sands pipeline — including a six story “geyser” of crude — Canadian energy developer TransCanada claimed its planned Keystone XL pipeline would “exceed” safety standards.\n\nBut according to a new investigation of TransCanada’s development plans, the company does not plan to use advanced spill prevention technologies on a section of pipeline that would cross an underground reservoir providing nearly 30 percent of America’s irrigation water.\n\nInsideClimate Newsreported this week that TransCanada would only use standard leak detection technologies across a 19-mile stretch of the pristine Ogallala Aquifer, making bigger leaks more likely.\"\n\n  \nWe were told these pipelines were leakproof which led to the idea it doesnt need monitoring. Remember when gigantic corporations say \"Regulations are killing their buisness\" theyre saying spending money on technology to prevent problems lowers profits.",
                "Funny how the oil disasters always happens right after the price of oil goes below $60.",
                "Shutdown in two minutes is the only good thing about this.",
                "They must’ve used the same kind of glue that Tesla used to attach the body panels to the cyber truck",
                "Wow, exactly the thing protesters were saying was going to happen fucking happened",
                "This was the reason that the SCOTUS shut down this project during the first Trump term in response to multiple lawsuits regarding the danger of allowing this to run through one of the world's biggest fresh water aquifers supplying water to millions of people - a single major leak could pollute the entire aquifer.\n\nbut now SCOTUS is a division of the oil industry and the Trump Org. so drinkable water is for losers.",
                "It's not \"if\" a pipeline will leak, it's \"when.\" Americans don't care about the \"when\" as long as it's not in their backyard.",
                "Shocking how much the Keystone pipeline and it's surrounding terrain looks like the Trans-Alaska Pipeline"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "American academic faces years in jail after being charged with insulting Thai monarchy",
            "external_url": "https://www.cnn.com/2025/04/08/asia/thailand-lese-majeste-paul-chambers-intl-hnk/index.html",
            "upvotes": 735,
            "date": "04/08/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2187484622.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "My Thai friend told me that under his predecessors, people would voluntarily stand up to honour the King\n\nThey don't do it anymore",
                "Is that the same monarch that tried to scrub the Internet of his very unflattering photo?",
                "This just makes me want to insult the Thai monarchy even more. \n\nThe Thai monarchy is so ugly, it's seven years good luck to break a mirror they looked in to.",
                "\"A prominent American academic working in Thailand could face years in jail after being charged with insulting the monarchy, in a rare case of a foreign national allegedly falling foul of the kingdom’s strict lese majeste law.\" \n\nDon't move to a place that has these kinds of laws.",
                "Why on earth would you do that? Like going to Dubai as a gay couple",
                "How long until the USA passes la majeste legislation barring criticism of Dear Leader Trump?",
                "Visited thailand this summer, locals were very careful with how they spoke about the royal family. Even if it was just the two of us with no one else in sight they would still speak in a hushed tone if saying anything even slightly critical of them. \n\nNo one tell Trump about this or he’ll try to make the same law in the US",
                "As awful as this kind of law is, it's one of those things you should be very aware of and very careful of to stay out of trouble. I don't agree with the law to be clear",
                "\"If you Come to our country, respect our culture\" folks when they leave their country, and have to respect the other country's culture",
                "Not entirely related, but my grandpa met and shook hands with the king of Thailand back in the day."
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "RISING",
            "title": "US auto tariffs apply to all computers and hard disks",
            "external_url": "https://www.heise.de/en/news/US-auto-tariffs-apply-to-all-computers-and-hard-disks-10343085.html",
            "upvotes": 2051,
            "date": "04/08/2025",
            "thumbnail": "https://heise.cloudimg.io/bound/1200x1200/q85.png-lossy-85.webp-lossy-85.foil1/_www-heise-de_/imgs/18/4/8/3/2/9/7/6/21957edc41622975ec65a255d7811fd4cddb4437e9ad70e33545c6f5fbe1d99b-2418542ff81df561-aade4c4bf327bc2a.jpeg",
            "top_comments": [
                "Majority of Americans especially Trump's voters have not yet fully realized the gravity of tariffs.\n\nTrump promised tariffs before election.  Why are people not taking him seriously?",
                "this is from a German tech-news source that digged into the tariff papers and found that HTSUS code 8471 (Computers, HDDs, Certain Hardware Comps.) is actually listed in the recently provided Automobile + Parts tariffs paper.\n\nShould this not be revised by the gov admin, any computer hardware imported to and sold in the US should raise in price pretty immediately. \n\nIf this is an oversight or deliberate intent is to be seen.\n\n**Other sources (look for number 8471):**\n\n**Included Product Categories in Automobile Tariffs**\nhttps://www.thompsonhinesmartrade.com/2025/04/annex-identifying-scope-of-automobile-and-automobile-parts-subject-to-section-232-tariffs-is-released/\n\n**HTS (Harmonized Tariff Schedule) codes**\nhttps://www.hts-code.com/code/hts_result?code=471",
                "PC Players Rise up, you're not gonna be able to say \"Buy a steam deck\" as easily as you've been saying following thr Switch 2 price reveal",
                "Any brand affected by these tariffs needs to add that in the pricing structure, just like how some stores show the tax on the price tag and the base price. It won't help everybody, but it will directly show that the tariffs are responsible for the price increase.",
                "Everything’s computer!  I love Tessler",
                "You might even say everything's... all computers.",
                "Man I am fucking *glad.* I bought my new computer back in Feb…\n\nI hate this fucking bullshit circus of a country",
                "\"Wow, everything computer!\"",
                "New update on the article backtracks and says this actually is unlikely to be true, that importers can specify on the import documents whether the computer chip is destined to be included in a car or not.",
                "Make America use floppy disks again?"
            ],
            "aggregate_sentiment": 42.0
        }
    ],
    "last_updated": "04/08/2025 20:09:16 UTC"
}