{
    "posts": [
        {
            "category": "HOT",
            "title": "US deports hundreds of Venezuelans despite court order",
            "external_url": "https://www.bbc.co.uk/news/articles/cp9yv1gnzyvo",
            "upvotes": 3930,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2847/live/76fcd510-026c-11f0-a565-714eb53f108a.jpg",
            "top_comments": [
                "Time to start holding people in prison for contempt. When there are worse repercussions to the lawyers and administrators defying court orders than possibly losing their jobs, they'll stop defying them. Checks and balances, the executive can't be free to ignore the judiciary.",
                "How? I thought by avoiding shutdown the courts would still be functioning and they would stop Trump in his tracks. Schumer said so.\n\nHow can he just ignore the court orders, that's not following the rules. I guess no one could have anticipated that.",
                "Our government ultimately relies on the assumption that the POTUS will fulfill his Constitutional obligations. We do not have that now. We have a criminal.",
                "Ladies and gentlemen: the \"Party of Law and Order\", once more fully displaying that they do not, in fact, give a shit about laws.",
                "Looks like we got a good ol' fashioned constitutional crisis on our hands. Grab the pitchforks.",
                "Fine, we can't arrest the president for giving illegal order? Arrest the people that carry them out.",
                "How did they come to determine these were “gang members?”",
                "If Trump, Musk and the Administration can simply ignore the law and judges, America is in very big trouble.",
                "We didn’t deport them to Venezuela though. We paid El Salvador to imprison them in some sort of work camp super max prison site situation\n\n[bet it the range of people and dissidents exported here grows](https://x.com/nayibbukele/status/1901245427216978290?s=46)",
                "Why do we have laws? Why do we have representatives? Why do we have a government? Maybe we should dissolve the whole thing and devolve into what Haiti has become."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "At least 32 Dead as Monster Storm System Sweeps across US South with Multiple Tornadoes",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/15/massive-storm-system-south-tornado-warnings-extreme-weather",
            "upvotes": 3609,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ecb1e814a589538afde609d31570f2f6e89dcc17/0_79_1796_1078/master/1796.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e5aaf03d42cc6335c886d36342ebfe59",
            "top_comments": [
                "FEMA defunded, government officials cannot travel with $1 credit card limit, and no leadership.",
                "NOAA cut. NWS cut. FEMA cut. Tariffs on metals, wood, and other raw materials impact the cost of repairs and rebuilding. Eliminating immigrants from the labor pool so there aren't enough workers to repair and rebuild.\n\nAt least they're owning the libs.",
                "Given the nature of climate change, this is only going to get worse, much worse.",
                "It'll be that non-existent climate change up to its old tricks! I'm sure he'll blame FEMA for it and cut their funding even more.",
                "Thoughts and tariffs <3",
                "God is punishing them, amirite trumpers?",
                "Absurd how I have to go to British news sites to see any coverage of this. American news is so derelict in reporting any disasters that happen in middle America.",
                "Hey Fema start pla.....oh wait...nevermind.  Let the states figure it out. Smmfh",
                "That's very sad and the number may rise after the fact, too. I hope those injured recover and the people impacted are able to repair/rebuild. \n\nAs an aside, Republicans like to go on about the government controlling the weather. Why didn't they just turn off the tornadoes? Weird that the republican-controlled government would do this to their own people, but i doubt you'll hear about this conspiracy theory like we did last hurricane season",
                "Good thing they have FEMA……"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Judge blocks Trump from using 18th-century wartime act for deportations",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/15/trump-alien-enemies-act-deportations",
            "upvotes": 17227,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/73483f3a79cba03193f7a0a334cd26d1f4a35747/0_6_6500_3900/master/6500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=94edb165e99f97e6bdc1a4868b50cbed",
            "top_comments": [
                "Thank goodness the court still have some sway against president pushing the limit of executive action.",
                "Hope the judiciary holds  against this power grab",
                "Like he’ll listen. This country has emboldened the biggest anus on the planet to realize he really only hast to listen to himself.",
                "I'm 51, and I simply can't comprehend having that amount of anger at near 80.\n\nOnce you get to an age like mine, you really do start to understand that reacting and being spiteful is pointless. The world will carry on without you doing that just fine, better in fact.",
                "Trump is literally too stupid to know about that, so someone else has to be feeding him these insane instructions.",
                "Imagine being a born and raised “American” and you voted to destroy the country.\n\nReal Patriots used to call that Treason.",
                "Surely he won't just do it anyway.",
                "Maybe that is why he ordered our war planes to bomb sites in Yemen to get at Iranian militants? If he gets us into a war then he can do what he wants? I thought he was supposed to be the \"Peace President\".",
                "Given his age and mental decline, the court should appoint a conservator for Trump at this point.",
                "The courts have been outstanding in the last few weeks"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Nightclub fire in North Macedonia leaves 51 dead, over 100 injured",
            "external_url": "https://www.reuters.com/world/europe/fire-north-macedonia-night-club-leaves-several-dead-media-reports-say-2025-03-16/",
            "upvotes": 888,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From another article.\n\n>Interior Minister Pance Toskovski said initial reports suggested the fire started from sparks caused by pyrotechnic devices.\nSpeaking outside the Kocani police station, he said the sparks had hit the ceiling, which was made of highly flammable material.\n\nYeah that's a frightening lapse in safety, and it's sad so many people died because of it.",
                "We had something similar in Romania a few years ago. The whole thing was also a big signal for deep corruption:  https://en.wikipedia.org/wiki/Colectiv_nightclub_fire The fire started almost identically to what's in this Reuters article. A lot of people died during the crowd crush at the single smallish exit. Many others died after the fire due to injuries (burns) and infections.",
                "Not only do you have the same safety lapses as The Station, but you're called Pulse. It's like you're asking to have your patrons massacred.",
                "What a fucking mess. Rip to the victims.",
                "It is so eerie how literally the same thing happened 10 years ago in Romania, at club \"Colectiv\". Pyrotechnics, highly inflamabile ceiling, poorly managed exits. 64 people died and 146 were severely injured, countless lives and families ruined. It is the deadliest fire accident in Romanian history and one of our biggest national tragedies.\n\nhttps://en.m.wikipedia.org/wiki/Colectiv_nightclub_fire\n\nHere's a video of the moment the fire starts (warning: disturbing). https://youtu.be/t-Cgw4jj0u8\n\nThe macedonian fire looks like an exact copy of this..",
                "Based on the comments, there have been at least four deadly fires in nightclubs (before this one) that were because of indoor pyrotechnics:\n\nThe Station nightclub fire in West Warwick, Rhode Island, USA on February 20, 2003. Deaths: 100.\n\nThe Lame Horse nightclub fire in Perm, Russia, on December 5, 2009. Deaths: 156.\n\nThe Kiss nightclub fire in Rio Grande do Sul, Brazil, on January 27, 2013. Deaths: 242.\n\nThe Colectiv nightclub fire in Bucharest, Romania, on October 30, 2015. Deaths: 64.\n\nI can’t believe by now there hasn’t been a ban on using pyrotechnics inside nightclubs or other indoor concert venues. Shouldn’t every country pass legislation to prevent this? At the very least, owners of the clubs should forbid them from being used. There’s no reason for this to keep happening.",
                "The fact that people [appear to be just standing around](https://x.com/KalendarNews/status/1901168339705123143) as the place burns in it's early stages probably didn't help.",
                "Same thing happened at The Station nightclub in Rhode Island at a Great White show in 2003.  100 people died.",
                "That really reminds me of the Station Nightclub fire..."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump invokes 18th century law to declare invasion by gangs and speed deportations",
            "external_url": "https://apnews.com/article/trump-aclu-deportations-venezuelans-b2566f05b10bf1cde1caf467a3b001cc",
            "upvotes": 11832,
            "date": "03/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Trump invokes 18th century law to speed deportations, judge stalls it hours later\n\nNot sure if AP updated the headline after the initial post, but this is what the headline says now",
                "It was just broadly blocked by a judge, including the instruction to turn around planes in the air. We'll see if the administration obeys. https://bsky.app/profile/kyledcheney.bsky.social/post/3lkh7pb7zb226",
                "This is what we used to lock Japanese citizens, Germans, Italians.. Etc. During WW2.\n\n\nThe main concerns are as follows:\n\nPresumption of Membership – The order assumes that membership in TdA makes someone an \"Alien Enemy,\" but it does not specify how membership is determined. Accusations alone could lead to detention and deportation.\n\nLack of Due Process – The Alien Enemies Act does not require the government to prove an individual’s involvement in criminal activity before deportation. Historically, this law has been applied broadly during wartime with minimal legal recourse.\n\nCitizenship Risks – While the order officially applies to non-citizen Venezuelans, enforcement errors, profiling, and lack of oversight could easily result in U.S. citizens being detained if accused of association with TdA.\n\nPolitical Weaponization – The vague criteria and emergency framing could enable selective enforcement, disproportionately targeting certain immigrant communities or political opponents.\n\n\nI'm as white bread as they come, born in Nebraska. Under the statute as written, if someone really had it in for me.... Could accuse *me* of being part of TdA... And I won't even get the chance to say adios before I'm shipped to wherever the hell they decide to send me. (this is an extremely unlikely scenario, but the fact it isn't strictly hyperbole should be chilling.)",
                "This is insane,Martial law is coming next.",
                "It is a wartime law, and thus needs actual war to be occurring. \n\nWhich is why a judge has already halted it. \n\n… either Trump didn’t know it was only allowed during war - in which case he is INCREDIBLY incompetent. \n\n… OR, he did know that, and wanted to illegally enact wartime powers outside of war. I wonder where we’ve seen that before …",
                "\"There must be in-groups whom the law protects but does not bind, alongside out-groups whom the law binds but does not protect.\"\n\nI'm continually amazed at how perfectly a random blogger named Frank Wilhoit summed up the essence of the MAGA m.o.",
                "“We were American citizens. We were incarcerated by our American government in American internment camps here in the United States. The term ‘Japanese internment camp’ is both grammatically and factually incorrect.” - George Takei",
                "He can literally target ANYONE now.  All that’s required is the accusation.",
                "The law only applies to times of war, only used three times: \n\nThe War of 1812, \nWWI and WWII. \n\nThe law itself states that cannot be enacted in peacetime. \n\nOf course, who knows what this idiot can get away with?",
                "Governments usually have laws and procedures on the books that bypass normal due process but apply only to emergencies. Unjustified declaration of emergency then becomes the most obvious and the most common tool of authoritarians. Most of what Trump has done so far (for example the tariffs, which normally need to be approved by congress) has been under the excuse of emergency, which of course has been clearly ridiculous in every invocation."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Factory employee intentionally locked co-worker in room with 200-degree steam, police say",
            "external_url": "https://www.wsfa.com/2025/03/07/factory-employee-intentionally-locked-co-worker-room-with-200-degree-steam-police-say/?utm_source=taboola&utm_medium=organicclicks",
            "upvotes": 7556,
            "date": "03/15/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/QBFHQNVPRFA37NA24NAH7YD5ZA.png?auth=5e1fe91f27685964812c49d4bb709d15a2f877f78aa24ad8569672578d36ddda&width=1200&height=600&smart=true",
            "top_comments": [
                "The woman said she was able to turn it off with an emergency switch before becoming unconscious and falling to the floor.\n\nShe was taken to the hospital with injuries to her face and head, including a concussion.\n\nThank goodness she had training and knew where the emergency switch was.",
                ">She said he then turned the machine on, causing the hot steam and chemicals to spray the room.The woman said she was able to turn it off with an emergency switch before becoming unconscious and falling to the floor.\n\nWithout an emergency shut-off, this likely would have killed her. I'm amazed the charges aren't more severe. The perpetrator also seems like someone you do not want wandering around in society.",
                ">He is charged with wanton endangerment and unlawful imprisonment.\n\n\nSeems like an easy upgrade to at least attempted second degree murder.",
                "This man will hurt more women.",
                "$5 he asked her out and she said no.",
                "So, I actually work at this facility and have for several years, so I'm familiar with the operations of this room and the situation surrounding this incident.\n\nThe room is like a closet with a door at both ends. Things are loaded into it from one side, and it is started to sanitize the equipment, then unloaded from the other side.\n\nThis employee and the woman were on the unloading side of the room, with no way of visually communicating with the loading side. While this guy had no business pushing someone into that room, he doesn't have any means to start the machine from his side. The loading side had closed their door and pressed start but the unloading side door was open so it didn't start, that is until he closed it with her inside.",
                "Makes me grateful I worked at Cold Stone. I'll take a frozen death surrounded by bins of Cake Batter than be burned alive in a factory. And yes, I have experience being locked in the walk in freezer, and yes, it smells REALLY good in there until you lose your sense of smell. And this was during the salmonella scare.",
                "He's definitely an 8-9 out of 10 on the mugshot psycho scale.\n\nIf I was a betting man I'd say he's some sort of incel misogynist type. It's the look on his face knowing what he's done. Doesn't look phased by being in prison, just seems annoyed he didn't kill her.",
                "What he did is just evil.",
                "400% attempted murder like wtf else is the goal ? He tried to kill her \n\nThrow that guy into a volcano"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Long Island man is first in New York history to be cured of sickle cell anemia",
            "external_url": "https://www.cbsnews.com/newyork/news/sickle-cell-anemia-cure-new-york/?fbclid=IwZXh0bgNhZW0CMTEAAR2aGV-hO1-rSlr-x90l2eazoLzN5tB3iYCNuK2d9rJIgs0v4xASoa1S0yM_aem_y3h7BZbFRQe-q9KJ9wN-1A#5pyixb34gp5ot4bulyygwe4ghh2ajayr4",
            "upvotes": 10498,
            "date": "03/15/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/13/6d203796-7ec1-4d80-98b3-b2f128ae3517/thumbnail/1200x630/70b2cfddbcb02c6f2f8fceeb586736b3/mclogan-6p-pkg-new-sick-wcbsdan5-hi-res-still-00-01-3124.jpg?v=e7f44f50e1cf6b32bb81cbfeaec70acf",
            "top_comments": [
                "Ok, so being a biology and medicine geek, this is super interesting, not to mention an incredible moment for humanity. But I was confused reading the article why they called this a cure. Before I read it I assumed CRISPR or a similar gene therapy would had been used. I was correct, but the article really didn't mention that. \n\nHere's the technology they used. \n\n\n\"Lyfgenia is a personalized gene therapy that uses the patient's own blood-forming stem cells. These cells are modified in the laboratory to contain a healthy copy of the beta-globin gene, which is responsible for producing sickle hemoglobin. The modified cells are then infused back into the patient, where they establish themselves in the bone marrow and produce healthy hemoglobin. This helps to reduce or eliminate the production of sickle hemoglobin, which is the underlying cause of SCD.\"",
                "This is why medical research should be funded\n\nbut we know how that’s going",
                "Sickle cell is fucking awful and this is amazing. I hope this treatment becomes widely available. And by “available” I mean actually available both physically and financially.",
                "The article title is kind of mostly false.\n\nHe’s the first to be cured with gene therapy. I don’t know, but I’m pretty sure that someone with sickle cell disease has gotten a bone marrow transplant in New York before. The only article I can find is a [Rochester woman](https://www.wxxinews.org/local-news/2024-11-14/bone-marrow-transplant-gives-rochester-woman-with-sickle-cell-a-new-life), so technically he still might be the first man.",
                "Finally some good news. I’m sick of the doom and gloom",
                "Now this is the kind of news we should be hearing about!",
                "Actually made me cry. Meeting young kids with this while working in a hospital was devastating. Now there’s hope for them.",
                "Finally, a positive news article! This is huge!",
                "now that is some good news",
                "2pac is rolling in his grave."
            ],
            "aggregate_sentiment": 95.0
        },
        {
            "category": "HOT",
            "title": "Teacher ordered to remove signs from classroom, including one saying 'Everyone is welcome here'",
            "external_url": "https://www.nbcnews.com/news/us-news/teacher-ordered-remove-signs-classroom-rcna196582",
            "upvotes": 41599,
            "date": "03/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/everyone-is-welcome-here-idaho-mc-1x1-250314-copy-b9fd8e.jpg",
            "top_comments": [
                ">An Idaho teacher is in a standoff with her own school district after officials ordered her to remove classroom signs, including one that reads, “Everyone is welcome here.” \n\n>Sarah Inama, a sixth-grade history teacher at Lewis and Clark Middle School in Meridian, Idaho, says she won’t comply with the order, arguing that the message is a fundamental part to ensuring a positive learning environment for her students.\n\n>Inama, who has taught at the school for five years, says her commitment to inclusivity isn’t about politics. It’s about her passion for education and students.\n\n>“I love the area that I teach,” she says in an interview with TODAY.com. “It’s really a valuable thing for people to know our human history, things that humans have accomplished, our time on this earth, things that they’ve overcome, patterns that exist.”\n\n>Five years ago, when she first put up the two signs, it was to make sure students knew they were in an open and welcoming space. Now, she says she is risking her job in the name of those values.\n\n>Inama says the controversy began in January when her principal and vice principal came to her classroom to inform her that two posters on her walls were controversial and needed to be removed, a detail the district verified in an email to TODAY.com. Inama says other teachers were given similar instruction, but she was caught off guard by the directive.\n\nGood for her for refusing to back down from the \"controversial\" view that *Everyone is welcome here.*",
                "She should call them out on it: \"Provide a list of who isn't welcome, and I'll consider amending the sign\"",
                "Her decorations seem pretty benign and somewhat “content-neutral”\n\nI guess it’s now controversial and innapropriate to state that all people are equal? Administration should clearly define why the given decoration goes against their policy in detail…",
                "those officials are such grim people. it speaks to the wider regime in the current day but for this instance, I would jot what my kids in that district ",
                "Take the sign down. Bring it to the next school board meeting. Lay it down on the table in front of them, and then calmly and simply ask, “Please point to the hands that are not welcome here.”\n\nDon’t leave until each board member gets a chance to participate.",
                "My kids go to this school and we are all very upset. She's a great teacher. They asked me, of their own accord, to make them t-shirts to wear next week saying \"Am I welcome here?\" So that's going to happen.",
                "Change it to “everyone but Nazis” and see if that works better.",
                "There is zero defensible position with the school district's mandate. The teacher's sign only echoes their official policy of inclusion and respect, so either they're lying (they don't actually believe everyone deserves respect and/or inclusion), or they're just suppressing individual speech. There's zero wiggle room here.\n\n\nMy opinion? My guess is they're lying. We know very well that Jim Crow, segregation, and the KKK were the official responses to emancipation. They were legislated into the closet, forced to use dog whistles. Now they're getting comfy and coming back out.\n\n\n\"Red and yellow, black and white, they are precious in his sight. Jesus loves the little children of the world.\" Haven't heard this song since my childhood, seems about time to revive it. You have to fight these kooks with their own values.",
                "They're acting like this a big deal, but letting her stay the rest of the school year - they know they're wrong and they just need a teacher in that classroom. She is right to stand up to them and keep her sign, it's a beautiful message.\n\nhttps://www.westada.org/o/lcms/page/contact-us",
                "I fucking hate sharing a Country with Republikkkans."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Olympic boxing gender row a result of Russian fake news, says IOC chief | Olympic Games",
            "external_url": "https://www.theguardian.com/sport/2025/mar/15/olympic-boxing-transgender-russian-fake-news-thomas-bach",
            "upvotes": 674,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a05e39a7d9ec3658b41efd8c7282d6b7a47d1c68/597_749_6956_4173/master/6956.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=6d374ca1c5ed9ea414f8bc2d47eb893a",
            "top_comments": [
                "yea, no shit. Russia and the IBA are intertwined and the IBA is still pissed they lost control over the Olympics. Of course they were gonna start shit. And now that World Boxing is taking over, we can expect Russia and the IBA to start fake news crap with them too.\n\nThe Imane Khelif thing was especially bullshit when women who had fought her (Amy Broadhurst, Kellie Harrington) not only defeated her in matches but also supported her and said she didn't fight any differently from any other woman. But nobody listened to them or cared to watch those matches that showed it was just a regular female boxer fighting just like every other female boxer.",
                "It may have started from russia but let's not shove under a rug the deplorable contributions of right wing pundits from the west like JK Rowling or american media, they are just as guilty for peddling this.",
                "The hysteria surrounding transgender people in sports is so ridiculous. A bunch of gray haired politicians are bitching about rights and fairness for athletes and the purity of the sport! \n\nIt’s weird how the athletes aren’t up in arms about this. Almost like it’s not a real problem.",
                "Cool. So is Piers Morgan going to retract all previous accusations that he spent months hammering his panelists about? Or should Imane just sue him for half his net worth in a defamation suit?",
                "You mean JK Rowling and other TERFs were wrong ***yet again***!? Such a surprise!",
                "Of course it was and came out of Russia.\n\n\nRussia has been playing the American public on both thr right and left since Trump came on scene. \n\n\nBut republicans politicians are perfectly fine with using that Russian propaganda to fuck I've America as long as they get power. ",
                "Noooo, I'm sooooo surprised. Whoooo could have seen this coming. I deserve an Olympic Gold Medal in Being Bamboozled I guess.",
                "No shit. The IOC never entertained any of this anyway.",
                "What happened to those lawsuits Imane Khelif claimed she was going to start against all the people spreading that bullshit about her?",
                "The whole “deflecting from our own serious systemic racism and transphobia by blaming spooky ex-commies” is getting really old."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Arlington Cemetery strips content on black and female veterans from website",
            "external_url": "https://www.bbc.com/news/articles/cz03gjnxe25o",
            "upvotes": 10846,
            "date": "03/15/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/1a32/live/523070a0-01b5-11f0-8027-b77ec2a48801.jpg",
            "top_comments": [
                "What does this accomplish?",
                "they even removed all mention of general colin powell, the first black man to become chairman of the joint chiefs of staff and is buried there!",
                "I guess nobody is processing that it cost more money to remove shit like this than, you know, averting your fking eyes.",
                "Will that make groceries cheaper or should I wait until tomorrow?",
                "#Vanishing History: Arlington Cemetery Erases Stories of Black and Female Veterans\n\nSomething strange is happening at Arlington National Cemetery. The sprawling burial ground, where hundreds of thousands of American veterans rest, has quietly erased large chunks of its history from public view. Information about black, Hispanic and female service members, once readily available on its website, has vanished. The pages once told the stories of men and women who broke barriers and gave their all for a country that did not always give back. Now, with a few clicks, they are simply gone.\n\nThe move is part of President Donald Trump's sweeping effort to rid the US military and federal government of diversity, equity and inclusion policies. His administration has been swift in shutting down initiatives that highlight the contributions of minority groups, and Arlington has not been spared.\n\nVisitors looking for details about notable graves have run into dead ends. The pages once dedicated to figures such as General Colin Powell, the first black chairman of the Joint Chiefs of Staff, and the legendary Tuskegee Airmen, the country's first black military pilots, have disappeared. The same goes for Hector Santa Anna, a World War II hero and decorated bomber pilot. Even broader categories of history have been stripped away. Sections on African American, Hispanic and Women's history are no longer easily accessible from the main site.\n\nOfficially, Arlington insists it is working to restore some of the missing content, though it also says it wants to ensure everything aligns with Trump's executive orders and the policies of Defence Secretary Pete Hegseth. Hegseth, a former Fox News host and military veteran, has been vocal about his desire to root out what he calls “woke” culture from the armed forces. He was instrumental in removing General CQ Brown, the first black chairman of the Joint Chiefs of Staff, who had supported diversity efforts.\n\nThe backlash has already begun. Representative Adam Smith, a senior Democrat on the House Armed Services Committee, called the situation “deeply concerning” and suggested there was never a problem with diversity in the military to begin with. Earlier this year, a similar attempt to remove training materials on the Tuskegee Airmen sparked national outrage, forcing the Pentagon to reverse course.\n\nThe US military today is a complex institution, with more than two million people serving in active duty or reserves. A significant portion of them come from minority backgrounds. Thirty per cent identify as black, Native American or other underrepresented groups, while nearly one-fifth are women. The stories now missing from Arlington's website belong to people who paved the way for them.\n\nHistory cannot be deleted as easily as a webpage. The soldiers buried at Arlington, no matter their background, are not just names etched into headstones. They were real people who lived, fought and sacrificed. Whether or not their stories remain in an online archive, their contributions cannot be erased. But the question remains, why is their history being buried once again?",
                "Will Arlington now start digging up non-white and non-male graves?",
                "Elect white supremacists, and they're gonna do shit like this. \n\nThis is just the beginning.",
                "And the MAGA folks get so personally offended when you point out that bigotry and racism are defining characteristics of their movement... \\*facepalm\\*",
                "Dishonouring the dead this way is a new low even for them. These people fought and died for their country.",
                "I didn’t realize you could be dead and be a DEI hire. But seriously, as a veteran (who didn’t vote for this shit stain), I am so fucking pissed at all of this. I grew up hyper conservative. It was my experience in the military that exposed me to different people and cultures. I was able to see people for who they were, not what my upbringing said they were. Diversity in the military is its best asset. And these fuckers are destroying it all, not to mention our fucking country."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "US deports hundreds of Venezuelans despite court order",
            "external_url": "https://www.bbc.co.uk/news/articles/cp9yv1gnzyvo",
            "upvotes": 3938,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2847/live/76fcd510-026c-11f0-a565-714eb53f108a.jpg",
            "top_comments": [
                "Time to start holding people in prison for contempt. When there are worse repercussions to the lawyers and administrators defying court orders than possibly losing their jobs, they'll stop defying them. Checks and balances, the executive can't be free to ignore the judiciary.",
                "How? I thought by avoiding shutdown the courts would still be functioning and they would stop Trump in his tracks. Schumer said so.\n\nHow can he just ignore the court orders, that's not following the rules. I guess no one could have anticipated that.",
                "Our government ultimately relies on the assumption that the POTUS will fulfill his Constitutional obligations. We do not have that now. We have a criminal.",
                "Ladies and gentlemen: the \"Party of Law and Order\", once more fully displaying that they do not, in fact, give a shit about laws.",
                "Looks like we got a good ol' fashioned constitutional crisis on our hands. Grab the pitchforks.",
                "Fine, we can't arrest the president for giving illegal order? Arrest the people that carry them out.",
                "How did they come to determine these were “gang members?”",
                "If Trump, Musk and the Administration can simply ignore the law and judges, America is in very big trouble.",
                "We didn’t deport them to Venezuela though. We paid El Salvador to imprison them in some sort of work camp super max prison site situation\n\n[bet it the range of people and dissidents exported here grows](https://x.com/nayibbukele/status/1901245427216978290?s=46)",
                "Why do we have laws? Why do we have representatives? Why do we have a government? Maybe we should dissolve the whole thing and devolve into what Haiti has become."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Fredericksburg Fire Today: Massive Blaze Engulfs Thousands of Acres",
            "external_url": "https://luxlira.com/world-news/fredericksburg-fire-today-massive-blaze-engulfs-thousands-of-acres/",
            "upvotes": 154,
            "date": "03/16/2025",
            "thumbnail": "https://luxlira.com/wp-content/uploads/2025/03/Fredericksburg-Fire-Today.png",
            "top_comments": [
                "Did they forget to rake the forest?",
                "Fredericksburg, Texas\n\n “A large grass fire, which started yesterday near Fredericksburg, Texas, continues to burn today, having already spread to over 8,600 acres. The Fredericksburg fire today, known as the Crabapple Fire, has led to the evacuation of dozens of homes and the closure of key roads as firefighters from across the region work tirelessly to gain control of the situation. This article provides the latest updates on the ongoing blaze.”",
                "Just turn on the ocean, problem solved",
                "No Canadian bucket planes or Mexican firefighters for you.",
                "Gonna burn those measles out of existence",
                "Have trump open your faucet, ya dummies.",
                "Can’t believe auntyfua would do this ",
                "It's almost like Al Gore was right...",
                "That sucks.\n\nGood luck since they want to be separated from the US and don’t want any socialism money or help from the government.",
                "What if we drop a nuke on the fire?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Ordnance from Syria's 13-year conflict explodes in port city, killing at least 16 people",
            "external_url": "https://apnews.com/article/syria-lattakia-ordnance-explosion-mines-white-helmets-84bdc4b9d11ea38d662829cf3259eb39",
            "upvotes": 114,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Unfortunately this is going to continue for a long time. Germany still finds unexploded bombs from WW2.",
                "Why were they storing bombs on the ground floor of a 4 story building?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Nightclub fire in North Macedonia leaves 51 dead, over 100 injured",
            "external_url": "https://www.reuters.com/world/europe/fire-north-macedonia-night-club-leaves-several-dead-media-reports-say-2025-03-16/",
            "upvotes": 890,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From another article.\n\n>Interior Minister Pance Toskovski said initial reports suggested the fire started from sparks caused by pyrotechnic devices.\nSpeaking outside the Kocani police station, he said the sparks had hit the ceiling, which was made of highly flammable material.\n\nYeah that's a frightening lapse in safety, and it's sad so many people died because of it.",
                "We had something similar in Romania a few years ago. The whole thing was also a big signal for deep corruption:  https://en.wikipedia.org/wiki/Colectiv_nightclub_fire The fire started almost identically to what's in this Reuters article. A lot of people died during the crowd crush at the single smallish exit. Many others died after the fire due to injuries (burns) and infections.",
                "Not only do you have the same safety lapses as The Station, but you're called Pulse. It's like you're asking to have your patrons massacred.",
                "What a fucking mess. Rip to the victims.",
                "It is so eerie how literally the same thing happened 10 years ago in Romania, at club \"Colectiv\". Pyrotechnics, highly inflamabile ceiling, poorly managed exits. 64 people died and 146 were severely injured, countless lives and families ruined. It is the deadliest fire accident in Romanian history and one of our biggest national tragedies.\n\nhttps://en.m.wikipedia.org/wiki/Colectiv_nightclub_fire\n\nHere's a video of the moment the fire starts (warning: disturbing). https://youtu.be/t-Cgw4jj0u8\n\nThe macedonian fire looks like an exact copy of this..",
                "Based on the comments, there have been at least four deadly fires in nightclubs (before this one) that were because of indoor pyrotechnics:\n\nThe Station nightclub fire in West Warwick, Rhode Island, USA on February 20, 2003. Deaths: 100.\n\nThe Lame Horse nightclub fire in Perm, Russia, on December 5, 2009. Deaths: 156.\n\nThe Kiss nightclub fire in Rio Grande do Sul, Brazil, on January 27, 2013. Deaths: 242.\n\nThe Colectiv nightclub fire in Bucharest, Romania, on October 30, 2015. Deaths: 64.\n\nI can’t believe by now there hasn’t been a ban on using pyrotechnics inside nightclubs or other indoor concert venues. Shouldn’t every country pass legislation to prevent this? At the very least, owners of the clubs should forbid them from being used. There’s no reason for this to keep happening.",
                "The fact that people [appear to be just standing around](https://x.com/KalendarNews/status/1901168339705123143) as the place burns in it's early stages probably didn't help.",
                "Same thing happened at The Station nightclub in Rhode Island at a Great White show in 2003.  100 people died.",
                "That really reminds me of the Station Nightclub fire..."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Olympic boxing gender row a result of Russian fake news, says IOC chief | Olympic Games",
            "external_url": "https://www.theguardian.com/sport/2025/mar/15/olympic-boxing-transgender-russian-fake-news-thomas-bach",
            "upvotes": 673,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a05e39a7d9ec3658b41efd8c7282d6b7a47d1c68/597_749_6956_4173/master/6956.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=6d374ca1c5ed9ea414f8bc2d47eb893a",
            "top_comments": [
                "yea, no shit. Russia and the IBA are intertwined and the IBA is still pissed they lost control over the Olympics. Of course they were gonna start shit. And now that World Boxing is taking over, we can expect Russia and the IBA to start fake news crap with them too.\n\nThe Imane Khelif thing was especially bullshit when women who had fought her (Amy Broadhurst, Kellie Harrington) not only defeated her in matches but also supported her and said she didn't fight any differently from any other woman. But nobody listened to them or cared to watch those matches that showed it was just a regular female boxer fighting just like every other female boxer.",
                "It may have started from russia but let's not shove under a rug the deplorable contributions of right wing pundits from the west like JK Rowling or american media, they are just as guilty for peddling this.",
                "The hysteria surrounding transgender people in sports is so ridiculous. A bunch of gray haired politicians are bitching about rights and fairness for athletes and the purity of the sport! \n\nIt’s weird how the athletes aren’t up in arms about this. Almost like it’s not a real problem.",
                "Cool. So is Piers Morgan going to retract all previous accusations that he spent months hammering his panelists about? Or should Imane just sue him for half his net worth in a defamation suit?",
                "You mean JK Rowling and other TERFs were wrong ***yet again***!? Such a surprise!",
                "Of course it was and came out of Russia.\n\n\nRussia has been playing the American public on both thr right and left since Trump came on scene. \n\n\nBut republicans politicians are perfectly fine with using that Russian propaganda to fuck I've America as long as they get power. ",
                "Noooo, I'm sooooo surprised. Whoooo could have seen this coming. I deserve an Olympic Gold Medal in Being Bamboozled I guess.",
                "No shit. The IOC never entertained any of this anyway.",
                "What happened to those lawsuits Imane Khelif claimed she was going to start against all the people spreading that bullshit about her?",
                "The whole “deflecting from our own serious systemic racism and transphobia by blaming spooky ex-commies” is getting really old."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "At least 32 Dead as Monster Storm System Sweeps across US South with Multiple Tornadoes",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/15/massive-storm-system-south-tornado-warnings-extreme-weather",
            "upvotes": 3610,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ecb1e814a589538afde609d31570f2f6e89dcc17/0_79_1796_1078/master/1796.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e5aaf03d42cc6335c886d36342ebfe59",
            "top_comments": [
                "FEMA defunded, government officials cannot travel with $1 credit card limit, and no leadership.",
                "NOAA cut. NWS cut. FEMA cut. Tariffs on metals, wood, and other raw materials impact the cost of repairs and rebuilding. Eliminating immigrants from the labor pool so there aren't enough workers to repair and rebuild.\n\nAt least they're owning the libs.",
                "Given the nature of climate change, this is only going to get worse, much worse.",
                "It'll be that non-existent climate change up to its old tricks! I'm sure he'll blame FEMA for it and cut their funding even more.",
                "Thoughts and tariffs <3",
                "God is punishing them, amirite trumpers?",
                "Absurd how I have to go to British news sites to see any coverage of this. American news is so derelict in reporting any disasters that happen in middle America.",
                "Hey Fema start pla.....oh wait...nevermind.  Let the states figure it out. Smmfh",
                "That's very sad and the number may rise after the fact, too. I hope those injured recover and the people impacted are able to repair/rebuild. \n\nAs an aside, Republicans like to go on about the government controlling the weather. Why didn't they just turn off the tornadoes? Weird that the republican-controlled government would do this to their own people, but i doubt you'll hear about this conspiracy theory like we did last hurricane season",
                "Good thing they have FEMA……"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "'Stateless overnight': Authoritarian crackdown strips 42,000 Kuwaitis of nationality",
            "external_url": "https://www.france24.com/en/middle-east/20250315-an-authoritarian-shift-in-kuwait-stripps-42-000-citizens-of-their-nationality",
            "upvotes": 1189,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "We won’t recognize the world in another year.",
                "Looks like things are going the same way as for 100 years ago, possibly accelerated by 10.",
                "Everyone seems to be using this opportunity to commit human rights abuses. Knowing the US won’t care for at least the next 4 years.",
                "Trump: Write that down, write that down!",
                "This is type of power monarchs rule and it’s inhumane",
                "US hegemony is becoming more overt to make up for the fact that it is weakening. As we move towards a multipolar world, this period of uncertainty until the new order is settled will present opportunities for simmering rivalries to be decided by mass violence. Regimes all over the world will take part and many will respond with repression to handle the increased instability.",
                "So basically what Mr Trump wants to do here in America to his political opponents and immigrants. I see he gets his ideas from the best sources.",
                "For clarification: this has nothing to do with the US orange entity.",
                "So should I not criticize Kuwait for this? I don’t want the Trump administration labeling me as being anti Arab or anti Muslim. Oh wait, I forgot, that’s only reserved for one special country.",
                "Pretty immoral to make people stateless but I can’t say I’m surprised."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "New contraceptive pill, endometriosis treatment and IVF drug to become cheaper with women's health funding",
            "external_url": "https://www.abc.net.au/news/2025-03-15/more-contraceptive-endometriosis-ivf-pbs-drugs-funding-announced/105056560",
            "upvotes": 1431,
            "date": "03/16/2025",
            "thumbnail": "https://live-production.wcms.abc-cdn.net.au/01f9419fb6bb07d8c71349abf84e77c3?impolicy=wcms_watermark_news&cropH=448&cropW=796&xPos=80&yPos=0&width=862&height=485&imformat=generic",
            "top_comments": [
                "In an ABC news article??? Oh, an ABC.AU article.  That makes more sense.",
                "Annoyingly, Reddit AI flared this as “US News”. \n\nIt’s Australian",
                "This is what happens in those horrible evil socialist health systems that non-U.S. countries flagrantly indulge in. /s",
                "You almost made me hopeful for the U.S.  \n\nMy wife and I had to do IVF for our first (born last Summer) since I’m sterile. It cost over $30K even with insurance (though I think part of that included a failed sperm retrieval from me as well as buying donor sperm). \n\nAs much as I’m looking forward to number two, I dread how much this go around will be.",
                "i clicked on the story skeptical….and i was right. not the US. but i am happy for you aussie ladies.",
                "Australia is also working on adding more ADHD drugs to the PBS for patients diagnosed in adulthood. Those patients can currently only access Dex, Vyvanse and Ritalin LA on PBS, with no non-stimulant options - even if stimulants are contraindicated for them. Dex has been a very recent addition. \n\nIt reflects the old idea that ADHD can only be diagnosed in childhood and ignores the fact that it’s possible for a diagnosis to be overlooked - mine was put down to anxiety and similar things for decades. It means many adults who cannot use stimulants end up relying on the antihypertensive clonidine, which is still helpful but not as suitable as actual ADHD non-stimulants. \n\nMany of these drugs are not exorbitantly priced, but putting them on PBS helps people with disabilities, a group with more challenges to employment and earning potential, afford the medication they need to function more.",
                "Isn’t that DEI (/s) sadly. \n\nAmerica funds women’s health? \n\nThey talk about women’s health? \n\nThey know it exists? \n\nOh… not the US. Makes total sense.",
                "I just knew this wasn’t in the uSA",
                "When ever I see an article about the PBS I always say “what is coming off the PBS” as there always remove something.",
                "No way there is \n\nWomen’s Health and Funding\n\nin the USA"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Judge blocks Trump from using 18th-century wartime act for deportations",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/15/trump-alien-enemies-act-deportations",
            "upvotes": 17231,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/73483f3a79cba03193f7a0a334cd26d1f4a35747/0_6_6500_3900/master/6500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=94edb165e99f97e6bdc1a4868b50cbed",
            "top_comments": [
                "Thank goodness the court still have some sway against president pushing the limit of executive action.",
                "Hope the judiciary holds  against this power grab",
                "Like he’ll listen. This country has emboldened the biggest anus on the planet to realize he really only hast to listen to himself.",
                "I'm 51, and I simply can't comprehend having that amount of anger at near 80.\n\nOnce you get to an age like mine, you really do start to understand that reacting and being spiteful is pointless. The world will carry on without you doing that just fine, better in fact.",
                "Trump is literally too stupid to know about that, so someone else has to be feeding him these insane instructions.",
                "Imagine being a born and raised “American” and you voted to destroy the country.\n\nReal Patriots used to call that Treason.",
                "Surely he won't just do it anyway.",
                "Maybe that is why he ordered our war planes to bomb sites in Yemen to get at Iranian militants? If he gets us into a war then he can do what he wants? I thought he was supposed to be the \"Peace President\".",
                "Given his age and mental decline, the court should appoint a conservator for Trump at this point.",
                "The courts have been outstanding in the last few weeks"
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Locals describe destruction after tornadoes death toll rises to 20",
            "external_url": "https://www.bbc.com/news/live/crlx47dy0let",
            "upvotes": 808,
            "date": "03/15/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7dd4/live/a8da5410-01e3-11f0-a8b1-950887ddc6e5.jpg",
            "top_comments": [
                "I thought firing NOAA staff, privatizing weather reporting, and deleting any words relating to climate disasters would stop all this kind of destruction!!\n\n/s/",
                "We have to get up to the minute reporting from BBC News... 🤦‍♂️",
                "If only there was some kind of Federal Emergency Management Agency that could be called upon in times like these to help organize and effectively respond to these crises.",
                "I wonder what all the people that were suggesting the hurricanes and storms last fall were the result of weather manipulation by the government are thinking now.   Under trump  are these still manmade storms steamrolling the US?",
                "Sorry for the destruction folks but our dear leader is busy waging wars on our own people. You'll have to pull up the bootstraps.",
                "Don't republicans control the government space lasers now?  Why would they do such a thing?",
                "All the sarcasm is valid, but I cant do it when people have died. The people that turned on FEMA in North Carolina were brainwashed, sickened by the same venomous vitriol, just from the other side, and slinging it from this side will only deepen the misguided anger. The thing that's really really concerning is that in the next couple of years there is almost guaranteed to be catastrophic unimaginable loss of life due to weather disasters, and this fucking propaganda about the left or the right did it is only going to get worse. Depending on where it happens the other 'side' will point and laugh, but when it happens in the red states it will be far worse, as those states are already essentially federal welfare states and the feds are cutting of what little lifeline they had. If we're not united as a country anymore, ok fine, then we need to redraw the borders, but if we still are we need to be there to help our neighbors when this happens because apparently our government isn't able or willing to anymore.",
                "Didn't the president promise to control the weather if he was elected? /s",
                "Thoughts and tariffs buddy",
                "Those pictures of the trailer park in Poplar Bluff....ooof....I can't even imagine not having a basement and just riding it out like that."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "US deports hundreds of Venezuelans despite court order",
            "external_url": "https://www.bbc.co.uk/news/articles/cp9yv1gnzyvo",
            "upvotes": 3936,
            "date": "03/16/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2847/live/76fcd510-026c-11f0-a565-714eb53f108a.jpg",
            "top_comments": [
                "Time to start holding people in prison for contempt. When there are worse repercussions to the lawyers and administrators defying court orders than possibly losing their jobs, they'll stop defying them. Checks and balances, the executive can't be free to ignore the judiciary.",
                "How? I thought by avoiding shutdown the courts would still be functioning and they would stop Trump in his tracks. Schumer said so.\n\nHow can he just ignore the court orders, that's not following the rules. I guess no one could have anticipated that.",
                "Our government ultimately relies on the assumption that the POTUS will fulfill his Constitutional obligations. We do not have that now. We have a criminal.",
                "Ladies and gentlemen: the \"Party of Law and Order\", once more fully displaying that they do not, in fact, give a shit about laws.",
                "Looks like we got a good ol' fashioned constitutional crisis on our hands. Grab the pitchforks.",
                "Fine, we can't arrest the president for giving illegal order? Arrest the people that carry them out.",
                "How did they come to determine these were “gang members?”",
                "If Trump, Musk and the Administration can simply ignore the law and judges, America is in very big trouble.",
                "We didn’t deport them to Venezuela though. We paid El Salvador to imprison them in some sort of work camp super max prison site situation\n\n[bet it the range of people and dissidents exported here grows](https://x.com/nayibbukele/status/1901245427216978290?s=46)",
                "Why do we have laws? Why do we have representatives? Why do we have a government? Maybe we should dissolve the whole thing and devolve into what Haiti has become."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Olympic boxing gender row a result of Russian fake news, says IOC chief | Olympic Games",
            "external_url": "https://www.theguardian.com/sport/2025/mar/15/olympic-boxing-transgender-russian-fake-news-thomas-bach",
            "upvotes": 669,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/a05e39a7d9ec3658b41efd8c7282d6b7a47d1c68/597_749_6956_4173/master/6956.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=6d374ca1c5ed9ea414f8bc2d47eb893a",
            "top_comments": [
                "yea, no shit. Russia and the IBA are intertwined and the IBA is still pissed they lost control over the Olympics. Of course they were gonna start shit. And now that World Boxing is taking over, we can expect Russia and the IBA to start fake news crap with them too.\n\nThe Imane Khelif thing was especially bullshit when women who had fought her (Amy Broadhurst, Kellie Harrington) not only defeated her in matches but also supported her and said she didn't fight any differently from any other woman. But nobody listened to them or cared to watch those matches that showed it was just a regular female boxer fighting just like every other female boxer.",
                "It may have started from russia but let's not shove under a rug the deplorable contributions of right wing pundits from the west like JK Rowling or american media, they are just as guilty for peddling this.",
                "The hysteria surrounding transgender people in sports is so ridiculous. A bunch of gray haired politicians are bitching about rights and fairness for athletes and the purity of the sport! \n\nIt’s weird how the athletes aren’t up in arms about this. Almost like it’s not a real problem.",
                "Cool. So is Piers Morgan going to retract all previous accusations that he spent months hammering his panelists about? Or should Imane just sue him for half his net worth in a defamation suit?",
                "You mean JK Rowling and other TERFs were wrong ***yet again***!? Such a surprise!",
                "Of course it was and came out of Russia.\n\n\nRussia has been playing the American public on both thr right and left since Trump came on scene. \n\n\nBut republicans politicians are perfectly fine with using that Russian propaganda to fuck I've America as long as they get power. ",
                "Noooo, I'm sooooo surprised. Whoooo could have seen this coming. I deserve an Olympic Gold Medal in Being Bamboozled I guess.",
                "No shit. The IOC never entertained any of this anyway.",
                "What happened to those lawsuits Imane Khelif claimed she was going to start against all the people spreading that bullshit about her?",
                "The whole “deflecting from our own serious systemic racism and transphobia by blaming spooky ex-commies” is getting really old."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Nightclub fire in North Macedonia leaves 51 dead, over 100 injured",
            "external_url": "https://www.reuters.com/world/europe/fire-north-macedonia-night-club-leaves-several-dead-media-reports-say-2025-03-16/",
            "upvotes": 883,
            "date": "03/16/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "From another article.\n\n>Interior Minister Pance Toskovski said initial reports suggested the fire started from sparks caused by pyrotechnic devices.\nSpeaking outside the Kocani police station, he said the sparks had hit the ceiling, which was made of highly flammable material.\n\nYeah that's a frightening lapse in safety, and it's sad so many people died because of it.",
                "We had something similar in Romania a few years ago. The whole thing was also a big signal for deep corruption:  https://en.wikipedia.org/wiki/Colectiv_nightclub_fire The fire started almost identically to what's in this Reuters article. A lot of people died during the crowd crush at the single smallish exit. Many others died after the fire due to injuries (burns) and infections.",
                "Not only do you have the same safety lapses as The Station, but you're called Pulse. It's like you're asking to have your patrons massacred.",
                "What a fucking mess. Rip to the victims.",
                "It is so eerie how literally the same thing happened 10 years ago in Romania, at club \"Colectiv\". Pyrotechnics, highly inflamabile ceiling, poorly managed exits. 64 people died and 146 were severely injured, countless lives and families ruined. It is the deadliest fire accident in Romanian history and one of our biggest national tragedies.\n\nhttps://en.m.wikipedia.org/wiki/Colectiv_nightclub_fire\n\nHere's a video of the moment the fire starts (warning: disturbing). https://youtu.be/t-Cgw4jj0u8\n\nThe macedonian fire looks like an exact copy of this..",
                "Based on the comments, there have been at least four deadly fires in nightclubs (before this one) that were because of indoor pyrotechnics:\n\nThe Station nightclub fire in West Warwick, Rhode Island, USA on February 20, 2003. Deaths: 100.\n\nThe Lame Horse nightclub fire in Perm, Russia, on December 5, 2009. Deaths: 156.\n\nThe Kiss nightclub fire in Rio Grande do Sul, Brazil, on January 27, 2013. Deaths: 242.\n\nThe Colectiv nightclub fire in Bucharest, Romania, on October 30, 2015. Deaths: 64.\n\nI can’t believe by now there hasn’t been a ban on using pyrotechnics inside nightclubs or other indoor concert venues. Shouldn’t every country pass legislation to prevent this? At the very least, owners of the clubs should forbid them from being used. There’s no reason for this to keep happening.",
                "The fact that people [appear to be just standing around](https://x.com/KalendarNews/status/1901168339705123143) as the place burns in it's early stages probably didn't help.",
                "Same thing happened at The Station nightclub in Rhode Island at a Great White show in 2003.  100 people died.",
                "That really reminds me of the Station Nightclub fire..."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "At least 32 Dead as Monster Storm System Sweeps across US South with Multiple Tornadoes",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/15/massive-storm-system-south-tornado-warnings-extreme-weather",
            "upvotes": 3606,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/ecb1e814a589538afde609d31570f2f6e89dcc17/0_79_1796_1078/master/1796.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e5aaf03d42cc6335c886d36342ebfe59",
            "top_comments": [
                "FEMA defunded, government officials cannot travel with $1 credit card limit, and no leadership.",
                "NOAA cut. NWS cut. FEMA cut. Tariffs on metals, wood, and other raw materials impact the cost of repairs and rebuilding. Eliminating immigrants from the labor pool so there aren't enough workers to repair and rebuild.\n\nAt least they're owning the libs.",
                "Given the nature of climate change, this is only going to get worse, much worse.",
                "It'll be that non-existent climate change up to its old tricks! I'm sure he'll blame FEMA for it and cut their funding even more.",
                "Thoughts and tariffs <3",
                "God is punishing them, amirite trumpers?",
                "Absurd how I have to go to British news sites to see any coverage of this. American news is so derelict in reporting any disasters that happen in middle America.",
                "Hey Fema start pla.....oh wait...nevermind.  Let the states figure it out. Smmfh",
                "That's very sad and the number may rise after the fact, too. I hope those injured recover and the people impacted are able to repair/rebuild. \n\nAs an aside, Republicans like to go on about the government controlling the weather. Why didn't they just turn off the tornadoes? Weird that the republican-controlled government would do this to their own people, but i doubt you'll hear about this conspiracy theory like we did last hurricane season",
                "Good thing they have FEMA……"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Judge blocks Trump from using 18th-century wartime act for deportations",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/15/trump-alien-enemies-act-deportations",
            "upvotes": 17230,
            "date": "03/16/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/73483f3a79cba03193f7a0a334cd26d1f4a35747/0_6_6500_3900/master/6500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=94edb165e99f97e6bdc1a4868b50cbed",
            "top_comments": [
                "Thank goodness the court still have some sway against president pushing the limit of executive action.",
                "Hope the judiciary holds  against this power grab",
                "Like he’ll listen. This country has emboldened the biggest anus on the planet to realize he really only hast to listen to himself.",
                "I'm 51, and I simply can't comprehend having that amount of anger at near 80.\n\nOnce you get to an age like mine, you really do start to understand that reacting and being spiteful is pointless. The world will carry on without you doing that just fine, better in fact.",
                "Trump is literally too stupid to know about that, so someone else has to be feeding him these insane instructions.",
                "Imagine being a born and raised “American” and you voted to destroy the country.\n\nReal Patriots used to call that Treason.",
                "Surely he won't just do it anyway.",
                "Maybe that is why he ordered our war planes to bomb sites in Yemen to get at Iranian militants? If he gets us into a war then he can do what he wants? I thought he was supposed to be the \"Peace President\".",
                "Given his age and mental decline, the court should appoint a conservator for Trump at this point.",
                "The courts have been outstanding in the last few weeks"
            ],
            "aggregate_sentiment": 45.0
        },
        {
            "category": "RISING",
            "title": "Trump invokes 18th century law to declare invasion by gangs and speed deportations",
            "external_url": "https://apnews.com/article/trump-aclu-deportations-venezuelans-b2566f05b10bf1cde1caf467a3b001cc",
            "upvotes": 11830,
            "date": "03/15/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">Trump invokes 18th century law to speed deportations, judge stalls it hours later\n\nNot sure if AP updated the headline after the initial post, but this is what the headline says now",
                "It was just broadly blocked by a judge, including the instruction to turn around planes in the air. We'll see if the administration obeys. https://bsky.app/profile/kyledcheney.bsky.social/post/3lkh7pb7zb226",
                "This is what we used to lock Japanese citizens, Germans, Italians.. Etc. During WW2.\n\n\nThe main concerns are as follows:\n\nPresumption of Membership – The order assumes that membership in TdA makes someone an \"Alien Enemy,\" but it does not specify how membership is determined. Accusations alone could lead to detention and deportation.\n\nLack of Due Process – The Alien Enemies Act does not require the government to prove an individual’s involvement in criminal activity before deportation. Historically, this law has been applied broadly during wartime with minimal legal recourse.\n\nCitizenship Risks – While the order officially applies to non-citizen Venezuelans, enforcement errors, profiling, and lack of oversight could easily result in U.S. citizens being detained if accused of association with TdA.\n\nPolitical Weaponization – The vague criteria and emergency framing could enable selective enforcement, disproportionately targeting certain immigrant communities or political opponents.\n\n\nI'm as white bread as they come, born in Nebraska. Under the statute as written, if someone really had it in for me.... Could accuse *me* of being part of TdA... And I won't even get the chance to say adios before I'm shipped to wherever the hell they decide to send me. (this is an extremely unlikely scenario, but the fact it isn't strictly hyperbole should be chilling.)",
                "This is insane,Martial law is coming next.",
                "It is a wartime law, and thus needs actual war to be occurring. \n\nWhich is why a judge has already halted it. \n\n… either Trump didn’t know it was only allowed during war - in which case he is INCREDIBLY incompetent. \n\n… OR, he did know that, and wanted to illegally enact wartime powers outside of war. I wonder where we’ve seen that before …",
                "\"There must be in-groups whom the law protects but does not bind, alongside out-groups whom the law binds but does not protect.\"\n\nI'm continually amazed at how perfectly a random blogger named Frank Wilhoit summed up the essence of the MAGA m.o.",
                "“We were American citizens. We were incarcerated by our American government in American internment camps here in the United States. The term ‘Japanese internment camp’ is both grammatically and factually incorrect.” - George Takei",
                "He can literally target ANYONE now.  All that’s required is the accusation.",
                "The law only applies to times of war, only used three times: \n\nThe War of 1812, \nWWI and WWII. \n\nThe law itself states that cannot be enacted in peacetime. \n\nOf course, who knows what this idiot can get away with?",
                "Governments usually have laws and procedures on the books that bypass normal due process but apply only to emergencies. Unjustified declaration of emergency then becomes the most obvious and the most common tool of authoritarians. Most of what Trump has done so far (for example the tariffs, which normally need to be approved by congress) has been under the excuse of emergency, which of course has been clearly ridiculous in every invocation."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "Factory employee intentionally locked co-worker in room with 200-degree steam, police say",
            "external_url": "https://www.wsfa.com/2025/03/07/factory-employee-intentionally-locked-co-worker-room-with-200-degree-steam-police-say/?utm_source=taboola&utm_medium=organicclicks",
            "upvotes": 7558,
            "date": "03/15/2025",
            "thumbnail": "https://gray-wsfa-prod.gtv-cdn.com/resizer/v2/QBFHQNVPRFA37NA24NAH7YD5ZA.png?auth=5e1fe91f27685964812c49d4bb709d15a2f877f78aa24ad8569672578d36ddda&width=1200&height=600&smart=true",
            "top_comments": [
                "The woman said she was able to turn it off with an emergency switch before becoming unconscious and falling to the floor.\n\nShe was taken to the hospital with injuries to her face and head, including a concussion.\n\nThank goodness she had training and knew where the emergency switch was.",
                ">She said he then turned the machine on, causing the hot steam and chemicals to spray the room.The woman said she was able to turn it off with an emergency switch before becoming unconscious and falling to the floor.\n\nWithout an emergency shut-off, this likely would have killed her. I'm amazed the charges aren't more severe. The perpetrator also seems like someone you do not want wandering around in society.",
                ">He is charged with wanton endangerment and unlawful imprisonment.\n\n\nSeems like an easy upgrade to at least attempted second degree murder.",
                "This man will hurt more women.",
                "$5 he asked her out and she said no.",
                "So, I actually work at this facility and have for several years, so I'm familiar with the operations of this room and the situation surrounding this incident.\n\nThe room is like a closet with a door at both ends. Things are loaded into it from one side, and it is started to sanitize the equipment, then unloaded from the other side.\n\nThis employee and the woman were on the unloading side of the room, with no way of visually communicating with the loading side. While this guy had no business pushing someone into that room, he doesn't have any means to start the machine from his side. The loading side had closed their door and pressed start but the unloading side door was open so it didn't start, that is until he closed it with her inside.",
                "Makes me grateful I worked at Cold Stone. I'll take a frozen death surrounded by bins of Cake Batter than be burned alive in a factory. And yes, I have experience being locked in the walk in freezer, and yes, it smells REALLY good in there until you lose your sense of smell. And this was during the salmonella scare.",
                "He's definitely an 8-9 out of 10 on the mugshot psycho scale.\n\nIf I was a betting man I'd say he's some sort of incel misogynist type. It's the look on his face knowing what he's done. Doesn't look phased by being in prison, just seems annoyed he didn't kill her.",
                "What he did is just evil.",
                "400% attempted murder like wtf else is the goal ? He tried to kill her \n\nThrow that guy into a volcano"
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Long Island man is first in New York history to be cured of sickle cell anemia",
            "external_url": "https://www.cbsnews.com/newyork/news/sickle-cell-anemia-cure-new-york/?fbclid=IwZXh0bgNhZW0CMTEAAR2aGV-hO1-rSlr-x90l2eazoLzN5tB3iYCNuK2d9rJIgs0v4xASoa1S0yM_aem_y3h7BZbFRQe-q9KJ9wN-1A#5pyixb34gp5ot4bulyygwe4ghh2ajayr4",
            "upvotes": 10499,
            "date": "03/15/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/03/13/6d203796-7ec1-4d80-98b3-b2f128ae3517/thumbnail/1200x630/70b2cfddbcb02c6f2f8fceeb586736b3/mclogan-6p-pkg-new-sick-wcbsdan5-hi-res-still-00-01-3124.jpg?v=e7f44f50e1cf6b32bb81cbfeaec70acf",
            "top_comments": [
                "Ok, so being a biology and medicine geek, this is super interesting, not to mention an incredible moment for humanity. But I was confused reading the article why they called this a cure. Before I read it I assumed CRISPR or a similar gene therapy would had been used. I was correct, but the article really didn't mention that. \n\nHere's the technology they used. \n\n\n\"Lyfgenia is a personalized gene therapy that uses the patient's own blood-forming stem cells. These cells are modified in the laboratory to contain a healthy copy of the beta-globin gene, which is responsible for producing sickle hemoglobin. The modified cells are then infused back into the patient, where they establish themselves in the bone marrow and produce healthy hemoglobin. This helps to reduce or eliminate the production of sickle hemoglobin, which is the underlying cause of SCD.\"",
                "This is why medical research should be funded\n\nbut we know how that’s going",
                "Sickle cell is fucking awful and this is amazing. I hope this treatment becomes widely available. And by “available” I mean actually available both physically and financially.",
                "The article title is kind of mostly false.\n\nHe’s the first to be cured with gene therapy. I don’t know, but I’m pretty sure that someone with sickle cell disease has gotten a bone marrow transplant in New York before. The only article I can find is a [Rochester woman](https://www.wxxinews.org/local-news/2024-11-14/bone-marrow-transplant-gives-rochester-woman-with-sickle-cell-a-new-life), so technically he still might be the first man.",
                "Finally some good news. I’m sick of the doom and gloom",
                "Now this is the kind of news we should be hearing about!",
                "Actually made me cry. Meeting young kids with this while working in a hospital was devastating. Now there’s hope for them.",
                "Finally, a positive news article! This is huge!",
                "now that is some good news",
                "2pac is rolling in his grave."
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "RISING",
            "title": "Teacher ordered to remove signs from classroom, including one saying 'Everyone is welcome here'",
            "external_url": "https://www.nbcnews.com/news/us-news/teacher-ordered-remove-signs-classroom-rcna196582",
            "upvotes": 41601,
            "date": "03/15/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/everyone-is-welcome-here-idaho-mc-1x1-250314-copy-b9fd8e.jpg",
            "top_comments": [
                ">An Idaho teacher is in a standoff with her own school district after officials ordered her to remove classroom signs, including one that reads, “Everyone is welcome here.” \n\n>Sarah Inama, a sixth-grade history teacher at Lewis and Clark Middle School in Meridian, Idaho, says she won’t comply with the order, arguing that the message is a fundamental part to ensuring a positive learning environment for her students.\n\n>Inama, who has taught at the school for five years, says her commitment to inclusivity isn’t about politics. It’s about her passion for education and students.\n\n>“I love the area that I teach,” she says in an interview with TODAY.com. “It’s really a valuable thing for people to know our human history, things that humans have accomplished, our time on this earth, things that they’ve overcome, patterns that exist.”\n\n>Five years ago, when she first put up the two signs, it was to make sure students knew they were in an open and welcoming space. Now, she says she is risking her job in the name of those values.\n\n>Inama says the controversy began in January when her principal and vice principal came to her classroom to inform her that two posters on her walls were controversial and needed to be removed, a detail the district verified in an email to TODAY.com. Inama says other teachers were given similar instruction, but she was caught off guard by the directive.\n\nGood for her for refusing to back down from the \"controversial\" view that *Everyone is welcome here.*",
                "She should call them out on it: \"Provide a list of who isn't welcome, and I'll consider amending the sign\"",
                "Her decorations seem pretty benign and somewhat “content-neutral”\n\nI guess it’s now controversial and innapropriate to state that all people are equal? Administration should clearly define why the given decoration goes against their policy in detail…",
                "those officials are such grim people. it speaks to the wider regime in the current day but for this instance, I would jot what my kids in that district ",
                "Take the sign down. Bring it to the next school board meeting. Lay it down on the table in front of them, and then calmly and simply ask, “Please point to the hands that are not welcome here.”\n\nDon’t leave until each board member gets a chance to participate.",
                "My kids go to this school and we are all very upset. She's a great teacher. They asked me, of their own accord, to make them t-shirts to wear next week saying \"Am I welcome here?\" So that's going to happen.",
                "Change it to “everyone but Nazis” and see if that works better.",
                "There is zero defensible position with the school district's mandate. The teacher's sign only echoes their official policy of inclusion and respect, so either they're lying (they don't actually believe everyone deserves respect and/or inclusion), or they're just suppressing individual speech. There's zero wiggle room here.\n\n\nMy opinion? My guess is they're lying. We know very well that Jim Crow, segregation, and the KKK were the official responses to emancipation. They were legislated into the closet, forced to use dog whistles. Now they're getting comfy and coming back out.\n\n\n\"Red and yellow, black and white, they are precious in his sight. Jesus loves the little children of the world.\" Haven't heard this song since my childhood, seems about time to revive it. You have to fight these kooks with their own values.",
                "They're acting like this a big deal, but letting her stay the rest of the school year - they know they're wrong and they just need a teacher in that classroom. She is right to stand up to them and keep her sign, it's a beautiful message.\n\nhttps://www.westada.org/o/lcms/page/contact-us",
                "I fucking hate sharing a Country with Republikkkans."
            ],
            "aggregate_sentiment": 85.0
        },
        {
            "category": "RISING",
            "title": "Arlington Cemetery strips content on black and female veterans from website",
            "external_url": "https://www.bbc.com/news/articles/cz03gjnxe25o",
            "upvotes": 10840,
            "date": "03/15/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/1a32/live/523070a0-01b5-11f0-8027-b77ec2a48801.jpg",
            "top_comments": [
                "What does this accomplish?",
                "they even removed all mention of general colin powell, the first black man to become chairman of the joint chiefs of staff and is buried there!",
                "I guess nobody is processing that it cost more money to remove shit like this than, you know, averting your fking eyes.",
                "Will that make groceries cheaper or should I wait until tomorrow?",
                "#Vanishing History: Arlington Cemetery Erases Stories of Black and Female Veterans\n\nSomething strange is happening at Arlington National Cemetery. The sprawling burial ground, where hundreds of thousands of American veterans rest, has quietly erased large chunks of its history from public view. Information about black, Hispanic and female service members, once readily available on its website, has vanished. The pages once told the stories of men and women who broke barriers and gave their all for a country that did not always give back. Now, with a few clicks, they are simply gone.\n\nThe move is part of President Donald Trump's sweeping effort to rid the US military and federal government of diversity, equity and inclusion policies. His administration has been swift in shutting down initiatives that highlight the contributions of minority groups, and Arlington has not been spared.\n\nVisitors looking for details about notable graves have run into dead ends. The pages once dedicated to figures such as General Colin Powell, the first black chairman of the Joint Chiefs of Staff, and the legendary Tuskegee Airmen, the country's first black military pilots, have disappeared. The same goes for Hector Santa Anna, a World War II hero and decorated bomber pilot. Even broader categories of history have been stripped away. Sections on African American, Hispanic and Women's history are no longer easily accessible from the main site.\n\nOfficially, Arlington insists it is working to restore some of the missing content, though it also says it wants to ensure everything aligns with Trump's executive orders and the policies of Defence Secretary Pete Hegseth. Hegseth, a former Fox News host and military veteran, has been vocal about his desire to root out what he calls “woke” culture from the armed forces. He was instrumental in removing General CQ Brown, the first black chairman of the Joint Chiefs of Staff, who had supported diversity efforts.\n\nThe backlash has already begun. Representative Adam Smith, a senior Democrat on the House Armed Services Committee, called the situation “deeply concerning” and suggested there was never a problem with diversity in the military to begin with. Earlier this year, a similar attempt to remove training materials on the Tuskegee Airmen sparked national outrage, forcing the Pentagon to reverse course.\n\nThe US military today is a complex institution, with more than two million people serving in active duty or reserves. A significant portion of them come from minority backgrounds. Thirty per cent identify as black, Native American or other underrepresented groups, while nearly one-fifth are women. The stories now missing from Arlington's website belong to people who paved the way for them.\n\nHistory cannot be deleted as easily as a webpage. The soldiers buried at Arlington, no matter their background, are not just names etched into headstones. They were real people who lived, fought and sacrificed. Whether or not their stories remain in an online archive, their contributions cannot be erased. But the question remains, why is their history being buried once again?",
                "Will Arlington now start digging up non-white and non-male graves?",
                "Elect white supremacists, and they're gonna do shit like this. \n\nThis is just the beginning.",
                "And the MAGA folks get so personally offended when you point out that bigotry and racism are defining characteristics of their movement... \\*facepalm\\*",
                "Dishonouring the dead this way is a new low even for them. These people fought and died for their country.",
                "I didn’t realize you could be dead and be a DEI hire. But seriously, as a veteran (who didn’t vote for this shit stain), I am so fucking pissed at all of this. I grew up hyper conservative. It was my experience in the military that exposed me to different people and cultures. I was able to see people for who they were, not what my upbringing said they were. Diversity in the military is its best asset. And these fuckers are destroying it all, not to mention our fucking country."
            ],
            "aggregate_sentiment": 20.0
        }
    ],
    "last_updated": "03/16/2025 16:08:37 UTC"
}