{
    "posts": [
        {
            "category": "HOT",
            "title": "Chinese woman detained by US border patrol in Arizona dies by suicide",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/chinese-woman-border-patrol-arizona-suicide",
            "upvotes": 21245,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4f8803d21e78b9889f3651d55759542f0f3313b0/122_184_3864_2320/master/3864.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e6e0b32190d809a66ec28e3b37cdc695",
            "top_comments": [
                "> The Tucson Sentinel first reported the woman’s death, saying that border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\n\nImagine if someone hadn't made inquiries. How long before anyone who knew her would have gotten answers? She would have just disappeared.",
                "A friend of mine got picked up for drunk driving and was thrown in the county jail. A long line of them were handcuffed together, sitting in a cell waiting to be processed all night. He had chest pain, yelled for help, the guy next to him yelled for help, help didn’t come. He died. They didn’t give a shit. And he was a white middle-aged well off male.",
                "I'm not saying it wasn't suicide, but the article says they didn't even disclose her death until the Tucson Sentinel made inquiries. Seems like they were hoping no one would notice.",
                "There is going to be a LOT of this and ICE/DHS will not be accurately reporting it either.",
                "\"border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\" so how many have died in custody that we don't know about?",
                "So we’re disappearing people and not telling anyone when they die.\n\nCool cool cool. Super cool.",
                "\"A border patrol spokesperson told the Tucson Sentinel that the woman was found “unresponsive in a cell”\n\nAnd that's all we'll hear about that.",
                "I was told nothing like this would happen.",
                "Not suspicious at all",
                "Of course CBP didn’t follow their own policies. That would require competence, transparency, or at the very least, a paper trail that isn’t soaked in bureaucratic neglect.\n\nA Chinese woman dies in their custody and it takes *media inquiries* before they even acknowledge it happened. Not a press release. Not a statement. Silence—until someone forces their hand. And even then, it’s sanitized.\n\nThey logged welfare checks that surveillance shows never happened. They watched her tie a noose. Two hours passed. No one came. And somehow, we’re supposed to believe this system isn’t broken?\n\nThis isn’t an isolated tragedy. It’s a feature of a system that treats migrants like liabilities instead of human beings. Trump’s second term is just gas on the fire."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Alex Ovechkin breaks Wayne Gretzky’s NHL all-time career goals record | CNN",
            "external_url": "https://www.cnn.com/2025/04/06/sport/alex-ovechkin-surpasses-wayne-gretzky-goals-record-nhl-spt/index.html",
            "upvotes": 6183,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208841308.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Gretzky scored 894 in 1487 games.  Ovi scored 895 in his 1487th game.",
                "Gretzky is one of two athletes that I never thought we'd see someone break their records (Jerry Rice being the other). This is pretty wild.\n\nGretzky's assists record though...no one will ever touch that.\n\nEDIT: Guys, I know there are single record holders that are near impossible to beat. I was talking two players that hold multiple records unlikely to be broken. Two completely dominate players in their respective sport.",
                "I'm only a casual hockey viewer, but was Gretzky's all-time goals record comparable to Kareem's all-time points record or a lot more difficult?",
                "Wayne Gretzky is a MAGA clown",
                "The Great Once up there chilling with Kash Patel.\n\nEvery single person in this current administration is doing anything but actual work during a stock market crash",
                "There honestly isn't a player more deserving of this record.  Ovi never chased the cup, he played his entire career with the Caps and in 2018, the cup came to him. One of the best champions of the game today. Congratulations Ovi, you earned this record and I'm sure it will stand for many years.",
                "As some extra context for people who don't follow hockey, Ovi was robbed of 155 games due to NHL lockouts in 2004 and 2013 as well as the shortened covid season. Were it not for that he'd have broken it likely several seasons ago. He also broke his leg this season and missed 5 weeks in recovery. And despite all that, he still scored 42 goals to pass the Great One for the all time lead. Had he not missed time this year, there's a good chance he'd have the lead for most goals on the season too. A truly remarkable player and remarkable moment for the sport.",
                "My favorite bumper sticker of all time was something I saw in Los Angeles late 80’s/early 90’s that said “JESUS SAVES……Gretzky gets the rebound and scores!!”",
                "Good. Fuck Gretzky.\n\nMAGA piece of shit.",
                "who cares. f the ruzzan comrade"
            ],
            "aggregate_sentiment": 60.0
        },
        {
            "category": "HOT",
            "title": "CNN: Kennedy arrives in Texas after a second unvaccinated child dies of measles amid the state’s outbreak",
            "external_url": "https://www.cnn.com/2025/04/06/health/measles-texas-second-child-dies/index.html",
            "upvotes": 1843,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25058597447123.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The fuck's he gonna do? Find a heroin dealer?",
                "...to do what?  Shine a light up the corpse's ass?",
                "Relax folks, it's just the brainworm doing the lords work. RFK is just a vessel.",
                "He let 83 die of measles in Samoa. He doesn't care.",
                "When will RFK be put  in jail for his conspiracy theories and lies ?",
                "Is it so he can eat the remains?",
                "Oh good, he'll save the day.",
                "Second worst trip a Kennedy made to Texas",
                "He wants to put his own “I did that!” sticker on the small coffin.",
                "Imagine the parents who have lost their child, when they hear from ol' Ken that perhaps vaccines might be the way to go after all...\n\n\nEDIT: [Welp! my comment was premature! he actually straight up said it!](https://www.statnews.com/2025/04/06/rfk-jr-measles-statement-west-texas-outbreak/)"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "HOT",
            "title": "Trump administration argues judge cannot order return of man mistakenly deported to El Salvador",
            "external_url": "https://apnews.com/article/trump-el-salvador-prison-kilmar-abrego-garcia-5a92d6bd7f893eed64c2607cc129a6f9?utm_source=reddit&utm_medium=share",
            "upvotes": 3733,
            "date": "04/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is insane. Settinng the precedent to send whom the fuck ever to el savador. Jfc",
                "White house strategy is to argue against anything other than total power to the president.",
                "“At my direction, every Department of Justice attorney is required to zealously advocate on behalf of the United States. Any attorney who fails to abide by this direction will face consequences,” Attorney General Pam Bondi said in a statement.\n\nIf that's not one of the most fucking terrifying things I've read in a long time...\n\nFall in line or pay the price.",
                "I think they're refusing to return him because he'll talk about his horrific/dehumanizing experience. They want to control the narrative.",
                "Welp, I guess there goes any hopes of avoiding a full-on constitutional crisis. Not even 100-days in yet and we're already at the point where they're trying to make the country into an absolute monarchy with Trump as king.",
                "> “A judicial order that forces the Executive to engage with a foreign power in a certain way, let alone compel a certain action by a foreign sovereign, is constitutionally intolerable,” they wrote.\n\nWow. *wow.*\n\nEDIT: to be clear, at face value *they’re not wrong*. However, if there are literally no legal ramifications for violating someone’s due process rights and selling that person to another country, then we’ve entered an entirely different category of constitutional crisis.",
                "They judge should revise the order and send the people responsible to prison in El Salvador and maybe with boots on the ground they can figure it out.",
                "The amount of things Trump supporters have to keep defending must be exhausting.",
                "What’s the point of a judiciary if they can’t enforce their choices?",
                "THE ONLY reason they are fighting this is that if they return this guy - which they should, should never have happened - They might wind up having to return them all, because giving any of them ANY process can lead to DUE process."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "National Park Services removes references to Harriet Tubman from ‘Underground Railroad’ webpage",
            "external_url": "https://www.cnn.com/2025/04/06/us/national-parks-underground-railroad-harriet-tubman/index.html",
            "upvotes": 2591,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-615230666.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You can remove the references, but kids will still learn about it as part of their education.... Oh. Well, they can still read about it in the libraries... Shit.",
                "Bro, Harriet Tubman is the farthest thing you could get from a dei hire. She worked hard af.",
                "that's step one. next they'll rewrite what's left to be anti underground railroad",
                "Fk you Trump. Harriet Tubman is one of America's truest and greatest heroes.",
                "Spoiler: Some us are not just going to forget she existed. Buy a book. Tell your children. Carry the torch.",
                "That's General Tubman to you. ",
                "There were protests everywhere against this crap! There is hope!",
                "Nazi’s doing Nazi stuff, fantastic",
                "… then why even have an Underground Railroad webpage? Just nuke the whole thing and claim it was all a fever dream.",
                "Not one person with a spine who will say, fuck you I’m changing the password and leaving it."
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "HOT",
            "title": "Doge’s attack on social security causing ‘complete, utter chaos’, staff says | US social security",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/musk-doge-social-security",
            "upvotes": 26763,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/f437b2bfe2b2066194423af11c741ab412c9e650/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4e65814c3655dec53aa09824e402b25e",
            "top_comments": [
                "So working people have paid into this their whole lives on the assumption it will be returned to them in retirement, only for it to be demolished without a mandate? How can anyone think this is a good idea?",
                ">Musk has [called](https://www.warren.senate.gov/newsroom/videos/watch/elon-musk-called-social-security-the-biggest-ponzi-scheme-of-all-time) social security “the biggest Ponzi scheme of all time” and has consistently pushed false claims and conspiracies about the program.\n\n>Howard Lutnick claimed in an [interview](https://www.youtube.com/watch?v=182ckTL2KBA) on a podcast earlier this month that only a “fraudster” would complain about missing a social security benefit check.\n\nWhat more do you expect from the team that has these things to say?\n\n*Elect a clown and expect a circus with more un-elected clowns!*",
                "Here’s the plan. Cause havoc. The system breaks down. People lose their minds. “An alternative” happens and Social Security is privatized. I mean sold to a Trump lackey. Service is costlier and totally sucks after that.",
                "The GOP has wanted to privatize Social Security since Reagan.",
                "How the fuck are we letting an unelected  foreigner dismantle Social Security?\n\nFucking Republicans need to be voted out at every goddamned opportunity.",
                "If this isn’t the most terrifying look yet at the brink of disaster DOGE is speeding us toward, I don’t know what is. Most of its actions have been equally arbitrary or poorly thought out. This is why the government employs well-educated professionals with ethics for these roles. Not only is each agency a creation that resulted because of a law or initiative that Congress passed that needed people to implement and operate it, being a public servant carries an ethical duty (with an oath to the constitution) that few, if any, private sector companies require. It’s because the government knows it’s working with a carefully and time-tested system that impacts every American in some way. It’s not just an app. If you break things in government, people can die.",
                "This would be terrifying under the best of economic times.  So there is no word to describe it given that every expert seems to think we're barreling towards the worst economy since the Great Depression.\n\nBefore the tariff EO last week, I was thinking that if the Trump administration destroys SS, my siblings and me will just pool our resources so that our retired parents don't starve or lose the house.  I just won't go on vacation this year.  It will be OK.\n\nBut now?  I'm scared my siblings and I will be unemployed by the end of the year.",
                "I wonder how much the average senior's blood pressure has risen. People my age (68) and older do not need this kind of stress.",
                "I was part of a large system upgrade at a major bank (one of the biggest in the US) and this was for a system that had been thoroughly tested, not one that was being created on the fly. We had so many problems that in decades of working in IT support, I've done fewer support calls in a month than I would do every day during this project.",
                "Yeah it's wonderful isn't it? Recently been diagnosed with parkinson's, I've been waiting a year for social security to process my disability claim. It is now going to take another 253 days for the application to be processed. I will be out on my ass in the street before then. I've worked full time since I was 16 years old. I've always paid my taxes, medicare, social security, everything I'm supposed to. Now some billionaire moron thinks I'm not worthy of assistance. This country is a joke."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "Exclusive: how the Atlantic’s Jeffrey Goldberg got added to the White House Signal group chat",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/signal-group-chat-leak-how-it-happened",
            "upvotes": 1699,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1a5a3d60644c4e4ea0fb3738bbdd6bec2bf08c77/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=848bf874e778d0c8a4eca31451ac6d46",
            "top_comments": [
                "How comforting to know that people who don’t know how to use their own iPhones are making decisions at this scale. ",
                "The media has been completely baffled by this story.  Waltz saving Goldberg's number under another person's contact is the least important part. The important parts of this story are that they were using signal on their personal phones to discuss classified war plans, and that by using signal they were bypassing federal record keeping laws, probably intentionally. But 90% of the stories frame this as Waltz fucking up. He did fuck up, but that's only important in that it lead to the story being reported.\n\n\nEdited to fix Waltz.",
                "> According to the White House, the number was erroneously saved during a “contact suggestion update” by Waltz’s iPhone, which one person described as the function where an iPhone algorithm adds a previously unknown number to an existing contact that it detects may be related.\n\nOh yes, the iPhone is totally the problem in this story.  /S",
                ">Trump briefly considered firing Waltz over the episode, more angered by the fact that Waltz had the number of Jeffrey Goldberg, the editor of the Atlantic – **a magazine he despises** – than the fact that the military operation discussion took place on an unclassified system such as Signal.\n\nGlad we have our priorities straight",
                "What an idiot, saved his contact info in someone else's name on his phone.  I used to have a clearance, and a fuck up like that would have landed me in prison.",
                "This is such horseshit. If this is even remotely true, then he was given this contact in October, before the election. So he’s been using his personal phone, and apparently he’s never had to reach out to Brian Hughes from October until March? \n\nAll of which ignores that NONE of them should have been discussing this information on personal phones, using an app that evades record-keeping, and discussing classified information. \n\nSuch utterly ridiculous horseshit.",
                "Get an oligarchy cosplaying government and this is the crap you get.",
                "Remember when this was a scandal , like, a week ago, and nothing of consequence happened?",
                "Thank you for this update, Mr Tickle",
                "I thought he got “sucked in?”"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Texas records second measles-related death in a child",
            "external_url": "https://www.reuters.com/world/us/kennedy-travel-texas-after-second-measles-related-death-axios-reports-2025-04-06/",
            "upvotes": 3798,
            "date": "04/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is increased child mortality the new federal strategy for preventing autism?",
                "I wonder if the family will be as similarly cavalier as those of the last victim. If I recall, it was something to the tune of “It’s unfortunate, but these things happen. No, this incident hasn’t changed our views at all. Why would you think that?”",
                "If only there was some way to prevent this. Some sort of perhaps injection you could take to boost your immune system.",
                "> Kennedy planned to attend the funeral scheduled for Sunday.\n\nFucking grim, imagine having the killer at the funeral.",
                "From a different article about how measles impacts children's long term health.\n\n> An estimated 1 out of every 5 kids who catch measles will be hospitalized, and 1 in 20 will get pneumonia, which is what kills most children who die of the disease, according to the Centers for Disease Control and Prevention (CDC). Some of these hospitalized children will need to be put on a ventilator to recover, Stinchfield said.\nIn about 1 in 1,000 cases, measles causes brain swelling, or encephalitis, which can cause seizures. When it's not fatal, the swelling itself can subside, but it can cause permanent brain damage and other lasting side effects, such as blindness or deafness. \nThe measles virus is capable of replicating in the brain, said Ross Kedl, a professor of immunology at the University of Colorado Anschutz Medical Campus. In some cases, the immune system beats the virus back and the person seems to recover, but measles still lurks in their nervous system.\n\n> The nightmarish effect of this long-term persistence is a condition called subacute sclerosing panencephalitis (SSPE). This is a progressive neurological disorder that might start with mood changes and muscle tremors; then, as it progresses, the person starts losing speech, vision and hearing. After about two years, the person falls into a coma and dies. \n\n\nIt can also erase antibodies that their bodies have created to fight other diseases. It's absolutely insane to me people are willing to risk their own children and other immunocompromised people like this.",
                "Why are so many women and children dying in a state that’s “pro-life”?",
                "Yeah, but… you know- at least they didn’t grow up to be autistic!  What would the neighbors say?!",
                "Not in Texas (thankfully), but asked my doctor if we needed to be worried about this up here in the Northeast.  I'd of course been vaccinated way back as a kid.  He ordered some blood work, which came back that *I was no longer immune*.  I pretty much went directly to get a booster.\n\nI suggest everyone do the same unless you were vaccinated or boosted recently. We really don't need to \"Make Measles Great Again\".",
                "How is this not considered a form of child abuse? Knowingly placing your child’s wellbeing into jeopardy..and then the worst case occurring. \n\nIf mothers are blamed for miscarriages — then wtf is OK with parents choosing to gamble their child’s life with preventable diseases?",
                "The one star state continues to show why education is important."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Recruiters say more U.S doctors, health-care workers are looking to move to Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/nova-scotia/article/recruiters-say-more-us-doctors-health-care-workers-are-looking-to-move-to-canada/",
            "upvotes": 2972,
            "date": "04/06/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2357XRAPZNECLHCPIZJ2W73BIY.jpg?smart=true&auth=3f9898c2959f0ebc77297be145869f970e327ec5d3e5f129048e610ef0e610f4&width=1200&height=630",
            "top_comments": [
                "Good opportunity for Canada to build up the health care system at the US’s expense.\n\n“Come to Canada, serve patients, not insurance CEO’s”",
                "Ontario is one of the provinces where if you are board certified doctor in the U.S. you are good to go in Ontario.  No additional requirements.\n\nOne of the sites I heard about recently:\n\nhttps://canamrecruiting.com/",
                "How ? Please tell me how? I’m an experienced ED nurse? Would love to relocate !",
                "Almost two years ago now, I helped a Florida doctor find a position in a hospital and move to canada. \n\nStill friends with them to this day. I'm not sure they'll ever go back to the States now.",
                "I'm an American who moved to Montreal 25 years ago, after service in the US and all. From 18 to 30 years old, I moved from NYC, to service, to DC, to Montreal and the way I like to phrase it, I kept moving new places and each time my income went down while my quality of life went up.  \n\nNow I live upper middle class here, and have seven weeks vacation annually and happily pay about the same taxes I would if I lived in California because I'm in Québec. AMA, Americans.",
                "now if only ontarians would stop voting for a guy that keeps fucking with our healthcare...",
                "Please come we need more doctors .\nYou don’t have to deny care because they can’t pay.",
                "This president SUCKS, all his scum-suckers SUCK, the assholes who voted for him SUCK and they're RUINING our country!! Yes I have the misfortune of being American and I'm EMBARRASSED and EXHAUSTED from the constant bad news that affects us and our friends all around the world.\n\nAnd I have a transplant kid at home who was born with a nasty rare disease, and I am terrified! They're gutting the FDA that keeps her safe, and the doctors are leaving- and I don't blame them one bit! Not angry at anyone who's leaving! We're not doctors or anyone important enough to be accepted into another country. My husband works hard as a systems engineer and I've been fortunate enough to be able to stay home and take care of our kids, which has been necessary with her disease. We've started growing our own food, because our food supply is not safe now. But we've just started and my green thumb is very pale. IDK how to protect her, or our son who has AuDHD. There's no country in the world who would take our family, and I can't blame them. But we didn't vote for this, and we'd be protesting if we could but we get every illness, and we have been sick from the latest GI bug this weekend.\n\nThere are 27,000 pediatric transplant patients in the United States. That's in addition to all of the other medical reasons to be immunocompromised, and the adult transplant patients. \n\nI want to scream from a mountain top. And my in-laws have been drinking the conspiracy Kool Aid for a long time, and they voted against our daughter's well-being. Not to mention a lot of other people's! It all makes me sick.",
                "Veterinarian here- theres been plenty of talk from many of my colleagues about abandoning the US for Canada or other countries. Hell, im getting close to pulling the trigger myself.",
                "Honestly, the rate the US is imploding, Canada keeps looking better every day...."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "HOT",
            "title": "Thunderstorms trigger catastrophic flooding across the middle of the US",
            "external_url": "https://edition.cnn.com/2025/04/05/weather/central-us-storms-floods-hnk/index.html",
            "upvotes": 5278,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208554765.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I’m sure what’s left of FEMA will take good care of everybody.",
                "Without NOAA there will be little warning of such situations. But billionaires will get $4.5 trillion in unnecessary tax cuts and that's all that matters. Priorities people, priorities.",
                ">The storms have killed at least 16 people across Tennessee, Missouri, Indiana, Arkansas and Kentucky since Wednesday. In Franklin County, Kentucky, a 9-year-old boy was swept away by floodwaters while walking to his school bus stop, police said. And in Little Rock, Arkansas, a 5–year-old was killed at a home battered by severe weather.\n\nThis is so incredibly sad. Can’t even be safe sheltered at home. Theses states have ample funds to recover and if not the federal govt will help, right? \n\nNot even in the third world would a govt forsake its people like this.",
                "No sign of trump anywhere.  Oh wait...he's golfing.",
                "Executive order to ban thunderstorms incoming?",
                "But why is the Fuhrer using the Weather Weapon against us?",
                "Under normal circumstances, this would activate the full strength of FEMA. It still does, but now it's just two people.",
                "What do the crazy religious republicans love to say when east coast cities get hit, and their followers still donate money and listen to them?\n\n\n\"god is punishing these places because Trump is president and sinful.\"",
                "From Eastern Kentucky. Our river is almost as high from the last 2 days of rain as it was a month ago when the really bad flooding happened in Pike County. The Ohio is on a flood watch as well. This is going to become more and more normal as the climate becomes more volatile.",
                "With tariffs the cost to rebuild will skyrocket for all of these disasters. Insurance which is already sky high is going to get even more expensive."
            ],
            "aggregate_sentiment": 23.0
        },
        {
            "category": "NEW",
            "title": "CNN: Kennedy arrives in Texas after a second unvaccinated child dies of measles amid the state’s outbreak",
            "external_url": "https://www.cnn.com/2025/04/06/health/measles-texas-second-child-dies/index.html",
            "upvotes": 1837,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25058597447123.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The fuck's he gonna do? Find a heroin dealer?",
                "...to do what?  Shine a light up the corpse's ass?",
                "Relax folks, it's just the brainworm doing the lords work. RFK is just a vessel.",
                "He let 83 die of measles in Samoa. He doesn't care.",
                "When will RFK be put  in jail for his conspiracy theories and lies ?",
                "Is it so he can eat the remains?",
                "Oh good, he'll save the day.",
                "Second worst trip a Kennedy made to Texas",
                "He wants to put his own “I did that!” sticker on the small coffin.",
                "Imagine the parents who have lost their child, when they hear from ol' Ken that perhaps vaccines might be the way to go after all...\n\n\nEDIT: [Welp! my comment was premature! he actually straight up said it!](https://www.statnews.com/2025/04/06/rfk-jr-measles-statement-west-texas-outbreak/)"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "NEW",
            "title": "Sports betting surge leads to rise in online harassment of elite college athletes",
            "external_url": "https://www.pbs.org/newshour/show/sports-betting-surge-leads-to-rise-in-online-harassment-of-elite-college-athletes",
            "upvotes": 334,
            "date": "04/06/2025",
            "thumbnail": "https://d3i6fh83elv35t.cloudfront.net/static/2025/04/underpressure-1024x683.jpg",
            "top_comments": [
                "hence the commercial \"dont bully athletes for losing\"\n\nbut let's avoid the real problem here",
                "It was a surreal moment when I saw an article in The Economist arguing that increased gambling was actually a positive benefit for society.\n\nArticle link:\n\nhttps://www.economist.com/leaders/2024/12/05/americas-gambling-boom-should-be-celebrated-not-feared",
                "Who could have possibly foreseen this?!",
                "It feels like every advertisement during sports is for gambling. \n\nAnd think about this, ESPN has a sports betting app, AND they have a betting TV show and they put their little pretty sports betting expert in pop up windows mid game to give their opinion on things to bet on…why would the house feed you winners ? Think about it. If their betting show experts were great at tips, the house would lose a ton of money…don’t listen to TV betting experts, they aren’t working for you, you don’t pay their bills…well, losing pays their pills so actually you do…better yet just don’t bet, cause in the long run you will lose, it’s why they run all those ads, and pay for those ads, cause it’s worth it to them to pay for ads.",
                "Colleges should try to encourage college athletes to stay off social media. It'll just mess with their heads and affect their game.",
                "Betting sites have become a cancer in Brazil specially after the legalization",
                "So the literal losers are ranting online, doing loser stuff? Got it.",
                "Relevant: https://m.youtube.com/watch?v=EJT0NMYHeGw&pp=ygUcU291dGhwYXJrIGRyaW5rIHJlc3BvbnNpYmx5IA%3D%3D",
                "Exploiting college athletes ... For profit and fun! ",
                "This may be an unpopular opinion, but elite college athletes are now paid 6 and 7 figures a year through NIL, so I don’t really care that they are being treated just like professionals. That’s what they are now."
            ],
            "aggregate_sentiment": 30.0
        },
        {
            "category": "NEW",
            "title": "Trump administration argues judge cannot order return of man mistakenly deported to El Salvador",
            "external_url": "https://apnews.com/article/trump-el-salvador-prison-kilmar-abrego-garcia-5a92d6bd7f893eed64c2607cc129a6f9?utm_source=reddit&utm_medium=share",
            "upvotes": 3745,
            "date": "04/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is insane. Settinng the precedent to send whom the fuck ever to el savador. Jfc",
                "White house strategy is to argue against anything other than total power to the president.",
                "“At my direction, every Department of Justice attorney is required to zealously advocate on behalf of the United States. Any attorney who fails to abide by this direction will face consequences,” Attorney General Pam Bondi said in a statement.\n\nIf that's not one of the most fucking terrifying things I've read in a long time...\n\nFall in line or pay the price.",
                "I think they're refusing to return him because he'll talk about his horrific/dehumanizing experience. They want to control the narrative.",
                "Welp, I guess there goes any hopes of avoiding a full-on constitutional crisis. Not even 100-days in yet and we're already at the point where they're trying to make the country into an absolute monarchy with Trump as king.",
                "> “A judicial order that forces the Executive to engage with a foreign power in a certain way, let alone compel a certain action by a foreign sovereign, is constitutionally intolerable,” they wrote.\n\nWow. *wow.*\n\nEDIT: to be clear, at face value *they’re not wrong*. However, if there are literally no legal ramifications for violating someone’s due process rights and selling that person to another country, then we’ve entered an entirely different category of constitutional crisis.",
                "They judge should revise the order and send the people responsible to prison in El Salvador and maybe with boots on the ground they can figure it out.",
                "The amount of things Trump supporters have to keep defending must be exhausting.",
                "What’s the point of a judiciary if they can’t enforce their choices?",
                "THE ONLY reason they are fighting this is that if they return this guy - which they should, should never have happened - They might wind up having to return them all, because giving any of them ANY process can lead to DUE process."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "National Park Services removes references to Harriet Tubman from ‘Underground Railroad’ webpage",
            "external_url": "https://www.cnn.com/2025/04/06/us/national-parks-underground-railroad-harriet-tubman/index.html",
            "upvotes": 2587,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-615230666.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You can remove the references, but kids will still learn about it as part of their education.... Oh. Well, they can still read about it in the libraries... Shit.",
                "Bro, Harriet Tubman is the farthest thing you could get from a dei hire. She worked hard af.",
                "that's step one. next they'll rewrite what's left to be anti underground railroad",
                "Fk you Trump. Harriet Tubman is one of America's truest and greatest heroes.",
                "Spoiler: Some us are not just going to forget she existed. Buy a book. Tell your children. Carry the torch.",
                "That's General Tubman to you. ",
                "There were protests everywhere against this crap! There is hope!",
                "Nazi’s doing Nazi stuff, fantastic",
                "… then why even have an Underground Railroad webpage? Just nuke the whole thing and claim it was all a fever dream.",
                "Not one person with a spine who will say, fuck you I’m changing the password and leaving it."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "NEW",
            "title": "Exclusive: how the Atlantic’s Jeffrey Goldberg got added to the White House Signal group chat",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/signal-group-chat-leak-how-it-happened",
            "upvotes": 1697,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1a5a3d60644c4e4ea0fb3738bbdd6bec2bf08c77/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=848bf874e778d0c8a4eca31451ac6d46",
            "top_comments": [
                "How comforting to know that people who don’t know how to use their own iPhones are making decisions at this scale. ",
                "The media has been completely baffled by this story.  Waltz saving Goldberg's number under another person's contact is the least important part. The important parts of this story are that they were using signal on their personal phones to discuss classified war plans, and that by using signal they were bypassing federal record keeping laws, probably intentionally. But 90% of the stories frame this as Waltz fucking up. He did fuck up, but that's only important in that it lead to the story being reported.\n\n\nEdited to fix Waltz.",
                "> According to the White House, the number was erroneously saved during a “contact suggestion update” by Waltz’s iPhone, which one person described as the function where an iPhone algorithm adds a previously unknown number to an existing contact that it detects may be related.\n\nOh yes, the iPhone is totally the problem in this story.  /S",
                ">Trump briefly considered firing Waltz over the episode, more angered by the fact that Waltz had the number of Jeffrey Goldberg, the editor of the Atlantic – **a magazine he despises** – than the fact that the military operation discussion took place on an unclassified system such as Signal.\n\nGlad we have our priorities straight",
                "What an idiot, saved his contact info in someone else's name on his phone.  I used to have a clearance, and a fuck up like that would have landed me in prison.",
                "This is such horseshit. If this is even remotely true, then he was given this contact in October, before the election. So he’s been using his personal phone, and apparently he’s never had to reach out to Brian Hughes from October until March? \n\nAll of which ignores that NONE of them should have been discussing this information on personal phones, using an app that evades record-keeping, and discussing classified information. \n\nSuch utterly ridiculous horseshit.",
                "Get an oligarchy cosplaying government and this is the crap you get.",
                "Remember when this was a scandal , like, a week ago, and nothing of consequence happened?",
                "Thank you for this update, Mr Tickle",
                "I thought he got “sucked in?”"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Chinese woman detained by US border patrol in Arizona dies by suicide",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/chinese-woman-border-patrol-arizona-suicide",
            "upvotes": 21239,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4f8803d21e78b9889f3651d55759542f0f3313b0/122_184_3864_2320/master/3864.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e6e0b32190d809a66ec28e3b37cdc695",
            "top_comments": [
                "> The Tucson Sentinel first reported the woman’s death, saying that border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\n\nImagine if someone hadn't made inquiries. How long before anyone who knew her would have gotten answers? She would have just disappeared.",
                "A friend of mine got picked up for drunk driving and was thrown in the county jail. A long line of them were handcuffed together, sitting in a cell waiting to be processed all night. He had chest pain, yelled for help, the guy next to him yelled for help, help didn’t come. He died. They didn’t give a shit. And he was a white middle-aged well off male.",
                "I'm not saying it wasn't suicide, but the article says they didn't even disclose her death until the Tucson Sentinel made inquiries. Seems like they were hoping no one would notice.",
                "There is going to be a LOT of this and ICE/DHS will not be accurately reporting it either.",
                "\"border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\" so how many have died in custody that we don't know about?",
                "So we’re disappearing people and not telling anyone when they die.\n\nCool cool cool. Super cool.",
                "\"A border patrol spokesperson told the Tucson Sentinel that the woman was found “unresponsive in a cell”\n\nAnd that's all we'll hear about that.",
                "I was told nothing like this would happen.",
                "Not suspicious at all",
                "Of course CBP didn’t follow their own policies. That would require competence, transparency, or at the very least, a paper trail that isn’t soaked in bureaucratic neglect.\n\nA Chinese woman dies in their custody and it takes *media inquiries* before they even acknowledge it happened. Not a press release. Not a statement. Silence—until someone forces their hand. And even then, it’s sanitized.\n\nThey logged welfare checks that surveillance shows never happened. They watched her tie a noose. Two hours passed. No one came. And somehow, we’re supposed to believe this system isn’t broken?\n\nThis isn’t an isolated tragedy. It’s a feature of a system that treats migrants like liabilities instead of human beings. Trump’s second term is just gas on the fire."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "Alex Ovechkin breaks Wayne Gretzky’s NHL all-time career goals record | CNN",
            "external_url": "https://www.cnn.com/2025/04/06/sport/alex-ovechkin-surpasses-wayne-gretzky-goals-record-nhl-spt/index.html",
            "upvotes": 6185,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208841308.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Gretzky scored 894 in 1487 games.  Ovi scored 895 in his 1487th game.",
                "Gretzky is one of two athletes that I never thought we'd see someone break their records (Jerry Rice being the other). This is pretty wild.\n\nGretzky's assists record though...no one will ever touch that.\n\nEDIT: Guys, I know there are single record holders that are near impossible to beat. I was talking two players that hold multiple records unlikely to be broken. Two completely dominate players in their respective sport.",
                "I'm only a casual hockey viewer, but was Gretzky's all-time goals record comparable to Kareem's all-time points record or a lot more difficult?",
                "Wayne Gretzky is a MAGA clown",
                "The Great Once up there chilling with Kash Patel.\n\nEvery single person in this current administration is doing anything but actual work during a stock market crash",
                "There honestly isn't a player more deserving of this record.  Ovi never chased the cup, he played his entire career with the Caps and in 2018, the cup came to him. One of the best champions of the game today. Congratulations Ovi, you earned this record and I'm sure it will stand for many years.",
                "As some extra context for people who don't follow hockey, Ovi was robbed of 155 games due to NHL lockouts in 2004 and 2013 as well as the shortened covid season. Were it not for that he'd have broken it likely several seasons ago. He also broke his leg this season and missed 5 weeks in recovery. And despite all that, he still scored 42 goals to pass the Great One for the all time lead. Had he not missed time this year, there's a good chance he'd have the lead for most goals on the season too. A truly remarkable player and remarkable moment for the sport.",
                "My favorite bumper sticker of all time was something I saw in Los Angeles late 80’s/early 90’s that said “JESUS SAVES……Gretzky gets the rebound and scores!!”",
                "Good. Fuck Gretzky.\n\nMAGA piece of shit.",
                "who cares. f the ruzzan comrade"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Trump advances to championship round of Senior Club golf tournament, days after imposing wave of tariffs",
            "external_url": "https://1010wcsi.com/fox-sports/trump-advances-to-championship-round-of-senior-club-golf-tournament-days-after-imposing-wave-of-tariffs/",
            "upvotes": 0,
            "date": "04/06/2025",
            "thumbnail": "https://1010wcsi.com/wp-content/uploads/2020/07/WCSI-header.png",
            "top_comments": [
                "Didn’t a bunch of people die during the tornado outbreak? Did our president care?",
                "Waiting for that stroke",
                "What the fuck. Thought this was the Onion at first.",
                "Obviously it’s a bad look to be fiddling/golfing while the country is burning, but I have to wonder if his score is actually earned or is sandbagged like the leaders of North Korea?",
                "Let him compete. It’s a way to keep him away from administrative duties. We don’t need any further damage.",
                "…and after he cheated and declared himself the winner before the tournament. Is there any question that the orange blob of shit would win this?",
                "Any lightning in the area? 🤞",
                "Championship round? That new foot wedge must be working great!",
                "In the immortal words of Gomer Pyle U.S.M.C.   \"Surprise, Surprise Surprise!\"",
                "\"I'll be too busy making deals to play golf.\"\n\n\\-- Donald Trump"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Pharmacist accused of hacking computers to stalk co-workers at Maryland medical center",
            "external_url": "https://www.cbsnews.com/baltimore/news/university-maryland-medical-center-pharmacist-cyber-stalking-lawsuit/",
            "upvotes": 432,
            "date": "04/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/04/6ed7b41c-88a3-4360-9de8-81c50db80a33/thumbnail/1200x630/41dec68d0c70b1b5884a5912c13911db/gettyimages-2207236668-1.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "> Bathula allegedly targeted about 80 co-workers, most of whom were women. According to the lawsuit, he used security information from UMMC computers to access his victims' accounts and photos. \nCindy B. Morgan, an attorney with Grant & Eisenhofer, tells WJZ that for at least 8 years, Bathula allegedly used keystroke software on UMMC computers to learn employees' usernames and passwords.  From there, Morgan says he was able to download everything from social security numbers to texts and nude pictures. \n\"Incredibly emotionally traumatic to learn that your iCloud could be hacked by somebody that you work with or that you could be surveyed in your home,\" Morgan said.   \nThe lawsuit further alleges that he spied on his victims using internet-enabled cameras in their homes and at UMMC. \n\nHoly cow this is disturbing, and he did this for possibly decades? I can't even imagine how violated his victims feel.",
                "I’m referring to only the cybersecurity aspects of this situation, but none of this would have been possible if the hospital had followed basic IT security procedures. The fact that he was able to install software on computers and computers everything else means that there were no security measures in place. No monitoring measures either.\n\nMore than a handful of people need to be fired for this.",
                ">tl;dr  \n*>Matthew Bathula*  \n  \n***>for at least 8 years,*** *Bathula allegedly used keystroke software on UMMC computers to learn employees' usernames and passwords.*  \n  \n*>he was able to download everything from social security numbers to texts and nude pictures.*   \n  \n*>he spied on his victims using internet-enabled cameras in their homes and at UMMC.*   \n  \n*>He activated the cameras in treatment rooms to watch co-workers that he knew would be pumping breastmilk and accessed home security cameras to spy on victims as they were undressing or engaged in intimate acts*  \n  \n*>He was able to remotely turn off the green button that would alert them that their camera was on, he was able to change the settings, and then he actively surveyed them in their homes,\" Morgan said. \"He surveyed them breastfeeding, he surveyed them having intimate moments with their spouses, he surveyed them nude, partially nude.\"* \n\npretty disgusting",
                "Why would someone do that? Weird creepy behavior",
                "That's a whole new level of creepy, can't believe someone would do that.",
                "The creep aside, why would you have nudes pic, at least nudes pic **available on an externally accessible media**."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "Recruiters say more U.S doctors, health-care workers are looking to move to Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/nova-scotia/article/recruiters-say-more-us-doctors-health-care-workers-are-looking-to-move-to-canada/",
            "upvotes": 2971,
            "date": "04/06/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2357XRAPZNECLHCPIZJ2W73BIY.jpg?smart=true&auth=3f9898c2959f0ebc77297be145869f970e327ec5d3e5f129048e610ef0e610f4&width=1200&height=630",
            "top_comments": [
                "Good opportunity for Canada to build up the health care system at the US’s expense.\n\n“Come to Canada, serve patients, not insurance CEO’s”",
                "Ontario is one of the provinces where if you are board certified doctor in the U.S. you are good to go in Ontario.  No additional requirements.\n\nOne of the sites I heard about recently:\n\nhttps://canamrecruiting.com/",
                "How ? Please tell me how? I’m an experienced ED nurse? Would love to relocate !",
                "Almost two years ago now, I helped a Florida doctor find a position in a hospital and move to canada. \n\nStill friends with them to this day. I'm not sure they'll ever go back to the States now.",
                "I'm an American who moved to Montreal 25 years ago, after service in the US and all. From 18 to 30 years old, I moved from NYC, to service, to DC, to Montreal and the way I like to phrase it, I kept moving new places and each time my income went down while my quality of life went up.  \n\nNow I live upper middle class here, and have seven weeks vacation annually and happily pay about the same taxes I would if I lived in California because I'm in Québec. AMA, Americans.",
                "now if only ontarians would stop voting for a guy that keeps fucking with our healthcare...",
                "Please come we need more doctors .\nYou don’t have to deny care because they can’t pay.",
                "This president SUCKS, all his scum-suckers SUCK, the assholes who voted for him SUCK and they're RUINING our country!! Yes I have the misfortune of being American and I'm EMBARRASSED and EXHAUSTED from the constant bad news that affects us and our friends all around the world.\n\nAnd I have a transplant kid at home who was born with a nasty rare disease, and I am terrified! They're gutting the FDA that keeps her safe, and the doctors are leaving- and I don't blame them one bit! Not angry at anyone who's leaving! We're not doctors or anyone important enough to be accepted into another country. My husband works hard as a systems engineer and I've been fortunate enough to be able to stay home and take care of our kids, which has been necessary with her disease. We've started growing our own food, because our food supply is not safe now. But we've just started and my green thumb is very pale. IDK how to protect her, or our son who has AuDHD. There's no country in the world who would take our family, and I can't blame them. But we didn't vote for this, and we'd be protesting if we could but we get every illness, and we have been sick from the latest GI bug this weekend.\n\nThere are 27,000 pediatric transplant patients in the United States. That's in addition to all of the other medical reasons to be immunocompromised, and the adult transplant patients. \n\nI want to scream from a mountain top. And my in-laws have been drinking the conspiracy Kool Aid for a long time, and they voted against our daughter's well-being. Not to mention a lot of other people's! It all makes me sick.",
                "Veterinarian here- theres been plenty of talk from many of my colleagues about abandoning the US for Canada or other countries. Hell, im getting close to pulling the trigger myself.",
                "Honestly, the rate the US is imploding, Canada keeps looking better every day...."
            ],
            "aggregate_sentiment": 26.0
        },
        {
            "category": "RISING",
            "title": "CNN: Kennedy arrives in Texas after a second unvaccinated child dies of measles amid the state’s outbreak",
            "external_url": "https://www.cnn.com/2025/04/06/health/measles-texas-second-child-dies/index.html",
            "upvotes": 1836,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/ap25058597447123.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The fuck's he gonna do? Find a heroin dealer?",
                "...to do what?  Shine a light up the corpse's ass?",
                "Relax folks, it's just the brainworm doing the lords work. RFK is just a vessel.",
                "He let 83 die of measles in Samoa. He doesn't care.",
                "When will RFK be put  in jail for his conspiracy theories and lies ?",
                "Is it so he can eat the remains?",
                "Oh good, he'll save the day.",
                "Second worst trip a Kennedy made to Texas",
                "He wants to put his own “I did that!” sticker on the small coffin.",
                "Imagine the parents who have lost their child, when they hear from ol' Ken that perhaps vaccines might be the way to go after all...\n\n\nEDIT: [Welp! my comment was premature! he actually straight up said it!](https://www.statnews.com/2025/04/06/rfk-jr-measles-statement-west-texas-outbreak/)"
            ],
            "aggregate_sentiment": 67.0
        },
        {
            "category": "RISING",
            "title": "National Park Services removes references to Harriet Tubman from ‘Underground Railroad’ webpage",
            "external_url": "https://www.cnn.com/2025/04/06/us/national-parks-underground-railroad-harriet-tubman/index.html",
            "upvotes": 2589,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-615230666.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "You can remove the references, but kids will still learn about it as part of their education.... Oh. Well, they can still read about it in the libraries... Shit.",
                "Bro, Harriet Tubman is the farthest thing you could get from a dei hire. She worked hard af.",
                "that's step one. next they'll rewrite what's left to be anti underground railroad",
                "Fk you Trump. Harriet Tubman is one of America's truest and greatest heroes.",
                "Spoiler: Some us are not just going to forget she existed. Buy a book. Tell your children. Carry the torch.",
                "That's General Tubman to you. ",
                "There were protests everywhere against this crap! There is hope!",
                "Nazi’s doing Nazi stuff, fantastic",
                "… then why even have an Underground Railroad webpage? Just nuke the whole thing and claim it was all a fever dream.",
                "Not one person with a spine who will say, fuck you I’m changing the password and leaving it."
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "RISING",
            "title": "Sports betting surge leads to rise in online harassment of elite college athletes",
            "external_url": "https://www.pbs.org/newshour/show/sports-betting-surge-leads-to-rise-in-online-harassment-of-elite-college-athletes",
            "upvotes": 339,
            "date": "04/06/2025",
            "thumbnail": "https://d3i6fh83elv35t.cloudfront.net/static/2025/04/underpressure-1024x683.jpg",
            "top_comments": [
                "hence the commercial \"dont bully athletes for losing\"\n\nbut let's avoid the real problem here",
                "It was a surreal moment when I saw an article in The Economist arguing that increased gambling was actually a positive benefit for society.\n\nArticle link:\n\nhttps://www.economist.com/leaders/2024/12/05/americas-gambling-boom-should-be-celebrated-not-feared",
                "Who could have possibly foreseen this?!",
                "It feels like every advertisement during sports is for gambling. \n\nAnd think about this, ESPN has a sports betting app, AND they have a betting TV show and they put their little pretty sports betting expert in pop up windows mid game to give their opinion on things to bet on…why would the house feed you winners ? Think about it. If their betting show experts were great at tips, the house would lose a ton of money…don’t listen to TV betting experts, they aren’t working for you, you don’t pay their bills…well, losing pays their pills so actually you do…better yet just don’t bet, cause in the long run you will lose, it’s why they run all those ads, and pay for those ads, cause it’s worth it to them to pay for ads.",
                "Colleges should try to encourage college athletes to stay off social media. It'll just mess with their heads and affect their game.",
                "Betting sites have become a cancer in Brazil specially after the legalization",
                "So the literal losers are ranting online, doing loser stuff? Got it.",
                "Relevant: https://m.youtube.com/watch?v=EJT0NMYHeGw&pp=ygUcU291dGhwYXJrIGRyaW5rIHJlc3BvbnNpYmx5IA%3D%3D",
                "Exploiting college athletes ... For profit and fun! ",
                "This may be an unpopular opinion, but elite college athletes are now paid 6 and 7 figures a year through NIL, so I don’t really care that they are being treated just like professionals. That’s what they are now."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Alex Ovechkin breaks Wayne Gretzky’s NHL all-time career goals record | CNN",
            "external_url": "https://www.cnn.com/2025/04/06/sport/alex-ovechkin-surpasses-wayne-gretzky-goals-record-nhl-spt/index.html",
            "upvotes": 6187,
            "date": "04/06/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2208841308.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Gretzky scored 894 in 1487 games.  Ovi scored 895 in his 1487th game.",
                "Gretzky is one of two athletes that I never thought we'd see someone break their records (Jerry Rice being the other). This is pretty wild.\n\nGretzky's assists record though...no one will ever touch that.\n\nEDIT: Guys, I know there are single record holders that are near impossible to beat. I was talking two players that hold multiple records unlikely to be broken. Two completely dominate players in their respective sport.",
                "I'm only a casual hockey viewer, but was Gretzky's all-time goals record comparable to Kareem's all-time points record or a lot more difficult?",
                "Wayne Gretzky is a MAGA clown",
                "The Great Once up there chilling with Kash Patel.\n\nEvery single person in this current administration is doing anything but actual work during a stock market crash",
                "There honestly isn't a player more deserving of this record.  Ovi never chased the cup, he played his entire career with the Caps and in 2018, the cup came to him. One of the best champions of the game today. Congratulations Ovi, you earned this record and I'm sure it will stand for many years.",
                "As some extra context for people who don't follow hockey, Ovi was robbed of 155 games due to NHL lockouts in 2004 and 2013 as well as the shortened covid season. Were it not for that he'd have broken it likely several seasons ago. He also broke his leg this season and missed 5 weeks in recovery. And despite all that, he still scored 42 goals to pass the Great One for the all time lead. Had he not missed time this year, there's a good chance he'd have the lead for most goals on the season too. A truly remarkable player and remarkable moment for the sport.",
                "My favorite bumper sticker of all time was something I saw in Los Angeles late 80’s/early 90’s that said “JESUS SAVES……Gretzky gets the rebound and scores!!”",
                "Good. Fuck Gretzky.\n\nMAGA piece of shit.",
                "who cares. f the ruzzan comrade"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "RISING",
            "title": "Chinese woman detained by US border patrol in Arizona dies by suicide",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/chinese-woman-border-patrol-arizona-suicide",
            "upvotes": 21230,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/4f8803d21e78b9889f3651d55759542f0f3313b0/122_184_3864_2320/master/3864.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e6e0b32190d809a66ec28e3b37cdc695",
            "top_comments": [
                "> The Tucson Sentinel first reported the woman’s death, saying that border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\n\nImagine if someone hadn't made inquiries. How long before anyone who knew her would have gotten answers? She would have just disappeared.",
                "A friend of mine got picked up for drunk driving and was thrown in the county jail. A long line of them were handcuffed together, sitting in a cell waiting to be processed all night. He had chest pain, yelled for help, the guy next to him yelled for help, help didn’t come. He died. They didn’t give a shit. And he was a white middle-aged well off male.",
                "I'm not saying it wasn't suicide, but the article says they didn't even disclose her death until the Tucson Sentinel made inquiries. Seems like they were hoping no one would notice.",
                "There is going to be a LOT of this and ICE/DHS will not be accurately reporting it either.",
                "\"border patrol officials did not follow internal policies about publicly acknowledging the death of someone in custody – and then only provided a statement after the Sentinel made inquiries.\" so how many have died in custody that we don't know about?",
                "So we’re disappearing people and not telling anyone when they die.\n\nCool cool cool. Super cool.",
                "\"A border patrol spokesperson told the Tucson Sentinel that the woman was found “unresponsive in a cell”\n\nAnd that's all we'll hear about that.",
                "I was told nothing like this would happen.",
                "Not suspicious at all",
                "Of course CBP didn’t follow their own policies. That would require competence, transparency, or at the very least, a paper trail that isn’t soaked in bureaucratic neglect.\n\nA Chinese woman dies in their custody and it takes *media inquiries* before they even acknowledge it happened. Not a press release. Not a statement. Silence—until someone forces their hand. And even then, it’s sanitized.\n\nThey logged welfare checks that surveillance shows never happened. They watched her tie a noose. Two hours passed. No one came. And somehow, we’re supposed to believe this system isn’t broken?\n\nThis isn’t an isolated tragedy. It’s a feature of a system that treats migrants like liabilities instead of human beings. Trump’s second term is just gas on the fire."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Exclusive: how the Atlantic’s Jeffrey Goldberg got added to the White House Signal group chat",
            "external_url": "https://www.theguardian.com/us-news/2025/apr/06/signal-group-chat-leak-how-it-happened",
            "upvotes": 1697,
            "date": "04/06/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/1a5a3d60644c4e4ea0fb3738bbdd6bec2bf08c77/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=848bf874e778d0c8a4eca31451ac6d46",
            "top_comments": [
                "How comforting to know that people who don’t know how to use their own iPhones are making decisions at this scale. ",
                "The media has been completely baffled by this story.  Waltz saving Goldberg's number under another person's contact is the least important part. The important parts of this story are that they were using signal on their personal phones to discuss classified war plans, and that by using signal they were bypassing federal record keeping laws, probably intentionally. But 90% of the stories frame this as Waltz fucking up. He did fuck up, but that's only important in that it lead to the story being reported.\n\n\nEdited to fix Waltz.",
                "> According to the White House, the number was erroneously saved during a “contact suggestion update” by Waltz’s iPhone, which one person described as the function where an iPhone algorithm adds a previously unknown number to an existing contact that it detects may be related.\n\nOh yes, the iPhone is totally the problem in this story.  /S",
                ">Trump briefly considered firing Waltz over the episode, more angered by the fact that Waltz had the number of Jeffrey Goldberg, the editor of the Atlantic – **a magazine he despises** – than the fact that the military operation discussion took place on an unclassified system such as Signal.\n\nGlad we have our priorities straight",
                "What an idiot, saved his contact info in someone else's name on his phone.  I used to have a clearance, and a fuck up like that would have landed me in prison.",
                "This is such horseshit. If this is even remotely true, then he was given this contact in October, before the election. So he’s been using his personal phone, and apparently he’s never had to reach out to Brian Hughes from October until March? \n\nAll of which ignores that NONE of them should have been discussing this information on personal phones, using an app that evades record-keeping, and discussing classified information. \n\nSuch utterly ridiculous horseshit.",
                "Get an oligarchy cosplaying government and this is the crap you get.",
                "Remember when this was a scandal , like, a week ago, and nothing of consequence happened?",
                "Thank you for this update, Mr Tickle",
                "I thought he got “sucked in?”"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Trump administration argues judge cannot order return of man mistakenly deported to El Salvador",
            "external_url": "https://apnews.com/article/trump-el-salvador-prison-kilmar-abrego-garcia-5a92d6bd7f893eed64c2607cc129a6f9?utm_source=reddit&utm_medium=share",
            "upvotes": 3735,
            "date": "04/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "This is insane. Settinng the precedent to send whom the fuck ever to el savador. Jfc",
                "White house strategy is to argue against anything other than total power to the president.",
                "“At my direction, every Department of Justice attorney is required to zealously advocate on behalf of the United States. Any attorney who fails to abide by this direction will face consequences,” Attorney General Pam Bondi said in a statement.\n\nIf that's not one of the most fucking terrifying things I've read in a long time...\n\nFall in line or pay the price.",
                "I think they're refusing to return him because he'll talk about his horrific/dehumanizing experience. They want to control the narrative.",
                "Welp, I guess there goes any hopes of avoiding a full-on constitutional crisis. Not even 100-days in yet and we're already at the point where they're trying to make the country into an absolute monarchy with Trump as king.",
                "> “A judicial order that forces the Executive to engage with a foreign power in a certain way, let alone compel a certain action by a foreign sovereign, is constitutionally intolerable,” they wrote.\n\nWow. *wow.*\n\nEDIT: to be clear, at face value *they’re not wrong*. However, if there are literally no legal ramifications for violating someone’s due process rights and selling that person to another country, then we’ve entered an entirely different category of constitutional crisis.",
                "They judge should revise the order and send the people responsible to prison in El Salvador and maybe with boots on the ground they can figure it out.",
                "The amount of things Trump supporters have to keep defending must be exhausting.",
                "What’s the point of a judiciary if they can’t enforce their choices?",
                "THE ONLY reason they are fighting this is that if they return this guy - which they should, should never have happened - They might wind up having to return them all, because giving any of them ANY process can lead to DUE process."
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "RISING",
            "title": "Recruiters say more U.S doctors, health-care workers are looking to move to Canada",
            "external_url": "https://www.ctvnews.ca/atlantic/nova-scotia/article/recruiters-say-more-us-doctors-health-care-workers-are-looking-to-move-to-canada/",
            "upvotes": 2978,
            "date": "04/06/2025",
            "thumbnail": "https://www.ctvnews.ca/resizer/v2/2357XRAPZNECLHCPIZJ2W73BIY.jpg?smart=true&auth=3f9898c2959f0ebc77297be145869f970e327ec5d3e5f129048e610ef0e610f4&width=1200&height=630",
            "top_comments": [
                "Good opportunity for Canada to build up the health care system at the US’s expense.\n\n“Come to Canada, serve patients, not insurance CEO’s”",
                "Ontario is one of the provinces where if you are board certified doctor in the U.S. you are good to go in Ontario.  No additional requirements.\n\nOne of the sites I heard about recently:\n\nhttps://canamrecruiting.com/",
                "How ? Please tell me how? I’m an experienced ED nurse? Would love to relocate !",
                "Almost two years ago now, I helped a Florida doctor find a position in a hospital and move to canada. \n\nStill friends with them to this day. I'm not sure they'll ever go back to the States now.",
                "I'm an American who moved to Montreal 25 years ago, after service in the US and all. From 18 to 30 years old, I moved from NYC, to service, to DC, to Montreal and the way I like to phrase it, I kept moving new places and each time my income went down while my quality of life went up.  \n\nNow I live upper middle class here, and have seven weeks vacation annually and happily pay about the same taxes I would if I lived in California because I'm in Québec. AMA, Americans.",
                "now if only ontarians would stop voting for a guy that keeps fucking with our healthcare...",
                "Please come we need more doctors .\nYou don’t have to deny care because they can’t pay.",
                "This president SUCKS, all his scum-suckers SUCK, the assholes who voted for him SUCK and they're RUINING our country!! Yes I have the misfortune of being American and I'm EMBARRASSED and EXHAUSTED from the constant bad news that affects us and our friends all around the world.\n\nAnd I have a transplant kid at home who was born with a nasty rare disease, and I am terrified! They're gutting the FDA that keeps her safe, and the doctors are leaving- and I don't blame them one bit! Not angry at anyone who's leaving! We're not doctors or anyone important enough to be accepted into another country. My husband works hard as a systems engineer and I've been fortunate enough to be able to stay home and take care of our kids, which has been necessary with her disease. We've started growing our own food, because our food supply is not safe now. But we've just started and my green thumb is very pale. IDK how to protect her, or our son who has AuDHD. There's no country in the world who would take our family, and I can't blame them. But we didn't vote for this, and we'd be protesting if we could but we get every illness, and we have been sick from the latest GI bug this weekend.\n\nThere are 27,000 pediatric transplant patients in the United States. That's in addition to all of the other medical reasons to be immunocompromised, and the adult transplant patients. \n\nI want to scream from a mountain top. And my in-laws have been drinking the conspiracy Kool Aid for a long time, and they voted against our daughter's well-being. Not to mention a lot of other people's! It all makes me sick.",
                "Veterinarian here- theres been plenty of talk from many of my colleagues about abandoning the US for Canada or other countries. Hell, im getting close to pulling the trigger myself.",
                "Honestly, the rate the US is imploding, Canada keeps looking better every day...."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Pharmacist accused of hacking computers to stalk co-workers at Maryland medical center",
            "external_url": "https://www.cbsnews.com/baltimore/news/university-maryland-medical-center-pharmacist-cyber-stalking-lawsuit/",
            "upvotes": 426,
            "date": "04/06/2025",
            "thumbnail": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/04/04/6ed7b41c-88a3-4360-9de8-81c50db80a33/thumbnail/1200x630/41dec68d0c70b1b5884a5912c13911db/gettyimages-2207236668-1.jpg?v=7613930c2bdb7d1bf55be910a9b022f2",
            "top_comments": [
                "> Bathula allegedly targeted about 80 co-workers, most of whom were women. According to the lawsuit, he used security information from UMMC computers to access his victims' accounts and photos. \nCindy B. Morgan, an attorney with Grant & Eisenhofer, tells WJZ that for at least 8 years, Bathula allegedly used keystroke software on UMMC computers to learn employees' usernames and passwords.  From there, Morgan says he was able to download everything from social security numbers to texts and nude pictures. \n\"Incredibly emotionally traumatic to learn that your iCloud could be hacked by somebody that you work with or that you could be surveyed in your home,\" Morgan said.   \nThe lawsuit further alleges that he spied on his victims using internet-enabled cameras in their homes and at UMMC. \n\nHoly cow this is disturbing, and he did this for possibly decades? I can't even imagine how violated his victims feel.",
                "I’m referring to only the cybersecurity aspects of this situation, but none of this would have been possible if the hospital had followed basic IT security procedures. The fact that he was able to install software on computers and computers everything else means that there were no security measures in place. No monitoring measures either.\n\nMore than a handful of people need to be fired for this.",
                ">tl;dr  \n*>Matthew Bathula*  \n  \n***>for at least 8 years,*** *Bathula allegedly used keystroke software on UMMC computers to learn employees' usernames and passwords.*  \n  \n*>he was able to download everything from social security numbers to texts and nude pictures.*   \n  \n*>he spied on his victims using internet-enabled cameras in their homes and at UMMC.*   \n  \n*>He activated the cameras in treatment rooms to watch co-workers that he knew would be pumping breastmilk and accessed home security cameras to spy on victims as they were undressing or engaged in intimate acts*  \n  \n*>He was able to remotely turn off the green button that would alert them that their camera was on, he was able to change the settings, and then he actively surveyed them in their homes,\" Morgan said. \"He surveyed them breastfeeding, he surveyed them having intimate moments with their spouses, he surveyed them nude, partially nude.\"* \n\npretty disgusting",
                "Why would someone do that? Weird creepy behavior",
                "That's a whole new level of creepy, can't believe someone would do that.",
                "The creep aside, why would you have nudes pic, at least nudes pic **available on an externally accessible media**."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "RISING",
            "title": "Texas records second measles-related death in a child",
            "external_url": "https://www.reuters.com/world/us/kennedy-travel-texas-after-second-measles-related-death-axios-reports-2025-04-06/",
            "upvotes": 3792,
            "date": "04/06/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Is increased child mortality the new federal strategy for preventing autism?",
                "I wonder if the family will be as similarly cavalier as those of the last victim. If I recall, it was something to the tune of “It’s unfortunate, but these things happen. No, this incident hasn’t changed our views at all. Why would you think that?”",
                "If only there was some way to prevent this. Some sort of perhaps injection you could take to boost your immune system.",
                "> Kennedy planned to attend the funeral scheduled for Sunday.\n\nFucking grim, imagine having the killer at the funeral.",
                "From a different article about how measles impacts children's long term health.\n\n> An estimated 1 out of every 5 kids who catch measles will be hospitalized, and 1 in 20 will get pneumonia, which is what kills most children who die of the disease, according to the Centers for Disease Control and Prevention (CDC). Some of these hospitalized children will need to be put on a ventilator to recover, Stinchfield said.\nIn about 1 in 1,000 cases, measles causes brain swelling, or encephalitis, which can cause seizures. When it's not fatal, the swelling itself can subside, but it can cause permanent brain damage and other lasting side effects, such as blindness or deafness. \nThe measles virus is capable of replicating in the brain, said Ross Kedl, a professor of immunology at the University of Colorado Anschutz Medical Campus. In some cases, the immune system beats the virus back and the person seems to recover, but measles still lurks in their nervous system.\n\n> The nightmarish effect of this long-term persistence is a condition called subacute sclerosing panencephalitis (SSPE). This is a progressive neurological disorder that might start with mood changes and muscle tremors; then, as it progresses, the person starts losing speech, vision and hearing. After about two years, the person falls into a coma and dies. \n\n\nIt can also erase antibodies that their bodies have created to fight other diseases. It's absolutely insane to me people are willing to risk their own children and other immunocompromised people like this.",
                "Why are so many women and children dying in a state that’s “pro-life”?",
                "Yeah, but… you know- at least they didn’t grow up to be autistic!  What would the neighbors say?!",
                "Not in Texas (thankfully), but asked my doctor if we needed to be worried about this up here in the Northeast.  I'd of course been vaccinated way back as a kid.  He ordered some blood work, which came back that *I was no longer immune*.  I pretty much went directly to get a booster.\n\nI suggest everyone do the same unless you were vaccinated or boosted recently. We really don't need to \"Make Measles Great Again\".",
                "How is this not considered a form of child abuse? Knowingly placing your child’s wellbeing into jeopardy..and then the worst case occurring. \n\nIf mothers are blamed for miscarriages — then wtf is OK with parents choosing to gamble their child’s life with preventable diseases?",
                "The one star state continues to show why education is important."
            ],
            "aggregate_sentiment": 22.0
        }
    ],
    "last_updated": "04/07/2025 00:42:51 UTC"
}