{
    "posts": [
        {
            "category": "HOT",
            "title": "Judge bars Musk's DOGE team from Social Security records in scathing ruling",
            "external_url": "https://www.cnbc.com/2025/03/20/judge-bars-musks-doge-team-from-social-security-records.html?utm_source=flipboard&utm_content=user%2FCNBC",
            "upvotes": 29687,
            "date": "03/20/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118453-1742406884122-gettyimages-2205899441-4m7a5252_j0ib0j01.jpeg?v=1742406923&w=1920&h=1080",
            "top_comments": [
                "*Judge Ellen Lipton Hollander in a* [*scathing ruling*](https://storage.courtlistener.com/recap/gov.uscourts.mdd.577321/gov.uscourts.mdd.577321.49.0.pdf) *accused* [*DOGE*](https://www.cnbc.com/2025/02/07/elon-musk-doge-racist-treasury-x-staff.html) *of launching a “fishing expedition” at the Social Security agency and failing to provide any reason why it needed to access vast swaths of Americans’ personal and private data.*\n\nHurrah!!  She attacked DOGE for insisting on the total secrecy and privacy of their operatives while granting zilch such recognition of the tens of millions personal records they demand access to.",
                "\"Hollander, noting the affiliates of DOGE have kept their identities hidden, wrote, “ironically, the identity of these DOGE affiliates has been concealed because defendants are concerned that the disclosure of even  their names would expose them to harassment and thus invade their privacy.”\n\nA-fucking-men",
                "\"Are you tired of winning?\" has turned into \"Can we win once?\"",
                "Throw the book at these little mid 20s shits. They shouldn’t be anywhere near the government.",
                "That only works with administrations that follow the law",
                "They don't even have the names of the people who had access to said data. And it's a TRO.",
                "Before someone says “ThEy’lL jUsT iGnOrE the oRdErS” - note that the administration has been forced to follow orders then whined about it.  They aren’t as all powerful as they like to portray they are \n\nThey know while republicans are feckless and have placed their balls squarely in President Elon’s hands for safe keeping - they can only be pushed so far. \n\nThere’s a lot do resist. A lot of nonsense this administration is doing to enrich themselves and a lot of cleanup we have to do. \n\nCelebrate the win. Highlight if and when the administration ignores the law and keep fighting.\n\nEdit: added some clarifying text.",
                "They're getting ready to start pillaging social security. Lots of grandparents and disabled people are going to get branded frauds so billionaires can upgrade the helipads and moonpools on their yachts",
                "Now I guess we wait and see if they actually follow the order. I put the odds at no better than 50/50, which is like 50% lower than basically any previous administration, even Nixon.",
                "Social Security is sacred grounds. They’ve already stopped phone support which will create havoc for the elderly. Touching benefits will be the poison pill that may finally cure the cancer running throughout the current administration. I hope but not holding my breath."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Trump signs executive order to dismantle the Education Department",
            "external_url": "https://www.nbcnews.com/politics/white-house/trump-signs-executive-order-dismantle-education-department-white-house-rcna197251",
            "upvotes": 15044,
            "date": "03/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250320-donald-trump-linda-mcmahon-vl-1056a-273d79.jpg",
            "top_comments": [
                "I didn't realize the president could just run the nation with executive orders",
                "(He technically cannot do this but that hasn’t stopped him yet)",
                "Educated populace is difficult to manipulate.",
                "They want your children working.",
                "Very sad day for America.  Trump can't do much without Congress here, but Republicans seem to be pretty much on board with closing the whole thing down.\n\nI wonder if they realize that school curriculum is already controlled at a state level?",
                "[removed]",
                "There's no way this holds up. Establishing and disestablishing departments like this requires an act of Congress.\n\nThat doesn't mean that this won't do tremendous damage to the department in the meantime, but this will almost certainly be challenged.",
                "Apr 3, 2016 — We won with poorly educated. “I love the poorly educated,” the Republican presidential front-runner boasted after coasting to a decisive victory.",
                "I remember when the right were outraged by Obama’s executive orders so much so that they began referring him as Chairman Obama. \n\nAnd what do you hear now? Crickets.",
                "So, who's handling the student loans applications and funding now? I'm assuming private banks and companies?"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Man deported to El Salvador under Alien Enemies Act because of soccer logo tattoo: Attorney",
            "external_url": "https://abcnews.go.com/Politics/man-deported-el-salvador-alien-enemies-act-soccer-logo-tattoo-attorney/story?id=119983892",
            "upvotes": 15987,
            "date": "03/20/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/c53e7039-52fc-4319-8f04-c7c14e03e5e3/salvador-deported-10-rt-gmh-250316_1742166305552_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "Its exactly as bad as you might suspect it is.",
                "People still don’t realize how serious this is and that’s a problem.",
                "I recommend watching this short [youtube documentary about CECOT,](https://www.youtube.com/watch?v=BV7Q0zYDO9I) a Mega Prison in El Salvador that the US is now sending people to without Due Process. Any of us could end up there without trial if an ICE agent takes action against you, migrant or citizen.",
                "Labeling every one as a Gang member terrorist doesn't make it legal, because that is the same name they use for all their opposition.",
                "I saw a news yesterday where a mother from Venezuela recognized his son from El Salvador video being given a haircut, he was moved without any trial or process, just packed in the plane to CECOT, this is horrible.",
                "I am not visiting the US anytime soon, if you don't even have a right for a trial, before you get shipped of to a Camp",
                "In addition to the tattoo they said that 🤟 was a gang sign jfc",
                "This is crazy. He’s not from El Salvador nor has any ties to El Salvador and they just arrested and shipped an innocent soccer player/coach there.",
                "Seems like a violation of the First Amendment. Also, how does everyone feel about [Latin or Greek tattoos](https://nypost.com/2024/11/13/us-news/all-of-secretary-of-defense-nominee-pete-hegseths-tattoos/)?",
                "The private prison he's being held in is CECOT, a private prison that was massively overcrowded BEFORE Trump shipped hundreds of immigrants there without trial."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Teslas under attack as Musk backlash grows",
            "external_url": "https://news.sky.com/video/teslas-under-attack-as-musk-backlash-grows-13332242",
            "upvotes": 2368,
            "date": "03/20/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-tesla-us_6861757.jpg?20250320070121",
            "top_comments": [
                "This is why CEOs tend to just buy their politicians and don’t actually get involved personally.   He has made himself and his products a target by getting into the political arena.\n\nIf he was smart he would bow out soon and stay out of the public eye for a bit.   That pesky narcissism won’t allow for that though.",
                "Is the CEO of a publically traded company that sells consumer goods making himself the public mascot for Fascism and firing thousands of people a bad business strategy?",
                "So strange to see republicans suddenly liking electric vehicles.",
                "It looks like they exploded on their own due to poor materials and shoddy workmanship. I hope Tesla has to reimburse the community for fixing their problems.",
                "I had pasta for lunch",
                "It could be an inside job as they aren't selling [https://electrek.co/2025/03/20/tesla-confirms-it-cant-sell-the-cybertruck-even-with-tax-credit-and-discounts/](https://electrek.co/2025/03/20/tesla-confirms-it-cant-sell-the-cybertruck-even-with-tax-credit-and-discounts/)",
                "It's the Boston Tesla Party!",
                "If 1/6 taught me anything, it is that these folks are just enthusiastic tourists wanting to show Tesla their love.",
                "Im surprised the share price is at $260 mark still. \n\nShould be trading way way less, if the public in multiple countries are burning your stores to the ground, thats not really a good earnings call report when factor numbers of stores left in ashes.",
                "It’s not vandalism, it’s just a Roman bonfire."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "HOT",
            "title": "Tesla recalls most Cybertrucks due to trim detaching from vehicle",
            "external_url": "https://www.reuters.com/business/autos-transportation/tesla-recall-over-46000-cybertrucks-nhtsa-says-2025-03-20/",
            "upvotes": 37518,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "The build quality is a joke on these things. Europe was right not to let them on the road.",
                "It should be noted that this vehicle had the most Elon involvement than any other Tesla. The CyberTruck was supposed to be his crowning achievement, his coup d’ grace, his ultimate vision realized 😂😂",
                "Unhinged you might say\n\nConcerning",
                "\"Tesla accounts for a large portion of recalled vehicles in the U.S. In 2024, Tesla topped the list for U.S. recalls with its vehicles accounting for 5.1 million call-backs, according to recall management firm BizzyCar. However, most issues for the brand's cars were usually resolved with over-the-air software updates.\" (probably from this article, took it from yahoo version).\n\n  \nThey are going AAA games company route of selling bugged unfinished product and patching it up as it goes. While selling cars.",
                "“Trim?” \n\nI saw a couple of pictures of whole panels.",
                "There's a cyber truck in my town, and I was just commenting to my wife on a walk last night that it looked like it was getting more wavy and wrinkly over time.... Glue failure would do that. \n\nHysterically poorly engineered.",
                "It is interesting to note, when the panels came off you got to see the vehicle is essentially plastic. So you get a weak aluminum unibody frame, plastic and steel alloy panels that fall off. Doesn't really sound like a vehicle for long term use. Even if it wasn't a Tesla I wouldn't touch it.",
                "Musk sends DOGE to tear down vehicle safety standards in 3... 2... 1...",
                "Why would democrats do this?!",
                "Remember when they sneakily tried to offload $400 million worth of these to the State Department without a competitive bidding process? Lol."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "HOT",
            "title": "Houston janitor who urinated in water bottles at doctor’s office, spreading STDs to workers sentenced to prison",
            "external_url": "https://www.click2houston.com/news/local/2025/03/19/houston-janitor-who-urinated-in-water-bottles-at-doctors-office-spreading-stds-to-workers-sentenced/",
            "upvotes": 2128,
            "date": "03/20/2025",
            "thumbnail": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/U2DTQ6TYBZEBLO5G6XDWZQCNLI.png?_a=DATAdtfiZAA0",
            "top_comments": [
                ">According to prosecutors, Diaz already served more than two years behind bars. He will be eligible for parole after serving three years of his six year sentence\n\nSeems kind of light, considering...",
                ">The convicted will not have to register as a sex offender\n\n>A man with multiple sexually transmitted and communicable diseases was sentenced to six years in prison for urinating into office workers’ water bottles, resulting in the victims contracting herpes simplex 1 and hepatitis A.\n\n\nI'm a bit lost on why this instance would not be worthy of registering as a sex offender.",
                "Its some sick motherfuckers out there.",
                "6 years for spreading permanent diseases? Seems too light",
                "Anyway, some kid is gonna get 20 years for vandalizing a Telsa dealership lol",
                "How selective of him to only go for people that were about to go to prison.\n\nIn other news: Commas.",
                "Should be RFK Jr's deputy at HHS by next week. Sick, twisted fuck.",
                "According to the article, it was considered assault with a deadly weapon.",
                "> Blood and urine samples were obtained from Diaz and results indicated he tested positive for herpes simplex 1 virus and hepatitis A. One of them was incurable, documents state. The victim also had lab work done and learned she had contracted the incurable diseases.\n\nHe's a sicko who deserves a harsher sentence than 6 years. He ruined lives.",
                "Honey, I got it from drinking water at work. I swear"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Finland is again ranked the happiest country in the world. The US falls to its lowest-ever position",
            "external_url": "https://apnews.com/article/world-happiness-report-ranking-finland-afghanistan-us-b41c1712448762d98fe9e4f80233c15f",
            "upvotes": 23927,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Finnish people have a lot of trust in their government and other public institutions, and trust in their communities in general. They provide access to strong public services like healthcare and education. Finland has a stable economy. And they value work-life balance, comfort, and well-being. It has been this way for a long time. It seems clear that other counties should follow suit",
                "Beyond the actual rankings, there's some good insights here, about what makes for a happy society:\n\n>**Researchers say that beyond health and wealth, some factors that influence happiness sound deceptively simple: sharing meals with others, having somebody to count on for social support, and household size**. In Mexico and Europe, for example, a household size of four to five people predicts the highest levels of happiness, the study said.\n\n>**Believing in the kindness of others is also much more closely tied to happiness than previously thought**, according to the latest findings.\n\n>As an example, the report suggests that **people who believe that others are willing to return their lost wallet is a strong predictor of the overall happiness of a population**.\n\n>Nordic nations rank among the top places for expected and actual return of lost wallets, the study found.\n\n>Overall, researchers said **global evidence on the perceived and actual return of lost wallets shows that people are much too pessimistic about the kindness of their communities compared to reality** — actual rates of wallet return are around twice as high as people expect.\n\n>...\n\n>Experts in economics, psychology, sociology and beyond then seek to explain the variations across countries and over time using factors such as **GDP per capita, healthy life expectancy, having someone to count on, a sense of freedom, generosity and perceptions of corruption**.\n\nIt's a good reminder that a sense of community, personal relationships, and social solidarity add real value to people's lives.\n\nI think that sometimes gets missed, when changes in society are evaluated almost solely by their implications for economics and efficiency.  Those are important too, but they're not everything.",
                "Frankly, the end of the article scares me more than the ranking itself:\n\n\n>In a concerning development, the study said 19% of young adults across the world reported in 2023 that they have no one they could count on for social support. That is a 39% increase compared to 2006.\n\n\nWe already have one generation of people who are effectively islands unto themselves. The fact that the next generation is already starting off alone isn't going to bode well.\n\n\nAlso, Mexico being in #10 despite some of the horiffic things that happen there should raise some alarm bells on how the United States functions as a society. If you're less happy than the country below you that has active cartels with clandestine body disposal facilities, then you have a problem.",
                "Position  24.  Saved you a click",
                "As a born Finnish (around middle-age) this seems weird because I don't think we're \"happy\" as the word suggests. I think we are \"content\". We got everything quite stable, it's safe, quiet and not a ton of people everywhere. We got nature everywhere, we got our little houses and apartment buildings and we got hobbies.\n\nLavishing life-style, kitted out mansions and supercars have never been hip here. \n\nSure sometimes it's boring as hell, but it's stable and you don't have to fear dropping onto nothing if shit gets difficult/you get sick (unless you purposefully fuck up time after time).",
                "The Netherlands no. 5; it's always Scandinavian countries and The Netherlands in the top 10. I wonder why.",
                "I was told we were going to be great.",
                "Finland Finland finlaaaaaand. That is the country for me",
                "Direct Link to the report: https://worldhappiness.report/ed/2025/",
                "Finland: Universal healthcare, work-life balance, and trust in government.   \nThe US: Unlimited breadsticks if you ask nicely."
            ],
            "aggregate_sentiment": 50.0
        },
        {
            "category": "HOT",
            "title": "3 people face federal charges in Tesla arson attacks in U.S. as 80 more vehicles at Canada dealership are damaged",
            "external_url": "https://www.nbcnews.com/news/us-news/3-face-federal-charges-tesla-arson-attacks-rcna197340",
            "upvotes": 1328,
            "date": "03/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250213-Cybertruck-aa-1045-dd55f3.jpg",
            "top_comments": [
                "There is an author of many satire books from Germany called Marc-Uwe Kling and one of his quotes always comes to mind when seeing stories like this: \n\n(Keep in mind, it’s satire) “I like far right extremists way more than far left extremists. Far left extremists burn cars and far right extremists burn foreigners… and I don’t own any foreigners”",
                ">\"The days of committing crimes without consequence have ended,\" Bondi said in a statement.\n\nUntil Trump is rotting in prison where he belongs, this statement is complete bullshit.",
                "What about the January 6th invaders 🤔",
                "Why is it a \"Federal charge\" for destroying private property? This should be thrown out.",
                "Elon deserves the pain but I don't think he's worth throwing your life away for.  Why go to prison for the next 20 years while Elon is chilling on the outside and chugging along to become the world's first trillionaire?",
                "I'm sorry. \nI don't condone the vandalism, but they weren't targeting people.  This was vandalism and arson. \nTrump is labeling them domestic terrorists and is probably going to push for the death penalty.  That's overkill.",
                "It’s all fun and anarchy til someone gets popped fucking w the wrong persons car.",
                "Ma’am your president faced zero consequences for 34 felonies",
                "I cannot believe Joe Biden did this. Deplorable.",
                "Good.  Fuck these people.  I'm not saying that the sentence is fair.  I'm saying fuck people who make a political point by comiting arson and vandalizing their neighbors property... when at least 50% of the time the owners of the cars may even have same political outlook.\n\nOh, you didn't know Elon was gonna make a Nazi solute 3 years after you bought your dream car? This will teach you!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "‘Don’t call it zombie deer disease’: scientists warn of ‘global crisis’ as infections spread across the US",
            "external_url": "https://www.theguardian.com/environment/2025/mar/20/chronic-wasting-disease-spread-zombie-deer-global-us-aoe",
            "upvotes": 4486,
            "date": "03/20/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/cfd667d2f38456d67610e38b7ae3b796533e5195/510_466_2304_1382/master/2304.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5be82800bc08bf2ee01c20875ed46949",
            "top_comments": [
                "Prion diseases are terrifying.",
                "RFK just needs for this to keep going so he can find an immune deer.",
                "\"symptoms include ... a lack of fear of people\"\n\ndid not have deerpocalypse on my 2025 bingo card",
                "Call it what it is. CWD chronic wasting disease",
                "My shitty representative, Pat Curry of Texas-56, just submitted a bill in Texas to dismantle the Texas Parks and Wildlife Department which houses the Game Wardens of the state. He spews out the typical republican word bullshit about waste and taking their budget and resources and putting them to better use.\n\nBut in reality, the Wardens and another regulatory body under the TPWD made a pretty big bust on some deer breeders in the state last year. The info on arrests has been withheld for bullshit reasons but Pat Curry let the cat out of the bag when he emailed a response to a constituent telling him to withdraw the bill. He specifically mentions Deer Breeding as a reason why he submitted the bill.\n\nSo either he has an breeding operation that was dinged from the recent bust or family/friend/donor runs a breeding operation and they cried to their politician friend to remove even more regulations.\n\nRemember, always follow the money.",
                "When the best case scenario is making it harder to find deer and elk to hunt and the worst case is a cross infection that leads to a human disaster that might be unprecedented, its terrifying to think of these warnings coming during a time when our national leadership has a track record of ignoring potential disease disaster and then mismanaging response to lead to nearly a million deaths.",
                "US: No. \n\n*Fires scientists* \n\nCNN headline: \"Zombie Deer Disease runs rampant amongst deer.\" \n\nFOX headline: \"Biden responsible for mysterious deaths.\"",
                "Scientists: \"Guys, can we please not dramatize this by calling it something alarmist?\"\n\nMedia: \"Scientists say don't call it zombie deer disease!\"",
                "#\"Zombie Deer Disease\" is No Joke\n## – and Scientists are Worried\n\nA strange and deadly disease is creeping through America’s deer, elk and moose, spreading its grip from state to state and even crossing international borders. It is officially known as chronic wasting disease, or CWD, but in the media, it has earned a more lurid nickname: zombie deer disease. The label comes from its eerie symptoms, drooling, vacant stares, dramatic weight loss and animals staggering around in a disoriented daze. But scientists say the nickname is misleading and dangerously trivialises what could turn into a global crisis.\n\nCWD is always fatal and has no cure. First detected in wild deer in Colorado and Wyoming in 1981, it has since spread across 36 American states and beyond, reaching Canada, Scandinavia and South Korea. The disease is caused not by bacteria or a virus but by prions, rogue proteins that infect the brain, causing a slow but unstoppable decline. Once these prions are in the environment, they linger for years, infecting new animals through soil, water and even plants.\n\nFor now, there has been no confirmed case of CWD jumping to humans, but that does not mean the danger is not there. Scientists remember all too well what happened with BSE, or mad cow disease, which took years to leap to people, with tragic consequences. **Experts are warning that CWD could be following a similar path, particularly as thousands of people regularly eat venison from infected deer without realising it.**\n\nMichael Osterholm, an epidemiologist who has been sounding the alarm for years, says the risk is growing, yet governments are not taking it seriously enough. A recent report from 67 experts painted a bleak picture of what would happen if the disease spilt over to humans, predicting chaos in global food supplies, agriculture and trade, not to mention a major public health disaster. Despite this, surveillance and research funding are being cut just when they are needed most.\n\nSome states are making the situation worse. In Wyoming, for example, large numbers of elk and deer are fed artificial food in winter to keep their populations high. Scientists say this is a recipe for disaster, bringing animals into close contact and making it easy for the disease to spread. Meanwhile, predators like wolves and mountain lions, which naturally target sick animals and help control the spread of CWD, are being aggressively culled.\n\nIt is not just scientists who are concerned. Hunters, many of whom rely on venison as a key part of their diet, are beginning to worry about the safety of their food. Yet many deer shot by hunters are never tested for CWD, and contaminated meat is being transported across state lines, increasing the risk of further spread. In some places, infected carcasses are even being dumped in landfill sites, raising fears that the disease could find new ways to take hold in the environment.\n\nThere are no easy solutions, but ignoring the problem is not one of them. Without action, experts warn that entire populations of deer and elk could be wiped out over time. The best way to slow the disease is to let nature take its course, allow predators to do their job and stop artificially feeding wild animals in ways that help CWD thrive.\n\nScientists are watching anxiously, knowing that if CWD ever does jump to humans, the world could be facing another crisis that no one saw coming. For now, all they can do is keep warning people, even if too many are still not listening.",
                "Great timing to withdraw from the WHO and gut science and environment surveillance"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "67,000 white South Africans have expressed interest in Trump's plan to give them refugee status",
            "external_url": "https://apnews.com/article/trump-white-refugee-afrikaner-south-africa-0fbca411470d3b439886cabc12c7600d",
            "upvotes": 1459,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Allowing in immigrants to increase their party's numbers... exactly what the GOP falsely accused Dems of doing. Shocker.",
                "Great just what we needed 76,000 copies of Ninja from Die Antword.",
                "This government is so transparent (in all the wrong ways). \n\nI wonder why Trump suddenly has a fixation with South Africa, Tesla, and meme coins?",
                "They are chasing apartheid.",
                "Wait so they are deprting brown people and importing whites instead ?\n\nThat sounds like  replacement , you know , like the theory.. 😶",
                "This is due to a DEI policy instituted by Dementia Donny. The guy who cries about DEI makes his own racist version of DEI.",
                "What, Trump is allowing refugees?\n\nSee white in title\n\nOh that's why",
                "Is the TOUGH ON IMMIGRATION!!!!!! in the room with us?",
                "Please no more, they’re not sending their best",
                "This season of US politics is absolutely wild."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "People named in JFK assassination documents are not happy their personal information was released",
            "external_url": "https://apnews.com/article/jfk-assassination-files-personal-information-5609ccd6e106c5b30ee6b6cca3a30e3c",
            "upvotes": 84,
            "date": "03/21/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Has anything knew or interesting come from this document release? I think it was just red meat to keep people's attention away from the Epstein diaries.",
                "The problem is the social security numbers of these living individuals were not redacted.",
                ">“It should not have happened,” diGenova said in a phone interview Thursday. “I think it’s the result of incompetent people doing the reviewing. I don’t believe it had anything to do with rushing the process. The people who reviewed these documents did not do their job.”\n\nYeah i can definitely see incompetent people involved in this and a lot else going on rn",
                "Trump, as always, doesn’t care about anyone but himself.",
                "So, no new info except for the stuff that was correctly and competently redacted in the past to protect people that absolutely deserved to be shielded from having their private info thrown to the conspiracy theorist wolves.\n\nNo surprise at all to any of that.",
                "So the only thing new was that we all know Digenova's SS number. Cool.",
                "Next week they are releasing Area 51 files",
                "It was just names in already known non-important information. I get it. But gotta please the conspiracy theorists somehow when daddy musk tells you to.",
                "[deleted]"
            ],
            "aggregate_sentiment": 70.0
        },
        {
            "category": "NEW",
            "title": "Teslas under attack as Musk backlash grows",
            "external_url": "https://news.sky.com/video/teslas-under-attack-as-musk-backlash-grows-13332242",
            "upvotes": 2372,
            "date": "03/20/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-tesla-us_6861757.jpg?20250320070121",
            "top_comments": [
                "This is why CEOs tend to just buy their politicians and don’t actually get involved personally.   He has made himself and his products a target by getting into the political arena.\n\nIf he was smart he would bow out soon and stay out of the public eye for a bit.   That pesky narcissism won’t allow for that though.",
                "Is the CEO of a publically traded company that sells consumer goods making himself the public mascot for Fascism and firing thousands of people a bad business strategy?",
                "So strange to see republicans suddenly liking electric vehicles.",
                "It looks like they exploded on their own due to poor materials and shoddy workmanship. I hope Tesla has to reimburse the community for fixing their problems.",
                "I had pasta for lunch",
                "It could be an inside job as they aren't selling [https://electrek.co/2025/03/20/tesla-confirms-it-cant-sell-the-cybertruck-even-with-tax-credit-and-discounts/](https://electrek.co/2025/03/20/tesla-confirms-it-cant-sell-the-cybertruck-even-with-tax-credit-and-discounts/)",
                "It's the Boston Tesla Party!",
                "If 1/6 taught me anything, it is that these folks are just enthusiastic tourists wanting to show Tesla their love.",
                "Im surprised the share price is at $260 mark still. \n\nShould be trading way way less, if the public in multiple countries are burning your stores to the ground, thats not really a good earnings call report when factor numbers of stores left in ashes.",
                "It’s not vandalism, it’s just a Roman bonfire."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Russia, US to hold talks on Ukraine in Saudi Arabia on March 24, Putin's aide says",
            "external_url": "https://kyivindependent.com/russia-us-set-to-meet-in-riyadh-on-march-24-for-talks-on-war-in-ukraine/",
            "upvotes": 67,
            "date": "03/20/2025",
            "thumbnail": "https://assets.kyivindependent.com/content/images/2024/11/GettyImages-1813426206.jpg",
            "top_comments": [
                "Saudia Arabia had a conference on women's rights without any women present, so makes sense they'd have *another* Ukrainian peace talk without Ukraine.",
                "I feel like there's a nation missing in the negotiations.",
                "Why? Putin is just gonna make a fool of Trump AGAIN😂 not that I care because I need the laugh.",
                "How can there be peace talks about Ukraine…without Ukraine?",
                "It's cool that we're getting information what the US is going to do from Putin's aide.",
                "Donald's asshole sure must be sore by now...",
                "Again?   What part of Europe do these comrades want to try and carve up next?",
                "How many pages of the 9/11 report were blank again?",
                "ukrainians need not attend",
                "You know.  Putin's getting pretty good at this.   Treating Trump like chump change.\n\nSeems to be working for him.   Last time, the bombs came reigning down on Ukraine after they hung up the call."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Zelensky tells Russia to drop 'unnecessary' demands ahead of peace talks",
            "external_url": "https://www.bbc.co.uk/news/articles/c234y2e9kzlo",
            "upvotes": 319,
            "date": "03/20/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f068/live/afed08b0-05b2-11f0-b2ad-a94aba055f71.jpg",
            "top_comments": [
                "That’s right Zelenskyy hold your ground and make the demands Ukraine deserves. You have fought against one of the great superpowers and kept them from stealing your country like they intended. \n\nYou deserve to be recognized by the entire world as the hero you are!!!",
                "Zelensky is a great leader of his country, and Ukrainians are true patriots and warriors, but when you are left alone with such a huge monster as Russia and such a cunning chameleon as Trump, you become helpless. And this is very sad.",
                "I feel so bad for them. The one country that could help, is taking advantage of their dire situation to squeeze out what they can. False promises that are made before letting Putin take full control. What a terrible period this will be remembered as"
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "NEW",
            "title": "1999 Columbine school massacre claims another life as paralyzed survivor's death ruled homicide: Complications from Anne Marie Hochhalter's paralysis were a \"significant contributing factor\" in her death, according to a forensic pathologist",
            "external_url": "https://news.sky.com/story/1999-columbine-school-massacre-claims-another-life-as-paralysed-survivors-death-ruled-homicide-13328132",
            "upvotes": 464,
            "date": "03/20/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-anne-marie-hochhalter_6855513.jpg?20250313212946",
            "top_comments": [
                "Anne Marie Hochhalter died of sepsis. She was shot in the chest and back during the shooting leaving her paralyzed from the waist down. The grief caused her mom to shoot and kill herself in a pawn shop after asking to see a revolver. The death toll from Columbine is now 14.",
                "Columbine, the event that changed everything and nothing.",
                "I remember my mom just turning the TV off when this happened. I had a nightmare just off the little bit that I watched.",
                "I remember a few years ago when the victims of Columbine started to be gone longer than they had ever been alive and it was a real sober moment. Its amazing how much the story of Columbine has developed, like kids these days will never understand how after this happened the talk was about music, video games, and bullying, and only years later more focused on how the shooters were psychopaths to the nth degree, their real plans, and what all really went on in the library.",
                "Columbine happened the year before I started high school and I remember being terrified but also feeling like it was this seemingly once-in-a-lifetime thing, like it wasn't *actually* something I or the average kid had to worry about & it was just my anxiety getting the best of me.\n\nCrazy that now it's literally just commonplace. It's always sad, but it's never a shock anymore- it's just the way our broken country works.",
                "I hadn't known much about Columbine (not from the US) until reading A Mother's Reckoning recently.\nWhat a horrific tragedy. My heart goes out to everyone affected.",
                "Anyways just remember that we refuse to admit that the two shooters were influenced by white supremacy and were looking to beat Timothy McVeigh's \"high score\". They instead blamed it on bullying, videogames, and even satanism.",
                "Yet, the USA continues to have an enormous problem with guns. Your politicians pose with assault rifles in their family Christmas cards. The USA is number 1 in developed countries for school shootings. They’ve learned nothing since Columbine. But hey, at least you’ve got your “rights” to carry. Clearly the USA is a very sick country, as many would rather have the “right” to possess a gun, over the right for children to feel and be safe in school.",
                "The parents on these 2 imbeciles got off easy"
            ],
            "aggregate_sentiment": 6.0
        },
        {
            "category": "NEW",
            "title": "3 people face federal charges in Tesla arson attacks in U.S. as 80 more vehicles at Canada dealership are damaged",
            "external_url": "https://www.nbcnews.com/news/us-news/3-face-federal-charges-tesla-arson-attacks-rcna197340",
            "upvotes": 1323,
            "date": "03/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250213-Cybertruck-aa-1045-dd55f3.jpg",
            "top_comments": [
                "There is an author of many satire books from Germany called Marc-Uwe Kling and one of his quotes always comes to mind when seeing stories like this: \n\n(Keep in mind, it’s satire) “I like far right extremists way more than far left extremists. Far left extremists burn cars and far right extremists burn foreigners… and I don’t own any foreigners”",
                ">\"The days of committing crimes without consequence have ended,\" Bondi said in a statement.\n\nUntil Trump is rotting in prison where he belongs, this statement is complete bullshit.",
                "What about the January 6th invaders 🤔",
                "Why is it a \"Federal charge\" for destroying private property? This should be thrown out.",
                "Elon deserves the pain but I don't think he's worth throwing your life away for.  Why go to prison for the next 20 years while Elon is chilling on the outside and chugging along to become the world's first trillionaire?",
                "I'm sorry. \nI don't condone the vandalism, but they weren't targeting people.  This was vandalism and arson. \nTrump is labeling them domestic terrorists and is probably going to push for the death penalty.  That's overkill.",
                "It’s all fun and anarchy til someone gets popped fucking w the wrong persons car.",
                "Ma’am your president faced zero consequences for 34 felonies",
                "I cannot believe Joe Biden did this. Deplorable.",
                "Good.  Fuck these people.  I'm not saying that the sentence is fair.  I'm saying fuck people who make a political point by comiting arson and vandalizing their neighbors property... when at least 50% of the time the owners of the cars may even have same political outlook.\n\nOh, you didn't know Elon was gonna make a Nazi solute 3 years after you bought your dream car? This will teach you!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Two men convicted of murder-for-hire plot against Iranian American journalist in New York",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/20/masih-alinejad-murder-case-conviction-iran",
            "upvotes": 117,
            "date": "03/20/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/b2b46f4bac01d10e4d0017876e42278c56001dab/0_345_5416_3251/master/5416.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9ceeca5c357f66c5fe1701764c0224b3",
            "top_comments": [
                "Their big mistake was to not have their boss buy up golf tournaments.",
                "What times we live in.",
                "Israel and ru would like nothing more than a war between the US and Iran."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Judge blocks deportation of Georgetown University researcher detained by ICE",
            "external_url": "https://www.cbsnews.com/news/georgetown-university-researcher-detained-by-ice/?utm_source=flipboard&utm_content=CBSNews/magazine/Latest+Headlines",
            "upvotes": 778,
            "date": "03/20/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/20/8b76ea88-a0d8-482e-8369-4f0b19083680/thumbnail/1200x630/aa6b97b16a9e63afdfa671a769b312a0/gettyimages-2195569116.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "Ooops... We put him on a plane while this hearing was taking place. /s",
                "If ICE won't release him, somebody has to get him out of detention asap otherwise dump ignore the ruling and put him on a plane. He's a dictator and someone has to stop him.",
                "Like they care about the law",
                "I don't think this is going to stop them.",
                "Trump and company will just ignore it, I guarantee it",
                "As if the government of (out)law and (dis)order would listen to the courts."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "NEW",
            "title": "Pirate's Booty founder stages Long Island mutiny, declares he's mayor and tries to fire village staff",
            "external_url": "https://www.nbcnews.com/news/us-news/pirates-booty-founder-stages-long-island-mutiny-declares-mayor-tries-f-rcna197308",
            "upvotes": 911,
            "date": "03/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250320-robert-ehrlich-pirate-booty-ONETIMEUSE-mn-1155-72e157.jpg",
            "top_comments": [
                ">As a write-in candidate, Ehrlich had virtually no chance of winning on Tuesday.\n\n>When asked if he might take another shot at running for mayor in two years, utilizing more conventional methods that could land him on the ballot, Ehrlich said: “No, I’m mayor now. Why do I have to wait two years? I am mayor at this moment. I can write an executive order.”\n\nThis man is a crazy person.  He also lost 62 to 1,064.",
                "“So one of my supporters voted three times,\" Erlich claimed to NBC News. \"Another one voted four times and they didn’t even realize that he was coming in that many times. \"”\n\nAnd he still only got 62 votes!",
                "Did I just have a stroke, or is that a real headline?",
                "This sounds like a stunt to show people how outrageous it is to have trump as our president. \n\nI wonder if this is real, or some sort of social commentary",
                "makes sense coming from a pirate",
                "The ballot read:\n\n○Incumbent (D)\n\n○Robert Ehrlich (Arrrr!)",
                "He's got the land scurvy. Does not look like a man who eats fruit.",
                "In a better world, this is how Jan 6th should have gone.",
                "I love this entire headline.  Couldn’t tell if I was awake or nodded off for a min",
                "Any one want to guess who he voted for President? Guess that's one more company I never need to buy again."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "NEW",
            "title": "Trump signs executive order to dismantle the Education Department",
            "external_url": "https://www.nbcnews.com/politics/white-house/trump-signs-executive-order-dismantle-education-department-white-house-rcna197251",
            "upvotes": 15047,
            "date": "03/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250320-donald-trump-linda-mcmahon-vl-1056a-273d79.jpg",
            "top_comments": [
                "I didn't realize the president could just run the nation with executive orders",
                "(He technically cannot do this but that hasn’t stopped him yet)",
                "Educated populace is difficult to manipulate.",
                "They want your children working.",
                "Very sad day for America.  Trump can't do much without Congress here, but Republicans seem to be pretty much on board with closing the whole thing down.\n\nI wonder if they realize that school curriculum is already controlled at a state level?",
                "[removed]",
                "There's no way this holds up. Establishing and disestablishing departments like this requires an act of Congress.\n\nThat doesn't mean that this won't do tremendous damage to the department in the meantime, but this will almost certainly be challenged.",
                "Apr 3, 2016 — We won with poorly educated. “I love the poorly educated,” the Republican presidential front-runner boasted after coasting to a decisive victory.",
                "I remember when the right were outraged by Obama’s executive orders so much so that they began referring him as Chairman Obama. \n\nAnd what do you hear now? Crickets.",
                "So, who's handling the student loans applications and funding now? I'm assuming private banks and companies?"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Teslas under attack as Musk backlash grows",
            "external_url": "https://news.sky.com/video/teslas-under-attack-as-musk-backlash-grows-13332242",
            "upvotes": 2379,
            "date": "03/20/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-tesla-us_6861757.jpg?20250320070121",
            "top_comments": [
                "This is why CEOs tend to just buy their politicians and don’t actually get involved personally.   He has made himself and his products a target by getting into the political arena.\n\nIf he was smart he would bow out soon and stay out of the public eye for a bit.   That pesky narcissism won’t allow for that though.",
                "Is the CEO of a publically traded company that sells consumer goods making himself the public mascot for Fascism and firing thousands of people a bad business strategy?",
                "So strange to see republicans suddenly liking electric vehicles.",
                "It looks like they exploded on their own due to poor materials and shoddy workmanship. I hope Tesla has to reimburse the community for fixing their problems.",
                "I had pasta for lunch",
                "It could be an inside job as they aren't selling [https://electrek.co/2025/03/20/tesla-confirms-it-cant-sell-the-cybertruck-even-with-tax-credit-and-discounts/](https://electrek.co/2025/03/20/tesla-confirms-it-cant-sell-the-cybertruck-even-with-tax-credit-and-discounts/)",
                "It's the Boston Tesla Party!",
                "If 1/6 taught me anything, it is that these folks are just enthusiastic tourists wanting to show Tesla their love.",
                "Im surprised the share price is at $260 mark still. \n\nShould be trading way way less, if the public in multiple countries are burning your stores to the ground, thats not really a good earnings call report when factor numbers of stores left in ashes.",
                "It’s not vandalism, it’s just a Roman bonfire."
            ],
            "aggregate_sentiment": 40.0
        },
        {
            "category": "RISING",
            "title": "Zelensky tells Russia to drop 'unnecessary' demands ahead of peace talks",
            "external_url": "https://www.bbc.co.uk/news/articles/c234y2e9kzlo",
            "upvotes": 319,
            "date": "03/20/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f068/live/afed08b0-05b2-11f0-b2ad-a94aba055f71.jpg",
            "top_comments": [
                "That’s right Zelenskyy hold your ground and make the demands Ukraine deserves. You have fought against one of the great superpowers and kept them from stealing your country like they intended. \n\nYou deserve to be recognized by the entire world as the hero you are!!!",
                "Zelensky is a great leader of his country, and Ukrainians are true patriots and warriors, but when you are left alone with such a huge monster as Russia and such a cunning chameleon as Trump, you become helpless. And this is very sad.",
                "I feel so bad for them. The one country that could help, is taking advantage of their dire situation to squeeze out what they can. False promises that are made before letting Putin take full control. What a terrible period this will be remembered as"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Judge blocks deportation of Georgetown University researcher detained by ICE",
            "external_url": "https://www.cbsnews.com/news/georgetown-university-researcher-detained-by-ice/?utm_source=flipboard&utm_content=CBSNews/magazine/Latest+Headlines",
            "upvotes": 779,
            "date": "03/20/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/20/8b76ea88-a0d8-482e-8369-4f0b19083680/thumbnail/1200x630/aa6b97b16a9e63afdfa671a769b312a0/gettyimages-2195569116.jpg?v=9e5c48f1b04ac2a564e8a4c51250ac89",
            "top_comments": [
                "Ooops... We put him on a plane while this hearing was taking place. /s",
                "If ICE won't release him, somebody has to get him out of detention asap otherwise dump ignore the ruling and put him on a plane. He's a dictator and someone has to stop him.",
                "Like they care about the law",
                "I don't think this is going to stop them.",
                "Trump and company will just ignore it, I guarantee it",
                "As if the government of (out)law and (dis)order would listen to the courts."
            ],
            "aggregate_sentiment": 20.0
        },
        {
            "category": "RISING",
            "title": "Houston janitor who urinated in water bottles at doctor’s office, spreading STDs to workers sentenced to prison",
            "external_url": "https://www.click2houston.com/news/local/2025/03/19/houston-janitor-who-urinated-in-water-bottles-at-doctors-office-spreading-stds-to-workers-sentenced/",
            "upvotes": 2127,
            "date": "03/20/2025",
            "thumbnail": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/U2DTQ6TYBZEBLO5G6XDWZQCNLI.png?_a=DATAdtfiZAA0",
            "top_comments": [
                ">According to prosecutors, Diaz already served more than two years behind bars. He will be eligible for parole after serving three years of his six year sentence\n\nSeems kind of light, considering...",
                ">The convicted will not have to register as a sex offender\n\n>A man with multiple sexually transmitted and communicable diseases was sentenced to six years in prison for urinating into office workers’ water bottles, resulting in the victims contracting herpes simplex 1 and hepatitis A.\n\n\nI'm a bit lost on why this instance would not be worthy of registering as a sex offender.",
                "Its some sick motherfuckers out there.",
                "6 years for spreading permanent diseases? Seems too light",
                "Anyway, some kid is gonna get 20 years for vandalizing a Telsa dealership lol",
                "How selective of him to only go for people that were about to go to prison.\n\nIn other news: Commas.",
                "Should be RFK Jr's deputy at HHS by next week. Sick, twisted fuck.",
                "According to the article, it was considered assault with a deadly weapon.",
                "> Blood and urine samples were obtained from Diaz and results indicated he tested positive for herpes simplex 1 virus and hepatitis A. One of them was incurable, documents state. The victim also had lab work done and learned she had contracted the incurable diseases.\n\nHe's a sicko who deserves a harsher sentence than 6 years. He ruined lives.",
                "Honey, I got it from drinking water at work. I swear"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "1999 Columbine school massacre claims another life as paralyzed survivor's death ruled homicide: Complications from Anne Marie Hochhalter's paralysis were a \"significant contributing factor\" in her death, according to a forensic pathologist",
            "external_url": "https://news.sky.com/story/1999-columbine-school-massacre-claims-another-life-as-paralysed-survivors-death-ruled-homicide-13328132",
            "upvotes": 459,
            "date": "03/20/2025",
            "thumbnail": "https://e3.365dm.com/25/03/1600x900/skynews-anne-marie-hochhalter_6855513.jpg?20250313212946",
            "top_comments": [
                "Anne Marie Hochhalter died of sepsis. She was shot in the chest and back during the shooting leaving her paralyzed from the waist down. The grief caused her mom to shoot and kill herself in a pawn shop after asking to see a revolver. The death toll from Columbine is now 14.",
                "Columbine, the event that changed everything and nothing.",
                "I remember my mom just turning the TV off when this happened. I had a nightmare just off the little bit that I watched.",
                "I remember a few years ago when the victims of Columbine started to be gone longer than they had ever been alive and it was a real sober moment. Its amazing how much the story of Columbine has developed, like kids these days will never understand how after this happened the talk was about music, video games, and bullying, and only years later more focused on how the shooters were psychopaths to the nth degree, their real plans, and what all really went on in the library.",
                "Columbine happened the year before I started high school and I remember being terrified but also feeling like it was this seemingly once-in-a-lifetime thing, like it wasn't *actually* something I or the average kid had to worry about & it was just my anxiety getting the best of me.\n\nCrazy that now it's literally just commonplace. It's always sad, but it's never a shock anymore- it's just the way our broken country works.",
                "I hadn't known much about Columbine (not from the US) until reading A Mother's Reckoning recently.\nWhat a horrific tragedy. My heart goes out to everyone affected.",
                "Anyways just remember that we refuse to admit that the two shooters were influenced by white supremacy and were looking to beat Timothy McVeigh's \"high score\". They instead blamed it on bullying, videogames, and even satanism.",
                "Yet, the USA continues to have an enormous problem with guns. Your politicians pose with assault rifles in their family Christmas cards. The USA is number 1 in developed countries for school shootings. They’ve learned nothing since Columbine. But hey, at least you’ve got your “rights” to carry. Clearly the USA is a very sick country, as many would rather have the “right” to possess a gun, over the right for children to feel and be safe in school.",
                "The parents on these 2 imbeciles got off easy"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "3 people face federal charges in Tesla arson attacks in U.S. as 80 more vehicles at Canada dealership are damaged",
            "external_url": "https://www.nbcnews.com/news/us-news/3-face-federal-charges-tesla-arson-attacks-rcna197340",
            "upvotes": 1324,
            "date": "03/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250213-Cybertruck-aa-1045-dd55f3.jpg",
            "top_comments": [
                "There is an author of many satire books from Germany called Marc-Uwe Kling and one of his quotes always comes to mind when seeing stories like this: \n\n(Keep in mind, it’s satire) “I like far right extremists way more than far left extremists. Far left extremists burn cars and far right extremists burn foreigners… and I don’t own any foreigners”",
                ">\"The days of committing crimes without consequence have ended,\" Bondi said in a statement.\n\nUntil Trump is rotting in prison where he belongs, this statement is complete bullshit.",
                "What about the January 6th invaders 🤔",
                "Why is it a \"Federal charge\" for destroying private property? This should be thrown out.",
                "Elon deserves the pain but I don't think he's worth throwing your life away for.  Why go to prison for the next 20 years while Elon is chilling on the outside and chugging along to become the world's first trillionaire?",
                "I'm sorry. \nI don't condone the vandalism, but they weren't targeting people.  This was vandalism and arson. \nTrump is labeling them domestic terrorists and is probably going to push for the death penalty.  That's overkill.",
                "It’s all fun and anarchy til someone gets popped fucking w the wrong persons car.",
                "Ma’am your president faced zero consequences for 34 felonies",
                "I cannot believe Joe Biden did this. Deplorable.",
                "Good.  Fuck these people.  I'm not saying that the sentence is fair.  I'm saying fuck people who make a political point by comiting arson and vandalizing their neighbors property... when at least 50% of the time the owners of the cars may even have same political outlook.\n\nOh, you didn't know Elon was gonna make a Nazi solute 3 years after you bought your dream car? This will teach you!"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Judge bars Musk's DOGE team from Social Security records in scathing ruling",
            "external_url": "https://www.cnbc.com/2025/03/20/judge-bars-musks-doge-team-from-social-security-records.html?utm_source=flipboard&utm_content=user%2FCNBC",
            "upvotes": 29697,
            "date": "03/20/2025",
            "thumbnail": "https://image.cnbcfm.com/api/v1/image/108118453-1742406884122-gettyimages-2205899441-4m7a5252_j0ib0j01.jpeg?v=1742406923&w=1920&h=1080",
            "top_comments": [
                "*Judge Ellen Lipton Hollander in a* [*scathing ruling*](https://storage.courtlistener.com/recap/gov.uscourts.mdd.577321/gov.uscourts.mdd.577321.49.0.pdf) *accused* [*DOGE*](https://www.cnbc.com/2025/02/07/elon-musk-doge-racist-treasury-x-staff.html) *of launching a “fishing expedition” at the Social Security agency and failing to provide any reason why it needed to access vast swaths of Americans’ personal and private data.*\n\nHurrah!!  She attacked DOGE for insisting on the total secrecy and privacy of their operatives while granting zilch such recognition of the tens of millions personal records they demand access to.",
                "\"Hollander, noting the affiliates of DOGE have kept their identities hidden, wrote, “ironically, the identity of these DOGE affiliates has been concealed because defendants are concerned that the disclosure of even  their names would expose them to harassment and thus invade their privacy.”\n\nA-fucking-men",
                "\"Are you tired of winning?\" has turned into \"Can we win once?\"",
                "Throw the book at these little mid 20s shits. They shouldn’t be anywhere near the government.",
                "That only works with administrations that follow the law",
                "They don't even have the names of the people who had access to said data. And it's a TRO.",
                "Before someone says “ThEy’lL jUsT iGnOrE the oRdErS” - note that the administration has been forced to follow orders then whined about it.  They aren’t as all powerful as they like to portray they are \n\nThey know while republicans are feckless and have placed their balls squarely in President Elon’s hands for safe keeping - they can only be pushed so far. \n\nThere’s a lot do resist. A lot of nonsense this administration is doing to enrich themselves and a lot of cleanup we have to do. \n\nCelebrate the win. Highlight if and when the administration ignores the law and keep fighting.\n\nEdit: added some clarifying text.",
                "They're getting ready to start pillaging social security. Lots of grandparents and disabled people are going to get branded frauds so billionaires can upgrade the helipads and moonpools on their yachts",
                "Now I guess we wait and see if they actually follow the order. I put the odds at no better than 50/50, which is like 50% lower than basically any previous administration, even Nixon.",
                "Social Security is sacred grounds. They’ve already stopped phone support which will create havoc for the elderly. Touching benefits will be the poison pill that may finally cure the cancer running throughout the current administration. I hope but not holding my breath."
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Trump signs executive order to dismantle the Education Department",
            "external_url": "https://www.nbcnews.com/politics/white-house/trump-signs-executive-order-dismantle-education-department-white-house-rcna197251",
            "upvotes": 15017,
            "date": "03/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250320-donald-trump-linda-mcmahon-vl-1056a-273d79.jpg",
            "top_comments": [
                "I didn't realize the president could just run the nation with executive orders",
                "(He technically cannot do this but that hasn’t stopped him yet)",
                "Educated populace is difficult to manipulate.",
                "They want your children working.",
                "Very sad day for America.  Trump can't do much without Congress here, but Republicans seem to be pretty much on board with closing the whole thing down.\n\nI wonder if they realize that school curriculum is already controlled at a state level?",
                "[removed]",
                "There's no way this holds up. Establishing and disestablishing departments like this requires an act of Congress.\n\nThat doesn't mean that this won't do tremendous damage to the department in the meantime, but this will almost certainly be challenged.",
                "Apr 3, 2016 — We won with poorly educated. “I love the poorly educated,” the Republican presidential front-runner boasted after coasting to a decisive victory.",
                "I remember when the right were outraged by Obama’s executive orders so much so that they began referring him as Chairman Obama. \n\nAnd what do you hear now? Crickets.",
                "So, who's handling the student loans applications and funding now? I'm assuming private banks and companies?"
            ],
            "aggregate_sentiment": 48.0
        },
        {
            "category": "RISING",
            "title": "67,000 white South Africans have expressed interest in Trump's plan to give them refugee status",
            "external_url": "https://apnews.com/article/trump-white-refugee-afrikaner-south-africa-0fbca411470d3b439886cabc12c7600d",
            "upvotes": 1462,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Allowing in immigrants to increase their party's numbers... exactly what the GOP falsely accused Dems of doing. Shocker.",
                "Great just what we needed 76,000 copies of Ninja from Die Antword.",
                "This government is so transparent (in all the wrong ways). \n\nI wonder why Trump suddenly has a fixation with South Africa, Tesla, and meme coins?",
                "They are chasing apartheid.",
                "Wait so they are deprting brown people and importing whites instead ?\n\nThat sounds like  replacement , you know , like the theory.. 😶",
                "This is due to a DEI policy instituted by Dementia Donny. The guy who cries about DEI makes his own racist version of DEI.",
                "What, Trump is allowing refugees?\n\nSee white in title\n\nOh that's why",
                "Is the TOUGH ON IMMIGRATION!!!!!! in the room with us?",
                "Please no more, they’re not sending their best",
                "This season of US politics is absolutely wild."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "RISING",
            "title": "Pirate's Booty founder stages Long Island mutiny, declares he's mayor and tries to fire village staff",
            "external_url": "https://www.nbcnews.com/news/us-news/pirates-booty-founder-stages-long-island-mutiny-declares-mayor-tries-f-rcna197308",
            "upvotes": 916,
            "date": "03/20/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-03/250320-robert-ehrlich-pirate-booty-ONETIMEUSE-mn-1155-72e157.jpg",
            "top_comments": [
                ">As a write-in candidate, Ehrlich had virtually no chance of winning on Tuesday.\n\n>When asked if he might take another shot at running for mayor in two years, utilizing more conventional methods that could land him on the ballot, Ehrlich said: “No, I’m mayor now. Why do I have to wait two years? I am mayor at this moment. I can write an executive order.”\n\nThis man is a crazy person.  He also lost 62 to 1,064.",
                "“So one of my supporters voted three times,\" Erlich claimed to NBC News. \"Another one voted four times and they didn’t even realize that he was coming in that many times. \"”\n\nAnd he still only got 62 votes!",
                "Did I just have a stroke, or is that a real headline?",
                "This sounds like a stunt to show people how outrageous it is to have trump as our president. \n\nI wonder if this is real, or some sort of social commentary",
                "makes sense coming from a pirate",
                "The ballot read:\n\n○Incumbent (D)\n\n○Robert Ehrlich (Arrrr!)",
                "He's got the land scurvy. Does not look like a man who eats fruit.",
                "In a better world, this is how Jan 6th should have gone.",
                "I love this entire headline.  Couldn’t tell if I was awake or nodded off for a min",
                "Any one want to guess who he voted for President? Guess that's one more company I never need to buy again."
            ],
            "aggregate_sentiment": 60.0
        }
    ],
    "last_updated": "03/21/2025 00:40:46 UTC"
}