{
    "posts": [
        {
            "category": "HOT",
            "title": "French Scientist Reportedly Denied U.S. Entry Due to Trump Criticism",
            "external_url": "https://newrepublic.com/post/192946/french-scientist-denied-us-entry-trump-criticism",
            "upvotes": 25233,
            "date": "03/19/2025",
            "thumbnail": "https://images.newrepublic.com/df32fc6dfc42d5dcddd8933438d7a9a07f5c533f.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
            "top_comments": [
                "So much for freedom of speech.",
                "Good thing he got to back to France and not deported to a concentration camp.",
                "Horrifying\n\n>The French newspaper Le Monde reports that on March 9, a space researcher was randomly selected upon arrival in Houston for a search, and CBP found messages criticizing the Trump administration’s treatment of scientists, which, according to the agency, “conveyed hatred of Trump & could be qualified as terrorism.”\n\nI guess around half of america are  terrorists now, according to whoever said that.",
                "Places people don’t want to go because they’re afraid of being jailed or deported for no reason:\n\n- Russia\n- North Korea\n- Iran\n- USA\n\nCongrats. Too much freedom I guess. ",
                "What a complete shit show.",
                "Anyone that thinks this person is just gonna go willingly after his term is up has another thing coming.",
                "USA is now just a fat North Korea",
                "Yamtits is the biggest man baby in the world with Elon a close second. It's amazing to me that bloated sack of monkey crap is actually president.",
                "”hatred of Trump & could be qualified as terrorism”. So I guess no one is going to be let into the USA anymore?",
                "Reading all the news coming out of the US, it feels like a surreal TV show.\nAlso, can he theoretically change the laws and be able to serve a third term, or is it impossible?🤞"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "HOT",
            "title": "'Out of control' Tesla ploughs into pedestrians on busy London street injuring seven",
            "external_url": "https://www.lbc.co.uk/crime/tesla-crowd-london-stepney-green-east-end/",
            "upvotes": 7015,
            "date": "03/19/2025",
            "thumbnail": "https://images.lbc.co.uk/images/711463?width=692&crop=16_9&signature=2K0o7cbWGdo3vMUBKWoPQ0n4Qm0=",
            "top_comments": [
                "They're sick of being burned , they are revolting!",
                "Out of the way, citizen. Cities are for autonomous vehicles to drive through.",
                "Musk is going to claim this Tesla was hacked by Ukraine.",
                "Tessler. It's all computer.",
                "Oh oh they’re fighting back",
                "So is this Counter Terrorism? Donald?",
                "I do think its hilarious that Trump has ordered Musk and Boeing to hastily build him 2 new airforce ones. Teslas are garbage and Boeing is killing whistle-blowers on how faulty their shit is.",
                "Lidar is an hoax said the \"genius\"!",
                "This will make the stock price go up somehow.",
                "Maybe the Tesla felt threatened"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "HOT",
            "title": "Trump fires both Democratic commissioners at FTC",
            "external_url": "https://www.reuters.com/world/us/trump-fires-both-democratic-commissioners-ftc-sources-say-2025-03-18/",
            "upvotes": 15641,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So Biden was for some reason unable to fire FTC chairs but all of a sudden Trump is able to. Interesting.",
                "Everyday is another outrage. Another law violated. And Congress just sits there like meek little sheepdogs. At this point, they all need to go",
                "Trump *illegally* fires both Democratic commissioners at FTC. \n\nFucking complicit media.",
                "If it's removing fraud and corruption and waste why is it only democrats?",
                "Dictator just doing dictator things, nothing to be alarmed of",
                "He said he’d only be a dictator on day one, wait, did Big Mac lie to us? ",
                "what's the consequence if we just ignore him the way he ignores the law? they could say \"oh no im still employed here, he has not fired me because he cannot fire me\" and what would be the functional difference?",
                "\"Illegally gutting the Commission will empower fraudsters and monopolists, and consumers will pay the price,\"\n\nWell we can see his motivation, Mr Mango \"The grift\" Mussolini.",
                "Trump considers every Democrat an enemy and that's why so many families don't talk anymore.",
                "\"The firings drew sharp criticism from Democratic senators...\"\n\nYes, we know, they are all outraged. I wish they did more."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "HOT",
            "title": "USDA cancels $1 billion in funding for schools and food banks slated for local farmers, ranchers and producers",
            "external_url": "http://www.cbsnews.com/news/usda-cancels-local-food-purchasing-food-banks-school-meals/",
            "upvotes": 5506,
            "date": "03/19/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/06/13/292c1ec7-31fc-447f-b459-5881c78671b3/thumbnail/1200x630/c42b2f227f9eb0f3da4219bb77f49fee/gettyimages-1243012161.jpg?v=765ef194a4bf4701e45ec9d5712af42f",
            "top_comments": [
                "I’m sure this will help the country.",
                "So we're ~~dropping~~  giving10 billion to farmers for assistance, but dropping money that helps farmers feed our children? What the fuck.\n\n[https://www.usda.gov/about-usda/news/press-releases/2025/03/18/usda-expediting-10-billion-direct-economic-assistance-agricultural-producers](https://www.usda.gov/about-usda/news/press-releases/2025/03/18/usda-expediting-10-billion-direct-economic-assistance-agricultural-producers)",
                "> \"Unlike the Biden Administration, which funneled billions in [Commodity Credit Corporation] funds into short-term programs with no plan for longevity, USDA is prioritizing stable, proven solutions that deliver lasting impact,\"\n\nThe Biden admin actually implemented plans to help the American people.\n\nThe Trump admin either destroys these programs with no alternative plan to action, or a plan to divert funds to personally enrich themselves and their wealthy friends.\n\nNot loudly broadcasting the accomplishments of the Biden admin is one of many misteps the Dems made, because the more programs the Trump admin destroys, the more clear it becomes just how much good Biden actually did.",
                "The Republican party hate the American people and get off by harming us.",
                "Trump voters just keep on winning.",
                "So, tariffs are supposed to encourage domestic production, but he's also slashing everything that actually makes domestic production possible.\n\nWe're going to envy the generation that lived thru the Great Depression because of this imbecile.",
                "If only they would’ve released a manual explaining step by step what their plan was. At least give folk a heads up ya’ know.",
                "Depriving food from children. That is America becoming great again",
                "Thats Donnie, Making America great. Those farmers, yeah they dont matter. Hope the Farmers knew better than to vote for that asshole.",
                "Why is school lunch not a thing? Does the government hate our kids that much?"
            ],
            "aggregate_sentiment": 28.0
        },
        {
            "category": "HOT",
            "title": "Germany updates US travel advice after citizens detained",
            "external_url": "https://www.reuters.com/world/europe/germany-updates-us-travel-advice-after-citizens-detained-2025-03-19/",
            "upvotes": 5282,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump is really brilliant. The U.S. tourism market is worth 2.36 trillion dollars annually. \n\n  \nDoes making america great again include decimating its global lead in tourism revenue?",
                "FRANCE had citizens rejected entry for anti-Trump messages on their phone just Today. Source: https://www.liberation.fr/international/amerique/un-scientifique-francais-refoule-a-son-entree-aux-etats-unis-pour-des-messages-anti-trump-paris-grince-des-dents-20250319_JD7JAIVY4ZHE5CI33F7TBNR4CI/\n\nTravel advice at this point should be: Level 3: Reconsider Travel due to a limited ability to provide emergency consular services and arbitrary enforcement of local laws, especially if entering from a 3rd country like Mexico or Canada. US Green card holders and those traveling on US visas should be prepared for their status to be canceled upon entry.\n\nGERMANS: CANCEL YOUR NON ESSENTIAL TRAVEL PLANS TO THE USA UNTIL THE POLITICAL CLIMATE REVERTS TO SOMETHING MORE NORMAL.",
                "Our tourism industry is about to implode.",
                "Considering under Trump, you can be scooped up and deported to detention centres with zero merit, or worse be unlawfully targeted and illegally detained as a ‘terrorist’, solely by word of mouth and no conviction…… that sure makes for a unsafe / unstable destination for foreign nationals. \n\nI would not travel to the USA under this Administration if you paid me to.",
                "Were all these customs agents or whatnot just chomping at the bit to detain/torture foreigners all these years but were constrained by presidents following the law/constitution?",
                "“Don’t. Go. To. America.”\n\nYes. That’s all. \n\nJust fucking avoid it.  \n\nHow long?\n\nTen years minimum.",
                "We'll get like North Korea or Afghanistan or Russia. No reasonable Westerner will visit.",
                "No way will I go to the US in the near future",
                "Basically if you want to risk being detained with no due process most likely tortured and mistreated. Travel to the US.  WOW what a self own down there in the US of A",
                "What Donald Trump and his isolationist supporters don't understand is that we are all interdependent on each. Congratulations you've killed off the tourist industry and now how are you going to replace the income it brings in?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "HOT",
            "title": "Amtrak CEO Stephen Gardner resigns effective today \"to ensure that Amtrak continues to enjoy the full faith and confidence of this administration.\"",
            "external_url": "https://www.cnn.com/2025/03/19/business/amtrak-ceo-steps-down?cid=external-feeds_iluminar_google",
            "upvotes": 4619,
            "date": "03/19/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1496428067.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Musk famously despises trains having proposed any number of harebrained train alternatives in order to stall or detail train initiatives.\n\nThis can’t end well.",
                "This is the State controlling industries by pressuring them to install loyal leadership.\n\n\nWhere are all the rightists worried about Oscialist boogeyman?",
                "Prior to the pandemic, Amtrak was projected to hit profitability around 2022-2023 but the setback means that it’ll be a few more years (sans whatever bullshit Trump and Musk do). People yearn for the trains and this is documented significantly by the expansion of rail service in Virginia, The Midwest and elsewhere. \n\nThe Chicago-Twin Cities *Borealis* (aka 2nd round trip between the pairs) service that started last year has beaten ridership expectations and the stakeholders wanna add another trip a few years earlier than planned. Amtrak Virginia service has had ridership soar with each year beating the last. \n\nOne of the biggest issues I think Amtrak faces is, by law, they’re not allowed to fund/operate services less than 750miles (~1200km). Savannah, GA to New York *Palmetto*, Charlotte to New York *Carolinian* services for example are state funded because that’s the law, Amtrak is just the contractor. \n\nNot only this but Amtraks charter requires them to be profitable meaning that LD services are insanely expensive. \n\nIf we want Amtrak to be successful then we need to allow it to be far more independent than it already is. Let it run shorter and medium haul services that can generate a profit for longer distance trains to be subsidized. Expedite the overhaul and replacement of Amtrak equipment. \n\nHigh speed rail is useless without a good network of regional and intercity trains. People yearn for the trains.",
                "Great, I've got a ticket for a trip in a couple of months. I should probably start planning for alternative transportation in case they blow shit up.",
                "“I think we should privatize anything that can be privatized, just so you’ve got a feedback loop for improvement, is what happens when something’s privatized,”  - Musk\n\nWhat he really means is that we need more avenues for the rich to get richer and the poor to get poorer. This is how the country gets better right? After all, we have many examples of services being privatized and then improving greatly... /s",
                "“I think we should privatize anything that can be privatized, just so you’ve got a feedback loop for improvement, is what happens when something’s privatized,” Musk continued. **“Basically something’s got to have some chance of going bankrupt or there’s not a good feedback loop for improvement.”**\n\n\nMusk is a fucking idiot. He thinks that improvement can only be driven by money and not through passion or the desire to improve things in general. Shit stain thinks everything has to be related to money.",
                "Fascists always take control of the railroad companies/railways.\n\n🤷🏻‍♂️",
                "Don’t surrender in advance",
                "Who other than Elon is trusted by this administration?",
                "That spells BAD NEWS for Amtrak employees with what's going on now, think USPS and Dejoy."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "Ice agents detain woman known for immigration advocacy in Colorado | US immigration",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/19/jeanette-vizguerra-ice-colorado",
            "upvotes": 1786,
            "date": "03/20/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/991982bb6db500e7e1f3657debdf43f0bf1cd9d2/0_100_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=25975fc1089e83dc3916494a8de3e43b",
            "top_comments": [
                "What happened to only going after rapists and murderers?",
                "From the article: \n\nShe pleaded guilty to “attempted possession of a forged instrument”, which the network noted prompted heightened scrutiny from immigration authorities. She spent the next several years appealing multiple deportation orders.\n\nVizguerra has had several stays during her attempts to seek citizenship, per CBS News, and sought refuge at churches.\n\nJordan Garcia of the American Friends Service Committee, who has been in contact with Vizguerra’s lawyer and family and spoke with the Associated Press, said Vizguerra had been trying to gain a visa since leaving sanctuary in churches in 2020.",
                "So we are ruzzia and China now. ",
                ">She gained national attention in 2017 when she took sanctuary in a Denver church to avoid deportation during the first Trump administration.\n\nAhh, so this is just settling another vendetta for Trump. Meanwhile he's got a rapist attacking the Prime Minister of Ireland because he let Rosie O'Donnell move there before he could round her up as well.",
                "They really are following the manual, aren't they?",
                "What exactly does immigration advocacy mean? If it means she’s teaching people how to circumvent and cheat the immigration process… As a legal immigrant, I say lock her up.",
                "She entered the country illegally, broke the law and folks are wondering why she's being deported?",
                "That’s ICE, go for the person work raising kids and paying their bills, bunch of f***ing losers",
                "Unfortunately for her she has no right to be in the country. Probably best not to announce that to the world\n\nThe Guardian has really become garbage with its clickbait headlines, it makes it harder to track the actual bad shit the administration is doing"
            ],
            "aggregate_sentiment": 42.0
        },
        {
            "category": "HOT",
            "title": "Sponsors drop San Francisco Pride as festival decries ‘rights backtracking’",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/18/anheuser-busch-coors-pull-sponsorship-san-francisco-pride?CMP=Share_iOSApp_Other",
            "upvotes": 1939,
            "date": "03/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/32ab4d32c19c3c344770611b49ff8ded0eeaa60e/36_0_1125_675/master/1125.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a73cd9c10171b464b1648dbb375a42f4",
            "top_comments": [
                "As a gay man, let me tell you that most people who celebrate Pride never thought much of corporate sponsorship. The best pride events are local gatherings,  in parks with picnics.  The ones with all the glam and glitz were just that - glam and glitz. I'd much rather spend an afternoon with friends and neighbors just hanging out than have music and glitz being pumped at me. \n\n\nFor those of us who celebrate togetherness and community, the loss of corporate money won't bother us much. Many of us also tend to support local versus corporate as well. ",
                "On the one hand, their \"support\" was always a gross, transparent attempt at profiteering. It was - or should have been - obvious to everyone that they would ditch LGBT stuff the minute social headwinds shifted\n\n\nThe concerning part is WHY they're doing it. The fact that all of these companies are bending the knee to an administration like this one is concerning (and dumb).",
                "Well this was very predictable and exactly why a number of people didn't want them there to begin with",
                "It’s the companies that stick around while the others slink away because it no longer benefits them that we should be paying attention to.",
                "> The president has ordered that the US only recognize two sexes, sought to ban trans people from the military, and repealed policies promoting racial equity and protecting LGBTQ+ people from discrimination. Major US companies from Amazon to Google have announced they will end their diversity, equity and inclusion programs.\n\nI want to live in a world where people are judged on their individual merits and flaws, not as part of a group generalized by something they don't even have a choice over.\n\nApparently, according to POTUS, that makes me a member of the \"radical left\".\n\nFucking Republicans and non-voters (both of which are groups that people make an active choice to be a part of), ruining America.",
                "Time to make Pride a protest again.",
                "Fuck all these companies. And who gives a shit if they do or don't sponsor anything. Go out and enjoy yourselves and be who you want to be.",
                "Corporate America has never been an ally",
                "Corporations do not care about our rights or identities, just the bottom line",
                "They never believed in any of it anyway. Companies make every decision based on money."
            ],
            "aggregate_sentiment": 18.0
        },
        {
            "category": "HOT",
            "title": "US ‘deletes evidence’ of Russia’s kidnap of thousands of Ukrainian children",
            "external_url": "https://www.independent.co.uk/news/world/europe/trump-ukraine-children-russia-war-kidnapping-evidence-b2717730.html",
            "upvotes": 50834,
            "date": "03/19/2025",
            "thumbnail": "https://static.independent.co.uk/2025/03/18/13/58/SEI244319340.jpg?width=1200&height=800&crop=1200:800",
            "top_comments": [
                "Great. Our actions are now complicity.",
                "Summary:\n\nThe US State Department allegedly deleted evidence collected by Yale University’s Humanitarian Research Lab, which was tracking Russian war crimes, including the abduction of 35,000 Ukrainian children. The deletion has hindered efforts to rescue the children and prosecute those responsible, including Russian President Vladimir Putin. The Yale project, funded by the US government until last month, monitored 116 sites in Russia using satellite imagery and other surveillance tools.\n\nSources suggest the deletion may have been accidental or intentional, raising potential legal risks for the Trump administration under international war crimes laws. The lost data was also being shared with the EU for its own investigations. The destruction of evidence not only affects legal cases but also complicates ongoing rescue missions.\n\nThe Yale project played a key role in gathering evidence that contributed to six ICC indictments, including against Putin and his commissioner for children’s rights. Russia has been accused of forcibly transferring Ukrainian children, issuing Russian passports in occupied areas, and erasing Ukrainian identity. The loss of the secure “Caesar” database has been described as a violation of the Geneva Convention, which prohibits destroying war crimes evidence. The US State Department has yet to respond.",
                "Just a reminder that Trump pardoned more known pedophiles than any other US President in history",
                "Greenlighting child abductions. \n\nFeeling free and brave yet, republicans?",
                "Not super familiar with International wartime law... but isn't covering up a war crime a war crime?",
                "Trumps fan boys been real quiet recently haven't they.\nMust be tiring having to generate excuses for things like this around 10 times a day at the moment.",
                "This is disgusting and heartbreaking and I hope every single person that voted for Trump has this shoved in their face. You are part of the reason this war criminal gets to continue to tear families apart and these children, THESE CHILDREN, may never see their families again.",
                "MAGA are pro rape, molestation and trafficking.",
                "US is no longer a force for good in the world. This is just evil, plain and simple.",
                "US goverment supports genocide."
            ],
            "aggregate_sentiment": 0.0
        },
        {
            "category": "HOT",
            "title": "Ben & Jerry's claims Unilever ousted its boss over political activism",
            "external_url": "https://www.bbc.com/news/articles/ckg8pk9rpx4o",
            "upvotes": 25267,
            "date": "03/19/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/d7be/live/d33cbd20-0485-11f0-9776-23d43d9c7fe7.jpg",
            "top_comments": [
                "It doesn’t look like this has gone through yet according to the article. Guess we will see what the independent board decides.",
                "“Mr Stever has been with Ben & Jerry’s since joining the firm in 1988 as a tour guide. He was appointed chief executive in 2023.”\n\nHoly shit this rules.",
                "Back in the 80s, Ben & Jerry’s had a corporate 5 - 1 plan.  The highest paid employee (including CEO) could make no more than 5 times the salary of the lowest paid employee.",
                "Buy an activism by design brand then fire the activists. Sounds about right.",
                "Sounds like the parent company violated the agreements they had with Ben and Jerry’s. It’s always been a politically active brand. ",
                "Did they really think selling their brand to a corporation would end any other way?",
                "\"It comes a month after the ice cream company accused Unilever of demanding that it stops publicly criticising US [Supreme Leader] Donald Trump.\" \n\nWell... you know what to do.\n\n https://en.m.wikipedia.org/wiki/List_of_Unilever_brands",
                "B+J is a very good example of why a company shouldn't go public.",
                "Stop letting billionaires buy your companies if you don’t want them to control your companies",
                "Even from a financial point, it makes no sense. This isn't new so it absolutely wasn't hurting their bottom line. People have known they have more left leaning views for literally decades. It's a bad look for Unilever now and it's going to be an even worse look when the courts rule against them."
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "NEW",
            "title": "Israeli strikes across Gaza hit multiple homes, killing at least 58 Palestinians, medics say",
            "external_url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-03-20-2025-36c07d3dc7c03f66f86f44409d504d43?utm_source=copy&utm_medium=share",
            "upvotes": 8,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Boy, 11, killed by his mother in Santa Ana, police say",
            "external_url": "https://www.sbsun.com/2025/03/19/boy-11-murdered-by-his-mother-in-santa-ana-police-say/",
            "upvotes": 0,
            "date": "03/20/2025",
            "thumbnail": "https://www.sbsun.com/wp-content/uploads/2025/03/OCR-L-CHILDSTAB-0320-03-LO-1.jpg?w=1024&h=691",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "DA says he would reconsider resentencing only if Menendez brothers admit to 'lies'",
            "external_url": "https://abcnews.go.com/US/da-reconsider-resentencing-menendez-brothers-admit-lies/story?id=119967273",
            "upvotes": 132,
            "date": "03/20/2025",
            "thumbnail": "https://i.abcnewsfe.com/a/d0f4f105-0374-4cd6-9df6-c5eb7faacbdc/hochman-abc-jt-250319_1742422877479_hpMain_16x9.jpg?w=1600",
            "top_comments": [
                "In other words, he wants them to confess to perjury so they won't be able to sue for wrongful imprisonment. Classy.",
                "It was cold-blooded murder.  They don't deserve to be free."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "European Union lays out how Apple must open its tech up to competitors under bloc's digital rules",
            "external_url": "https://apnews.com/article/apple-google-brussels-european-union-internet-8f1c2f1fda1d3ffeed50322df8093817",
            "upvotes": 188,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I would actually like to see anyone \"competing\" with Apple on the 2 main fronts they pretty much dominate.  Just need $500 billion for R&D to start it up.  Or be like China and just steal it.",
                "TLDR: \n\n- EU wants any smart watch to be able to talk to an iPhone the way the Apple Watch does.\n\nSeems reasonable.\n\n- They also want better BT pairing like the AirPods do.\n\nI think this is a hardware issue that other companies need to figure out - I use a pair of skull candy and AirPod pros on my personal phone and have zero issues connecting them after the initial pairing.\n\n- Airdrop protocol needs to be opened up. \n\nI 100% agree with this - even if it requires an app to be installed on the non-iOS device, they really need to open airdrop up.\n\n- Finally the eu is demanding that Apple opens up access to some of their hardware so apps can take better advantage of it.\n\nKinda agree, but they need to still keep it locked down so that malicious apps aren’t harvesting all our data and sending it onto the “mother ship”.\n\n\n- It seems like one of Apple’s core complaints is they said they put in the time and effort to R&D so they shouldn’t have to give it away for free.\n\nAnd I agree with that sentiment - except for airdrop. So Apple should just license it out.",
                "Man say what you want about the EU, but them strong arming tech companies into having consistent standards is amazing",
                "Good. Apple can eat me. They deleted important events from calendars like black history month and international women’s day.",
                "Good. Show the U.S. tech who's the boss in the E.U. Rules are rules.",
                "Terrible idea, security wise. But EU gonna EU",
                "The real question is why does Europe care when Europeans heavily prefer android. It’s like 2/3 Europeans on android. Investing in hardware and software is expensive, but why should other hardware manufacturers be entitled to it when it’s just going to run android anyway. The OS systems are a duopoly anyway and they can’t run iOS.",
                "It will be nice if there is an alternative to iCloud and its ridiculous storage fees.",
                "They could have added:\n BRING BACK THE HEADPHONE JACK",
                "Fuck I wish I was white. I would move to Europe in a heartbeat\n\nEdit: yo what’s with the downvotes?"
            ],
            "aggregate_sentiment": 82.0
        },
        {
            "category": "NEW",
            "title": "Ice agents detain woman known for immigration advocacy in Colorado | US immigration",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/19/jeanette-vizguerra-ice-colorado",
            "upvotes": 1784,
            "date": "03/20/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/991982bb6db500e7e1f3657debdf43f0bf1cd9d2/0_100_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=25975fc1089e83dc3916494a8de3e43b",
            "top_comments": [
                "What happened to only going after rapists and murderers?",
                "From the article: \n\nShe pleaded guilty to “attempted possession of a forged instrument”, which the network noted prompted heightened scrutiny from immigration authorities. She spent the next several years appealing multiple deportation orders.\n\nVizguerra has had several stays during her attempts to seek citizenship, per CBS News, and sought refuge at churches.\n\nJordan Garcia of the American Friends Service Committee, who has been in contact with Vizguerra’s lawyer and family and spoke with the Associated Press, said Vizguerra had been trying to gain a visa since leaving sanctuary in churches in 2020.",
                "So we are ruzzia and China now. ",
                ">She gained national attention in 2017 when she took sanctuary in a Denver church to avoid deportation during the first Trump administration.\n\nAhh, so this is just settling another vendetta for Trump. Meanwhile he's got a rapist attacking the Prime Minister of Ireland because he let Rosie O'Donnell move there before he could round her up as well.",
                "They really are following the manual, aren't they?",
                "What exactly does immigration advocacy mean? If it means she’s teaching people how to circumvent and cheat the immigration process… As a legal immigrant, I say lock her up.",
                "She entered the country illegally, broke the law and folks are wondering why she's being deported?",
                "That’s ICE, go for the person work raising kids and paying their bills, bunch of f***ing losers",
                "Unfortunately for her she has no right to be in the country. Probably best not to announce that to the world\n\nThe Guardian has really become garbage with its clickbait headlines, it makes it harder to track the actual bad shit the administration is doing"
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "NEW",
            "title": "House explodes in West Hurley, officials say",
            "external_url": "https://www.dailyfreeman.com/2025/03/19/house-explodes-in-west-hurley-officials-say/",
            "upvotes": 47,
            "date": "03/19/2025",
            "thumbnail": "https://www.dailyfreeman.com/wp-content/uploads/2025/03/DFN-L-0320-house-explosion-02.jpg?w=1024&h=768",
            "top_comments": [
                "No idea if this is what caused it, but...\n\nSome years back, I come home and the entire house smells very strongly of gasoline. I open all the windows (thankfully it was summer, as it can routinely get to sub-zero temps in winter) but the smell didn't really dissipate. The fire department is called, and long story short, they found someone on the next street over was cooking meth in their basement and dumping all the waste directly into the sewer. They tested all the houses on the block, and some of them, if it had been winter and the furnace pilot light turned on, would have exploded.",
                "I heard and felt it. My house shook. I live across the reservoir from where it happened. I am having work done on my house so I thought maybe somebody dropped something heavy. I looked outside and the workers weren’t there. Soon the fire sirens were going and I knew something happened.",
                "I always believe officials when they say that.",
                "drug manufacturing house?. how about the others scattered around the usa. boom"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "NEW",
            "title": "'Out of control' Tesla ploughs into pedestrians on busy London street injuring seven",
            "external_url": "https://www.lbc.co.uk/crime/tesla-crowd-london-stepney-green-east-end/",
            "upvotes": 7011,
            "date": "03/19/2025",
            "thumbnail": "https://images.lbc.co.uk/images/711463?width=692&crop=16_9&signature=2K0o7cbWGdo3vMUBKWoPQ0n4Qm0=",
            "top_comments": [
                "They're sick of being burned , they are revolting!",
                "Out of the way, citizen. Cities are for autonomous vehicles to drive through.",
                "Musk is going to claim this Tesla was hacked by Ukraine.",
                "Tessler. It's all computer.",
                "Oh oh they’re fighting back",
                "So is this Counter Terrorism? Donald?",
                "I do think its hilarious that Trump has ordered Musk and Boeing to hastily build him 2 new airforce ones. Teslas are garbage and Boeing is killing whistle-blowers on how faulty their shit is.",
                "Lidar is an hoax said the \"genius\"!",
                "This will make the stock price go up somehow.",
                "Maybe the Tesla felt threatened"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "NEW",
            "title": "Sponsors drop San Francisco Pride as festival decries ‘rights backtracking’",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/18/anheuser-busch-coors-pull-sponsorship-san-francisco-pride?CMP=Share_iOSApp_Other",
            "upvotes": 1948,
            "date": "03/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/32ab4d32c19c3c344770611b49ff8ded0eeaa60e/36_0_1125_675/master/1125.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a73cd9c10171b464b1648dbb375a42f4",
            "top_comments": [
                "As a gay man, let me tell you that most people who celebrate Pride never thought much of corporate sponsorship. The best pride events are local gatherings,  in parks with picnics.  The ones with all the glam and glitz were just that - glam and glitz. I'd much rather spend an afternoon with friends and neighbors just hanging out than have music and glitz being pumped at me. \n\n\nFor those of us who celebrate togetherness and community, the loss of corporate money won't bother us much. Many of us also tend to support local versus corporate as well. ",
                "On the one hand, their \"support\" was always a gross, transparent attempt at profiteering. It was - or should have been - obvious to everyone that they would ditch LGBT stuff the minute social headwinds shifted\n\n\nThe concerning part is WHY they're doing it. The fact that all of these companies are bending the knee to an administration like this one is concerning (and dumb).",
                "Well this was very predictable and exactly why a number of people didn't want them there to begin with",
                "It’s the companies that stick around while the others slink away because it no longer benefits them that we should be paying attention to.",
                "> The president has ordered that the US only recognize two sexes, sought to ban trans people from the military, and repealed policies promoting racial equity and protecting LGBTQ+ people from discrimination. Major US companies from Amazon to Google have announced they will end their diversity, equity and inclusion programs.\n\nI want to live in a world where people are judged on their individual merits and flaws, not as part of a group generalized by something they don't even have a choice over.\n\nApparently, according to POTUS, that makes me a member of the \"radical left\".\n\nFucking Republicans and non-voters (both of which are groups that people make an active choice to be a part of), ruining America.",
                "Time to make Pride a protest again.",
                "Fuck all these companies. And who gives a shit if they do or don't sponsor anything. Go out and enjoy yourselves and be who you want to be.",
                "Corporate America has never been an ally",
                "Corporations do not care about our rights or identities, just the bottom line",
                "They never believed in any of it anyway. Companies make every decision based on money."
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "NEW",
            "title": "UAE mediation efforts succeed with new exchange of 350 captives between Russia and Ukraine - INTERNATIONAL AGENCY FOR JOURNALISM AND STRATEGIC STUDIES | AIJES",
            "external_url": "https://aijesnews.com/en/reports-studies/news23981.html",
            "upvotes": 56,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Greenpeace must pay at least $660m over Dakota pipeline protests, says jury | Greenpeace",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/19/greenpeace-lawsuit-energy-transfer-dakota-pipeline",
            "upvotes": 647,
            "date": "03/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8435cda47e94ba9ddfc71f2c4e8d007adbdb8b4f/0_207_3100_1860/master/3100.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a8e95064004cad81332fd38be9ee68ed",
            "top_comments": [
                "Just declare bankruptcy and fold up the organization then form a new one called Green Peace Too and move on.\n\nThat is what the wealthy do all the time. Trump declared bankruptcy like 4 or 5 times. Didn't hold him back.",
                "\"Concerns over finding an unbiased jury plagued the case even before it began, given the rightward political leanings of Mandan, North Dakota, and the distaste for the protests among local residents.\"\n\nWhat do you expect? The US voted for \"drill baby drill\" last Nov. It is not hard to get some of the \"drill baby drill\" voters on the jury.",
                "If the pipeline itself were to rupture through negligence and pumped 100,000 barrels into a waterway.  I wonder what the fine would be.  Well short of $660m I would guess.",
                "Just don’t pay. Law seems to not matter anymore",
                "I don't understand how the jury selection would be legal since it sounds like the jury couldn't be impartial. Generally any conflict of interest bar you from serving on a jury",
                "Sounds like they didn’t actually break any laws, they’re just running afoul of corrupt Republican kangaroo courts.",
                "Even if you count their boats they don't have that much money. \n\nIt will be interesting to see if the boats get seized",
                "Just claim that the document was signed by autopen and get out of it for free ez.",
                "Courts don't matter anymore. Just don't pay it",
                "North Dakotans remember what it was like before the oil boom. They aint givin up that titty!"
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Ice agents detain woman known for immigration advocacy in Colorado | US immigration",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/19/jeanette-vizguerra-ice-colorado",
            "upvotes": 1782,
            "date": "03/20/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/991982bb6db500e7e1f3657debdf43f0bf1cd9d2/0_100_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=25975fc1089e83dc3916494a8de3e43b",
            "top_comments": [
                "What happened to only going after rapists and murderers?",
                "From the article: \n\nShe pleaded guilty to “attempted possession of a forged instrument”, which the network noted prompted heightened scrutiny from immigration authorities. She spent the next several years appealing multiple deportation orders.\n\nVizguerra has had several stays during her attempts to seek citizenship, per CBS News, and sought refuge at churches.\n\nJordan Garcia of the American Friends Service Committee, who has been in contact with Vizguerra’s lawyer and family and spoke with the Associated Press, said Vizguerra had been trying to gain a visa since leaving sanctuary in churches in 2020.",
                "So we are ruzzia and China now. ",
                ">She gained national attention in 2017 when she took sanctuary in a Denver church to avoid deportation during the first Trump administration.\n\nAhh, so this is just settling another vendetta for Trump. Meanwhile he's got a rapist attacking the Prime Minister of Ireland because he let Rosie O'Donnell move there before he could round her up as well.",
                "They really are following the manual, aren't they?",
                "What exactly does immigration advocacy mean? If it means she’s teaching people how to circumvent and cheat the immigration process… As a legal immigrant, I say lock her up.",
                "She entered the country illegally, broke the law and folks are wondering why she's being deported?",
                "That’s ICE, go for the person work raising kids and paying their bills, bunch of f***ing losers",
                "Unfortunately for her she has no right to be in the country. Probably best not to announce that to the world\n\nThe Guardian has really become garbage with its clickbait headlines, it makes it harder to track the actual bad shit the administration is doing"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "'Out of control' Tesla ploughs into pedestrians on busy London street injuring seven",
            "external_url": "https://www.lbc.co.uk/crime/tesla-crowd-london-stepney-green-east-end/",
            "upvotes": 7016,
            "date": "03/19/2025",
            "thumbnail": "https://images.lbc.co.uk/images/711463?width=692&crop=16_9&signature=2K0o7cbWGdo3vMUBKWoPQ0n4Qm0=",
            "top_comments": [
                "They're sick of being burned , they are revolting!",
                "Out of the way, citizen. Cities are for autonomous vehicles to drive through.",
                "Musk is going to claim this Tesla was hacked by Ukraine.",
                "Tessler. It's all computer.",
                "Oh oh they’re fighting back",
                "So is this Counter Terrorism? Donald?",
                "I do think its hilarious that Trump has ordered Musk and Boeing to hastily build him 2 new airforce ones. Teslas are garbage and Boeing is killing whistle-blowers on how faulty their shit is.",
                "Lidar is an hoax said the \"genius\"!",
                "This will make the stock price go up somehow.",
                "Maybe the Tesla felt threatened"
            ],
            "aggregate_sentiment": 14.0
        },
        {
            "category": "RISING",
            "title": "USDA cancels $1 billion in funding for schools and food banks slated for local farmers, ranchers and producers",
            "external_url": "http://www.cbsnews.com/news/usda-cancels-local-food-purchasing-food-banks-school-meals/",
            "upvotes": 5508,
            "date": "03/19/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/06/13/292c1ec7-31fc-447f-b459-5881c78671b3/thumbnail/1200x630/c42b2f227f9eb0f3da4219bb77f49fee/gettyimages-1243012161.jpg?v=765ef194a4bf4701e45ec9d5712af42f",
            "top_comments": [
                "I’m sure this will help the country.",
                "So we're ~~dropping~~  giving10 billion to farmers for assistance, but dropping money that helps farmers feed our children? What the fuck.\n\n[https://www.usda.gov/about-usda/news/press-releases/2025/03/18/usda-expediting-10-billion-direct-economic-assistance-agricultural-producers](https://www.usda.gov/about-usda/news/press-releases/2025/03/18/usda-expediting-10-billion-direct-economic-assistance-agricultural-producers)",
                "> \"Unlike the Biden Administration, which funneled billions in [Commodity Credit Corporation] funds into short-term programs with no plan for longevity, USDA is prioritizing stable, proven solutions that deliver lasting impact,\"\n\nThe Biden admin actually implemented plans to help the American people.\n\nThe Trump admin either destroys these programs with no alternative plan to action, or a plan to divert funds to personally enrich themselves and their wealthy friends.\n\nNot loudly broadcasting the accomplishments of the Biden admin is one of many misteps the Dems made, because the more programs the Trump admin destroys, the more clear it becomes just how much good Biden actually did.",
                "The Republican party hate the American people and get off by harming us.",
                "Trump voters just keep on winning.",
                "So, tariffs are supposed to encourage domestic production, but he's also slashing everything that actually makes domestic production possible.\n\nWe're going to envy the generation that lived thru the Great Depression because of this imbecile.",
                "If only they would’ve released a manual explaining step by step what their plan was. At least give folk a heads up ya’ know.",
                "Depriving food from children. That is America becoming great again",
                "Thats Donnie, Making America great. Those farmers, yeah they dont matter. Hope the Farmers knew better than to vote for that asshole.",
                "Why is school lunch not a thing? Does the government hate our kids that much?"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Sponsors drop San Francisco Pride as festival decries ‘rights backtracking’",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/18/anheuser-busch-coors-pull-sponsorship-san-francisco-pride?CMP=Share_iOSApp_Other",
            "upvotes": 1942,
            "date": "03/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/32ab4d32c19c3c344770611b49ff8ded0eeaa60e/36_0_1125_675/master/1125.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a73cd9c10171b464b1648dbb375a42f4",
            "top_comments": [
                "As a gay man, let me tell you that most people who celebrate Pride never thought much of corporate sponsorship. The best pride events are local gatherings,  in parks with picnics.  The ones with all the glam and glitz were just that - glam and glitz. I'd much rather spend an afternoon with friends and neighbors just hanging out than have music and glitz being pumped at me. \n\n\nFor those of us who celebrate togetherness and community, the loss of corporate money won't bother us much. Many of us also tend to support local versus corporate as well. ",
                "On the one hand, their \"support\" was always a gross, transparent attempt at profiteering. It was - or should have been - obvious to everyone that they would ditch LGBT stuff the minute social headwinds shifted\n\n\nThe concerning part is WHY they're doing it. The fact that all of these companies are bending the knee to an administration like this one is concerning (and dumb).",
                "Well this was very predictable and exactly why a number of people didn't want them there to begin with",
                "It’s the companies that stick around while the others slink away because it no longer benefits them that we should be paying attention to.",
                "> The president has ordered that the US only recognize two sexes, sought to ban trans people from the military, and repealed policies promoting racial equity and protecting LGBTQ+ people from discrimination. Major US companies from Amazon to Google have announced they will end their diversity, equity and inclusion programs.\n\nI want to live in a world where people are judged on their individual merits and flaws, not as part of a group generalized by something they don't even have a choice over.\n\nApparently, according to POTUS, that makes me a member of the \"radical left\".\n\nFucking Republicans and non-voters (both of which are groups that people make an active choice to be a part of), ruining America.",
                "Time to make Pride a protest again.",
                "Fuck all these companies. And who gives a shit if they do or don't sponsor anything. Go out and enjoy yourselves and be who you want to be.",
                "Corporate America has never been an ally",
                "Corporations do not care about our rights or identities, just the bottom line",
                "They never believed in any of it anyway. Companies make every decision based on money."
            ],
            "aggregate_sentiment": 72.0
        },
        {
            "category": "RISING",
            "title": "European Union lays out how Apple must open its tech up to competitors under bloc's digital rules",
            "external_url": "https://apnews.com/article/apple-google-brussels-european-union-internet-8f1c2f1fda1d3ffeed50322df8093817",
            "upvotes": 187,
            "date": "03/20/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "I would actually like to see anyone \"competing\" with Apple on the 2 main fronts they pretty much dominate.  Just need $500 billion for R&D to start it up.  Or be like China and just steal it.",
                "TLDR: \n\n- EU wants any smart watch to be able to talk to an iPhone the way the Apple Watch does.\n\nSeems reasonable.\n\n- They also want better BT pairing like the AirPods do.\n\nI think this is a hardware issue that other companies need to figure out - I use a pair of skull candy and AirPod pros on my personal phone and have zero issues connecting them after the initial pairing.\n\n- Airdrop protocol needs to be opened up. \n\nI 100% agree with this - even if it requires an app to be installed on the non-iOS device, they really need to open airdrop up.\n\n- Finally the eu is demanding that Apple opens up access to some of their hardware so apps can take better advantage of it.\n\nKinda agree, but they need to still keep it locked down so that malicious apps aren’t harvesting all our data and sending it onto the “mother ship”.\n\n\n- It seems like one of Apple’s core complaints is they said they put in the time and effort to R&D so they shouldn’t have to give it away for free.\n\nAnd I agree with that sentiment - except for airdrop. So Apple should just license it out.",
                "Man say what you want about the EU, but them strong arming tech companies into having consistent standards is amazing",
                "Good. Apple can eat me. They deleted important events from calendars like black history month and international women’s day.",
                "Good. Show the U.S. tech who's the boss in the E.U. Rules are rules.",
                "Terrible idea, security wise. But EU gonna EU",
                "The real question is why does Europe care when Europeans heavily prefer android. It’s like 2/3 Europeans on android. Investing in hardware and software is expensive, but why should other hardware manufacturers be entitled to it when it’s just going to run android anyway. The OS systems are a duopoly anyway and they can’t run iOS.",
                "It will be nice if there is an alternative to iCloud and its ridiculous storage fees.",
                "They could have added:\n BRING BACK THE HEADPHONE JACK",
                "Fuck I wish I was white. I would move to Europe in a heartbeat\n\nEdit: yo what’s with the downvotes?"
            ],
            "aggregate_sentiment": 12.0
        },
        {
            "category": "RISING",
            "title": "French Scientist Reportedly Denied U.S. Entry Due to Trump Criticism",
            "external_url": "https://newrepublic.com/post/192946/french-scientist-denied-us-entry-trump-criticism",
            "upvotes": 25246,
            "date": "03/19/2025",
            "thumbnail": "https://images.newrepublic.com/df32fc6dfc42d5dcddd8933438d7a9a07f5c533f.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
            "top_comments": [
                "So much for freedom of speech.",
                "Good thing he got to back to France and not deported to a concentration camp.",
                "Horrifying\n\n>The French newspaper Le Monde reports that on March 9, a space researcher was randomly selected upon arrival in Houston for a search, and CBP found messages criticizing the Trump administration’s treatment of scientists, which, according to the agency, “conveyed hatred of Trump & could be qualified as terrorism.”\n\nI guess around half of america are  terrorists now, according to whoever said that.",
                "Places people don’t want to go because they’re afraid of being jailed or deported for no reason:\n\n- Russia\n- North Korea\n- Iran\n- USA\n\nCongrats. Too much freedom I guess. ",
                "What a complete shit show.",
                "Anyone that thinks this person is just gonna go willingly after his term is up has another thing coming.",
                "USA is now just a fat North Korea",
                "Yamtits is the biggest man baby in the world with Elon a close second. It's amazing to me that bloated sack of monkey crap is actually president.",
                "”hatred of Trump & could be qualified as terrorism”. So I guess no one is going to be let into the USA anymore?",
                "Reading all the news coming out of the US, it feels like a surreal TV show.\nAlso, can he theoretically change the laws and be able to serve a third term, or is it impossible?🤞"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "Greenpeace must pay at least $660m over Dakota pipeline protests, says jury | Greenpeace",
            "external_url": "https://www.theguardian.com/us-news/2025/mar/19/greenpeace-lawsuit-energy-transfer-dakota-pipeline",
            "upvotes": 646,
            "date": "03/19/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/8435cda47e94ba9ddfc71f2c4e8d007adbdb8b4f/0_207_3100_1860/master/3100.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a8e95064004cad81332fd38be9ee68ed",
            "top_comments": [
                "Just declare bankruptcy and fold up the organization then form a new one called Green Peace Too and move on.\n\nThat is what the wealthy do all the time. Trump declared bankruptcy like 4 or 5 times. Didn't hold him back.",
                "\"Concerns over finding an unbiased jury plagued the case even before it began, given the rightward political leanings of Mandan, North Dakota, and the distaste for the protests among local residents.\"\n\nWhat do you expect? The US voted for \"drill baby drill\" last Nov. It is not hard to get some of the \"drill baby drill\" voters on the jury.",
                "If the pipeline itself were to rupture through negligence and pumped 100,000 barrels into a waterway.  I wonder what the fine would be.  Well short of $660m I would guess.",
                "Just don’t pay. Law seems to not matter anymore",
                "I don't understand how the jury selection would be legal since it sounds like the jury couldn't be impartial. Generally any conflict of interest bar you from serving on a jury",
                "Sounds like they didn’t actually break any laws, they’re just running afoul of corrupt Republican kangaroo courts.",
                "Even if you count their boats they don't have that much money. \n\nIt will be interesting to see if the boats get seized",
                "Just claim that the document was signed by autopen and get out of it for free ez.",
                "Courts don't matter anymore. Just don't pay it",
                "North Dakotans remember what it was like before the oil boom. They aint givin up that titty!"
            ],
            "aggregate_sentiment": 22.0
        },
        {
            "category": "RISING",
            "title": "GEO Group can’t receive a $4 million state tax refund, Texas Supreme Court rules",
            "external_url": "https://www.keranews.org/texas-news/2025-03-18/geo-group-private-prison-state-tax-refund-texas-supreme-court",
            "upvotes": 345,
            "date": "03/19/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims4/default/fc1b5d7/2147483647/strip/true/crop/4688x2461+0+243/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd2%2Fb0%2F90f8da50440f929a0b11222ab02f%2F103024-ice-detention-center-geo-group-ap.jpg",
            "top_comments": [
                ">“GEO contends the purchases it made pursuant to its contracts with the federal government, state government, and various counties are exempt from taxation because it qualifies as an ‘unincorporated instrumentality’ of the United States and this State,\" Busby wrote. “We disagree.”\n\nThere's probably thousands of companies whose only customer is a government entity. Imagine if they *all* got tax refunds or were otherwise exempted as being part of the government.",
                "Ah yes, GEO Group, the publicly-traded prison company.\n\nBecause of course it's normal to be able to profit from the incarceration of your fellow humans, because that's the world we live in now.\n\nMakes me sick.",
                "Either be a private company and pay your taxes or a public one and pay all your profits to the government. Either way you lose this argument."
            ],
            "aggregate_sentiment": 8.0
        },
        {
            "category": "RISING",
            "title": "Trump fires both Democratic commissioners at FTC",
            "external_url": "https://www.reuters.com/world/us/trump-fires-both-democratic-commissioners-ftc-sources-say-2025-03-18/",
            "upvotes": 15639,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "So Biden was for some reason unable to fire FTC chairs but all of a sudden Trump is able to. Interesting.",
                "Everyday is another outrage. Another law violated. And Congress just sits there like meek little sheepdogs. At this point, they all need to go",
                "Trump *illegally* fires both Democratic commissioners at FTC. \n\nFucking complicit media.",
                "If it's removing fraud and corruption and waste why is it only democrats?",
                "Dictator just doing dictator things, nothing to be alarmed of",
                "He said he’d only be a dictator on day one, wait, did Big Mac lie to us? ",
                "what's the consequence if we just ignore him the way he ignores the law? they could say \"oh no im still employed here, he has not fired me because he cannot fire me\" and what would be the functional difference?",
                "\"Illegally gutting the Commission will empower fraudsters and monopolists, and consumers will pay the price,\"\n\nWell we can see his motivation, Mr Mango \"The grift\" Mussolini.",
                "Trump considers every Democrat an enemy and that's why so many families don't talk anymore.",
                "\"The firings drew sharp criticism from Democratic senators...\"\n\nYes, we know, they are all outraged. I wish they did more."
            ],
            "aggregate_sentiment": 38.0
        },
        {
            "category": "RISING",
            "title": "Germany updates US travel advice after citizens detained",
            "external_url": "https://www.reuters.com/world/europe/germany-updates-us-travel-advice-after-citizens-detained-2025-03-19/",
            "upvotes": 5286,
            "date": "03/19/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump is really brilliant. The U.S. tourism market is worth 2.36 trillion dollars annually. \n\n  \nDoes making america great again include decimating its global lead in tourism revenue?",
                "FRANCE had citizens rejected entry for anti-Trump messages on their phone just Today. Source: https://www.liberation.fr/international/amerique/un-scientifique-francais-refoule-a-son-entree-aux-etats-unis-pour-des-messages-anti-trump-paris-grince-des-dents-20250319_JD7JAIVY4ZHE5CI33F7TBNR4CI/\n\nTravel advice at this point should be: Level 3: Reconsider Travel due to a limited ability to provide emergency consular services and arbitrary enforcement of local laws, especially if entering from a 3rd country like Mexico or Canada. US Green card holders and those traveling on US visas should be prepared for their status to be canceled upon entry.\n\nGERMANS: CANCEL YOUR NON ESSENTIAL TRAVEL PLANS TO THE USA UNTIL THE POLITICAL CLIMATE REVERTS TO SOMETHING MORE NORMAL.",
                "Our tourism industry is about to implode.",
                "Considering under Trump, you can be scooped up and deported to detention centres with zero merit, or worse be unlawfully targeted and illegally detained as a ‘terrorist’, solely by word of mouth and no conviction…… that sure makes for a unsafe / unstable destination for foreign nationals. \n\nI would not travel to the USA under this Administration if you paid me to.",
                "Were all these customs agents or whatnot just chomping at the bit to detain/torture foreigners all these years but were constrained by presidents following the law/constitution?",
                "“Don’t. Go. To. America.”\n\nYes. That’s all. \n\nJust fucking avoid it.  \n\nHow long?\n\nTen years minimum.",
                "We'll get like North Korea or Afghanistan or Russia. No reasonable Westerner will visit.",
                "No way will I go to the US in the near future",
                "Basically if you want to risk being detained with no due process most likely tortured and mistreated. Travel to the US.  WOW what a self own down there in the US of A",
                "What Donald Trump and his isolationist supporters don't understand is that we are all interdependent on each. Congratulations you've killed off the tourist industry and now how are you going to replace the income it brings in?"
            ],
            "aggregate_sentiment": 40.0
        }
    ],
    "last_updated": "03/20/2025 08:11:52 UTC"
}