{
    "posts": [
        {
            "category": "HOT",
            "title": "Zero ships from China are bound for California’s top ports. Officials haven’t seen that since the pandemic | CNN Business",
            "external_url": "https://www.cnn.com/2025/05/10/business/zero-ships-china-trade-ports-pandemic",
            "upvotes": 12227,
            "date": "05/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213552030.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "And remember everyone!:\n\n**ONCE THE PRICES GO UP, THEY AIN'T GONNA BRING EM BACK DOWN**",
                "The guy who unintentionally crashed the economy by mismanaging the pandemic was  re-elected so he can intentionally crash the economy by mismanaging a a recovery.\n\nSeriously. He blames Obama and Biden for everything, but both of them handed him a rising economy for him to destroy. And he didnt even say thank you.",
                "Here come the shortages.  I don't think most people realize how bad this is going to get and just assume everything will be fine.",
                "The next couple months are going to be really interesting , as summer kicks off and people are going to start feeling the effects of their leaders decisions.\n\nI expect a lot of angry , confused Americans will be flooding social media looking for answers. \n\nGet your popcorn ready",
                "Back-to-school is going to be fun… no shoes, no computers, no backpacks, no supplies, no dorm-room accoutrements, at prices that even vaguely resemble what parents are used to paying, when they can get them at all.\n\nBut it’ll be Biden’s Fault somehow.",
                "Remember, we saw insane inflation as an aftereffect from the pandemic. Supply disruptions don't immediately hit hard due to buffer inventories along the supply chains. When  this eventually affects us, it will be insane and likely cause another massive recession.\n\nAlso, other countries are adapting to the US playing games by securing deals with new partner countries. It will probably take decades for the US to undo the damage.",
                "Watch this earthcam stream, been only two ships per day when there's normally 10-15, lots of people are losing jobs over this crap.\n\n[https://www.earthcam.com/usa/california/losangeles/port/?cam=portofla2](https://www.earthcam.com/usa/california/losangeles/port/?cam=portofla2)",
                "Trucking and warehousing on the verge of collapse. I’ll be faced with laying off people who I manage, if I survive myself. Are we great yet?",
                "Not a problem. We'll just build a bunch of factories and make stuff here. Let's see, now.. Gonna need some steel, some machines, some...oops.",
                "I have an… acquaintance… who owns a Seattle-based trucking company. Uses the profits to fund his auto racing team. \n\nHe is a huge MAGA-head. Very active and vocal on social media. \n\nI haven’t been hearing from him lately. \n\nI bet it’s hard to talk shit when the leopard is eating your face."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Lithium deposit valued at $1.5 trillion discovered in the U.S.",
            "external_url": "https://www.earth.com/news/volcanic-white-gold-a-lithium-deposit-valued-at-1-5-trillion-has-been-discovered-in-the-u-s/",
            "upvotes": 3053,
            "date": "05/10/2025",
            "thumbnail": "https://cff2.earth.com/uploads/2025/05/09071935/lithium-mine_McDermitt-Caldera_1-5-trillion-dollars_1m.jpg",
            "top_comments": [
                "The children yearn for the mines",
                "We should invade and win the hearts and minds of the people by building roads and schools.",
                "Finding the deposit is \"easy\".\n\nMining it is a little trickier.\n\nTurning it into \\_\\_usable\\_\\_ lithium. Thats the HARD part that needs a lot of infrastructure, power and skill.\n\nThere is a new one under construction in California. Its a $1.8Bln facility, owned by an Australian company. Otherwise the ore has to be export to Australia, Chile or China. The US does have some other processing capabilities, but its mostly the Aussies with the know-how (I guess it involves using shitty beer to do it? j/k). \n\nBear in mind that if its processed abroad thats 2 x shipping costs, plus hazards materials handling, plus a tariff.\n\nSo that $1.8Bln plant, even if its a smaller facility, will be really useful! But its not going to be able to handle all of it, or in a timely manner.\n\nThis is a good link for more info: [Lithium Supply Chain: Understanding the Basics | Shipping and Commodity Academy](https://shippingandcommodityacademy.com/blog/lithium-supply-chain-understanding-the-basics/) (other pages exist but they all say about the same thing. Obviously the \"US reserves\" are now slightly higher than on that page mind).",
                "Gorman County, Oregon.",
                "Jesus that website is trash. Over half my screen was covered in undeletable ads. Couldn't even read the damn article.",
                "This was discovered several years ago. It's not news.",
                "It's never the issue whether we have lithium mine or not. We always have the. It's just the environmental cost to mine and produce it.",
                "and the best part of it is, they have to send the raw materials to China to get processed cause the Americans didn't bother building smelting facilities in the continental USA, cause it's a very dirty process.",
                "There are many sites with (BIG NUMBER) valued lithium.  The problem was how much the extraction and refining cost compared to (BIG NUMBER).  It frequently translated to close to, or exceeded,  (BIG NUMBER).\n\n  \nJust like there are a number of 'rare earth mineral' deposits in the U.S....they just aren't practical to extract.",
                "Of all times, we find this deposit when Biff Tannen is president. Ffs."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "India and Pakistan agree immediate US-mediated ceasefire",
            "external_url": "https://www.theguardian.com/world/2025/may/10/india-pakistan-immediate-us-mediated-ceasefire",
            "upvotes": 725,
            "date": "05/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6977c04370b750ff29703f1765c8bede72999282/392_0_3923_3138/master/3923.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1060dcc497c7aa3a0d4ca9af190e6902",
            "top_comments": [
                "The only evidence the US mediated anything is Trumps post. \n\nIndia says they worked directly with Pakistan\n\nEarlier the US admin says it’s none of their business. \n\nThe media needs to do its job.",
                "US-mediated ceasefire? i doubt it",
                "“vice-resident, JD Vance”",
                "I don't give a fuck who negotiated a cease fire, if it's true everyone should breathe a sigh of relief.",
                "It's been broken already.",
                "Well, who knows what Rubio and Vance actually contributed to any of this on a personal level--I'm sure the admin is happy to give them credit either way--but respect to whoever truly got this done. Even if Rubio or Vance effectuated this I guess a broken clock is right twice per day.\n\nNow back to the State Department's regularly scheduled programming of destroying good things",
                "Didn't the US vice president just say yesterday that America wasn't going to get involved?",
                "It didn't even last 4 hours. Pakistan is back firing missiles and drones in Jammu and Srinagar, India",
                "It wasn’t US mediated according to India or Pakistan.",
                "Already being violated by Pakistan"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Newark mayor arrested by ICE agents at detention center",
            "external_url": "https://www.fox5ny.com/news/newark-mayor-arrested-ice-detention",
            "upvotes": 43868,
            "date": "05/09/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5ny.com/www.fox5ny.com/content/uploads/2025/05/1280/720/ssstwitter.com_1746820692383.00_00_52_27.still003.jpg?ve=1&tl=1",
            "top_comments": [
                "\"Witnesses said the arrest came after Baraka attempted to join a scheduled tour of the facility with three members of New Jersey’s congressional delegation, Reps. Robert Menendez, LaMonica McIver, and Bonnie Watson Coleman.\n\nWhen federal officials blocked his entry, a heated argument broke out, according to Viri Martinez, an activist with the New Jersey Alliance for Immigrant Justice. It continued even after Baraka returned to the public side of the gates.\n\n. . . \n\nIn video of the altercation shared with The Associated Press, a federal official in a jacket with the logo of the Homeland Security Investigations can be heard telling Baraka he could not join a tour of the facility because “you are not a congress member.”\n\nBaraka then left the secure area, rejoining protesters on the public side of the gate. Video showed him speaking through the gate to a man in a suit, who informed him: “They’re talking about coming back to arrest you.”\n\n“I’m not on their property, they can’t come out on the street and arrest me,” Baraka replied.\n\nMinutes later several ICE agents, some wearing face coverings, surrounded Baraka and others on the public side of the gate. As protesters cried out, “Shame,” Baraka was dragged back through the security gate in handcuffs.\"",
                "Wow surprising, they are all masked.",
                "Alina Habba is a fucking US ATTORNEY?\n\nI guess I shouldn’t be surprised…\nWhat a fucking joke\n\nDemocrats need to aggressively oppose this gestapo shit AND offer a lawful and humane immigration solution",
                "Something’s going to give in this country. All this is already happening and Trump has only been in power 100 days and some change. Can’t even imagine how much worse things are going to get.",
                "What I don't understand is how ICE was able to arrest him. If this is criminal trespass, and it is committed by a citizen, then local police had jurisdiction.",
                "Gestapo doin Gestapo shit.",
                "It is not mistake. It is blatant racism. \n\n\"An ICE attorney in Dallas, James “Jim” Joseph Rodden, is under scrutiny following allegations that he operated a white supremacist account on X (formerly Twitter) under the handle u/GlomarResponder\".\n\n[https://www.texasobserver.org/ice-prosecutor-dallas-white-supremacist-x-account/](https://www.texasobserver.org/ice-prosecutor-dallas-white-supremacist-x-account/)",
                "ICE is a rogue paramilitary unit. Fuck ICE",
                "Arresting judges and elected officials. Don't overreact. Totally normal....in places like Nazi Germany.",
                "This administration is disgusting"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "The U.S. has 1,001 measles cases and 11 states with active outbreaks",
            "external_url": "https://www.nbcnews.com/health/kids-health/us-1001-measles-cases-11-states-outbreaks-virus-spreading-rcna205948",
            "upvotes": 7102,
            "date": "05/09/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250226-measles-mb-1442-44b90a.jpg",
            "top_comments": [
                "Number of cases in US by Year:  \n2020 = 13  \n2021 = 49  \n2022 = 121  \n2023 = 59  \n2024 = 285  \n2025 as of Today = 1,001\n\nHmm... One of these things aren't like the others.",
                "I’d put money on it being underreported.",
                "One thousand cases. In 2025. This should not be happening.",
                "Make measles great again! Well done you bunch of friggin clowns.",
                "If only science had come up with a way to protect people and limit the spread of diseases.",
                "It's awful, especially considering a nutjob is currently health secretary. \n\n\nIt's not better in Europe though. Sadly we also have a bunch of anti-vaxx nutjobs here. Here in Germany we had 555 cases of measles last year, and we only have a fourth of the US population. Even worse in the UK, there they had almost 3000 cases last year and they only have a fifth of the US population.",
                "Man, if only we could find a way to prevent this from happening…",
                "Those are rookie numbers, Ontario sits at 1,440 since October. Why we picked this contest to win, I'll never know.",
                "Texas should be sued for this",
                "It's gonna get worse. Summer will spread it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "USDA, DOGE demand states hand over personal data about food stamp recipients",
            "external_url": "https://www.npr.org/2025/05/09/nx-s1-5389952/usda-snap-doge-data-immigration",
            "upvotes": 4389,
            "date": "05/09/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4903x2758+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F58%2F3c%2Fa416e52d42e999ab925de6861ce7%2Fgettyimages-2200077442.jpg",
            "top_comments": [
                "Just putting together lists of people we've claimed are drains on society and subhuman for years, nothing to worry about. Oh, also we're getting rid of Habeas Corpus. But don't worry, we're *totally* just doing that to immigrants, we promise.",
                "Putting together the lists of people who will be sent to the camps next year.",
                "> Including Social Security numbers, addresses and, in at least one state, citizenship status, according to emails shared with NPR by an official who was not allowed to speak publicly.\n\nYeah, there's nothing alarming about that. /S Just like creating a database of autistic people is supposed to be a \"good\" thing. This administration is sorting people into categories it deems inferior.",
                "No. Go fuck yourselves you fascist assholes. There's only one good kind of fascist. I can't say which kind because Reddit will ban me since they're a bunch of sympathizers at this point.",
                "When you pass a trillion dollar military budget, cutting fractions of a percent makes no impact on debt reduction at all\n\nAll this does is bring pain and suffering to those that need help the most",
                "The legal response should simply say,  “Eat a dick.”",
                "Hey DOGE.... Eat Shit!",
                "We are at the useless eaters point .\n\nGood luck neighbours.",
                "You know a great way to save tax dollars concerning food stamps? Raise the minimum wage. Our taxes supplement Walmart profits. These corporations need to pay up.",
                "They're gonna be super fucking bummed when they realize the majority of people are white people that live in rural communities."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "FedEx board member Steiner is picked to be next USPS postmaster general amid talk of privatization",
            "external_url": "https://apnews.com/article/usps-postmaster-general-steiner-privatization-b88684227b01c71f6674f9569ca8adc6",
            "upvotes": 4245,
            "date": "05/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ahh, I remember the good old days when admins at least pretended to care about 'conflict of interest'.",
                "Almost every business in the US relies on USPS this would be an unmitigated disaster. Trumps rural base would also get screwed which would be a silver lining.",
                "USPS is constitutionally mandated. We would need a constitutional amendment to privatize it.\n\nFirst Class mail will be $5, though. And It won't go to every address in the U.S. in a short amount of time.",
                "#SAVE USPS!\n\n\"Neither snow nor rain nor heat nor gloom of night stays these couriers from the swift completion of their appointed rounds\"\n\nUSPS is one of America’s oldest institutions. Benjamin Franklin was the first Postmaster. Connecting America",
                "They are going to privatize it. Once Dejoy was in it was just a matter of time.",
                "Every Trump agency head pick is an intentional act to destroy the agency they're heading.",
                "In a few years a Democratic president will say it's not possible to get rid of this person.",
                "Never forget the lesson that one single corrupt president can bring ruin to hundreds of years of progress. No election in a democratic country is meaningless. If you failed to vote last November, or if you voted for Trump, you are partially responsible for this.",
                "Let’s pick someone from the shittiest, most unreliable courier service in America to be the next postmaster. That makes sense.",
                "Between this, selling off national parks, shutting down other public institutions for private gain... We're going to look like the oligarchy in Russia after the fall of the USSR.\n\nIt's going to take decades to repair, if we even can fix it at all."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "US Judge halts Trump regime's secretive deportation scheme to war-torn Libya",
            "external_url": "https://foreignpost.news/p/us-judge-halts-trump-regimes-secretive",
            "upvotes": 6143,
            "date": "05/09/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd209ae36-1e1f-4d23-912a-b9de5dd27c79_1262x841.jpeg",
            "top_comments": [
                "The term is rendition, not deportation. Unless they are deporting Libyans.",
                "Get rid of Trump or it will only get worse.\n\nHe doesnt care about law so it wont stop him or make him rethink. Trump either does it anyway or remove the obstacle that was in his way by using fascist methods and then does it anyway.\n\nTrump is in his 4th month, 2 years(midterms) of this will cause irreparable damage to everything in the USA.\n\nEveryday with him in office is a day closer for civil war being the only way to get rid of Trump, family and friends.",
                "How long until they do it anyway",
                "I'm sure in the near future Trump will reach an agreement with Putin to send American prisoners to Siberia. I'm sure party affiliation will determine if you qualify.",
                "\"Trump regime\" finally we see news outlets say it out loud. Now we need US major outlets to do the same. There's nothing \"administration\" about fascism.",
                "Like that matters. The administration is ignoring the unanimous orders from the supreme court and you think they will listen to this? The Supreme Court needs to reverse their decision giving Trump immunity. They can revisit it at any time and they didn't follow the rule of law when they gave Trump immunity so you shouldn't have any issue fixing it.",
                "Every time I see trump talk, I think of the videos of Libyans dragging Muammar Gaddafi and beating him/shooting him to his death.",
                "OMG time to arrest Trump",
                "Incorrect headline, they didn’t stop anything, probably just issued a piece of paper that they usually expect to be followed that should stop this plan, but won’t.",
                "> Immigration attorneys moved swiftly on Wednesday to block the effort, filing an emergency request in federal court. “Multiple credible sources report that flights are preparing to immediately depart the United States carrying class members for removal to Libya,” they wrote in a court filing.\n\nThey are trying to do the El Salvador thing all over again because not a single person has been held in contempt for that shit."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Earthquake in Tennessee felt across the Southeast | CNN",
            "external_url": "https://www.cnn.com/2025/05/10/us/earthquake-tennessee-southeast-us-saturday",
            "upvotes": 129,
            "date": "05/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/image-20250510140142134.png?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I felt it! It sounded like a low-flying Chinook going over my house. \n\nAlso /r/knoxville is going nuts about it.",
                "I’m in Maryville TN, really close to this. Was in a tire shop getting my tires replaced. There was apparently a huge gas leak across the street yesterday. When the earthquake happened the whole building shook. Everybody rushed to the front of the store to see if the gas main had exploded.",
                "My sister said she felt that all the way down in Braselton, Georgia. That’s crazy. ",
                "Lol I say this as a west coaster... It's just a 4.1 lol",
                "The New Madrid fault is having some fun! If it goes big that whole area of the country is righteously doomed. EDit: Wrong side of Tennessee to be that fault. Carry on!",
                "I was trying to fall back asleep and it woke me. I also had my window open so I could hear all the houses shake or whatever that noise was.",
                "Dang I missed it.  Was at the gym doing leg day.  My legs were already shaking so didn't notice. My neighbor called me right after it happened to ask if I felt it.  Dang it why did I decide to do leg day today?!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Soviet Kosmos 482 spacecraft crashes into an unknown site on Earth",
            "external_url": "https://www.nbcnews.com/science/space/soviet-kosmos-482-spacecraft-crashes-earth-rcna205579",
            "upvotes": 156,
            "date": "05/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250501-Kosmos-482-ch-1440-cc4784.jpg",
            "top_comments": [
                "Last transmission received by it: \"Missed by............ that much.\"",
                "How do you say Area 51 in Russian?",
                "That looks like a headline from the beginning of a horror movie",
                "Said it before and will say it again. Looks like the Michelin Man and Sputnik had a baby.",
                "Ohhh that’s what that weird thing is in my backyard \n/s",
                "Remember if you find the space craft and find an egg don’t touch it. Those things are worth a fortune.",
                "This how *The Andromeda Strain* started...",
                "Cool time capsule idea"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Pakistan violates ceasefire, multiple blasts reported in Srinagar",
            "external_url": "https://www.indiatvnews.com/news/india/pakistan-violates-ceasefire-multiple-blasts-reported-in-srinagar-2025-05-10-989717",
            "upvotes": 6,
            "date": "05/10/2025",
            "thumbnail": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2025/05/untitled-design-2025-05-10t212338-1746892439.jpg",
            "top_comments": [],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "An earthquake of 4.1 preliminary magnitude has been reported in Tennessee and was felt in Atlanta",
            "external_url": "https://apnews.com/article/earthquake-tennessee-atlanta-north-carolina-cb5a05028a43145bed6aa2d887d93c07",
            "upvotes": 73,
            "date": "05/10/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "How common are earthquakes in America?",
                "https://en.m.wikipedia.org/wiki/New_York–Alabama_Lineament",
                "That central fault area could have an 8.0."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Lithium deposit valued at $1.5 trillion discovered in the U.S.",
            "external_url": "https://www.earth.com/news/volcanic-white-gold-a-lithium-deposit-valued-at-1-5-trillion-has-been-discovered-in-the-u-s/",
            "upvotes": 3054,
            "date": "05/10/2025",
            "thumbnail": "https://cff2.earth.com/uploads/2025/05/09071935/lithium-mine_McDermitt-Caldera_1-5-trillion-dollars_1m.jpg",
            "top_comments": [
                "The children yearn for the mines",
                "We should invade and win the hearts and minds of the people by building roads and schools.",
                "Finding the deposit is \"easy\".\n\nMining it is a little trickier.\n\nTurning it into \\_\\_usable\\_\\_ lithium. Thats the HARD part that needs a lot of infrastructure, power and skill.\n\nThere is a new one under construction in California. Its a $1.8Bln facility, owned by an Australian company. Otherwise the ore has to be export to Australia, Chile or China. The US does have some other processing capabilities, but its mostly the Aussies with the know-how (I guess it involves using shitty beer to do it? j/k). \n\nBear in mind that if its processed abroad thats 2 x shipping costs, plus hazards materials handling, plus a tariff.\n\nSo that $1.8Bln plant, even if its a smaller facility, will be really useful! But its not going to be able to handle all of it, or in a timely manner.\n\nThis is a good link for more info: [Lithium Supply Chain: Understanding the Basics | Shipping and Commodity Academy](https://shippingandcommodityacademy.com/blog/lithium-supply-chain-understanding-the-basics/) (other pages exist but they all say about the same thing. Obviously the \"US reserves\" are now slightly higher than on that page mind).",
                "Gorman County, Oregon.",
                "Jesus that website is trash. Over half my screen was covered in undeletable ads. Couldn't even read the damn article.",
                "This was discovered several years ago. It's not news.",
                "It's never the issue whether we have lithium mine or not. We always have the. It's just the environmental cost to mine and produce it.",
                "and the best part of it is, they have to send the raw materials to China to get processed cause the Americans didn't bother building smelting facilities in the continental USA, cause it's a very dirty process.",
                "There are many sites with (BIG NUMBER) valued lithium.  The problem was how much the extraction and refining cost compared to (BIG NUMBER).  It frequently translated to close to, or exceeded,  (BIG NUMBER).\n\n  \nJust like there are a number of 'rare earth mineral' deposits in the U.S....they just aren't practical to extract.",
                "Of all times, we find this deposit when Biff Tannen is president. Ffs."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Earthquake in Tennessee felt across the Southeast | CNN",
            "external_url": "https://www.cnn.com/2025/05/10/us/earthquake-tennessee-southeast-us-saturday",
            "upvotes": 130,
            "date": "05/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/image-20250510140142134.png?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I felt it! It sounded like a low-flying Chinook going over my house. \n\nAlso /r/knoxville is going nuts about it.",
                "I’m in Maryville TN, really close to this. Was in a tire shop getting my tires replaced. There was apparently a huge gas leak across the street yesterday. When the earthquake happened the whole building shook. Everybody rushed to the front of the store to see if the gas main had exploded.",
                "My sister said she felt that all the way down in Braselton, Georgia. That’s crazy. ",
                "Lol I say this as a west coaster... It's just a 4.1 lol",
                "The New Madrid fault is having some fun! If it goes big that whole area of the country is righteously doomed. EDit: Wrong side of Tennessee to be that fault. Carry on!",
                "I was trying to fall back asleep and it woke me. I also had my window open so I could hear all the houses shake or whatever that noise was.",
                "Dang I missed it.  Was at the gym doing leg day.  My legs were already shaking so didn't notice. My neighbor called me right after it happened to ask if I felt it.  Dang it why did I decide to do leg day today?!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "India and Pakistan agree immediate US-mediated ceasefire",
            "external_url": "https://www.theguardian.com/world/2025/may/10/india-pakistan-immediate-us-mediated-ceasefire",
            "upvotes": 723,
            "date": "05/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6977c04370b750ff29703f1765c8bede72999282/392_0_3923_3138/master/3923.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1060dcc497c7aa3a0d4ca9af190e6902",
            "top_comments": [
                "The only evidence the US mediated anything is Trumps post. \n\nIndia says they worked directly with Pakistan\n\nEarlier the US admin says it’s none of their business. \n\nThe media needs to do its job.",
                "US-mediated ceasefire? i doubt it",
                "“vice-resident, JD Vance”",
                "I don't give a fuck who negotiated a cease fire, if it's true everyone should breathe a sigh of relief.",
                "It's been broken already.",
                "Well, who knows what Rubio and Vance actually contributed to any of this on a personal level--I'm sure the admin is happy to give them credit either way--but respect to whoever truly got this done. Even if Rubio or Vance effectuated this I guess a broken clock is right twice per day.\n\nNow back to the State Department's regularly scheduled programming of destroying good things",
                "Didn't the US vice president just say yesterday that America wasn't going to get involved?",
                "It didn't even last 4 hours. Pakistan is back firing missiles and drones in Jammu and Srinagar, India",
                "It wasn’t US mediated according to India or Pakistan.",
                "Already being violated by Pakistan"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Soviet Kosmos 482 spacecraft crashes into an unknown site on Earth",
            "external_url": "https://www.nbcnews.com/science/space/soviet-kosmos-482-spacecraft-crashes-earth-rcna205579",
            "upvotes": 156,
            "date": "05/10/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250501-Kosmos-482-ch-1440-cc4784.jpg",
            "top_comments": [
                "Last transmission received by it: \"Missed by............ that much.\"",
                "How do you say Area 51 in Russian?",
                "That looks like a headline from the beginning of a horror movie",
                "Said it before and will say it again. Looks like the Michelin Man and Sputnik had a baby.",
                "Ohhh that’s what that weird thing is in my backyard \n/s",
                "Remember if you find the space craft and find an egg don’t touch it. Those things are worth a fortune.",
                "This how *The Andromeda Strain* started...",
                "Cool time capsule idea"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Zero ships from China are bound for California’s top ports. Officials haven’t seen that since the pandemic | CNN Business",
            "external_url": "https://www.cnn.com/2025/05/10/business/zero-ships-china-trade-ports-pandemic",
            "upvotes": 12223,
            "date": "05/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213552030.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "And remember everyone!:\n\n**ONCE THE PRICES GO UP, THEY AIN'T GONNA BRING EM BACK DOWN**",
                "The guy who unintentionally crashed the economy by mismanaging the pandemic was  re-elected so he can intentionally crash the economy by mismanaging a a recovery.\n\nSeriously. He blames Obama and Biden for everything, but both of them handed him a rising economy for him to destroy. And he didnt even say thank you.",
                "Here come the shortages.  I don't think most people realize how bad this is going to get and just assume everything will be fine.",
                "The next couple months are going to be really interesting , as summer kicks off and people are going to start feeling the effects of their leaders decisions.\n\nI expect a lot of angry , confused Americans will be flooding social media looking for answers. \n\nGet your popcorn ready",
                "Back-to-school is going to be fun… no shoes, no computers, no backpacks, no supplies, no dorm-room accoutrements, at prices that even vaguely resemble what parents are used to paying, when they can get them at all.\n\nBut it’ll be Biden’s Fault somehow.",
                "Remember, we saw insane inflation as an aftereffect from the pandemic. Supply disruptions don't immediately hit hard due to buffer inventories along the supply chains. When  this eventually affects us, it will be insane and likely cause another massive recession.\n\nAlso, other countries are adapting to the US playing games by securing deals with new partner countries. It will probably take decades for the US to undo the damage.",
                "Watch this earthcam stream, been only two ships per day when there's normally 10-15, lots of people are losing jobs over this crap.\n\n[https://www.earthcam.com/usa/california/losangeles/port/?cam=portofla2](https://www.earthcam.com/usa/california/losangeles/port/?cam=portofla2)",
                "Trucking and warehousing on the verge of collapse. I’ll be faced with laying off people who I manage, if I survive myself. Are we great yet?",
                "Not a problem. We'll just build a bunch of factories and make stuff here. Let's see, now.. Gonna need some steel, some machines, some...oops.",
                "I have an… acquaintance… who owns a Seattle-based trucking company. Uses the profits to fund his auto racing team. \n\nHe is a huge MAGA-head. Very active and vocal on social media. \n\nI haven’t been hearing from him lately. \n\nI bet it’s hard to talk shit when the leopard is eating your face."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Terror group supporters posted on Tiktok from site targeted in Indian Airstrikes",
            "external_url": "https://news.sky.com/story/terror-group-supporters-posted-on-tiktok-from-site-targeted-in-indian-airstrikes-13363716",
            "upvotes": 138,
            "date": "05/10/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-india-pakistan-teaser_6910817.jpg?20250509085412",
            "top_comments": [
                "I'm starting to suspect Pakistan may not be as anti-terror as they claim.",
                "to those who are incapable of going to article  and reading \n\n>The caption of the video reads 'we are little soldiers, and we fight the non-believers'. It uses the hashtag '313'.\n\n>The caption uses the hashtag #جہاد313, which translates to '313' jihad.\n\n>**'313' appears to refer to the 313 Brigade, a proscribed terror organisation in Pakistan.**\n\n>In a TikTok video posted to the Google page for Markaz Taiba Mosque in Muridke, a man can be seen walking along the street with a gun.",
                "Great! Their “civilians” have made these videos. Great, can’t blame it on media now. \n\nProof’s here, Pakistan",
                "The audacity!\nHere is your proof, Pakistan! Here are your “civilians” carrying guns and declaration to fight infidels.",
                "Ngl…all (India and Pakistan) the news coverage feels like propaganda from a westerner’s pov bc a lot of reporting we have access to has emotional rhetoric. Instead of downvoting…maybe explain to people why one terror group represents the entire country. For people in the US, we are filled with domestic terrorists that don’t represent the majority…it’s hard to understand how people are concluding that Pakistan is responsible for the Kashmir attacks. On the other hand, Pakistan is sus and does have ties to terrorist groups in the past. Can someone give more clarity here?",
                "We all know 'Pakistan is a rough terrorist blacklisted nation/organisation '",
                "Man these are the same kinds of articles we had in the early 2000's trying to convince us in the states war in the middle east was justified.",
                "You guys are a lost cause.\n\nEven indians are boycotting their media.\n\nYalda hakim ( an afghan ) of skynews has intimate pictures with a bjp leader.\n\nEven children ask more questions before changing their mind.",
                "Seems like the same hoax as 'weapons of mass destruction'",
                "It's always a nice reminder that brown people are just as awful as white people.\n\nSee= this entire post."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "A failed Soviet-era spacecraft that aimed for Venus is expected to crash back to Earth tonight",
            "external_url": "https://www.cnn.com/2025/05/09/science/soviet-spacecraft-crash-kosmos-482",
            "upvotes": 846,
            "date": "05/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/pia00271-large.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "Shoot for Venus. If you miss you’ll land among the, um, Earth. ",
                "*Article Excerpt from Jackie Wattles (CNN):*\n\nA Soviet-era spacecraft that was designed to make a soft landing on Venus — but instead remained trapped in Earth orbit for decades — is slated to fall from the sky Friday night or early Saturday, according to the latest estimates from experts.\n\nThe object, referred to as Cosmos 482 or Kosmos 482, is believed to be a capsule launched by the Soviet Union in March 1972 that failed en route to a transfer orbit that would have taken it to Venus to study its environment.\n\nIn the decades since, the object has circled Earth aimlessly as it was slowly dragged back toward home.\n\nAstronomers and space traffic experts have had their eyes on the object for years now as its orbital path has slowly reached lower and lower altitudes, a result of the subtle atmospheric drag that exists even hundreds of miles away from Earth.\n\nThe cylinder-shaped craft, which is about 3 feet (1 meter) in diameter, is now predicted to crash back to Earth overnight. Cosmos 482 is on track to hit the ground or ocean roughly between 10 p.m. and 6:30 a.m. ET, according to four analyses of the object from various institutions, including the European Space Agency and the federally funded US research group Aerospace Corporation.\n\nThat guidance is still in line with predictions issued by space traffic experts earlier this week. The estimated time frame of the vehicle’s final descent will narrow as the event approaches.\n\nBecause of the sheer complexity of spaceflight and unpredictable factors, such as space weather, it can be extremely difficult to pinpoint exactly when or where an object will fall out of orbit.\n\nThis particular piece of space junk likely won’t pose a risk to people on the ground.\n\n“This object was designed to survive reentering Venus, so there’s fair odds that it’ll survive coming back (to Earth) in one piece,” said Marlon Sorge, a space debris expert with The Aerospace Corporation, on Monday. “That actually makes the risk less … because it would stay intact.”",
                "from the article:\n“What to do if you spot debris:\n\nWhile a landing on dry ground is unlikely, it’s not impossible. The Cosmos 482 object’s trajectory shows it could hit anywhere within a broad swath of land that includes “the whole of Africa, South America, Australia, the USA, parts of Canada, parts of Europe, and parts of Asia,” said Marco Langbroek, a lecturer and space traffic expert at Delft Technical University in the Netherlands, via email.\n\nSorge emphasized that if Cosmos 482 hits the ground after its final descent tonight, onlookers are advised to keep their distance. The aged spacecraft could leak dangerous fuels or pose other risks to people and property.\n“Contact the authorities,” Sorge urged. “Please don’t mess with it.”",
                "I hope it doesn’t crash through my roof!",
                "Isn't this what caused the zombie outbreak in the original \"Night of the Living Dead?\"",
                ">This particular piece of space junk likely won’t pose a risk to people on the ground\n\nLike, rationally I get that the odds of it hitting anything of significance are low, but on the off chance that some poor bastard gets nailed by a 3-foot metal dildo going Mach fuck…",
                "God it would be infinitely funny if it hit Putin.",
                "I think I remember Taco Bell putting a target out in the Pacific one of these times. I believe if the satellite hit the target, everyone in the US would get a free taco. \n\n\nIt didn't hit. The odds were astronomical.",
                "Watching its altitude dropping live on the tracker, it suddenly started going back up. Was at 120.48km altitude; 5 minutes later its at 124.35km and still climbing. Is this it skipping off the atmosphere? An artifact of how altitude is reported, over land of changing heights? Or something else?\n\n***Edit***: *oh; duh. Its orbit is currently a (decaying) elliptical. It's just rising back towards apogee.*",
                "I'm totally going to mess with it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "India intercepts Pakistan drone strikes in Jammu, complete blackout in several Indian cities",
            "external_url": "https://thesouthfirst.com/news/india-intercepts-pakistan-drone-strikes-in-jammu-complete-blackout-in-several-indian-cities/",
            "upvotes": 17,
            "date": "05/09/2025",
            "thumbnail": "https://s3.ap-south-1.amazonaws.com/media.thesouthfirst.com/wp-content/uploads/2025/05/Missile.jpg",
            "top_comments": [
                "Already tired of this conflict and how people seem to think any side is justified."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Lithium deposit valued at $1.5 trillion discovered in the U.S.",
            "external_url": "https://www.earth.com/news/volcanic-white-gold-a-lithium-deposit-valued-at-1-5-trillion-has-been-discovered-in-the-u-s/",
            "upvotes": 3052,
            "date": "05/10/2025",
            "thumbnail": "https://cff2.earth.com/uploads/2025/05/09071935/lithium-mine_McDermitt-Caldera_1-5-trillion-dollars_1m.jpg",
            "top_comments": [
                "The children yearn for the mines",
                "We should invade and win the hearts and minds of the people by building roads and schools.",
                "Finding the deposit is \"easy\".\n\nMining it is a little trickier.\n\nTurning it into \\_\\_usable\\_\\_ lithium. Thats the HARD part that needs a lot of infrastructure, power and skill.\n\nThere is a new one under construction in California. Its a $1.8Bln facility, owned by an Australian company. Otherwise the ore has to be export to Australia, Chile or China. The US does have some other processing capabilities, but its mostly the Aussies with the know-how (I guess it involves using shitty beer to do it? j/k). \n\nBear in mind that if its processed abroad thats 2 x shipping costs, plus hazards materials handling, plus a tariff.\n\nSo that $1.8Bln plant, even if its a smaller facility, will be really useful! But its not going to be able to handle all of it, or in a timely manner.\n\nThis is a good link for more info: [Lithium Supply Chain: Understanding the Basics | Shipping and Commodity Academy](https://shippingandcommodityacademy.com/blog/lithium-supply-chain-understanding-the-basics/) (other pages exist but they all say about the same thing. Obviously the \"US reserves\" are now slightly higher than on that page mind).",
                "Gorman County, Oregon.",
                "Jesus that website is trash. Over half my screen was covered in undeletable ads. Couldn't even read the damn article.",
                "This was discovered several years ago. It's not news.",
                "It's never the issue whether we have lithium mine or not. We always have the. It's just the environmental cost to mine and produce it.",
                "and the best part of it is, they have to send the raw materials to China to get processed cause the Americans didn't bother building smelting facilities in the continental USA, cause it's a very dirty process.",
                "There are many sites with (BIG NUMBER) valued lithium.  The problem was how much the extraction and refining cost compared to (BIG NUMBER).  It frequently translated to close to, or exceeded,  (BIG NUMBER).\n\n  \nJust like there are a number of 'rare earth mineral' deposits in the U.S....they just aren't practical to extract.",
                "Of all times, we find this deposit when Biff Tannen is president. Ffs."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Zero ships from China are bound for California’s top ports. Officials haven’t seen that since the pandemic | CNN Business",
            "external_url": "https://www.cnn.com/2025/05/10/business/zero-ships-china-trade-ports-pandemic",
            "upvotes": 12234,
            "date": "05/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2213552030.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "And remember everyone!:\n\n**ONCE THE PRICES GO UP, THEY AIN'T GONNA BRING EM BACK DOWN**",
                "The guy who unintentionally crashed the economy by mismanaging the pandemic was  re-elected so he can intentionally crash the economy by mismanaging a a recovery.\n\nSeriously. He blames Obama and Biden for everything, but both of them handed him a rising economy for him to destroy. And he didnt even say thank you.",
                "Here come the shortages.  I don't think most people realize how bad this is going to get and just assume everything will be fine.",
                "The next couple months are going to be really interesting , as summer kicks off and people are going to start feeling the effects of their leaders decisions.\n\nI expect a lot of angry , confused Americans will be flooding social media looking for answers. \n\nGet your popcorn ready",
                "Back-to-school is going to be fun… no shoes, no computers, no backpacks, no supplies, no dorm-room accoutrements, at prices that even vaguely resemble what parents are used to paying, when they can get them at all.\n\nBut it’ll be Biden’s Fault somehow.",
                "Remember, we saw insane inflation as an aftereffect from the pandemic. Supply disruptions don't immediately hit hard due to buffer inventories along the supply chains. When  this eventually affects us, it will be insane and likely cause another massive recession.\n\nAlso, other countries are adapting to the US playing games by securing deals with new partner countries. It will probably take decades for the US to undo the damage.",
                "Watch this earthcam stream, been only two ships per day when there's normally 10-15, lots of people are losing jobs over this crap.\n\n[https://www.earthcam.com/usa/california/losangeles/port/?cam=portofla2](https://www.earthcam.com/usa/california/losangeles/port/?cam=portofla2)",
                "Trucking and warehousing on the verge of collapse. I’ll be faced with laying off people who I manage, if I survive myself. Are we great yet?",
                "Not a problem. We'll just build a bunch of factories and make stuff here. Let's see, now.. Gonna need some steel, some machines, some...oops.",
                "I have an… acquaintance… who owns a Seattle-based trucking company. Uses the profits to fund his auto racing team. \n\nHe is a huge MAGA-head. Very active and vocal on social media. \n\nI haven’t been hearing from him lately. \n\nI bet it’s hard to talk shit when the leopard is eating your face."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "India and Pakistan agree immediate US-mediated ceasefire",
            "external_url": "https://www.theguardian.com/world/2025/may/10/india-pakistan-immediate-us-mediated-ceasefire",
            "upvotes": 723,
            "date": "05/10/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/6977c04370b750ff29703f1765c8bede72999282/392_0_3923_3138/master/3923.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1060dcc497c7aa3a0d4ca9af190e6902",
            "top_comments": [
                "The only evidence the US mediated anything is Trumps post. \n\nIndia says they worked directly with Pakistan\n\nEarlier the US admin says it’s none of their business. \n\nThe media needs to do its job.",
                "US-mediated ceasefire? i doubt it",
                "“vice-resident, JD Vance”",
                "I don't give a fuck who negotiated a cease fire, if it's true everyone should breathe a sigh of relief.",
                "It's been broken already.",
                "Well, who knows what Rubio and Vance actually contributed to any of this on a personal level--I'm sure the admin is happy to give them credit either way--but respect to whoever truly got this done. Even if Rubio or Vance effectuated this I guess a broken clock is right twice per day.\n\nNow back to the State Department's regularly scheduled programming of destroying good things",
                "Didn't the US vice president just say yesterday that America wasn't going to get involved?",
                "It didn't even last 4 hours. Pakistan is back firing missiles and drones in Jammu and Srinagar, India",
                "It wasn’t US mediated according to India or Pakistan.",
                "Already being violated by Pakistan"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Terror group supporters posted on Tiktok from site targeted in Indian Airstrikes",
            "external_url": "https://news.sky.com/story/terror-group-supporters-posted-on-tiktok-from-site-targeted-in-indian-airstrikes-13363716",
            "upvotes": 133,
            "date": "05/10/2025",
            "thumbnail": "https://e3.365dm.com/25/05/1600x900/skynews-india-pakistan-teaser_6910817.jpg?20250509085412",
            "top_comments": [
                "I'm starting to suspect Pakistan may not be as anti-terror as they claim.",
                "to those who are incapable of going to article  and reading \n\n>The caption of the video reads 'we are little soldiers, and we fight the non-believers'. It uses the hashtag '313'.\n\n>The caption uses the hashtag #جہاد313, which translates to '313' jihad.\n\n>**'313' appears to refer to the 313 Brigade, a proscribed terror organisation in Pakistan.**\n\n>In a TikTok video posted to the Google page for Markaz Taiba Mosque in Muridke, a man can be seen walking along the street with a gun.",
                "Great! Their “civilians” have made these videos. Great, can’t blame it on media now. \n\nProof’s here, Pakistan",
                "The audacity!\nHere is your proof, Pakistan! Here are your “civilians” carrying guns and declaration to fight infidels.",
                "Ngl…all (India and Pakistan) the news coverage feels like propaganda from a westerner’s pov bc a lot of reporting we have access to has emotional rhetoric. Instead of downvoting…maybe explain to people why one terror group represents the entire country. For people in the US, we are filled with domestic terrorists that don’t represent the majority…it’s hard to understand how people are concluding that Pakistan is responsible for the Kashmir attacks. On the other hand, Pakistan is sus and does have ties to terrorist groups in the past. Can someone give more clarity here?",
                "We all know 'Pakistan is a rough terrorist blacklisted nation/organisation '",
                "Man these are the same kinds of articles we had in the early 2000's trying to convince us in the states war in the middle east was justified.",
                "You guys are a lost cause.\n\nEven indians are boycotting their media.\n\nYalda hakim ( an afghan ) of skynews has intimate pictures with a bjp leader.\n\nEven children ask more questions before changing their mind.",
                "Seems like the same hoax as 'weapons of mass destruction'",
                "It's always a nice reminder that brown people are just as awful as white people.\n\nSee= this entire post."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Newark mayor arrested by ICE agents at detention center",
            "external_url": "https://www.fox5ny.com/news/newark-mayor-arrested-ice-detention",
            "upvotes": 43864,
            "date": "05/09/2025",
            "thumbnail": "https://images.foxtv.com/static.fox5ny.com/www.fox5ny.com/content/uploads/2025/05/1280/720/ssstwitter.com_1746820692383.00_00_52_27.still003.jpg?ve=1&tl=1",
            "top_comments": [
                "\"Witnesses said the arrest came after Baraka attempted to join a scheduled tour of the facility with three members of New Jersey’s congressional delegation, Reps. Robert Menendez, LaMonica McIver, and Bonnie Watson Coleman.\n\nWhen federal officials blocked his entry, a heated argument broke out, according to Viri Martinez, an activist with the New Jersey Alliance for Immigrant Justice. It continued even after Baraka returned to the public side of the gates.\n\n. . . \n\nIn video of the altercation shared with The Associated Press, a federal official in a jacket with the logo of the Homeland Security Investigations can be heard telling Baraka he could not join a tour of the facility because “you are not a congress member.”\n\nBaraka then left the secure area, rejoining protesters on the public side of the gate. Video showed him speaking through the gate to a man in a suit, who informed him: “They’re talking about coming back to arrest you.”\n\n“I’m not on their property, they can’t come out on the street and arrest me,” Baraka replied.\n\nMinutes later several ICE agents, some wearing face coverings, surrounded Baraka and others on the public side of the gate. As protesters cried out, “Shame,” Baraka was dragged back through the security gate in handcuffs.\"",
                "Wow surprising, they are all masked.",
                "Alina Habba is a fucking US ATTORNEY?\n\nI guess I shouldn’t be surprised…\nWhat a fucking joke\n\nDemocrats need to aggressively oppose this gestapo shit AND offer a lawful and humane immigration solution",
                "Something’s going to give in this country. All this is already happening and Trump has only been in power 100 days and some change. Can’t even imagine how much worse things are going to get.",
                "What I don't understand is how ICE was able to arrest him. If this is criminal trespass, and it is committed by a citizen, then local police had jurisdiction.",
                "Gestapo doin Gestapo shit.",
                "It is not mistake. It is blatant racism. \n\n\"An ICE attorney in Dallas, James “Jim” Joseph Rodden, is under scrutiny following allegations that he operated a white supremacist account on X (formerly Twitter) under the handle u/GlomarResponder\".\n\n[https://www.texasobserver.org/ice-prosecutor-dallas-white-supremacist-x-account/](https://www.texasobserver.org/ice-prosecutor-dallas-white-supremacist-x-account/)",
                "ICE is a rogue paramilitary unit. Fuck ICE",
                "Arresting judges and elected officials. Don't overreact. Totally normal....in places like Nazi Germany.",
                "This administration is disgusting"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "The U.S. has 1,001 measles cases and 11 states with active outbreaks",
            "external_url": "https://www.nbcnews.com/health/kids-health/us-1001-measles-cases-11-states-outbreaks-virus-spreading-rcna205948",
            "upvotes": 7100,
            "date": "05/09/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-02/250226-measles-mb-1442-44b90a.jpg",
            "top_comments": [
                "Number of cases in US by Year:  \n2020 = 13  \n2021 = 49  \n2022 = 121  \n2023 = 59  \n2024 = 285  \n2025 as of Today = 1,001\n\nHmm... One of these things aren't like the others.",
                "I’d put money on it being underreported.",
                "One thousand cases. In 2025. This should not be happening.",
                "Make measles great again! Well done you bunch of friggin clowns.",
                "If only science had come up with a way to protect people and limit the spread of diseases.",
                "It's awful, especially considering a nutjob is currently health secretary. \n\n\nIt's not better in Europe though. Sadly we also have a bunch of anti-vaxx nutjobs here. Here in Germany we had 555 cases of measles last year, and we only have a fourth of the US population. Even worse in the UK, there they had almost 3000 cases last year and they only have a fifth of the US population.",
                "Man, if only we could find a way to prevent this from happening…",
                "Those are rookie numbers, Ontario sits at 1,440 since October. Why we picked this contest to win, I'll never know.",
                "Texas should be sued for this",
                "It's gonna get worse. Summer will spread it."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "USDA, DOGE demand states hand over personal data about food stamp recipients",
            "external_url": "https://www.npr.org/2025/05/09/nx-s1-5389952/usda-snap-doge-data-immigration",
            "upvotes": 4392,
            "date": "05/09/2025",
            "thumbnail": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4903x2758+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F58%2F3c%2Fa416e52d42e999ab925de6861ce7%2Fgettyimages-2200077442.jpg",
            "top_comments": [
                "Just putting together lists of people we've claimed are drains on society and subhuman for years, nothing to worry about. Oh, also we're getting rid of Habeas Corpus. But don't worry, we're *totally* just doing that to immigrants, we promise.",
                "Putting together the lists of people who will be sent to the camps next year.",
                "> Including Social Security numbers, addresses and, in at least one state, citizenship status, according to emails shared with NPR by an official who was not allowed to speak publicly.\n\nYeah, there's nothing alarming about that. /S Just like creating a database of autistic people is supposed to be a \"good\" thing. This administration is sorting people into categories it deems inferior.",
                "No. Go fuck yourselves you fascist assholes. There's only one good kind of fascist. I can't say which kind because Reddit will ban me since they're a bunch of sympathizers at this point.",
                "When you pass a trillion dollar military budget, cutting fractions of a percent makes no impact on debt reduction at all\n\nAll this does is bring pain and suffering to those that need help the most",
                "The legal response should simply say,  “Eat a dick.”",
                "Hey DOGE.... Eat Shit!",
                "We are at the useless eaters point .\n\nGood luck neighbours.",
                "You know a great way to save tax dollars concerning food stamps? Raise the minimum wage. Our taxes supplement Walmart profits. These corporations need to pay up.",
                "They're gonna be super fucking bummed when they realize the majority of people are white people that live in rural communities."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "FedEx board member Steiner is picked to be next USPS postmaster general amid talk of privatization",
            "external_url": "https://apnews.com/article/usps-postmaster-general-steiner-privatization-b88684227b01c71f6674f9569ca8adc6",
            "upvotes": 4250,
            "date": "05/09/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Ahh, I remember the good old days when admins at least pretended to care about 'conflict of interest'.",
                "Almost every business in the US relies on USPS this would be an unmitigated disaster. Trumps rural base would also get screwed which would be a silver lining.",
                "USPS is constitutionally mandated. We would need a constitutional amendment to privatize it.\n\nFirst Class mail will be $5, though. And It won't go to every address in the U.S. in a short amount of time.",
                "#SAVE USPS!\n\n\"Neither snow nor rain nor heat nor gloom of night stays these couriers from the swift completion of their appointed rounds\"\n\nUSPS is one of America’s oldest institutions. Benjamin Franklin was the first Postmaster. Connecting America",
                "They are going to privatize it. Once Dejoy was in it was just a matter of time.",
                "Every Trump agency head pick is an intentional act to destroy the agency they're heading.",
                "In a few years a Democratic president will say it's not possible to get rid of this person.",
                "Never forget the lesson that one single corrupt president can bring ruin to hundreds of years of progress. No election in a democratic country is meaningless. If you failed to vote last November, or if you voted for Trump, you are partially responsible for this.",
                "Let’s pick someone from the shittiest, most unreliable courier service in America to be the next postmaster. That makes sense.",
                "Between this, selling off national parks, shutting down other public institutions for private gain... We're going to look like the oligarchy in Russia after the fall of the USSR.\n\nIt's going to take decades to repair, if we even can fix it at all."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "US Judge halts Trump regime's secretive deportation scheme to war-torn Libya",
            "external_url": "https://foreignpost.news/p/us-judge-halts-trump-regimes-secretive",
            "upvotes": 6149,
            "date": "05/09/2025",
            "thumbnail": "https://substackcdn.com/image/fetch/w_1200,h_600,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd209ae36-1e1f-4d23-912a-b9de5dd27c79_1262x841.jpeg",
            "top_comments": [
                "The term is rendition, not deportation. Unless they are deporting Libyans.",
                "Get rid of Trump or it will only get worse.\n\nHe doesnt care about law so it wont stop him or make him rethink. Trump either does it anyway or remove the obstacle that was in his way by using fascist methods and then does it anyway.\n\nTrump is in his 4th month, 2 years(midterms) of this will cause irreparable damage to everything in the USA.\n\nEveryday with him in office is a day closer for civil war being the only way to get rid of Trump, family and friends.",
                "How long until they do it anyway",
                "I'm sure in the near future Trump will reach an agreement with Putin to send American prisoners to Siberia. I'm sure party affiliation will determine if you qualify.",
                "\"Trump regime\" finally we see news outlets say it out loud. Now we need US major outlets to do the same. There's nothing \"administration\" about fascism.",
                "Like that matters. The administration is ignoring the unanimous orders from the supreme court and you think they will listen to this? The Supreme Court needs to reverse their decision giving Trump immunity. They can revisit it at any time and they didn't follow the rule of law when they gave Trump immunity so you shouldn't have any issue fixing it.",
                "Every time I see trump talk, I think of the videos of Libyans dragging Muammar Gaddafi and beating him/shooting him to his death.",
                "OMG time to arrest Trump",
                "Incorrect headline, they didn’t stop anything, probably just issued a piece of paper that they usually expect to be followed that should stop this plan, but won’t.",
                "> Immigration attorneys moved swiftly on Wednesday to block the effort, filing an emergency request in federal court. “Multiple credible sources report that flights are preparing to immediately depart the United States carrying class members for removal to Libya,” they wrote in a court filing.\n\nThey are trying to do the El Salvador thing all over again because not a single person has been held in contempt for that shit."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Earthquake in Tennessee felt across the Southeast | CNN",
            "external_url": "https://www.cnn.com/2025/05/10/us/earthquake-tennessee-southeast-us-saturday",
            "upvotes": 134,
            "date": "05/10/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/image-20250510140142134.png?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "I felt it! It sounded like a low-flying Chinook going over my house. \n\nAlso /r/knoxville is going nuts about it.",
                "I’m in Maryville TN, really close to this. Was in a tire shop getting my tires replaced. There was apparently a huge gas leak across the street yesterday. When the earthquake happened the whole building shook. Everybody rushed to the front of the store to see if the gas main had exploded.",
                "My sister said she felt that all the way down in Braselton, Georgia. That’s crazy. ",
                "Lol I say this as a west coaster... It's just a 4.1 lol",
                "The New Madrid fault is having some fun! If it goes big that whole area of the country is righteously doomed. EDit: Wrong side of Tennessee to be that fault. Carry on!",
                "I was trying to fall back asleep and it woke me. I also had my window open so I could hear all the houses shake or whatever that noise was.",
                "Dang I missed it.  Was at the gym doing leg day.  My legs were already shaking so didn't notice. My neighbor called me right after it happened to ask if I felt it.  Dang it why did I decide to do leg day today?!"
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/10/2025 16:09:07 UTC"
}