{
    "posts": [
        {
            "category": "HOT",
            "title": "New COVID variant NB.1.8.1 behind surge in China, now detected in U.S.",
            "external_url": "https://www.cbsnews.com/news/us-reports-cases-new-covid-variant-nb-1-8-1-behind-surge-china/",
            "upvotes": 14805,
            "date": "05/24/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2022/07/02/f51bdaca-e805-497f-ac63-87512d4f26e8/thumbnail/1200x630g8/61033adab0efca6ba877823db762172b/GettyImages-457163942.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Covid starting to look like patch notes",
                "If Nintendo reveals AC for the Switch 2, then it's time to panic.",
                "I'm starting to get sick of reality's recycled plot devices.",
                "[https://cdn.who.int/media/docs/default-source/documents/epp/tracking-sars-cov-2/23052025\\_nb.1.8.1\\_ire.pdf?sfvrsn=7b14df58\\_4](https://cdn.who.int/media/docs/default-source/documents/epp/tracking-sars-cov-2/23052025_nb.1.8.1_ire.pdf?sfvrsn=7b14df58_4)\n\nWHO TAG-VE Risk Evaluation for SARS-CoV-2 Variant Under Monitoring: NB.1.8.1\n\nExecutive Summary\n\nNB.1.8.1 has been designated a SARS-CoV-2 variant under monitoring (VUM) with increasing proportions\n\nglobally, while LP.8.1 is starting to decline. Considering the available evidence, the additional public health risk\n\nposed by NB.1.8.1 is evaluated as low at the global level. Currently approved COVID-19 vaccines are expected\n\nto remain effective to this variant against symptomatic and severe disease. Despite a concurrent increase in\n\ncases and hospitalizations in some countries where NB.1.8.1 is widespread, current data do not indicate that\n\nthis variant leads to more severe illness than other variants in circulation.",
                "Take a look at Covid.gov. They turned that site into a joke.",
                "Oh good, just in time for it to be against the law for most of us to get vaccinated against it.",
                "Covid dlc before gta6",
                "Trump and Covid, name a more iconic duo....",
                "Here we go again...\n\nSo glad we have the brainworm to keep us strong and healthy.\n\n/s",
                "Ah shit, here we go again"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "U.S. citizen with REAL ID handcuffed and held in immigration raid before being released",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-immigration-raid-real-id-handcuffed-alabama-rcna208794",
            "upvotes": 5899,
            "date": "05/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250523-leonardo-garcia-venegas-se-243p-6a1772.jpg",
            "top_comments": [
                "Republicans claim that ID is needed to prevent fraud, but when given ID they ignore it because the skin is brown.  They are racists, full stop.",
                "“She said they have been trying to find a lawyer but local ones have told them that it is nearly impossible to sue a federal agent” \n\nTheres your problem right there. This really should not be a thing. All law enforcement including federal officers should be personally liable whenever they abuse their authority. I really hope when this Trump nightmare is over this is something that will be looked at. Fuck you and your thin blue line",
                "Why are we paying for Real ID when they call it fake, are they fucking stupid or something? Why make any of us do any of this when it doesn't matter to them to begin with?",
                "Surprised they released him.",
                "Any idiot can see that this will happen regularly and some citizens will probably end up in El Salvador doing hard time before someone figures out that they don't belong there. Hate is running our country right now and there are a ton of church going MAGA members who applaud it.",
                ">REAL ID is the identification U.S. citizens are required by law to have in order to travel through airports **and enter federal buildings**.\n\nI checked and for certain federal facilities this is true. That is an amazing restriction on the average citizen. I am astonished that this is the law.",
                ">\"Apparently a REAL ID is not valid anymore. He has a REAL ID,\" his cousin Shelah Venegas said. \"We all made sure we have the REAL ID and went through the protocols the administration is asking for. ... He has his REAL ID and then they see him and I guess because his English isn't fluent and/or because he's brown it's fake, it's not real.\"\n\n>Garcia had told Noticias Telemundo that \"they grabbed me real bad\" and the handcuffs were placed \"very hard\" on him. \n\n\n\nViolent racism is the \"kick\"... it's what they get out of this. It's pretty disgusting. If you believe you have any kind of soul or worth as human being, you are flushing it down to the sewer to revel in hatred and brute squad stuff towards anybody.",
                "Federal authorities have ways of verifying that an id is legitimate. The fact that they just didn't do that should be construed as wanting to establish a conspiracy to violate his rights. An American citizens rights. Shut the f****** fascists up and shut the f*** up about everything. You're destroying this country.",
                "This is the playbook for stopping certain people from voting",
                "I’ve wondered if anything’s stopping ICE from just throwing away someone’s ID/birth certificate then arresting them"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Killer whales left trapped in abandoned French marine park four months after closure.",
            "external_url": "https://www.standard.co.uk/news/world/orcas-trapped-french-marine-park-four-months-after-closure-b1227904.html",
            "upvotes": 23427,
            "date": "05/23/2025",
            "thumbnail": "https://static.standard.co.uk/2025/05/15/9/55/GettyImages-2191585917.jpg?width=1200&auto=webp&quality=75",
            "top_comments": [
                "Several sanctuaries have petitioned France to rescue the orcas. So far two, one in Japan and one in Canada, have been rejected for being too far to transport. There are also dolphins in another enclosure that need help too. They can not be released due to being bred in captivity.\n\n**Edit:** Courtesy of /u/MtnMoonMama here is a link to write President Macron about the situation if you feel so inclined. https://www.elysee.fr/en/contact/",
                "So they’re feeding them but can’t seem to find the resources to clean the enclosures? Sounds like rubbish excuses from those responsible. ",
                "Fucking Christ, that drone shot of them being in separate pools, is just fucking heart breaking. They've been like that for MONTHS! Fucking hell. The previous owners of that abandoned park need to be in jail for decades.",
                "This an intelligent animal that is huge and made for a life in the open ocean.\n\nIt must drive them absolutely fucking insane being confined to a limited space",
                "You can send Emmanuel Macron a direct message here\n\n\nhttps://www.elysee.fr/en/contact/\n\n\nEdit: fill out the form. Send it. They send you an email with a link you must click. Click the link to send. ",
                "Need to find a maladjusted orphan boy with a soft heart to solve this one. ",
                "Man, where's the Mexican space program when you need it.",
                "Keeping these animals who travel thousands of miles in the wild in little kiddie pools is straight up torture. Idk why we still allow this",
                "what the fucking shit, France?",
                "is it the price of long distance travel that is the problem? i can't imagine the stress of that trip would be more than what they are going through now"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Belgium’s future queen caught up in Harvard foreign student ban",
            "external_url": "https://www.theguardian.com/world/2025/may/23/belgium-future-queen-caught-up-harvard-foreign-student-ban",
            "upvotes": 17516,
            "date": "05/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d0fad91d174129333633af0dd7dae3047248878b/2016_115_1435_1148/master/1435.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5be6fbb9164c1aab0e2f3c34b6c77a0e",
            "top_comments": [
                "There will be lots of sons and daughters of prominent politicians and rich internationals impacted by this.  I bet there will be lots of exceptions made.",
                "Go read the DHS rational for this decision it’s insanity. They accuse Harvard of basically working with the CCP to undermine American interests",
                "I remember in his first term, POTUS wondered out loud about why people from “white” European counties aren’t immigrating to the US instead of from those “sh*thole” countries. He’s his own worst enemy in terms of promotion, self or otherwise.",
                "With her stature as future Queen, the Yales and Stanfords will be eager to offer her a spot. I have more sympathy for the normal people who got in purely on merit — they're the ones truly screwed.",
                "Yep she is a radical and a terrorist suspect.   Needs to have Trumps ICE treatment ….  No questions asked no due process like the rest of them … let’s see how he sugar coats this one.  Insane !",
                "Not calling her crown princess is weird.",
                "They forgot to exempt white girls",
                "Ha! This is so funny given how enamored Trump is with royals!",
                "im sorry, but what about university autonomy? how the fuck is this happening? what the fuck is wrong with the usa? baffling. absolutely baffling",
                "Harvard sues and judge has blocked Trump’s ban.\n\nhttps://www.nytimes.com/2025/05/23/us/harvard-sues-trump-international-students-garber.html"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Kim Jong Un watches as North Korea's newest warship falls off dry dock",
            "external_url": "https://www.nbcnews.com/world/asia/new-north-korean-warship-damaged-launch-ceremony-leader-kim-looks-rcna208425",
            "upvotes": 4395,
            "date": "05/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-kim-jong-un-mb-0757-9be9f5.jpg",
            "top_comments": [
                ">The 5,000-ton destroyer slid off a flatcar because of “inexperienced command and operational carelessness in the course of the launch,” according to the Korean Central News Agency, crushing parts of the bottom of the ship.\n\nI wonder if those guys are already dead.",
                "I want to giggle, but I realize someone will pay dearly for this...",
                "North Korea doesn't have a dedicated Dry Dock. North Korea has been side launching their ships and does not have a dedicated Dry Dock to do the extensive repairs the ship will need if it could be repaired at all.",
                "Kinda amusing until you realise a bunch of, most probably innocent, people are going to suffer for this, and that most of N.Korea's population is already horribly suffering, and they're spending their  money on pointless warships.",
                "Those responsible will be subject to anti-aircraft missiles.",
                "Multiple people will get executed for this",
                "Satellite image of the fallen warship:\n\nhttps://i.imgur.com/9Mdrqzc.png\n\nThey were side-launching the ship and it seems like one end slid while the other lagged behind or remained stationary, causing the whole thing to go caddywompus.",
                "This is the entirely predictable outcome of attempting to modernize a navy under Russian tutelage.\n\nhttps://www.twz.com/russias-cursed-carrier-is-finally-in-a-drydock-that-cant-sink\n\nhttp://www.hisutton.com/Russian-Floating-Dock-PD-19-Sinks.html",
                "Too bad he doesn't have a butt-hole, then at least he could give a shit.",
                "OMG. In NK they not only punish the perp but their family as well"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Justice Department reaches deal to allow Boeing to avoid prosecution over 737 Max crashes | AP News",
            "external_url": "https://apnews.com/article/boeing-justice-department-max-crashes-9f7250a2e2b400b31e19f2b261f78163",
            "upvotes": 5662,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Let me show you my shocked face: 😐",
                "2025 America: corporate crime is now legal and we're done pretending",
                "\"The Justice Department said in a court filing that it had reached an “agreement in principle” that will require the company to pay and invest more than $1.1 billion. In return, the department will dismiss the criminal case against the aircraft manufacturer. The deal still needs to be finalized.\" How much did they give Trump and his family?",
                "DOJ being compromised like this is INSANE. ",
                "The “Justice” department",
                "I'm a lawyer, and I'm no spring chicken on how the world works. Even so, I'm never any less disgusted and shocked that murder in this country is legal if you do it from a conference room. \n\n\nBoeing murdered 346 people for a marketing strategy. ",
                " Justice in Murica.  Bribe the Comrade Cheeto and walk away.",
                ">The Justice Department said in a court filing that it had reached an “agreement in principle” that will require the company to pay and invest more than $1.1 billion. In return, the department will dismiss the criminal case against the aircraft manufacturer.\n\nI wonder how much they had to pay this corrupt administration for this deal.",
                "I bet my left arm this is the 1.1 billion they're going to use to retrofit the Qatari jet. Un fucking believable...",
                "“Pay and invest 1.1 billion and extra 454 million for victim families”\n\nAka split up the 454 million amongst all of those families and buy 1.1 billion of trump’s shitcoin."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Harvard sues Trump administration over move to bar international students",
            "external_url": "https://www.nytimes.com/2025/05/23/us/harvard-university-trump-administration-alan-garber.html?unlocked_article_code=1.JU8.xeSH.2TIeBuXbAGFh&smid=nytcore-ios-share&referringSource=articleShare",
            "upvotes": 37619,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Even if Harvard wins decisively in court what international student would risk getting grabbed by ICE and sent to some foreign gulag? That is the true authoritarian evil of this administration. It doesn’t even matter if it would be legal or not. Trump has targeted international students at Harvard and that’s that.",
                "Trump's vendetta against Harvard is deeply disturbing",
                "That was quick. Best of luck to potentially the best legal team in the history of humanity. Their fight depends on legitimacy of the courts, though, so, you know...",
                "The other Ivy League schools need to join in on this and show solidarity…",
                "When America votes in a convicted felon and psychopath as POTUS, don’t be surprised when he does nonstop crazy things.",
                "Nothing to worry folks, the brightest minds that are coming from all parts of the globe to Harvard and other prestigious universities are going to be replaced with the Andrew Tates of the world.",
                "Did Havard reject Baron or something?",
                "Trumps fake emergency is getting a lot of mileage.",
                "“Trump administration’s Joint Task Force to Combat Antisemitism criticized the university for anti-Israel bias. On April 11, the task force sent a letter demanding that Harvard comply with a list of demands that ranged from hiring an outside monitor **to police the ideology of professors and students**.”\n\nWhat the living fuck? So Trump wants to create a branch of government called the ‘ideology police’? This is as bad as the morality police in Iran.",
                "At this point, all we can hope is that intelligence in sheer numbers eventually beats a handful of rich, evil people. There’s a disturbing number of cartoon villains moving in relative lockstep in the White House right now. \n\nAnd while some of the richest and smartest villains are pulling the strings to try and dismantle everything, there are also a lot of idiotic henchman expected to pull this off. That’s a big ask.\n\nAlso, there are plenty of smart people who will drag this out and delay, just like Trump and his cronies always do. There are still legal loopholes, and ways to slow down the process. Maybe going after Harvard of all places will backfire.\n\nTrump may have a lot of judges in his pocket, and yes—he’s building up ICE as his brownshirts. But he can’t corrupt absolutely everyone, and he won’t. \n\nPlus, most ICE agents will be cowards, mercenaries, and barely employable traitors, and we know how they act when faced with danger (the Uvalde police force is probably the caliber we’re looking at here.)  \n\nWhen the pushback becomes too great—when people start fighting back with guns to avoid getting abducted, when ICE agents start getting identified and doxxed, they will run away just like the cowards in Uvalde who were afraid to protect children. Because mentally, that’s all they are—angry, racist children.\n\nFight everything else through legal means. Jam up the court systems, just like Trump did. Stop the appeasement. Start making things difficult and annoying for them. That’s the only thing they don’t want—to have to work hard. \n\nTrump sure has made a lot of demands. Let him enforce them all, then."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Kim Kardashian’s robbers found guilty in Paris but won’t face prison time",
            "external_url": "https://apnews.com/article/kim-kardashian-heist-verdict-ff574b4b9427f7908ab32e3ee0008fef",
            "upvotes": 800,
            "date": "05/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The chief judge, David De Pas, said that the defendants’ ages — six are in their 60s and 70s — and their health issues weighed on the court’s decision to impose sentences that he said “aren’t very severe.”\n\nThey're called the \"Grandpa Robbers\" over in France.",
                "Didn't this happen nearly 10 years ago?",
                "Why even have a trial then",
                "Not surprising, we have a big issue in France when it comes to Justice. It takes ages to have trials, the prison are overcrowded and in a terrible state and the sentences are a joke. There is another big trial taking place right now, a monster soctor raped 299 children when they were under anesthesia after he operated thwm. He wrote in a private diary describing everything in detail. \n\nHe is facing 20 years in prison plus a special measure to keep him in Prison if they judge he is at risk to do it again. 20 years. For 300 rapes. On minors. The guy is 74 years but still it's infuriating. \n\nAnd we have this issue for a lot of crimes.",
                "shes so brave. she wore like $2m in jewlery to the court appearance as a statement that.. er idk what the statement was but she's brave!",
                "Looks like a standard trial in Belgium were none of the criminals would face actual punishment 🤡🤷‍♂️🤷‍♂️\n\nSo ffing sad 🤨",
                "\"Any other circumstance would be different but...she's just the worst\"",
                "I thought the bodyguard was involved?",
                "So if you’re old you can rob someone and get away with it ? Cool to know !",
                "Chic grandpa robbers ? 🤣 /J"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Twelve injured in knife attack at Hamburg railway station",
            "external_url": "https://www.bbc.co.uk/news/articles/cm26v7n5y4eo",
            "upvotes": 3384,
            "date": "05/23/2025",
            "thumbnail": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e23e/live/a550d960-3800-11f0-8947-7d6241f9fce9.jpg",
            "top_comments": [
                ">This is the latest violent attack in Germany in recent months.\n\nthats certainly a statement",
                "*A spokesman for the Hamburg fire department told Agence France-Presse (AFP) that 12 people had been injured in the attack. Among them were \"six people with life-threatening injuries,\" the spokesman said.*\n\nThis account makes the attack more deadly than the earlier one",
                "Women in male dominated fields",
                "For an incident like this to happen during rush hour it could have been much worse.",
                "I assume interest in this will magically disappear when people find out it was a 39 y.o. woman",
                "A bit of a morbid question but seriously how did she get *12* people before being stopped? That seems like a lot for a knife rampage",
                "A few people in the comments failing to remember the phrase “don’t bring a knife to a gunfight”.\n\nPeople hellbent on causing harm will find a way, if she had a gun there would be fatalities and probably many more lives affected.",
                "At least she didn't have a gun, this certainly would have been *much* worse.",
                "How could the knife do this??",
                "a gun wouldve caused tens of deaths instead of 12 wounded."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "HOT",
            "title": "Record beef prices raise Memorial Day cookout costs",
            "external_url": "https://www.reuters.com/world/us/record-beef-prices-raise-memorial-day-cookout-costs-2025-05-23/",
            "upvotes": 2498,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Nuh uh. Facebook told me prices for everything is waaaayyyy down.",
                "> Ground chuck prices in April reached a record $6 per pound, up 14% from a year ago, after farmers slashed their cattle herds to a 74-year low due to a years-long drought that reduced grazing lands.\n\nNo, there is no climate change, let's remove all environmental protection laws. And *DRILL*!",
                "It baffles me that people are still acting like our economy isn't crashing. People are out here spending hundreds of dollars on groceries that they don't need for holiday parties like this. Most of my coworkers were talking about how they spent the majority of their paychecks buying real eggs for Easter this year. And they looked at me like I was batshit insane when I said it would be cheaper to just use the plastic ones and you're not wasting food by doing it too. These people live in a completely different reality than the rest of us",
                "A year ago, this would get 24-7 breathless news coverage on every cable outlet.",
                "This is what we (as a country) get for electing an old fool with dementia to be President.",
                "Canned tuna fish is making a big comeback for tens of millions on fixed incomes or depressed, Republican-driven wages.   Soup!  Soup is still a decent buy if you get it on sale and buy the store brand.     \nThe old Memorial  Day Soup-fests of the Trump 2.0 administration.  Remember them well.  \n\nOr, beans and weenies are a good substitute.  \n\nWe are honoring the ones Don refers to as \"suckers and losers\" who gave their lives so we could have the freedoms we enjoy today so easily taken away by one man.  Enjoy!",
                "When can we expect the stupid graphics like Fox News has done for Thanksgiving?",
                "What do you mean? \n\nGroceries including beef are at an all time low. Everyone is saying it. We have the most beautiful prices in the world. Maybe ever. They come up to me and say \"sir, thank you for the lowest prices we've ever seen\".",
                "So Fox News/MAGA/Trump will blame Biden, Obama, Hillary and maybe Kamala…in that order.",
                "Beef quality in America has dropped SO MUCH in the last 20 years, its all garbage now, and prices climb. I saw a 4 pack of ribeyes at costco for $80 a couple weeks ago and its the same quality as Wal-Mart steak."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Boeing avoids prosecution in Justice Department deal over crashes",
            "external_url": "https://www.bbc.com/news/articles/c14kg0lj8k6o",
            "upvotes": 233,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c6b0/live/bd6b4b10-3806-11f0-96c3-cf669419a2b0.jpg",
            "top_comments": [
                "lesson here...corporate fraud DOES pay off.   Shareholders dividends are more important than human lives.  And government \"fines\" are just a business expense.",
                "How much did they \"donate\" to Trump's account for this outcome?",
                "I guess casualties are just a write off",
                "\"I'm sorry that your loved one died in an aviation accident, but if it's any consolation, Trump can now afford another golden toilet.\"",
                "Is this the Invisible Hand of the market that everyone keeps talking about?",
                "Being rich = not a criminal/not a fraud. I love capitalism. Until my job was outsourced to Mexico. Now I pay tariffs to hopefully bring back the company that abandoned me! Win/Win",
                "Another bribe pays off.",
                "At least call it what it was- a bribe.",
                "Justice denied to victims again.",
                "Looks like the cheque cleared."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "U.S. citizen with REAL ID handcuffed and held in immigration raid before being released",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-immigration-raid-real-id-handcuffed-alabama-rcna208794",
            "upvotes": 5895,
            "date": "05/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250523-leonardo-garcia-venegas-se-243p-6a1772.jpg",
            "top_comments": [
                "Republicans claim that ID is needed to prevent fraud, but when given ID they ignore it because the skin is brown.  They are racists, full stop.",
                "“She said they have been trying to find a lawyer but local ones have told them that it is nearly impossible to sue a federal agent” \n\nTheres your problem right there. This really should not be a thing. All law enforcement including federal officers should be personally liable whenever they abuse their authority. I really hope when this Trump nightmare is over this is something that will be looked at. Fuck you and your thin blue line",
                "Why are we paying for Real ID when they call it fake, are they fucking stupid or something? Why make any of us do any of this when it doesn't matter to them to begin with?",
                "Surprised they released him.",
                "Any idiot can see that this will happen regularly and some citizens will probably end up in El Salvador doing hard time before someone figures out that they don't belong there. Hate is running our country right now and there are a ton of church going MAGA members who applaud it.",
                ">REAL ID is the identification U.S. citizens are required by law to have in order to travel through airports **and enter federal buildings**.\n\nI checked and for certain federal facilities this is true. That is an amazing restriction on the average citizen. I am astonished that this is the law.",
                ">\"Apparently a REAL ID is not valid anymore. He has a REAL ID,\" his cousin Shelah Venegas said. \"We all made sure we have the REAL ID and went through the protocols the administration is asking for. ... He has his REAL ID and then they see him and I guess because his English isn't fluent and/or because he's brown it's fake, it's not real.\"\n\n>Garcia had told Noticias Telemundo that \"they grabbed me real bad\" and the handcuffs were placed \"very hard\" on him. \n\n\n\nViolent racism is the \"kick\"... it's what they get out of this. It's pretty disgusting. If you believe you have any kind of soul or worth as human being, you are flushing it down to the sewer to revel in hatred and brute squad stuff towards anybody.",
                "Federal authorities have ways of verifying that an id is legitimate. The fact that they just didn't do that should be construed as wanting to establish a conspiracy to violate his rights. An American citizens rights. Shut the f****** fascists up and shut the f*** up about everything. You're destroying this country.",
                "This is the playbook for stopping certain people from voting",
                "I’ve wondered if anything’s stopping ICE from just throwing away someone’s ID/birth certificate then arresting them"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Kim Kardashian’s robbers found guilty in Paris but won’t face prison time",
            "external_url": "https://apnews.com/article/kim-kardashian-heist-verdict-ff574b4b9427f7908ab32e3ee0008fef",
            "upvotes": 800,
            "date": "05/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The chief judge, David De Pas, said that the defendants’ ages — six are in their 60s and 70s — and their health issues weighed on the court’s decision to impose sentences that he said “aren’t very severe.”\n\nThey're called the \"Grandpa Robbers\" over in France.",
                "Didn't this happen nearly 10 years ago?",
                "Why even have a trial then",
                "Not surprising, we have a big issue in France when it comes to Justice. It takes ages to have trials, the prison are overcrowded and in a terrible state and the sentences are a joke. There is another big trial taking place right now, a monster soctor raped 299 children when they were under anesthesia after he operated thwm. He wrote in a private diary describing everything in detail. \n\nHe is facing 20 years in prison plus a special measure to keep him in Prison if they judge he is at risk to do it again. 20 years. For 300 rapes. On minors. The guy is 74 years but still it's infuriating. \n\nAnd we have this issue for a lot of crimes.",
                "shes so brave. she wore like $2m in jewlery to the court appearance as a statement that.. er idk what the statement was but she's brave!",
                "Looks like a standard trial in Belgium were none of the criminals would face actual punishment 🤡🤷‍♂️🤷‍♂️\n\nSo ffing sad 🤨",
                "\"Any other circumstance would be different but...she's just the worst\"",
                "I thought the bodyguard was involved?",
                "So if you’re old you can rob someone and get away with it ? Cool to know !",
                "Chic grandpa robbers ? 🤣 /J"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "At least 12 injured in hot air balloon crash near popular tourist site in Mexico",
            "external_url": "https://edition.cnn.com/2025/05/23/americas/mexico-hot-air-balloon-crash-intl-latam",
            "upvotes": 144,
            "date": "05/24/2025",
            "thumbnail": "https://media.cnn.com/api/v1/images/stellar/prod/globo.jpg?c=16x9&q=w_800,c_fill",
            "top_comments": [
                "The hot air balloon ride we did in Turkey was the first and last I’ll ever do. Views were epic and amazing, it was also out of control the entire time, almost ran into another balloon, and we got rag dolled so hard on landing we all thought we were going to die. Super cool and exciting, but never again.",
                "They are *extremely* lucky.\n\nPretty much every other time I've seen a power line hot air balloon story has been a no survivors moment",
                "I don't think I could ever be convinced to go on a hot air balloon",
                ">*The civil protection agency added that the balloon was operated by a tour company that offers hot air balloon rides to view the pyramids from above.*\n\nIt may not be the only hot air this tour company offers.",
                "No way in hell you're getting me in one of those balloons. I've never thought that they were safe.",
                "Thank God it wasn't a bus crash, there would have been 120 injured.",
                "I once heard a comedian say “I’m not saying ALL white people die in hot air balloon accidents. I’m just saying ONLY white people die in hot air balloon accidents.”"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Tensions rise as superpowers scrap for a piece of the Arctic",
            "external_url": "https://www.bbc.com/news/articles/cjwqn7z02plo",
            "upvotes": 73,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/bc8a/live/2024fda0-3811-11f0-96c3-cf669419a2b0.jpg",
            "top_comments": [
                "> Beijing faces stiff competition from Russia, China, Europe, India and the US.\n\nWho wrote this",
                "Look, there's a reason some powers don't give a fuck about climate change/global warming. You see, when the north turns into new temperature weather zones and all those resources become available for exploitation, all of our oligarch overlords will seize the opportunity to gain profits and power. They stand to gain from millions of people being displaced and global catastrophies becoming regular which is why they don't give a rats ass about the science.",
                "That's going to be prime beachfront property by the year 2075.",
                "I’m glad Europe is rejecting china trying to buy their access to the arctic through shitty land purchase and “infrastructure” projects.",
                "Chinese claims on the Arctic are more relevant and prevalent than what reddit would have you believe.\n\nTrump's ramblings about Greenland came from security briefs.",
                "Next major battle place?"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "New COVID variant NB.1.8.1 behind surge in China, now detected in U.S.",
            "external_url": "https://www.cbsnews.com/news/us-reports-cases-new-covid-variant-nb-1-8-1-behind-surge-china/",
            "upvotes": 14799,
            "date": "05/24/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2022/07/02/f51bdaca-e805-497f-ac63-87512d4f26e8/thumbnail/1200x630g8/61033adab0efca6ba877823db762172b/GettyImages-457163942.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Covid starting to look like patch notes",
                "If Nintendo reveals AC for the Switch 2, then it's time to panic.",
                "I'm starting to get sick of reality's recycled plot devices.",
                "[https://cdn.who.int/media/docs/default-source/documents/epp/tracking-sars-cov-2/23052025\\_nb.1.8.1\\_ire.pdf?sfvrsn=7b14df58\\_4](https://cdn.who.int/media/docs/default-source/documents/epp/tracking-sars-cov-2/23052025_nb.1.8.1_ire.pdf?sfvrsn=7b14df58_4)\n\nWHO TAG-VE Risk Evaluation for SARS-CoV-2 Variant Under Monitoring: NB.1.8.1\n\nExecutive Summary\n\nNB.1.8.1 has been designated a SARS-CoV-2 variant under monitoring (VUM) with increasing proportions\n\nglobally, while LP.8.1 is starting to decline. Considering the available evidence, the additional public health risk\n\nposed by NB.1.8.1 is evaluated as low at the global level. Currently approved COVID-19 vaccines are expected\n\nto remain effective to this variant against symptomatic and severe disease. Despite a concurrent increase in\n\ncases and hospitalizations in some countries where NB.1.8.1 is widespread, current data do not indicate that\n\nthis variant leads to more severe illness than other variants in circulation.",
                "Take a look at Covid.gov. They turned that site into a joke.",
                "Oh good, just in time for it to be against the law for most of us to get vaccinated against it.",
                "Covid dlc before gta6",
                "Trump and Covid, name a more iconic duo....",
                "Here we go again...\n\nSo glad we have the brainworm to keep us strong and healthy.\n\n/s",
                "Ah shit, here we go again"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Cub found alone in US woods now being raised by wildlife staff in bear costumes",
            "external_url": "https://www.theguardian.com/us-news/2025/may/23/bear-cub-california",
            "upvotes": 382,
            "date": "05/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3eebf858219609251ad3e28d9fd4343ca62c431c/126_0_3780_3024/master/3780.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e40af281fb51b3c66df91df9a4609e99",
            "top_comments": [
                "This option definitely was not mentioned on career day at my school.",
                "I'm an animal too. Universal health care for all!",
                "People really good at doing esoteric shit doing esoteric shit really well. Feels reassuring.  Maybe the way that cub feels, without thinking or knowing why.",
                "Its little milk snout 😭 thank you OP for some sweet news.",
                "It’s Smokey Bears origin story reboot.",
                "Man we need a lot more stories like this. Keep them coming. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Delivery driver finds way onto secured areas at O'Hare, drives miles before being spotted",
            "external_url": "https://www.cbsnews.com/chicago/news/delivery-driver-secured-areas-ohare/",
            "upvotes": 656,
            "date": "05/23/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/19/f668a728-ca0c-4e1d-8916-c2dff6b382df/thumbnail/1200x630/69a71b54505050287546ffcb4bfd611e/ohare-unauthorized-vehicle.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "*A source told CBS News Chicago the delivery driver drove miles along the interior and restricted roads at O'Hare — potentially crossing runways — before someone spotted him from the air traffic control tower.*\n\nNot at all surprising. Getting confused and lost inside a major metropolitan airport is almost par for the course.",
                "Reminds me of a story from years ago about how some person's GPS app told them to use some back entrance that was for service vehicles. They ignored a bunch of signs and wound up on the tarmac.",
                "\"Request access to gate agent Jimmy, Doordash 322\"\n\n\"Doordash, left turn on Lima, hold Tango.\"\n\n\"Left Lima, hold Tango. Doordash 322\"\n\n\"Speaking of hold, did you hold the hot sauce as requested?\"\n\n\"Hold on... the associate did add hot sauce packets just in case but confirmed none in the pax load. Doordash 322\"\n\n\"Clear to deliver to Jimmy gate. Request diversion of hot sauce to control tower, Doordash. My lunch has no gust. I'll make it worth your while\"\n\n\"Deliver to Jimmy and hot sauce to ATC tower. Big tip. Doordash 322\"\n\n\"Safe travels\"",
                "Someone was watching this dude on the map going \"wtf, where is he going with my pizza\"",
                "The threat of the boss was greater than the threat of guys with guns.",
                "We all get lost at that dump. Including the planes.",
                "Michael that’s the lake",
                "Delivery drivers DAMN those folks james-bond their way into any place no matter what!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Georgia O’Connor, U.K. boxer, dies at 25 after saying doctors 'gaslit' her on cancer concerns for months",
            "external_url": "https://www.nbcnews.com/sports/boxing/georgia-oconnor-uk-boxer-dies-25-saying-doctors-gaslit-cancer-concerns-rcna208766",
            "upvotes": 3210,
            "date": "05/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250523-georgia-o-connor-mn-1145-02f2ab.jpg",
            "top_comments": [
                "Says she had UC and PSC. That combo makes it extremely likely this was bile duct cancer. Extremely deadly with one of the worst survival rates. Docs would 100% know the risk for her. Tragic.",
                "This reminded me on a comment someone posted about their mother. She was having extreme back pains from what I recall and went to the doctor about it. But she was over weight so they said she needed to lose weight and didn't actually check anything. After months on losing weight and the pain never going away and doctors still not doing anything the whole time, they final tested her after losing the weight. She had cancer in her back but it had spread everywhere by this time. She ended up dying and the type of cancer she had was very survivable if caught early.",
                "No shit. It was just a couple days ago where a 'major American medical body' said to use pain management when inserting IUDs. Fuck all the medical systems.",
                "So sad how the doctors let this girl down. None of them should be allowed to work in this field. The article doesn't seem to say what type of cancer she had but it seems like it was pretty aggressive based on the timeline and those weeks they spent spinning twiddling their thumbs and refusing to do tests probably cost this girl her life.",
                "Very common. I was having abdominal pain for years and despite multiple CAT scans and colonoscopies and doctors telling me nothing was wrong. Eventually it got so bad and a doctor finally found out my aorta was splitting (aorta dissection) but at that point I needed emergency surgery. Still paying the helicopter bill.",
                "Genuine question: In the UK, can you go pay for bloodwork labs? In the US, you don't need to have a doctor referral if you pay out of pocket.",
                "Unfortunately this is bog standard for women with health concerns. Bless her, poor lassie.",
                "This happens all the time and it’s quite sad. You can’t fully trust doctors, need to do your own research, and 100% need to advocate for yourself at all times. \n\nWithout sharing too much information, a close family member had cancer and our doctor advocated a very relaxed approach with no surgery. We pushed back after doing research and they said no. We all got a bad feeling and got a second opinion. \n\nThe second opinion said we should have had surgery yesterday and scheduled it ASAP. \n\nThat surgery saved their life and they’re still here today in remission because of it.",
                "No insurance,  no worries. Even if I found out in time, it wouldn't matter.",
                "Darwin hard at work. Hate to see it, but let this be a lesson. You don't know more than doctors."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "NEW",
            "title": "Judge blocks Trump administration from revoking Harvard enrollment of foreign students",
            "external_url": "https://www.reuters.com/world/us/harvard-sues-trump-administration-blocking-enrollment-foreign-students-2025-05-23/",
            "upvotes": 880,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Trump and his team fully expected this to happen. They know that even if it gets fully blocked by the courts, it will succeed in scaring away international students from attending Harvard. And for the ones who still decide to go, the judicial department will probably target them.",
                "More Tumpism dystopia.  Everybody needs to ignore any order given by Trump at this point. Flat out refuse to do anything he or his funkies decree. It is the only way this ends. Well.... not the only way, but the only peaceful way.",
                ">\"unelected judges have no right to stop the Trump Administration from exercising their rightful control over immigration policy and national security policy.”\n\nThey most certainly do. It is one of the core responsibilities of the judicial branch and is enshrined in the Constitution of the United States. \n\nThey fully know these facts but do not care and are wilfully defying their oaths of office. This is reason enough for them to be thrown out of office. But the protections in the Constitution to enforce these provisions are hopelessly toothless. Bad faith actors in the Trump administration know these facts too and do not care about the harm they are causing the nation.",
                "Didn’t he just pass a bill enabling him to ignore and arrest judges he disagrees with? And didn't he make himself immune to crimin al proceedings? (Textbook narcissist)",
                "Damage is done. How many foreigners want to be a tennis ball on this game?",
                "What keeps me going in this depressing time Is the hope that contempt findings can be had against anyone who tries to enforce an illegal action. Trump himself may be immune, but all the people working for him should face judicial wrath. Specially, civil contempt, which cannot be pardoned.",
                "It doesn't matter if they sue.  Trump will just ignore any judgements against him and he will do what he wants.  He said he would be a dictator on day one, and I guess he kept his word."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "U.S. citizen with REAL ID handcuffed and held in immigration raid before being released",
            "external_url": "https://www.nbcnews.com/news/latino/us-citizen-immigration-raid-real-id-handcuffed-alabama-rcna208794",
            "upvotes": 5890,
            "date": "05/24/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250523-leonardo-garcia-venegas-se-243p-6a1772.jpg",
            "top_comments": [
                "Republicans claim that ID is needed to prevent fraud, but when given ID they ignore it because the skin is brown.  They are racists, full stop.",
                "“She said they have been trying to find a lawyer but local ones have told them that it is nearly impossible to sue a federal agent” \n\nTheres your problem right there. This really should not be a thing. All law enforcement including federal officers should be personally liable whenever they abuse their authority. I really hope when this Trump nightmare is over this is something that will be looked at. Fuck you and your thin blue line",
                "Why are we paying for Real ID when they call it fake, are they fucking stupid or something? Why make any of us do any of this when it doesn't matter to them to begin with?",
                "Surprised they released him.",
                "Any idiot can see that this will happen regularly and some citizens will probably end up in El Salvador doing hard time before someone figures out that they don't belong there. Hate is running our country right now and there are a ton of church going MAGA members who applaud it.",
                ">REAL ID is the identification U.S. citizens are required by law to have in order to travel through airports **and enter federal buildings**.\n\nI checked and for certain federal facilities this is true. That is an amazing restriction on the average citizen. I am astonished that this is the law.",
                ">\"Apparently a REAL ID is not valid anymore. He has a REAL ID,\" his cousin Shelah Venegas said. \"We all made sure we have the REAL ID and went through the protocols the administration is asking for. ... He has his REAL ID and then they see him and I guess because his English isn't fluent and/or because he's brown it's fake, it's not real.\"\n\n>Garcia had told Noticias Telemundo that \"they grabbed me real bad\" and the handcuffs were placed \"very hard\" on him. \n\n\n\nViolent racism is the \"kick\"... it's what they get out of this. It's pretty disgusting. If you believe you have any kind of soul or worth as human being, you are flushing it down to the sewer to revel in hatred and brute squad stuff towards anybody.",
                "Federal authorities have ways of verifying that an id is legitimate. The fact that they just didn't do that should be construed as wanting to establish a conspiracy to violate his rights. An American citizens rights. Shut the f****** fascists up and shut the f*** up about everything. You're destroying this country.",
                "This is the playbook for stopping certain people from voting",
                "I’ve wondered if anything’s stopping ICE from just throwing away someone’s ID/birth certificate then arresting them"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Boeing avoids prosecution in Justice Department deal over crashes",
            "external_url": "https://www.bbc.com/news/articles/c14kg0lj8k6o",
            "upvotes": 231,
            "date": "05/24/2025",
            "thumbnail": "https://ichef.bbci.co.uk/news/1024/branded_news/c6b0/live/bd6b4b10-3806-11f0-96c3-cf669419a2b0.jpg",
            "top_comments": [
                "lesson here...corporate fraud DOES pay off.   Shareholders dividends are more important than human lives.  And government \"fines\" are just a business expense.",
                "How much did they \"donate\" to Trump's account for this outcome?",
                "I guess casualties are just a write off",
                "\"I'm sorry that your loved one died in an aviation accident, but if it's any consolation, Trump can now afford another golden toilet.\"",
                "Is this the Invisible Hand of the market that everyone keeps talking about?",
                "Being rich = not a criminal/not a fraud. I love capitalism. Until my job was outsourced to Mexico. Now I pay tariffs to hopefully bring back the company that abandoned me! Win/Win",
                "Another bribe pays off.",
                "At least call it what it was- a bribe.",
                "Justice denied to victims again.",
                "Looks like the cheque cleared."
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Cub found alone in US woods now being raised by wildlife staff in bear costumes",
            "external_url": "https://www.theguardian.com/us-news/2025/may/23/bear-cub-california",
            "upvotes": 383,
            "date": "05/24/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/3eebf858219609251ad3e28d9fd4343ca62c431c/126_0_3780_3024/master/3780.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e40af281fb51b3c66df91df9a4609e99",
            "top_comments": [
                "This option definitely was not mentioned on career day at my school.",
                "I'm an animal too. Universal health care for all!",
                "People really good at doing esoteric shit doing esoteric shit really well. Feels reassuring.  Maybe the way that cub feels, without thinking or knowing why.",
                "Its little milk snout 😭 thank you OP for some sweet news.",
                "It’s Smokey Bears origin story reboot.",
                "Man we need a lot more stories like this. Keep them coming. "
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "New COVID variant NB.1.8.1 behind surge in China, now detected in U.S.",
            "external_url": "https://www.cbsnews.com/news/us-reports-cases-new-covid-variant-nb-1-8-1-behind-surge-china/",
            "upvotes": 14798,
            "date": "05/24/2025",
            "thumbnail": "https://assets1.cbsnewsstatic.com/hub/i/r/2022/07/02/f51bdaca-e805-497f-ac63-87512d4f26e8/thumbnail/1200x630g8/61033adab0efca6ba877823db762172b/GettyImages-457163942.jpg?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "Covid starting to look like patch notes",
                "If Nintendo reveals AC for the Switch 2, then it's time to panic.",
                "I'm starting to get sick of reality's recycled plot devices.",
                "[https://cdn.who.int/media/docs/default-source/documents/epp/tracking-sars-cov-2/23052025\\_nb.1.8.1\\_ire.pdf?sfvrsn=7b14df58\\_4](https://cdn.who.int/media/docs/default-source/documents/epp/tracking-sars-cov-2/23052025_nb.1.8.1_ire.pdf?sfvrsn=7b14df58_4)\n\nWHO TAG-VE Risk Evaluation for SARS-CoV-2 Variant Under Monitoring: NB.1.8.1\n\nExecutive Summary\n\nNB.1.8.1 has been designated a SARS-CoV-2 variant under monitoring (VUM) with increasing proportions\n\nglobally, while LP.8.1 is starting to decline. Considering the available evidence, the additional public health risk\n\nposed by NB.1.8.1 is evaluated as low at the global level. Currently approved COVID-19 vaccines are expected\n\nto remain effective to this variant against symptomatic and severe disease. Despite a concurrent increase in\n\ncases and hospitalizations in some countries where NB.1.8.1 is widespread, current data do not indicate that\n\nthis variant leads to more severe illness than other variants in circulation.",
                "Take a look at Covid.gov. They turned that site into a joke.",
                "Oh good, just in time for it to be against the law for most of us to get vaccinated against it.",
                "Covid dlc before gta6",
                "Trump and Covid, name a more iconic duo....",
                "Here we go again...\n\nSo glad we have the brainworm to keep us strong and healthy.\n\n/s",
                "Ah shit, here we go again"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Delivery driver finds way onto secured areas at O'Hare, drives miles before being spotted",
            "external_url": "https://www.cbsnews.com/chicago/news/delivery-driver-secured-areas-ohare/",
            "upvotes": 655,
            "date": "05/23/2025",
            "thumbnail": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/19/f668a728-ca0c-4e1d-8916-c2dff6b382df/thumbnail/1200x630/69a71b54505050287546ffcb4bfd611e/ohare-unauthorized-vehicle.png?v=48f078ae8a74a1412614b0db6f935e48",
            "top_comments": [
                "*A source told CBS News Chicago the delivery driver drove miles along the interior and restricted roads at O'Hare — potentially crossing runways — before someone spotted him from the air traffic control tower.*\n\nNot at all surprising. Getting confused and lost inside a major metropolitan airport is almost par for the course.",
                "Reminds me of a story from years ago about how some person's GPS app told them to use some back entrance that was for service vehicles. They ignored a bunch of signs and wound up on the tarmac.",
                "\"Request access to gate agent Jimmy, Doordash 322\"\n\n\"Doordash, left turn on Lima, hold Tango.\"\n\n\"Left Lima, hold Tango. Doordash 322\"\n\n\"Speaking of hold, did you hold the hot sauce as requested?\"\n\n\"Hold on... the associate did add hot sauce packets just in case but confirmed none in the pax load. Doordash 322\"\n\n\"Clear to deliver to Jimmy gate. Request diversion of hot sauce to control tower, Doordash. My lunch has no gust. I'll make it worth your while\"\n\n\"Deliver to Jimmy and hot sauce to ATC tower. Big tip. Doordash 322\"\n\n\"Safe travels\"",
                "Someone was watching this dude on the map going \"wtf, where is he going with my pizza\"",
                "The threat of the boss was greater than the threat of guys with guns.",
                "We all get lost at that dump. Including the planes.",
                "Michael that’s the lake",
                "Delivery drivers DAMN those folks james-bond their way into any place no matter what!"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Kim Kardashian’s robbers found guilty in Paris but won’t face prison time",
            "external_url": "https://apnews.com/article/kim-kardashian-heist-verdict-ff574b4b9427f7908ab32e3ee0008fef",
            "upvotes": 799,
            "date": "05/24/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                ">The chief judge, David De Pas, said that the defendants’ ages — six are in their 60s and 70s — and their health issues weighed on the court’s decision to impose sentences that he said “aren’t very severe.”\n\nThey're called the \"Grandpa Robbers\" over in France.",
                "Didn't this happen nearly 10 years ago?",
                "Why even have a trial then",
                "Not surprising, we have a big issue in France when it comes to Justice. It takes ages to have trials, the prison are overcrowded and in a terrible state and the sentences are a joke. There is another big trial taking place right now, a monster soctor raped 299 children when they were under anesthesia after he operated thwm. He wrote in a private diary describing everything in detail. \n\nHe is facing 20 years in prison plus a special measure to keep him in Prison if they judge he is at risk to do it again. 20 years. For 300 rapes. On minors. The guy is 74 years but still it's infuriating. \n\nAnd we have this issue for a lot of crimes.",
                "shes so brave. she wore like $2m in jewlery to the court appearance as a statement that.. er idk what the statement was but she's brave!",
                "Looks like a standard trial in Belgium were none of the criminals would face actual punishment 🤡🤷‍♂️🤷‍♂️\n\nSo ffing sad 🤨",
                "\"Any other circumstance would be different but...she's just the worst\"",
                "I thought the bodyguard was involved?",
                "So if you’re old you can rob someone and get away with it ? Cool to know !",
                "Chic grandpa robbers ? 🤣 /J"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Kim Jong Un watches as North Korea's newest warship falls off dry dock",
            "external_url": "https://www.nbcnews.com/world/asia/new-north-korean-warship-damaged-launch-ceremony-leader-kim-looks-rcna208425",
            "upvotes": 4400,
            "date": "05/23/2025",
            "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250430-kim-jong-un-mb-0757-9be9f5.jpg",
            "top_comments": [
                ">The 5,000-ton destroyer slid off a flatcar because of “inexperienced command and operational carelessness in the course of the launch,” according to the Korean Central News Agency, crushing parts of the bottom of the ship.\n\nI wonder if those guys are already dead.",
                "I want to giggle, but I realize someone will pay dearly for this...",
                "North Korea doesn't have a dedicated Dry Dock. North Korea has been side launching their ships and does not have a dedicated Dry Dock to do the extensive repairs the ship will need if it could be repaired at all.",
                "Kinda amusing until you realise a bunch of, most probably innocent, people are going to suffer for this, and that most of N.Korea's population is already horribly suffering, and they're spending their  money on pointless warships.",
                "Those responsible will be subject to anti-aircraft missiles.",
                "Multiple people will get executed for this",
                "Satellite image of the fallen warship:\n\nhttps://i.imgur.com/9Mdrqzc.png\n\nThey were side-launching the ship and it seems like one end slid while the other lagged behind or remained stationary, causing the whole thing to go caddywompus.",
                "This is the entirely predictable outcome of attempting to modernize a navy under Russian tutelage.\n\nhttps://www.twz.com/russias-cursed-carrier-is-finally-in-a-drydock-that-cant-sink\n\nhttp://www.hisutton.com/Russian-Floating-Dock-PD-19-Sinks.html",
                "Too bad he doesn't have a butt-hole, then at least he could give a shit.",
                "OMG. In NK they not only punish the perp but their family as well"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Killer whales left trapped in abandoned French marine park four months after closure.",
            "external_url": "https://www.standard.co.uk/news/world/orcas-trapped-french-marine-park-four-months-after-closure-b1227904.html",
            "upvotes": 23438,
            "date": "05/23/2025",
            "thumbnail": "https://static.standard.co.uk/2025/05/15/9/55/GettyImages-2191585917.jpg?width=1200&auto=webp&quality=75",
            "top_comments": [
                "Several sanctuaries have petitioned France to rescue the orcas. So far two, one in Japan and one in Canada, have been rejected for being too far to transport. There are also dolphins in another enclosure that need help too. They can not be released due to being bred in captivity.\n\n**Edit:** Courtesy of /u/MtnMoonMama here is a link to write President Macron about the situation if you feel so inclined. https://www.elysee.fr/en/contact/",
                "So they’re feeding them but can’t seem to find the resources to clean the enclosures? Sounds like rubbish excuses from those responsible. ",
                "Fucking Christ, that drone shot of them being in separate pools, is just fucking heart breaking. They've been like that for MONTHS! Fucking hell. The previous owners of that abandoned park need to be in jail for decades.",
                "This an intelligent animal that is huge and made for a life in the open ocean.\n\nIt must drive them absolutely fucking insane being confined to a limited space",
                "You can send Emmanuel Macron a direct message here\n\n\nhttps://www.elysee.fr/en/contact/\n\n\nEdit: fill out the form. Send it. They send you an email with a link you must click. Click the link to send. ",
                "Need to find a maladjusted orphan boy with a soft heart to solve this one. ",
                "Man, where's the Mexican space program when you need it.",
                "Keeping these animals who travel thousands of miles in the wild in little kiddie pools is straight up torture. Idk why we still allow this",
                "what the fucking shit, France?",
                "is it the price of long distance travel that is the problem? i can't imagine the stress of that trip would be more than what they are going through now"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Belgium’s future queen caught up in Harvard foreign student ban",
            "external_url": "https://www.theguardian.com/world/2025/may/23/belgium-future-queen-caught-up-harvard-foreign-student-ban",
            "upvotes": 17513,
            "date": "05/23/2025",
            "thumbnail": "https://i.guim.co.uk/img/media/d0fad91d174129333633af0dd7dae3047248878b/2016_115_1435_1148/master/1435.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5be6fbb9164c1aab0e2f3c34b6c77a0e",
            "top_comments": [
                "There will be lots of sons and daughters of prominent politicians and rich internationals impacted by this.  I bet there will be lots of exceptions made.",
                "Go read the DHS rational for this decision it’s insanity. They accuse Harvard of basically working with the CCP to undermine American interests",
                "I remember in his first term, POTUS wondered out loud about why people from “white” European counties aren’t immigrating to the US instead of from those “sh*thole” countries. He’s his own worst enemy in terms of promotion, self or otherwise.",
                "With her stature as future Queen, the Yales and Stanfords will be eager to offer her a spot. I have more sympathy for the normal people who got in purely on merit — they're the ones truly screwed.",
                "Yep she is a radical and a terrorist suspect.   Needs to have Trumps ICE treatment ….  No questions asked no due process like the rest of them … let’s see how he sugar coats this one.  Insane !",
                "Not calling her crown princess is weird.",
                "They forgot to exempt white girls",
                "Ha! This is so funny given how enamored Trump is with royals!",
                "im sorry, but what about university autonomy? how the fuck is this happening? what the fuck is wrong with the usa? baffling. absolutely baffling",
                "Harvard sues and judge has blocked Trump’s ban.\n\nhttps://www.nytimes.com/2025/05/23/us/harvard-sues-trump-international-students-garber.html"
            ],
            "aggregate_sentiment": null
        },
        {
            "category": "RISING",
            "title": "Justice Department reaches deal to allow Boeing to avoid prosecution over 737 Max crashes | AP News",
            "external_url": "https://apnews.com/article/boeing-justice-department-max-crashes-9f7250a2e2b400b31e19f2b261f78163",
            "upvotes": 5662,
            "date": "05/23/2025",
            "thumbnail": "No social preview available",
            "top_comments": [
                "Let me show you my shocked face: 😐",
                "2025 America: corporate crime is now legal and we're done pretending",
                "\"The Justice Department said in a court filing that it had reached an “agreement in principle” that will require the company to pay and invest more than $1.1 billion. In return, the department will dismiss the criminal case against the aircraft manufacturer. The deal still needs to be finalized.\" How much did they give Trump and his family?",
                "DOJ being compromised like this is INSANE. ",
                "The “Justice” department",
                "I'm a lawyer, and I'm no spring chicken on how the world works. Even so, I'm never any less disgusted and shocked that murder in this country is legal if you do it from a conference room. \n\n\nBoeing murdered 346 people for a marketing strategy. ",
                " Justice in Murica.  Bribe the Comrade Cheeto and walk away.",
                ">The Justice Department said in a court filing that it had reached an “agreement in principle” that will require the company to pay and invest more than $1.1 billion. In return, the department will dismiss the criminal case against the aircraft manufacturer.\n\nI wonder how much they had to pay this corrupt administration for this deal.",
                "I bet my left arm this is the 1.1 billion they're going to use to retrofit the Qatari jet. Un fucking believable...",
                "“Pay and invest 1.1 billion and extra 454 million for victim families”\n\nAka split up the 454 million amongst all of those families and buy 1.1 billion of trump’s shitcoin."
            ],
            "aggregate_sentiment": null
        }
    ],
    "last_updated": "05/24/2025 08:10:23 UTC"
}